[{"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319463436.8487599, "message": "\"Playfulness\" in learning... i.e. Serious Play", "group_id": 11791, "id": 2420578}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319463403.0430379, "message": "Games vs. Video Games", "group_id": 11791, "id": 2420570}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319463412.9734271, "message": "Game Theory vs. Using actual Games", "group_id": 11791, "id": 2420572}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319463702.375448, "message": "test", "group_id": 11791, "id": 2420625}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319463390.4864531, "message": "Based on our discussion in class Friday, there are a several sub-topics that we were grappling with:", "group_id": 11791, "id": 2420568}, {"user_id": 42678, "stars": [], "topic_id": 46980, "date_created": 1319481464.071784, "message": "I'm interested in games that may be fairly easy to implement and use.  I'm interested in examples and good implementation strategies.  I simply do not have that much experience with using games in a class setting, although I understand they could be effective.", "group_id": 11791, "id": 2422517}, {"user_id": 42164, "stars": [], "topic_id": 46980, "date_created": 1319490828.820863, "message": "I think video games could be implemented in some situations, with the \"right\" game, but I am actually more inspired by the motivational theories behind why people enjoy video games and how to harness those to implement in classrooms (especially online). For example: sense of accomplishment, sense of relatedness. I would like for the online class to have \"draw\" and invite students to check in frequently to see what's next in their learning. This also relates back to \"chunkability\" - designing with interruptions and variable-length (often short)-learning-periods in mind.", "group_id": 11791, "id": 2423680}, {"user_id": 42142, "stars": [], "topic_id": 46980, "date_created": 1319504016.784641, "message": "I think that actually using games in classes is a good idea. That said, using games (whether video or other wise) in certain classes are easier than others (as our group noted, language acquisition classes might have an easier time using games in their classes as opposed to English literature or even poetry classes). I agree with @hollin post that the theories behind gaming is what is important for our online or hybrid courses. I for one love the feeling of *finally* leveling-up in a game, and I think that concept could be implemented in a lot of courses. I would love to change my syllabus to reflect the experience points method of grading like the professor from IU did.", "group_id": 11791, "id": 2425438}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319549789.6301179, "message": "@hollin Lotti - I think you are right on with the motivational aspects of \"gaming,\" whether they be from actual games, or whether they are from game-like content presentation", "group_id": 11791, "id": 2429176}, {"user_id": 42164, "stars": [], "topic_id": 46980, "date_created": 1319583508.7365291, "message": "Arg - Convore just ate my post. Very dissapointing. So, here goes again:", "group_id": 11791, "id": 2433251}, {"user_id": 42164, "stars": [], "topic_id": 46980, "date_created": 1319583963.5588801, "message": "@elizabethkeller: for me, it's a sense of producing something and seeing the time and effort I spent result in a recognizable outcome (even if that's just checking off a box in a list). It makes me feel like I'm progressing and achiveing something. I find it de-motivating when I trudge through a never-ending task and all \"get nowhere\" dispite long hours and intense effort. So, while the points might not mean a lot to me, if they equated to goals of some sort, or achievements, count me in.                                                                                    Also, someone recently mentioned keeping a tally of points on a discussion board to motivate people to post more often and respond, etc. My first though was: oh no, please, not in med school :) - I'm not sure how it would backfire, but adding competition to an already highly competitive  environment makes me a little nervous (sometime it's crazy around here). But, I think in some situations this could be a lot of fun and work well to increase participation. Just thought I would share my reservations.", "group_id": 11791, "id": 2433328}, {"user_id": 41694, "stars": [], "topic_id": 46980, "date_created": 1319591340.9223599, "message": "@hollin I wonder if adding points that aren't tied to a gradebook would be sufficient. I remember hearing a presentation from General Electric about how they motivated people to cut back on their energy usage. They essentially installed an electric thermostat that let people know how they were doing compared to their neighbors. Initially they were concerned that if people realized that they were already doing better than their neighbors they wouldn't attempt to improve. The solution, according to their research? Putting a smiley face after the reading on the thermostat. Maybe adding more smiley faces or points, even ones that don't mean anything, would be a motivation.", "group_id": 11791, "id": 2434210}, {"user_id": 42142, "stars": [], "topic_id": 46980, "date_created": 1319634325.716677, "message": "@suttone2  i like your idea, but the students i've taught in previous semester would seriously question points that aren't attached to a gradebook. \nwhen i was an undergrad, i had a dramatic literature class that rewarded us for things rather than penalizing us for things. Example: we could get 100% in participation if we showed up to class. We didn't even need to participate in discussion (although most of us did, especially by mid semester, since we were there all the time). If we missed class, then that when attendance and participation was scored against us. I wonder if something like this could be used in an online/blended class. Idk, I'm really into rewards rather than demerits.", "group_id": 11791, "id": 2437764}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319637256.8171, "message": "Convore apparently ate one of my posts from yesterday as well... I had replied to Beth's post about \"leveling up\" in a game. I wonder for how many people this is a challenge that they would keep going at in a course. Even with a video game I often give up if the process to level up is too difficult. In an online course I think this sort of thing could be useful (ie. based on points, etc. maybe?) but we definitely need to make sure that there are proper scaffolds -- ideally adaptive scaffolding that adjusts to learner knowledge...", "group_id": 11791, "id": 2438126}, {"user_id": 42164, "stars": [], "topic_id": 46980, "date_created": 1319723394.9310319, "message": "@suttone2 - I think that GE story is great, and I agree that small rewards can make a big difference. It reminds me of stickers in elementary school - people stopped using them as I got older, but I'm not sure they wouldn't still have had some effect - even if it's just a \"you're on the right track\" feeling. Sticker widget?", "group_id": 11791, "id": 2446245}, {"user_id": 42846, "stars": [], "topic_id": 46980, "date_created": 1319735126.8178589, "message": "Seems like games would be used best to teach younger students. The ideas that upper level students work with are generally more complex than the concepts younger students need to be introduced to. As a result I think it's more likely to program and create a successful learning game for a younger crowd because the content would be more straight forward.That's not to say that I don't think it's possible to create a learning game for an adult, but I think it'd take more planing.", "group_id": 11791, "id": 2447146}, {"user_id": 42846, "stars": [], "topic_id": 46980, "date_created": 1319735137.501127, "message": "Seems like games would be used best to teach younger students. The ideas that upper level students work with are generally more complex than the concepts younger students need to be introduced to. As a result I think it's more likely to program and create a successful learning game for a younger crowd.That's not to say that I don't think it's possible to create a learning game for an adult, but I think it'd take more planing.", "group_id": 11791, "id": 2447148}, {"user_id": 41585, "stars": [], "topic_id": 46980, "date_created": 1319737588.3360231, "message": "I agree with the idea that, while we may not be able to supplant classroom activities with video games wholesale, we may be to implement some of their elements. I really like the idea of \"sense of accomplishment.\" I am not a gamer by any stretch, but was challenged this summer to try World of Warcraft on purely a scholarly basis ;-). What I found more than anything, was that WoW had a great spontaneous reward system that begged me to continue playing (and subsequently learning a new literacy). I have no doubt that this sort of idea could be moved into the classroom.  Too often, I feel, we fall into a rigid structure of assessment. Why not, occasionally through the semester, reward students who are doing exceptional work, possibly spurring others to put the pedal to the metal.", "group_id": 11791, "id": 2447426}, {"user_id": 41585, "stars": [], "topic_id": 46980, "date_created": 1319737762.2899301, "message": "I do think, though, that one element of games -- voluntary participation -- cannot necessarily be recreated in classroom settings. The minute we make something compulsory, I feel, we take a pretty major bite out of the freedom and safety associated with games. So, my question unto you all is this: how do we recreate some of these elements in our class with the understanding that the compulsory nature of coursework may interfere? Do we press on? Do we make game-like activities optional?", "group_id": 11791, "id": 2447437}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319744656.2811141, "message": "@groendy4 Interesting point Ryan -- I think you are right that the planning is key, but I also think that opens up more possibilities for older students. By using large-scale games/simulations that replicate real-world issues we can actually engage them in some of the really high-level problem solving that we want them to do.", "group_id": 11791, "id": 2448155}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319744713.2346101, "message": "@miketardiff Great point Mike! -- \"how do we recreate some of these elements in our class with the understanding that the compulsory nature of coursework may interfere? Do we press on? Do we make game-like activities optional?\"", "group_id": 11791, "id": 2448164}, {"user_id": 41695, "stars": [], "topic_id": 46980, "date_created": 1319744540.999768, "message": "@hollin I love the \"sticker widget\" idea!", "group_id": 11791, "id": 2448143}, {"user_id": 42190, "stars": [], "topic_id": 46980, "date_created": 1319802962.126081, "message": "In response to Mike's concern that we will lose the voluntary aspect of games in the classroom: I think it's whether the person thinks the game is fun and worthwhile that will motivate their playing and learning from it. We all loved games in the classroom while growing up (whether kickball or jeopardy was more your cup of tea), even though they were mandatory activities. Heck, for some WoW may be something more than completely voluntary :)", "group_id": 11791, "id": 2453324}, {"user_id": 42190, "stars": [], "topic_id": 46980, "date_created": 1319803673.455514, "message": "The main barrier to using actual games in a classroom is that it's very work intensive to create your own content. While the amount of work it takes to create a game is decreasing somewhat (one person or small teams can create the kind of old school games we saw in the 80s and 90s), studios usually have teams of hundreds of professionals working full time to create the kind of polished commercial video games that we have in mind like Civilization and World of Warcraft. So if there is no game that fits your topic lesson already, creating even a very basic video game requires more time and training than most academics have. I can imagine studios producing \"good\" educational games by working with folks from higher ed if they imagined it would profitable (and perhaps that the product would stay current for more than a few years), but right now the medium is young and has some high technological barriers. I mean, video/film use wasn't widespread in the classroom until the VCR was developed--producing and playing video was just not very accessible to educators before then.", "group_id": 11791, "id": 2453363}, {"user_id": 42505, "stars": [], "topic_id": 46980, "date_created": 1320078130.914103, "message": "On the issue of the compulsory usage: I agree with Mike in that once you make something required, it will totally change the dynamic -- even if it is an activity the student loves in the first place.  Don't we all feel this to some degree in our own fields?  For instance, I LOVE reading novels, but it still feels like work when it's required.  Granted, it's work that I enjoy, but it doesn't have the same magic as picking up a novel in downtime and digging in.  I think the same applies with video games: students who already like them won't have the same connection to compulsory play.  That doesn't invalidate the process entirely; after all, formal education is a system of coercion and evaluation, so finding ways to make it seem more \"natural\" could be worthwhile.", "group_id": 11791, "id": 2476370}, {"user_id": 42505, "stars": [], "topic_id": 46980, "date_created": 1320078290.645431, "message": "Are there any fun educational games?  I grew up in the generation of 8-bit and 16-bit systems, and I know that I loathed educational games at the time.  My relatives who were trying to be more conscious would buy NES games for gifts with the caveat that they were educational -- and I hated all of my gifts as a result!  And pulling them out nearly two decades later hasn't made them any better.  Mario Is Missing just isn't in the same arena as SMB3, for example.  Are there games with education content, in addition to processes, that are actually fun?", "group_id": 11791, "id": 2476384}, {"user_id": 43104, "stars": [], "topic_id": 46980, "date_created": 1320419872.4315889, "message": "I think that using games for assessment sounds like a good idea.  Motivation is important for students, and making that motivation fun would be important (although the compulsory usage issue that @grancha brought up might throw a wrench into that).  My concern is how to incorporate content into the games.  As an instructor, I want to focus most of my energy on developing content and making sure that my students are achieving the educational outcomes of the class.  Lotti brought up the idea that adding more competition and pressure to an already pressure-filled life for students might not be as productive as we've been framing it.  Are we assuming that all students will find games fun?", "group_id": 11791, "id": 2505980}]