[{"user_id": 11626, "stars": [], "topic_id": 43033, "date_created": 1312096683.0890999, "message": "Welcome to the \"False-Flag Friday\" edition of SCMLA's News Digest!\r\n\r\n\r\nReports that Breivik carried \"walkie talkie\" during rampage\r\nWake Up From Your Slumber\r\nJuly 29, 2011\r\n\r\nNorwegian investigators said they would question Anders Behring Breivik again this week amid what they said was a flood of new leads relating to his killing spree as police ended a search for his victims on Utoeya island. Friday's interrogation will be only the second interview after police quizzed Breivik on Saturday, the morning after his shooting rampage on Utoeya island and the bomb blast in Oslo that killed 76 people. As questions grew over claims he had carried a walkie-talkie during his rampage and his own assertion that he had accomplices, the country's chief prosecutor also said the 32-year old suspect would not face trial until 2012. But later in the report, Norwegian police seem to downplay the possibility of other players. Not sure whether these quotes are from before or after the leads about the walkie talkie or Brievek's latest admission that he has accomplices.\r\nhttp://wakeupfromyourslumber.com/blog/qrswave/reports-breivik-carried-walkie-talkie-during-rampage\r\n\r\nMEDIA FAIL: Foxnews Uses Norway Attacks To Push Homegrown Terror Myth Inside America (video)\r\nFederal Jack\r\nJuly 29, 2011\r\n\r\nhttp://www.youtube.com/watch?v=BRXCbz4v6Oc\r\n\r\nMore Christian terrorism? Texas Planned Parenthood fire bombed\r\nAlexander Higgins\r\nJuly 29, 2011\r\n\r\nRight Wing Christian extremist have drawn immediate blame for a reported fire bombing of a Texas Planned Parenthood. A Planned Parenthood clinic in Texas has been firebombed, according to reports. Fingers are immediately being pointed at Christian terrorists for the attack. With domestic terrorists gaining more focus from the Department of Homeland Security, the attacks will be added to the list of justifications for a further crack down on the civil liberties of American citizens.\r\nhttp://blog.alexanderhiggins.com/2011/07/29/christian-terrorism-texas-planned-parenthood-fire-bombed-45061\r\n\r\nNorway Attacks: The Worrying Rise of the Lone-Wolf Terrorist\r\nTime.com\r\nJuly 29, 2011\r\n\r\nAs investigators dig deeper into Anders Behring Breivik's twisted world, they are coming to the conclusion that the Norwegian right-wing extremist most likely acted alone. To many, it may come as a relief that Breivik's claims of being just one of several killer cells in some wider conspiracy for global domination turns out to be nothing but a web of deception spun by a brutal killer. But investigators and counterterrorism officials are not relieved. They fear that Breivik represents a new, potentially deadly paradigm shift in the world of extremist violence.\r\nhttp://old.news.yahoo.com/s/time/20110729/wl_time/08599208565800\r\n\r\nU.S. Treasury Pushes War Propaganda Claim al-Qaeda and Iran in Cahoots\r\nInfowars.com\r\nJuly 29, 2011\r\n\r\nIn the lead-up to the invasion of Iraq, the Bush neocons insisted Saddam Hussein was working with and sheltering al-Qaeda. The U.S. claims Iran is harboring al-Qaeda’s Saif al-Adel. In December of 2001, then vice president Dick Cheney said Saddam Hussein had trained al-Qaeda on the use of chemical and biological weapons. Cheney said there was a connection between Mohammed Atta, supposedly the 9/11 lead hijacker, and Iraq. The Bush neocons, led by Cheney and then Sec. Def. Rumsfeld, “stovepiped” misleading and fabricated information about an al-Qaeda link to Iraq to the New York Times and the corporate media. Despite the fact the supposed link was discredited, Cheney reasserted it in 2007. It was disputed by the CIA and the 9/11 commission. The imagined terror link became part of the narrative used to justify the invasion of Iraq that ultimately killed over a million people. The Obama administration is following in the footsteps of the Bush administration. On Thursday, Obama’s Treasury Department accused Iran of entering into a “secret deal” with al-Qaeda. David S. Cohen said Iran entered a “secret deal with al-Qaida allowing it to funnel funds and operatives through its territory.” Like Cheney, Rumsfeld, and the neocons, Cohen did not provide any evidence to back up his claim.\r\nhttp://www.infowars.com/u-s-treasury-pushes-war-propaganda-claim-al-qaeda-and-iran-in-cahoots\r\n\r\nFormer officials: Al-Qaida still likely to use WMD\r\nAssociated Press\r\nJuly 28, 2011\r\n\r\nASPEN, Colo. – A chemical or biological attack by al-Qaida and its offshoots remains a threat, despite the killing of terror leader Osama bin Laden, top former U.S. counterterrorist officials said Thursday. \"We still have pockets of al-Qaida around the world who see this as a key way to fight us,\" especially the offshoot in Yemen, Mike Leiter, the just-retired director of the National Counterterrorism Center, told an audience at the Aspen Security Forum. \"The potential threat from al-Qaida in the Arabian Peninsula is very real.\" Leiter said the new breed of terrorists understands that killing a few Americans can cause as much fear as the massive plots bin Laden backed. \"The most likely ... are simple forms of chemical or biological weapons\" rather than a nuclear attack, Leiter said, using the poison ricin as an example of something that's easily made. \"Is it going to kill many people? No. Is it going to scare people? Yes,\" he said.\r\nhttp://old.news.yahoo.com/s/ap/20110728/ap_on_go_ot/us_al_qaida_wmd\r\n\r\nStudy: Terror cult's persistence key to WMD attack\r\nAssociated Press\r\nJuly 28, 2011\r\n\r\nWASHINGTON – Experts argue over how hard it is for terrorists to make weapons of mass destruction, but a new study of the doomsday cult that carried out the Tokyo subway nerve gas attack says that even seemingly marginal groups can succeed with persistence and luck. A report on the Aum Shinrikyo cult by ex-Navy Secretary Richard Danzig and colleagues at the Center for a New Security describes the cult's often bumbling efforts to make biological and chemical weapons in the 1980s and 1990s. But the report says that the cult's persistence was key to its success in making sarin nerve agent, which it used in its deadly 1995 attack on Tokyo commuters that killed 13 and injured more than 6,000.\r\nhttp://old.news.yahoo.com/s/ap/20110728/ap_on_re_us/us_lessons_from_japan_cult\r\n\r\nOfficial: Soldier said he wanted to attack Fort Hood troops\r\nCNN\r\nJuly 28, 2011\r\n\r\nKilleen, Texas (CNN) -- An AWOL Muslim American Army private arrested near Fort Hood has told investigators that he wanted to attack fellow soldiers at the military post, the police chief in Killeen, Texas, said Thursday. \"Military personnel were a target of this suspect,\" Chief Dennis Baldwin told reporters about Pfc. Naser Jason Abdo, who is expected to face federal charges. Baldwin said Abdo, who was arrested Wednesday, had no accomplices, \"as far as I know.\" He added, \"We are not aware of any additional threats to the safety of our community.\"\r\nhttp://www.cnn.com/2011/CRIME/07/28/fort.hood.arrest\r\n\r\nObama to Approve ‘Al-Qaeda Embassy’ in Washington\r\nState Department sympathetic to recognizing rebel terrorists who killed U.S. troops\r\nInfowars.com\r\nJuly 28, 2011\r\n\r\nThe Obama administration is preparing to follow Britain in recognizing the rebel National Transitional Council as the official government of Libya by approving an embassy in Washington DC, which given the fact that the rebel army is spearheaded by Al-Qaeda militants who have killed U.S. troops would equate to Obama handing terrorists a diplomatic outpost on U.S. soil. “The United States said Wednesday it was reviewing a request by Libya’s rebels to open an embassy in Washington, following Britain which expelled diplomats from Moamer Kadhafi’s regime,” reports AFP. State Department spokesman Mark Toner told reporters that the U.S. would be “sympathetic” to the request, after which rebel supporters unfurled their flag outside the embassy where Gaddafi’s regime is still in control. The United States formally recognized the rebel council as the country’s legitimate government earlier this month, despite the fact that the rebel army is spearheaded by Al-Qaeda terrorists who are supposedly the target of a multi-decade “war on terror” that is now in its tenth year and has cost the U.S. a staggering $5.4 trillion since 9/11.\r\nhttp://www.infowars.com/obama-to-approve-al-qaeda-embassy-in-washington\r\n\r\nMedia Dwells on Alleged Second Fort Hood Attack Following Norway Carnage\r\nInfowars.com\r\nJuly 28, 2011\r\n\r\nLess than a week after the bombing and shooting in Norway, the corporate media is reporting that a Muslim possessing weapons and explosives was apprehended near Fort Hood, Texas, the site of a deadly shooting attributed to Major Nidal Hasan in 2009. Jason Abdo Nassar, an AWOL soldier from Fort Campbell, Kentucky, was arrested on Wednesday in the city of Killeen, Texas, according to the FBI. The BBC reports Nassar attempted to buy guns near the base and was found with bomb-making materials. CBS adds that he asked gun store employee how to make a bomb. He allegedly told police about a plan to kill and injure people. “Whatever threat Mr. Nassar posed yesterday has been eliminated and mitigated, and there was nothing to indicate he was acting with anyone else,” said Eric Vasys, a FBI special agent in San Antonio. The establishment media is portraying the story as a foiled terror attack. Fox News posted an “exclusive” report on its website today stating the soldier raised “security concerns” and was specifically arrested in a plot to attack Ford Hood. Nassar, however, does not fit the stereotypical description of a Muslim terrorist.\r\nhttp://www.infowars.com/media-dwells-on-alleged-second-fort-hood-attack-following-norway-carnage\r\n\r\nJackson Lee: Let’s ‘Have a Hearing on Right-Wing Extremists, Ideologues’\r\nCNS News\r\nJuly 28, 2011\r\n\r\nAt a hearing of the House Committee on Homeland Security today about the radicalization of young Somali American Muslims by the al-Shabaab terrorist group, Rep. Sheila Jackson Lee (D-Texas) said the committee should hold a hearing on “right-wing extremists” in the United States. Jackson Lee used much of her allotted five minutes to question panelists with expertise on radicalization about the alleged hacking into telephones of 9-11 victims by the now-closed News of the World tabloid in England. “I would add to that, that I would like to have a hearing on right-wing extremists, ideologues who advocate violence and advocate, in essence, the terrorizing of certain groups,” Jackson Lee said. Before Jackson Lee was recognized by Rep. Peter King (R-N.Y.), the committee chairman, the panel of witnesses gave details about how al-Shabaab, an affiliate of al-Qaeda, is recruiting young Somali men who live in the United States to travel to that African nation to participate  in terrorist training camps.\r\nhttp://www.cnsnews.com/news/article/jackson-lee-radical-islam-hearing-lets-h\r\n\r\nSpec ops chief warns of al-Qaida 2.0\r\nAssociated Press\r\nJuly 28, 2011\r\n\r\nASPEN, Colo. (AP) -- The top commander of U.S. special operations forces said Wednesday that Osama bin Laden's al-Qaida is bloodied and \"nearing its end,\" but he warned the next generation of militants could keep special operations fighting for a decade to come. Navy SEAL Adm. Eric T. Olson described the killing of bin Laden by a special operations raid on May 2 as a near-killing blow for what he called \"al-Qaida 1.0,\" as created by bin Laden and led from his hideout in Pakistan. Olson said the group had already lost steam because of the revolts of the Arab Spring, which proved the Muslim world did not need al-Qaida to bring down governments, from Tunisia to Egypt. \"I think the death of bin Laden was an uppercut to the jaw,\" Olson told a packed crowd, opening the Aspen Security Forum. \"It just knocked them on their heels.\"\r\nhttp://hosted.ap.org/dynamic/stories/U/US_SPECIAL_OPERATIONS_AL_QAIDA?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2011-07-28-02-24-09\r\n\r\nFort Hood Suspect Mentions al Qaeda Cleric Believed to Have Inspired Previous Attack\r\nABC News\r\nJuly 28, 2011\r\n\r\nA U.S. serviceman is in custody after he allegedly admitted he was planning an attack on his fellow servicemen at the U.S. Army base at Fort Hood, Texas, the same base where 13 people were killed in a 2009 terror attack. U.S. officials told ABC News an AWOL soldier, identified by the FBI as a Private First Class Naser Jason Abdo, was arrested Wednesday after making a purchase at Guns Galore in Killeen, Texas, the same ammunition store where Maj. Nidal Hasan purchased the weapons he allegedly used to gun down 13 people and wound 32 others on Nov. 5, 2009. According to one senior official, Abdo has also mentioned the name of high profile al Qaeda cleric Anwar al-Awlaki -- the same man investigators said inspired the previous Fort Hood attack along with other potentially deadly terror plots in the U.S. -- though no direct link between Abdo and Awlaki has been found. Abdo, 21, allegedly told law enforcement he wanted to \"get even\" and was targeting Ft. Hood because of the previous attack there, according to law enforcement documents obtained by ABC News. The documents say he did not plan to attack the base itself, but instead planned to plant two bombs at a nearby restaurant popular with Ft. Hood personnel.\r\nhttp://abcnews.go.com/Blotter/fort-hood-plot-awol-us-serviceman-arrested/story?id=14179096\r\n\r\nFBI says bomb-making materials found in motel room of AWOL soldier arrested near Fort Hood\r\nAssociated Press\r\nJuly 28, 2011\r\n\r\nKILLEEN, Texas — FBI says bomb-making materials found in motel room of AWOL soldier arrested near Fort Hood\r\nhttp://www.washingtonpost.com/national/fbi-says-bomb-making-materials-found-in-motel-room-of-awol-soldier-arrested-near-fort-hood/2011/07/28/gIQAZ8P4eI_story.html\r\n\r\nJudge: U.S. must show 'good cause' to revise anthrax filing\r\nMcClatchy Newspapers\r\nJuly 27, 2011\r\n\r\nWASHINGTON — A federal judge has blocked, at least temporarily, a Justice Department attempt to back away from court admissions that appeared to undercut previous FBI assertions that an Army researcher was responsible for the 2001 anthrax attacks. In an order issued Monday, U.S. District Judge Daniel Hurley of West Palm Beach, Fla., said the government must \"show good cause\" before he will allow it to change the original filing, which lawyers for the department's Civil Division made in an 8-year-old case brought by the family of one of the five victims. That filing asserted that Bruce Ivins, who the FBI alleges manufactured the anthrax in his government lab, did not have access in the lab to the special equipment needed to make the deadly powder. The Justice Department wants to revise the filing to say that Ivins did have access to the equipment elsewhere at the U.S. Army bio-weapons facility in Frederick, Md., where he worked.\r\nhttp://www.mcclatchydc.com/2011/07/27/118494/judge-says-us-must-show-good-cause.html\r\n\r\nAlan Watt: Oslo Gunman’s Massacre, A Design Ritual of Mind Control\r\nThe Alex Jones Channel\r\nJuly 27, 2011\r\n\r\nAlex also talks with author, researcher and radio talk show host Alan Watt. Alex brings you the latest on the Norway shooting and talks about the mind control and Knights of Templar angles on the bombing/shooting incident.\r\nhttp://www.infowars.com/alan-watt-oslo-gunmans-massacre-a-design-ritual-of-mind-control\r\n\r\nCitizen Spies, Brutal Torture Foreshadow the Domestic War on Terror\r\nInfowars.com\r\nJuly 27, 2011\r\n\r\nAn innocent European, who was sold to U.S. military by a citizen spy, spent nearly five years in Guantanamo Bay prison without charges exposes the brutality of torture. With the DHS anti-terror apparatus now turned inward, do American citizens face the same treatment? Martin Luther King Jr. wisely proclaimed “Injustice anywhere is a threat to justice everywhere.” Murat Kurnaz, a German-born Turkish citizen, describes in the video below his chilling story of torture under United States custody. Kurnaz was rounded up in Pakistan at the height of the U.S. invasion of Afghanistan in 2001 when locals sold him to the U.S. military for $3000, the bounty paid to citizen spies for “terror suspects.” With the Department of Homeland Security ramping up its own citizen spy program, can we expect the same treatment in America? Working for a peaceful NGO, Kurnaz was detained on his way to return home to Germany. Over the next five years he was repeatedly tortured by the United States with no charges ever filed. According to Amnesty USA, “his 2006 release was prompted by a personal plea by German Chancellor Angela Merkel to President George W. Bush even though official documents show that U.S. and German authorities had determined in 2002 that he was innocent.”\r\nhttp://www.infowars.com/citizen-spies-brutal-torture-foreshadow-the-domestic-war-on-terror\r\n\r\nNorway attacks: 'No proof of UK link to Breivik'\r\nBBC\r\nJuly 27, 2011\r\n\r\nNorway's domestic intelligence chief has told the BBC no proof has yet been found to link Anders Behring Breivik to right-wing extremists in the UK. Mr Breivik, who admits Friday's bomb and gun attacks which killed at least 76 people, has written of meeting such groups nine years ago. But intelligence chief Janne Kristiansen said she believed he had acted completely on his own. Norwegian police have begun releasing names of victims. They published four names, with more expected to follow later on Wednesday; others have been identified in Norwegian media. The bomb in the capital Oslo targeted buildings connected to Norway's Labour government, while the mass shooting occurred at an annual Labour youth camp on a small island, Utoeya. Mr Breivik has said he had wanted to inflict maximum damage on the party, which he accuses of failing the country on immigration, according to his lawyer. The massacre prompted up to a quarter of a million people to take to the streets of Oslo on Monday to commemorate the victims. A Norwegian cabinet minister, Administration and Church Affairs Minister Rigmor Aasrud, will make a symbolic return on Wednesday to her bomb-damaged office, Reuters news agency reports. 'Calculating and evil' \"I can tell you, at this moment in time, we don't have evidence or we don't have indications that he has been part of a broader movement or that he has been in connection with other cells or that there are other cells,\" said Ms Kristiansen, who heads the Norwegian Police Security Service.\r\nhttp://www.bbc.co.uk/news/world-europe-14303363\r\n\r\nIn global travel alert, US says bin Laden death raises risk of anti-American violence overseas\r\nAssociated Press\r\nJuly 26, 2011\r\n\r\nWASHINGTON - The Obama administration says Osama bin Laden's death has raised the risk of anti-American violence worldwide. The State Department said in a global travel warning Tuesday that Americans should take precaution and maintain vigilance about terrorist threats, demonstrations and the possibility of violence against U.S. citizens. It said al-Qaida and other groups are planning terrorist attacks against U.S. interests in Europe, Asia, Africa and Middle East. The department said attacks may be in the form of suicide operations, assassinations, kidnappings, hijackings and bombings. Americans should consider the potential for attacks on transportation systems and tourist infrastructure, it said. It noted such attacks in Moscow, London, Madrid, Glasgow and New York in recent years. The department also warned Americans to avoid demonstrations in the Arab world because they can turn violent.\r\nhttp://www.startribune.com/nation/126191453.html\r\n\r\nOperation “Castaway: Second ATF Gun-Running Scandal Exposed in…… Honduras\r\nDeadline Live\r\nJuly 26, 2011\r\n\r\nTwo reporters now claim there is a second version of “Fast and Furious” – only the new one is called “Operation Castaway”.  Just like the first one, it’s also being run by the Bureau of Alcohol, Tobacco, Firearms and Explosives (“ATF”) – but instead of being located in Phoenix,Arizona, it’s now headquartered in Tampa, Florida.  And instead of walking guns into Mexico, this new version is walking illegal firearms into the Honduras!\r\nhttp://sipseystreetirregulars.blogspot.com/2011/07/breaking-news-source-claims-atfs-tampa.html\r\nThough the guns procured in “Operation Castaway” were initially “walked” to the Honduras, those weapons didn’t stay there. Instead, they were “smuggled through Honduras and other Central and South American countries before being used in violent crimes in Mexico and other countries in the region. A number of the firearms trafficked by the defendants in Operation Castaway have been linked to violent crimes around the world.” This new version was reported on last September 2010 by Brian Albritton, the US Attorney for the Middle District of Florida. At that time, he proudly announced the assistance of Virginia O’Brien, Special Agent in Charge of the central and northern Florida Bureau of ATF operations. Though Albritton may claim ignorance of what those guns were doing, poor old O’Brien hasn’t that luxury. You see, before she transferred to Florida, she first worked as an ATF agent in Phoenix, Arizona (you know, the city that ran “Fast and Furious”). And by strange coincidence, her new city of Tampa, Florida is “walking” guns to Honduras by using the “same failed strategy as the Phoenix Field Division’s”. It gets worse. Apparently O’Brien has left a trail of emails in which she evidently tried to cover up her deeds by advising others they didn’t have to report their “walked guns” on the technicality that Tampa Field Division isn’t part of the Southwest Border or Project Gunrunner. Those emails could be a teensy problem; and, by golly, the “first person source” informing the reporters seems to agree. As that individual crudely phrases it, O’Brien “is sh*tting herself trying to cover it up.”\r\nhttp://deadlinelive.info/2011/07/26/operation-“castaway-second-atf-gun-running-scandal-exposed-in……-honduras\r\n\r\nBreivik's injected his dum-dum bullets with poison to make them deadlier\r\nDaily Mail\r\nJuly 26, 2011\r\n\r\nAnders Breivik could have used 'chemically enhanced' ammunition to ensure every shot was deadly, police believe. In his disturbing 'manifesto' he talked of plans to put liquid nicotine in his bullets. If the blast did not kill victims outright, the nicotine would go on to poison them. It was already known that Breivik used 'dum-dum' bullets during his killing spree – the expanding round has a hollow point which leaves a large exit wound after causing horrific wounds.\r\nhttp://www.dailymail.co.uk/news/article-2018748/Norway-massacre-Anders-Behring-Breivik-Dum-dum-bullets-injected-poision.html\r\n\r\nNorway police detonate explosives at Breivik's farm\r\nReuters\r\nJuly 26, 2011\r\n\r\nOSLO — Norwegian police detonated on Tuesday night a cache of explosives found at a farm leased by Anders Behring Breivik, who killed 76 people last week. \"Explosives were found at the farm,\" police prosecutor Trine Dyngeland told Reuters. \"The police carried out a controlled detonation of the explosives.\" She said no one was hurt in the controlled blast, at Rena, about 160 kms (100 miles) north of Oslo. She declined to estimate what quantities were found. Police believe that Breivik made his bomb using fertilizer as a main ingredient. He bought fertilizer under the cover that he was a farmer.\r\nhttp://www.msnbc.msn.com/id/43855849\r\n\r\nIssa: Obama admin intimidating witnesses in ATF gun probe\r\nWashington Times\r\nJuly 26, 2011\r\n\r\n(WashTimes) – The Obama administration sought to intimidate witnesses into not testifying to Congress on Tuesday about whether ATF knowingly allowed weapons, including assault rifles, to be “walked” into Mexico, the chairman of a House committee investigating the program said in an interview Monday. House Oversight and Government Reform Committee Chairman Darrell E. Issa, California Republican, said at least two scheduled witnesses expected to be asked about a controversial weapons investigation known as “Fast and Furious”received warning letters from the Bureau of Alcohol, Tobacco, Firearms and Explosives to limit their testimony. Mr. Issa’s committee is set to hear testimony from six current or former ATF employees, including agents and attaches assigned to the bureau’s offices in Mexico, about the operation — in which, federal agents say, they were told to stand down and watch as guns flowed from U.S. dealers in Arizona to violent criminals and drug cartels in Mexico. The six-term lawmaker aired his concerns about the program in a wide-ranging interview with reporters and editors at The Washington Times on Monday.\r\nhttp://dprogram.net/2011/07/26/issa-obama-admin-intimidating-witnesses-in-atf-gun-probe\r\n\r\nEU Exploits Norway Massacre to Stifle Dissent\r\nEuropean Union to launch “extremist” early warning system, despite the fact that EU treats legitimate criticism of its own institution as “extremism”\r\nInfowars.com\r\nJuly 26, 2011\r\n\r\nWasting little time in exploiting the freshly dead bodies of dozens of Norwegian teenagers to push its draconian agenda, the European Union has swiftly announced that it plans to set up an “early warning system” to combat “extremism,” the problem being that the EU treats legitimate criticism of its own corrupt institution as extremist. “The European Commission is building a security system to issue early warnings on threats of extremism, xenophobia and other forms of radicalism, EC spokesman Michele Cercone said on Tuesday,” reports RIA Novosti. EU officials also met on Monday in a bid to “curb sales of firearms” to law-abiding citizens, despite the fact that it was Norway’s policy on not allowing police instant access to firearms that contributed to the scale of last week’s attack. Eurosceptisim is on the rise across the contintent, which is why the neo-liberal elite are busy implying that people who oppose being ruled by an unelected, unaccountable, Soviet-style buearacratic tyranny are in league with Norwegian mass murderer Anders Behring Breivik.\r\nhttp://www.infowars.com/eu-exploits-norway-massacre-to-stifle-dissent\r\n\r\nFormer Ambassador Links Tea Party to Norway Killer\r\nInfowars.com\r\nJuly 26, 2011\r\n\r\nCraig Murray, a former British ambassador to Uzbekistan, is attempting to link up Anders Behring Breivik &  the American Tea Party. Murray notes the fact Breivik posted comments on the blog of the American neocon and Islamophobe Pamela Geller. Breivik, we are told, hates Muslims, although we really don’t know much about the alleged killer outside of what the Norwegian government has told us. His first court appearance was closed to the media. Next, Murray points out that Geller addressed the Tennessee Tea Party convention. “Geller has been actively promoting links between the Tea Party and the English Defense League. Geller states on her website that she had been in Oslo to attend a pro-Israel rally. It would be interesting to know whether Anders Behring Breivik was also on that rally,” Murray writes on his blog. “We are told that Behring Breivik acted alone. In truth he had ideological and communication links with organized far right networks every bit as solid as the comparable connections of Islamic terrorists,” he adds. It should be pointed out that Murray is talking about the establishment Republican Tea Party, not the original Tea Party created by Libertarians and endorsed by Ron Paul that was hijacked and destroyed from within. No self-respecting Libertarian would have anything to do with Geller and the warmongering neocons.\r\nhttp://www.infowars.com/blogger-links-tea-party-to-norway-killer\r\n\r\nGunman Conspired With “Business and Political Leaders” Before Massacre\r\n﻿Breivik marched with heavily MI5-infiltrated English Defence League in London﻿\r\nInfowars.com\r\nJuly 26, 2011\r\n\r\nAnders Behring Breivik said he conspired with “business and political leaders” in London years before he set about planning last week’s massacre, an intruiging connection given the fact that the gunman’s manifesto is datelined “London 2011, suggesting a clear connection to the capital as evidence emerges of a wider plot. “In the manuscript Breivik describes his “mentor” as an Englishman he identifies as “Richard”, and says his journey into violent extremism began at a small meeting in London in 2002 where a group of like-minded extremists met to “reform” the Knights Templar Europe, a military group whose purpose was “to seize political and military control of western European countries and implement a cultural conservative political agenda,” reports the Guardian. “In his manifesto Breivik said the gathering in London was “not a stereotypical ‘rightwing’ meeting full of underprivileged, racist skinheads with a short temper”. Instead, he claimed those present were successful entrepreneurs, “business or political leaders, some with families, most Christian conservatives, but also some agnostics and even atheists”. The gunman said that the participants of the meeting came from all over Europe and that he was first put into contact with them by a “Serbian crusader commander”. Breivik’s conenctions with London – he lived there as a child when his father was working at the Norwegian embassy – are clearly a cornerstone of his plot. Indeed, as Mark Steyn writes for the National Review Online, the gunman’s manifesto is largely concerned with Britain and America. “The entire document is strangely anglocentric – in among the citations of NR and The Washington Times, there’s not a lot about Norway.” The manifesto, signed by the killer as “Andrew Berwick” (an anglicised version of his name), is datelined “London, 2011,” clearly indicating Breivik was in the English capital before his rampage, although the media have asserted otherwise without expalining why Breivik would deliberately place such an error in his own screed.\r\nhttp://www.infowars.com/gunman-conspired-with-business-and-political-leaders-before-massacre\r\n\r\nAbsurd coverage of the Norwegian tragedy\r\nInfowars.com\r\nJuly 26, 2011\r\n\r\nAs the days go by following the horrific slaughter at Utoya and the bombing in Oslo, the information has only become more confused and self-contradictory. The media began with the baseless conjecture that it was an al Qaeda-affiliated group behind the attacks. The only evidence presented was the fact that threats had been made against Norway in the past and of course the highly reliable source that is jihadist forums. Wired’s Danger Room ran with a story that only proposed Muslim terrorists as the culprits. Despite the same amount of evidence pointing to other interests behind the attack, they decided to run with the Islamophobic current that is all-too-common in the Western world. I find it quite interesting that, before Breivik claimed responsibility, the perpetrators were being framed as terrorists. Suddenly, once it was established that the individual (or possibly individuals) responsible was a blond haired, blue-eyed Norwegian “extremist”. Why does he not get slapped with the terrorist label? How is this act of terror any different from every other? Does Breivik’s ideological and religious leaning somehow exclude him from the label of terrorist? An update to the above linked Wired article points out that their baseless conclusions and accusations should “teach all of us in the media – this blog included – a lesson about immediately jumping to ‘jihad!’ conclusions.”\r\nhttp://www.infowars.com/coverage-of-the-norwegian-tragedy-jumping-to-conclusions-absurdist-claims-and-unanswered-questions\r\n\r\nAlex Jones: ‘Anders Behring was Masons’ Patsy’\r\nRussia Today\r\nJuly 26, 2011\r\n\r\nThe Norwegian capital was shocked this past Friday by a terroristic attack. The police have Anders Behring Breivik in custody as the suspect of these heinous crimes. It came to light that Breivik was a member of the Freemason’s. Radio host Alex Jones gives us some insight on the agenda of this secretive society.\r\nhttp://www.youtube.com/watch?v=t94gpoOgIOQ&feature=channel_video_title\r\n\r\nFinland to boost web surveillance after Norway attacks\r\nAFP\r\nJuly 26, 2011\r\n\r\nHELSINKI — Finnish police said Monday they will monitor the Internet more rigorously for evidence of extremists plots following last week’s twin massacres in neighbouring Norway. Deputy police commissioner Robin Lardot said his forces will play closer attention to fragmented pieces of information — known as “weak signals” — in case they connect to a credible terrorist threat. He told public YLE radio that Finnish police previously enhanced their online surveillance after a 22-year-student gunned down 10 people at a vocational school in the central town of Kauhajoki in September 2008. The gunman in the Kauhajoki shooting, who also killed himself, had dropped hints about his plans before carrying out the attack, as in the Norwegian case, Lardot said. In both cases “the perpetrators had a need to say that they were preparing something like this,” Lardot added.\r\nhttp://www.rawstory.com/rs/2011/07/25/finland-to-boost-web-surveillance-after-norway-attacks\r\n\r\nPaul Watson & Webster Tarpley: Media Paints Breivik as Oswald Type Gunman\r\nThe Alex Jones Channel\r\nJuly 25, 2011\r\n\r\nGiven the fact that the establishment media got it spectacularly wrong by instantly jumping to the conclusion that Friday’s deadly attack in Norway was the work of Al-Qaeda Muslims, placing complete trust in the details emerging about gunman Anders Behring Breivik would be foolish.\r\nhttp://www.infowars.com/paul-watson-webster-tarpley-media-paints-breivik-as-lee-harvey-oswald-type-gunman\r\n\r\nNorway Killings Prompt Crackdown On Brits Opposed to Immigration\r\nInfowars.com\r\nJuly 25, 2011\r\n\r\nOn Sunday, The Telegraph reported that Scotland Yard is searching for a shadowy network of Brits who allegedly hosted Norway’s accused mass murderer, Anders Behring Breivik, prior to his killing spree last week. Officials say Breivik claimed that he was just one of up to 80 “solo martyr cells” recruited throughout Western Europe who were ready to follow his example of trying to overthrow governments tolerant of Islam, according to the newspaper. The “far right” and the “clash of civilizations.” Breivik supposedly considers himself a successor to the medieval Knights Templar. He said he was recruited at a meeting in London in April 2002 hosted by two English extremists and attended by eight people. In his massive manifesto that lifts entire sections of Unabomber Ted Kaczynski’s treatise against modern civilization, Breivik said he had communicated with the English Defense League. The EDL is at best a marginal political group consisting of around 300 dedicated members. It counters Muslim demonstrations against the occupation of Afghanistan, rallies against supporters of the Palestinian cause, and has clashed with socialists.\r\n﻿http://www.infowars.com/norway-killings-prompt-crackdown-on-brits-opposed-to-immigration﻿\r\n\r\nNorway Killer Warns Of “Two More Cells” Preparing Attacks\r\nGunman reverses position, says he did not act alone\r\nInfowars.com\r\nJuly 25, 2011\r\n\r\nAfter initially stating that he acted alone in carrying out Friday’s massacre, Anders Behring Breivik has now suggested in court that two other “cells” of extremists collaborated with him. During an initial hearing today, which was closed to both the public and the media, Breivik stated that there are “two more cells in our organisation” that will carry out further attacks. The information was relayed to reporters via a statement from the Judge presiding over the hearing:... As the statement outlines, Breivik will be held in isolation for a month to prevent him from interfering in police investigations into potential accomplices or attempting to communicate with them.\r\nhttp://www.infowars.com/norway-killer-warns-of-two-more-cells-preparing-attacks\r\n\r\nPolice Knew Gunman’s Name Before Arrest\r\nBritish news anchor questions how authorities were aware of Breivik’s identity in advance\r\nInfowars.com\r\nJuly 25, 2011\r\n\r\nDespite being portrayed by the media as inept due to the length of time it took them to reach the island of Utoeya, it has now emerged that police knew the name of gunman Anders Behring Breivik before they even arrested him, a startling admission that prompted one of Britain’s top news anchors to question how authorities were aware of the gunman’s identity in advance. During his Channel 4 News broadcast on Friday evening, host Jon Snow asked “why police knew the killer’s name by the time they had arrived on the island,” reported the Telegraph live blog. “He surrendered the moment police called his name 3 minutes after they arrived. What we don’t know is how the police knew the terrorist’s name before they arrested him,” said Snow, who is recognized as one of Britain’s most trusted news anchors, and cannot be dismissed as a “conspiracy theorist”. Snow also posed the question on his official Twitter page. How authorities knew the gunman’s identity before his slaughter of young Norwegians on the island of Utoeya had even come to an end, and while the overwhelming speculation still centered around Islamic terrorists, is a mystery, as is the question of why the cops didn’t shoot Breivik immediately.\r\nhttp://www.infowars.com/police-knew-gunmans-name-before-arrest\r\n\r\nAnders Behring Breivik: Manufacturing a Patsy?\r\nTrusting media portrayal of gunman foolish given how press got it spectacularly wrong in blaming Muslims\r\nInfowars.com\r\nJuly 25, 2011\r\n\r\nGiven the fact that the establishment media got it spectacularly wrong by instantly jumping to the conclusion that Friday’s deadly attack in Norway was the work of Al-Qaeda Muslims, placing complete trust in the details emerging about gunman Anders Behring Breivik would be foolish, especially since there are innumerable inconsistencies and contradictions that need to be studied before a fuller picture of what motivated the bloodshed can be established. The rush to blame Muslims for the carnage, hastily parroted by an onslaught of mainstream “terror experts,” was a startling insight into how the propaganda that fuels the war on terror is so unquestionably bounced around the echo chamber of the corporate media. It’s also a reminder that the mainstream press instantly falls in line with whoever the establishment designates the enemy du jour to be at any given time. Now that Muslims have been so vehemently demonized as terrorists, it’s the turn of so called “right-wing extremists,” or anyone who disagrees with mass immigration, loss of sovereignty and globalist financial looting, to feel the heat. The effort to smear European conservatives as unhinged radicals who harbor simmering urges for bloodlust is now in full swing, and it’s a demonization campaign firmly founded on the carefully crafted public portrayal of Anders Behring Breivik. However, it’s quickly becoming apparent that just as many eyewitnesses reported two gunmen on the island where the rampage unfolded, there are two different personas behind Breivik himself. Indeed, there are two different Facebook profiles for Breivik, one from before the massacre and one from after. The latter profile appears to have been embellished and deliberately altered to emphasize the notion that the gunman was motivated by his “Christian conservative” beliefs.\r\nhttp://www.infowars.com/anders-behring-breivik-manufacturing-a-patsy\r\n\r\nAlex Jones & Webster Tarpley: Norway Terror Attacks a False Flag Staged Event\r\nThe Alex Jones Channel\r\nJuly 25, 2011\r\n\r\nAlex Jones & Webster Tarpley discuss early indications that the attacks in Norway are part of a wider plot.\r\nhttp://www.infowars.com/alex-jones-webster-tarpley-norway-terror-attacks-a-false-flag-staged-event\r\n\r\nAnalyzing the Oslo Attacks Part 3: More Information & Even More Unclear\r\nActivist Post\r\nJuly 25, 2011\r\n\r\nAfter Anders Behring Breivik claimed responsibility for the atrocious killing spree in Norway, and his manifesto was discovered and published, the facts we are presented with continue to be quite strange. First it was attributed to an al Qaeda affiliated group, then it was a lone Christian anti-Muslim self-declared pseudo-Knights Templar, and then it was announced there was a possible second gunman involved. To make matters murkier, much of his 1,500 page manifesto was directly lifted from the infamous Theodore Kaczynski, better known as “the Unabomber” Nearly one dozen passages were directly copied from the Unabomber’s manifesto without attribution and with the only changes being the exchanges of some words to match Breivik’s rhetoric. This was discovered by some observant Norwegian bloggers and was utilized by the mainstream Western media not to question the validity and providence of Breivik’s manifesto, but instead to reinforce the contrived Unabomber-Breivik connection.\r\nhttp://www.activistpost.com/2011/07/analyzing-oslo-attacks-part-three-more.html\r\n\r\nBreivik Wanted To Reform “Knights Templar Europe”\r\nLondon Guardian\r\nJuly 24, 2011\r\n\r\nThe video above was created by the gunman, Anders Behring Breivik. Anders Behring Breivik, the man behind the Norway killings that left 93 people dead, began his journey in extremist rightwing politics at a small meeting in London in 2002, according to his online manifesto, and may have attended a far right demonstration in the UK as recently as last year. In a 1,467-page document that contains chilling details of his preparations for Friday’s attacks, Breivik outlines his UK links, claiming he met eight other extremists from across Europe in London in 2002 to “re-form” the Knights Templar Europe – a group whose purpose was “to seize political and military control of western European countries and implement a cultural conservative political agenda”. The manifesto, signed “Andrew Berwick London 2011″, contains repeated references to his links to the UK far right group the English Defence League. On Sunday there were unconfirmed reports from one of the organisation’s supporters that the 32-year-old had attended at least one EDL demonstration in the UK in 2010. In the manifesto titled 2083: A European Declaration of Independence, Breivik writes: “I used to have more than 600 EDL members as Facebook friends and have spoken with tens of EDL members and leaders. In fact; I was one of the individuals who supplied them with processed ideological material (including rhetorical strategies) in the very beginning.\r\nhttp://www.guardian.co.uk/world/2011/jul/24/norway-gunman-london-connection-edl\r\n\r\nNorway Terror Attacks a False Flag\r\nInfowars.com\r\nJuly 24, 2011\r\n\r\nMore Than One Shooter on Island; Oslo Bomb Drill Just Concluded; Was It NATO’s Revenge for Norway’s Decision to Stop Bombing Libya? The tragic terror attacks in Norway display a number of the telltale signs of a false flag provocation. It is reported that, although the world media are attempting to focus on Anders Behring Breivik as a lone assassin in the tradition of Lee Harvey Oswald, many eyewitnesses agree that a second shooter was active in the massacre at the Utøya summer youth camp outside of Oslo. It has also come to light that a special police unit had been conducting a drill or exercise in downtown Oslo which involved the detonation of bombs – exactly what caused the bloodshed a few hundred meters away little more than 48 hours later. Further research reveals that United States intelligence agencies had been conducting a large-scale program of recruiting retired Norwegian police officers with the alleged purpose of conducting surveillance inside the country. This program, known as SIMAS Surveillance Detection Units, provided a perfect vehicle for the penetration and subversion of the Norwegian police by NATO.\r\nhttp://www.infowars.com/norway-terror-attacks-a-false-flag\r\n\r\nSecond Man “Seized by Special Forces” in Norway\r\nRussia Today\r\nSunday, July 24, 2011\r\n\r\nA second man was seized in an area where victims’ relatives had gathered, reports Russia Today. Helge Luras from the Norwegian Institute of International Affairs believes it’s the country’s polices of multiculturalism that turned the gunman against his own.\r\nhttp://www.youtube.com/user/RussiaToday#p/u/2/v2VaS54zJVE\r\n\r\nPolice Not Ruling Out Second Massacre Suspect\r\nCNN\r\nSunday, July 24, 2011\r\n\r\nOslo, Norway (CNN) — The suspect in the bombing and mass shooting in Norway believed the terrorist attacks were “horrible,” but “in his head (they) were necessary,” a man who identified himself as the suspect’s lawyer told Norwegian broadcaster TV2. Geir Lippestad told TV2 late Saturday that he represented Anders Behring Breivik, who was arrested Friday after twin terror attacks that left at least 92 dead. Breivik “is ready to explain himself” in a court hearing Monday, Lippestad said. While they have only arrested one suspect, police in Norway have not ruled out the possibility that someone else may have been involved in the explosion in Oslo and a shooting at a youth camp on Utoya island.\r\nhttp://www.cnn.com/2011/WORLD/europe/07/23/norway.terror.attacks/index.html?iref=NS1\r\n\r\nMassacre gunman posted YouTube video calling followers to ‘embrace martyrdom’ six hours before attacks\r\nDaily Mail\r\nJuly 24, 2011\r\n\r\nThe man who reportedly shot dead at least 85 people at a youth camp and killed another seven with a car bomb in the Norwegian capital of Oslo, released a YouTube video calling for conservatives to ‘embrace martyrdom’ six hours before the attacks, it has emerged. Anders Behring Breivik posted the video promoting a fight against Islam, which shows pictures of him wearing a wetsuit and pointing an automatic weapon, hours before he set out on the devastating killing spree. In a text with the video he detailed his plans for the attacks, writing that he would ‘dress up as a police officer’, adding that it would ‘be awesome as people will be astonished’. In the disturbing 1,500-page dossier, he wrote that ‘there are situations where cruelty is necessary’ and that it is better to kill too many than not enough’.\r\nhttp://www.infowars.com/massacre-gunman-posted-youtube-video-calling-followers-to-embrace-martyrdom-six-hours-before-attacks\r\n\r\nGunman Opposed “Cultural Marxism,” Immigration\r\nReuters\r\nJuly 24, 2011\r\n\r\nOSLO (Reuters) – The man suspected of Norway’s gun and bomb massacre had belonged to an anti-immigration party and opposed multi-culturalism, Islam and the “cultural Marxists” of the establishment, web postings, acquaintances and officials said Saturday. Anders Behring Breivik was accused of gunning down 85 people at a youth camp and killing another seven in a bomb attack on Friday. “Before we can start our crusade we must do our duty by decimating cultural marxism,” said a caption under a video called “Knights Templar 2083″ on the YouTube website. Finnish newspaper Helsingin Sanomat on its website reported that at least one Finnish politician, a member of the populist True Finns, received the e-mail manifesto Friday afternoon.\r\nhttp://ca.news.yahoo.com/norway-massacre-suspect-driven-crusade-000804610.html\r\n\r\nNorway Attack: 90 minute police delay gave killer time to lure some to their deaths\r\nNew York Daily News\r\nJuly 24, 2011\r\n\r\nInept Norweigan cops couldn’t locate a helicopter or a boat, allowing the gunman to shoot down his victims for 90 minutes before help arrived. By that time, the mass murderer in a police uniform had methodically slaughtered 85 victims. The terrified victims fleeing Anders Behring Breivik ran and swam for their lives as they waited in horror for help that came too late for many, officials said yesterday. A SWAT team dispatched to the killing field on Utoya island about 50 minutes after the first report of gunfire went by car because their helicopter wasn’t on standby, said Police Chief Sveinung Sponheim.\r\nhttp://www.nydailynews.com/news/world/2011/07/24/2011-07-24_cop_delay_gave_him_90_minutes_to_kill_maniac_lured_some_to_their_death_others_ra.html?r=news\r\n\r\nNorway Terror Attacks Now Being Compared To Oklahoma City Bombing As Evidence Of False Flag Operation Continues To Mount\r\nIntel Hub\r\nJuly 23, 2011\r\n\r\nUpdate: Multiple witnesses have reported shootings at two different places on the island. One with a handgun the other with a sniper rifle! We are expected to believe that this massacre was one person when all evidence and common sense points to there being more operatives involved. Anders Behring Breivik, the supposed terrorist who blew up a government building and massacred at least 84 people at a youth summer camp is now being compared to Timothy McVeigh and the Oklahoma City Bombing. An official, who spoke on condition of anonymity, said the attack “is probably more Norway’s Oklahoma City than it is Norway’s World Trade Center.” Domestic terrorists carried out the 1995 attack on a federal building in Oklahoma City, while foreign terrorists were responsible for the Sept. 11, 2001 attacks. CBS The problem? The Oklahoma City Bombing was a false flag terror attack. This is a documented FACT. In the report, Associated Press writer Karl Ritter claims that the Oklahoma City Bombing was done with one bomb. A quick search shows this to be an outright lie.(Still Waiting For Retraction) Considering the fact that the Norway attacks are now being compared to a known false flag, it seems prudent to look into the events leading up to the bombing and shooting massacre that has rocked Norway.\r\nhttp://theintelhub.com/2011/07/23/norway-terror-attacks-now-being-compared-to-oklahoma-city-bombing-as-evidence-of-false-flag-operation-continues-to-mount\r\n\r\nEuropol to Investigate Non-Islamic Terror\r\nInfowars.com\r\nJuly 23, 2011\r\n\r\nThe European Union’s criminal intelligence agency, Europol, will conduct an investigation of non-Islamic terror threats supposedly posed by non-establishment political groups, according to the Associated Press. “There is no doubt that the threat from Islamist terrorism is still valid,” said Soeren Pedersen. “But there have actually been warnings that (right-wing groups) are getting more professional, more aggressive in the way they attract others to their cause.” Media compares Norway bombing to Oklahoma City. Investigations conducted by the crime unit located at the Hague reveal that supposed “ultra-right” groups pose little threat. Instead, the primary threat comes from anarchists and other leftist groups. In 2010, groups identified as leftist were responsible for 45 attacks, a 12 percent increase from the previous year. On several different occasions, anarchist groups have been shown to consist of police agents provocateurs. Government has a long track record of infiltrating leftist groups and agitating for political violence. As the Hal Turner case revealed, the government basically built the American National Socialist and white supremacist movements from the ground up. Although the FBI claimed decades ago to have abandoned its notorious COINTELPRO, evidence abounds indicating the program is still operational. “The numbers of rightwing extremist criminal offenses are relatively low,” Europol said. The statement reveals that any such investigation is unwarranted and will be a witch hunt. Groups deemed “far right” – in other words, opposed to an unelected European Union bureaucracy and its effort to force banker debt “repayment” and austerity measures across Europe – will be put under a microscope and demonized as terrorists.\r\nhttp://www.infowars.com/europol-to-investigate-non-islamic-terror\r\n\r\n“White Al Qaeda” targeted as western governments turn terror apparatus inward\r\nOld-Thinker News\r\nJuly 23, 2011\r\n\r\nPre-2008 market crash: Ministry of Defense report frames middle class as “revolutionary,” “…as the burden of acquired debt and the failure of pension provision begins to bite.” The government narrative of the “White Alqaeda” threat has been ongoing for at least 3 years now. The latest bombing in Norway is continuing the saga. In a recent development, a report from USA Today reads, “A police official tells the Associated Press that today’s terror is more like the 1995 Oklahoma City bombing by Timothy McVeigh than the Sept. 11, 2001, attacks on the World Trade Center by Islamist fundamentalists.” This event is feeding into a growing trend in which western governments are turning their anti-terror apparatus inward. The Department of Homeland Security recently released a video in which the depiction of terrorist activity involved white men in every threat scenario.Homeland Security Secretary Janet Napolitano recently made clear that domestic terrorism is at the center of the government’s focus. In the aftermath of the Oklahoma City bombing in 1995, Time Magazine printed an article in which the government’s post-bombing propaganda campaign is expressed vividly. The article stated in part that individuals like Timothy McVeigh “…drew on widespread mistrust and even hatred of government power… Their coalition included well-known elements of far-right thought: tax-protesters; Christian home-schoolers; conspiracy theorists influenced by the John Birch Society’s fear of one-world government; Second Amendment activists for whom guns are an important part of an independent way of life; self-reliant types who resent a Federal Government…” Behind the smoke rising from Oslo the economic collapse of the European Union – and the world – is brewing in the background. Resistance to the banking takeover has entered into the government threat matrix and the international criminal profile is turning towards white middle class individuals. As Kurt Nimmo documents at Infowars.com, the Oslo bombing suspect was a member of the “libertarian people’s party”, an equivalent of the Tea Party in the United States.\r\nhttp://www.oldthinkernews.com/?p=1944\r\n\r\nU.S Government Smuggled Missles, Grenades And Other Military Grade Weapons To Mexico Drug Cartels\r\nAlexander Higgins\r\nJuly 23, 2011\r\n\r\nThe U.S government weapons smuggling scandal grown from a simple gun smuggling scandal into a full blown military grade weapons smuggling scandal following the arrest of a Zetas cartel leader.  Law enforcement officials report the U.S government has supplied the Zetas cartel with, among other things, “an array of military grade weapons, grenade and grenade launchers, high-powered rifles, body armor, anti-aircraft missiles, and night vision goggles.” The nation was shocked when  the U.S government was caught red handed smuggling guns to drug cartels in Mexico after government supplied guns were linked to the murders of law enforcement officials working along the U.S. Mexico border. The scandal deepened when the hacker group ‘Anonymous’ leaked reported government documents on the Internet which appear to show that the leader of the La Familia cartel in Mexico was actually the feds point man for the gun smuggling operation.  Although the revelations revealed in data release was not confirmed by the Obama administration the information became part of a congressional investigation into the scandal.\r\nhttp://blog.alexanderhiggins.com/2011/07/23/government-smuggled-missles-grenades-military-grade-weapons-mexico-drug-cartels-40841\r\n\r\nAt least two terrorists behind Norwegian youth camp massacre - witnesses\r\nRIA Novosti\r\nJuly 23,2011\r\n\r\nWitnesses of Friday's mass killings in the Norwegian youth camp say there were two terrorists as the shootings were coming from \"two different places on the island at the same time,\" Norwegian VG paper reported on Saturday. At least 92 people were killed in two separate attacks in Norway on Friday. Seven people reported to be killed in a bomb explosion at a government headquarters in Oslo and 85 were killed in a shooting at a youth summer camp on the Utoya island, near the capital. Several young people who survived Utoya's massacre, told VG paper that the shootings were coming from \"two different places on the island at the same time.\" \"I believe that there were two people who were shooting,\" VG quoted a 23-year old Alexander Stavdal.\r\nhttp://en.rian.ru/world/20110723/165350450.html\r\n\r\nEvidence Shows Norway Terror Attack a False Flag\r\nInfowars.com\r\nJuly 23, 2011\r\n\r\nPrior to the events in Norway, the Department of Homeland Security released a propaganda video characterizing white middle class Americans as terrorists and members of white al-Qaeda, a term designed to conflate the image of the CIA-created Islamic terror group and “rightwing extremists” in America. The DHS video is part of the government’s “See Something, Say Something” mass hysteria campaign and follows its report leaked to the media in 2009 designating libertarians and Second Amendment advocates as terrorists and right-wing extremists. The alleged perpetrator in the Norway bombing and shooting is being described as a right-wing extremist who was a former member of a popular political party that regards itself to be a “libertarian people’s party” with an ideology based on classical liberalism. Anders Behring Breivik was at one time a member of the Progress Party, according to news reports. He was a member from 2004 to 2006 and in its youth party from 1997-2006 through 2007. The Progress Party platform preamble identifies the organization as populist libertarian and its main declared goal as a reduction in taxes and government intervention. The CFR says the Progress Party and similar political parties in Sweden and Finland represent a European Tea Party movement on the rise. In the U.S., the Tea Party has opposed government bailouts to the banksters and has called for ending the Federal Reserve. The EU, the IMF and the international bankers are worried about growing populism in Europe. “Rising political populism around Europe, driven by public anger over the impact of the financial crisis, threatens to make solving the euro zone’s debt woes increasingly difficult,” Reuters reported in April. Millions of Europeans are opposed to raiding their treasuries to pay for debt contrived by the bankers and have turned in large numbers to political parties such as the True Finns. The True Finns’ main campaign plank is opposition to funding a bailout for Portugal. In April, the Finnish party emerged from relative obscurity and moved into the political limelight. Its sudden popularity took the European establishment by surprise. The false flag attack in Norway arrives as populism grows in Germany, Europe’s reluctant paymaster for the contrived debt-based economic crisis.\r\nhttp://www.infowars.com/evidence-shows-norway-terror-attack-a-false-flag\r\n\r\n‘Caution! Watch out for false flags’ – Oslo attacks\r\nRussia Today\r\nJuly 23, 2011\r\n\r\nNorwegian police say at least 84 people have been killed in a shooting spree at a youth camp on the island of Utoya, near the capital Oslo. The attack came shortly after a powerful blast shook the government centre in downtown Oslo, claiming at least seven lives. A 32-year-old Norweigan man has been arrested in Norway, in connection with the dual attacks.\r\nhttp://www.youtube.com/watch?v=hyi7_pKEXV8&feature=channel_video_title\r\n\r\nWas Norway Killer Anders Behring Breivik a Freemason?\r\nInfowars\r\nJuly 23, 2011\r\n\r\nFLASHBACK: Dunblane killer Thomas Hamilton was also a Freemason, police investigated claims of a “Masonic conspiracy”. PDF of Breivik’s Facebook Page There is a pdf of Breivik’s Facebook page hosted on Solid Principals Blog. (I’ll host a local copy here as well.) Facebook was the source of the image on Daily Mail. Here is how how it appeared on Facebook. Some people are claiming this is a photoshop, but if it is then it must have been done by Breivik himself, because it was posted on his original Facebook and is now being used by mainstream newspapers like the Daily Mail. Breivik also included Freemasons on his list of interests. According to this link, Breivik was with the Saint Johannes lodge in Oslo from at least 2008 onwards.\r\nhttp://www.infowars.com/norway-killer-anders-behring-breivik-was-a-freemason\r\n\r\nEstablishment Media Rushed To Blame Madman Attack on Muslims With No Evidence\r\nZero Hedge\r\nJuly 23, 2011\r\n\r\nComment: Within barely an hour of the attack, the New York Times had blamed “Al-Qaeda” for an attack that turned out to be the work of a lone madman. Perhaps it is time for the Telegraph to issue a retraction to its kneejerk publication in which it automatically cast blame on Islamists and other “eastern” terrorists-by-default. Because according to just released info, they could not have been more wrong, and it is the reaction to precisely this type of prejudice that will never facilitate bridging frayed relations between disparate cultures. Anyway, so much for prejudiced speculation and/or lies about some Islamist organization taking the blame for the events in Norway today. Here is the truth:” VG has received confirmation from several independent sources that it was Anders Behring Breivik, who was arrested by armed police after the mass killings of Utøya Friday. VG was also present when the emergency squad took action against the flat 32-year-old susceptible west of Oslo. Several foreign media have also named Breivik as the perpetrator.” More on his motives: “A childhood friend of Breivik says to VG Nett that he should have been right-wing in the late 20′s, and posted a series of controversial opinions on Facebook.” And the kicker, for all the bigots out there: he was an ultra nationalist who hated Islam. Today’s tragic events were merely the outburst of deranged and very much troubled Loughner, McVey-like psychophath. And nothing more. And more: In online debates he makes his mark as a well-read, and one with strong opinions about Norwegian politics. He promotes a very conservative opinions, which he also called nationalist. He expresses himself strongly opposed to multiculturalism – that cultural differences can live together in a community. He has had many posts on the site Document.no, an Islam-critical site that publishes news and commentary.\r\nhttp://www.zerohedge.com/article/single-white-norway-psychopath-killer-anders-behring-breivik-32-nationalist-hates-islam\r\n\r\nWhy Would a “Right-Wing Nationalist” Massacre Young, Predominantly White Norwegians?\r\nNorway Attacks Suspect ‘Has Right-Wing Ties’\r\nSky News\r\n July 23, 2011\r\n\r\nComment: Why would a “right-wing extremist” who calls himself a nationalist and hates Muslims choose to massacre scores of young, predominantly white, Norwegian youths? Why not attack a mosque? Police have said a Norwegian man arrested after the twin attacks in Norway is a right-winger with anti-Muslim views, but they do not know whether that was a factor in the attacks. Police are continuing to question the 32-year-old – named by Norwegian television as Anders Behring Breivik – after he was detained on Friday evening in connection with the attacks. National police chief Sveinung Sponheim said internet postings by the suspected gunman “suggest that he has some political traits directed toward the right, and anti-Muslim views, but if that was a motivation for the actual act remains to be seen”. Norway’s TV2 channel claimed Breivik has links to “right-wing extremists” and possessed two weapons registered in his name.\r\nhttp://news.sky.com/skynews/Home/World-News/Norway-Twin-Attacks-Suspect-Anders-Behring-Breivik-Is-A-Right-Winger-With-Anti-Muslim-Views/Article/201107416035936?lpos=World_News_Carousel_Region_1&lid=ARTICLE_16035936_Norway_Twin_Attacks%3A_Suspect_Anders_Behring_Breivik_Is_A_Right-Winger_With_Anti-Muslim_Views\r\n\r\n﻿Norway PM Was Due To Visit Massacre Camp﻿\r\nBBC News\r\nJuly 23, 2011\r\n\r\nMr Stoltenberg had been due to visit the camp on Saturday. Foreign Minister Jonas Gahr Store, who visited the camp on Thursday, praised those who were attending. “The country has no finer youth than young people who go for a summer camp doing politics, doing discussions, doing training, doing football, and then they experience this absolutely horrendous act of violence,” he said. In Oslo, government officials urged people to stay at home and avoid central areas of the city.\r\nhttp://www.bbc.co.uk/news/world-europe-14259356\r\n\r\n91 Killed: Death Toll Rises Dramatically\r\nLondon Guardian\r\nJuly 23, 2011\r\n\r\nNorway was today coming to terms with one of the worst atrocities in recent European history as police revealed that 91 people died in the attacks in the centre of Oslo and on a nearby island summer camp, apparently the work of a lone gunman. The killings, it now seems clear, were carried out by a 32-year old Norwegian, named by local media as Anders Behring Breivik, who had expressed far-right views, and had dressed as a policeman to carry out his bomb attack on government buildings in central Oslo before heading to the island of Utøya, where he shot at least 84 people. Survivors of the island attack, which took place barely two hours after a huge bomb was detonated close to the offices of Norway’s prime minister, Jens Stoltenberg, described how the gunmen moved across the small, wooded Utøya holiday island on Friday firing at random as young people scattered in fear. Teenagers at the lakeside camp organised by Stoltenberg’s ruling Labour party fled screaming in panic, many leaping into the water or climbing trees to save themselves, when the attacker began spraying them with gunfire.\r\nhttp://www.guardian.co.uk/world/2011/jul/23/norway-attacks\r\n\r\nMore on Norway’s “False Flag” Attack (video)\r\nDeadline Live\r\nJuly 22, 2011\r\n\r\nMultiple Terrorist Bombings In Olso, Norway — Signature Of Mossad False Flag Al-Queda Terror Attack\r\nhttp://deadlinelive.info/2011/07/22/more-on-norways-false-flag-attack", "group_id": 3920, "id": 1757960}]