[{"user_id": 3019, "stars": [], "topic_id": 40164, "date_created": 1308788678.1821761, "message": "We're going to creation!", "group_id": 868, "id": 1461631}, {"user_id": 3019, "stars": [], "topic_id": 40164, "date_created": 1308788764.5770669, "message": "New video", "group_id": 868, "id": 1461637}, {"user_id": 3019, "stars": [], "topic_id": 40164, "date_created": 1308788734.530226, "message": "http://www.redbullusa.com/cs/Satellite/en_US/001242969629749", "group_id": 868, "id": 1461633}, {"user_id": 4330, "stars": [], "topic_id": 40164, "date_created": 1308793591.45351, "message": "Make sure you read & understand the terms & conditions: Acknowledgement: Selection of participants in the Red Bull Creation event (the \"Event\") shall be in the sole discretion of Red Bull North America, Inc. (\"Red Bull,\" \"We,\" \"Us\" or \"Our(s)\"). We reserve the right, in Our sole discretion, to cancel the Event and/or disqualify any participants at any time. All federal, state, and local laws and regulations apply. By participating in the Event selection process (the \"Selection Process\"), you hereby agree to abide by any and all Event rules and irrevocably grant permission to Us and Our parent, affiliates, subsidiaries, licensees, assignees, successors, promotional partners and agents, and each of their directors, officers, employees and assigns (all of the foregoing, the \"Red Bull Parties\"), to use and authorize the use by third parties of your name, likeness, city and state of residence, and other biographical information as determined by Us in Our sole discretion. By submitting and/or entering any material into the Selection Process and/or in connection with the Event, including, without limitation, sketches, pictures and videos (collectively, the \"Submitted Material\"), simultaneously with such posting you automatically grant, or represent or warrant that the owner has expressly granted, to Us a worldwide, royalty-free, perpetual, irrevocable, fully sublicensable, and transferable right and license to use, reproduce, distribute, create derivative works based upon (including, without limitation, translations), publicly display, publicly perform, transmit, and publish the Submitted Material (in whole or in part) as We, in Our sole discretion, deem appropriate, including, without limitation, (1) in connection with Our business; and (2) in connection with the businesses of the Red Bull Parties. We may exercise this grant in any format, media or technology now known or later developed for the full term of any copyright or other intellectual property right that may exist in such Submitted Material. You waive any and all claims you (or any copyright holder) may now or later have in any jurisdiction to so-called \"moral rights\" or rights of \"droit moral\" with respect to the Submitted Material. By submitting the Submitted Material to Us, simultaneously with such posting, you automatically represent and warrant that you have not and will not: (i) permit any entity offering products in the \"Exclusive Category\" to use the Submitted Material; or (ii) assign or grant any license or other right (whether on an exclusive or non-exclusive basis) in or to the Submitted Material to any entity offering products in the \"Exclusive Category.\" For purposes of this provision, \"Exclusive Category\" shall mean any and all beverages and non-beverage foods or other categories of goods that are competitive with the Red Bull products, including, without limitation, all energy drinks, sodas, juices, iced teas, and sport drinks. You represent that you are eighteen (18) years of age or older, you independently created the Submitted Material, it is an original work, and that the Submitted Material will not infringe the rights of any third party. You further agree to take any actions (including execution of documents) reasonably requested by Us to effect, perfect or evidence the foregoing rights.", "group_id": 868, "id": 1462139}, {"user_id": 3019, "stars": [], "topic_id": 40164, "date_created": 1308793775.7851441, "message": "Good to know, thanks.", "group_id": 868, "id": 1462162}]