[{"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1300901947.831038, "message": "The MC may be the one that enables the goal to be met, but it is the protagonist that is pushing for the goal to be met.\n\nIn The Wedding Banquet, the goal is to get a grandchild, and Wai Tung's father is the primary proponent of that goal.  Wai Tung is the ONLY person that can make that goal happen since he is an only child.", "group_id": 2515, "id": 419110}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1300901223.1255791, "message": "What is the link in the chain that I'm missing?", "group_id": 2515, "id": 419029}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1300901185.137548, "message": "The MC is the character who can bring the OS Goal to a successful outcome. So, in The Wedding Banquet, this is Wai-Tung, and the OS Goal is the grandchild (as I see it). [I haven't listened to the podcast yet.]\n\nWai-Tung's throughline is about revealing his orientation to his parents... which he does. But I don't see how this is the key to the solution... it's Wei-Wei's decision to keep the baby that does that.", "group_id": 2515, "id": 419025}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1300901237.313628, "message": "If it's in the podcast, you can just refer me there. I'm going to listen eventually.", "group_id": 2515, "id": 419033}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1300906515.8718431, "message": "Ah... I thought that it was specifically by changing or staying steadfast that they effected the success or failure of the OS Goal! Thanks.", "group_id": 2515, "id": 419752}, {"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1300982534.885812, "message": "No, it has little to do with the MC's Resolve, though you may choose to enhance the connection by giving them an apparent causal relationship.\n\nThe crucial elements are one of the ways that connect the MC throughline to the Overall Story throughline.  It helps answer the question, \"Why is this MC dealing with his personal stuff in the context of this Overall Story?\"", "group_id": 2515, "id": 428118}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1300994202.2684481, "message": "I never really thought it had to do with their Resolve (actually changing or not), but rather the topic surrounding the decision to take a leap of faith or not. While that made sense to me, it was limiting. This puts it into a broader perspective. Thanks!", "group_id": 2515, "id": 430028}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1302126504.7099841, "message": "I have another question about the \"change\" in this story. This gets back to my earlier misconception in a different way.\n\nI had always thought that the change a character makes is what leads to the solution. However, in this movie, it does not. Wai Wai is pregnant, and her choice isn't directly influenced by the change in Wei Tung.\n\nIn theory, both Wei Tung and Wai Wai could have remained Steadfast and the movie would have ended with a Success, no?\n\nGranted, then it wouldn't have been a GAS...", "group_id": 2515, "id": 565669}, {"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1302500995.4649169, "message": "Anything can happen in a narrative, but in order it to have greater meaning it needs to be connected to each other.     The MC is the one that enables the story goal to end in Success, whether or not he is a Change character.  That is why you can have Change/Failure stories and Steadfast/Success stories.", "group_id": 2515, "id": 620281}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1302545764.519839, "message": "So, this leads directly to my gut: I don't feel like Wai Tung's Change influenced the success of the story in any way. (Or, perhaps he was finally open enough to have a sexual encounter that was directly in contrast to his wants?)\n\nDo you see them as connected?", "group_id": 2515, "id": 627432}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1302559885.0250421, "message": "FWIW, while I remember my mother loving this movie when it came out, I found it a bit unsatisfying this time (my third viewing in 15 years).", "group_id": 2515, "id": 631055}, {"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1302560213.339011, "message": "Without Wai Tung, the story could not end in success because his parents could not become grandparents.  This does not mean he intended to make it happen, which he didn't, but he is uniquely suited to providing the key element(s) to make success possible.", "group_id": 2515, "id": 631122}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1302575102.009444, "message": "But what does that  have to do with his change?", "group_id": 2515, "id": 635013}, {"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1302631679.2028849, "message": "It doesn't have anything to do with his change.  That is my point.  If I understood your comment, \"I don't feel like Wai Tung's Change influenced the success of the story in any way...\", my response is, \"That's right.  His Change is irrelevant to his connection to the Overall Story throughline.\"\n\nA Main Character's Unique Ability is what connects the MC to the OS to allow for a Success or Failure outcome, not the MC Problem or MC Resolve.\n\nIn this case, the MC UA is Denial, defined in Dramatica as, \"the refusal to admit to oneself or others that a previously held view is no longer true.\"  Wai Tung denies to his parents that he is anything other than what they think he is -- a good, respectful, heterosexual Chinese man.  By denying his homosexuality, he goes through the necessary heterosexual mating rituals expected by his parents.  If he had not done that, he would not have gotten drunk, slept with his \"fiance,\" and got her pregnant.", "group_id": 2515, "id": 647022}, {"user_id": 10814, "stars": [], "topic_id": 14755, "date_created": 1302631773.1520281, "message": "...and [gotten] her pregnant.", "group_id": 2515, "id": 647054}, {"user_id": 7664, "stars": [], "topic_id": 14755, "date_created": 1302637745.9497991, "message": "Thank you (again). I was very much under the impression that a \"leap of faith\" had to occur in order to result in success or failure.", "group_id": 2515, "id": 648621}]