[{"user_id": 30287, "stars": [], "topic_id": 35149, "date_created": 1305301717.2064321, "message": "BUT... the IC doesn't necessarily need to \"oppose\" the MC. The IC needs to represent a different approach to solving the problem, but the IC and MC could very well be working together in partnership, like Luke and Obi Wan.", "group_id": 2515, "id": 1043307}, {"user_id": 13650, "stars": [], "topic_id": 35149, "date_created": 1305301275.2353089, "message": "THe IC can be a group of characters working together as a group BUT can multiple characters be IC if they are not working together? (As long as they oppose the MC?)", "group_id": 2515, "id": 1043195}, {"user_id": 30287, "stars": [], "topic_id": 35149, "date_created": 1305301656.0059099, "message": "It is my understanding that, yes, the IC can be multiple characters even if they are not working together. As long as they are presenting a different approach to the problem that impacts the MC, it doesn't matter if they know each other or not.", "group_id": 2515, "id": 1043294}, {"user_id": 7664, "stars": [], "topic_id": 35149, "date_created": 1305305326.372226, "message": "I think you would have to be very deliberate about showing your MC change his focus from one IC-member to another for this to be effective. \n\nIn broad strokes, I could imagine an MC getting fed up with one IC (\"I can't stand him, he's so obsessed!\") only to find that the next IC-member is equally obsessed. (I'm putting the IC in Mind for no particular reason.)", "group_id": 2515, "id": 1043944}, {"user_id": 7664, "stars": [], "topic_id": 35149, "date_created": 1305305412.830832, "message": "This would make a strong statement about the world, or about the MC.\n\nBut, I stress, that I think you would have to be careful about it, so you avoid the criticism that someone showed up at the end who  influenced the MC. It might accidentally look like a Deus ex Machina.", "group_id": 2515, "id": 1043976}, {"user_id": 7669, "stars": [], "topic_id": 35149, "date_created": 1305315909.8016231, "message": "We call it a \"hand-off\".  As long as each person who comes along as IC presents a consistent argument (at least in terms of how it contrasts or impacts the MC), then yes, they can each, and collectively, count as Impact Character.  You often find this is the case when the first IC dies off early, then someone else picks up that person's argument for the rest of the story -- because it's what the MC needs to hear.", "group_id": 2515, "id": 1046265}, {"user_id": 10814, "stars": [], "topic_id": 35149, "date_created": 1305323128.3681321, "message": "The simplest example of multiple IC's handing off their duty are found in A Christmas Carol.  The IC throughline is represented by the ghosts.  First signpost is Marley, 2nd = Ghost of Christmas Past, 3rd = Ghost of Christmas Present, 4th = Ghost of Christmas Future.  Each ghost is there for Scrooge's \"reclamation\".", "group_id": 2515, "id": 1047817}, {"user_id": 35323, "stars": [], "topic_id": 35149, "date_created": 1307357468.507004, "message": "Now I'm a bit confused. Dramatica says that the actual persons in stories are 'players' and one player can contain multiple 'characters' (or multiple players can share the same dramatic function - like R2D2 and C3PO). But as I understand we're using the term 'main character' in the meaning: main player. Am I right or am I missing something? If that's the case is it imaginable that the Main and Impact Characters are in the same player? Now that would be weird....", "group_id": 2515, "id": 1301932}, {"user_id": 35139, "stars": [], "topic_id": 35149, "date_created": 1307359273.723248, "message": "...dagnabbit, I just wanted a carriage return. Silly Convore. Anyway, in a \"simple\" story where you have the pure divisions of players into groups like Protagonist, Antagonist, etc., you can't have the MC and IC in the same group. They will oppose each other; it is axiomatic. But in a \"complex\" story, where peoples' roles aren't so prototypical, that's where this becomes not only possible but easy to set up. Two characters which would generally be considered to be on the same side of the OS conflict can disagree on a single point, and that's where the SS conflict comes into its own.", "group_id": 2515, "id": 1302055}, {"user_id": 35139, "stars": [], "topic_id": 35149, "date_created": 1307358907.833792, "message": "The \"main character\" is a single member of the group of \"players\" that contains the \"main character.\" Yes, it sounds silly and artificial, like \"a chicken as a group of undetached chicken parts,\" but there it is.", "group_id": 2515, "id": 1302024}, {"user_id": 30951, "stars": [], "topic_id": 35149, "date_created": 1307360073.286674, "message": "@Novbert,  I think the main thing is here to look at the throughlines Dramatica gives to clarify the characters.\n\nLooking at three of the throughlines, we have the OS throughline, that contains everyone. But it is everyone from an objective view, seeing them all from the outside. So you have your main player (Protagonist) here. These characters can also be archetypal (antagonist, guardian, etc) or complex. But normally a Protagonist is always identified in my experience.\n\nThen there is the MC throughline, for the character that we follow as the audience, and probably we see more about this character's internal drive and motivations. The MC will share a place as one of the OS characters, often the Protagonist but not necessarily. \n\nThe IC throughline gives us the impact character to the MC, the one that most influences the MC, so they really can't be the same character. The IC will again will also share a place with one of the OS characters.", "group_id": 2515, "id": 1302159}, {"user_id": 35369, "stars": [], "topic_id": 35149, "date_created": 1307376434.9503379, "message": "anyone see Bridesmaids? that struck me as having multiple characters functioning as an IC: her best friend, the cop, the aggro/weird/hilarious groom's sister, etc. each one seemed to challenge Annie's approach at different points throughout the story.", "group_id": 2515, "id": 1305365}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307377752.0963559, "message": "How about an approach where ALL the characters are suffering from the same problem, but going about dealing with it in different ways which ultimately impact the MC.  I'm working on a farce where this is the case, even his best friend ends up as an antagonist to the situation - but ultimately the characters share the same problem, but try to resolve it differently.  I think Tootsie is a good example of multiple IC's and how their different interactions with Dorothy cause Michael to re-examine how he's mistreated women himself.", "group_id": 2515, "id": 1305794}, {"user_id": 7664, "stars": [], "topic_id": 35149, "date_created": 1307389854.7977581, "message": "I've seen Bridesmaids. I have a feeling that there was more than one story going on there. \n\nAnnie seemed to have an SS Throughline with Megan -- rivals, basically. She also seemed to have one with the cop, Rhodes -- budding romance. I think his storyline was definitely a tale. \n\nI haven't thought about it too much, but I'm not sure there is a robust storyform for the wedding part of the movie.\n\nAt any rate, I think all characters do affect each other. It's not just the IC affecting the MC -- that seems like a needlessly strict reading. They all share a spectrum of approaches; the IC is just the furthest away.", "group_id": 2515, "id": 1310376}, {"user_id": 35323, "stars": [], "topic_id": 35149, "date_created": 1307432092.637033, "message": "well... as I see except from Territan, no one acutally referred to my question about distinction between Main Character and Main Player (supposing that there's such thing). Let's imagine a story in which there are only a limited amount of Players (e.g. Waiting for Godot, Little Red Riding Hood, etc.). It leads to a situation in which every Player conatins multiple Characters (archetypal or not). For example the same Player is the Protagonist and the Sceptic (he pursues his goals but sometimes he's sceptical about them). Let's imagine that there is another Player who has the characteristics of both the Guardian and the Sidekick. So there are four actual Characters in the story but only two Players. Let's imagine that the Guardian is the Impact Character, and the Protagonist is the Main Character. Wouldn't it be more precise to call the two Players the Main Player and the Impact Player instead (as in this case of complex characters only Players are visible to the audience directly)? I admit that this migh sound like I'm just playing with the words but - as I see - Dramatica introduces this Player-Character separation in the early stages but doesn't use it consistently later on. What do you think?", "group_id": 2515, "id": 1317766}, {"user_id": 30951, "stars": [], "topic_id": 35149, "date_created": 1307435182.2467179, "message": "I referred to your question. The post above start \"@Novbert, I think the main thing is...\"\n\nI personally don't think Protagonist and Sceptic together is two characters. I think that character just becomes a complex character. I don't think an audience could identify the two main archetypes in one OS character. It sounds to me we have just two complex characters, with one pursuing the Goal more than the other.\n\nRe. terminology, I'm not sure it makes any difference. I think the distinction between Main Character and OS character is clear enough. It does mean though that when talking Dramatica we need to adjust our normal language sometimes so not to add confusion, but I think that would apply no matter the terminology.\n\nI may have missed something though. I'm not aware of any player/character terminology separation in Dramatica. In your story, I think it would be more confusing (for me) if we couldn't use the word Character. Clearly, in my opinion, your story is two characters (complex).", "group_id": 2515, "id": 1318186}, {"user_id": 35323, "stars": [], "topic_id": 35149, "date_created": 1307435638.8814631, "message": "Mikeaja - thanks for clearing it up. I guess I forgot about OS and Subjective character distinction. Btw dramatica explicitly talks about Players on Page 28 when describing the Protagonist. On the other hand it also talks about putting the same OS character into the same player (Dr. Jekyll and Mr. Hyde) - I think it pretty much answers my question", "group_id": 2515, "id": 1318240}, {"user_id": 30951, "stars": [], "topic_id": 35149, "date_created": 1307437328.0833211, "message": "Interesting, will give that a re-read. I guess Dr. Jekyll and Mr. Hyde is a very specific example though - that pretty much takes the normal story approach and turns it on it's head (perhaps something like breaking the rules is ok when you know you are breaking them and why).", "group_id": 2515, "id": 1318464}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307448317.4787481, "message": "If you haven't already, check out the thread on MC in Ordinary People.  While it may not necessarily answer your question, Novbert, Chris's response provides perhaps an example to think about.  While I wish to find some other term for \"story\" when we're not discussing the overall story (ultimately, I view what happens between the credits as the story), there are two \"threads\"...", "group_id": 2515, "id": 1319545}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307448605.1110361, "message": "...going on there, both of which I would refer to as a subplot.  As Chris noted, each has their own MC, IC, etc., and are tightly wound within each other.  There are several scenes within the movie where all three characters (Beth, Conrad, Calvin) are playing out both \"threads\" in their respective throughlines, but they occupy different functions within each to each other...", "group_id": 2515, "id": 1319607}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307448885.592669, "message": "...for example, Beth is a steadfast IC in Calvin's \"thread\" of the story, but is the antagonist in Conrad's \"thread story\" (note, by \"thread\", I don't mean throughline).  So in these cases, there's one character taking on multiple functions.  This is how I'm interpreting it through Chris's answer in that thread, which perhaps exemplifies what you're talking about (and is demonstrative as to why I say this particular story is more complex than a lot of people want to give it credit for).", "group_id": 2515, "id": 1319672}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307486741.9792609, "message": "Chris, am I correct in saying there are scenes where both stories are taking place, where the players are taking on multiple functions dependent on their relative story?  (I can't think of a scene in particular, but any with Conrad, Calvin and Beth in them would be dealing with the two stories).  I guess what I'm trying to understand for future reference is that while we can have players employ or embody many different characters, it's possible to have them do so in the same scene.", "group_id": 2515, "id": 1329760}, {"user_id": 10814, "stars": [{"date_created": 1307486987.469913, "user_id": 7645}], "topic_id": 35149, "date_created": 1307485848.02246, "message": "This is a place where the using player is preferable to character.  Players are like the actors that embody characters.  They can be people, things, and sometimes even places or abstracts.\n\nIn the \"Ordinary People\" example, there is the Beth player, the Conrad player, the Calvin player, and the Therapist player, etc.  \n\nIn the main story story about a family dealing with a troubled and suicidal teen, the mother (Beth) is the antagonist, Conrad is the Change MC, the Therapist is Guardian and Steadfast IC, and Calvin is the sidekick.  (NOTE: This is a GROSS oversimplification for example purposes only.  I do not think there is an archetype in the bunch -- they are probably all complex OS characters.)\n\nIn the substory about a marriage on the rocks, Calvin is the Change MC and Beth is the Steadfast IC.", "group_id": 2515, "id": 1329389}, {"user_id": 10814, "stars": [], "topic_id": 35149, "date_created": 1307487478.090625, "message": "For example, Han Solo plays skeptic in the Mos Eisley cantina in the main story, and immediately switches to MC/protagonist in his Jabba the Hut substory once Greedo slips into the booth.\n\nSomething similar happens on the Death Star when R2D2 finds out that Leia is going to be terminated.  Han goes from being Skeptic to MC/Protagonist, while Luke becomes IC/Contagonist in the substory.", "group_id": 2515, "id": 1330118}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307486373.7737529, "message": "Ooops, re-read my comment about subplot, which I didn't mean to say as such, rather I don't think of them both as being subplots (as noted, one is the main story).", "group_id": 2515, "id": 1329620}, {"user_id": 30951, "stars": [], "topic_id": 35149, "date_created": 1307486829.5959849, "message": "But not in a single story I guess?", "group_id": 2515, "id": 1329797}, {"user_id": 10814, "stars": [{"date_created": 1307486985.2947199, "user_id": 7645}], "topic_id": 35149, "date_created": 1307486643.8757901, "message": "Another example would be Jerry Maguire.  It has two separate stories in one work which reuses many of the key players.\n\nIn the \"sports\" story, the sports agent with a conscience, Jerry Maguire, is the Steadfast MC and protagonist.  The star quarterback, Rid Tidwell, is the Change IC and contagonist (?).  There is also the sports agent's secretary that is somewhere between sidekick and guardian.\n\nIn the \"romance/family\" story, the secretary player, Dorothy Boyd, plays considering/feeling mother and Steadfast MC, Jerry Maguire is the Change IC and the pursuing romantic interest.  The mother's son is an OS sidekick or complex character.\n\nSo you can have players employ or embody many different characters.", "group_id": 2515, "id": 1329717}, {"user_id": 10814, "stars": [], "topic_id": 35149, "date_created": 1307487231.5554321, "message": "Yes, combining the player's duties in a single scene is done frequently.", "group_id": 2515, "id": 1330007}, {"user_id": 33839, "stars": [], "topic_id": 35149, "date_created": 1307487440.2718, "message": "@Mikeaja \"But not in a single story...\"  I think it may be applicable to a farce, like Some Like it Hot.  Haven't thought about that, but in some scenes, particularly with Tony Curtis, he's Josephine/Joe/and Shell (I'm thinking the one where he beats Daphne/Jerry back to the hotel and is in the bathtub).  Each player represents their own story, I would think, but in this instance it's all in one scene related to the Sugar thread.", "group_id": 2515, "id": 1330102}, {"user_id": 10814, "stars": [], "topic_id": 35149, "date_created": 1307487672.266717, "message": "In a single story, necessity frequently \"disposes\" of players, yet their functions must be picked up.  You CAN redistribute them to other characters, which requires a bit of fancy storytelling in order to avoid confusing the audience, or take the more common approach of \"handing off\" those traits to a new player.", "group_id": 2515, "id": 1330210}]