[{"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303675769.700027, "message": "I'm struggling with identifying my character roles in Dramatica terms.\n\nThere is an MC / Protagonist who falls for a girl.\nThe girl is not who she seems and has a negative effect on MC (until the end where she changes and becomes a positive force).\nShe is in league with a criminal who pulls the strings behind the scenes.\n\nA friend helps the MC/Protagonist at various stages in the story.\n\nWith the above info, do any character roles leap out to any of you?\n\nI can't decide whether the girl is Antagonist, Impact character, both or neither! Or should the impact character be the friend even though the impact is only to help through certain stages (not with the whole problem exactly)?\n\nThe criminal I assume should be either the antagonist or contagonist, but not the IC as this character does not have direct contact with MC until the end of the story.", "group_id": 2515, "id": 796524}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303683198.398531, "message": "I don't think the girl would be the IC since you don't see her till the end. You could make it work, but it would take some doing. The real question to ask is what are the issues personal to the MC and who challenges them? How does that challenger's point of view force the MC to grow? If you don't know that and don't know what it is you want to say with the film, you'll never be able to accurately answer your own questions. Objectively it seems like the girlnis Antagonist and the friend a Guardian.", "group_id": 2515, "id": 797183}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303685080.414573, "message": "Good points. I didn't mean girl is not seen till end, only that she is a sort of antagonist early on, but in the end helps out the protagonist (she changes her position fundamentally). The protagonist issues are similar to the protagonist in The Fugitive, imo. Everything is sort of ok until the antagonist and situation work against him. Therefore the MC/protagonist needs to put things back the way they were.", "group_id": 2515, "id": 797260}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303685323.096205, "message": "By the way, just realised who you are Jim. Love your articles and your site (layout is great).", "group_id": 2515, "id": 797270}, {"user_id": 7664, "stars": [], "topic_id": 21129, "date_created": 1303694187.8409641, "message": "I'm with Jim on this. If you can't answer the personal questions, it's difficult to answer the OS questions with any permanence.\n\nAs an aside, I feel like I have many outlines begin with two potential ICs, and pinning one down is unpredictable.", "group_id": 2515, "id": 797725}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303709913.7982521, "message": "Thanks Mikeaj!", "group_id": 2515, "id": 799902}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303719408.361495, "message": "When I consider the old and new Dramatica terms (I realise this is just terminology) 'Obstacle' character pushes me towards an antagonist type role, and 'Impact' towards a guardian type role. The girl is an antagonist who becomes a sidekick, and actually shares some of the characters difficulties which they solve together.... but only at the end.\n\nThis brings up a crucial question I must answer..... from a Dramatica POV, does the main story start before he meets the girl or after? The story worth telling is after, but the setting and introduction to the character is how things are before. So.......... if it starts before he meets the girl, then he has certain issues (that give him a personal goal), that lead him to get involved with girl. But if the main story starts after he meets the girl, then she create problems for him, and the MC's goal is to get back to the status quo, and grow to meet the new challenges. I think I understand my story very well, but not how to explain it to Dramatica. Or maybe this just highlights that I don't?", "group_id": 2515, "id": 801072}, {"user_id": 10814, "stars": [], "topic_id": 21129, "date_created": 1303743114.4757121, "message": "I don't think there is enough information (for us) to determine the nature of the inequities in the throughlines.  Your description is general and needs more specificity for constructive feedback.\n\nSo long as the girl shows up before the first act turn, it sounds like your story may be one that includes all of your material.  If you have her pop up after that, she cannot be the IC because the IC provides the influence/obstacles/impact on the MC and relationship that helps TURN the act.  The pressure from all four throughlines ensure the act turn once each throughline's signpost has been thoroughly explored.", "group_id": 2515, "id": 803925}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303826891.622386, "message": "I'm going to review the story completely, as I think this process has highlighted some issues, particular character roles. I think a weakness of mine with Dramatica is not having a good overall appreciation of the IC in contrast to the objective characters, when the IC is not a Guardian type (Obi wan as IC makes perfect sense to me). Do any well-known films come to mind that have an antagonist IC, or one who is definitely not a Guardian of any description? Sorry if this sounds lazy. I'm also going through the Dram. examples as well.", "group_id": 2515, "id": 814702}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303835144.2294061, "message": "The Joker in Dark Knight, Andy in Shawshank Redemption, Georg Dreyman in The Lives of Others, Arthur in Michael Clayton, Gatsby in The Great Gatsby, and others.", "group_id": 2515, "id": 816159}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303836084.166616, "message": "There's a handoff that goes on between Dent and the Joker, but the whole \"You're a freak, just like me\" is classic Impact Character dialogue. Gordon works more as a Guardian in the Obj. Story", "group_id": 2515, "id": 816369}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303836930.7251329, "message": "As far as the Dark Knight goes, the podcast where this dynamic was discussed can be found here: http://www.dramatica.com/podcasts/DUG0409.m4a", "group_id": 2515, "id": 816560}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303835985.1600521, "message": "Thanks. I'm starting to feel I should go back to the beginning. If you have asked me, I would have said I was certain Gordon (or possibly Dent) was the IC in Dark Knight. Not the Joker. Andy in Shawshank I get. ", "group_id": 2515, "id": 816343}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303836581.883538, "message": "Yeah... ok I can see that. But as far as challenging Batman's view, isn't this more about staying grounded / less vigilante due to Gordon not being corrupt? Perhaps I'm looking too black and white. Interestingly, I've just been researching some Dramatica stuff and came across another interesting character analysis:\n\n\"The Terminator: The story goal is to protect Sarah Connor. Kyle Reese is the protagonist/Impact Character. Sarah Connor is the Main Character.\"\n\nI'm going off on a tangent here, but I also wouldn't say Kyle is the protagonist. The goal for me in this films is 'Survival' (which Sarach Connor has to do before kyle arrives). So she would also be the protagonist. However, I completely ge Kyle being the IC.\n\nI might just be approaching the wrong way.", "group_id": 2515, "id": 816480}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303836838.377625, "message": "If anything, Sarah is Avoiding at the beginning. In Dramatica terms, the Protagonist is the one who Pursues the resolution of the Story Goal and gets other characters to Consider the efforts related to that Goal. The Goal is to keep Sarah alive which Kyle is *actively* pursuing.", "group_id": 2515, "id": 816540}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303836863.0723889, "message": "He also works to have her Consider the results of failing.", "group_id": 2515, "id": 816545}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303839100.854728, "message": "Thanks again, yeah, just been reading that analysis.", "group_id": 2515, "id": 816919}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303837398.8821471, "message": "Thanks! Will listen to that. Dark Knight is of particular interest because with the Joker being the IC, because it aligns quite well with my girl (in my OP).", "group_id": 2515, "id": 816631}, {"user_id": 7645, "stars": [], "topic_id": 21129, "date_created": 1303838217.4513099, "message": "Sure no problem. Thought of another example from Terminator. A Protagonist wouldn't simply sit there in a raging dance club from the 80s and let a metal monster train move that red dot up her forehead...that's when Kyle comes and does what a Protagonist should do. The analysis of Terminator is here: http://www.dramatica.com/story/film_reviews/reviews/Terminator.html", "group_id": 2515, "id": 816813}, {"user_id": 7664, "stars": [], "topic_id": 21129, "date_created": 1303840269.5153589, "message": "FWIW, I feel like I need to go back to the beginning at least twice a month.", "group_id": 2515, "id": 817108}, {"user_id": 30951, "stars": [], "topic_id": 21129, "date_created": 1303841715.8017819, "message": "Good to know! In my short time with Dramatica I've done that a lot.", "group_id": 2515, "id": 817303}, {"user_id": 7664, "stars": [], "topic_id": 21129, "date_created": 1303843524.79284, "message": "not to brag, but ... it's all I do. Learn... fumble... learn... fumble...", "group_id": 2515, "id": 817576}, {"user_id": 7664, "stars": [], "topic_id": 21129, "date_created": 1303844184.6125481, "message": "BTW, it's nice to see five people on line right now!", "group_id": 2515, "id": 817672}]