[{"user_id": 29866, "stars": [{"date_created": 1309557375.8499129, "user_id": 10406}], "topic_id": 40597, "date_created": 1309232767.158227, "message": "¿Alguien podría compartir algunos links con buenas ideas para crear un Business Plan?", "group_id": 965, "id": 1503112}, {"user_id": 29866, "stars": [{"date_created": 1309233647.2210629, "user_id": 26088}], "topic_id": 40597, "date_created": 1309233352.2874529, "message": "He encontrado las siguientes plantillas en Google Docs, a ver que les parece: http://bit.ly/kmOmu1 , http://bit.ly/mvBPWx , http://bit.ly/mIAjpz , http://bit.ly/lfvpCB", "group_id": 965, "id": 1503209}, {"user_id": 29866, "stars": [{"date_created": 1309235978.3577361, "user_id": 26088}], "topic_id": 40597, "date_created": 1309233957.246074, "message": "Ten Critical Steps to writing a Business Plan: http://bit.ly/jvocnS ", "group_id": 965, "id": 1503299}, {"user_id": 10406, "stars": [], "topic_id": 40597, "date_created": 1309285123.2343211, "message": "Espero que te sirva al menos de direccion http://www.hbs.edu/entrepreneurship/resources/businessplan.html", "group_id": 965, "id": 1507974}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309286282.8148589, "message": "Tengo 2 enlaces para compartir. Primero, la herramienta de cajon que la mayoria en este grupo conoce, pero siempre es util tenerla a la mano:\n\nhttp://businessmodelgeneration.com/canvas\n\nY segundo, este archivo con 500+ Business Plans de muestra para dar una idea de lo que compañias similares a la nuestra presentan:\n\nhttp://www.bplans.com/sample_business_plans.php\n\nPueden usar una o incluso combinar las dos y tendran un Business Plan ganador!", "group_id": 965, "id": 1508197}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309317807.852479, "message": "Gracias a ambos por las fuentes @fservin  @albrtk, bplans.com lo tengo en mi lista y el modelo de canvas también, estoy revisando más a fondo, esperando que el tema le sea útil a más de uno.", "group_id": 965, "id": 1514341}, {"user_id": 26421, "stars": [], "topic_id": 40597, "date_created": 1309367628.6244259, "message": "Te recomiendo un buen libro que tengo por ahí: \"El Plan de negocios - Antionio Borello\" muy bueno eh :) con ejemplos y todo. \n\nun saludo!", "group_id": 965, "id": 1518514}, {"user_id": 24160, "stars": [{"date_created": 1309369105.4471941, "user_id": 26088}, {"date_created": 1310357716.063976, "user_id": 37741}], "topic_id": 40597, "date_created": 1309368635.53091, "message": "Te recomiendo pensar en términos de modelo de negocios y modelo de adquisición de clientes. Creo que la tarea más importante de una startup es obtener aprendizaje validado sobre el mercado al menor costo y a la mayor velocidad posible.", "group_id": 965, "id": 1518781}, {"user_id": 24160, "stars": [], "topic_id": 40597, "date_created": 1309368574.8974049, "message": "Lo siento, tampoco creo en el plan de negocios :P", "group_id": 965, "id": 1518759}, {"user_id": 2946, "stars": [], "topic_id": 40597, "date_created": 1309370993.7197361, "message": "http://37signals.com/svn/posts/1805-lets-just-call-plans-what-they-are-guesses relevant", "group_id": 965, "id": 1519425}, {"user_id": 2946, "stars": [], "topic_id": 40597, "date_created": 1309371328.2142119, "message": "El problema con lo que hay dentro de la cabeza del emprendedor es que  -- como dice Arturo Garrido -- son chaquetas mentales hasta que las has validado. En una metodología Lean, los planes son assumptions y la meta es validarlas cuanto antes. \n\nEl problema con el business plan es que puede tomarte meses y no aporta nada a tu producto. Hasta donde tengo entendido, un buen inversionista entiende esto.", "group_id": 965, "id": 1519552}, {"user_id": 29866, "stars": [{"date_created": 1309371670.9463379, "user_id": 19921}, {"date_created": 1311376770.9975171, "user_id": 36313}], "topic_id": 40597, "date_created": 1309370790.5435779, "message": "@cesarsalazar Un plan de negocios tiene estos conceptos que expones \"modelo de adquisición de clientes\" pienso que hablas del  \"marketing plan\" y el \"modelo de negocios\" imagino que te refieres al \"Business Model\" todos ellos son parte de un \"Business Plan\" y es básico para cualquier startup que quiera en verdad levantar fondos, en resumen es \"es una ventana que muestra lo que hay dentro de la cabeza del emprendedor, es un camino para mostrar \"como\" piensa el emprendedor\".", "group_id": 965, "id": 1519371}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309372916.1484389, "message": "@josuegio Le has dado al clavo.", "group_id": 965, "id": 1519883}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309371642.7617619, "message": "Ahora resulta que el juego es como lo he \"jugado\" siempre, lanzar y ver si pega, el llamado \"Spaghetti Method\"....", "group_id": 965, "id": 1519617}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309371165.979085, "message": "@soska de acuerdo, pero es necesario tener un \"plan\" si es de \"supuestos\" o es de \"negocios\" al final es importante tener el plan para tener una guia y para poder expresar a tus inversionistas cual es el plan a seguir... sean de \"guesses\" o de \"business\" o no?", "group_id": 965, "id": 1519486}, {"user_id": 24160, "stars": [], "topic_id": 40597, "date_created": 1309371228.2988701, "message": "@josuregio Llámale \"Game plan\" y que tenga metas de corto plazo", "group_id": 965, "id": 1519511}, {"user_id": 24160, "stars": [{"date_created": 1309372616.9740779, "user_id": 29866}, {"date_created": 1310357804.6744421, "user_id": 37741}, {"date_created": 1310492279.6676731, "user_id": 36952}], "topic_id": 40597, "date_created": 1309372603.8302979, "message": "@albrtk Si tu inversionista no te entiende, mejor que no sea tu inversionista", "group_id": 965, "id": 1519826}, {"user_id": 2946, "stars": [{"date_created": 1309374471.2268109, "user_id": 26088}, {"date_created": 1309422247.1427109, "user_id": 24172}, {"date_created": 1310357765.0698669, "user_id": 37741}], "topic_id": 40597, "date_created": 1309371931.5920341, "message": "Yep. Fail fast. En vez de pasar 3 meses escribiendo un plan de negocios gasta 1 haciendo un prototipo y muéstralo a tus usuarios. Escúchalos. Itera. Repite. Tu misión es antes que nada, crear un producto para el que existe un mercado, lo que se llama \"product/market fit\".", "group_id": 965, "id": 1519674}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309372147.865319, "message": "@soska Justo estoy en esa etapa en este momento, tengo unos pequeños \"game plans\" para encontrar a los Early adopters y trabajando en el producto... estaba justo ahora comenzando a trabajar en el \"Business Plan\" pero como bien dices, tomara algunos meses en ser terminado, tomaré sus \"sugerencias\" y seguiré en el producto...", "group_id": 965, "id": 1519723}, {"user_id": 2946, "stars": [], "topic_id": 40597, "date_created": 1309372238.1721239, "message": "@josuegio Pero recuerda la parte de \"escuchar a tus clientes\". Tienes que involucrarlos cuanto antes posible.", "group_id": 965, "id": 1519740}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309372664.0851099, "message": "@josuegio Excelente! No se que tipo de producto estes generando, pero estas tomando la ruta correcta en mi humilde opinión.", "group_id": 965, "id": 1519837}, {"user_id": 29866, "stars": [{"date_created": 1309373349.2404239, "user_id": 24160}, {"date_created": 1309374628.75089, "user_id": 26088}], "topic_id": 40597, "date_created": 1309373322.3841381, "message": "@albrtk Tampoco hay que perder el tiempo en \"evangelizar un mercado\" o \"convencer clientes de que lo que le ofreces es lo mejor\" solo hay que resolverles un problema y buscar mercados más especializados, nichos. Otra cosa, no perder tiempo en el mercado latinoamericano desgraciadamente a \"mi parecer\" el mercado latino es lo que se llama \"Late Majority\" o \"Laggards\" hay que ser un poco más ambiciosos y lanzar propuestas en \"Ingles\" ya después pensar en el mercado latino. Hablo en términos de \"maximizar recursos invertidos\".", "group_id": 965, "id": 1519995}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309372872.724196, "message": "@cesarsalazar Claro, siempre es mejor un inversionista que te entiende.", "group_id": 965, "id": 1519871}, {"user_id": 19921, "stars": [{"date_created": 1309372598.667829, "user_id": 2946}], "topic_id": 40597, "date_created": 1309372494.3640521, "message": "Seamos honestos: ustedes y yo podemos decir y creer que los planes de negocio no sirven y que son adivinanzas. Perfecto. Pero tambien hay que verlo desde el punto de vista de el inversor. \n\nSi estamos en el mismo canal que nuestros inversores y ellos saben que el plan es a corto plazo, y que con un executive summary le basta, enhorabuena. Pero tambien estan los inversores con mas años de experiencia y que no necesariamente estan tan metidos en las filosofías de inversion actuales y no van a apreciar que un emprendedor les llegue con sus metodologias modernas a querer cambiar sus maneras. Ese es mas el tipo de inversor que hay en este pais y al cual tenemos que apelar por razones de logistica o conveniencia. \n\nLo bueno de todo esto es que hay un punto intermedio. Si le demuestras a cualquiera de ambos arquetipos de inversionista que acabo de mencionar un prototipo funcional y con traccion que lo respalde, va a estar dificil que te puedan decir algo mas que \"cuando firmamos el contrato?\" \n\nTen en cuenta que todo lo anterior es solo si te interesa levantar inversión desde una etapa temprana. En caso contrario, tus clientes seran los mejores inversionistas que podras tener, siempre y cuando cobres por tu producto/servicio desde el primer dia y obtengas tracción. \n\nTL;DR: Segun el sapo la pedrada.", "group_id": 965, "id": 1519801}, {"user_id": 2946, "stars": [{"date_created": 1309372914.5808899, "user_id": 24160}, {"date_created": 1309374640.241159, "user_id": 3265}, {"date_created": 1309422247.5313921, "user_id": 24172}], "topic_id": 40597, "date_created": 1309372815.343574, "message": "@cesarsalazar Cierto. Si estás desarrollando el tipo de producto que requiere de una gran inversión para empezar ( El siguiente Google? el siguiente Facebook? ) un inversor que no está \"tan metidos en las filosofías de inversion actuales\" probablemente no lo va a entender.\n\n-- Los internets? No goey, la lana está en las vacas. Cómprate unas vacas y procesa la leche.", "group_id": 965, "id": 1519859}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309372876.539521, "message": "@albrtk lo mejor es no perder tiempo con inversionistas que no saben nada de tech startups, hay que ir directo a las incubadoras en USA, ellos no discriminan startups, otra cosa es estar dispuesto al ser aceptado a armar tu maleta y moverte con tu equipo.", "group_id": 965, "id": 1519873}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309373057.4256749, "message": "@soska En este caso creo que las vacas serian bienes raices. Especialmente el DF y area metropolitana se estan caracterizando mucho por ese tipo de inversionistas hasta donde se y probablemente por no tomar en cuenta a los Startups de tecnología no les vaya a salir un retorno tan atractivo como a los que si se \"arriesgaron\".", "group_id": 965, "id": 1519921}, {"user_id": 24160, "stars": [], "topic_id": 40597, "date_created": 1309373387.9566081, "message": "@albrtk Muy de acuerdo, y si decides ir por el mercado mexicano es porque no te ves más que siendo el líder de un mercado de decenas de millones de usuarios", "group_id": 965, "id": 1520014}, {"user_id": 19921, "stars": [], "topic_id": 40597, "date_created": 1309373409.563266, "message": "@josuegio Ouch, fuerte pero cierto.", "group_id": 965, "id": 1520019}, {"user_id": 29866, "stars": [], "topic_id": 40597, "date_created": 1309374416.9869571, "message": "@albrtk De lo que comentas en Bienes Raíces en México, todo es cuestión de conocimiento, recientemente una empresa compro 250,000 acciones de Facebook en Secondmarket pago por acción cerca de 25 USD por cada uno, un total de 6.2 MDD y unos 70MDP, las empresas en México usan este dinero sin problema para comprar Bienes Raices y saben muy bien que \"difícilmente\" invertir este mismo dinero en la \"BMV\" le pueda rendir una utilidad como la que ofrecen los \"Bienes Raíces\" en termino de años, si ellos conocieran como se esta moviendo actualmente el mercado de las Tech Stars en USA sabrían que una acción de Linkedin se vendía antes del IPO en estas cantidades y que después del IPO estaban 4 veces al valor. Entonces, entonces si tendrías a más inversores mexicanos invirtiendo en TechStars, si estos mismos conocieran historias de Inversionistas Angeles como Luis Martín Cabiedes + Privalia y el jugoso \"exit\" que tuvo. Serían más los que voltearían a ver a las TechStars... pero todos son \"guesses\"....", "group_id": 965, "id": 1520261}, {"user_id": 29866, "stars": [{"date_created": 1309375785.2635889, "user_id": 26088}], "topic_id": 40597, "date_created": 1309375011.6481299, "message": "@keoz Lanza, lo peor que te puede pasar es que recibas una llamada de algún VC o Business Angel que quiere invertir en tu empresa...", "group_id": 965, "id": 1520429}, {"user_id": 26088, "stars": [], "topic_id": 40597, "date_created": 1309374673.2533951, "message": "@josuegio si yo por eso ya quiero lanzar a nivel mundial a ver como se comporta esto :)", "group_id": 965, "id": 1520332}, {"user_id": 37741, "stars": [], "topic_id": 40597, "date_created": 1310358714.8311541, "message": "Hace muchos años Eisenhower dijo:  \"in war plans are useless, but planning is indispensable\". Yo creo que lo mismo aplica en el caso de los business models. A la hora de la hora todos los planes se pueden ir a la mierda pero tenerlos como punto de referencia es indispensable. A esto solo le agregaría la indispensable filosofía de \"Fail fast, fail often, fail cheap\" Como dice @cesarsalazar y @soska", "group_id": 965, "id": 1609579}, {"user_id": 37911, "stars": [{"date_created": 1311127250.3060241, "user_id": 35000}], "topic_id": 40597, "date_created": 1310483202.790868, "message": "Checa esté Software, es para Windows y te ayuda a estructurar tu Plan de Negocios paso a paso, te genera toda la parte financiera a partir de unas cuantas variables, cuenta con videos muy explicactivos de cada una de las secciones y de como utilizar el Software, me parece muy completo, alguien mas lo ah utilizado?' http://empreware.com", "group_id": 965, "id": 1620407}, {"user_id": 37605, "stars": [], "topic_id": 40597, "date_created": 1310535306.826591, "message": "Dependiendo de la etapa en la que estén ( y cabe mencionar que no soy muy fan de los planes de negocios tampoco, hasta ya muuucho después) les recomiendo mucho http://guide.launchbit.com/. Cuesta, pero si lo que tienen es una idea y quieren alguna estructura para desarrollarla se me hace el mejor recurso que he encontrado (p.d. no tengo ningún interés mas que me encanta la guía que crearon)", "group_id": 965, "id": 1626569}, {"user_id": 26200, "stars": [], "topic_id": 40597, "date_created": 1311018409.395066, "message": "\"The business plan is the new category of literary fiction\" --Alain de Botton   :-P", "group_id": 965, "id": 1666078}, {"user_id": 35000, "stars": [], "topic_id": 40597, "date_created": 1311871143.700937, "message": "Aqui un taller que va a ver en el DFectuoso para planes de negocios el 4 de agosto http://www.bpxpress.com.mx/", "group_id": 965, "id": 1740570}]