[{"user_id": 38285, "stars": [], "topic_id": 42536, "date_created": 1311427927.1174231, "message": "Nowhere in the theory book have I read anything that describes a character changing his approach in the level of Elements. So what on earth is this?", "group_id": 2515, "id": 1705658}, {"user_id": 38285, "stars": [], "topic_id": 42536, "date_created": 1311427431.574151, "message": "I have never quite understood what Jim is saying in this article:http://storyfanatic.com/articles/story-structure/four-acts-not-three", "group_id": 2515, "id": 1705640}, {"user_id": 38285, "stars": [], "topic_id": 42536, "date_created": 1311428399.994761, "message": "The only thing I'm familiar with is that the type of concern changes in each act; like, for example, Doing->Learning->Understanding->Obtaining. Never heard of Elements changing until I read Jim's article and was completely confused.", "group_id": 2515, "id": 1705674}, {"user_id": 7664, "stars": [], "topic_id": 42536, "date_created": 1311437300.210865, "message": "Most story theories break down stories into 3 segments. \nI actually think that most theories break character development into TWO segments -- the character approaches the problem the old way (the way they would have done it prior to this story... and it's not working) and then they ditch that and start adopting a new way of approaching the problem.\nJim is saying, nah, it's neither. It's a four step process.\n\nBut, he's just using the theory as a lens to highlight the four phases. This isn't drawn directly from the theory, as far as I know.", "group_id": 2515, "id": 1706048}, {"user_id": 7645, "stars": [], "topic_id": 42536, "date_created": 1311461641.5768099, "message": "What Mike said. Emphasis was on the four movements, not the usual three. Sry if it causes confusion for you.", "group_id": 2515, "id": 1707349}, {"user_id": 38285, "stars": [], "topic_id": 42536, "date_created": 1311624677.366205, "message": "@jimhull No need to apologize. Your site has been tremendously helpful in getting rid of the many erroneous notions I came to believe after reading a bunch of books on story structure. But the thing in your Jaws article that's confusing me is that you talk about Elements as the four acts: PRESERVATION, INACTION, REACTION, PROACTION. But aren't the four acts in a complete story Types not Elements? That's what the theory book says and that's what you say in this article: http://storyfanatic.com/articles/story-structure/the-reason-for-acts \"When it comes to physical activities like this, the four basic contexts are DOING, OBTAINING, UNDERSTANDING and LEARNING.\"", "group_id": 2515, "id": 1718268}, {"user_id": 7645, "stars": [], "topic_id": 42536, "date_created": 1311625516.997983, "message": "Well yeah, you could take any quad and use that for the basis for acts, i guess it was more illustrative than demonstrative. I should put something in there about that though.", "group_id": 2515, "id": 1718400}]