[{"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318467762.77702, "message": "I shared this once before quite a while back, but I've now recoded it so that you can upload the Story Engine report from Dramatica, and get a visual, bird's-eye-view of what's going on in your story form. Try it out (and let me know if anything seems to not be working).\n\nhttp://jefferycotton.net/dramatica/themeexplorer/themeexplorer.aspx", "group_id": 2515, "id": 2335967}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318467810.3447471, "message": "Jesus, I don't know why this is formatted so strangely... but, check it out.", "group_id": 2515, "id": 2335975}, {"user_id": 7664, "stars": [], "topic_id": 46490, "date_created": 1318471473.9060371, "message": "Anyway, the solution is to enter some text, and then paste *inside* the text you enter. Then erase the \"extra\" text, which has now done its job.", "group_id": 2515, "id": 2336397}, {"user_id": 7664, "stars": [], "topic_id": 46490, "date_created": 1318471430.7048991, "message": "If you cut and paste, the text does that weird thing. I think people like it for computer programming.", "group_id": 2515, "id": 2336393}, {"user_id": 37586, "stars": [], "topic_id": 46490, "date_created": 1318482644.372895, "message": "everything is right but MC is where OS should be and SS is where MC should be and OS is where IC should be.", "group_id": 2515, "id": 2337238}, {"user_id": 37586, "stars": [], "topic_id": 46490, "date_created": 1318526925.897332, "message": "@PhillyJeff I should say it's the through lines that r in the wrong column. Thus is very cool. How do you apply it?", "group_id": 2515, "id": 2340663}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318606113.9732261, "message": "I just use it as a visual aid to seeing relationships between the throughlines and signposts. For example, in my storyform, I find it interesting that the IC's Concern of \"Playing a Role\" is also the OS Cost, while the MC's Concern of \"Doing\" is also the OS Dividend. While all that is available in the Story Engine Settings report, this visual aid makes those kinds of relationships more immediately clear.", "group_id": 2515, "id": 2346771}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318617331.019141, "message": "OK, I fixed the problem with things being in the wrong column... sorry about that!", "group_id": 2515, "id": 2348168}, {"user_id": 38500, "stars": [{"date_created": 1318623222.0748451, "user_id": 37586}], "topic_id": 46490, "date_created": 1318622465.1856599, "message": "Here's the link again: www.jefferycotton.net/dramatica/themeexplorer/themeexplorer.aspx", "group_id": 2515, "id": 2348721}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318627536.4173801, "message": "Well -- I had to take it down. I discovered (which is why I wasn't seeing the problem with things in the wrong colums) that Dramatica is not consistent in the order it places the four throughlines in the Story Engine Settings Report, so I can't depend on things being on certain line numbers in the file. I'm going to have to rework it to be sensitive to the various captions...  grrrrrrrr........", "group_id": 2515, "id": 2349239}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318630435.7276881, "message": "All right.... I'm gonna go out on a limb here and claim that it IS now working!", "group_id": 2515, "id": 2349599}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1318725092.6755919, "message": "If any of you have suggestions for modifications to it, please let me know.", "group_id": 2515, "id": 2357590}, {"user_id": 36525, "stars": [], "topic_id": 46490, "date_created": 1318733383.1069989, "message": "Since a lot of people don't seem to have access to the Instant Dramatica applet, if you did a visual representation of the Chrono Syn contents of that People might find it helpful.  Although you might want to adjust the location of the symptom/response/problem/solution parts since there seems to be general agreement they are in the wrong place.", "group_id": 2515, "id": 2358343}, {"user_id": 30951, "stars": [], "topic_id": 46490, "date_created": 1321119948.7129841, "message": "Hi PhillyJeff. I like the idea of this a lot. I'm curious though - how do you plan to use the info in yellow (matching items)? What I mean is, how will this help you write? I'm not saying it's not useful, just would like to hear your thoughts on it (and anyone elses of course).\n\nGreat bit of coding. Shame it's not PHP, as then I could help out (if you wanted it). Did you manage to make it recognise captions instead of order?", "group_id": 2515, "id": 2559963}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1321391190.344775, "message": "It just gives me a high level perspective on where the thematic relationships are. For example, in the story form I am working with, Impulsive Responses is the Concern of the M/I throughline. But it is also the OS Consequence. Playing a Role is the IC's Concern, but it is also the OS Cost. I look at it as a way of keeping fresh in my mind that a single element can serve multiple functions from one Throughline to another.", "group_id": 2515, "id": 2579908}, {"user_id": 38500, "stars": [], "topic_id": 46490, "date_created": 1321391322.6286731, "message": "And yes, it now parses based the throughline captions.", "group_id": 2515, "id": 2579925}, {"user_id": 7664, "stars": [], "topic_id": 46490, "date_created": 1321583370.4924591, "message": "Just to remind you (everyone), it doesn't have to be the same representation of Playing A Role -- it can be different. (And usually is??)", "group_id": 2515, "id": 2592880}, {"user_id": 13109, "stars": [], "topic_id": 46490, "date_created": 1322162331.836381, "message": "I am having an issue making this work.  Is there any particular extension I should be using when I export the Story Engine Settings report?  I am on a Mac and it doesn't seem to add a default extension. Cheers", "group_id": 2515, "id": 2631887}]