[{"user_id": 32888, "stars": [], "topic_id": 36879, "date_created": 1306406702.822823, "message": "\"give an explanation of the biblical foundations of the doctrine of salvation (soteriology)\"\n\nWhat do you think that question is asking me to actually do?", "group_id": 9787, "id": 1190865}, {"user_id": 32888, "stars": [], "topic_id": 36879, "date_created": 1306407475.6398089, "message": "to clarify why I am paralysed by this question, I have 200-300 words to do this in...", "group_id": 9787, "id": 1190938}, {"user_id": 32900, "stars": [], "topic_id": 36879, "date_created": 1306409332.922163, "message": "I would write a comparative essay of ransom theory vs satisfaction theory - whether that is actually what they want....who knows...ask the lecturer/marker/whatever-you-call-her-him", "group_id": 9787, "id": 1191109}, {"user_id": 32900, "stars": [], "topic_id": 36879, "date_created": 1306409356.990623, "message": "comparative with scriptural backing of course, not just opinion", "group_id": 9787, "id": 1191110}, {"user_id": 13817, "stars": [], "topic_id": 36879, "date_created": 1306431857.8657479, "message": "@pevans_om In 300 words :) Good luck.", "group_id": 9787, "id": 1194416}, {"user_id": 13817, "stars": [], "topic_id": 36879, "date_created": 1306432011.4779501, "message": "@LintonCaldecott Any more clarity on this? So you need to explain the biblical foundations... ummm... We see scripture and it says some stuff about being saved and we make a doctrine outlining that. Jeepers dude. This is why I don't study. Questions are never in the dumb English that I understand.", "group_id": 9787, "id": 1194443}, {"user_id": 32891, "stars": [], "topic_id": 36879, "date_created": 1306480830.2579379, "message": "Is it 'movies'? Wow.. I thought in these days of outcomes based education you'd have a little more guidance.. My guess would be that they're looking for the key verses (OT & NT) that instruct us about the plan of salvation through Jesus? Possibly through the various Covenants? Good luck to you though..", "group_id": 9787, "id": 1201790}, {"user_id": 32888, "stars": [], "topic_id": 36879, "date_created": 1307048267.5160379, "message": "I've run out of time! I went with the easy answer.\nNecessity for salvation; Romans 3:23, all are in need of forgiveness for sinning against God. \nWhat we are saved from; I have been saved from the consequence of sin, which is death. (Romans 6:23), I am being saved from the power of sin in my life (Romans 8:5-8), I will be saved from the hold of sin on my life permanently and into the full conformity of Jesus.\nFaith and works; We are saved by grace through faith (Ephesians 2:8) This is not a thing that we can do, or could have done, it is imparted to us by God as a gift. No human activity can bring about reconciliation with God. Man sins against a perfect infinite God, the only one worthy and powerful enough to pay such a debt and ransom us would be a perfect and infinite God. Salvation is not a lawless state (TEE 2:114), by no means, Paul gathers all people together as condemned and guilty in the early chapters of Romans, he describes the work and price paid by Christ in the later chapters, and in Chapter 12 he sums things up saying we should offer our bodies as a living sacrifice by the mercies of God, which he outlined in the earlier chapters of Romans. Offering our lives as living sacrifices is our spiritual act of service, or as some translations say it, our reasonable (in light of what God has done) act of service (Amplified, KJV). Faith without the evidence of works cannot be said to be real faith at all Ephesians 2:10, James 2:14). \nAdoption; We are children of God by adoption through the work of Christ (Galatians 4).", "group_id": 9787, "id": 1271290}, {"user_id": 32900, "stars": [], "topic_id": 36879, "date_created": 1307183844.911792, "message": "pfff....take the easy way out huh?", "group_id": 9787, "id": 1285525}, {"user_id": 13817, "stars": [], "topic_id": 36879, "date_created": 1308044630.710808, "message": "@LintonCaldecott Did you get any feedback? Did you do it right in the eyes of the collage?", "group_id": 9787, "id": 1389344}, {"user_id": 32888, "stars": [], "topic_id": 36879, "date_created": 1308050586.3551869, "message": "no feedback from college yet. They take weeks to get back to you, if not more. It's a product of using SAPO for correspondence", "group_id": 9787, "id": 1390163}]