[{"user_id": 11626, "stars": [], "topic_id": 8704, "date_created": 1298532931.103945, "message": "CHICAGO – Membership in anti-government extremist groups continues to explode in the United States amid frustration over the lagging economy and the \"mainstreaming of conspiracy theories,\" a study released Wednesday found.\r\n\r\nAfter nearly tripling in 2009 in the wake of the election of the nation's first black president, anti-government 'patriot' groups and militias grew another 61 percent in 2010 to 824, the report by the Southern Poverty Law Center found.\r\n\r\nMeanwhile, the number of active hate groups rose 7.5 percent to top 1,000 for the first time since the civil rights group first began tracking them in the early 1980s.\r\n\r\nCombined with modest growth among anti-immigrant \"nativist extremists,\" the number of radical right extremist groups rose 22 percent in 2010 to 2,145 after jumping 40 percent in 2009.\r\n\r\n\"For many on the radical right, anger is focusing on President (Barack) Obama, who is seen as embodying everything that's wrong with the country,\" the report concluded.\r\n\r\n\"What may be most remarkable is that this growth of right-wing extremism came even as politicians around the country, blown by gusts from the Tea Parties and other conservative formations, tacked hard to the right, co-opting many of the issues important to extremists.\"\r\n\r\nThe report citing a number of cases in which conservative Republicans -- who made major gains in November's mid-term elections -- are pursuing legislation which \"could help deflate some of the even more extreme political forces.\"\r\n\r\nArizona passed a stringent law aimed at cracking down on illegal immigration, giving police broad powers to detain anyone suspected of being in the state illegally.\r\n\r\nOklahoma voters passed a measure prohibiting judges from considering Islamic law, prompting lawmakers to pass similar rules in Arizona, Florida, Louisiana, South Carolina, Tennessee and Utah.\r\n\r\nThere have also been calls to change the 14th amendment to the US Constitution, which grants citizenship to anyone born on US soil.\r\n\r\nLegislators across various US states meanwhile, are trying to coordinate efforts in a bid to deny birth certificates to the children of unauthorized immigrants.\r\n\r\nThey are also seeking to deny the children of illegal immigrants benefits such as Medicaid that are guaranteed to US citizens.\r\n\r\nMeanwhile, a Virginia legislator proposed a law to create an alternative currency in the event of the \"destruction\" of the dollar and a Montana legislator wants to require federal agents to get permission from local sheriffs to act in their counties.\r\n\r\n\"It's hard to predict where this volatile situation will lead,\" the report said.\r\n\r\n\"What seems certain is that President Obama will continue to serve as a lightning rod for many on the political right, a man who represents both the federal government and the fact that the racial make-up of the United States is changing, something that upsets a significant number of white Americans.\r\n\r\nAnd that suggests that the polarized politics of this country could get worse before they get better.\"\r\n\r\nThe threat of violence is quite real, the report noted.\r\n\r\nIn an 11-day period in January, a neo-Nazi was arrested headed for the Arizona border with a dozen homemade grenades, police averted an attack on a Martin Luther King Jr. Day parade in Spokane, Washington after discovering a bomb in a backpack, and a man with a long history of anti-government activities was arrested outside a packed mosque in Michigan and charged with possessing explosives with unlawful intent.\r\n\r\nMeanwhile, the call for more civility in political discourse in the wake of the shooting of Democratic Congresswoman Gabrielle Giffords in Arizona in an attack that left six dead seems to have had little impact.\r\n\r\nhttp://www.rawstory.com/rs//wp-content/uploads/2011/02/antigovernmentgroups_1298492617809-1-0.jpg\r\n\r\nhttp://www.rawstory.com/rs/2011/02/23/anti-government-extremist-groups-on-rise-in-us-study/", "group_id": 3920, "id": 195893}]