[{"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312922967.1370111, "message": "So if you're interested -- and we'll definitely keep this going here for now -- but if you're interested in Dramatica and want to see if we can make the community even better, please head over to http://area51.stackexchange.com/proposals/34364/dramatica-theory-of-story?referrer=QqN4FKzLhgw9rk9eRLhWhQ2 and sign up.", "group_id": 2515, "id": 1834455}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312923038.72528, "message": "We need at least 60 followers before we can get out of the Definition phase. We only have 46 here, and that took 6 months to build, so I'm not anticipating this happening any time soon. But please add your name if interested. Also, look around at other Q&A sites built on the same engine there and see if you think it would be a good thing to discuss Dramatica.", "group_id": 2515, "id": 1834466}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312922919.877686, "message": "In my never-ending quest to find greater and greater tools for enriching the Dramatica community, I've come across a Q&A Site service built on the StackOverflow engine (which you may have come across in your travels across the internet from time-to-time). With specific tools and design that encourage expert responses, it's my feeling that this could be a good \"upgrade\" from Convore. Comments or responses can be upvoted or downvoted depending on the appropriateness of the answer, making it easier for those in search of help to get the information they need and quickly return to their writing. Tagging and other tools for organizing the responses and discussions make this a good tool for increasing one's knowledge of the theory.", "group_id": 2515, "id": 1834443}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312923138.8927889, "message": "If you do sign up, please add a possible sample question, or even a question you think would NOT be appropriate for discussion there. During this setup phase there needs to be detailed conversation about what we should be talking about and how we can better help those new to the theory who want to improve their writing.", "group_id": 2515, "id": 1834477}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312923185.650717, "message": "The more activity over there, the quicker we can get it setup. Thanks, and happy writing!", "group_id": 2515, "id": 1834486}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312923247.8757131, "message": "One last thing, be sure to upvote or downvote the questions as you see fit (you can't work your own), that way we can get a feel for what people are interested in discussing.", "group_id": 2515, "id": 1834497}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1312939014.7955649, "message": "I'm in, but probably won't be able to begin participating until Friday or the weekend.", "group_id": 2515, "id": 1836013}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312939850.866868, "message": "Sweet. Only 58 to go.", "group_id": 2515, "id": 1836106}, {"user_id": 35369, "stars": [], "topic_id": 43540, "date_created": 1312941081.909539, "message": "In too, good idea. Have you checked out Quora at all as well?", "group_id": 2515, "id": 1836288}, {"user_id": 33839, "stars": [], "topic_id": 43540, "date_created": 1312943047.7974579, "message": "I signed up.  Got my nifty avatar photo of me wearing my Avatar 3D glasses. I thought they were quite fashionable... if only I could see subliminal messages with them and utter classic lines like \"I came here for two reasons.  To kick ass and chew bubble gum... and I'm all out of bubble gum\".", "group_id": 2515, "id": 1836545}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312950657.0279231, "message": "Yeah quora is cool. I just like the features on this StackExchange. We can play around and see how it works.", "group_id": 2515, "id": 1837389}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1312957938.885402, "message": "Lame. Well the nazis over there have already closed it. Apparently it was too close to a \"Writers\" QandA board which is ridiculous. Thanks for those who gave it a try.", "group_id": 2515, "id": 1837799}, {"user_id": 33839, "stars": [], "topic_id": 43540, "date_created": 1312978346.0875311, "message": "Yeah, that was pretty weak.  It's like lumping Rebecca Black fans in with Madonna because it's all \"pop music\".", "group_id": 2515, "id": 1839034}, {"user_id": 10814, "stars": [], "topic_id": 43540, "date_created": 1312997954.232147, "message": "I agree that their closing it is a bit lame.  Perhaps it would be better to create a broader category called \"Story.\"  It does not duplicate any of their current proposed 'sites', might get a lot of other people discussing story, and Dramatica can be a subset of the Story category.  As it is now, the categories are either format driven (literature, movies, etc.) or the process of writing.", "group_id": 2515, "id": 1841248}, {"user_id": 10814, "stars": [], "topic_id": 43540, "date_created": 1312998032.697516, "message": "That said, it looks like their site is relatively new and not well established in terms of participants.  Combining that with our low numbers here might make creating a go of it on their site difficult.", "group_id": 2515, "id": 1841267}, {"user_id": 37531, "stars": [], "topic_id": 43540, "date_created": 1313159722.4165089, "message": "Wonder if \"placing it\" in their \"technology\" area and relating it just to the software would resolve the issue? In looking about on the site it is a curious mix and doesn't look like the site is really acquiring a lot of \"followers.\"", "group_id": 2515, "id": 1857425}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313165858.893548, "message": "Probably best just to build it myself...for now though this works well, and its encouraging to see the numbers grow.", "group_id": 2515, "id": 1858097}, {"user_id": 7664, "stars": [], "topic_id": 43540, "date_created": 1313171617.9119949, "message": "Bummer.", "group_id": 2515, "id": 1858481}, {"user_id": 10814, "stars": [], "topic_id": 43540, "date_created": 1313186647.9404049, "message": "Agreed.", "group_id": 2515, "id": 1860022}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313385537.6829951, "message": "@Jim: if you want any help building it, let me know -- I'm a web programmer and can handle the application/back-end stuff.", "group_id": 2515, "id": 1873995}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313385608.964602, "message": "Although I'm pretty exclusively a .NET guy, just fyi.", "group_id": 2515, "id": 1874001}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1313389321.1493521, "message": "Hi, I just found this option.  I have been dying without my dramatica talk, with the dram listserv down.  I understand Bill had a server nightmare.  Hopefully, that will eventually resolve itself...there are rumors.  In the meantime, I have been active with acting classes and have come to the conclusion that a Dramatica for Actors is the next step in the dram journey for the software company.  I guess I should start a topic about it.", "group_id": 2515, "id": 1874203}, {"user_id": 33839, "stars": [], "topic_id": 43540, "date_created": 1313416870.357595, "message": "Here's a question to throw out: there's a lot of useful resources available online, especially with film analysis... but is there anyplace where people actually workshop their own stories/scripts?  I know some people hold their stuff pretty close and wouldn't feel comfortable, but others who are learning this might find it invaluable to have that type of interactive feedback.", "group_id": 2515, "id": 1875933}, {"user_id": 36525, "stars": [], "topic_id": 43540, "date_created": 1313654211.289001, "message": "@JBarker - I'm interested in workshopping actual scripts/stories.  I'd be hesitant to be the one doing the interpretation/critique, since I think that would lead to controversy.  I'd enjoy it, but I don't think it would turn out happily.  But I've got a dozen synopses I'd be willing to release to a group who wanted to practice Dramatica-izing them.", "group_id": 2515, "id": 1900256}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1313731695.549747, "message": "The Stacked idea really appeals to me. There seems to be some open-source versions of it emerging, but aren't quite where Stacked is just yet.", "group_id": 2515, "id": 1907902}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1313763566.220602, "message": "Oh, one more thing. I frequently have trouble connecting to Convore. I connect with cable internet (20mbps) and have a reasonably current pc (AMD Phenom II X6 3.2Ghz w/16GB RAM), that is probably cleaner than the average users machine (meaning less spy/spam-ware). I also have regular trouble connecting when doing so through my iPhone.", "group_id": 2515, "id": 1910017}, {"user_id": 36437, "stars": [], "topic_id": 43540, "date_created": 1313767465.2715869, "message": "@Buck you're not alone there. The iPhone app often times out, and on my new mbp quad core, the full site is slow and sometimes doesn't post.", "group_id": 2515, "id": 1910498}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313808716.2605059, "message": "Wow great find @Buck, thanks!", "group_id": 2515, "id": 1914841}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313778634.6744499, "message": "I find this site very slow as well.", "group_id": 2515, "id": 1911820}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1313791001.734982, "message": "OSQA http://www.osqa.net/ seems okay. @jimhull, are you going to set up a system?", "group_id": 2515, "id": 1913143}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313847359.153898, "message": "http://websitetoolbox.com also looks good, but it's not free, $10 a month.", "group_id": 2515, "id": 1916778}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313849213.450928, "message": "I set up a forum with just a single user for now, feel free to check it out: http://www.websitetoolbox.com, user = dramatica, password = booboo1", "group_id": 2515, "id": 1916850}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313848075.793138, "message": "OSQA looks very good, but at the moment must be hosted on a Mac or UNIX server running Apache. I would offer to host on my company's website (www.wiredmusician.net) but we can't run it there, because it is a Windows server.", "group_id": 2515, "id": 1916811}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313849164.178304, "message": "I'm really liking websitetoolbox.com -- it has a lot of features, including real-time chat (private and groups), and would allow us to organize things into forums, so for example we could set up one for theoretical discussions and one for practical discussions, etc. I'd be willing to pay for the first year, and then set up the rest of you as admins so we can rotate the expense.", "group_id": 2515, "id": 1916849}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313853683.312845, "message": "Go to the link and click the log in button.", "group_id": 2515, "id": 1917081}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1313854684.353801, "message": "Ah. Found it. Start reading on the \"left\" side of the screen, not \"right\". Not used to that this early in the morning (and before coffee). Anyhow, it seems me to me most of that can already be done with phpbb, which makes it very similar to traditional forums. My initial impression is thumbs-down, but I'm willing to remain open minded.", "group_id": 2515, "id": 1917124}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313854260.6441481, "message": "hm, that's odd... I see it in the blue bar at the top, but that may be because I created the account. Try this page: http://www.websitetoolbox.com/tool/members/login", "group_id": 2515, "id": 1917105}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1313853453.3518889, "message": "Hi @PhillyJeff. Where do I log in?", "group_id": 2515, "id": 1917071}, {"user_id": 38500, "stars": [], "topic_id": 43540, "date_created": 1313854358.7832119, "message": "This is the link I should have posted: http://dramatica.websitetoolbox.com/", "group_id": 2515, "id": 1917110}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313870736.0329809, "message": "Hey guys, I'm setting up OSQA so we can try it out later, thanks.", "group_id": 2515, "id": 1918282}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313957707.8276629, "message": "ok...have at it -- http://dramaticaquery.com -- please be sure to read the FAQ as it is not supposed to be a discussion forum or chat room like Convore (though hopefully it'll be faster and more reliable than Convore...)", "group_id": 2515, "id": 1924427}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1313992970.6746509, "message": "I read the FAQ and let it simmer for a few hours.  Now, I understand the site's purpose.  It would create an archive.  Good luck in training people to answer correctly, but I'm behind you.  It would be nice to have a true skill using Dramatica.  Now, I have confidence that using it is great, and whack along merrily, similar to playing chess like checkers.  The kids at the unit always got to win at chess when they played with me.  It would boost my self esteem to nail down the genteel use of the dram theory.\n\nIt would be good to use that site, only, if you are able to transfer the questions and answers to a different forum and/or site, if this one changed and/or died, etc.  The archives should be portable.  The strict question and answer thing is positive.  I know that Bill had to spend an enormous amount of time on the listserv archives, cleaning out all the personal stuff, i.e. griping about bosses and college professors.    mea culpa", "group_id": 2515, "id": 1927841}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313995757.915736, "message": "I'm not a big fan of keeping the database in hands of others (services like this). With the setup on DramaticaQuery the only way the information will go away is if I turn it off...which won't happen.", "group_id": 2515, "id": 1927973}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313995656.311614, "message": "Basically if you have a question about some concept that's the place to go. If you want to discuss the theory or bounce ideas off someone you go here.", "group_id": 2515, "id": 1927965}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1313995860.1514289, "message": "I will be transferring all the information here to a safe place. The service has grown incredibly slow lately and I don't trust it. I won't be copying over answers though to DQ I'd prefer if that site grew on it's own.", "group_id": 2515, "id": 1927976}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1313997375.0333381, "message": "I have a question that arose from my ramblings on the other group.  I'll post it at dq, instead of here.", "group_id": 2515, "id": 1928051}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1313998343.5416701, "message": "Ok, I asked it.  I hope someone goes over and looks at it. http://dramaticaquery.com/questions/6/storyforming-choices", "group_id": 2515, "id": 1928098}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314020204.619128, "message": "Couple of things -- one the title should be phrased as a question (storyforming choices really doesn't let anyone know what the question is), and two you're really just asking for an opinion, there's no one concrete answer. I'd submit that kind of discussion here. Think of DQ as a highly refined FAQ.", "group_id": 2515, "id": 1929949}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1314023631.0598199, "message": "@jimhull I deleted them.  I don't know why it created two questions.  Maybe I clicked twice?", "group_id": 2515, "id": 1930369}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314028064.0734639, "message": "Sweet, thank you. Not sure about the duplicate, if it continues to happen I'll look into it. And no worries about the question, I'll put up a couple sample ones so people can get the idea of what belongs there.  It would be the kind of resource that will help out, say in the middle of the night when you're banging your head against the wall about the difference between Deduction and Induction -- maybe you don't even _get_ Induction (like 98% of the population), so you pop on over to DQ, click the tags radio button at top and type in Induction - there you'll be able to find examples of it in action and hopefully an answer to your question (more than likely answered by Chris!). That way you can quickly and easily get back to writing. It'll take awhile to build up, but I think in the end it will be a valuable resource for writers.", "group_id": 2515, "id": 1930935}, {"user_id": 33839, "stars": [], "topic_id": 43540, "date_created": 1314028771.3338799, "message": "The only problem is, if it's the middle of the night and DQ pops into my head, it's usually because I'm asleep and dreaming of a hot fudge sundae... :P", "group_id": 2515, "id": 1930998}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314028819.5649199, "message": "lol - i thought of basing the final logo on some variation of that", "group_id": 2515, "id": 1931002}, {"user_id": 39675, "stars": [], "topic_id": 43540, "date_created": 1314029204.7642291, "message": "@jimhull Having examples of everything would be dram heaven.  Thanks.", "group_id": 2515, "id": 1931038}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314030067.560148, "message": "ha!", "group_id": 2515, "id": 1931158}, {"user_id": 33839, "stars": [], "topic_id": 43540, "date_created": 1314029975.8240149, "message": "@jimhull I know you REALLY want to work this into the logo, putting the DQ above it.  http://pvillegirl.files.wordpress.com/2009/10/funny-pictures-cat-is-squished.jpg?w=500&amp;h=332", "group_id": 2515, "id": 1931142}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1314121274.949038, "message": "The new site is great, thank you!", "group_id": 2515, "id": 1941897}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314132096.0280261, "message": "Yeah, I'm hoping it'll turn into THE ultimate faq for Dramatica questions. Conversations can still take place here but if you're looking for a specific answer that would be the place to go.", "group_id": 2515, "id": 1943606}, {"user_id": 7712, "stars": [], "topic_id": 43540, "date_created": 1314133661.20047, "message": "Oh I see. Cool. I have to wonder how many \"thumbs-down\" votes Chris will get... (hahaha).", "group_id": 2515, "id": 1943811}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314150824.8931539, "message": "Lol yes don't forget to vote. You actually get karma points for it which I think will be helpful competition with the right question ( any examples of Actuality as a problem). Of course, I'm sure Chris will always be at the top :)", "group_id": 2515, "id": 1945942}, {"user_id": 7645, "stars": [], "topic_id": 43540, "date_created": 1314159762.228646, "message": "i would say the new site is working well...http://dramaticaquery.com/images/chbadge.png", "group_id": 2515, "id": 1946766}]