[{"user_id": 10403, "stars": [{"date_created": 1297708531.7276411, "user_id": 10694}, {"date_created": 1297801797.061152, "user_id": 7081}], "topic_id": 5517, "date_created": 1297697041.6724269, "message": "The more obvious the connection is between the brand and the prospect’s daily activities, the greater the chances are that the chances of selling the product or service you are offering.", "group_id": 250, "id": 100625}, {"user_id": 7182, "stars": [{"date_created": 1297801798.6504691, "user_id": 7081}], "topic_id": 5517, "date_created": 1297760206.694418, "message": "Do you think that if the logo includes a picture icon of the product that that would be the most powerful branding.", "group_id": 250, "id": 109866}, {"user_id": 1809, "stars": [], "topic_id": 5517, "date_created": 1297826459.6722369, "message": "The logo doesn't need to represent the product. I can think of very few, actually, where that's the case. Apple? Their logo isn't just an icon of an iPhone or a macbook. Target? Their logo isn't a shopping cart.", "group_id": 250, "id": 117486}, {"user_id": 1809, "stars": [], "topic_id": 5517, "date_created": 1297826502.024502, "message": "The best logos are picture words, though, and there aren't a lot of them left. Meaning, an abstract image that puts a word in your mind. (apple, target)", "group_id": 250, "id": 117490}, {"user_id": 8985, "stars": [], "topic_id": 5517, "date_created": 1298301572.2960949, "message": "First its important to have a visual identity, secondly it think its about doing more than the customer expects from you.", "group_id": 250, "id": 159306}, {"user_id": 3766, "stars": [], "topic_id": 5517, "date_created": 1298323243.6313069, "message": "I give #1 priority to product and #2 to customer support.", "group_id": 250, "id": 170172}, {"user_id": 11933, "stars": [{"date_created": 1298421586.7423329, "user_id": 261}], "topic_id": 5517, "date_created": 1298324719.767911, "message": "You first have to realize that the brand isn't what you say it is, it's what the customer says it is.  Also, branding on customer service is a bad idea. How many companies in the history of branding have used \"great customer service\" as a lever?  Too much noise.  Focus on the emotion and the pain your product solves.  That's it.", "group_id": 250, "id": 171404}, {"user_id": 14902, "stars": [], "topic_id": 5517, "date_created": 1298421181.7864461, "message": "@seanmeverett \"You first have to realize that the brand isn't what you say it is, it's what the customer says it is\" <-- Golden. The next thing? Persuade the customer to say it is what you want them to say it is.", "group_id": 250, "id": 185262}, {"user_id": 11933, "stars": [], "topic_id": 5517, "date_created": 1298475815.6952929, "message": "@JohnJameser completely agree with that. That's always the toughest. You have to boil your brand down into an easily remember-able phrase and make it stick using S.U.C.C.E.S. http://www.madetostick.com/", "group_id": 250, "id": 188167}, {"user_id": 14970, "stars": [{"date_created": 1300039050.7621191, "user_id": 20138}], "topic_id": 5517, "date_created": 1298614221.0033989, "message": "You build brand loyalty through sticking by it yourself. How would you expect your customer to stick with your brand, if you won't?\n\nBest example, let's take American automobile companies. Prior to the recession, Chrysler, GM and Chevy were announcing new models off their assembly line left, right and center: HHR, 300, PT Cruiser, Charger, Magnum, Durango, Denali, Suburban, Yukon, Cobalt, etc. Only to have them discontinued a few years later. \n\nNow look at Japanese automobile companies. Companies like Honda and Toyota build brands for vehicles they build on, improve on and work with. The initial product answered a certain need (fuel economy, sport, luxury) but they work with it. Take the Honda Civic - its on its way to its ninth revision and one of the best selling cars in its class. Sure it may be a reliable car, fuel efficient, but its not that much cheaper than other cars in its class. They've worked with it and matured it with their customers, in turn building loyalty for most.\n\nI'm glad to say I feel American automobile companies are taking a page out of this book. I am a big fan of domestics, and hope they do well. Ford, for example, is working with the Focus and Fusion brands, lets hope they work with their brands before quickly writing them off.", "group_id": 250, "id": 206316}]