[{"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298485195.9806321, "message": "For those of you who have read the docs, here is where you should leve feedback, thoughts, whatever...", "group_id": 4976, "id": 189495}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298487170.6200509, "message": "Well Reflex isn't on my radar really but I was talking to Tyler (who I need to add to this) about my thoughts on what an application class and screens should look like. This is what I jotted down from code I am already using in TileCrusader.", "group_id": 4976, "id": 189847}, {"user_id": 7782, "stars": [], "topic_id": 8398, "date_created": 1298486934.9705231, "message": "It sounds reasonable to me. What do you think of a project like Reflex combined with this sort of activity model? Is that the aim here, to replace what Adobe is doing as a mobile solution?", "group_id": 4976, "id": 189772}, {"user_id": 7782, "stars": [], "topic_id": 8398, "date_created": 1298486953.989965, "message": "I can't even begin to IMAGINE using Flex on a device that isn't a full blown computer", "group_id": 4976, "id": 189776}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298487247.2989559, "message": "My goal would be to not use Hero or Flex at all, especially when it came to mobile apps where performance mattered. This is basically for people using Flash IDE or do AS3 code like me to quickly get an App layer up and running on a device and have the basic support for a main Application, ActivityManager, and Activities along with a game loop.", "group_id": 4976, "id": 189859}, {"user_id": 15357, "stars": [], "topic_id": 8398, "date_created": 1298490173.8444259, "message": "For the ActivityManager, why not implement it as a stack instead of an array?  Forget about having a hard history count, just have it be boolean.  Use pop/push for activities instead of setCurrentActivity().  You can't go forward and you are only ever going to go back one step at a time, right?", "group_id": 4976, "id": 190325}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298491632.7793851, "message": "Well it is a stack. I wanted to implement the history count to help curb memory but I could see it being overkill. The idea behind the history was to couple it with the save/load state logic so if you have to many items in history you can remove them and restore them from a save state. Obviously still needs some work but you make a good case.", "group_id": 4976, "id": 190506}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298491809.4301801, "message": "As for setCurrentActivity() that is just a wrapper for the pop/push stuff so you don't have to think about it. Android does something similar by calling startActivity and passing in a reference to the new Activity.", "group_id": 4976, "id": 190529}, {"user_id": 15357, "stars": [], "topic_id": 8398, "date_created": 1298495614.590786, "message": "I'm having a hard time envisioning a situation where you would be so deep in activities that it would be a memory issue.  I know for mobile you want to keep it as low profile as possible, but if setCurrentActivity() is a push and back() is a pop, how deep can that history really get?", "group_id": 4976, "id": 191261}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298498007.3280771, "message": "That is a good point. Happy to drop features since it's less for me to code. Since Android handles destroying activities that are inactive depending on memory. Flash does not have this so by not limiting the history was a quick way to implement this kind of feature.", "group_id": 4976, "id": 191562}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298516066.137398, "message": "Right now saving/loading and history are missing from the initial version.", "group_id": 4976, "id": 194958}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298516044.337312, "message": "All of the source code is up on github now https://github.com/jessefreeman/FActivity I'll be adding some more examples as I find time.", "group_id": 4976, "id": 194956}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298791491.7264431, "message": "Since i launched the project I decided to make this group public.", "group_id": 4976, "id": 216749}, {"user_id": 15325, "stars": [], "topic_id": 8398, "date_created": 1298791536.712512, "message": "Also I have now added green threads to the project which take advantage of the update loop in each Activity. It's not perfect but it's interesting for sure.", "group_id": 4976, "id": 216753}]