[{"user_id": 7664, "stars": [], "topic_id": 40498, "date_created": 1309116740.391187, "message": "@Chris_Huntley, you said that the PSR was the view from inside the story. \n\nI have always thought the PSR was the path your story walks when it makes its way through the  the twisted, unbalanced theme browser* created by the storyform. And, that it always maintained the truth that the author knows.\n\n(* Is there a name for this twisted world. Actually, now that I think about it, it's \"the storyform\", right?)\n\nBut, given that so much of Dramatica is perspective, I want to doublecheck this. Is all of this from my perspective, or is any of it from the perspective of the characters?\n\nFor instance, if in the MC Throughline, if we're exploring \"Doing\" with \"Fate\" -- is it the Character's perspective that this is Fate? Or, could he be blind to that?", "group_id": 2515, "id": 1490373}, {"user_id": 29788, "stars": [], "topic_id": 40498, "date_created": 1309132227.1106801, "message": "You might want to check out this December 2003 tip of the month  http://www.dramatica.com/theory/tip_of_month/tips/tip1203.html", "group_id": 2515, "id": 1491575}, {"user_id": 7664, "stars": [], "topic_id": 40498, "date_created": 1309138492.4317141, "message": "That's very helpful @dp.", "group_id": 2515, "id": 1491978}, {"user_id": 7664, "stars": [], "topic_id": 40498, "date_created": 1309138548.0482869, "message": "I'm still curious if the subjectivity is my subjectivity (which I suspect) or the character's.", "group_id": 2515, "id": 1491981}, {"user_id": 7645, "stars": [], "topic_id": 40498, "date_created": 1309149496.432236, "message": "This is a good question.", "group_id": 2515, "id": 1492847}, {"user_id": 10814, "stars": [], "topic_id": 40498, "date_created": 1309182757.2095151, "message": "I believe that the PSR show you what it looks like inside the story OBJECTIVELY.  Sort of like seeing the world from inside a tilt-a-whirl.  It does not take into account any character's psychology or personal perspective.  It's an objective view of the subjective view.  How much of that view is visible to your character is up to you.\n\nPLUS, remember that it includes the flow of time (acts), so you see all of time in the story where a character would not generally be privy to that perspective.", "group_id": 2515, "id": 1495452}, {"user_id": 10814, "stars": [], "topic_id": 40498, "date_created": 1309182838.8775041, "message": "@MikeDerk Yes, the storyform represents the \"twisted\" world.  It's only twisted in contrast to the model at rest.  We figured it was easier to move the story points around a stable structure, than have the structure conform to the changing storyform.", "group_id": 2515, "id": 1495461}]