[{"user_id": 43559, "stars": [], "topic_id": 47859, "date_created": 1321466201.8260989, "message": "Hello\nsince September you didn't post any new stuff.\nSo I'm questioning myself, did you decide to make a\nbig party with the money you got already. ;-)\nAnd then bag for more donations  to make the next party.\nOr where you so busy with chatting on your new blog,  \nthat you didn't found the time to work on Real-Riven? :-)\nI can't wait to see more new screen-shots and pre rendered graphics. \nIt would by nice if you could publish your development plan so we can see,\nhow long it will teak until we can have a look at the first Beta.\nREM  *****  BASIC  *****\nSub development_plan\nDim you As Object\n  If you = don't  have a plan, Then\n        you = should instantly make one.\n  Else\n       you = are never going to finish the project.\n  End If\nEnd Sub\nfriendly regards\n Gorn ", "group_id": 11772, "id": 2584627}, {"user_id": 7523, "stars": [], "topic_id": 47859, "date_created": 1321508416.9632411, "message": "One of the biggest problems, among others, is that we're almost all students - so since September, we've all gotten a lot busier with THAT stuff.", "group_id": 11772, "id": 2587712}, {"user_id": 7523, "stars": [], "topic_id": 47859, "date_created": 1321508430.9876821, "message": "BUT DON'T WORRY IT'S GONNA GET DONE!", "group_id": 11772, "id": 2587714}, {"user_id": 7523, "stars": [], "topic_id": 47859, "date_created": 1321508356.2412641, "message": "Don't worry, we have plans. We still love Riven, we still believe in the project, we still plan on putting your money to good use, and yes, finishing the project.", "group_id": 11772, "id": 2587706}, {"user_id": 38225, "stars": [], "topic_id": 47859, "date_created": 1321509503.3442221, "message": "@Gorn No one is more aware of the lack of updates and releases over the last few months as we are. Trust me, it's not something we are doing deliberately and we take it very seriously. As a fan-made project, SE has to come second sometimes to other pressing issues in real life. Personally, I'm in my final week of my animation degree so I haven't been able to devote much time to the project of late.", "group_id": 11772, "id": 2587776}, {"user_id": 38225, "stars": [], "topic_id": 47859, "date_created": 1321510371.685858, "message": "I'd also like to take the time to address this push to make our road map, or development plan, public. Yes, it exists. No, we won't show you. Why? Because it's a private development document for the team. We release information regarding our plans often, and discuss possible features and ideas with anyone who wishes to. I hope that's enough.", "group_id": 11772, "id": 2587818}, {"user_id": 43559, "stars": [], "topic_id": 47859, "date_created": 1321517247.236733, "message": "I hope you didn't took my questions to serious.\nAnd I am glad to hear that you are still planing to finish the project.\n\nI didn't mean that you should publish your hole detailed road map,\nbut some sort of rough overview without to many details and without dates.\nfor example:\nObjects:        Modelled     Texture    Animations   Sounds        Notes\nPrison island   Done         ~ 80%      ~30%         Missing      Water and clouds are only dummies\nhover Train          20%               ------------------------------------------- \n.....\n\nSomething like that would bee really nice because we could see how progress is going on.", "group_id": 11772, "id": 2588165}, {"user_id": 41709, "stars": [], "topic_id": 47859, "date_created": 1321570087.2628009, "message": "I'm glad to hear it's GONNA GET DONE. But we are missing the BIG QUESTION. And that is, is Zib ever going to make another post on his blog? ;-)", "group_id": 11772, "id": 2591778}, {"user_id": 7523, "stars": [{"date_created": 1321744051.0003591, "user_id": 41709}], "topic_id": 47859, "date_created": 1321685576.0058839, "message": "@Ahlisendar On MY blog? Like, zibland.com? :P Yeahhh...", "group_id": 11772, "id": 2599227}, {"user_id": 43003, "stars": [], "topic_id": 47859, "date_created": 1321725986.266995, "message": "whats the biggest problem developing Riven3D right now?", "group_id": 11772, "id": 2601382}, {"user_id": 7523, "stars": [], "topic_id": 47859, "date_created": 1321733327.1420879, "message": "Time, and shaders, and a bunch of other little things. We're rebuilding the game from the ground-up, as well, which is taking longer than expected.", "group_id": 11772, "id": 2602119}, {"user_id": 7523, "stars": [], "topic_id": 47859, "date_created": 1321733367.2174151, "message": "By that, I mean, of course, the engine - the coding parts of the game, not the artistic parts.", "group_id": 11772, "id": 2602123}, {"user_id": 41709, "stars": [], "topic_id": 47859, "date_created": 1321744048.1911881, "message": "@zib_redlektab When? Also, your very first posts are a little peculiar, I must say =D", "group_id": 11772, "id": 2603296}]