[{"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344607.072551, "message": "Just wondering if anybody has any suggestions for how to effectively communicate with people not familiar with the theory.", "group_id": 2515, "id": 763190}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344431.9036069, "message": "Now here's my problem... as much as I like the Dramatica theory and the new types of stories it opens up to me, I run into trouble when I try to communicate with people who don't understand it.  A recent example...", "group_id": 2515, "id": 763158}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344562.231714, "message": "I had a meeting with a producer and director regarding a third draft I had done for them.  They complained that the main character did not change.  I desperately wanted to say to them exactly what the case was:  that he is not the main character, but rather the protagonist, and that the main character is in fact the other character who *does* change, and the protagonist represents a steadfast character, etc. etc.", "group_id": 2515, "id": 763175}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344589.480237, "message": "Blank stares when I try to convey that.  All I get in return is \"we need the main character to have an arc\".", "group_id": 2515, "id": 763186}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344377.3558819, "message": "First of all... hi everyone!  First time posting.  Happy to have found this group.  (Thanks, Jim!)", "group_id": 2515, "id": 763151}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303344713.9579251, "message": "(Note too that I don't want to get into saying \"but the Dramatica theory says this...\".  There's a stigma attached to any theory of story, not because of any fault of Dramatica, but rather because it is assumed to be similar to Save the Cat or Truby or any of the other \"cookie cutter\" templates.  That's a false impression, but the general impression among laymen nonetheless.)", "group_id": 2515, "id": 763203}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303346413.9371259, "message": "Hey SS, yeah I try to avoid starting from Dramatica as a defense because of those who instantly dismiss it as being too rigid/strict/etc. I eventually get there, but if you start with it, most people shut their ears (shame, but true)", "group_id": 2515, "id": 763449}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303346575.0012341, "message": "in story meetings I just try to figure out what part of the structure they're communicating to them and give them the answer they want. If they want to know what the Protagonist's wants/needs are, I give them MC Response/Solution. If they want to know what the \"stakes\" are, I give them the Story Consequences. If they want to know what a Steadfast Character's arc is, I describe how they change by growing stronger, more confident in who they are compared to where they were in the beginning. In my head I'm thinking Steadfast (and communicating whether or not its Start or Stop) but I don't use that term -- unless I'm talking with people who were smart enough to take the time to learn Dramatica!", "group_id": 2515, "id": 763477}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303346708.059479, "message": "I've also noticed that it seems like people are opening up to Steadfast MC's. In fact, in a recent presentation the speaker made a distinction between Learning Heroes and Teaching Heroes (the basis for my article -- http://stryfntk.com/6y3). So you could use that to - say, \"No, but so-and-so is a teaching hero, standing up to injustice, whatever....\" Basically manipulate what they know into what you know is right :)", "group_id": 2515, "id": 763496}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303347251.972002, "message": "I have some thoughts... can post them in two hours...", "group_id": 2515, "id": 763645}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303353113.1394801, "message": "@jimhull I try to avoid starting with Dramatica because people generally have no idea what it is, and then I have to explain I'm not in some fringe group.", "group_id": 2515, "id": 764681}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303358326.049509, "message": "3. How to introduce people to dramatica....", "group_id": 2515, "id": 765430}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303358286.3194261, "message": "I see three problems lurking in your question:\n1. How to convince the Producers that your character doesn't need an arc.\n2. How the MC and the Protagonist are being perceived.\n3. How to introduce people to dramatica.\n\n1. Maybe you aren't really asking for advice on this, but if you're three drafts into a story, maybe you are?\n2. I know that these terms are often confused... but do the producers sense that there is somebody driving the action and someone they are getting emotionally attached to?", "group_id": 2515, "id": 765427}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303359793.5957029, "message": "This is a toughie. I've tried to introduce it to four people, all writers. It was rejected once, flirted with twice by people who agreed that it looked interesting, but it didn't get any further, and one person took to it immediately.\n\nThe common factor between myself and the guy who took to it is that we were actively looking for something to improve our game. We were willing to invest and improve. The others weren't, and I think anything complicated was an immediate turn off.", "group_id": 2515, "id": 765730}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303359829.5944159, "message": "When I said I that I had thoughts earlier, I was really thinking about how to talk to your producers, but then I realized that wasn't really your question.", "group_id": 2515, "id": 765738}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303393930.5651989, "message": "Yes, how to talk to the producer and director was actually my question.  They're stuck on the idea that a protagonist must have an arc, and me just pointing out examples like Gladiator or Shawshank Redemption doesn't convince them.", "group_id": 2515, "id": 770233}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303393966.5310869, "message": "The danger, of course, is that they might think because my protagonist doesn't have an obvious \"arc\" (as they define it), I'm just not a very good writer.", "group_id": 2515, "id": 770241}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303394045.653748, "message": "And those are good suggestions, Jim.  I'm going to try to think that way in the next meeting.", "group_id": 2515, "id": 770252}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303394112.182632, "message": "Mike also raises a good point.  Maybe if they're not \"feeling\" the script when they read it, I haven't quite hit the mark yet on establishing the emotional attachment to the main character and his need.", "group_id": 2515, "id": 770273}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303397944.5467751, "message": "My advice is not to talk to your teammates about Dramatica. Nobody cares how good your knowledge of physics is if you can't put a ball across the plate.\n\nThe thing is that now you are now probably going to have to change something in your script in order to make a \"change\" apparent.\n\nSomething that always stands out to me is that what Dramatica considers a Change and what most people consider a change are (or can be) wildly different.\n\nTake this comment from a blogger I think is generally very good: http://www.blogger.com/comment.g?blogID=13294573&postID=6141136509946016486", "group_id": 2515, "id": 770972}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303398188.2171831, "message": "Then, you have stories like The 6th Sense. Does Cole change? Not according to Dramatica. But, he starts the story afraid of the ghosts, and he ends it un-afraid.\n\nClarice Starling opens Silence of the Lambs very naive, and ends it so comfortable with a terrible cannibal that she is unafraid of him. She's grown up. But, still, according to Dramatica she hasn't changed.", "group_id": 2515, "id": 771028}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303407141.910769, "message": "That's an interesting approach. Give them a superficial change as with the Cole and Clarice examples while still maintaining the integrity of the Steadfast character", "group_id": 2515, "id": 773326}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303407797.6222601, "message": "While I find many things like the Hero's Journey unhelpful in writing, they are sometimes a helpful way to look at a final draft. I've seen it written many times that a main character has to discard something at the midpoint (like, getting rid of a teddy bear) and it signals that he's transitioning from point A to point B. (No teddy bear = no longer a child, no longer in need of that memory, no longer needs a security blanket.... etc.)\n\nI'm sure there are other superficial things that you can employ, as well.\n\nMind you, I'm not saying that I think these suggestions are fraudulent. They can be really good. Plus, you have the obvious: Of course Cole Seer isn't afraid of ghosts anymore -- he has learned how to deal with them, and that's got to bring a certain amount of relief.\n\nIt's no different from the guy who is driven to make a movie. He's an anxious, doubting guy when he's staring at his absolutely terrible first draft, and sweating over how to find a DP willing to work for nada... but when he wins Sundance, he's happy. But his drive hasn't changed, so he's Steadfast. But we all react to our situation.", "group_id": 2515, "id": 773438}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303486495.405185, "message": "It is indeed a very good suggestion.  I've worked something in so that even though my protag stays steadfast with regards to his problem/solution, he does undergo another minor change that doesn't impact the story thematically.  The script wouldn't suffer from it not being there, but it might make the producer and director happy.  Thanks, guys!", "group_id": 2515, "id": 782157}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303487636.763123, "message": "It just occurred to me that if the \"change\" has to do with the Dividend, then it might satisfy everybody.", "group_id": 2515, "id": 782291}, {"user_id": 10814, "stars": [], "topic_id": 20615, "date_created": 1303500376.872941, "message": "And do no disregard a character's growth, even for a steadfast character.  That is what most writers think of as \"change\", as opposed to the paradigm shift Dramatica labels as \"Change.\"", "group_id": 2515, "id": 784235}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303512378.9063671, "message": "@jimhull FWIW, I'm not sure that \"stakes\" are referring to just the consequences. I'm fixing up Cargo right now, and I think the issue is that -- while we all understand the stakes -- the scenes themselves don't have enough stakes. I think \"stakes\" is one of those words that is fairly all-inclusive, and context-dependent.", "group_id": 2515, "id": 785847}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303516653.5156059, "message": "this conversation is making me hungry", "group_id": 2515, "id": 786189}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1303526527.3118539, "message": "Are you quoting something? I'm having a weird deja vu.", "group_id": 2515, "id": 787005}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303529615.82377, "message": "All this talk about stakes. It's ok I went to Stuart Andersen's and I'm feeling much better", "group_id": 2515, "id": 787079}, {"user_id": 13109, "stars": [], "topic_id": 20615, "date_created": 1303562843.154058, "message": "Would showing how the character grows (in their steadfastness) show proof enough of a character arc to satisfy your producers?", "group_id": 2515, "id": 788827}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303590199.447608, "message": "It would be worth a shot. The problem is the word Change. \"of course my main character changes, who would write a story where they dont?\" is what most people new to Dranatica struggle with.  Instead of Change it should be something more concrete like Alter or Shift or something that is closer to what it is really saying then change. Might help the newbies out", "group_id": 2515, "id": 790862}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1303648138.9016409, "message": "I tried to convey to them how the character \"strengthens his resolve\", and \"resists forces trying to change him\", and so forth.  All they cared about was that he ended up in the same place he started.  That didn't sit right with them.", "group_id": 2515, "id": 794400}, {"user_id": 13650, "stars": [], "topic_id": 20615, "date_created": 1303824081.8012841, "message": "Hmmmm can't delete the duplicate post. Sigh. Too early.", "group_id": 2515, "id": 814057}, {"user_id": 13650, "stars": [], "topic_id": 20615, "date_created": 1303823973.224601, "message": "IF the \"story\" is to have an MC \"educate\" an IC as to how to learn and utilize Dramatica the first thing is to decide whether the MC will be steadfast or change. Is the OS Driver Action or Decision? My problem is always the OS Limit <G>. Of course the Story Goal is Changing One's nature... etc. Honestly, it would make a very good story for this group. The antagonist for me - is information that really educates the neophyte seems to be vague.", "group_id": 2515, "id": 814018}, {"user_id": 13650, "stars": [], "topic_id": 20615, "date_created": 1303823983.8467691, "message": "IF the \"story\" is to have an MC \"educate\" an IC as to how to learn and utilize Dramatica the first thing is to decide whether the MC will be steadfast or change. Is the OS Driver Action or Decision? My problem is always the OS Limit <G>. Of course the Story Goal is Changing One's nature... etc. Honestly, it would make a very good story for this group. The antagonist for me - is information that really educates the neophyte seems to be vague.", "group_id": 2515, "id": 814021}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1303835256.740047, "message": "You should be able to hover over the conversation and a Delete (x) should appear next to to the time stamp", "group_id": 2515, "id": 816184}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305322168.4026539, "message": "How is it that you haven't been fired from this job?", "group_id": 2515, "id": 1047642}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305320415.749733, "message": "This situation has worsened. The director actually wrote up a new treatment for the script (this is after draft 4!) in which he inserted an \"arc\" for the protagonist and deleted my MC altogether. The arc is unrelated to the theme, so no matter how much I try to force Dramatica to like it, it never will because there are now two separate themes in the story. Oy vey.", "group_id": 2515, "id": 1047254}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305323146.568162, "message": "That's a long story, but suffice to say there are long-standing relationships involved. Which doesn't mean, though, that I can be difficult.", "group_id": 2515, "id": 1047821}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305325580.279706, "message": "Here's another thought (assuming you can still counter-offer a storyline): can you give the IC/Protagonist a side-problem that is solved by enjoying the Dividend? Like, he can't communicate with his girlfriend/cat/homunculus until he enjoys the dividend of teaching the MC??", "group_id": 2515, "id": 1048231}, {"user_id": 10814, "stars": [], "topic_id": 20615, "date_created": 1305323242.715687, "message": "Is there a reason you did not choose to make your previous MC a Change character?  Would that have removed the conflict with your director, even if it wasn't the original intent for the story?", "group_id": 2515, "id": 1047835}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305323638.939913, "message": "You're in a rough place. Chris has an interesting suggestion, though.", "group_id": 2515, "id": 1047956}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305325411.893822, "message": "Hmmm... yes. It seems that the \"teacher\" doesn't change in most set-ups, unless it's a full reversal (see: Kung Fu Panda) and the student becomes the teacher.", "group_id": 2515, "id": 1048203}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305325019.3117509, "message": "The reason was that the IC (also protagonist) is an established character from an existing series. He's fairly heroic and tends to be a \"teacher\".  The current script is aiming for a slightly younger audience, so it seemed natural to introduce a kid as MC and have the IC be a mentor to him. It just felt like a natural fit. Keep the established heroic character as protagonist while introducing a younger character for the kids to identify with. Having the kid steadfast doesn't seem to fit at all.", "group_id": 2515, "id": 1048139}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305325105.4447351, "message": "Now they have deleted the kid altogether.  The MC is now also the protagonist, and there is no IC.  The MC's new \"arc\" is unrelated to the established theme, and occurs without the influence of an IC. It's a structural mess.", "group_id": 2515, "id": 1048152}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305326420.1858079, "message": "(And the long-standing relationship, by the way, is that I was lead writer on the series from which the character sprang. So, lucky for me, the producers still feel like I'm the best man for the job.)", "group_id": 2515, "id": 1048327}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305326480.294168, "message": "Yeah, me too. They trust Blake Snyder more than me. :)", "group_id": 2515, "id": 1048331}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326525.650223, "message": "Next to me, right now, are two people reading Blake out loud, and comparing their script to it. \"We have to decide what the midpoint is...\" \"Oh... we're ten pages late with that beat...\" I want to kill them both.", "group_id": 2515, "id": 1048335}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305326251.8785291, "message": "I think at this point they've made up their minds that main character and protagonist are the same thing and nothing else makes sense. Or rather, they had already made up their minds about it, and I failed to change them.  I don't think I can propose bringing the kid back.  SO... I need to come up with a new IC somewhere in the existing cast and re-build the whole storyform starting with this arc they've assigned to the MC.  It's basically a new script.", "group_id": 2515, "id": 1048316}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326397.529609, "message": "I've been there. I feel for you.", "group_id": 2515, "id": 1048324}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305326638.35287, "message": "You're in the dark night of the soul.", "group_id": 2515, "id": 1048345}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326771.8976779, "message": "I just borrowed the book and read the beats... nothing mentions change.", "group_id": 2515, "id": 1048358}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326458.5534019, "message": "I wish that meant they trusted you more.", "group_id": 2515, "id": 1048329}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326559.6661041, "message": "And then go save a cat, so the police know I'm really a good guy they can sympathize with.", "group_id": 2515, "id": 1048338}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305326817.001925, "message": "It just says that the hero pulls out an idea he didn't know he had, and is influenced by the love story.", "group_id": 2515, "id": 1048362}, {"user_id": 10814, "stars": [], "topic_id": 20615, "date_created": 1305327404.04652, "message": "Ouch.", "group_id": 2515, "id": 1048407}, {"user_id": 30287, "stars": [], "topic_id": 20615, "date_created": 1305328374.7027321, "message": "If I remember right, Snyder defines it in terms of the \"flawed protagonist\".  The protagonist must have a flaw that he overcomes by the end.  Doesn't seem to matter much if overcoming that flaw has any bearing whatsoever on the outcome of the story, as long as he overcomes it.", "group_id": 2515, "id": 1048473}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1305329953.696377, "message": "STC isn't bad, it just doesn't say anything.", "group_id": 2515, "id": 1048650}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1305330308.561229, "message": "Walked by a classroom the other night and saw the beats written up on the board. It made me sad.", "group_id": 2515, "id": 1048687}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305330596.598732, "message": "I actually think STC is bad because it's not saying anything. I think it creates a false god.", "group_id": 2515, "id": 1048706}, {"user_id": 30951, "stars": [], "topic_id": 20615, "date_created": 1305448717.748039, "message": "I'm curious about the various differences between some of the systems. I have difficulty seeing a difference between things I have read re. the Truby, STC and Syd Field and 'Hero's Journey' systems. I must admit though, I have never read any of their books.", "group_id": 2515, "id": 1058658}, {"user_id": 10814, "stars": [], "topic_id": 20615, "date_created": 1305470053.482646, "message": "Here's a link to an article I wrote a few years back comparing seven story paradigms, including Dramatica:\n\nhttp://dramatica.com/theory/articles/index.htm", "group_id": 2515, "id": 1059972}, {"user_id": 30951, "stars": [], "topic_id": 20615, "date_created": 1305470886.813267, "message": "Yes, read that a while back and again before I posted. Very good for comparing to Dramatica.  Was particularly useful in understanding how the throughlines transfer (or not) and therefore the implications of the 4 throughlines in Dramatica. However, I think it also (unintentionally) highlighted how similar some of those other paradigms are. Maybe that was just me.", "group_id": 2515, "id": 1060103}, {"user_id": 7664, "stars": [], "topic_id": 20615, "date_created": 1305474533.1218109, "message": "I've always assumed those theories were based on each other, in part anyway.", "group_id": 2515, "id": 1060511}, {"user_id": 33839, "stars": [], "topic_id": 20615, "date_created": 1305927869.5220909, "message": "My first post.  I think Jim touched upon something fairly important earlier in the thread with \"I just try to figure out what part of the structure they're communicating to them and give them the answer they want\".", "group_id": 2515, "id": 1130862}, {"user_id": 33839, "stars": [], "topic_id": 20615, "date_created": 1305928332.7848721, "message": "Oooops, didn't know return automatically posted.  Anyway, I find quite often that people can be talking about the same thing, but because they're approach entails using different story theories, they end up arguing over semantics when underneath it all, they're really in agreement - they're just using different terms.  I'm somewhat worried with the state of storytelling in the sense that those with the ability to move your story up and down the ladder may be doing so somewhat blinded by a particular theory.  I've had people pull the Save the Cat bit on me and go looking specifically for things in the script which aren't there, then finding failure because of it.  Or even worse, finding something there and interpreting through a particular theory's lens, mistaking one piece of dialogue for the theme of the entire story simply because somebody somewhere said your story should have it stated as such.  All of which makes \"communicating\" all the more difficult because everybody seems to be speaking in different tongues.", "group_id": 2515, "id": 1130922}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1305929138.115063, "message": "Yes, definitely and here's the thing, if a story doesn't have a Dark Night of the Soul moment it can still work, if it doesn't have an Impact Character to challenge the Main Character's approach it certainly won't work. This is assuming, of course, that the intent of the piece was to argue a point-of-view (what Dramatica calls a Grand Argument Story). 95% of the time it is, but the theory recognizes different purposes behind writing a story. Other paradigms think all stories are created with the same intent.", "group_id": 2515, "id": 1131036}, {"user_id": 7645, "stars": [], "topic_id": 20615, "date_created": 1305929590.957993, "message": "This is why, if I was a creative executive and the script for The Kids Are All Right came across my desk I would do anything I could to support it and wouldn't change a thing. I wouldn't sit there and say, \"Well, you know it really isn't clear who the Main Character is, you should really pick one and go with it.\" That would be ridiculous and it would ruin the script. That film isn't trying to make a grand argument, it's more about the witnessing a family struggling to stay together. Is it saying something? Perhaps. Is it arguing something? Not really. With the purpose of simply providing an experience behind it, there really is no need for Dramatica to intervene.", "group_id": 2515, "id": 1131090}, {"user_id": 33839, "stars": [], "topic_id": 20615, "date_created": 1305934981.2793341, "message": "Well put.  I had one person try to tell me the bookends to Titanic weren't needed, that the story was \"whole\" if it were merely set in the past.  Now there's somebody who missed the author's intent; even when I pointed out one of the major themes happened to be, get this, the theme song to the movie, they still argued.  I think you'll remember the e-mail I sent you a few weeks ago (this is Jim by the way), but these people were calling the inciting incident of the movie being when Titanic hit the iceberg, two hours in!  Huh?!!  I tried my best to illustrate the meaning found in the audience KNOWING (and not just assuming) Rose went on to live a fulfilling life, how it was necessary so Jack's death would not be for naught - but ultimately they wanted to analyze the movie as how they thought it should be, totally disregarding the fact that everything was there for a reason and had meaning.  I think this is reflective of the original post in the sense that, often times, we get feedback from the reader's perspective, whatever level of skill they may be, but what we fail to get that can be most constructive to the stories we as writers are trying to tell are questions on what OUR intent is.  Sure, a studio will ultimately have the say, but I think that's where some of the struggles with what we're trying to decipher from our mind onto page ensue... and I know Dramatica has the ability to help.", "group_id": 2515, "id": 1131375}]