[{"user_id": 15803, "stars": [], "topic_id": 8907, "date_created": 1298590015.8455801, "message": "Antic Entertainment is a Canadian based developer that is available for work on any web or Facebook game/property that you need a talented development team for.   Contact us at info@anticentertainment.com for more info on our team and ability.", "group_id": 4419, "id": 203651}, {"user_id": 15784, "stars": [], "topic_id": 8907, "date_created": 1298611288.959749, "message": "Untold Entertainment is a Canadian based developer that is available for work on any web or Facebook game/property that you need a talented development team for. Contact us at info@untoldentertainment.com for more info on our team and ability.", "group_id": 4419, "id": 206056}, {"user_id": 15784, "stars": [], "topic_id": 8907, "date_created": 1298611308.666683, "message": "PS What's the difference between Antic Entertainment and Untold Entertainment?  Pants.", "group_id": 4419, "id": 206057}, {"user_id": 15889, "stars": [], "topic_id": 8907, "date_created": 1298614733.595145, "message": "NILEE GAMES is an online gaming  company focused on cutting-edge technology and aimed at mass-market game development.  NILEE GAMES designs, hosts, and licenses gaming software for companies looking for an innovative and fun approach to brand building.  Our development studio is based in Mumbai, INDIA. Our Operations & Networking are being conduct from UK, DUBAI and INDIA.", "group_id": 4419, "id": 206334}, {"user_id": 15889, "stars": [], "topic_id": 8907, "date_created": 1298614850.7258871, "message": "Our Development  cost is very less and provide best quality. cost can be reduced by 40% less. To know more contact me at : anand.jha@nileegames.com", "group_id": 4419, "id": 206342}, {"user_id": 15712, "stars": [], "topic_id": 8907, "date_created": 1298618696.816159, "message": "I am going to start allocating time to help companies implement as3isolib.v1 into their games. Contact me at as3isolib@gmail.com if you have a game implementing as3isolib.v1 and need help developing it.", "group_id": 4419, "id": 206466}, {"user_id": 15702, "stars": [], "topic_id": 8907, "date_created": 1298618585.9079571, "message": "Radial Games is a Canadian based developer that is available for work on any web or Facebook game/property that you need a talented development team for. Contact us at info@radialgames.com for more info on our team and ability.", "group_id": 4419, "id": 206452}, {"user_id": 16104, "stars": [], "topic_id": 8907, "date_created": 1298683314.603719, "message": "Mims Interactive is a Los Angeles based developer that is available to help with top-notch Flash and Flex development, game design, and other interactive services. NO RECRUITERS PLEASE mims@mimswright.com", "group_id": 4419, "id": 212406}]