[{"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301695318.4141281, "message": "I'm working on a website with a co-founder. I'm excited about the website and the progress we've made, we've even submitted an application to YC. I'm ready to start publicizing the website but the problem is my co-founder thinks it's still a bit early, but I keep seeing articles all over the web about the problem our website solves. My question is, how early is too early? Our website is about 10% away from beta release.", "group_id": 250, "id": 506185}, {"user_id": 18478, "stars": [], "topic_id": 16798, "date_created": 1301696256.284889, "message": "Well if your considering SEO. then most search engines will reject your site unless you have an actual site to submit.", "group_id": 250, "id": 506289}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301697840.979784, "message": "I've added some SEO implementation, it could probably use a bit more work. But I was referring mostly to digg/reddit/forums and of course the articles describing the problems. The website is really just missing two key features to the service, those features being sms/email notifications and the second being an important core feature, but the rest of the website functions properly.", "group_id": 250, "id": 506389}, {"user_id": 9321, "stars": [], "topic_id": 16798, "date_created": 1301776115.9208429, "message": "I think a lot of people would say that you should make your site/service public as soon as you have the minimal viable working functionality. If it gets some publicity, then you will know the what the biggest problems are sooner rather than later. If you are always waiting for that last 10%, you may wait a long time - as your product will probably never be perfect. And if you launch and someone quickly points out a major flaw that you never thought of, then perhaps you will be able to shift gears more quickly.", "group_id": 250, "id": 510225}, {"user_id": 9321, "stars": [], "topic_id": 16798, "date_created": 1301776175.742413, "message": "take a look at color.com that just launched. They have LOTS of problems, but they also have the minimum product pretty much working - they are getting a lot of people to try it out, test it, let them know what the biggest problems are, and they can focus their energy on those features instead of the features that THEY think people wanted.", "group_id": 250, "id": 510236}, {"user_id": 8224, "stars": [], "topic_id": 16798, "date_created": 1301779003.753931, "message": "Post it here and we'll let you know.", "group_id": 250, "id": 510480}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301791380.7096679, "message": "Thanks for the input, I agree with what you said Mattarata, I've heard similar elsewhere but am not sure which direction to take. Here is the site: subscriby.com We'd love more feedback!", "group_id": 250, "id": 511179}, {"user_id": 17865, "stars": [], "topic_id": 16798, "date_created": 1301838783.785254, "message": "@matthewhardnack I would love to see a quick intro text on the homepage or first page, or even a bubble explaining how content gets into the feeds. I think the way it works is people simply post. Is there a curation or approval mechanism?", "group_id": 250, "id": 514897}, {"user_id": 17865, "stars": [], "topic_id": 16798, "date_created": 1301839094.5732191, "message": "Also, there is a loop going on in the \"Publish an update\" flow. It's not clear that I'm done publishing my update.", "group_id": 250, "id": 514915}, {"user_id": 17865, "stars": [], "topic_id": 16798, "date_created": 1301838868.929261, "message": "Ok, now I'm creating a new update, why make me go through steps? A single screen with as few steps as possible would be better, IMO.", "group_id": 250, "id": 514901}, {"user_id": 8224, "stars": [], "topic_id": 16798, "date_created": 1301842841.945112, "message": "How do I actually see my feed?", "group_id": 250, "id": 515309}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301862823.041451, "message": "@nmelo as far as creating the update with a single screen, that's something I was wanting feedback on, you're the first to dislike it, so great feedback. My thought was that it makes the process seem simpler and makes people more likely to contribute if they only see a few options at a time. Also, the loop you speak of, is a bug, thanks for telling me about that.", "group_id": 250, "id": 517176}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301862328.843689, "message": "@nmelo yeah, we was going to do video screen capture, introducing and walking through the basics of the website, once we got the other core feature done. I was also considering doing little popup bubbles for the first use of the website, explaining what to do and how to do it for getting started. Also, there is an approval method, each update/publisher has to be approved by moderators. I was thinking of removing that handicap when the actual creators of the content (for example say blizzard came along and said they wanted to publish updates to Diablo 3), they'd be verified and would have their updates sent out instantly.", "group_id": 250, "id": 516991}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301863602.2265749, "message": "@nerdyworms to see your feed, subscribe to a few publishers that have updates, like Diablo 3 or a few other popular publishers, then you can view all the updates on the Updates page. It's also worth mentioning that we have a facebook app that will register you through facebook, if you aren't already signed up and will allow you to subscribe you to \"likes\" that are similar to publishers on subscriby.com, you can try it at http://www.subscriby.com/facebook/", "group_id": 250, "id": 517450}, {"user_id": 9321, "stars": [], "topic_id": 16798, "date_created": 1301864793.04897, "message": "Yes I think it is a great start. Seems to be a viable working product. I think you do need a few example cases or videos or something to show people how to use it, because at first glance I can't figure out why I would want to use it.", "group_id": 250, "id": 517819}, {"user_id": 22729, "stars": [], "topic_id": 16798, "date_created": 1301893539.4672101, "message": "A little amused Color was mentioned as a good example of launching early considering how much backlash they had from their launch. IMO the launch of tier half-baked product possibly hurt them more than it helped them. A private beta could've easily given the obvious feedback that they were reamed with. Now they will really have to up the bar if they don't want to be laughed at next time they are mentioned in TC.", "group_id": 250, "id": 520687}, {"user_id": 22729, "stars": [], "topic_id": 16798, "date_created": 1301893587.1954041, "message": "For the record, I'm interested to see what Color has to offer. I just think it's a bad example of the benefits of launchin sooner rather than later.", "group_id": 250, "id": 520690}, {"user_id": 25716, "stars": [], "topic_id": 16798, "date_created": 1301893637.1658151, "message": "@freshfunk I agree, Color is really a bad example and at least I do not have any wish to even remotely support them in anyway :P", "group_id": 250, "id": 520693}, {"user_id": 22729, "stars": [], "topic_id": 16798, "date_created": 1301893862.7409661, "message": "My own advce is to be public about it if you feel you'll benefit from user feedback since development and design is typically in a black box until users use it. Don't be afraid of people being turned off because it's not fully featured. Those people won't be happy until year 5 anyway. Youi want early adopters who will be more forgiving for a less than perfect UI and buggy product but understand the promise of your product. Also people always care much less than you think so I really feel you have nothing to lose (unless you've taken $41mm in funding and put out a crazy abstract iPhone app that doesn't work if you're not smack in the middle of downtown SF).", "group_id": 250, "id": 520704}, {"user_id": 9321, "stars": [], "topic_id": 16798, "date_created": 1301934868.038497, "message": "@freshfunk  @dsch I am kind of surprised at all the haters on Color. Sure it has some problems... and some people don't understand it, but I think it is one of the most innovative products to come along in months. They threw version 0.5 out into the wild and they got people talking and I think they needed to do that. The service doesn't do ANYTHING unless people are using it and trying it out, and I don't think a small private beta would be enough to get people using it enough for it to work properly, so I am with them - I agree with their early launch. \n\nIt took a long time for people to \"get\" twitter - and twitter had HUGE problems early on, nobody seems to remember all the \"is twitter down\" complaints.", "group_id": 250, "id": 524568}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301939511.9178679, "message": "@mattarata @freshfunk @dsch It does seem that the biggest challenge Subscriby is facing explaining the product, I'm sure that twitter faced this challenge as well. In Subscriby's case there are very few services that provide the type of filtering we aim to accomplish. One website I can think of being friendbinder.com, but it's much easier to understand as to what it does and how it works. How does one properly explain a service that filters micro-updates based on minimal user-input? Anyways, that's a bit of a tangent, it seems like what you do as a start-up, like going public very early, or staying private is very dependent on the start-up itself, as well as the founders. I kind of feel like Subscriby is kind of in the boat of early publication. That being because I've found little to base the service off of, other than websites for updates such as twitter and facebook. Which I think has served me well so far, but I don't have much to go off of for the type filtering we're doing. Would you guy's agree that Subscriby is a service that should have very early adopters/publications?", "group_id": 250, "id": 525992}, {"user_id": 21360, "stars": [], "topic_id": 16798, "date_created": 1301957960.4458239, "message": "@matthewhardnack  Cool concept.  I think you need to narrow your market to a specific service.  The website would have to be set up with genre, like music.  A list of different types of music would display (alternative, rap, rock,...)  Then selecting, a list of different bands within that genre.  That's where your service comes in:  You can choose up to 5 bands to follow for a subscription price of $10 a month.  In that one month you send all information about those 5 bands... including concert tickets, albums, band member blogs, twitter and facebook links....  That alone is a huge ordeal to accomplish in real time.  From there you can expand out to other areas.  Start with what you know.", "group_id": 250, "id": 530209}, {"user_id": 1040, "stars": [], "topic_id": 16798, "date_created": 1301958282.383342, "message": "@Mattarata - Twitter being occasionally down is still a pain in the ass for app developers! :p", "group_id": 250, "id": 530263}, {"user_id": 26589, "stars": [], "topic_id": 16798, "date_created": 1301960574.9150989, "message": "@Energypanacea Great feedback, this was an original thought of mine, but with release dates, so there would be release dates you could subscribe and get notified about from music, movies and games. I'm wondering how practical that would be at this point though,  perhaps some others could provide their opinions regarding this matter?", "group_id": 250, "id": 530655}, {"user_id": 21360, "stars": [{"date_created": 1302054460.2300639, "user_id": 1}], "topic_id": 16798, "date_created": 1302053811.131634, "message": "@matthewhardnack Just go with it!  Do all the links by hand.  You can find an algorithm to do the work later.  But for now, get your friends and family to pay $20 a month for the service.  (they will pay more to support your business venture --  it's called \"love money\" and it's how most start such an undertaking.) Google all your search results for the music, talk with music store owners, make contacts with band members and groupies, and get that info to subscribers.", "group_id": 250, "id": 552439}, {"user_id": 21360, "stars": [], "topic_id": 16798, "date_created": 1302054179.0841451, "message": "@matthewhardnack As far as \"release dates\", those are your deadline to get info...  Don't have the subscriber only pay for one release.  It is a subscription, recurring monthly and billed monthly.  Guarrantee at least 10 important info items on a topic every release date. After 2 months you will know if it generated a buzz within your family and friends.  If it did you have a good product, GL.\n", "group_id": 250, "id": 552541}, {"user_id": 24837, "stars": [], "topic_id": 16798, "date_created": 1302191978.878654, "message": "Another vote for going live ASAP with the minimally viable product.", "group_id": 250, "id": 576663}, {"user_id": 26010, "stars": [], "topic_id": 16798, "date_created": 1302944739.492332, "message": "New app launching soon in NYC looking for early adopters with digital content: http://igobubble.com/content", "group_id": 250, "id": 709964}]