[{"user_id": 14070, "stars": [], "topic_id": 15070, "date_created": 1301006888.7988369, "message": "I'm still looking for a way of joining people, sharing ideas and working together on open source software. I don't have the opportunity to assist any conference for the moment so maybe you could point me to the best ways of getting involved.", "group_id": 81, "id": 432227}, {"user_id": 14070, "stars": [], "topic_id": 15070, "date_created": 1301006776.2250161, "message": "I was wondering if there are \"online sprints\"?", "group_id": 81, "id": 432210}, {"user_id": 22985, "stars": [], "topic_id": 15070, "date_created": 1301022126.028125, "message": "The django dash is a great 'online sprint' of sorts.  Also, check meetup.com for django groups in your area.  Or check github.com for django projects to contribute to. No open source project will ever turn down free unit tests!", "group_id": 81, "id": 434552}, {"user_id": 3354, "stars": [], "topic_id": 15070, "date_created": 1301027799.644182, "message": "The PSF is more actively funding sprint activities. You should watch that information stream at http://pythonsprints.com/ and ask the sprints if they'd like remote participants. Most sprints are happy to have you.", "group_id": 81, "id": 435600}, {"user_id": 209, "stars": [], "topic_id": 15070, "date_created": 1301063502.333492, "message": "What are strategies for getting people involved with your open source software?  I've been working on a project for a long time, it's getting to a place where we're almost ready for a lot of involvement", "group_id": 81, "id": 438817}, {"user_id": 209, "stars": [], "topic_id": 15070, "date_created": 1301063537.4029729, "message": "From my experience (trying to work with other projects) I think that documentation, and easy points of entry for newcomers are really important", "group_id": 81, "id": 438822}, {"user_id": 2588, "stars": [{"date_created": 1301074710.7032101, "user_id": 209}], "topic_id": 15070, "date_created": 1301073204.687345, "message": "Having a decent set of tests is helpful. If I'm going to make changes I want to know that I have a working baseline to start from. Tests are also a great complement to good documentation for getting a feel of how the code is intended to be used in practice. If I'm unsure about a particular section of your code I'll look for references to it in the tests.", "group_id": 81, "id": 440236}, {"user_id": 4077, "stars": [], "topic_id": 15070, "date_created": 1301117707.6753089, "message": "I've gotten out of doing government work, and have actively worked on becoming part of the developer community lately.  Here are a few ideas for how to get connected: Djangocon, Pycon, LUGs (Django and Python), HN Meetups.", "group_id": 81, "id": 444982}, {"user_id": 3354, "stars": [], "topic_id": 15070, "date_created": 1301117197.677319, "message": "Right now the developer team is awesome and hopefully the new mentoring initiative will make it even better. I am interested in involving non-developers too, but it's hard to persuade some people that the community at large would benefit from adding anything but more developers.", "group_id": 81, "id": 444943}, {"user_id": 4077, "stars": [], "topic_id": 15070, "date_created": 1301117743.336256, "message": "I'm most excited about the upcoming StartupWeekend event though, that I just picked my tickets up for.  I intend to blog about my impressions afterward.", "group_id": 81, "id": 444984}]