[{"user_id": 31410, "stars": [], "topic_id": 33929, "date_created": 1304656536.734129, "message": "Good idea if for no other reason but to paper-test the actual business model. Scalability and hidden start-up, operating, and growth costs can be discovered this way as well as team strengths/weaknesses", "group_id": 250, "id": 938279}, {"user_id": 2597, "stars": [], "topic_id": 33929, "date_created": 1304661701.3612039, "message": "My feeling is that during a seed stage, it isn't necessary to have a business plan", "group_id": 250, "id": 938829}, {"user_id": 1, "stars": [{"date_created": 1304686721.088752, "user_id": 2597}, {"date_created": 1304687562.5496969, "user_id": 26065}], "topic_id": 33929, "date_created": 1304662520.4028051, "message": "@equinox yeah business plans are lame IMO", "group_id": 250, "id": 938912}, {"user_id": 16418, "stars": [], "topic_id": 33929, "date_created": 1304671564.131546, "message": "Well, it depends. I see some necessity when the investment is in some very young, first time entrepreneurs. It forces them to think and learn about legislation, taxes and all the other formal things you have to obey as a CEO or COO. \n\nIf you have some experience in running a business, the next steps you have to take should be quite clear and writing a formal business plan can just keep you from spending enough time to work on the product. So, it depends on your entrepreneurial experience ...", "group_id": 250, "id": 939593}, {"user_id": 26065, "stars": [{"date_created": 1304699155.6407199, "user_id": 15929}, {"date_created": 1304713609.9220591, "user_id": 32012}], "topic_id": 33929, "date_created": 1304675979.0633039, "message": "You need a business model, not a business plan. Read steveblank.com about it. Traditional Business Plans are a relict", "group_id": 250, "id": 940135}, {"user_id": 2597, "stars": [{"date_created": 1304687707.7830541, "user_id": 26065}], "topic_id": 33929, "date_created": 1304686768.5505891, "message": "@martin_sunset if it's business model, then 100% agree.. business plan at that stage = fail", "group_id": 250, "id": 941751}, {"user_id": 9321, "stars": [], "topic_id": 33929, "date_created": 1304696298.33918, "message": "Spending time to write out a full detailed business plan would be a waste of time so early in your process (unless you really need a lot of funding to start). Spend that time on building your business instead. On the other hand, writing out a clear, short, simple explanation of the basics of your business, how it works and generally how it does or will make money, might be a good exercise for you - might help flush out your elevator pitch, or get you to be able to explain your complex model in more simple terms. If you can describe how your business works in 2-3 well written paragraphs, that might be all that is needed to get started.", "group_id": 250, "id": 943025}, {"user_id": 2597, "stars": [], "topic_id": 33929, "date_created": 1304729707.6390879, "message": "I actually agree with Dave McClure's argument in this video about business plans http://vimeo.com/15799330", "group_id": 250, "id": 948053}, {"user_id": 9321, "stars": [], "topic_id": 33929, "date_created": 1305066964.9695621, "message": "I agree with most of what Dave McClure says in that video - except for the part about MBA schools and the like shouldn't be teaching how to write biz plans. Most MBAs won't start businesses, but most MBAs will probably work in management for businesses, and having the skill of being able to write a plan for a company that is past startup phase is a great asset.", "group_id": 250, "id": 996984}, {"user_id": 23776, "stars": [{"date_created": 1305670130.5557089, "user_id": 3426}], "topic_id": 33929, "date_created": 1305127737.237638, "message": "Dedicate your time to build the product and sell it to your customers.  A b-plan is a waste of time.  I wasted over 100 hours trying to write a successful b-plan and later realized it's useless.  You might need it later if you raise VC rounds but not at early stage.", "group_id": 250, "id": 1009018}, {"user_id": 24495, "stars": [], "topic_id": 33929, "date_created": 1305225430.4748909, "message": "This is really two separate things.  Writing a \"formal\" business plan vs. having a business plan. I believe startups without either are more likely to flounder around and less likely to succeed.", "group_id": 250, "id": 1027682}]