[{"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302807800.87643, "message": "I know that has been a soft of \"Become #1 in minor countries than attack the US\". But you know what has been the strategy to do that?", "group_id": 95, "id": 688784}, {"user_id": 4374, "stars": [], "topic_id": 19469, "date_created": 1302809151.48229, "message": "That's interesting. I didn't know that they were going after other countries first.", "group_id": 95, "id": 689131}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302810911.8261199, "message": "This way they make effective communication for us. Metric says that is working", "group_id": 95, "id": 689592}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302810723.984128, "message": "The key, I think, is to be listened by your target users. So 1) identify where your target is concentrated. 2) find a way to be listened 3) convert in users", "group_id": 95, "id": 689549}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302811473.1409581, "message": "@keen I strongly suggest to reach the users as soon as possible with a minimum viable product, also if it is really creepy. Start collect feedback soon and this way you'll test the assumptions you've made about the \"communication strategy\"", "group_id": 95, "id": 689733}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302809935.462651, "message": "I was wondering about it. The #1 rules is surely create a great product. But it's not enough...", "group_id": 95, "id": 689371}, {"user_id": 4374, "stars": [], "topic_id": 19469, "date_created": 1302810098.2233269, "message": "The thing that scares me the most as a member of a startup is that even though I know our product is good, I also know neither myself or my business partner has the expertise to get it to reach critical mass globally.", "group_id": 95, "id": 689397}, {"user_id": 4374, "stars": [], "topic_id": 19469, "date_created": 1302810334.508184, "message": "Okay, that's not actually the thing that scares me the MOST but it creeps me out a fair bit.", "group_id": 95, "id": 689452}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302810803.637531, "message": "We've create a modern board game as mobile app. Our target are people 16-30 with an iphone. We've created few customizations (star wars, football, tech, etc), so we need to be listened by them.", "group_id": 95, "id": 689562}, {"user_id": 5136, "stars": [], "topic_id": 19469, "date_created": 1302810892.295367, "message": "We've found a strategy that seems to work. We're partnering with blog authors, forum admins, event organizers of this niches, where are them to create the customizations. We give them visibility or revenue share, this way they create the content for free and they will talk about what they have done, in a community where they are listened.", "group_id": 95, "id": 689584}, {"user_id": 4374, "stars": [], "topic_id": 19469, "date_created": 1302811070.148809, "message": "Great insight. Keeping an open dialog with your target market, and even with partners who are already reaching that market makes a lot of sense. I will think on that. We haven't even officially launched, though I have a feeling now is the time to start engaging people.", "group_id": 95, "id": 689604}]