[{"user_id": 41739, "stars": [], "topic_id": 46571, "date_created": 1318655644.363256, "message": "Hello everyone, I am involved in a project wherein we are required to develop a course management website.. Most probably we will be using PHP for development. As the duration of the project is very less, I thought of using CMS to start off with and to add modules as and when required. I am considering to use Drupal, Joomla or SilverStripe (these can be hosted on GoDaddy), but quite confused to finalize which one to use. I am not an expert in web development, so thought of posting it here. Following are the features which I am looking for and i think most of the CMS mentioned above does support most of them.\n1) Granular permissions (pages/content of the website), 2) Blogs 3) Media gallery support 4) E-Commerce support (PayPal or AmazonCheckout) 5) Events/Calendar support 6) User profiles/registration 7) Social networking features", "group_id": 11802, "id": 2352057}, {"user_id": 41745, "stars": [], "topic_id": 46571, "date_created": 1318689634.969671, "message": "I would use Drupal.  We use it often at work for CMS projects that require more flexibility.  There are modules for all of features you listed above, and all of them are very configurable.  Joomla is a pain to develop for and I haven't tried SilverStripe, but I know we have implemented many solutions with similar demands using Drupal.", "group_id": 11802, "id": 2353768}, {"user_id": 41738, "stars": [], "topic_id": 46571, "date_created": 1318721529.8571219, "message": "@prasanth_llz I agree with paultela, Drupal is a good choice. I just wanted to add that WordPress might also be a good choice.  It's a bit more modern and easy to use, and you can find plugins for basically everything you're asking for.  You might not be able to find a good solution for Granular permissions since older versions of WordPress didn't give much choice, but I think the newer versions are including a more customizable permissions scheme.\n\nI just no I enjoyed developing for WordPress things much more than Drupal, but I've never used Drupal 7.", "group_id": 11802, "id": 2357250}, {"user_id": 41739, "stars": [], "topic_id": 46571, "date_created": 1318880154.8441989, "message": "Thanks for the input guys.. I tried using Drupal 7 and it seems to very easy for content creation and module addition. Lots of free modules are available for drupal. So mostly will be using drupal for our development.", "group_id": 11802, "id": 2369918}, {"user_id": 41745, "stars": [], "topic_id": 46571, "date_created": 1318979668.2339649, "message": "I agree with RyanMcG about WordPress development being easier, but permissions are definitely going to be a problem.  Drupal 7 is pretty nice, the only place I ran into trouble with it was for E-Commerce, but that was a few months ago so hopefully it has gotten better.", "group_id": 11802, "id": 2380819}, {"user_id": 41739, "stars": [], "topic_id": 46571, "date_created": 1318988422.808614, "message": "yeah.. Drupal 7 is nice.. but still i could not find a proper e-commerce module which suits my need. i need to use amazon checkout for which i cannot find modules..", "group_id": 11802, "id": 2381697}, {"user_id": 41739, "stars": [], "topic_id": 46571, "date_created": 1318988557.226259, "message": "one more thing i would like to ask is... as we are developing a website for some client and when they use this drupal based website for commercial purposes, do they need to consider any licensing issues? as drupal is under GPL license will it create any issues later after deployment?", "group_id": 11802, "id": 2381717}, {"user_id": 41745, "stars": [], "topic_id": 46571, "date_created": 1319030632.5927899, "message": "That's the beauty of open source software, no licensing frustrations!  The only time you have to worry is if you were redistributing the software, then you would have to provide the source code.  As for an Amazon checkout module, I found this: http://drupal.org/project/amazon_store but it looks like it is still in beta.  We usually use Ubercart (http://www.ubercart.org/) for E-commerce, but I'm not sure it supports amazon checkout.", "group_id": 11802, "id": 2384381}, {"user_id": 41985, "stars": [], "topic_id": 46571, "date_created": 1319062826.3356929, "message": "Drupal is under GPL, which shouldn't cause any problems, even for commercial uses.", "group_id": 11802, "id": 2387506}, {"user_id": 41739, "stars": [], "topic_id": 46571, "date_created": 1319600174.077719, "message": "@paultela.. can we use ubercart for non-tangible goods.. in my case its payment for course registration.. is there a way for specifying promotion codes to avail discounts?", "group_id": 11802, "id": 2435514}, {"user_id": 41745, "stars": [], "topic_id": 46571, "date_created": 1319639373.5530341, "message": "Yes to all of those: http://www.ubercart.org/what_is_ubercart", "group_id": 11802, "id": 2438331}]