[{"user_id": 11626, "stars": [], "topic_id": 7380, "date_created": 1298075092.5102849, "message": "http://i2.cdn.turner.com/money/2011/02/18/news/economy/union_protest/wisconsin_worker_protest.gi.top.jpg\r\n\r\nPublic employees protest Wisconsin Gov. Scott Walker's proposal to limit collective bargaining and require higher benefit contributions. By Tami Luhby, senior writerFebruary 18, 2011: 7:05 PM ET\r\n\r\nNEW YORK (CNNMoney) -- Lots of state officials are pressing public employees to shoulder more of their health care and pension costs.\r\n\r\nBut in some places -- notably Wisconsin and Ohio -- officials are looking to go one step farther. Governors and lawmakers there are trying to limit or end public workers' collective bargaining ability, effectively neutering the unions.\r\n\r\nThousands of Wisconsin's public employees have descended on Madison to protest Gov. Scott Walker's proposal to raise their benefit contributions and limit their collective bargaining ability.\r\n\r\nProtests have also erupted in Columbus, Ohio as a bill proposing to eliminate collective bargaining for state workers and public university employees makes its way through the state legislature.\r\n\r\nBoth states are seeking the flexibility to change employee benefits, and they're not alone.\r\n\r\nHealth care and pension costs are soaring, making it even harder for public officials nationwide to close massive budget gaps. Forty-four states and Washington, D.C. are facing a total shortfall of $125 billion for fiscal 2012, according to the Center on Budget and Policy Priorities.\r\n\r\nIn many places, public officials have little leverage to lower these costs because they are set in union contracts. If benefits were removed from the collective bargaining process, states and localities could change them without having to negotiate with the unions, a process that can drag on for months or even years.\r\n\r\n\"It gives state and local officials more control over the costs of employing government workers,\" said James Sherk, senior policy analyst in labor economics at The Heritage Institute, a conservative think tank.\r\n\r\nMany state and local governments have been leaning on their employees as they look to cut costs and balance their budgets during the Great Recession. Workers, to varying degrees, have made concessions -- taking furloughs or pay freezes and upping their contributions to their health care and retirement benefits.\r\n\r\nState officials have long floated so-called right-to-work proposals that would curtail or eliminate union power. But this year, they are getting more traction because Republicans -- who are generally not big fans of unions -- have gained control of more state capitols and governor's mansions.\r\n0:00 /2:58Budget crisis: police and fire cuts\r\n\r\nFor instance, a bill that would end collective bargaining for teachers is currently working its way through the legislature in Tennessee, where Republicans captured the governor's office and took a commanding lead in the house.\r\n\r\nAnd in Indiana, which banned collective bargaining on the state level in 2005, lawmakers are considering a bill to curtail the power of teachers' unions, which are at the local level.\r\n\r\nGov. Walker's controversial proposal\r\n\r\nUnder Wisconsin Gov. Walker's plan, many state and local workers would pay about 5.8% toward their pension and about 12% of their healthcare benefits. They currently pay little toward their retirement benefits about about 6% of their medical premiums, Walker said.\r\n\r\nWalker says these changes would help the state save $30 million in the last three months of the current fiscal year. Wisconsin is facing a $3.6 billion budget deficit for the biennium that starts on July 1, according to the state's Department of Administration.\r\n\r\nEven more controversial, Walker is looking to limit collective bargaining for most public employees to wages only. Local law enforcement and fire employees, as well as state troopers and inspectors would be exempt.\r\n\r\nThat means health care and pension contributions would no longer be subject to contract negotiations, giving state officials greater freedom to raise them.\r\n\r\nGovernors put state jobs on the chopping block\r\n\r\nA bill in Ohio, meanwhile, would not only eliminate collective bargaining but would also make fewer police and firefighters eligible to participate in unions.\r\n\r\nAdditionally, the Ohio bill would make all public workers pay at least 20% of their health insurance premiums and would eliminate tenure as a consideration when making layoffs. And it would require pay be based on merit for most workers.\r\n\r\nOhio is facing an $8 billion budget shortfall for the coming fiscal year. Gov. John Kasich supports the bill as a way to help stabilize the budgets of the state and localities.\r\n\r\n\"We need to give our cities, towns and school districts the tools to combat one of their biggest costs -- the cost of labor,\" said Rob Nichols, his press secretary.\r\n\r\nThousands of teachers and public employees have flocked to Columbus to protest the bill.\r\n\r\n\"Students need their teachers to focus on them and their classrooms, and allowing the union to represent teachers allows them to do what they do best -- teach,\" said Philip Hayes, a teacher in Columbus and member of the Ohio Education Association, which sent nearly a thousand school workers to a rally on Thursday.\r\n\r\nConcessions from public workers\r\n\r\nGiven state budget woes, workers' pay and benefits are \"an obvious place\" to cut back, Sherk said. If employees don't make concessions, state officials will have to cut elsewhere to balance the budget.\r\n\r\n\"It means there are less tax dollars to fund government services,\" he said.\r\n\r\nBut union leaders say that public employees have been giving plenty throughout the recession. Many states have effectively cut pay by instituting furloughs and workers have been contributing more to their benefits.\r\n\r\nIn California, for instance, workers agreed last year to contribute 10% of their pay to their pensions, up from 5%, said Steven Kreisberg, director of collective bargaining for the American Federation of State, County and Municipal Employees. Ohio public employees made $250 million in concessions in 2008, including an increase in their health care contributions.\r\n\r\n\"Public employees, through their unions, are making sacrifices,\" Kreisberg said. \"Any argument that workers are not willing to make concessions is clearly not demonstrated by the facts.\"\r\n\r\nhttp://money.cnn.com/2011/02/18/news/economy/union_protest/?on.cnn=1", "group_id": 3920, "id": 147723}]