[{"user_id": 11626, "stars": [], "topic_id": 21526, "date_created": 1303864202.537817, "message": "http://www.infowars.com/fukushima-exposure-levels-going-up-everywhere\r\n\r\nFukushima Exposure Levels Going Up Everywhere\r\n\r\n    *\r\n        \tThe Alex Jones Channel \tAlex Jones Show podcast \tPrison Planet TV \tInfowars.com Twitter \tAlex Jones' Facebook \tInfowars store\r\n\r\nMark Sircus\r\nInfowars.com\r\nApril 16, 2011\r\n\r\n“Radiation is continuing to leak out of the reactors, the situation is not stable at all, radiation continues to leak,” says Dr. Michio Kaku, professor of theoretical physics at the City University of New York and top graduate of Harvard. “We are looking at a ticking timebomb. It appears stable but the slightest disturbance, a secondary earthquake, a pipe break, evacuation of the crew at Fukishima could set off a full scale melt down at three nuclear power stations–far beyond what we saw at Chernobyl.”\r\n\r\nAftershocks rattling Japan after the nation’s record quake on March 11 may continue for at least six months, increasing the risk of damage to a crippled nuclear plant at the center of the worst nuclear crisis since Chernobyl. “Aftershocks as big as magnitude-7 are likely to continue hitting in eastern and northern Japan for at least six months,” said Teruyuki Kato, a professor at the University of Tokyo’s Earthquake Research Institute.\r\n\r\nThis is the main scientist to listen to and it’s worthwhile to watch his most recent statements on the video. Radioactive contamination from the Fukushima power plant has been carried around the world and far out to sea and if current estimates and the situation do not worsen we already will have 10 percent of Chernobyl’s radiation spreading around the globe and it looks like each and every month we will see another 10 percent of another Chernobyl’s worth of radiation released to contaminate the world further. Dr. Kaku says his family is already leaving Tokyo because they don’t believe the statements of the Japanese utility because they have consistently low-balled the dangers, as has everyone else.\r\n\r\nDr. Chris Busby, another physicist says there is a rage in the people in Tokyo and he now predicts based on his calculations that 800,000 people out of about 8 million who live within 200 kilomters of the plant will contract cancer if they are not moved out. Dr. Kaku still advises entombment in a giant slab of concrete, with 5000 tons of cement, sand and boric acid but if that ever happens it will be months away and take a huge effort that would take many more months.\r\n\r\nDr. Kaku says that the, “Tepco utility people are outclassed and overwhelmed and should be removed from their positions. They are “making it up as they go along,” he says of the efforts of engineers to get this disaster under some control” He too says, “We would see increases in leukemias and thyroid cancers from the massive amounts of radioactive iodine being released.”\r\n\r\nThe operator of Japan’s tsunami-flooded nuclear power complex was seeking ways Thursday to pull damaged spent fuel rods out of a storage pool at one of its reactors, citing surging radiation and elevated temperatures as worrisome signs.\r\n\r\nThese two physicists are the men to monitor if you want a real assesment of the level seven nuclear disaster. With each passing week the words “safe”, “low levels”, “not harmful” will all lose their meaning as the more massive amounts of radiation are released. Six months from now it will be a different world with several open fission processes happening in multiple reactors.\r\n\r\n“This accident has already released something on the order of 50,000 trillion becquerels of radiation. You do the math. That puts it right smack in the middle of a level 7 nuclear accident,” said Kaku.\r\n\r\nNISA and Japan’s Nuclear Safety Commission (NSC) estimate that 370,000 – 630,000 terabecquerels of radioactive materials have been released from Units 1, 2 and 3. One terabecquerel equals one trillion becquerels.\r\n\r\nBr. Busby, who is Scientific Secretary of the European Committee on Radiation Risk, calculated two weeks ago radiation levels two weeks ago. “Since the official International Atomic Energy Agency (IAEA) figures for the Fukushima contamination are from 200 to 900kBq.sq meter out to 78km from the site, we can expect between 22% and 90% increases in cancer in people living in these places in the next 10 years. The UN definition of radioactively contaminated land is 37kBq/sq metre. Since the IAEA data show that these levels of contamination, from 200,000 to 900,000 disintegrations per second per square meter, exist up to 78km from Fukushima, we can already calculate that the contamination is actually worse than Chernobyl, not 1% of Chernobyl. For the area defined by a 78km radius is 19113 sq km compared to the Chernobyl exclusion zone of 2827 sq km. About seven times greater.”\r\n\r\nIn the next month we will see a repeat or perhaps an intensification of the radiation being put out into the environment—as the melting nuclear materials continue to break through barriers. Radiation emitted will continue for an indeterminate period – at least months, maybe years—many many years.\r\n\r\nRaw fission in the open environment is a possibility that humanity is going to have to learn how to live with. If the worst case happens—as is happening—then it will be open hunting season on everyone in the nuclear power industry as well as on politicians who have allowed them to be swayed, pressured or bribed to swear to the safety of nuclear insanity. This could be the fire pit of hell brought to earth that will finally expose the toxic monsters of the modern world for who and what they are. Making money as they have done and continue to do through the massive use of poisonous substances, nuclear or chemical, they have compromised their souls and their right to exist among more sensitive compassionate beings.\r\n\r\nThere is nothing more urgent in the field of medicine then us getting a handle on the best ways to eliminate heavy metals, radiation contamination and other toxic poisons from the body. The most obvious way of course is to reduce exposure. Sometimes to avoid toxic exposure we have to move out of a moldy house, out of a city heavily laden with air pollution or even out of a country if one plans on living a long and healthy life. If humans keep up with their intense poisoning of this planet it might mean going off the planet or burrowing deep into the ground.\r\n\r\nAvoiding exposure is not always possible when it\r\ncomes to nuclear radiation, mercury and microwaves.\r\n\r\nThe Japanese government is making a fatal mistake leaving millions of citizens too close to the exposure of the badly leaking atomic plant. Their direction to just stay indoors is not an effective and certainly not a permanent way to avoid exposure. It is understandable why they would resist removing millions from their homes but in this case it is the only way to avoid exposure and resultant radiation sickness.\r\n\r\nHow secure should we feel about the evolving situation? Dr. Kaku couldn’t make it any more frank when he said, “Fukushima is about as stable as “hanging by your fingernails off a cliff, and they’re beginning to break one by one.”\r\nRadioactive Iodine -131\r\nChina’s Ministry of Health said today April 13, that radioactive isotope iodine-131 had been detected in various kinds of vegetables in 12 provincial regions. The radioactive isotope was found in spinach, asparagus, lettuce, cabbage, Chinese cabbage and other vegetables in Beijing, Tianjin, Hebei, Shanghai, Jiangsu, Zhejiang, Shandong, Henan, Hunan, Guangdong, Guangxi and Hainan, according to a statement from the ministry.\r\n\r\nThe risks associated with iodine-131 contamination in Europe are no longer “negligible,” according to CRIIRAD, a French research body on radioactivity. The NGO is advising pregnant women and infants against “risky behavior,” such as consuming fresh milk or vegetables with large leaves. In response to thousands of inquiries from citizens concerned about fallout from the Fukushima nuclear disaster in Europe, CRIIRAD has compiled an information package on the risks of radioactive iodine-131 contamination in Europe.\r\n\r\nfter the radioactive cloud emanating from Japan’s stricken Fukushima nuclear power plant reached Europe in late March, CRIIRAD, a French research body on radioactivity, an NGO, said it had detected radioactive iodine-131 in rainwater in south-eastern France. In parallel testing, the French Institute for Radiological Protection and Nuclear Safety (IRSN), the national public institution monitoring nuclear and radiological risks, found iodine 131 in milk. In normal times, no trace of iodine-131 should be detectable in rainwater or milk. Radiation monitors in Canada, in Ontario, New Brunswick and British Columbia have also detected radioactive iodine.\r\n\r\nIn the United States EPA data show rising levels of Iodine-131, Cesium-134, and Cesium-137 up to 300% of maximum limits. Hawaii milk samples showed radiation 800% above normal for Cesium-134, 633% for Cesium-137, and 600% for Iodine-131. Water contamination measured over 20 times acceptable levels. Mainland amounts are also rising, including in air, soil, grass, milk, spinach, strawberries, and other foods.\r\n\r\nMilk is especially important as it suggests the health of the entire food supply because cows eat grass. When grass is contaminated, so is everything grown in the same soil.\r\n\r\nAt least 14 US cities reported unsafe radiation amounts in drinking water. However, EPA is only testing for Iodine-131, not Cesium, Uranium or Plutonium, all emitted from Fukushima. Several radiation monitoring stations throughout Spain have recorded increases in the concentration of iodine and cesium in the air coming from Japan. Same goes for France.\r\n\r\nOne does not want to wait for the medical authorities on the iodine issue. One has to act quickly to protect their thyroid and the thyroids especially of children. A major cloud of radioactive Iodine 131 has recently passed over South Korea and is now passing just about everywhere else in the northern hemisphere.\r\n\r\nMedical and health authorities, it seems, want all pregnant women, babies and children to be unduly exposed to radioactive iodine just because of their phobia and medical conditioning against nutritional iodine supplementation. The entire contemporary medical establishment is abandoning its fundamental mission and pledge to protect the public and their patients against harm when medically possible.\r\n\r\nWe have lots of information from Russia about the use of iodine to protect the thyroid. In Poland the use of iodine dosages was found to highly protect children’s thyroids from cancer. The risk for cancer of the thyroid is much greater in children requiring much lower exposure to I-131 than it does for adults. Same goes for pregnant women or lactating women.\r\n\r\nIt is a good time to remember Dr. Jeff Patterson’s words, former president of Physicians for Social Responsibility. “There is no safe level of radionuclide exposure, whether from food, water or other sources. Period! Exposure to radionuclides, such as Iodine-131 and Cesium-137, increases the risk of cancer. For this reason, every effort must be taken to minimize the radionuclide content in food and water.”\r\n\r\n    * A d v e r t i s e m e n t\r\n    *\r\n\r\nPersonal Note: In the next 48 hours I will submit to my staff a 2nd edition of my iodine book, which will be strongly oriented to the entire issue of iodine as an essential nutrient to protect from radioactive iodine contamination of the thyroid and other glands that have a large uptake of iodine under normal conditions. The situation is guaranteed to get worse so do not wait for the medical authorities on the iodine issue. For parents waiting means vastly increasing the chance of watching your children die of thyroid cancer! Do I need to say that any stronger?\r\n\r\nIt is not a good time to be caught like deer in the headlights nor have our heads stuck in the sand about iodine or anything else that affects our survival. The essential action is to get iodine into our bodies and it does not have to be “potassium iodide.” It can also be in the form of Nascent Iodine, which is a 2% formulation based on and old Edgar Casey type that breaks molecular iodine into its I¹ atomic structure. It is the iodine I personally use for myself and my children and is ideal for iodine sensitive people with pre-existing thyroid conditions meaning it is the easiest iodine to administer, though not the cheapest to use.\r\n\r\nThere are other forms in both tablet and liquid, even the ones that can be used topically are effective in reducing people’s vulnerability to radioactive iodine. (Do NOT drink topical antiseptic iodine products such as Betadine — these products are not suitable for human consumption. They are povidone-iodine mixtures.)\r\n\r\nI have to be honest and tell you it’s a great time to be living in the southern hemisphere. The radiation levels down here will be much delayed and much reduced and the deep valley where my Sanctuary is being finished feels very protective because it is ringed with mountains.\r\n\r\nI just spent the first few nights at my Sanctuary center deep in the interior of Brazil and the construction men are still running all over the place. I can’t wait to open Sanctuary to the world but am not so sure there will be much of a world on its feet in just a few months’ time as the financial world careens out of control. I listened to an excellent video last night that predicts that when the next earnings reports of major corporations come out in July it will be curtains for the stock markets as the nuclear disaster is taking the real economy, and thus earnings, down like a rock.\r\n\r\nIt was such a pleasure to feel the magic of being surrounded by Nature, hearing the rivers flowing around Sanctuary. No Internet, so great to be away from all the bad news and able to concentrate on finishing my manuscript for the Radiation Toxicity Syndrome book. It is an overwhelming challenge that is taking me, according to my assistant Claudia, too much time so I will come out first with the iodine book focused on the radioactive issue.\r\n\r\nFresh food that lasts from eFoods Direct (Ad)\r\n\r\nI think it’s a great time to take a vacation from the north or at least get the women and children out of harm’s way. It’s simply not a good time to be gambling with the safety of our loved ones—with the possibility of a greater explosion at the Japanese nuclear power station with a resultant massive release of radiation that travels far and wide across our planet. Men and professionals particularly have to sometimes stand their ground and even sacrifice their lives like the men are doing at the nuclear plant but we don’t have to risk our children.\r\n\r\nMany of the men in the Titanic had to encourage their women and children to get on the lifeboats without them. But in this case, if a miracle happens and there is no worse-than-imaginable-case scenario, and all-clear sirens sound, then families can be reunited. The next few weeks or months will tell us a whole lot about our futures.\r\n\r\n__________________________________________________\r\nOriginal article from Activist Post by Dr. Mark Sircus. He is a natural health expert and self-sufficiency advocate. He is the author of several must-read books including titles such as Survival Medicine For the 21st Century, Winning the War on Cancer, and Humane Pediatrics. You can find all of Mark’s informative articles at his website IMVA.", "group_id": 3920, "id": 820166}]