[{"user_id": 11626, "stars": [], "topic_id": 21532, "date_created": 1303867646.9308319, "message": "http://www.infowars.com/fukushima-radiation-exposure-much-higher-than-mainstream-media-admits/?utm_source=twitterfeed&utm_medium=twitter\r\n\r\n\r\nFukushima Radiation Exposure Much Higher Than Mainstream Media Admits\r\nBrandon Turbeville\r\nInfowars.com\r\nApril 22, 2011\r\n\r\nWhile Americans are busy focusing on the most ridiculous forms of entertainment such as Dancing With The Stars, American Idol, and whatever mindless reality show currently keeps them glued to their couches, the entire country is in the process of being covered with a cloud of toxic radiation seeping into their food, water, skin, and lungs. Sadly, even if one were to turn the channel in an effort to keep up with the latest in current affairs, there is virtually no chance of one being made aware of the level of contamination the country now faces.\r\n\r\nRegardless, since the beginning of the disaster, government regulatory agencies such as the EPA, USDA, CDC, and the NRC (Nuclear Regulatory Commission) have all claimed that there is no danger in the radiation coming from the damaged Fukushima nuclear plants. The mainstream media has obediently repeated these claims as fact.  Some media pundits such as Ann Coulter even have promoted the Orwellian and absurd notion that radiation is actually good for you, and that it prevents cancer. (Coulter has yet to explain why she has not purchased an airline ticket for Japan so she can have the opportunity to bathe in it.)\r\n\r\nYet, while numerous states (South Carolina, North Carolina, Florida, Massachusetts, Pennsylvania, California, Hawaii, Oregon, Washington) have reported through their state agencies that radiation has been detected in drinking water, soil, and milk (among other things), the Federal regulatory agencies and their media subsidiaries refuse to admit that there is any reason for concern. Virtually every media report given about the Fukushima fallout contains the suggestion that the radiation now blanketing the United States is “harmless,” “minute,” or “miniscule,” and that there is no need for alarm.\r\n\r\nYet, these claims now stand in direct contradiction to the conclusions reached by the National Academies of Science released in 2005.\r\n\r\nThe BEIR VII — meaning the seventh Biological Effects of Ionizing Radiation report on “Health Risks From Exposure to Low Levels of Ionizing Radiation” — came to a much different conclusion than the EPA, CDC, and the NRC. NAS actually concluded that there is NO SAFE LEVEL or threshold ionizing radiation exposure.\r\n\r\nSo even if the exposure to the Fukushima radiation was “miniscule,” there would still be a cause for concern because “miniscule” exposure can still cause cancer. Indeed, in a press release dealing with the release of the BEIR VII issued from the Nuclear Information and Resource Service, the NIRS states that it is well known that “even very low doses [of ionizing radiation] can cause cancer” [emphasis added].  It goes on to say that, “Risks from low dose radiation are equal or greater than previously thought” [emphasis added].\r\n\r\nIndeed, the constant reassurance given to the general public by our regulatory agencies and media that the levels of increased radiation are “miniscule” and not much different that “normal background radiation” also fly in the face of the BEIR VII report. This is because the report also concluded that “Even exposure to background radiation causes some cancers. Additional exposures can cause additional risks” [emphasis added].\r\n\r\nIn addition, as we know from our escapades in Iraq and Afghanistan, as well as many other instances, that exposure to radiation, even if it causes no visible adverse health effects in those who are directly exposed, can have serious side effects on their offspring. The BEIR VII reaffirms this previous knowledge as well.\r\nA d v e r t i s e m e n t\r\n\r\nThe NIRS Energy and Health Project Director at the time of the report, Cindy Folkers, stated in regards to the BEIR VII report, “These findings confirm that all levels of radiation are harmful. Since nuclear power routinely releases long-lasting radiation into the air, water and soil, we must avoid a new generation of nuclear power to prevent unnecessary exposures” [emphasis added].\r\n\r\nIf nuclear power plants “routinely release long-lasting radiation into the air, water and soil,” what happens to a nuclear power plant when it is hit by several earthquakes, tsunamis, and explosions? How much radiation is released when the nuclear reactors meltdown? Are we really to believe that the levels of radiation are “miniscule” and “harmless” even if we are across the ocean from the reactor?\r\n\r\nApparently, your government thinks you will believe it. In fact, they have already begun taking measures to make sure you will.\r\n\r\nAs I have written in previous articles, the EPA has proposed changes to the PAG’s (Protective Action Guides) that would raise the acceptable levels of radiation in food, the environment, and even humans in the event of a “nuclear emergency.”  Public Employees for Environmental Responsibility (PEER) released a leaked email in which Charles Openchowski of the EPA’s Office of General Counsel, writing to the Office of Radiation and Indoor Air, wrote:\r\n\r\n[T]his guidance would allow cleanup levels that exceed MCL’s [Maximum Contamination Limits under the Safe Drinking Water Act] by a factor of 100, 1000, and in two instances 7 million and there is nothing to prevent those levels from being the final cleanup achieved (i.e., it’s not confined to immediate response of emergency phase).\r\n\r\nStock up with Fresh Food that lasts with eFoodsDirect (Ad)\r\n\r\nAt the same time (coincidentally of course) the EU has implemented EU Ordinance 297/2011, which raises the Maximum Levels of radiation and radioactive isotopes for food and feed.\r\n\r\nClearly, all levels of radiation — even what is considered “background” levels — are carcinogenic and create the potential for a host of adverse health effects. There appears to be a concerted effort by governments across the world to (at best) conceal the realities of the danger in regards to the Fukushima fallout; especially since their present claims stand at odds with the previous science conducted by their own agencies.\r\nAt worst, there may be a much more sinister side to this entire issue. Unfortunately, the more coincidences there are, the more the odds tilt in favor of the latter.\r\nThis article first appeared on the Activist Post website.\r\n\r\nBrandon Turbeville is an author out of Mullins, South Carolina. He has a Bachelor’s Degree from Francis Marion University where he earned the Pee Dee Electric Scholar’s Award as an undergraduate. He has had numerous articles published dealing with a wide variety of subjects including health, economics, and civil liberties. He also the author of Codex Alimentarius – The End of Health Freedom and 7 Real Conspiracies.", "group_id": 3920, "id": 820508}]