[{"user_id": 37586, "stars": [], "topic_id": 44120, "date_created": 1313781416.1604121, "message": "I am not a licensed therapist but I play one on a webisode (jk) but I am starting this thread to discuss the possibilities Dramatica has for therapy (personal problems & relationship problems)", "group_id": 11394, "id": 1912213}, {"user_id": 39675, "stars": [], "topic_id": 44120, "date_created": 1313804219.324033, "message": "I have a BA in psychology and worked for many years with youth in treatment in a secured facility, as on call milieu staff.  Dramatica is too complicated, other than to be used to create stories so they could stop thinking about themselves as the all in all.  Horrific things happen to people, however, the biggest challenge is for them to just move on.  That is the role and goal of therapy.  Getting them to use Dramatica to create stories as a possible occupation would be beneficial.  IMHO, of course.", "group_id": 11394, "id": 1914399}, {"user_id": 39675, "stars": [], "topic_id": 44120, "date_created": 1313806713.337003, "message": "The issue is that you two will understand the definitions, differently.  My husband falls asleep until the action starts, then I go off and do some needed things until the action is over.  \n\nYou could use Dramatica as a tool for them to recognize their behavior patterns, though.  However, they wrangle over the dram is how they would wrangle in real life situations.  You could frame the dram therapy session as writing a play about an evening and/or event, and/or a week together.  Get them to play act a reality episode that they script.  \n\nDramaturgy is a very powerful therapy system, I understand, from psyc classes dealing with research results.  I can't remember the details, but I would keep the writing aspect, for the enacting aspect to be dynamic.", "group_id": 11394, "id": 1914671}, {"user_id": 37586, "stars": [], "topic_id": 44120, "date_created": 1313805650.837842, "message": "How about not so traumatic problems. Say my girlfriend and I r having relationship problems. My situation is My low income. Her fixed attitude is that our relationship will never work long term because she feels like she has to support me.  Is our relationship in Manipulation or in the Activity of getting me a career where I make a living wage and still be happy.  What r the issues? What is the real problem? Just ideas. Actually I think I got the idea from the book.", "group_id": 11394, "id": 1914540}, {"user_id": 37586, "stars": [], "topic_id": 44120, "date_created": 1313932113.787719, "message": "@prish for that matter, don't traumatic things happen in stories? And when u say,  \"they could stop thinking about themselves as the all in all\" is not that covered in Dramatica? Issue if Self Interest? Or problems of self aware?  Coming up with stories is one idea. They r powerful tools to help people. Haven't  shamans used stories for centuries ? But even without stories couldn't the story form be a way to figure out issues and problems? And each problem has a solution on which to focus. And even then one might find what was thought the problem is the symptom so instead of self aware one might switch the focus to ability as the solution to the problem of desire for example.", "group_id": 11394, "id": 1922187}, {"user_id": 39675, "stars": [], "topic_id": 44120, "date_created": 1313980037.524668, "message": "Years ago, a dram consultant told me he found that many people did not place the right (from their story thingamajig) ingredient in the correct dram slot, for storyforming and/or analysis.  However, the writers ended up with some (from their story thingamajig) ingredient in every dram slot, so it ended up being a complete story.  I took it as an indication that our instinct completes the writing, correctly.  Now, that was people who knew and used the theory.  I'm not discouraging the use for therapy, but I suggest \"Yes, you are doing good.\" be the standard answer from the therapist, while using it. <G>.", "group_id": 11394, "id": 1926569}]