[{"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310243370.181113, "message": "Hi all. @jimhull, if this is too off topic let me know and I won't make future posts of this type of post in this area.\n\nI've created my first instructional video to introduce users to DP4 inspired by many of the \"I didn't know that\" remarks from new Dramatica users in the San Francisco group. It doesn't contain anything you guys don't already know about Dramatica, but it's my first video and I thought I'd share it here for feedback:\nhttp://www.youtube.com/watch?v=QJzXkRBsgzA\n\nLast semester in college I completed my first screenwriting class, and next semester I plan to take introductory film making courses (and maybe another screenwriting class, depending on how much free time I don't want).", "group_id": 2515, "id": 1600548}, {"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310243434.413311, "message": "I'm hoping the film making classes will help me improve the quality of productions such as the one shared above.", "group_id": 2515, "id": 1600558}, {"user_id": 7645, "stars": [], "topic_id": 41542, "date_created": 1310253517.4613481, "message": "I got a credit! Thanks for that - good overview, one note would be to speed up those transitions in-between sections, other than that, nice intro, video was clear and text was easy to read.", "group_id": 2515, "id": 1601322}, {"user_id": 10814, "stars": [], "topic_id": 41542, "date_created": 1310316201.8179581, "message": "Hey Buck --", "group_id": 2515, "id": 1605166}, {"user_id": 10814, "stars": [], "topic_id": 41542, "date_created": 1310316228.980005, "message": "Overall, well done.  I agree with Jim that the transitions are too slow.", "group_id": 2515, "id": 1605170}, {"user_id": 10814, "stars": [], "topic_id": 41542, "date_created": 1310316283.6048119, "message": "Also, some of the title card fonts are small.  But again, overall I think the pace and presentation is solid.  THANKS!", "group_id": 2515, "id": 1605174}, {"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310343170.7702589, "message": "The default transition time was 3 seconds. That has been changed to 1.3 seconds.\n\nI've added an additional link/reference to Jim's StoryFanatic site, and expanded the text description of the video that appears to all visitors so that it includes direct links to the websites referenced in the video. ", "group_id": 2515, "id": 1607787}, {"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310343176.680547, "message": "\n@Chris_Huntley, regarding the title card fonts, I increased the fonts size of the groups mentioned in the beginning of the video, but left everything else the same because I can't duplicate the problem. The font size may depend on monitor resolution and the size the video is being viewed in. The video was recorded at 720p (1280x720), so adjusting the viewing size in YouTube may be the solution. I'll experiment with the font size in future videos and hopefully find a better solution.\n\nEveryone, thanks for the feedback. Learning the software to create this type of video was effortless, but learning how to speak in front of the camera is another matter altogether.\n\nThanks again.", "group_id": 2515, "id": 1607788}, {"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310343163.044975, "message": "I've deleted the video from the above link, made minor edits, and now the slightly improved version appears here (and there's no need to view it again): http://youtu.be/2ooSr1NlU6g", "group_id": 2515, "id": 1607786}, {"user_id": 13109, "stars": [], "topic_id": 41542, "date_created": 1310347230.0979331, "message": "Hey buck, thanks for the post.  I am going to have another watch on my system that has DP.  I haven't had the chance to watch the new cut so you may have fixed it, but I would suggest dropping in some room tone over the transition so they don't jar as much audibly.", "group_id": 2515, "id": 1608109}, {"user_id": 7664, "stars": [], "topic_id": 41542, "date_created": 1310414227.6945829, "message": "@Buck So, I'm a little late to the game, but I don't have any comments that would lead to a re-edit anyway. It's well done and clear. And, the transition speed seemed fine to me -- I never saw the long one.", "group_id": 2515, "id": 1614784}, {"user_id": 7664, "stars": [], "topic_id": 41542, "date_created": 1310414329.618253, "message": "I was just going to say that you should turn off the giant picture frame over your left shoulder when you do your next one.\n\nIf there was a contextual comment, it would be to add up front that this video isn't going to go into the dramatica theory, even though that is implied by saying, \"I'm talking about the software.\" \n\nAnyway, nicely done.", "group_id": 2515, "id": 1614806}, {"user_id": 7712, "stars": [], "topic_id": 41542, "date_created": 1310497871.9542, "message": "Brendon, Mike, thank you, excellent suggestions. And again, I appreciate the feedback.", "group_id": 2515, "id": 1622233}, {"user_id": 36437, "stars": [], "topic_id": 41542, "date_created": 1310500404.261894, "message": "I just watched the second link, and think it's well put together, clear, and concise :)", "group_id": 2515, "id": 1622585}]