[{"user_id": 25, "stars": [], "topic_id": 1743, "date_created": 1296863440.0604811, "message": "The King's Speech. I really liked True Grit, but then I saw this. It's just terrific, and timeless- it'll still be a fantastic movie 20 years from now.", "group_id": 138, "id": 45612}, {"user_id": 224, "stars": [], "topic_id": 1743, "date_created": 1296874971.809031, "message": "Yeah, King's Speech was really good. Haven't seen True Grit, yet, though, so I can't say if KS is my favorite movie of the past year.", "group_id": 138, "id": 45981}, {"user_id": 224, "stars": [], "topic_id": 1743, "date_created": 1296875023.7905209, "message": "Only other nominees I've seen are Toy Story 3 and The Social Network", "group_id": 138, "id": 45982}, {"user_id": 14939, "stars": [], "topic_id": 1743, "date_created": 1298428169.275507, "message": "I liked the Economist's criticism of King's Speech. I think Inception should win just for pulling off something so innovative, epic and cinematic. Posted the smae to \"Social Network\" topic. King's Speech may have a great script and acting. But what about the the art direction and the music? Is it innovating? Is it making use of all that cinema can bring to the table? I haven't seen the movie but I haven't heard anyone talking about those elements. I assume it's not doing those things. I back Inception for best picture. I thought True Grit was fucking great too -- more interesting to me than No Country for Old Men. But Inception was really just firing on all cylinders.", "group_id": 138, "id": 185542}, {"user_id": 14939, "stars": [], "topic_id": 1743, "date_created": 1298428247.987756, "message": "Jeff Bridges should probably win best actor again. Hahah, that may be going to far but.. he was awesome.", "group_id": 138, "id": 185544}, {"user_id": 25, "stars": [], "topic_id": 1743, "date_created": 1298428648.0626631, "message": "I agree with many of your points, but really you can't compare them to King's Speech until you've seen it - it's really masterful. My biggest problem with Social Network as a total movie is that Eisenberg's himself is tight and contained, and he played a tight, contained character. Definitely not a best actor performance. Inception was so creative, so out-of-the-box, that it deserves to win something. Bridges as Rooster Cogburn was my favorite until I saw Colin Firth in King's Speech.", "group_id": 138, "id": 185561}, {"user_id": 10453, "stars": [], "topic_id": 1743, "date_created": 1298437045.6389461, "message": "I didnt see King speech.. but I vote for Inception =)", "group_id": 138, "id": 185795}, {"user_id": 25, "stars": [], "topic_id": 1743, "date_created": 1298437891.410557, "message": "Hahaha \"I ain't no tailor but I know what suits me.\"", "group_id": 138, "id": 185858}, {"user_id": 14939, "stars": [], "topic_id": 1743, "date_created": 1298481032.177326, "message": "http://www.economist.com/blogs/bagehot/2011/01/british_monarchy", "group_id": 138, "id": 188826}]