[{"user_id": 2067, "stars": [], "topic_id": 46916, "date_created": 1319280202.9673769, "message": "I'd love to receive any feedback you might have for http://intros.me.", "group_id": 95, "id": 2406248}, {"user_id": 5145, "stars": [], "topic_id": 46916, "date_created": 1319484660.9066081, "message": "This is a great idea! How do you differentiate yourself from the likes of http://about.me and http://flavors.me?", "group_id": 95, "id": 2422926}, {"user_id": 42903, "stars": [], "topic_id": 46916, "date_created": 1319875881.6776111, "message": "Something that ALWAYS annoys me - why enforce a password must be 8 letters - at MOST a website should advise me if they think my password is weak, but its just rude to insist I must use x number of characters - as a user its my choice.", "group_id": 95, "id": 2460090}, {"user_id": 12641, "stars": [], "topic_id": 46916, "date_created": 1319957595.4447939, "message": "Because a site can experience other collateral damage if your account gets hijacked. A password less than 8 characters is too weak for any secure purpose. A brute force attack (assuming an offline attack) can break it in a very short time-frame.", "group_id": 95, "id": 2466604}, {"user_id": 33347, "stars": [], "topic_id": 46916, "date_created": 1319978060.2176931, "message": "@FCGreg What collateral damage could be caused by a different person logging into a user account?", "group_id": 95, "id": 2467926}, {"user_id": 12641, "stars": [], "topic_id": 46916, "date_created": 1319991569.1543889, "message": "Believe me, once you are responsible for administering a site or an online-community like that, this stuff becomes very important to you-- very quickly.  Hope that helps.", "group_id": 95, "id": 2469000}, {"user_id": 12641, "stars": [], "topic_id": 46916, "date_created": 1319990692.105356, "message": "@supjeff  For some quick examples:  They can use your account to access areas of the site as you... possibly with access/permissions they did not have themselves. (Think Facebook, and the attacker harvesting/spamming all of the profiles on your Friends List).  Or perhaps they post some malicious product reviews using your identity (and therefore your credibility you may have built-up over a long period) to sway the rankings in favor of someone else. (Think Amazon.)  Or, perhaps they fraudulently shill several auctions (on eBay, for example) causing them to end early or overpriced... then eBay has to deal with cleaning up the mess.", "group_id": 95, "id": 2468912}, {"user_id": 3159, "stars": [], "topic_id": 46916, "date_created": 1320084770.026437, "message": "@themadray Can you address @surajreddy 's question? I think that's what we're all wondering", "group_id": 95, "id": 2477178}, {"user_id": 41865, "stars": [], "topic_id": 46916, "date_created": 1321241082.183672, "message": "First of all get rid of purplish background color. Just select a clear color like white or sky blue. This will put web presence more close to social networking look an feel", "group_id": 95, "id": 2569584}, {"user_id": 2851, "stars": [], "topic_id": 46916, "date_created": 1323064507.0424969, "message": "A little late, but it would be nice if there was a quick preview option, or even a link to view your own profile. If it is there, it isn't obvious. Otherwise, pretty cool.", "group_id": 95, "id": 2702731}, {"user_id": 22170, "stars": [], "topic_id": 46916, "date_created": 1323153178.920162, "message": "or @zerply - its interesting ... but doesnt really get to what needs to be done to help grow the indie web. We don't need another silo.", "group_id": 95, "id": 2709073}, {"user_id": 17654, "stars": [], "topic_id": 46916, "date_created": 1323267438.7624061, "message": "The flickr oauth doesn't work , I am getting redirected to staging.intros.me :)", "group_id": 95, "id": 2716775}]