[{"user_id": 11626, "stars": [], "topic_id": 42562, "date_created": 1311477896.3459461, "message": "China’s Two-Pronged Maritime Rise\r\nChina is following a two-prong strategy with its impressive maritime build-up. The West is making a mistake if it underestimates the implications.\r\nThe Diplomat\r\nJuly 24, 2011\r\n\r\nFor the past decade, while the West has been consumed battling Islamic extremists in the Middle East and Central Asia, China has been engaged in a rapid and impressive effort to establish itself as the supreme maritime power in the Eastern Pacific and Indian Oceans. \r\n\r\nFor years, China focused its military spending on the People’s Liberation Army, while the Air Force and Navy served as little more than adjuncts to the Army. But with the launch of its first aircraft carrier next month, the rest of the world – and especially the United States’ Asian allies – is taking note of how dramatically things have changed. China has big maritime ambitions, and they are backed up by a naval build-up unseen since Kaiser Wilhelm II decided to challenge British naval power with the building of the High Seas Fleet at the turn of the last century.    \r\n\r\nChina’s build-up is driven by a two-pronged strategy. First, China seeks to deny access by the United States and other naval powers to the Yellow, East China and South China Seas, thereby (1) establishing its own equivalent to the way the United States saw the Caribbean in the 20th century, from which its blue water navy can operate globally; (2) dominating the natural resources and disputed island chains such as the Spratly and Senkaku Island chains in those seas; and (3) giving it the capacity to reunify Taiwan with the mainland by force and without US interference, if necessary. China’s assertiveness in confronting and harassing Asian and US civilian and naval ships in the region over the past decade shows a sustained level of determination on this front.\r\n\r\nhttp://the-diplomat.com/2011/07/24/china’s-two-pronged-maritime-rise", "group_id": 3920, "id": 1708412}]