[{"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1298872347.4286389, "message": "I apologize if my descriptions are still unclear, my background is in business and i have only an average understanding of html, css, and php", "group_id": 250, "id": 223730}, {"user_id": 16271, "stars": [], "topic_id": 9470, "date_created": 1298873156.6768241, "message": "@JAnderson Ah well let us know how you decide to proceed and how it works for you.", "group_id": 250, "id": 223781}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1298871990.205725, "message": "Hello everyone... Im looking for opinions because I found a programmer who suggested potential using a template for a user interactive website rather then building it completely from scratch because instead of taking 3 months it would take 3 weeks. My question is are you for or against the use of site templates, in regards to creating a service website which will operate as a business?", "group_id": 250, "id": 223707}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1298872269.441268, "message": "yes that pretty much what I'm getting at, a pre-made site structure that potentially fulfill all my needs. My concerns were that a) that might not be possible (meeting every one of my needs) and b) being able to deliver a 100% unique product", "group_id": 250, "id": 223724}, {"user_id": 16271, "stars": [], "topic_id": 9470, "date_created": 1298872094.670202, "message": "What do you mean by a template?  I think taking advantage of existing abstractions for the sake of efficiency is a good thing if and only if it meets your requirements.  But if the \"template\" that you're looking at meets your needs then why not?  There's no virtue in subscribing to the Not Invented Here bias.  If some preexisting software meets your needs then I say go for it.  Why reinvent the wheel?", "group_id": 250, "id": 223711}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1298873052.052537, "message": "true.... we haven't begun looking through templates yet, I preemptively asked the question because I have a meeting with the programmer tomorrow and he's going to show me a few that he has found", "group_id": 250, "id": 223775}, {"user_id": 16271, "stars": [], "topic_id": 9470, "date_created": 1298872702.7643559, "message": "@JAnderson You will probably get even better feedback if you post which template you are looking at and what your requirements are.  Of course you may not want to do that if you're trying to keep your idea \"hush hush\" but it's always easier to speak in specifics versus generalities.", "group_id": 250, "id": 223763}, {"user_id": 16271, "stars": [], "topic_id": 9470, "date_created": 1298872435.585202, "message": "No worries about your technical background.  My suggestion is that you go over your requirements with your developer and if the template meets your needs then why not use it.  If it doesn't then the question is whether it's more work to extend the template to support your requirements versus designing a custom solution from scratch.", "group_id": 250, "id": 223740}, {"user_id": 16271, "stars": [], "topic_id": 9470, "date_created": 1298872516.7556341, "message": "Also I'd keep in mind not only your current requirements but what requirements you might have down the road, in as far as you can predict that.  But usually when people start a project they have at least some idea in the back of their mind what they want to do as far as \"down the road\" work (ie. version 2.0)", "group_id": 250, "id": 223746}, {"user_id": 3030, "stars": [], "topic_id": 9470, "date_created": 1298873254.840337, "message": "@JAnderson If the template matches up to 70% of your requirements, it might be a good option to consider. It will allow you to test your ideas / market while reducing costs and risk (needing custom development while being non-technical is a risk).", "group_id": 250, "id": 223787}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1298872631.742425, "message": "I appreciate the advice... thanks a lot", "group_id": 250, "id": 223757}, {"user_id": 1116, "stars": [], "topic_id": 9470, "date_created": 1298944231.742672, "message": "The good part is that you look like everyone else and everyone knows how to use your website. The bad part is that you look like everyone else and don't stand out. It really depends on who you are targeting.", "group_id": 250, "id": 230879}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1299043698.983665, "message": "I spoke to my web developer yesterday and we came to a decision that for the product Im launching, the best strategy is really to test the market. He's using elgg so even though its templated to an extent it wont be noticeable to the avg visitor", "group_id": 250, "id": 244486}, {"user_id": 14413, "stars": [{"date_created": 1300538467.9252501, "user_id": 22503}], "topic_id": 9470, "date_created": 1299043832.1530399, "message": "at least thats my optimistic entrepreneurial perspective lol... I know I'm being vague but the first version of the product should be done in a few weeks so I'll be sure post a link when it launches... thanks for the incite, really appreciated", "group_id": 250, "id": 244494}, {"user_id": 14413, "stars": [], "topic_id": 9470, "date_created": 1299043752.3935089, "message": "Once we find (and we should find) that their is a strong market for it, we're going to go to work on the beta version, which will have a full business model and really differentiate itself", "group_id": 250, "id": 244490}, {"user_id": 218, "stars": [], "topic_id": 9470, "date_created": 1299298802.293025, "message": "@JAnderson insight, not incite. Also, its typically preferable to have a business model *before* the beta version launches ;)  Good luck though!", "group_id": 250, "id": 275077}, {"user_id": 22627, "stars": [], "topic_id": 9470, "date_created": 1300436374.5548091, "message": "Elgg? I think it's a good idea to use it for a beta. First: because it's not famous like Wordpress or other cms/framework, so at first look is good. Second: it's really easy to use and works well. Third: there are many plugin to use. But it's all about the developer to make something really good. Why dont you try Dolphin? Give it a try at www.boonex.com", "group_id": 250, "id": 380542}, {"user_id": 20138, "stars": [], "topic_id": 9470, "date_created": 1300644677.5488601, "message": "Don't use templates.", "group_id": 250, "id": 393013}]