[{"user_id": 20848, "stars": [{"date_created": 1303758703.7305629, "user_id": 25716}, {"date_created": 1303763259.582015, "user_id": 13912}, {"date_created": 1303768796.7511079, "user_id": 14049}, {"date_created": 1303788326.740185, "user_id": 15929}], "topic_id": 21218, "date_created": 1303736263.272547, "message": "First off let me apologize for the criticism, I genuinely enjoy checking out peoples' projects and am grateful for learning about their experiences.  That said, I don't understand why so many projects that come thru HN etc. are billed as having been made \"in one day/weekend\" etc.. It seems to be a means of simultaneously bragging/fishing for compliments and hedging in case things don't work or people don't like your project (\"well, I only spent a day on it...\").  Ditto (possibly moreso) the \"taught myself rails in 6 weeks and built this project.\"\n\nWhy do people do this?  \"When evaluating my project, remember, I'm a girl!\"  I think it'd be better to evaluate projects based solely on the merit of the project, the other stuff just muddles the discussion and makes it less useful in my opinion.  If your project is good, let it stand without crutches!  Am I missing something here? Respectfully, Sequoia", "group_id": 95, "id": 802966}, {"user_id": 20848, "stars": [], "topic_id": 21218, "date_created": 1303736436.612304, "message": "addendum: if you're just saying \"hey it's in beta, there are probably bugs\" that doesn't bother me, but that has nothing to do with how long you spent on it / when you learned coffescript.", "group_id": 95, "id": 802986}, {"user_id": 26065, "stars": [], "topic_id": 21218, "date_created": 1303736874.7192321, "message": "You can write quite a lot in one minute :) Seriously though I find it perfectly ok to indicate the short time it took to create something, especially when 99.999% of this planets population cannot do that. Of course you are right that it is also a hedge, but who really cares.", "group_id": 95, "id": 803034}, {"user_id": 6869, "stars": [], "topic_id": 21218, "date_created": 1303736856.329129, "message": "Ain't that a human confidence issue? Like writing in *bold* or /italic/ because you are not confident the sentence would be strong on its own, without embellishment.", "group_id": 95, "id": 803030}, {"user_id": 30768, "stars": [], "topic_id": 21218, "date_created": 1303745410.282325, "message": "I think when people say they made something in a day they mean to say it's a side project, not serious.", "group_id": 95, "id": 804353}, {"user_id": 30768, "stars": [], "topic_id": 21218, "date_created": 1303745421.2493, "message": "I don't think they're generally bragging", "group_id": 95, "id": 804355}, {"user_id": 30768, "stars": [], "topic_id": 21218, "date_created": 1303745481.4232759, "message": "It's not really something to brag about. If you make something big in one day you have a shit load of technical debt in the form of no comments, no tests, shitty infrastructure, etc", "group_id": 95, "id": 804365}, {"user_id": 30768, "stars": [], "topic_id": 21218, "date_created": 1303745491.455744, "message": "it just means 'prototype'", "group_id": 95, "id": 804367}, {"user_id": 3444, "stars": [], "topic_id": 21218, "date_created": 1303748041.4276471, "message": "@sequoia I agree. If I'm going to make something and submit it to HN, I sure as hell won't submit it after a day of work. I'm going to make sure its at least semi-ready for review (like in beta or something).\n\nThat being said, I have never submitted anything to HN, so I guess I should put my money where my mouth is one of these days...", "group_id": 95, "id": 804767}, {"user_id": 30354, "stars": [], "topic_id": 21218, "date_created": 1303750050.924984, "message": "I suppose it's also a defence mechanism - if something doesn't work, if it's not fully featured you can just say 'well, I built it in a day'. Who cares! I quite like seeing what people can accomplish in a short period of time. I don't see it as bragging.", "group_id": 95, "id": 805003}, {"user_id": 26065, "stars": [], "topic_id": 21218, "date_created": 1303752699.7432129, "message": "@apphacker In a lot of cases it means Minimal Viable Product, and accomplishing that in one day is an impressive feat. As far as I remember greplin.com was made in a day and that got them funded by sequoia (the real one :))", "group_id": 95, "id": 805333}, {"user_id": 14000, "stars": [], "topic_id": 21218, "date_created": 1303754891.018398, "message": "I added \"built in 1 day\" to my topic's title to let people know that if it feels unfinished, buggy, etc it's because we haven't spent that much time on it yet.", "group_id": 95, "id": 805638}, {"user_id": 20848, "stars": [], "topic_id": 21218, "date_created": 1303753803.31405, "message": "@martin_sunset I beg your pardon, \"the real one?\" http://i.imgur.com/GXIrF.png :p", "group_id": 95, "id": 805470}, {"user_id": 30768, "stars": [], "topic_id": 21218, "date_created": 1303754799.027252, "message": "I think my minimum development time for a Minimal Viable Product is like a month right now. :P", "group_id": 95, "id": 805626}, {"user_id": 26065, "stars": [], "topic_id": 21218, "date_created": 1303756266.4635019, "message": "@sequoia lol", "group_id": 95, "id": 805872}, {"user_id": 20848, "stars": [], "topic_id": 21218, "date_created": 1303756277.300741, "message": "@simonify I know I kind of implicitly singled you out by posting this on the same day as your post, I apologize for that. I think your web application is really cool and I 100% do not  mean to knock it or you.  People announce their work in this way all the time (which is why I chose to speak about it), it was just a fluke that I chose to complain about it today rather than some other. :)", "group_id": 95, "id": 805873}, {"user_id": 25716, "stars": [], "topic_id": 21218, "date_created": 1303758965.889467, "message": "I find it weird to mention that you have done it in XX days. I really couldn't care less, and when I see it I think that it is just people without much passion for that project.", "group_id": 95, "id": 806258}, {"user_id": 30715, "stars": [], "topic_id": 21218, "date_created": 1303761073.0358019, "message": "I do see some logic in getting early feedback on a incomplete (prototype) project to see if more time is warranted for spit and shine and devotion. It doesn't really bother me as long as the poster has something interesting or useful to share.", "group_id": 95, "id": 806548}, {"user_id": 27313, "stars": [], "topic_id": 21218, "date_created": 1303787356.8128419, "message": "I usually take the \"Weekend Project\" Or \"Done in a day\" posts to mean that the project is not really a big project and is something they did out of boredom or because they thought it would be interesting.", "group_id": 95, "id": 809586}, {"user_id": 27313, "stars": [], "topic_id": 21218, "date_created": 1303787366.741657, "message": "Not necessarily a big long term project", "group_id": 95, "id": 809589}, {"user_id": 13999, "stars": [], "topic_id": 21218, "date_created": 1303791100.50999, "message": "We built Prompt in one day as a challenge, it was really to show the world that you can build a pretty decent chat based on node.js in no time. Therefore the \"built in 1 day\" bit for Prompt was mostly about the achievement which was made possible by this rather new way to building a real-time chat.", "group_id": 95, "id": 810133}, {"user_id": 27823, "stars": [], "topic_id": 21218, "date_created": 1303803175.7924991, "message": "I'm about to post a Ask HN: Review type of posting for my new site UpOut.com... are people interested at all in the story? (aka in 1 day) or do they just want to review. From what I've seen esp. from the pagify post from a couple weeks ago.. it seems that context on how long it took to build etc. generates more traffic", "group_id": 95, "id": 811449}]