[{"user_id": 275, "stars": [], "topic_id": 43263, "date_created": 1312417761.8312161, "message": "I've been working on a new web app for about 4 months now. It's pretty functional, if in a very focused way. It's called Pushcode, and it's intended to be a path to continuous deployment for small dev/design shops.", "group_id": 4827, "id": 1789687}, {"user_id": 275, "stars": [], "topic_id": 43263, "date_created": 1312417780.0082719, "message": "I've done my share of design/development work - sites where I was designing and building everything and that seemed to have lots of changes and updates over time. When working on several of those at a time, I always ended up with stickies and Notepad docs describing how to push out changes to the sites, since I could never keep them in my head.", "group_id": 4827, "id": 1789691}, {"user_id": 275, "stars": [], "topic_id": 43263, "date_created": 1312417826.129844, "message": "There are limitations - this is a complex process we're talking about and I'm not trying to cover all the use cases yet. But what I have working is working pretty well, and I'm looking for some interested folks to take it for a test drive. Don't call it alpha, beta, or gamma. Call it willing victimhood, so don't try it on a production app yet. :-) I'll give you a login and walk you through setting your up your first app.", "group_id": 4827, "id": 1789697}, {"user_id": 275, "stars": [], "topic_id": 43263, "date_created": 1312417840.8223541, "message": "If you're interested, leave a comment here, or email me at steve@wallrazer.com and describe the project you'd like to take for a spin.", "group_id": 4827, "id": 1789699}, {"user_id": 275, "stars": [], "topic_id": 43263, "date_created": 1312417816.5233331, "message": "Pushcode is an app that may help. Create an application, configure your deployment environments, and from then on out it's a matter of committing your changes to VCS (you are using source control, right?), then logging into Pushcode and pushing a button.", "group_id": 4827, "id": 1789695}]