[{"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495562.406647, "message": "I agree. Security theater is the same thing. That's a combination of anti-foreign bias and pessimistic bias", "group_id": 10203, "id": 2076200}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495724.86022, "message": "you're definitely free to borrow my copy if you ever want to read it. It's a ~6 hour read or so", "group_id": 10203, "id": 2076223}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495243.6064301, "message": "@kyleshipley Easier for a conversation here than on twitter :) As far as make-work vs productivity, as far as I can tell there's never been a time when politicians campaigned on anything other than making jobs, protecting jobs or on implicitly improving jobs (chicken in every pot)", "group_id": 10203, "id": 2076165}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495357.202354, "message": "Yeah, good idea to move here.", "group_id": 10203, "id": 2076176}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495433.4475391, "message": "I agree with that, and I'm sure that every generation suggests that their generation is the tipping point for these sorts of things (factories, electricity, assembly line, cars, planes, computers, internet). Every leap is \"the\" leap that's going to cause a massive shift in the role of the workforce.", "group_id": 10203, "id": 2076180}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495376.5098231, "message": "The funny thing is that politicians as a group have *less* of a make-work bias compared to the average voter just because the average politician has a higher level of education", "group_id": 10203, "id": 2076179}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495457.703264, "message": "As much disdain I have for politicians as a group, I think the \"blame\" for such a horrible discourse around anything related to economics lies squarely on the average voter", "group_id": 10203, "id": 2076182}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495477.6621859, "message": "definitely. Every generation wants to be special :)", "group_id": 10203, "id": 2076187}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495542.877667, "message": "I would say that we get to see more of the sauage-making process wrt to politics and that probably has a real effect on the way it's perceived", "group_id": 10203, "id": 2076194}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495815.3568809, "message": "Sort of, but the main thesis is that voters behave very differently than people. With a person in the real world, if you hold wrong beliefs about how to do your job well, make money, have fun, hold relationships etc, you're punished for those beliefs. You have pretty direct feedback about whether or not you're correct. With voting though, there's absolutely 0 feedback or cost for holding an incorrect belief", "group_id": 10203, "id": 2076227}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496294.3645711, "message": "democracy is hard :)", "group_id": 10203, "id": 2076270}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495491.2220881, "message": "Regarding the make-work bias per social group -- I think we see the same thing in security theater", "group_id": 10203, "id": 2076189}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495718.797338, "message": "I'll have to check it out. (Although, as a title, you could likely replace \"Voter\" with \"X\" and still have a viable argument. :) )", "group_id": 10203, "id": 2076221}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495912.4306309, "message": "because the expected value of your individual vote (zero), the only actual benefit you get by voting is the way it makes you feel. That means that rational people don't necessarily vote in line with what policy is best (even if they knew) because they're not going to affect policy.", "group_id": 10203, "id": 2076238}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495881.2156799, "message": "So the argument is that it's effectively impossible to vote rationally?", "group_id": 10203, "id": 2076236}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496760.4859829, "message": "So, what's the Wes Winham economic recovery program? Do you think there needs to be one at all?", "group_id": 10203, "id": 2076321}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315495612.6423731, "message": "I agree with that as well. The challenge is that the goal of a politician is to get elected and not to drive the discourse in a productive direction. I think it fits in nicely with the concept of productivity and jobs not being equal.", "group_id": 10203, "id": 2076209}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496265.241343, "message": "The messed up thing is that more political autonomy actually leads to *better* economic policy than the opposite end of the spectrum in a democracy, which would be public vote on all issues. It's just a result of politicians being generally better-educated", "group_id": 10203, "id": 2076269}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496311.802839, "message": "That seems to be the argument in California at the moment, that an overly direct democracy has lead to a hodgepodge of unsustainable policies", "group_id": 10203, "id": 2076272}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495672.3249359, "message": "Probably my all-time favorite non-fiction book is based around that whole concept: http://en.wikipedia.org/wiki/The_Myth_of_the_Rational_Voter", "group_id": 10203, "id": 2076219}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315495976.0038719, "message": "So you get a situation where peoples' underlying emotional biases are the driving factor in what gets politicians elected and there's not only no rational debate about policies, that debate wouldn't even be helpful unless it changed someone's emotional reaction to an idea", "group_id": 10203, "id": 2076243}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496065.1918221, "message": "Here's the main question I've been pondering this morning: Is that a steady-state based on the psychology of humans, or is there action that could change the political climate into a productive and/or rational one?", "group_id": 10203, "id": 2076248}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496078.886441, "message": "If the latter, what is that action, and why aren't we taking it right now?", "group_id": 10203, "id": 2076250}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496096.4848211, "message": "a lot of smart people still base elections on the rational voter theory that people vote for the politician that supports the policies that make them most better off. The funny thing is that there is overwhelming evidence against that theory. For a wide range of policies, groups that stand to be harmed, or at least don't stand to benefit, support issues. Males are more pro-choice. The young are more defensive of social security etc.", "group_id": 10203, "id": 2076253}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496465.0172601, "message": "I just realized that I only read page 1 of a 3 page article", "group_id": 10203, "id": 2076284}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496474.500849, "message": "One sec :)", "group_id": 10203, "id": 2076286}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496146.1651809, "message": "I'd say the steady-state in a democracy depends on 1) culture 2) the amount of autonomy politicians have when making policy decisions", "group_id": 10203, "id": 2076260}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496190.1640389, "message": "Culture is big fuzzy thing of course. Mix of psychology, social norms, recent history, demographics etc", "group_id": 10203, "id": 2076261}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496508.8266029, "message": "Ah, nope, I lied. It was just divided differently after it left the front page, for whatever reason.", "group_id": 10203, "id": 2076291}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315496454.082221, "message": "Yup. It's kind of a sad thing when you come to the realization that the only thing worse than politicians making decisions is voters making decisions. At least politicians are loosely held accountable for their decisions", "group_id": 10203, "id": 2076283}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315496855.571413, "message": "I just want to get a sense of how you see a viable American job market progressing. What do the people who are currently unemployed or underemployed do with their lives? What do people outside of the best and brightest do in a world that's dominated by sophisticated technology?", "group_id": 10203, "id": 2076334}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315503775.114835, "message": "The world really isn't all that dominated by sophisticated technology. If you lump government, healthcare and education together, they're between 40 and 50% of economic activity, and they're very much not technologically-sophisticated sectors", "group_id": 10203, "id": 2076960}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315503695.171432, "message": "for the most part, people are unemployed and underemployed because they: 1) Don't want to move to find opportunities 2) Aren't willing to accept a lower wage 3) Don't need a job all that badly http://marginalrevolution.com/marginalrevolution/2011/08/more-rooftop-ready-results-on-reservation-wages.html", "group_id": 10203, "id": 2076952}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315503854.9149699, "message": "technology has been \"sophisticated\" from the perspective of whoever was alive since the industrial revolution and I don't see any reason that we're so different, other than the fact that my personal experience/bias wants me to believe this time is different", "group_id": 10203, "id": 2076962}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315503967.0225589, "message": "As a society, we've made a lot of trade-offs away from innovation and growth and towards equity and security. It would be odd to think that those don't actually matter. On the micro level, ask any economist and they can tell you a half-dozen things that we could easily do better from a public policy standpoint that 95%+ of other economists will agree with unanimously", "group_id": 10203, "id": 2076984}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315504010.087182, "message": "And the fact is, being unemployed in America, with a few exceptions, just isn't that bad, so why should we be surprised that individuals are more willing to tolerate it?", "group_id": 10203, "id": 2076988}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315505490.5886531, "message": "I just see more and more manufacturing jobs disappearing as they're replaced by robots/technology (regardless of the impact of outsourcing), and our entire infrastructure is built around variations on manufacturing", "group_id": 10203, "id": 2077236}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315504200.076139, "message": "Our currently-poor economic situation is a combination of real shocks (financial crisis of 08' and threat of a european debt crisis), the expected results of a bunch of policy trade-offs (slower growth), and regime uncertainty (http://www.independent.org/publications/tir/article.asp?a=430)", "group_id": 10203, "id": 2077025}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315505531.956109, "message": "I think that this time is slightly different in that information has eclipsed stuff in value, or is fast-approaching it, so the manufacturing mindset and economy has to disappear eventually, right?", "group_id": 10203, "id": 2077244}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315506255.774878, "message": "Not at all. I actually find the concept of services like TaskRabbit fascinating for exactly that reason.", "group_id": 10203, "id": 2077371}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315505423.5355749, "message": "Re: sophisticated technology -- I don't think we're there within the next few years or even our lifetime, but eventually we have to reach something resembling a technological singularity, right?", "group_id": 10203, "id": 2077216}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315505934.818326, "message": "If you can work part-time at a service job and make enough money to meet all of your material needs plus extra, is that a fundamentally bad thing if that's what you want?", "group_id": 10203, "id": 2077317}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315505965.8829601, "message": "it's not great for GDP or for employment stats, but it's a far cry from people starving or being useless", "group_id": 10203, "id": 2077323}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315505759.1677229, "message": "I'd say information has been more important than stuff for quite a while in 1st-world countries, maybe since compulsory education became the norm", "group_id": 10203, "id": 2077287}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315505858.6956799, "message": "As we get richer and richer, with the ability to manufacture Stuff more cheaply, it will only become less important, I'd agree. That's not a bad thing though, for jobs. Rich people consume more services and services are things that tech will have the hardest time replacing", "group_id": 10203, "id": 2077306}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315506431.1351609, "message": "Are there any particular blogs/resources that you follow on these sorts of issues that you might recommend?", "group_id": 10203, "id": 2077407}, {"user_id": 34450, "stars": [], "topic_id": 45028, "date_created": 1315506315.2289491, "message": "I think I'm punching above my weight in this conversation at this point (and maybe from the beginning), but it definitely gives me something to think about. I've just heard so many politicians (and some family/friends) making the argument that we need to bring manufacturing back from overseas by lowering the tax rates, and it just seems like a fruitless endeavor to me.", "group_id": 10203, "id": 2077384}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315510654.3847351, "message": "I'd say you're definitely correct that it's a fruitless endeavor. Some peoples' fascination with manufacturing is very strange to me. It's never been close to being the largest sector of our economy. Even more, we still manufacture more goods in value terms than any other nation in the world. Over double what China produces.", "group_id": 10203, "id": 2077959}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315510719.77337, "message": "I don't see why the same people that would rather work for Apple make the argument that we need more nameless manufacturing entities.", "group_id": 10203, "id": 2077971}, {"user_id": 21129, "stars": [], "topic_id": 45028, "date_created": 1315510780.3348711, "message": "I listen to the econtalk podcast and that's a really good source for general economic information and just interesting stuff. marginalrevolution.com is the blog I enjoy the most that discusses economics in general, but covers a wide range of stuff in an interesting way", "group_id": 10203, "id": 2077979}, {"user_id": 34455, "stars": [], "topic_id": 45028, "date_created": 1315941486.648257, "message": "broke down and bought the book Wes keeps talking about ;)", "group_id": 10203, "id": 2118754}, {"user_id": 34455, "stars": [], "topic_id": 45028, "date_created": 1315941503.2752359, "message": "btw, still not getting emails from Convore. Might respond to things you say in about a week to a month", "group_id": 10203, "id": 2118757}]