[{"user_id": 26395, "stars": [], "topic_id": 36136, "date_created": 1305908653.0878749, "message": "The text under issue is using the following computed style\nfont-family: Arial, sans-serif;\nfont-size: 48px;\nfont-style: normal;\nfont-variant: normal;\nfont-weight: normal;", "group_id": 97, "id": 1127494}, {"user_id": 26395, "stars": [], "topic_id": 36136, "date_created": 1305908546.310956, "message": "\nMy chrome sometime is giving me this weird font artifact on some website http://imageshack.us/photo/my-images/853/badfont.jpg/ is from http://mercurial.selenic.com/guide/", "group_id": 97, "id": 1127470}, {"user_id": 26395, "stars": [], "topic_id": 36136, "date_created": 1305908684.2924149, "message": "hopefully someone can suggest a solution before my eyes bleeds seeing these ugliness", "group_id": 97, "id": 1127500}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305911726.7542551, "message": "Get firefox problem solved thank you come again", "group_id": 97, "id": 1127987}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305946673.2204859, "message": "@amiamirul I'll actually give you a real response. Do you have GPU Accelerated Compositing enabled? I've heard a few people have problems with rendering after turning that on. If not, you may also want to say what platform you're running Chrome on, if you have any add-ons installed, etc.", "group_id": 97, "id": 1131987}, {"user_id": 26395, "stars": [{"date_created": 1305991488.005744, "user_id": 9108}], "topic_id": 36136, "date_created": 1305991277.90892, "message": "@JohnFail win7 64bit, ill try to turn the GPU Accelerated Canvas 2D and GPU Accelerated Compositing off and see if it works... at least there is someone sensible around here", "group_id": 97, "id": 1134494}, {"user_id": 3444, "stars": [], "topic_id": 36136, "date_created": 1305994921.7103441, "message": "@amiamirul don't worry about @italiano40, he's a dick.", "group_id": 97, "id": 1134895}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305996297.406348, "message": "@CrowderSoup dude your just mad because i proved you wrong and now your going to be a bitch about it and just come around call me a dick, real cool LOL obvious fail troll is obvious", "group_id": 97, "id": 1134999}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305996358.068954, "message": "@italiano40 I think it's hard to deny you weren't exactly helpful in this topic.", "group_id": 97, "id": 1135005}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305996547.1278789, "message": "@JohnFail no i was being funny in this topic take a joke, and second if i am going to prove someone wrong and they are going to be a little bitch about it then may they should leave the internet", "group_id": 97, "id": 1135024}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305996612.653466, "message": "@italiano40 \"Funny\" is pretty relative.", "group_id": 97, "id": 1135033}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305997239.0202651, "message": "@italiano40 It wasn't exactly complex, but whatever lets you sleep at night.", "group_id": 97, "id": 1135091}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305997375.7189469, "message": "@italiano40 Ah, so now I'm stupid. Got it. That's quite the ego you have.", "group_id": 97, "id": 1135100}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305996679.3813779, "message": "@JohnFail it was a joke build a bridge get over it", "group_id": 97, "id": 1135038}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305996734.4976101, "message": "@italiano40 Sure thing. You clearly are better at the Internet than I am. Good game.", "group_id": 97, "id": 1135042}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305997543.4808371, "message": "@JohnFail so first i am not funny now i am an egotist? i never said that you had to laugh or that was the funniest thing in the world, i just said it was funny to the rest of the people that read it ok WOW what jump you made but yea cool jump bra", "group_id": 97, "id": 1135116}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305996862.0029941, "message": "@JohnFail idk what your getting at? it was clearly a joke, you clearly didn't get it, i mean idk what else to say LMAO but ok", "group_id": 97, "id": 1135052}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305997215.5825911, "message": "@JohnFail or maybe you just don't get the joke?", "group_id": 97, "id": 1135085}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305997739.8827231, "message": "@JohnFail just tell me how i am an egotist?", "group_id": 97, "id": 1135144}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305996888.0735049, "message": "@italiano40 I'm saying that a lot of what you apparently think of as \"funny\" jokes just appear as trolling to everyone else because they're, you know, not funny.", "group_id": 97, "id": 1135054}, {"user_id": 4149, "stars": [], "topic_id": 36136, "date_created": 1305997327.6728289, "message": "@JohnFail for the rest of the world it wasn't but since you clearly didn't get it, it must be complex", "group_id": 97, "id": 1135094}, {"user_id": 9108, "stars": [], "topic_id": 36136, "date_created": 1305997684.033782, "message": "@italiano40 I'm not even going bother with a rebuttal; I'm just going to stop this nonsense now. I feel bad enough littering a topic where someone wanted help.", "group_id": 97, "id": 1135135}, {"user_id": 28472, "stars": [], "topic_id": 36136, "date_created": 1306031306.216058, "message": "@amiamirul I usually assume that issues like that will go away, and they usually do. Chrome dev goes so fast, problems aren't usually problems for long. Feel free to report back if disabling gpu font rendering helps.", "group_id": 97, "id": 1139348}, {"user_id": 20884, "stars": [], "topic_id": 36136, "date_created": 1306044031.725456, "message": "I think @JohnFail got it... If the problem persists, try http://dev.chromium.org/for-testers/bug-reporting-guidelines.\n(≈75% of all the messages here are unrelated to the question :P)", "group_id": 97, "id": 1140193}, {"user_id": 34718, "stars": [], "topic_id": 36136, "date_created": 1306886534.9104531, "message": "Man,those two hotheads need to cool it. We're talking about a flippin web browser, for pete's sake! You both made wrong choices in the wording of your comments and you both need to accept that.", "group_id": 97, "id": 1245017}, {"user_id": 17124, "stars": [], "topic_id": 36136, "date_created": 1309776933.1615269, "message": "I've never encountered such eye straining sight w/ my Mac, on any browser, But I remember seeing that kind of sight before when using a PC laptop and a bit more exotic OS. The reason was a faulty graphics card driver.\n\nAnother time when I saw really ugly fonts w/ the same machine was a case of missing fonts. It won't bother you as long as a website is using some generic font, or does not assign any particular font for the text (which would be the ideal solution).  And, is using valid html and css.\n\nI didn't bother to look into the source of that site, but I'd guess you either have a missing font or a bug in the browser. Or perhaps a broken browser. I watched that page with Safari, which is using the same Webkit engine, and the site looked just fine. They do seem to use at least two different fonts in their styles.\n\nAs a first aid thing, I'd try upgrading the Chrome browser first, or deleting and re-installing it from scratch, or trying that particular page with another browser.  You could also check if you've got a newer graphics driver to install, and that you don't happen to miss any basic fonts, for some unknown reason. Provided that you're using Windows.\n\nSorry if I repeated someone else's suggestions, because it's hard to concentrate on reading the thread all the way through with all that bickering.", "group_id": 97, "id": 1558911}]