[{"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299420191.299449, "message": "i'm a saaad panda :'(", "group_id": 5074, "id": 280138}, {"user_id": 14674, "stars": [], "topic_id": 11102, "date_created": 1299423903.710947, "message": "All being equal, Giz Wiz should be pulling in around $200k a year in advertising (my numbers, nothing official from TWiT) and i suspect they are not getting anywhere near as Leo mentioned. Moving to weekly would cut the downloads to a 1/5th of what it is now, but my question is - Will the ad costs go up enough to fix the problem? My biggest fear is no.", "group_id": 5074, "id": 280241}, {"user_id": 16859, "stars": [], "topic_id": 11102, "date_created": 1299425467.9987221, "message": "I didn't catch all of what he said about this subject, but it was something like \"people download but don't listen\" - what? How does he make that leap? People download, and listen to it all I would imagine - however I would also imagine most people don't go and click on sponsor links all the time.", "group_id": 5074, "id": 280354}, {"user_id": 17937, "stars": [{"date_created": 1299432624.0465, "user_id": 17097}], "topic_id": 11102, "date_created": 1299427055.453357, "message": "My only issue with Giz Whiz is the shows are so short, I think people prefeer the half hour format, No one wants to download over & over. I started out thinking he was so not my speed but that guy grows on you until you love him.", "group_id": 5074, "id": 280506}, {"user_id": 18095, "stars": [], "topic_id": 11102, "date_created": 1299427465.2326829, "message": "Sooo, itunes can be set to automatically download the shows and if you start with the oldest show they will play in order.  Maybe they should shorten the intro and outro to make the shows easier to listen to back to back but otherwise it works fine for me.", "group_id": 5074, "id": 280545}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299428843.926513, "message": "@HateBadDesign i would think that twit has a common conversion rate from all shows twit ran. and maybe gizwiz just sitting way below curve?", "group_id": 5074, "id": 280655}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299428955.276108, "message": "wonder why Leo don't just add amazon link with twit affiliate id to all the gadgets to help funding the gizwiz?", "group_id": 5074, "id": 280665}, {"user_id": 18393, "stars": [{"date_created": 1299433390.2254069, "user_id": 1}], "topic_id": 11102, "date_created": 1299432940.4003589, "message": "I like the idea. I usually don't download the dailies. I usually just watch the whole weeks taping live.", "group_id": 5074, "id": 281096}, {"user_id": 17097, "stars": [{"date_created": 1299433424.2392089, "user_id": 1}], "topic_id": 11102, "date_created": 1299433165.7820439, "message": "I think it's a 5 show weekly marathon that Leo is tired of running. With all his new responsibilities I also think he podcasts too much - for him, not me. I agree with richardya & mickduc that the segments/shows could to be longer, between intro/outros, at least. This could be done with a special edit of the daily shows to fit a weekly format, perhaps? But I listen/watch either way - short or long.", "group_id": 5074, "id": 281110}, {"user_id": 18623, "stars": [], "topic_id": 11102, "date_created": 1299432841.3201871, "message": "I'll miss the jingles!", "group_id": 5074, "id": 281087}, {"user_id": 19144, "stars": [], "topic_id": 11102, "date_created": 1299433098.8326709, "message": "Great idea @unwrangle", "group_id": 5074, "id": 281107}, {"user_id": 19123, "stars": [], "topic_id": 11102, "date_created": 1299433101.1857769, "message": "and i think that was the problems. His monetary plan hes comfortable with was not working with daily so to keep Dick, he needed to trim operating cost to weekly and it works both ways. They still record once a week, Dick gets the same amount, and Leo uses less resources ak. Money", "group_id": 5074, "id": 281108}, {"user_id": 17081, "stars": [], "topic_id": 11102, "date_created": 1299469377.7511621, "message": "I only caught the end of Dick and Leo talking about getting rid of the daily part of the giz wiz.  Are they still going to do 5 gadgets every week?", "group_id": 5074, "id": 283771}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299471416.3106589, "message": "and adding 1-2 mail to that, it's probably an hour-long show already...", "group_id": 5074, "id": 285047}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299471055.774919, "message": "@JamieGSnell at least 3... regular, turn the table, and warehouse...", "group_id": 5074, "id": 284860}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1299471562.117548, "message": "i fully understand the need to do weekly. tighter show, better conversion rate for ads, etc... still it's like end of an era :'(", "group_id": 5074, "id": 285050}, {"user_id": 17693, "stars": [], "topic_id": 11102, "date_created": 1299495659.488354, "message": "As a listener, my issue with The Daily Giz Wiz show was that it had (most of the times) as much ads as  a longer show, which is a bit weird and insane. It's like injecting 5x3=15 ads into TWiT, which is 1~2hours show.", "group_id": 5074, "id": 286919}, {"user_id": 18095, "stars": [], "topic_id": 11102, "date_created": 1299494455.375201, "message": "They always do the shows in one block and often talk about it, are you sure they weren't joking?", "group_id": 5074, "id": 286872}, {"user_id": 17693, "stars": [], "topic_id": 11102, "date_created": 1299495725.4531839, "message": "...so, I'm quite curious to see how many ad spots will it have now, as a weekly show.", "group_id": 5074, "id": 286922}, {"user_id": 17937, "stars": [], "topic_id": 11102, "date_created": 1299513000.622916, "message": "Remember, everyone watches podcasts in different ways. Some download on the fly, some watch on apple TV, some on youtube, download in your car, when they workout. If you consume TWiT, as I do, instead of regular programming, you want to sit and watch. You do not want to watch 10 minutes download, watch 10 minutes download, etc etc. Television arrived at the 1/2 hour and 1 hour format for a reason, studios are not complete morons. Dick is extremely talented, when Tom filled in for Leo he was amazed at how good DickB was. Viewers want to veg not constantly download. I understand some folks download automatically and string them together but my guess is that that is the minority. If they change it to a weekly it will be great.", "group_id": 5074, "id": 288414}, {"user_id": 17932, "stars": [], "topic_id": 11102, "date_created": 1299875790.3177991, "message": "@unwrangle I think they do sometimes, but they also like to link to the companies website.", "group_id": 5074, "id": 326755}, {"user_id": 17555, "stars": [], "topic_id": 11102, "date_created": 1300008520.9842639, "message": "I think Dick is a nice man but I just don't like the show!", "group_id": 5074, "id": 339753}, {"user_id": 18391, "stars": [], "topic_id": 11102, "date_created": 1300018606.6945119, "message": "I find it a shame that it's not daily anymore. But weekly is also good. It's easy to download and view it daily using the Miro app.", "group_id": 5074, "id": 340334}, {"user_id": 16862, "stars": [], "topic_id": 11102, "date_created": 1300024784.6493001, "message": "I love the GizWiz and so does Leo. Remember what happened to Ray Maxwell? Boy he is the smartest guy I ever heard talk on color science and photography. Then they asked him to do aeronautics and the show was canned. Why? No advertising! Why? cause Ray was asked to do Aeronautics. Leo said any show that did not pay its way was out. Maxwell's House and Munchcast are gone.  The GizWiz is not making money but Dick and Leo go way back and Leo does not want the show to fold, even though his financial people are pressuring him to do so.", "group_id": 5074, "id": 341038}, {"user_id": 17124, "stars": [], "topic_id": 11102, "date_created": 1300027771.855402, "message": "BTW, OT, but how do you make line breaks in Convore? -Haven't noticed a setting yet. Pressing the return will submit the message. Hrmh.", "group_id": 5074, "id": 341143}, {"user_id": 17124, "stars": [], "topic_id": 11102, "date_created": 1300027685.7543759, "message": "Yeap. I do understand the financial pressure, but it would be very sad if the programming decisions were based only on ad revenue. That would and will eventually lead to just one thing - mainstream mediocrity. There is a danger that soon there will be only one or a few boring shows, which are little or no different from a bunch of other shows on half a dozen other networks, with almost identical content. It's always the same, the 20% will make 80% of the revenue. But in the long run, diversity is good for you, and hopefully they will come up with some new subtle earning models to support the non-mainstream shows as well. Or, for example, perhaps Maxwell and Lisa should join forces and host the new photo show, or some less popular shows could appear only once a month, in longer, deeper exploring formats.", "group_id": 5074, "id": 341139}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1300029312.3513629, "message": "@iurus shift + return", "group_id": 5074, "id": 341255}, {"user_id": 15929, "stars": [], "topic_id": 11102, "date_created": 1300029375.5848949, "message": "actualyy gizwiz is making money... it's the advertisers who's not getting the ROI on their ads for the show", "group_id": 5074, "id": 341259}, {"user_id": 19160, "stars": [], "topic_id": 11102, "date_created": 1300036831.171247, "message": "@iurus Use shift return\nto move to the next line", "group_id": 5074, "id": 341732}, {"user_id": 17124, "stars": [], "topic_id": 11102, "date_created": 1300095395.3751161, "message": "Ooby-dooby... (shift+return)\nScooby-doo! Finally!\nThat was easy. Thanks for the tip guys.", "group_id": 5074, "id": 345715}, {"user_id": 16859, "stars": [], "topic_id": 11102, "date_created": 1300115912.2320659, "message": "Ok, now prove red is green and navigate a zebra crossing", "group_id": 5074, "id": 348159}, {"user_id": 17937, "stars": [], "topic_id": 11102, "date_created": 1301322743.760319, "message": "Is it just me or is the \"The Weekly Daily\" title a little disconcerting?", "group_id": 5074, "id": 458149}, {"user_id": 17991, "stars": [], "topic_id": 11102, "date_created": 1301324654.104481, "message": "@richardya yes and I think that's the point ;)", "group_id": 5074, "id": 458414}]