[{"user_id": 13194, "stars": [], "topic_id": 40803, "date_created": 1309465305.8043959, "message": "It looks awesome. I'm really impressed with the design work Google has put into it. That said, I'm only going on what I've seen via blogs, etc. Haven't actually used it yet.", "group_id": 250, "id": 1532202}, {"user_id": 4149, "stars": [], "topic_id": 40803, "date_created": 1309467291.6183591, "message": "*shut I am on my phone", "group_id": 250, "id": 1533007}, {"user_id": 4149, "stars": [], "topic_id": 40803, "date_created": 1309467275.9651661, "message": "They should down invites but only thing it has over Facebook is web cam hangout and real time updates but really not as good as it should be for a Facebook killer", "group_id": 250, "id": 1533003}, {"user_id": 12461, "stars": [], "topic_id": 40803, "date_created": 1309498600.711442, "message": "I got in. The design is beautiful and refreshing. I'm very impressed with it so far and I hope it catches on. Google+ is positioned extremely well to thrive alongside Facebook if they play their cards right. The web cam hangout is the least of it's advantages in my opinion.", "group_id": 250, "id": 1537764}, {"user_id": 28965, "stars": [], "topic_id": 40803, "date_created": 1309502545.8295901, "message": "I've been won, hooked to it. Not as a social media addict (since there's barely anyone on there yet…) but design-wise. There are little details everywhere, and the look is very refreshing as you've said.", "group_id": 250, "id": 1538013}, {"user_id": 24899, "stars": [], "topic_id": 40803, "date_created": 1309562870.5227621, "message": "I give it my approval :)", "group_id": 250, "id": 1546098}, {"user_id": 4149, "stars": [], "topic_id": 40803, "date_created": 1309564767.7078929, "message": "I don't know how you guys give it approval in less then a week of use? First off no one wants to put there friends into groups, Facebook list no one uses and it is pretty buggy so I am confused how it could be approved already", "group_id": 250, "id": 1546223}, {"user_id": 15929, "stars": [], "topic_id": 40803, "date_created": 1309580271.7622981, "message": "at this point, I don't use facebook, I have one, and only login whenever my friends IM or email me linking me to stuff within facebook. At this point, I know I'm not the target market for facebook. Now, if google manage to steal facebook's thunder and people start joining, I'm already logged to google ALL THE TIME, and I use google ALL THE TIME. So, why not?\n\nI'd worry more for twitter, atm I wish my G+ also tweets, if google's next few moves are done right, G+ could force twitter into Gbuzz :S", "group_id": 250, "id": 1546896}, {"user_id": 15929, "stars": [], "topic_id": 40803, "date_created": 1309579981.3132401, "message": "@italiano40 nothing wrong with calling things from the gut, sir. on the paper, you're right, it only has one or two things that facebook doesn't (yet) and facebook has plenty more over g+. but it's about something done right, it felt right.", "group_id": 250, "id": 1546886}, {"user_id": 8285, "stars": [], "topic_id": 40803, "date_created": 1309593130.8212681, "message": "@italiano40 I personally use Facebook groups, and I know a lot of people would too if the UI were simpler", "group_id": 250, "id": 1547340}, {"user_id": 7559, "stars": [], "topic_id": 40803, "date_created": 1309600422.822248, "message": "I think it'll dip into face book", "group_id": 250, "id": 1547527}, {"user_id": 7559, "stars": [], "topic_id": 40803, "date_created": 1309601007.4988279, "message": "Weird, anyway. I think it'll dip into facebook's user base a little. Facebook has likely peaked, for now, so Google could be lucky enough to catch some of Facebook's early adopters (like me) that have grown bored. I haven't used + but it looks like what Facebook would probably be like if Zuckerburg and Co. started over today.", "group_id": 250, "id": 1547532}, {"user_id": 23778, "stars": [], "topic_id": 40803, "date_created": 1309678296.8358381, "message": "Facebook has become bloated, starting to dip it's hands in too many areas. Google + so far just seems cleaner, at least for now.", "group_id": 250, "id": 1551188}, {"user_id": 12461, "stars": [], "topic_id": 40803, "date_created": 1309854141.1972749, "message": "Google+ Brand Page Concept http://www.seanpercival.com/blog/2011/07/04/google-brand-page-concept/", "group_id": 250, "id": 1565694}, {"user_id": 12461, "stars": [], "topic_id": 40803, "date_created": 1309854113.4930069, "message": "Getting brands on Google+ will be important. The brands are hungry to spend their marketing dollars on social campaigns. Their cheerleading will help fuel mass adoption in  my opinion.", "group_id": 250, "id": 1565690}, {"user_id": 31410, "stars": [], "topic_id": 40803, "date_created": 1310284155.9138229, "message": "I absolutely dig the circles. FB sucks in regards to segregating messages... Twitter even more so: NO MORE FIRE HOSE at SXSW coverage, etc.", "group_id": 250, "id": 1603543}, {"user_id": 16719, "stars": [], "topic_id": 40803, "date_created": 1310311785.6591189, "message": "I got invitation in G+ on the day of announcement. Till now the good part about G+ is it's all about tech ppl.. i am lovin it. Facebook broadcasts nonsense, twitter scatters nonsense, and G+ shows nonsense in threads in real time - addictive feature. You have control over whom to share with in G+ but not what to see in streams, would love to see it gets priority in next fixes..", "group_id": 250, "id": 1604863}, {"user_id": 37851, "stars": [], "topic_id": 40803, "date_created": 1310392213.893729, "message": "holbrookjr.. if you are still without an invite then let me know i can invite you", "group_id": 250, "id": 1612040}, {"user_id": 12461, "stars": [], "topic_id": 40803, "date_created": 1310449339.099329, "message": "@manisht79 Thanks. Fortunately I did get one!", "group_id": 250, "id": 1618123}, {"user_id": 37851, "stars": [], "topic_id": 40803, "date_created": 1310492966.3047709, "message": "no worries.. cheers mate", "group_id": 250, "id": 1621479}]