[{"user_id": 11626, "stars": [], "topic_id": 43866, "date_created": 1313478503.2551961, "message": "MARTIAL LAW MONDAY 8/15/11\r\n\r\nWelcome to the \"Martial Law Monday\" edition of SCMLA's News Digest!\r\n\r\n\r\nAs America’s Economy Collapses, “New Normal” Police State Takes Shape\r\nGlobal Research\r\nAugust 15, 2011\r\n\r\nForget your rights. As corporate overlords position themselves to seize what little remains of a tattered social net (adieu Medicare and Medicaid! Social Security? Au revoir!), the Obama administration is moving at break-neck speed to expand police state programs first stood-up by the Bush government. After all, with world share prices gyrating wildly, employment and wages in a death spiral, and retirement funds and publicly-owned assets swallowed whole by speculators and rentier scum, the state better dust-off contingency plans lest the Greek, Spanish or British “contagion” spread beyond the fabled shores of “old Europe” and infect God-fearin’ folk here in the heimat. Fear not, they have and the lyrically-titled Civil Disturbances: Emergency Employment of Army and Other Resources, otherwise known as Army Regulation 500-50, spells out the “responsibilities, policy, and guidance for the Department of the Army in planning and operations involving the use of Army resources in the control of actual or anticipated civil disturbances.”\r\nhttp://www.globalresearch.ca/index.php?context=va&aid=26021\r\n\r\nOfficial: BART justified in cutting cell phone service, may do it again\r\nCNN\r\nAugust 15, 2011\r\n\r\nThe threat of spreading protests prompted transit officials in San Francisco to successively close and reopen several key downtown subway stations on Monday... Meanwhile, an official with the system stood by the decision to shut off cell phone service ahead of a protest last week and did not rule out a similar move in response to the planned demonstration Monday. Linton Johnson, BART's chief communications officer, said officials may again suspend cell phone service on the station's platform level on Monday.\r\nhttp://www.cnn.com/2011/US/08/15/california.bart.protest\r\n\r\nCommuters turned away as protest closes 4 BART stations\r\nLA Times\r\nAugust 15, 2011\r\n\r\nRush-hour commuters in San Francisco were turned away from BART on Monday evening after authorities shut down four stations amid a protest over alleged brutality by transit agency police. A portion of busy Market Street was also shut down as crowds moved east, waving placards and shouting \"No Justice, No Peace!\" The protest began after 5 p.m. at the busy Civic Center Station, where crowds converged for a demonstration that was sparked, in part, by the shootings of Charles Blair Hill and Oscar Grant by BART police.\r\nhttp://latimesblogs.latimes.com/lanow/2011/08/bart-protest-san-francisco.html\r\n\r\nUS railway blocked phones to quash protest\r\nAl Jazeera\r\nAugust 13, 2011\r\n\r\nA rail transit provider in the United States disabled mobile phone services to prevent a planned protest on Thursday, attracting criticism and unflattering comparisons to crackdowns on dissent in the Middle East. Demonstrators in northern California's Bay Area had planned a protest to condemn the shooting death of Charles Hill, who was killed on July 3 after Bay Area Rapid Transit (BART) police officers responded to complaints about a drunk man at a station in the city of San Francisco. Hill was fatally shot in the torso and protesters responded eight days later with a demonstration that shut down three San Francisco BART stations.\r\nhttp://english.aljazeera.net/news/americas/2011/08/201181221139693608.html\r\n\r\nFBI wants businesses watching for customers paying with cash\r\nWorld Net Daily\r\nAugust 12, 2011\r\n\r\nDays after the White House announced a community-based approach to combating terrorism in the United States, the FBI and other agencies are asking managers of surplus stores to spy on their customers, watching whether they pay in cash, make \"extreme\" religious statements or purchase products such as waterproof matches. The request from the government also is going to gun shops, fertilizer suppliers, motels and hotels, authorities say.\r\nhttp://www.wnd.com/?pageId=332925\r\n\r\nNYPD forms new social media unit to mine Facebook and Twitter for mayhem\r\nNew York Daily News\r\nAugust 12, 2011\r\n\r\nThe NYPD has formed a new unit to track troublemakers who announce plans or brag about their crimes on Twitter, MySpace and Facebook. Newly named Assistant Commissioner Kevin O'Connor, one of the department's online and gang gurus, has been put in charge of the new juvenile justice unit. He and his staff will mine social media, looking for info about troublesome house parties, gang showdowns and other potential mayhem, sources said. London rioters have been using Twitter and BlackBerry messages to choose targets for looting or burning - and to alert one another about police positions.\r\nhttp://www.nydailynews.com/ny_local/2011/08/10/2011-08-10_nypd_forms_new_social_media_unit_to_mine_facebook_and_twitter_for_mayhem.html\r\n\r\nUK planning draconian powers to shut phone messaging and social networks in times of civil disorder\r\nCitizens For Legitmate Government\r\nAugust 12, 2011\r\n\r\nMinisters and the security services are planning draconian powers to shut down or disrupt mobile phone messaging services and social networks in times of civil disorder. Downing Street sources said they were considering the \"moral and technical\" questions of how to grant new powers blocking all mobile communications to prevent rioters organising through websites such as Twitter and the BlackBerry Messenger service. Mr Cameron, promising yesterday to do \"whatever it takes\" to restore order, outlined a series of new security measures, which included: Consider further powers of curfew. Investigate using the Army to free up police for \"frontline\" duties. Give individual police officers the power to force people to remove scarves, hoods or masks covering their faces or be arrested... The Government will also consult former New York Police commissioner Bill Bratton on further measures to tackle gang culture.\r\nhttp://www.legitgov.org/UK-planning-draconian-powers-shut-phone-messaging-and-social-networks-times-civil-disorder\r\n\r\nEngland riots: 24-hour criminal justice system after riots\r\nBBC\r\nAugust 11, 2011\r\n\r\nSeveral courts in England will stay open 24 hours a day to fast-track those already in custody for looting and disorder-related offences. Magistrates in London, Manchester and Solihull were processing some of those arrested over riot-related incidents. An 11-year-old girl and a primary school worker have already appeared in court. David Cameron said courts would continue to sit through the night. The total number of people arrested over the riots stands at more than 1,500.\r\nhttp://www.bbc.co.uk/news/uk-england-14487636\r\n\r\nKnee Jerk Calls For Army On London Streets To “Shoot Looters On Sight”\r\nOne in three want live ammunition used on rioters\r\nInfowars.com\r\nAugust 10, 2011\r\n\r\nThe riots in London and now elsewhere in the UK are being used by some as an excuse to call for a full on police state crackdown complete with curfews, martial law and the army roaming the streets killing people. The most despicable of these drooling nonsensical knee jerk calls comes from Conservative MEP Roger Helmer, who suggested via his twitter account yesterday that it was “Time to get tough. Bring in the Army. Shoot looters and arsonists on sight.” When other twitter users and reporters called Helmer out on his comments, he tweeted “Let’s try water cannon/plastic rounds first. But if the police lose control completely, tougher measures are called for.” Thankfully, the British government has so far dismissed such calls, with the Conservative party declaring “We totally dissociate ourselves from these comments.” After initially suggesting that the option of using the army was being considered, U.K. Home Secretary Theresa May later announced that the government would not take such extreme measures, with legal experts suggesting armed forces on the streets should be a last resort. The rush to eviscerate freedom completely in the UK hasn’t ended there, however. Several other Tory MPs repeated the same ill considered calls for martial law.\r\nhttp://www.infowars.com/knee-jerk-calls-for-army-on-london-streets-to-shoot-looters-on-sight\r\n\r\nCorporate Media Puzzled by U.S. Martial Law Plans in Wake of Brit Riots\r\nInfowars.com\r\nAugust 10, 2011\r\n\r\nBack in late 2010, the Army Corps of Engineers inadvertently posted information about Northcom’s CONPLAN 3502, included within information about a FEMA-simulated earthquake drill called National Level Exercise 2011. The documents reveal how a secret Pentagon Civil Disturbance Operations plan calls for military-operated detention and search operations within the United States. It is mentioned in a Defense Support of Civil Authorities (DSCA) Handbook that was prepared by the Army’s Joint Test and Evaluation Command. It was also mentioned by General Victor E. Renuart, Northcom commander, in testimony before the House Armed Services Committee’s subcommittee on Terrorism and Unconventional Threats and Capabilities on March 5, 2008. More information can be found here. IndyMedia provided extrensive coverage, not that the New York Times or the Washington Post noticed. The establishment press was uniformly silent. CONPLAN 3502 surfaced again this week as the Brits scrambled to confront riots sweeping their country.\r\nhttp://www.infowars.com/corporate-media-puzzled-by-u-s-martial-law-plans-in-wake-of-brit-riots\r\n\r\nDHS Proposes Secret Watchlist Database\r\nDaily Tech\r\nAugust 10, 2011\r\n\r\nThe Department of Homeland Security is planning to duplicate the FBI's Terrorist Screening Database to expand an extensive database called Watchlist Service -- and no one can know if they're on the list. According to recent reports, Watchlist Service will include names, birthdays, photos and biometrics of the accused. The new watchlist will combine four different DHS systems of records including IDENT, which is managed by the US-VISIT Program; Treasury Enforcement Communication System (TECS), which is managed by Custom and Border Protection (CBP) Passenger Systems Program Office; Transportation Security Threat Assessment System managed by the Transportation Security Administration (TSA), and the TSA's Secure Flight Records.\r\nhttp://www.dailytech.com/DHS+Proposes+Secret+Watchlist+Database+Privacy+Groups+Protest/article22406.htm\r\n\r\nVideo of Mexican Military Helicopters Flying Over Laredo, Texas\r\nDeadline Live\r\nAugust 9, 2011\r\n\r\nIn this video clip, a Mexican military helicopter can be seen flying over the Laredo International Bridge. A second helicopter can be seen flying over a neighborhood in Laredo, Texas. These maneuvers were allegedly part of a Mexican military operation known as ‘Lince Norte’ (Northern Lynx), in which the military killed over 30 members of Los Zetas, including the local leader and ‘accountant’ Jorge de la Peña, aka. ‘El Pompín.’  Last Saturday, one of these helicopters landed at the Laredo International Airport (on the Texas side of the border).\r\nhttp://deadlinelive.info/2011/08/09/video-of-mexican-military-helicopters-flying-over-laredo-texas\r\n\r\nUK Riots: Government Prepares Troops, Martial Law\r\nInfowars.com\r\nAugust 9, 2011\r\n\r\nFollowing numerous reports of failures on behalf of police to arrest looters or adequately respond to the riots in London that are now sweeping across the entire UK, curfews and troops on the streets are now being readied as authorities prepare to enforce martial law to quell massive civil unrest. BBC News twice reported this morning that troops were being readied. The statement was first made by a reporter at 8:30am and then repeated by a Metropolitan Police representative who said “all options were on the table”. U.K. Home Secretary Theresa May confirms that the government is considering “military support for the police”. Curfews are also being discussed as authorities prepare to transform Britain into a locked down police state. “Armoured vehicles have been brought in to clear the streets for the first time by police to tackle what senior officers say is the worst rioting and looting in living memory,” reports the Guardian. “I have not heard of a curfew on mainland Britain in the past century. [It's] very difficult to impose. I’m not saying that it is definitely the way forward but it is something we have to consider,” Diane Abbott, Labour MP for Hackney North and Stoke Newington told BBC Breakfast. Former London mayor Ken Livingstone called for police to use water cannons to disperse the rioters. Having started in poorer areas of London, the riots have now spread to other major cities including Bristol, Nottingham, Liverpool and Manchester. There can be little doubt that the vast majority of the rioters are products of the country’s broken society, nihilistic youths who care little about political grievances and are primarily focused with exploiting the chaos to steal as much booty as they possibly can while getting off on mindless violence. This behavior ensures the public will overwhelmingly support whatever measures are proposed to deal with them, even to the point of outright martial law.\r\nhttp://www.infowars.com/uk-riots-government-prepares-troops-martial-law\r\n\r\nUK Prime Minister addresses nation as police lose control of parts of capital   \r\nBig News Network\r\nAugust 9, 2011\r\n  \r\nThe contagion of violence in London is spreading to other parts of the UK's capital and major cities, with the British Prime Minister returning to the country to chair an emergency meeting. Prime Minister David Cameron addressed the British public Tuesday morning after a third night of anarchy in parts of London. The Prime Minister announced that extra police officers would be drafted into London from other cities, boosting the capital's manpower from 6,000 Monday night to 16,000 Tuesday. The Prime Minister was forced to cut short a holiday in Itlay due to the crisis and announced in his statement that he would recall the British parliament on Thursday. In addition, David Cameron said that court proceedings against those arrested would be sped up and that all rioters and looters would be charged no matter their age. \"If you are old enough to commit these offences, you are old enough to face the punishment,\" the Prime Minister said Tuesday. The British capital woke up to scenes of destruction and disorder Tuesday following a night of intense clashes with police and widespread rioting and looting. The over-riding description of the violence by residents has been that it feels like a warzone. They spent the night taking shelter in their homes as anarchy took hold of parts of London. \r\nhttp://feeds.bignewsnetwork.com/?sid=823489\r\n\r\nUS Government Monitoring Facebook For Federal Reserve Protests As Economy Continues To Collapse\r\nThe Intel Hub\r\nAugust 9, 2011\r\n\r\nDanny Panzella, an activist and independent journalist, has revealed that the U.S. government and local police are monitoring Facebook for Federal Reserve protests. On June 22nd, 2011 , the night before the rally, Danny announced a spur of the moment End the Fed Rally/Flash Mob on Facebook. When he arrived in the morning close to 40 police officers were waiting for him. This is clear evidence that the government is actively monitoring Facebook for signs of activism directed against the private Federal Reserve. As our economy teeters on the verge of collapse, our government and local law enforcement are spending time and most likely tax power dollars to protect the private banking cartel that created the crisis in the first place! As the White House attempts to blame the Tea Party for the problems with the economy, the real culprits are being protected by police nationwide. The private Federal Reserve, in conjunction with multiple multinational corporations and governments, have destroyed the U.S. economy be design.\r\nhttp://theintelhub.com/2011/08/09/us-government-monitoring-facebook-for-federal-reserve-protests-as-economy-continues-to-collapse", "group_id": 3920, "id": 1881817}]