[{"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298484175.824846, "message": "The mix is a little off. One-take episodes are fine, but fire up audacity and make sure the sound is all level. The intro, and especially the outro music of episode 1 was far louder than the rest of the episode.", "group_id": 3435, "id": 189325}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298485230.2780931, "message": "@haz Cool, thanks for the tip.  I am new to audacity myself.  I'll try to fix this for next episode.  I am assuming there is some sort of equalize function.  Do you happen to know the option specifically?", "group_id": 3435, "id": 189498}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298493559.3273799, "message": "I haven't gone through this, but it may help: http://www.how-to-podcast-tutorial.com/17-audacity-tutorial.htm", "group_id": 3435, "id": 190869}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298493546.8336229, "message": "Audacity has tons of functions. What you'll want to do is boost the mid section (i.e. the discussion) so that it is at the same level as the music. If you have just the discussion section, normalize it before adding the music (the setting is under Effect -> Normalize).", "group_id": 3435, "id": 190866}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298500468.1247101, "message": "Awesome, thanks for the link @haz.  I'll be sure to play around with this for the next episode.", "group_id": 3435, "id": 192233}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298570167.1408291, "message": "From Aahz on the diversity@python.org list: \n\n\"Very nice!  Putting on my curmudgeon hat, what are your plans for making\ntranscripts available?  I'm hearing-impaired myself, but plenty of people\nwith normal hearing need transcripts (e.g. people with English as a\nsecond language).\"", "group_id": 3435, "id": 199571}, {"user_id": 11590, "stars": [], "topic_id": 8386, "date_created": 1298595079.4307909, "message": "Anthony - I think you're a good host, and you're good at keeping the conversation moving in the direction you want it to. When you introduce people and they say \"Hi Anthony\", you don't need to say \"Hi\" back. Just keep it moving. (I noticed you did this less on episode 1 than episode 0). Otherwise, so far so good.", "group_id": 3435, "id": 204573}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298597645.4188769, "message": "@SeanKnudsen Hah!  Wouldn't have even thought of it.  Thanks for pointing this out.  I'll keep it in mind for next time.", "group_id": 3435, "id": 204849}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298646715.9077229, "message": "Also with the Audacity work you do, it is common practice in podcast post-editing to cut out silent sections. They come up often when it's unclear who speaks next, or there is lag with the discussion software (Skype, etc).", "group_id": 3435, "id": 208450}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298651104.4265261, "message": "Fair 'nough. Just don't get phased by the fact you can't get rid of /all/ the silence points -- any podcast that comes across like that is likely editing out the cruft.", "group_id": 3435, "id": 209234}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298650703.6649809, "message": "@haz That is something I *really* don't have time for.  The format document states that it is a 'one-take' kind of show.  I feel like this is something that can be improved with better moderation.  It is supposed to feel like a conversation, so the 0.5 sec here and there that slip by I think is acceptable and adds to the ambiance.  \n\nOf course, if we had money to pay an sound editor....", "group_id": 3435, "id": 209129}, {"user_id": 14878, "stars": [], "topic_id": 8386, "date_created": 1298744724.523819, "message": "Poor Anthony, I agree he doesn't have to take care of little silent moments thoughout the podcast. Actually it would be fun to write a little python code that does that automatically...", "group_id": 3435, "id": 215188}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298836288.2556889, "message": "@jonathanrocher I'll get right on that in my copious free time ;)", "group_id": 3435, "id": 220224}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1298906063.4705091, "message": "A script like that would be marvelous -- that and removing snaps / pops that prevents you from normalizing the audio. I've spent way too many hours doing those two tasks :p.", "group_id": 3435, "id": 226120}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1298940242.03037, "message": "@haz You write it, I'll use it =)", "group_id": 3435, "id": 230586}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1299001319.8715799, "message": "Heh, touche. Let me finish my degree first, then I'll put some cycles towards my audio engineering en-devours ;).", "group_id": 3435, "id": 236408}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1299653331.0287409, "message": "@haz OK, now I agree with you.  Someone should go through the episode and remove some of the dead space.  Do you know any high-school aged audio-editors who work for cheap?", "group_id": 3435, "id": 302374}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1299698818.252315, "message": "Hehe. Not off the top of my head. We can do it for $20/episode if you want (partner and I do studio stuff on the weekend).", "group_id": 3435, "id": 307631}, {"user_id": 11246, "stars": [], "topic_id": 8386, "date_created": 1299737555.8109319, "message": "new show format requirement: a scopz-level pun in the title!", "group_id": 3435, "id": 311339}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1299738718.674, "message": "@spidr Hah! And what?  Drive off all of our listeners ~_~?  I'll try to limit it to one pun a month.  You know what they say, \"With great power comes great work or very short time scales...\"", "group_id": 3435, "id": 311424}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1299738580.3595281, "message": "@haz Hmmm I am strongly considering this...  Let me ask around about a budget ;)", "group_id": 3435, "id": 311416}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1299770458.217772, "message": "@scopatz That's at a projected 1h / episode. We could charge by the minute if you'd like and just bill when it hits 5 hours (I assume we'll get faster at podcast cleanup after doing it a few times).", "group_id": 3435, "id": 314147}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1299776297.6562719, "message": "@haz  I see, interesting.  What is the turn around?  Do you only work on the weekends?", "group_id": 3435, "id": 314788}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1299776467.8358171, "message": "At the moment it's the only guarantee I can make (weeknights are littered with random constraints / reoccurring commitments). I've known some podcasts (that don't do news updates of some sort) to pre-record a backlog. If you do that, then the time of week wouldn't really make much of a difference...or at least record every podcast 2 weeks in advance or something.", "group_id": 3435, "id": 314807}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1300346991.6405599, "message": "Hey @haz, can you check out episode 4.  I went over it with a fine tooth comb this time.  Do you think it makes a difference?", "group_id": 3435, "id": 372080}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1300358663.6993899, "message": "Queued up for the walk in today -- I'll let you know.", "group_id": 3435, "id": 372878}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1300372980.7499981, "message": "@scopatz Nailed it ;). The levels were great, the silences were non-existent, and the rhythm of the entire show was /awesome/ (hehe). Geraldine was a little quite (are you recording each guest separately?).\n\nThe one suggestion I would have is looking into a better mic (especially for you the host). Your feed seems to be capping out most of the conversation (distorts your voice), and it should only be able to cap out if you really scream (maybe you have the gain on something set too high?). A new mic shouldn't set you back that much (~$50 can get you something fairly decent), but would make a huge difference.", "group_id": 3435, "id": 374512}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1300385123.8813081, "message": "Thanks @haz!  Ok I'll try to stick to this methodology from now on.  Thanks for all of the feedback.  You have been QTile ~_~.\n\nI agree about the mic issue.  Unfortunately, we are not recording each guest on their own separate track, since this is over skype.  I want to figure out is some way to tap into a phone line, or tap skype into a phone line.  Basically, I want to build a little studio at the Enthought office....  Any pointers on this?", "group_id": 3435, "id": 376107}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1300457510.4273391, "message": "Hrmz...not too sure about how to bring in the best audio -- in general the guests are presumed to be calling in and the audio for that is fine. But psychologically it makes a big difference for the host. I would suggest having a decent mic purchased for the Enthought office, and recording your voice separate. Having a host with clear sounding audio ties the thing together (for example, any of the Twit podcasts that Leo Laporte hosts).", "group_id": 3435, "id": 382192}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1300904379.7063351, "message": "Just listened to #5. I could hear the break edits a little more this week, but maybe that's just because I'm listening for them ;). What microphone are you using? I'm starting to think that maybe it isn't capping out, but just a really low quality one for picking up human voice. A $20-$50 purchase would make all the difference.", "group_id": 3435, "id": 419436}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1300909357.408695, "message": "@haz Agreed, I know what you mean about the break edits.  I am going to blame my poor editing skills on being sick and working on it at 2 am this week ;).  There were a couple that were particularly heinous.  And then there were a couple that sounded really bad that were what people *actually* said, but I couldn't figure out a way to edit around!\n\nI am still using the mic that comes standard on the macbook pro.  I haven't had time to really pursue solutions in the last week.  One idea I am intrigued by is just recording a phone line.  Do you know what kind of hardware I'd need for that?", "group_id": 3435, "id": 420108}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1300996162.4680791, "message": "Any phone that has the right jack I would assume. If it you find one with an eighth inch jack (like the chord on any set of headphones), then you can buy a cheap male-male eighth inch wire and plug it right into you computer's mic port.", "group_id": 3435, "id": 430325}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1301018299.4258051, "message": "@haz Cool.  I think we have a couple of those lying around the office.", "group_id": 3435, "id": 433924}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1301062848.682797, "message": "Right on -- so this is for someone calling in, right? I'd still suggest finding a reasonable mic that has an 8th inch jack (or usb) for the enthought office. You guys do screencasts and stuff too if I remember correctly -- it would be worth the investment for sure.", "group_id": 3435, "id": 438733}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1301070138.057354, "message": "Yeah, it totally would.  Getting a mic is on the \"to do\" list.", "group_id": 3435, "id": 439839}, {"user_id": 10611, "stars": [], "topic_id": 8386, "date_created": 1301670849.7056689, "message": "Re: Episode 6. Rhythm is great, and I love the in/out music you chose ;). The only thing I would warn against is changing the context of the discussion by removing silence spots:\n- \"Anyone else have thoughts on <foo>?\"\n- \"So  lets move on...\"\n\n  Those two statements appeared far too close to one another, and it makes it seem like you didn't want them to say anything. I'd suggest either leaving (some of) the silence in, or cutting out those statements altogether if noone does have any further thoughts.", "group_id": 3435, "id": 502487}, {"user_id": 10411, "stars": [], "topic_id": 8386, "date_created": 1301680088.6288171, "message": "@haz Yup, you are right again.  I tried to remove redundant statements like that, but clearly I missed some =/  Thanks!", "group_id": 3435, "id": 503870}]