[{"user_id": 11626, "stars": [], "topic_id": 7366, "date_created": 1298072675.804637, "message": "http://www.seattlepi.com/dayart/aponline/54489.21APTOPIX-Wisconsin-Budget-Unions.sff.jpg\r\n\r\nMADISON, Wis. -- Wisconsin's Gov. Scott Walker has called on Democrats who fled the state to block a vote on an anti-union bill to \"come home.\"\r\n\r\nSenate Democrats left town on Thursday to stop Republicans who control the chamber from taking a vote on Walker's proposal that would take away collective bargaining rights from public employees.\r\n\r\nWalker told reporters on Friday that the Senate Democrats should come back to the Capitol and stop hiding out.\r\n\r\nThe GOP governor has said that he is not trying to rush things. He told The Associated Press on Friday that he's prepared for the stalemate to drag on into next week.\r\n\r\nTHIS IS A BREAKING NEWS UPDATE. AP's earlier story is below.\r\n\r\nDemocrats on the run in Wisconsin avoided state troopers Friday and threatened to stay in hiding for weeks, potentially paralyzing the state government in a standoff with majority Republicans over union rights for public employees.\r\n\r\nThe party's battle against balancing the state budget by cutting the pay, benefits and collective bargaining rights of public workers is the boldest action yet by Democrats to push back against last fall's GOP wave.\r\n\r\nBut the dramatic strategy that has clogged the Capitol with thousands of protesters clashes with one essential truth: Republicans told everyone months ago that unions would be one of their targets, and the GOP now has more than enough votes to pass its plans once the Legislature can convene.\r\n\r\nThe 14 Senate Democrats left the state Thursday, delaying action in that chamber on the sweeping bill. Among them was Sen. Jon Erpenbach, who said Friday that the group was prepared to be away for weeks, although he would prefer to end the stalemate sooner.\r\n\r\n\"That really, truly is up to the governor,\" he told The Associated Press in an interview Friday at a downtown Chicago hotel. \"It's his responsibility to bring the state together. The state is not unified. It is totally torn part.\"\r\n\r\nMeanwhile, protests at the state Capitol entered a fourth day and continued to grow - to an estimated 40,000 people, the largest crowd yet. Many schools were closed again after teachers called in sick, including the state's largest district, in Milwaukee.\r\n\r\nAnd neither protesters, Democrats or the GOP appeared ready to make any accommodations for the other side.\r\n\r\nDemonstrators vowed to stay as long as necessary to get concessions. New Republican Gov. Scot Walker rebuffed requests to sit down with Democrats to seek a compromise.\r\n\r\nErpenbach (URP'-ehn-bahk) accused Walker of trying to rush the legislation, which was publicly unveiled only a week ago.\r\n\r\n\"I'm not calling him a dictator. But this is dictatorial almost,\" Erpenbach said. \"I don't think I've ever seen such a draconian piece of legislation come down from any governor, Democrat or Republican.\"\r\n\r\nRepublicans had warned since last year's campaign that they would seek major concessions from unions. But for lawmakers in the minority, \"The only other option we had to slow things down was to leave.\"\r\n\r\nErpenbach said the decision to flee happened on the spur of the moment as Democrats gathered near the Capitol for a regular strategy meeting Thursday morning.\r\n\r\nAn hour later, he threw a few travel essentials - a toothbrush, razor and few changes of clothes - into a duffel bag and a backpack. He took just two or three minutes to pack, and jumped in a car for a prearranged meeting at a hotel in Rockford, Ill., just south of the Wisconsin border.\r\n\r\nThe lawmakers were concerned that police could have detained them, even though the Wisconsin Constitution prohibits the arrest of state lawmakers while the Legislature is in session, except in cases of felonies, breaches of the peace or treason.\r\n\r\n\"We knew their jurisdiction ends at the state line, and that's why we came to Illinois,\" Erpenbach said.\r\n\r\nFrom Rockford, the legislators headed in different directions, most of them traveling to the Chicago area or to other parts of northern Illinois, Erpenbach said.\r\n\r\nSince leaving Wisconsin, he said he had not spoken to any of his Republican counterparts.\r\n\r\nThe 14 Democrats planned to meet later Friday somewhere in Illinois to discuss strategy.\r\n\r\n\"We just need some time to sit down and talk, figure out where we are at and what we are hearing form our constituents, and what we're hearing form the Republicans,\" Erpenbach said.\r\n\r\nAlso Friday, the leader of the state's largest public employee union said workers were willing to make financial concessions but not to give up bargaining rights.\r\n\r\nMarty Beil, executive director of the Wisconsin State Employees Union, issued a statement saying the protests would continue until Walker sits down with the unions.\r\n\r\nIn a sign that the commotion might be causing other problems for the governor, he pushed back the release of his two-year budget plan by one week, to March 1.\r\n\r\nThe governor insists the concessions he is seeking from public workers - including higher health insurance and pension contributions - are necessary to deal with the state's projected $3.6 billion budget shortfall and to avoid layoffs.\r\n\r\nEliminating their collective bargaining rights, except over wage increases not greater than the Consumer Price Index, is necessary in order to give the state and local governments and schools the flexibility needed to deal with upcoming cuts in state aid, Walker said.\r\n\r\nThose arguments don't wash with Democrats who say the fight is really about political power and quashing the unions, whose members are longtime supporters of Democrats.\r\n\r\nRepublican Senate Majority Leader Scott Fitzgerald said he spoke with Democratic Minority Leader Mark Miller by phone late Thursday and asked him to bring his caucus back to Madison, but Miller refused.\r\n\r\nBy Friday morning, Fitzgerald was tired of waiting. With the governor's approval, he asked the state patrol to go to Miller's house in a Madison suburb.\r\n\r\nFitzgerald said he hoped a visit from the police would send a signal about the circumstances at the Capitol. Troopers knocked on Miller's door and rang his doorbell, but no one answered.\r\n\r\nThe protests are growing so large that Capitol workers cannot safely move through the halls, Fitzgerald said, calling the situation \"a powder keg.\" The situation was expected to ratchet up on Saturday, when conservative tea party groups planned their own rallies.\r\n\r\nRepublican support for the bill remains strong, he added. \"If anything, what's going on around this building is galvanizing this caucus,\" Fitzgerald said.\r\n\r\nThe Wisconsin walkout was similar to a 2003 move by Texas Democrats who were outnumbered by Republicans in a battle over congressional redistricting. The group got on a bus and fled for the Oklahoma border.\r\n\r\nWork in the Texas House was halted for a week, and GOP leaders asked state troopers to find and arrest the 52 absent lawmakers. It was the beginning of a bitter partisan confrontation that dragged on for months. Later that summer, a group of Senate Democrats fled to Albuquerque, N.M., for more than a month.\r\n\r\nIn the end, the walkouts only delayed the redistricting plan, which eventually passed and helped give the GOP more seats in Congress.\r\n\r\nStill, organizers of the walkout say it was worth it.\r\n\r\n\"It was the toughest thing I've ever done politically,\" said Sen. Leticia Van De Putte, chairwoman of the Democratic caucus in the Texas Senate. \"It was not something we wanted to do. It was the last thing we could do to protect minority voting rights.\"\r\n\r\nBack in Madison, some Democrats from the state Assembly went to Walker's office to demand a meeting. Walker's spokesman said the governor's scheduler would get back to them.\r\n\r\nThe Assembly speaker said the chamber could vote on the bill later Friday, but it was not clear whether the GOP would attempt to proceed without Democrats, who were in a closed caucus meeting.\r\n\r\nMinority Leader Peter Barca said he expected a \"long, protracted debate\" over their strategy.\r\n\r\nRepublicans hold a 57-38 majority in the Assembly, but they need 58 lawmakers present to take up the bill. That puts the lone independent, Rep. Bob Ziegelbauer, in a powerful position.\r\n\r\nZiegelbauer said he would show up, but hoped to convince Republican leaders to first make changes to the collective bargaining parts of the bill.\r\n\r\nDemocratic strategist Chris Lehane called the walkout in Madison the boldest action Democrats have taken since midterm elections swept Republican to power in statehouses across the country.\r\n\r\nWalker \"has been so strident that the way he's engaged . has effectively given the Democrats the high ground in terms of how they're responding,\" Lehane said.\r\n\r\n\"What Wisconsin is going through isn't all that different from other states,\" he added. \"But the way it's being handled is.\"\r\n\r\nhttp://www.seattlepi.com/national/1110ap_us_wisconsin_budget_unions.html", "group_id": 3920, "id": 147569}]