[{"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1320933356.520602, "message": "Hello, I'm starting my final project of the career and I purpose a project of a website using GWT and App Engine, I was reading like one month how to do the things and seems very easy but as an amateur I always have the problem of the organization of the project. I read a lot about best practices and Gin, Guice ... but was impossible to know where to put everything. I found GWTP thanks to the videos about google IO and really the plugin for eclipse is what I was searching!, at least I can see which files has to be modified, ...\nNow I'm some days with it and I was starting to try things a little more serious and it appear me the doubt.\nI'm trying to make a user authentication using google app engine service but I'm not sure where to put the things as in the examples I didn't see a servlet implemented as example like they use in http://code.google.com/appengine/docs/java/gettingstarted/usingusers.html\nI was thinking to make an action with the plugin like using dispatch (I don't know exactly all the options of GWTP for it) then create the class response or return true o false or the user itself and try to do like in the getting started guide with the gatekeeper that control the logged user. \nAll like this would be correct? And the best thing to put all this is in the server.guice folder or some sub folder or other that I create specially for it?\nFinally seems a forum question, not a chat, but ok, xD Thank you in advance!", "group_id": 7611, "id": 2546021}, {"user_id": 24685, "stars": [], "topic_id": 47690, "date_created": 1320935239.8866651, "message": "Dispatch would be the right way to do it, and ActionValidator are probably where you want to check that the user is logged in.", "group_id": 7611, "id": 2546154}, {"user_id": 24685, "stars": [], "topic_id": 47690, "date_created": 1320935252.2041111, "message": "I believe PuzzleBazar does something very similar, check it out. :)", "group_id": 7611, "id": 2546156}, {"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1320935772.434659, "message": "Thx! I will take a look to PuzzleBazar and try to find something similar.", "group_id": 7611, "id": 2546194}, {"user_id": 24685, "stars": [], "topic_id": 47690, "date_created": 1320938013.7590079, "message": "Good luck. Let me know if you run into problems.", "group_id": 7611, "id": 2546390}, {"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1320939178.64586, "message": "I was editing this pov.xml and I saw something about maven, I tried to search by maven projects instead of existing projects (the generic) and then it appears one, maybe is like this.", "group_id": 7611, "id": 2546552}, {"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1320939090.7800109, "message": "I have the same problem like the other time I tried to  install it on eclipse, when I go to import -> existing projects -> it doesn't appear as a project, which kind of project is? I install every requeriment on http://code.google.com/p/puzzlebazar/wiki/GettingStarted even PyDev", "group_id": 7611, "id": 2546531}, {"user_id": 24685, "stars": [], "topic_id": 47690, "date_created": 1320941436.304877, "message": "Are you using the latest version of eclipe? It ships with an \"import as maven project\".", "group_id": 7611, "id": 2546740}, {"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1321025309.716713, "message": "Hello, I was checking the code of puzzlebazar and is quite instructive, but I wanted to try it but for now I can't.\nI was trying to solve some dependencies in puzzlebazar but I can put it working, I'm using Eclipse Indigo in kubuntu 11.10, latest puzzlebazar and gwt-platform from the repository, y created this gwtp link from Eclipse to the folder gwt-platform downloaded from the repo, I installed all about maven I saw from eclipse and kubuntu.\nI have some dependencies from gwtp saying \nMissing artifact com.gwtplatform:gwtp-dispatch-client:jar:0.6-SNAPSHOT\tpom.xml\t/puzzlebazar\tline 212\tMaven Dependency Problem\n\nI have also problems with maven-plugin\nPlugin execution not covered by lifecycle configuration: net.kindleit:maven-gae-plugin:0.8.1:unpack (execution: install-server-jar, phase: validate)\tpom.xml\t/puzzlebazar\tline 429\tMaven Project Build Lifecycle Mapping Problem\n\nAnd last one says \nThe App Engine SDK '/home/dani/.m2/repository/com/google/appengine/appengine-api-1.0-sdk/1.4.2/appengine-api-1.0-sdk-1.4.2.jar' on the project's build path is not valid (SDK location '/home/dani/.m2/repository/com/google/appengine/appengine-api-1.0-sdk/1.4.2/appengine-api-1.0-sdk-1.4.2.jar' is not a directory)\tpuzzlebazar\t\tUnknown\tGoogle App Engine Problem\n\nSorry to ask so much but I never used maven and I'm a little lost, I will continue reading about install maven plugins, because the maven-gae-plugin.jar I have it, but I don't know where to put them\nThank you for your time. I will continue trying.", "group_id": 7611, "id": 2553440}, {"user_id": 43352, "stars": [], "topic_id": 47690, "date_created": 1321113818.799067, "message": "I was checking the code and it's quite useful.\nI was installing few more things and following some tutorials and then I started again.\nI downloaded puzzlebazar from the repo (hg clone...)\nI made a mvn install in the folder and it was some errors about version 0.6-snapshot (I changed to 0,6 and it worked)\nI have an error that it doesn't find the class ProxyFailureHandler, I added the mvp.client.0.6 .jar manually but still continues the errors.\nFinally I downloaded this maven-gae-plugin 0.8.1 and I added to the path to the jar manually but this error still is there. \n\nBut ok, I will continue looking the code and it's ok, thx for the help anyway and good work with GWTP!", "group_id": 7611, "id": 2559562}, {"user_id": 24685, "stars": [], "topic_id": 47690, "date_created": 1321286332.2886159, "message": "Yeah, I need to update PuzzleBazar at some point, it has fallen out-of-step. Sorry. :(", "group_id": 7611, "id": 2572328}]