[{"user_id": 486, "stars": [], "topic_id": 14043, "date_created": 1300607323.166574, "message": "Do you prefer your iPhone without any case or do you prefere it with case/bumper?", "group_id": 24, "id": 391163}, {"user_id": 4095, "stars": [], "topic_id": 14043, "date_created": 1300640414.212121, "message": "I use a TPU case.", "group_id": 24, "id": 392684}, {"user_id": 23158, "stars": [], "topic_id": 14043, "date_created": 1300714139.326926, "message": "I use bumper style cases to minimize bulk. I have used Apple bumper, CaseMate Hula, and now back to SGP Neo Hybrid EX. I also have a Carbon Fiber back skin as well.", "group_id": 24, "id": 397686}, {"user_id": 22835, "stars": [], "topic_id": 14043, "date_created": 1300717955.323514, "message": "I have never used cases on my iPhones before, but I do like the Apple bumper.", "group_id": 24, "id": 398449}, {"user_id": 23174, "stars": [], "topic_id": 14043, "date_created": 1300723793.709058, "message": "I wish I could go without the case. Much better look and feel. Can't bring myself to do it though because I'm scared of a scratch", "group_id": 24, "id": 399459}, {"user_id": 23100, "stars": [], "topic_id": 14043, "date_created": 1300777883.4832799, "message": "No case, just a full body invisibleSHIELD. Gives protection and I find it improves grip too. http://www.iphoneincanada.ca/iphone-accessories/zagg-invisibleshield-iphone-4-review-picture-gallery/", "group_id": 24, "id": 405367}, {"user_id": 23766, "stars": [], "topic_id": 14043, "date_created": 1300837477.1935079, "message": "I personally use a wrapsol ultra for the back, a lucky labs and wrapsol ultra for the sides and an SGP ultra crystal for the front. Personally I don't like how the SGP is sticking to the screen and I probably will go back to the wrapsol for the front", "group_id": 24, "id": 412823}, {"user_id": 25637, "stars": [], "topic_id": 14043, "date_created": 1301168344.4107621, "message": "I've had mine a few months now, never used a case, and can't find a single mark on it.  Has anyone actually scratched the glass front or back?  My old iPod Touch's metal back got scratched up quite easily, but the iPhone 4 doesn't seem so easily marked.", "group_id": 24, "id": 447169}, {"user_id": 24307, "stars": [], "topic_id": 14043, "date_created": 1301200693.9688771, "message": "Since I enjoy shooting video (for video blogging) with the iphone 4, or taking pics of friends/family with me in the shot, I use the XShot.com iphone 4 case (includes mini tripod), and carry around the XShot Extender (like a portable monopod). For my \"driveby shootings\", I stick the iPhone (in the XShot case) that's on the mini tripod in my SUV dashboard, and start the video while driving :-) You can see some samples on my blog (http://ShermanLive.com). Or if I wanna shoot video of myself (while I'm not driving), I'll connect and use the XShot extender to \"shoot myself\" on-the-fly :-) Can't recommend it enough, brilliant!", "group_id": 24, "id": 449403}]