[{"user_id": 11626, "stars": [], "topic_id": 8976, "date_created": 1298609253.744015, "message": "A high-ranking U.S. General in Afghanistan illegally ordered psychological operations officers to influence political figures, Rolling Stone’s Michael Hastings reports.\r\n\r\nLt. Gen. William Caldwell, the man charged with the training of the Afghan government’s troops, ordered a group of “information operations” specialists led by Lt. Colonel Michael Holmes to help influence visiting Senators and Congressmen and garner more political support for the unpopular war. Holmes tells the magazine that when he and his fellow intelligence officers resisted the order, Caldwell’s staff and military investigators set out to ruin their careers.\r\n\r\n“My job in psy-ops is to play with people’s heads, to get the enemy to behave the way we want them to behave,” Holmes says. “I’m prohibited from doing that to our own people. When you ask me to try to use these skills on senators and congressman, you’re crossing a line.” An officer attached to another psy-ops team in Afghanistan agreed: “Everyone in the psy-ops, intel, and IO community knows you’re not supposed to target Americans. It’s what you learn on day one.”\r\n\r\nAccording to Holmes, his unit’s targets included Senators Jack Reed, John McCain, Joe Lieberman, Al Franken and Carl Levin; Congressman Steve Israel of the House Appropriations Committee; the Czech Republic’s ambassador to Afghanistan and Germany’s interior minister; and even Chairman of the Joint Chiefs Adm. Mike Mullen.\r\n\r\nHolmes says that Caldwell, an ambitious three-star general, ordered him to profile members of visiting congressional delegations and provide “deeper analysis of pressure points we could use to leverage the delegation for more funds.” The general’s chief of staff also asked Holmes what they would need to “plant inside their heads” to get more troops sent to the country.\r\n[ For complete coverage of politics and policy, go to Yahoo! Politics ]\r\n\r\n\r\n“We called it Operation Fourth Star,” Holmes says. “Caldwell seemed far more focused on the Americans and the funding stream than he was on the Afghans. We were there to teach and train the Afghans. But for the first four months it was all about the U.S. Later he even started talking about targeting the NATO populations.”\r\n\r\nFederal law forbids the use of psychological operations on U.S. citizens, and every defense authorization bill includes a “propaganda rider” reiterating the point. Holmes also suspected that Caldwell’s orders were in violation of the Smith-Mundt Act of 1948, passed by Congress to ensure that U.S. citizens would never become subject to Soviet-style propaganda campaigns. Col. Gregory Breazile, the spokesperson for Caldwell’s operation, disagreed with Holmes’ assessment. “It’s not illegal if I say it isn’t!” Holmes recalls Breazile shouting when the two discussed the legality of Caldwell’s order.\r\n\r\nCaldwell’s chief of staff then launched an investigation of Holmes that reported the Colonel drank alcohol, dressed in civilian clothing, improperly tried to start a business, made jokes of a sexual nature (“LTC Holmes’ comments about his sexual needs are even more distasteful in light of his status as a married man”), and carried on an “ inappropriate” relationship with a Maj. Laurel Levine. According to the Maj. Levine, who has received 16 service awards in her 19 years with the military and has a spotless record, Caldwell’s vendetta against Holmes “will probably end my career.”\r\n\r\nThe whole experience has left Holmes seemingly heartbroken by the military he served in. “My father was an officer, and I believed officers would never act like this,” he says. “I was devastated. I’ve lost my faith in the military, and I couldn’t in good conscience recommend anyone joining right now.”\r\n\r\nA spokesperson for Caldwell denied all of Holmes’ charges to the magazine.\r\n\r\nUPDATE: Gen. David Petraeus, the commander of Allied forces in Afghanistan, has now ordered an investigation into the Caldwell/Psy-Ops case.\r\n\r\nhttp://news.yahoo.com/s/dailycaller/20110224/pl_dailycaller/reportarmygeneralillegallyorderedpsyopsofficerstoinfluencepublicofficials_1", "group_id": 3920, "id": 205958}]