[{"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305559148.171241, "message": "The issue is that sometimes when the design and \"testing\" is done by the same agency there can be pressure for the \"testing\" to be just a sign off", "group_id": 493, "id": 1071962}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305559217.13343, "message": "I didn't mean we should detach UX from design or dev. I work very closely with both. I just think I shouldn't handle it because one could affect the other negatively.", "group_id": 493, "id": 1071972}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558276.530211, "message": "Continuing a discussion that started at twitter...", "group_id": 493, "id": 1071836}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558358.6959951, "message": "The paragraph that started it all:   \"Não fazemos design e não implementamos projectos. Ao estarmos envolvidos nessas fases comprometemos a nossa isenção e independência. A qualidade do nosso trabalho está acima de tudo.\"  in english: \"We do not design and do not implement projects. By being involved in those phases, we compromise our impartiality and independence. The quality of our work is paramount.\" in http://www.ideias-imagens.com/sobre.html", "group_id": 493, "id": 1071845}, {"user_id": 11987, "stars": [], "topic_id": 35504, "date_created": 1305559923.3455279, "message": "@BrunoFigueiredo with not doing both I agree to an extent (it comes down to your team's size and ability to multiplex). I do find that ux consultants often to a bad job at anything else than \"reporting\" when they're not tightly in the mix, though.", "group_id": 493, "id": 1072037}, {"user_id": 11987, "stars": [], "topic_id": 35504, "date_created": 1305559488.113199, "message": "it's basically saying \"we'll be the rescue team to your shitty process\". Doesn't work.", "group_id": 493, "id": 1072001}, {"user_id": 33420, "stars": [], "topic_id": 35504, "date_created": 1305559445.1112909, "message": "Bottom line: good design doesn't exclude UX.", "group_id": 493, "id": 1071997}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305559745.1263461, "message": "It's like youy're a cook and you suggest how a dish should be done for a cook book. If you're the one doing the cooking and you know you can't get ingredient X, won't that affect the recipe negativelly?", "group_id": 493, "id": 1072019}, {"user_id": 33420, "stars": [], "topic_id": 35504, "date_created": 1305559072.457763, "message": "Not if it's independent, in that case the only failed process is the translation into a design.", "group_id": 493, "id": 1071948}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305559211.065376, "message": "But should we not be carrying out \"research\" rather than \"testing\".", "group_id": 493, "id": 1071971}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558365.8179729, "message": "Now... go! ;P", "group_id": 493, "id": 1071847}, {"user_id": 21996, "stars": [], "topic_id": 35504, "date_created": 1305558432.365186, "message": "@andr3 Care to translate that, for non-portuguese speakers?", "group_id": 493, "id": 1071853}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558582.2759261, "message": "Rui, I agree. But I can also totally understand why some agencies prefer not to do both but focus on one. As long as you don't assume it's impossible to be impartial if you do both... that's the part that I find most difficult to deal with in the statement.", "group_id": 493, "id": 1071876}, {"user_id": 21951, "stars": [], "topic_id": 35504, "date_created": 1305558442.5568089, "message": "\"Is it possible to be independent if you do both the UX & the design/development?\" -> yes, it's possible. thread closed?", "group_id": 493, "id": 1071855}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558463.9751279, "message": "I did, Paulo. Included a translation from google translate.", "group_id": 493, "id": 1071858}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305559087.5302811, "message": "@keoshi, because you might have developers/designers in-house... but not someone who can conduct all the preparation that goes on before you start writing code. So you hire someone to do that part.", "group_id": 493, "id": 1071954}, {"user_id": 11987, "stars": [], "topic_id": 35504, "date_created": 1305559454.9626119, "message": "@BrunoFigueiredo you mean handle as in \"take control over\", I assume. Decoupling UX and design/dev is a bad move.", "group_id": 493, "id": 1071999}, {"user_id": 33420, "stars": [], "topic_id": 35504, "date_created": 1305558726.5254049, "message": "What I don't understand is why some people detach UX so much from design/development. I can understand why a company would focus on one; but UX should be intimately related with design.", "group_id": 493, "id": 1071892}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305558997.600996, "message": "@keoshi I know what you mean. I also believe you can have the most intricate and specific study behind the UI you create, but if the design or implementation is just.. bad, all your effort was pointless. In the grand scheme of things, the ux process failed.", "group_id": 493, "id": 1071938}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305559043.9664271, "message": "@keoshi on the other hand, in the world of being a consultant, you're hired for a specific job / part in a project... so you're bound to split it up.", "group_id": 493, "id": 1071944}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305559518.43258, "message": "I mean, UX work is to research, project and evaluate. It's a bit of a conflict of interest when you evaluate your own work or when you plan specifications for something you'll need to do. If you're a small agency, you will necessarily have some limitations in dev capacity, so you won't suggest something (that can be better for the user) that you can't implement, or you would lose face with the client.", "group_id": 493, "id": 1072003}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305559676.088275, "message": "Been \"scientific\" means using large sample sizes. Like the sort of study we do at Webnographer. Traditional user testing has such low sample sizes  20 person study has very roughly a margin of error of +/-20%. That means if you measure 10 out of 10 people completing your task, and replicated it the next test could be anywhere between 8 and 12 people succeeding.", "group_id": 493, "id": 1072011}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305560375.9232919, "message": "It boils down to experience. There are some firms with way less than 200 people doing both really well. Just doing research does not make you independent. What matters is the \"how\", \"who\", \"what\" and \"when\".", "group_id": 493, "id": 1072081}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305561427.928546, "message": "@brunofigueiredo there is always the problem of compromise! Just google \"moderator bias\" The correct way of dealing with it is in the Study Design and process you use.", "group_id": 493, "id": 1072186}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305559227.5874751, "message": "\"there can be\", not \"there is always\". I believe that is what sparked this all discussion in the first place. It is also how you handle that pressure. It's your reputation on the line...", "group_id": 493, "id": 1071973}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305559836.601567, "message": "It depends on what you are wanting the research for, and what skills you are needing.", "group_id": 493, "id": 1072027}, {"user_id": 33420, "stars": [], "topic_id": 35504, "date_created": 1305559251.648536, "message": "I can see that happening and while design involves some aesthetic values it should be scientific and objective.", "group_id": 493, "id": 1071977}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305559625.9306669, "message": "@fred I don't mean decoupling, I just mean that if you're in the consulting business you shouldn't do both. If you design and implement projects, then doing the UX work for it is super.", "group_id": 493, "id": 1072010}, {"user_id": 33422, "stars": [], "topic_id": 35504, "date_created": 1305559722.1709039, "message": "I meant 10 out 20", "group_id": 493, "id": 1072017}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305560129.69506, "message": "I agree. If you have a large enough company (I'd say at least 200 people), then the problem is minimized.", "group_id": 493, "id": 1072056}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305560449.9330599, "message": "@brunofigueiredo, the part people are having a problem with is \"By being involved in those phases, we compromise our impartiality and independence.\" That's almost like you assuming you'd do bad handling the pressure that webnographer mentioned. You're free to put whatever you want on your page and communicate whichever way you want. But that part is pointing a finger.", "group_id": 493, "id": 1072092}, {"user_id": 2543, "stars": [], "topic_id": 35504, "date_created": 1305560460.3656011, "message": "@webnographer indeed.", "group_id": 493, "id": 1072093}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305561634.276695, "message": "I'm not talking specifically about research. I'm talking about the design parts (prototyping) you do.", "group_id": 493, "id": 1072209}, {"user_id": 21981, "stars": [], "topic_id": 35504, "date_created": 1305561209.6027031, "message": "My point still stands. If you're consulting, you shouldn't implement. Even if you're really good at both, there is always the problem of compromise. That doesn't mean it happens every time. But it can happen.", "group_id": 493, "id": 1072162}]