[{"user_id": 11626, "stars": [], "topic_id": 7360, "date_created": 1298071279.6677091, "message": "Two student protesters are detained by police at the University of Puerto Rico on Tuesday.\r\nRelated News\r\n\r\nhttp://assets.nydailynews.com/img/2011/02/16/alg_puerto_rico_protesters.jpg\r\n\r\nA student strike at the University of Puerto Rico has forced the resignation of its president and sparked the second political crisis in a year for the island's rulers.\r\n\r\nJosé Ramón de la Torre, head of the 60,000-student system, resigned Friday after a series of violent clashes between students and riot police.\r\n\r\nSome 200 people have been arrested and scores of students injured, prompting professors and university workers to walk out for two days last week in sympathy with the students.\r\n\r\nOn Monday, conservative Gov. Luis Fortuño finally relented and pulled back the hundreds of riot police that had been occupying the system's 11 campuses for weeks.\r\n\r\nIt was the first police occupation of the university in more than 30 years.\r\n\r\nStudents began boycotting classes in early December to protest a special $800 annual fee Fortuño imposed this semester to reduce a huge government deficit.\r\n\r\nThat fee - equal to more than 50% of annual tuition - stunned the university community, given that more than 60% of UPR students have family incomes of less than $20,000 a year.\r\n\r\nStudent leaders persuaded the trustees to reject similar tuition hikes Fortuño proposed last spring. They did so by conducting massive sit-ins and barricading themselves in buildings on all the campuses for two months, and by running a sophisticated Internet and media campaign that garnered much public support.\r\n\r\nFortuño's pro-statehood New Progressive Party, which controls both houses of the Puerto Rico legislature, responded by packing the board of trustees with new appointees, guaranteeing him complete control this time around.\r\n\r\nLocal courts cooperated by banning student protests on university grounds.\r\n\r\nMost experts expected the students would be too exhausted from last spring to challenge the governor again.\r\n\r\nThose experts were wrong.\r\n\r\nInspired by the youth revolts in Tunisia and Egypt, the students refused to simply go home.\r\n\r\nThey presented more than 200 pages of proposals to university officials on ways to trim budget costs without huge tuition increases.\r\n\r\nUnder Puerto Rico law, the commonwealth government must spend 9.6% of its budget on the university's operation.\r\n\r\nThe Fortuño administration, which recently pushed through the biggest corporate and individual tax cuts in Puerto Rico's history, has laid off thousands of government workers and wants even greater privatization of public services.\r\n\r\nTo underscore his message, Fortuño was a featured speaker this weekend at the annual Conservative Political Action Conference in Washington.\r\n\r\nThe striking students at UPR know this is not simply a conflict with their trustees. They are up against the forces of the entire Fortuño administration. The way they see it, the future of a great public university, one that has educated generations of low-income citizens in Puerto Rico, is at stake.\r\n\r\nhttp://www.nydailynews.com/news/national/2011/02/16/2011-02-16_its_a_fight_for_affordable_ed_in_puerto_rico.html", "group_id": 3920, "id": 147343}]