[{"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1308454656.5661609, "message": "For the next meeting, various members will buy and bring in all of the necessary parts (ones we don't already have) in order to build  a simple quadcopter that can hover tethered to a power supply.", "group_id": 9523, "id": 1430013}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1308454646.825366, "message": "Today we decided on the following goals: 1. Build an indoor quadcopter. 2. Build it as small as possible but able to accomodate sensors and equipment to make it autonomous. 3. Build it as affordable as possible.", "group_id": 9523, "id": 1430012}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1308459314.9378581, "message": "I've placed an order for 2 sets of AR Drone replacement propellers, as they're already made for this purpose, & they're sold as a set of 4. With regard to MOSFETs, I'm considering making 2 small dual H-Bridge units instead. Less parts, less weight.", "group_id": 9523, "id": 1430312}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1308602297.9768629, "message": "Should have propellers & X-Frame (carbon fiber tubes, w/plastic motor mounts & ribbon wire to/from each point) by Thursday, 6/23/11. Will make H-Bridges w/small footprint this week.", "group_id": 9523, "id": 1442270}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1308692616.8424151, "message": "I'm expecting delivery of the IMU on Thursday.  I'm really not good at soldering, so unfortunately it'll have to wait for someone else to solder some pins testing.  I'll be looking into Kalman filtering for the IMU and will bring some code samples which should be pretty much ready to go for testing when we next meet.", "group_id": 9523, "id": 1452578}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1308692629.563267, "message": "Since we're starting out tethered, it will be easy to tweak PID / control parameters live which hopefully makes the tuning process go faster.", "group_id": 9523, "id": 1452580}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1309666158.6059129, "message": "Hey guys, how far did you get today?", "group_id": 9523, "id": 1550802}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1309669619.501451, "message": "Eric got the IMU talking. We'll need the motors, sensors, scale(s), & battery to have a first autopilot attempt.", "group_id": 9523, "id": 1550951}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1309713516.538383, "message": "At the meetup, I flashed the 8u2's firmware on Ben's Uno, and was able to read data from the IMU.  However, there was some bug with the code I adapted from the arducopter project, which was left unfixed.", "group_id": 9523, "id": 1553081}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1309714640.1234181, "message": "Many thanks for Ben for the soldering that will let me work on sensor fusion with real data!", "group_id": 9523, "id": 1553156}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1309713566.2740009, "message": "Today I've gathered data to use as a first estimate for IMU covariance matrix, and ran some simple, imprecise tests to verify qualitatively correct behavior.", "group_id": 9523, "id": 1553089}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1309713781.4724619, "message": "I'll post the adapted arducopter code in its current (apparently buggy) version later today after I clean it up a bit and add some general documentation.  I'm planning to set up a project on github.", "group_id": 9523, "id": 1553101}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1309738287.8474009, "message": "Awesome!", "group_id": 9523, "id": 1555492}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310074872.3931, "message": "Motors and ESCs arrived in the mail today!", "group_id": 9523, "id": 1588151}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310079216.9096251, "message": "Great! And? How are they? Why do you suggest different ones?", "group_id": 9523, "id": 1588537}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310097693.9228621, "message": "I am only thinking different ones because most people suggest ~1000 kv, while the ones I got are ~2000kv. The lower kv provides better resolution and ultimately better stability to the quadcopter. However, our props are slightly smaller than typical (most >1lb quadcopters look to use 10-12' props), so we may be ok. Motors are extremely cheap on HobbyKing anyway ($4-8 each), so it wouldn't cost very much if we needed to get more.", "group_id": 9523, "id": 1590175}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310098064.511992, "message": "I haven't tried the motors, but they look nice enough. They have a big ass heat sink that might get in the way of attaching them to the frame, but I'm sure we can figure something out. When I'm at the lab this weekend, I'll try to hook them up to my arduino and test them out.", "group_id": 9523, "id": 1590196}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310214689.4665511, "message": "Wow, sounds like exciting progress!  I'm looking forward to our next meeting.  Let me know how it goes testing the motors.  Is either of you planning to be there today at a particular time?  Depending when, I might be able to drop by and catch up...", "group_id": 9523, "id": 1598618}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310223700.150516, "message": "We'll be making Red Bull ice cream, for the Creation event. Feel free to come by.", "group_id": 9523, "id": 1599101}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310225681.5344069, "message": "Ah, I see.  How long does that go?  I have another meetup in the city that I'm guessing ends around 4, so I might be able to hope a subway over afterward.  Won't really know until later though.  Anyway, have fun :)", "group_id": 9523, "id": 1599232}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310303056.0686159, "message": "Am I correct to understand from our last meeting that since the Creation event will be over by our next meeting there will be at least one Max32 available to play with or use for the quadcopter?", "group_id": 9523, "id": 1604274}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310302632.5076411, "message": "Since we have now (in theory) received the additional parts required for initial, basic construction (in particular, motors, props, ESCs, frame, IMU), I think we should plan to meet for as long as possible or as long as we can be productive. We don't get a whole lot of face time (which can be fine for a purely software project, but doesn't work as well for shared hardware), so let's try to maximize what we do get out of the times we meet.", "group_id": 9523, "id": 1604256}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310302971.3696151, "message": "I've suggested a meetup based on what I've read about availability from convore.  Please add yourselves to it and share your comments on availability, date/time, agenda, or whatever else.", "group_id": 9523, "id": 1604270}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310304200.0635719, "message": "I'm all for us learning about it ourselves, but I'm also all for us accomplishing a great deal quickly.  These two goals are obviously at odds.  As long as we want to keep DARPA UAV competition on the table though (which I still think would be really awesome), we'll need to proceed with technical development as swiftly as possible.  Best way to do this is to add more people with complementary core competencies.", "group_id": 9523, "id": 1604363}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310303963.2025781, "message": "I think we could also really use someone who specializes in / has experience with telemetry, especially A/V.  Do you know anyone who fits the bill and might be interested?", "group_id": 9523, "id": 1604350}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310308616.1403589, "message": "We should document from the start of the build: Weights, Pictures, Plans, & a Ranking System, as far as what's 1) Crucial 2) Could use improvement 3) Is needed from outside resources 4) what is missing 6) what we could do without. Then we'll probably need another shopping/wish list, & cost breakdown.", "group_id": 9523, "id": 1604631}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310317269.9477701, "message": "I don't know anything special about color sensors.  What application do you have in mine?", "group_id": 9523, "id": 1605324}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310317504.6723111, "message": "Sounds like you've been really productive :)  It's been a busy week for me, but now things should be a bit more relaxed again.  I hope I can keep up with your level of productivity this week :)", "group_id": 9523, "id": 1605349}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310317239.2144909, "message": "I like the glider idea for improved power efficiency even over powered aerodynamic designs.  We'll need to bear in mind the weight and control constraints for each flight paradigm we intend to use.  A major source of variability will be wind.  In the DARPA contest, they promise wind speeds within a specified range.  For testing here, we may or may not be able to get that.  Air speed sensors would a boon for testing sensor packages on a kite to let us measure wind speeds at different heights without exposing untested or unstable algorithms to unknown conditions using the quad copter hardware itself.", "group_id": 9523, "id": 1605318}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310319769.1286089, "message": "My productivity isn't competitive with your understanding & facility with the software needs of the project. We're all doing well. This is a good team.", "group_id": 9523, "id": 1605554}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310325565.4797921, "message": "Yes, indeed, it is.", "group_id": 9523, "id": 1605911}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310358130.353533, "message": "Hey guys, thanks for being so organized! I've been caught up in some other matters lately, but will hopefully be able to re-engage very soon. 1. I saw the scheduled meetup, would it be possible to do it on Sunday instead of Saturday? 2. I left the motors and ESCs in our box in the lab today, so they'll be there if you guys want to play with them. 3. Are you guys going to the regular meeting on Tue? Perhaps we could meet for a hour or so after and work on our project.", "group_id": 9523, "id": 1609539}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310391730.264389, "message": "Who are our recruits? Are they all existing lab members or fresh blood?", "group_id": 9523, "id": 1611954}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310400616.560534, "message": "Damn! Don't worry about coming- it's certainly not worth that long a drive. We'll see you at the meetup in a couple weeks.", "group_id": 9523, "id": 1613320}, {"user_id": 31902, "stars": [], "topic_id": 39758, "date_created": 1310400135.046664, "message": "What time are those meetings?  But I'm not actually a member of Alpha One Labs...  The earliest I could get there would be around 7:30pm with 1.5+ hour drive direct from class.", "group_id": 9523, "id": 1613247}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310401399.6316979, "message": "Eric, 7:30 is considered Early for A1L 7pm meetings!", "group_id": 9523, "id": 1613380}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310401723.6541729, "message": "Do you think they'd like Red Bull Dry Ice Ice Cream? I have a ton of ingredients left, just need to pick up some dry ice...", "group_id": 9523, "id": 1613409}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310402160.067977, "message": "i could give you a very obvious hint in my answer, but i won't i'll just say that i know they will.", "group_id": 9523, "id": 1613434}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310402170.795949, "message": "Can somebody who's not at work the day after one of their colleagues passed away, and is distracted by what's going on around him read this and let me know if this is for sale, or if we can get one made? http://www.varesano.net/projects/hardware/FreeIMU", "group_id": 9523, "id": 1613439}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310405531.4903669, "message": "We need somebody who's good with CAD. Are either of you?", "group_id": 9523, "id": 1613715}, {"user_id": 31506, "stars": [], "topic_id": 39758, "date_created": 1310406608.72944, "message": "Not I.", "group_id": 9523, "id": 1613837}, {"user_id": 37533, "stars": [], "topic_id": 39758, "date_created": 1310418781.030576, "message": "In re: FreeIMU - on May 8 he (Fabio) wrote \"Hi Thomas, I do have some prototypes left I could sell you. If you are interested get in touch with me.\"  (Sorry if duplicate post)", "group_id": 9523, "id": 1615660}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310422115.585819, "message": "Did he name a price? Prototypes.... You think that means the firmware isn't solid?", "group_id": 9523, "id": 1615959}, {"user_id": 37533, "stars": [], "topic_id": 39758, "date_created": 1310424724.3033581, "message": "Just from reading the thread it sounds very much work in progress to me.  Each small batch sounds to have some enhancements.  So no price was given though it sounds like he isn't making big profit.  I'll send him an email.", "group_id": 9523, "id": 1616159}, {"user_id": 37533, "stars": [], "topic_id": 39758, "date_created": 1310425567.9000511, "message": "I did send an email already and will pass it on when I hear back.  Sorry about your colleague.", "group_id": 9523, "id": 1616219}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310425465.3247719, "message": "That's cool. Thanks for looking into it, by the way. I was occupied breaking bad news to people as they came by. I'll contact the guy. I didn't investigate it much; I just like to keep track of what's out there.", "group_id": 9523, "id": 1616212}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310427533.5410409, "message": "Thanks. My attention span's been stretched pretty thin today.", "group_id": 9523, "id": 1616399}, {"user_id": 37533, "stars": [], "topic_id": 39758, "date_created": 1310558375.2723491, "message": "Hi Eric,\n\nthanks for getting in touch and for your interest in my FreeIMU project!\n\nAt the moment I'm out of any board. I only got a very limited number\nof prototypes and they went out for friends and testers.\n\nWe are actually planning a big production batch which will be sell at\nviacopter.eu.. it will take at least 3 weeks anyway.\nKeep an eye on my blog for any news on this.\n\nThanks,\nHi Eric,\n\nthanks for getting in touch and for your interest in my FreeIMU project!\n\nAt the moment I'm out of any board. I only got a very limited number\nof prototypes and they went out for friends and testers.\n\nWe are actually planning a big production batch which will be sell at\nviacopter.eu.. it will take at least 3 weeks anyway.\nKeep an eye on my blog for any news on this.\n\nThanks,\n", "group_id": 9523, "id": 1627746}, {"user_id": 37533, "stars": [], "topic_id": 39758, "date_created": 1310558474.6597481, "message": "Fabio actually replied early yesterday - his email is: fvaresano@yahoo.it", "group_id": 9523, "id": 1627749}, {"user_id": 4330, "stars": [], "topic_id": 39758, "date_created": 1310562072.437232, "message": "Again, thank you. 3 weeks is a perfect amount of time for me to digest all the Eagle files, sample code, & other documentation, then formulate an idea of what price is reasonable. It looks pretty nice, & I may get one just to fiddle around with.", "group_id": 9523, "id": 1628055}]