[{"user_id": 33839, "stars": [], "topic_id": 43382, "date_created": 1312595709.7290931, "message": "Specifically as they relate to the plot dynamics of outcome and judgement.  For example, as I look through the storyforms on the dramatica website, some of them are pretty apparent as they're asked in the form of a question.  What is wrong with Cole?  Success implies we've learned what is wrong.  \n\nBut if I look at the OS of A History of Violence, \"Mobsters in Middle America\" and success doesn't mean anything to me.  Should we be stating these objectively or goal-orientated?  It appears to be a mix, some of which don't really imply what the success/failure actually is regarding.", "group_id": 2515, "id": 1807021}, {"user_id": 7664, "stars": [], "topic_id": 43382, "date_created": 1312600819.270155, "message": "If we look at BTTF, stating the OS as \"Preventing Doc's Death\" would be horribly misleading regarding the movie, although entirely pertinent to the Success/Failure of the Storyform.\n\nI think the reason the Sixth Sense is worded that way is specifically because everyone is trying to figure out what's wrong with Cole -- that question covers everyone.", "group_id": 2515, "id": 1807578}, {"user_id": 7645, "stars": [], "topic_id": 43382, "date_created": 1312611742.8663981, "message": "I guess the best answer is that the OS Name is not tied specifically to the OS Outcome.", "group_id": 2515, "id": 1808550}, {"user_id": 7645, "stars": [], "topic_id": 43382, "date_created": 1312611751.0318849, "message": "Does that help?", "group_id": 2515, "id": 1808551}, {"user_id": 7645, "stars": [], "topic_id": 43382, "date_created": 1312611633.984705, "message": "Ok - I totally know what you're asking but not sure if I'll be able to help you or not. I would think when you're trying to figure out the OS Outcome you should state it as a goal - like \"What's Wrong with Cole?\" or \"Fighting the Empire\" or \"Learning How to Fight Dragons\".", "group_id": 2515, "id": 1808545}, {"user_id": 7645, "stars": [], "topic_id": 43382, "date_created": 1312611728.8624139, "message": "Those descriptions in some of the story forms online, particularly those from the User Group Meeting, are not always agreed upon as a goal. In the Query System, where that label can be written (the OS Name), I think \"Mobsters in Middle America\" works fine because it is a shorthand description for what the OS is dealing with.", "group_id": 2515, "id": 1808549}, {"user_id": 33839, "stars": [], "topic_id": 43382, "date_created": 1312633542.364866, "message": "Both responses from you and Mike help, which brings me to the next question:  in a mystery, since we have to unravel the mystery first - do we base the OS on the outcome of the mystery itself or at least keep the outcome in mind, or do we paint a very broad brush stroke?  \n\nI ask this because as I was watching Rebecca last night (got about 1/2 way through it), I *know* the outcome, so part of me wants to say the OS is about Rebecca and her secrets which leads to everybody's false perceptions.  Yet, as the story is unfolding, one also has the impression that the OS is \"what's wrong with Max\"?  as everybody, including the chocolate popping Edith Von Hopper, is impacted by his being caught up in the past.  \n\nI guess in a way it's like the thread the other day re: symptoms vs. problem.  If we consider Max's behavior a symptom of misperception caused by Rebecca's ruse/secret that is ultimately revealed, does that make it OS about Rebecca?", "group_id": 2515, "id": 1809346}, {"user_id": 33839, "stars": [], "topic_id": 43382, "date_created": 1312736108.4280641, "message": "Ok, I think I got this down with Rebecca, \"Rebecca\" being the OS.  I had to keep in mind the OS is \"they\", which includes Maxim.", "group_id": 2515, "id": 1815369}, {"user_id": 10814, "stars": [], "topic_id": 43382, "date_created": 1312915990.9616511, "message": "If the point of a mystery is \"Whodunnit?\", then that would be the goal.  Very often, however, a mysterious murder is indicative of something far more nefarious and therefore would not be tied to the story goal.", "group_id": 2515, "id": 1833689}]