[{"user_id": 21845, "stars": [], "topic_id": 13650, "date_created": 1300390619.7343299, "message": "I think you'd run into some serious legal issues if you tried to distribute a Windows based VM.  OTOH, a Linux (or FreeBSD) one is probably a good idea.  Novell does exactly this for people who want to try out Mono:  you can download a VMWare image running OpenSUSE with the latest production version to try out.", "group_id": 4606, "id": 376997}, {"user_id": 21845, "stars": [], "topic_id": 13650, "date_created": 1300390644.771004, "message": "A quick check, and it seems that there are already some VM's you can download: http://www.vmware.com/appliances/directory/cat/0?k=Ruby", "group_id": 4606, "id": 377003}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300390159.4287119, "message": "Does anyone use a VM that's been fully setup for rails? Either in Ubuntu, Windows or Mac? I'm currently building a Windows 7 VM just for Ruby dev. As long as I didn't activate it I could torrent it or something for other people. Thoughts?", "group_id": 4606, "id": 376917}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300390405.1093011, "message": "Specially for us n00b Windows devs.", "group_id": 4606, "id": 376966}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300390381.4905469, "message": "It would be sweet to have a list of torrents with version numbers and OS's, so people could just download it, activate it (with their own licenses) and then have a machine that's ready to rock.", "group_id": 4606, "id": 376962}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300390805.5850079, "message": "Wow, I didn't realize that there was a place to search for VM's. Badass. Thanks for the link", "group_id": 4606, "id": 377043}, {"user_id": 21845, "stars": [], "topic_id": 13650, "date_created": 1300390996.312921, "message": "Yeah.  the VMWare Applicances website is handy for when you're to lazy to set up your own.  I used a SVN VM from there for the longest time.", "group_id": 4606, "id": 377060}, {"user_id": 21842, "stars": [{"date_created": 1300395241.8057489, "user_id": 14826}], "topic_id": 13650, "date_created": 1300395230.8358271, "message": "@RyanOnRails If you're going to be running a VM anyways why windows?", "group_id": 4606, "id": 377568}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300396671.669564, "message": "Because Ubuntu 10.04 was terrible (no offense to the Ubuntu'ers). The UI is really clunky and I always found myself struggling with the editors (I tried gedit with 100 plugins, Aptana, and 1 other one). Just didn't work for me. Maybe I should try a Mac OSX image. Also, windows doesn't have an RVM dealio (pik is only so good). So I can just clone a Windows 7 VM and set it up with whatever versions of Ruby + gems that I want without having to switch and such.", "group_id": 4606, "id": 377703}, {"user_id": 13919, "stars": [], "topic_id": 13650, "date_created": 1300398108.1380601, "message": "@fnichol sounds like one to me! :)", "group_id": 4606, "id": 377868}, {"user_id": 21844, "stars": [{"date_created": 1300398110.5684941, "user_id": 13919}], "topic_id": 13650, "date_created": 1300397901.392772, "message": "@RyanOnRails you might seriously want to consider trying out Vagrant (http://vagrantup.com/). It works with VirtualBox to create and configure a VM and automatically sets up some sharepoints into the VM. In other words if your Vagrant \"project\" directory is my_folder/, then the contents of my_folder/ is available by default in the VM in /vargrant (on Linux boxes). You can use your own Windows IDE of choice and the rails app is executed in Linux. Hmm, maybe a yegrb talk?", "group_id": 4606, "id": 377836}, {"user_id": 22052, "stars": [], "topic_id": 13650, "date_created": 1300399028.0750971, "message": "@fnichol So essentially you're saying I'll have my environment in 1 place, and the editing in another? That's pretty badass. The only thing that would suck would be going between the VM and windows (like to hit up the console or run commands and stuff). Unless.... SSH.. Hmmm.", "group_id": 4606, "id": 378008}, {"user_id": 21844, "stars": [], "topic_id": 13650, "date_created": 1300401156.554054, "message": "@RyanOnRails that's correct, VM as the \"app server\" and your OS as the editing environment. And yes, you just run \"vagrant ssh\" to ssh in :)", "group_id": 4606, "id": 378244}]