[{"user_id": 13453, "stars": [], "topic_id": 9681, "date_created": 1298980533.641356, "message": "Líder: @guapacho\nObjetivos: Generar ideas y recomendaciones que permitan desarrollar una propuesta de política de ciberseguridad en el ciberespacio.\nActividades: Documento de recomendaciones para construir una propuesta de Política de ciberseguridad en el ciberespacio.\nComunidad de análisis de casos.\nForo de Hacker ético.\nEnlace MinTic - ViveDigital: Fabián Muñoz", "group_id": 2696, "id": 233932}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299081616.0107679, "message": "¿Cómo debemos proteger a nuestros hijos en Facebook?: Por Verónica C. http://bit.ly/g31vPY", "group_id": 2696, "id": 248158}, {"user_id": 16710, "stars": [], "topic_id": 9681, "date_created": 1299081920.5624101, "message": "¿Cómo debemos proteger a nuestros hijos en Facebook?  Primera regla: si tienes que mentir sobre la edad de tu hijo en una plataforma web de red social, entonces esa plataforma no es segura para tu hijo.", "group_id": 2696, "id": 248211}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299081476.6792209, "message": "Este es uno de los Escuadrones de mayor interés para mí, espero poder aportar aportar a la seguridad de los #ciudadanosdigitales", "group_id": 2696, "id": 248129}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299081500.774442, "message": "No compartas en la red información que no compartirias en tu vida diaria.", "group_id": 2696, "id": 248133}, {"user_id": 17771, "stars": [], "topic_id": 9681, "date_created": 1299083535.7347031, "message": "Considero que compartir una parte de nuestra información e intereses puede ayudar a sacar un mejor provecho de las redes sociales, puesto que nuestra visibilidad aumentará y será más fácil encontrar personas e iniciativas afines a nosotros que, en los mejores casos, concluirán con las acciones que deseamos. Sin embargo, parte de nuestra información no es apta para su difusión pública y debe ser compartida con personas cercanas a nosotros, por ejemplo, nuestras familias y amigos cercanos. Podemos seguir utilizando las redes sociales para sus muchos propósitos, teniendo presente que un buen uso de ella nos prevendrá de que éstas sean utilizadas como herramientas 'contra' nosotros.", "group_id": 2696, "id": 248436}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299081650.7485271, "message": "protocolo de actuación escolar ante el #ciberbullying http://bit.ly/ebWe6s", "group_id": 2696, "id": 248166}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299082275.8872581, "message": "En las redes sociales, tu perfil digital es una extensión de tu perfil 1.0 no es necesario mentir en los detalles ni promulgar toda tu información a todo el mundo. Nunca imprimes tu hoja de vida para dejarla en una cartelera pública, la entregas a quienes estan interesados y compartes con quienes estas seguro comparten tus gustos e intereses. Siempre verificas de quien se trata antes de entablar una relación.", "group_id": 2696, "id": 248281}, {"user_id": 17771, "stars": [], "topic_id": 9681, "date_created": 1299082513.234606, "message": "Eduardo Chavarro, me parece súper interesante esto último que acabas de escribir. Lo voy a tener en cuenta de ahora en adelante. Saludos a todos, soy nueva aquí.", "group_id": 2696, "id": 248307}, {"user_id": 16500, "stars": [], "topic_id": 9681, "date_created": 1299082777.779762, "message": "Es importante tener en cuenta el cambio de paradigma que estamos viviendo actualmente con respecto a la privacidad de nuestra vida, queramoslo o no aceptarlo, nosotros fuimos criados bajo unos preceptos de privacidad casi absoluta (especialmente en las regiones del interior) bajo dichos como \"la ropa sucia se lava en casa\" y similares. Eso ha cambiado, y cambiará aún mas, no solo los jovenes ahora lo hacen, sino que la cultura misma está premiando a aquellos que comparten algunos aspectos de su vida privada, pues esta \"autenticidad\" propia de lo real, de lo personal, es lo que buscamos en este momento.", "group_id": 2696, "id": 248338}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299083546.6345761, "message": "Sexual Predators are Experts in Using Social Media http://bit.ly/g5yD27", "group_id": 2696, "id": 248438}, {"user_id": 16500, "stars": [], "topic_id": 9681, "date_created": 1299082994.908391, "message": "En pocas palabras, no podemos pensar la seguridad de los usuarios de las redes sociales a partir nuestros antiguos paradigmas de privacidad, sino a partir de los nuevos, ¿Como podemos generar protocolos de seguridad aún siendo transparentes en las redes sociales?, ¿tendremos que cambiar también la mentalidad cultural en pro de la seguridad? ¿haremos con nuestros medios digitales lo que hicimos con nuestras ciudades, dividirlas, fragmentarlas, despojar a la calle de personas para volcarlas a los seguros sentros comerciales, llenarlas de muros, rejas y conjuntos cerrados a causa del miedo?... ahí les dejo mis inquietudes. Saludos.", "group_id": 2696, "id": 248360}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299083295.6706531, "message": "@JuliUR con el mayor de los gustos... aprendemos y compartimos", "group_id": 2696, "id": 248399}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299083484.459255, "message": "La curiosidad mató al gato y en nuestro caso puede atacar al ciudadano digital, aquellos que buscan hacer daño en las redes sociales ahora se estan preparando como expertos en redes sociales y saben tus gustos y tus necesidades, saben como llegar a ti, debemos estar preparados para defendernos y asegurarnos.", "group_id": 2696, "id": 248428}, {"user_id": 16473, "stars": [], "topic_id": 9681, "date_created": 1299083771.8884101, "message": "Pero ojo con solo verificar el nombre y el avatar, personalmente fuí atacado por alguien que tomo todos los datos de un familiar y creo un perfil paralelo, por no haber verificado completamente de quién se trataba, permití a esta persona acceder a mi información compartida con familiares y ha sabido aprovecharlo para atacarlos a ellos también, creo que es bueno compartir esto con ustedes!", "group_id": 2696, "id": 248469}, {"user_id": 17917, "stars": [], "topic_id": 9681, "date_created": 1299099366.872932, "message": "Hola chicos, no pertenezco propiamente a este escuadron pero, les dejo un aporte www.aulajoannaprieto.blogspot.com. Cordial saludo a todos! Joanna Prieto.", "group_id": 2696, "id": 252752}, {"user_id": 18976, "stars": [], "topic_id": 9681, "date_created": 1299372101.8689599, "message": "Hola, este escuadron me encanta, hace parte de lo que soy, espero poder paticipar y aportar....@guapacho ya sabes q pa'las q sea.", "group_id": 2696, "id": 278088}]