[{"user_id": 11626, "stars": [], "topic_id": 6531, "date_created": 1297890955.8871059, "message": "Board members of Egypt’s Suez Canal Trade Union and a group of workers staged a sit-in at the canal’s authority headquarter in Ismailia on Tuesday, Xinhua reports.\r\n\r\nThe state-run MENA agency reported that the protesting workers will continue a sit-in demonstration until the Suez Canal Authority chairman responds to their demands. The workers are demanding an increase in wages.\r\n\r\nThe protesters promised that their sit-in will not affect the navigation process of the strategic waterway, MENA explained.\r\n\r\nIn the wake of the fall of the dictator Hosni Mubarak’s regime, Egypt as been hit by a number of labor strikes. The military now in control of the government has vowed to not allow labor strikes to paralyze the world’s most populous Arab nation.\r\n\r\nEgyptian Supreme Council of the Armed Forces warned on Tuesday that further strikes across the country will be disastrous and called for an end to all strikes, according to Xinhua.\r\n\r\nOn February 11, Dava Castillo, writing for Allvoices, reported the USS Kearsarge Expeditionary Strike Group consisting of six warships is steaming toward the Suez Canal. “The arrival of U.S. naval, marine and air forces in the Suez Canal’s Greater Bitter Lake could indicate that the crisis in Egypt is swerving out of control,” writes Castillo.\r\n\r\nAllvoices reports that the information on the strike group was released by DEBKAfile, a Jerusalem-based English language Israeli open source military intelligence website. DEBKAfile is a known neocon propaganda operation.\r\n\r\nMore than two million barrels of oil and petroleum products pass through the Suez Canal every day. Approximately 4.5 percent of the world’s oil supplies flow through the canal and accompanying pipelines.\r\n\r\nCastillo notes that the strategic waterway is also crucial to the war in Afghanistan. Ships carry cargo across the Mediterranean Sea, through the Suez Canal, and over the Indian Ocean to Karachi, Pakistan.\r\n\r\nhttp://www.infowars.com/the-suez-canal-workers-stage-sit-in-as-u-s-warships-dispatched", "group_id": 3920, "id": 124478}]