[{"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301120615.4863241, "message": "Hey guys, what do you think of my site", "group_id": 87, "id": 445272}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301120642.776119, "message": "http://like.fm/chris is my profile", "group_id": 87, "id": 445274}, {"user_id": 13786, "stars": [], "topic_id": 15438, "date_created": 1301168006.6290791, "message": "I just started using Like.FM, but I do think I am going to like it a lot.", "group_id": 87, "id": 447124}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301180546.5864921, "message": "Great! What do you like about it? @estesworld", "group_id": 87, "id": 448287}, {"user_id": 11647, "stars": [], "topic_id": 15438, "date_created": 1301296027.609508, "message": "Though I really like the clean interface and the Minimalistic approach, I think it still has a long way to go to compete with last.fm, That being said, @chrisc  if you manage to add the killer feature of being able to share playlists with other users, (that contain actual music) I'm sure you'll see spikes in adoption rates (RIP Muxtape).", "group_id": 87, "id": 455855}, {"user_id": 224, "stars": [], "topic_id": 15438, "date_created": 1301331379.4176919, "message": "I'm working on a site that will enable people to share mixtapes and play them back using the Rdio API", "group_id": 87, "id": 459774}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301352824.5740039, "message": "@elg0nz Planning to add play count charts within the week. Existing last.fm clients can be, and will be, easily converted to track to Like.fm instead. Just curious, what specific features do you use on Last.fm (minus the radio) that you think still require a long way before being replaced on Like.fm?", "group_id": 87, "id": 462914}, {"user_id": 11647, "stars": [], "topic_id": 15438, "date_created": 1301461148.848959, "message": "@chrisc Well, it is a tough question. I think the most valuable asset of Last.fm is actually the users listening history, so that can take time to replicate (specially since they launched back in 2002), but if you manage to scrape users views from YouTube or grooveshark you might catch up quickly.", "group_id": 87, "id": 477594}, {"user_id": 11647, "stars": [], "topic_id": 15438, "date_created": 1301461474.427408, "message": "[cont.] Last.fm events calendar isn't the best but still is good enough for seeing what my friends are up to. And well, groups/messaging and other social features are killer for this kind of apps and last.fm doesn't do the best job, actually Grooveshark has better ways to share their content.", "group_id": 87, "id": 477717}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301470065.9387281, "message": "@elg0nz you can see what all your friends are listening in one easy custom top chart by following them. You can import your last.fm history (but also historical data is usually less relevant than recent data, which can be captured in 1 day of listening). Also obviously I would provide much more value than simply the fact that all your history is there right? So having your history on last.fm is a weak advantage.", "group_id": 87, "id": 479337}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301470107.547544, "message": "@elg0nz but what do you regularly use last.fm for? What actual features that they provide that are actually useful?", "group_id": 87, "id": 479342}, {"user_id": 11647, "stars": [], "topic_id": 15438, "date_created": 1301556747.765609, "message": "@chrisc  I'm not sure I agree with your point of older data being less relevant than newer data, but I won't go deep into it (long story short, you need historical data in order to be able to generate \"clusters\" of users with similar tastes). About the second question, what is my most common use case there? 1. Discovering new music (The new music from your listened artists is really cool and useful). 2. Keeping track of new events in my area 3. Trying to find people who share the same tastes as I do.", "group_id": 87, "id": 489747}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301558601.291095, "message": "@elg0nz older data changes less frequently, so it's less relevant in that at any given point in time more recent data will be more relevant. You'll still get stats on your profile on Like.fm, it just won't be put front and center", "group_id": 87, "id": 490046}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301558740.883688, "message": "You can import your last.fm history to Like.fm, you want to try that, email me at chris@like.fm (the feature is hidden right now)", "group_id": 87, "id": 490075}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301558676.434891, "message": "Thanks for letting me know your use cases! That will help me design the product. @elg0nz", "group_id": 87, "id": 490057}, {"user_id": 11647, "stars": [], "topic_id": 15438, "date_created": 1301556820.1063521, "message": "check out my profile at last.fm/user/elg0nz probably that will give you some insights on how I'm using it.", "group_id": 87, "id": 489756}, {"user_id": 22453, "stars": [], "topic_id": 15438, "date_created": 1301714369.5283549, "message": "K", "group_id": 87, "id": 507384}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301714729.284725, "message": "Feature is live now, the import feature", "group_id": 87, "id": 507395}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301786312.953083, "message": "The simplest thing you have to do to make yourself more valuable than last.fm for me", "group_id": 87, "id": 510838}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301786324.1922431, "message": "vs. number of tracks played", "group_id": 87, "id": 510842}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301786361.625823, "message": "my last.fm data (http://www.last.fm/user/ctide) would be much more useful to me if it handled full sets and things like hood internet (tons of tracks, not a lot of time) in a cleaner way", "group_id": 87, "id": 510846}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301786320.8357739, "message": "is to make your charts scoped to time listening", "group_id": 87, "id": 510840}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301793946.281045, "message": "how short are those tracks?", "group_id": 87, "id": 511239}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301798125.359302, "message": "Well, take http://min.us/mvj5QL1#1 vs. http://min.us/mvj5QL1#2 both albums are about the same length, except last.fm portrays it as if I listen to the hood internet nearly 4x as often", "group_id": 87, "id": 511364}, {"user_id": 1879, "stars": [], "topic_id": 15438, "date_created": 1301798201.7621269, "message": "The problem gets even worse with full sets that are mixed into 1 mp3.  I have one mix, for example, that's an hour and a half long that I've listened to probably 40 times.  It'll never show up anywhere on last.fm though since it only counts individual track plays", "group_id": 87, "id": 511365}, {"user_id": 13733, "stars": [], "topic_id": 15438, "date_created": 1301799968.146374, "message": "In summary: robust API, event recommendations (also something that seems easy to monetize in addition to being a value add for your users), large dataset for finding trends in listening data, and an existing social graph.  Do these things well, and I think you could become a last.fm killer.", "group_id": 87, "id": 511406}, {"user_id": 13733, "stars": [], "topic_id": 15438, "date_created": 1301799073.688056, "message": "I have no idea what that green bar corresponds to that seems to be present everywhere that a track is listed. Hovering over it gives no clues either. I think automatic scheduled imports both to and from last.fm would be necessary for me to use this. And even then, I'm sort of unsure of what the value add is for making the switch. All my friends are already on last.fm, and using their api to replicate the only useful part of like.fm (seeing what friends have listened to recently) is something I was able to turn into a web app over the course of a week during my free time.", "group_id": 87, "id": 511388}, {"user_id": 13733, "stars": [], "topic_id": 15438, "date_created": 1301799391.611213, "message": "Although, on a positive note, I do think that the 'play this track now' feature would be useful for some users.", "group_id": 87, "id": 511394}, {"user_id": 13733, "stars": [], "topic_id": 15438, "date_created": 1301799801.2251201, "message": "On the topic of why I would use last.fm over like.fm? My social graph already exists on that service. They have a fully documented API for getting my data back out how and when I need it. API calls for gathering more generic, global information on general listening trends (relative playcounts for different songs on an album, for example) is easier to gather from a larger data set. They are able to provide me with relevant local event recommendations. The only other way I hear about these is through word of mouth, and if I'm listening to an artist that my friends aren't, this is a very valuable feature.", "group_id": 87, "id": 511402}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808609.2842169, "message": "for the majority of people out there that listen to music, the facebook social graph is where it's at", "group_id": 87, "id": 512205}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808575.4034641, "message": "The last.fm social graph is worthless.", "group_id": 87, "id": 512199}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808636.3644919, "message": "because their API is easy to replicate (already replicated in fact)", "group_id": 87, "id": 512208}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808625.0970819, "message": "there's no need to build on top of last.fm's api", "group_id": 87, "id": 512207}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808645.920979, "message": "and their tracking infrasctructure is open source", "group_id": 87, "id": 512210}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301808828.9260919, "message": "\"All my friends are already on last.fm, and using their api to replicate the only useful part of like.fm (seeing what friends have listened to recently) is something I was able to turn into a web app over the course of a week during my free time.\" @0 can I see this?", "group_id": 87, "id": 512234}, {"user_id": 25851, "stars": [], "topic_id": 15438, "date_created": 1301817963.387877, "message": "Gotta tell ya @chrisc, I'm totally digging Like.fm.  I stopped using Last.fm years ago when CBS bought them.  This is finally getting me into sharing my listening habits again.  Especially dig your browser extension.  Nice work all around!", "group_id": 87, "id": 513489}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301818741.2241311, "message": "@erictj Thanks! Let me know how I can improve the site too", "group_id": 87, "id": 513501}, {"user_id": 26065, "stars": [], "topic_id": 15438, "date_created": 1301842153.3121569, "message": "I love it, really cool. Any chance to track what I am listening to on my ipad?", "group_id": 87, "id": 515246}, {"user_id": 13733, "stars": [], "topic_id": 15438, "date_created": 1301862690.9587309, "message": "@chrisc \"can I see this?\" Sure. The front-end is still (very much) a work in progress (I'm primarily a back-end coder, using this project as an excuse to improve my front-end skills), but this is the breakdown for a weekly snapshot of total sum listening time for each artist listened to by my friends. The backend data aggregation and processing stuff is done, I just need to expose more of the data on the front end:  https://img.skitch.com/20110402-jn8ab9d1mtcercuhfi2s3fqarq.jpg", "group_id": 87, "id": 517122}, {"user_id": 92, "stars": [], "topic_id": 15438, "date_created": 1301871707.0105369, "message": "@martin_sunset If it tracks on Last.fm then it will be supported by Like.fm. If it doesn't get tracked by Last.fm then yes I will track it as well", "group_id": 87, "id": 518596}, {"user_id": 13786, "stars": [], "topic_id": 15438, "date_created": 1302227107.4311399, "message": "@chrisc It allows me to scrob Pandora, Grooveshark, and Youtube to Last.fm and I can listen to music that I favorite straight from Like.fm", "group_id": 87, "id": 583467}]