[{"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496276.5325041, "message": "iiiinteresting", "group_id": 89, "id": 39822}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496184.1672151, "message": "return key submits, as you would expect", "group_id": 89, "id": 39816}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493543.697732, "message": ".", "group_id": 89, "id": 39775}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493417.0900011, "message": "As I mentioned in the introduction to the novella version, the project that became known as “Notes For a Future Novel” began in March 1991. However, serious work on the novel didn’t begin again until I ended my temp job at Micro Focus, intending to use the money I had saved to focus on writing and applying to graduate schools in screenwriting. \nA class I was taking—this time, Margaret Brose’s Dante’s Divine Comedy, once again influenced me. Inspired by Dante and Virgil, I had Tim guide a hapless freshman (\"Mike\", a character who had been cropping up in my fiction for several years) through Santa Cruz. Tim, though, was an anti-Virgil, a paragon of unreason and absurdity; a guide to nowhere and nothing.", "group_id": 89, "id": 39770}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493430.728992, "message": "Notes For a Future Novel was the main focus of my work as a writer for the next year and a half. I wrote a tremendous amount in the next year and a half. The total number of words I produced from March ’91 to May ’93 was more than 152,000. To put that into perspective, that works out to about a five-hundred page novel. It works out to about 382 words per day, though there were some periods when I greatly exceeded that rate. July 1992, when I was living at my father’s house on Hamilton Ave. in Palo Alto was a particularly fruitful period, as I churned out almost 21,000 words in three weeks. That era was the first time, I believe, that I demonstrated the kind of discipline, productivity and stamina that one would need to be a novelist.  \nThe version of Notes For a Future Novel I have chosen for this collection is based on the third draft, which was originally released in May 1993, just before I left on a six-week cross-country driving trip. It was my custom in those days to create periodic releases of Notes For a Future Novel, bound at Kinko’s, which I would distribute to friends and family in order to get their feedback, and perhaps reassure them that my apparent aimlessness was in fact merely a smokescreen for a budding genius at work. My friends were somewhat bemused, and seemed to regard it as mainly an opportunity to look back nostalgically at our time in Santa Cruz, since their memories were hazier than mine (I won’t speculate as to why.) \nDraft III represented a major reduction in scope of the work. Huge amounts of writing were excised from the drafts of the previous year, which included many of the intra-textual elements, such as the novel/film “Crazy For Love.” I made these changes based on feedback I had received from trusted friends, perhaps best expressed by one who wrote me, “It’s like you’re writing this novel specifically to prove how well-read you are to your old college professors.” Ouch! But so true…\nIn looking at Notes For a Future Novel as the source of the characters and some of the situations in the Santa Zita Novels, the title is quite apt, but in recent re-readings I have, with the perspective of the years, come to see it as a cohesive work that is worth reading in its own right. I don’t worry too much about the fact that the same characters and much of the same plot re re-used in The Deep & Savage Way, or the inconsistencies between the worlds of Santa Cruz and Santa Zita—in a way, along with my Santa Cruz experiences in reality, I regard them as projections on a cave wall of some Platonic ideal of the city on the hill over-looking the city by the sea.", "group_id": 89, "id": 39771}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493453.8543701, "message": "so you can actually enter quite a bit of text in replies", "group_id": 89, "id": 39772}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496215.9092541, "message": "option-return key doesn't create a line break", "group_id": 89, "id": 39817}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496219.6070261, "message": "hm", "group_id": 89, "id": 39818}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496236.813483, "message": "booter", "group_id": 89, "id": 39819}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493495.728106, "message": "今年も2010年にに影響力のあったブロガーを選ぶ『アルファブロガー・アワード2010』を開催します。\n\n「アルファブロガー・アワード」は、2004年から毎年行われているコンテストで、今年で第7回目となる今回は、報を発信するブログ・メディアも多く登場していることから、第7回目となる今回は、「ブログ」および「ブログ・メディア」の2カテゴリでノミネートを分類、それぞれのカテゴリでアルファブロガーを決定します。\n\n2007年までは投票によりアルファブロガーを選ぶ形式、2008年はブログの記事ごとに投票を募る形式、2009年は「料理・レシピ」「デザイン」「書評」など10種類のカテゴリごとに選出する形式として実施してきました。\n\nアルファブロガー・アワード 2010\n\nノミネートは、株式会社はてなおよびTwitter上の話題をランキングするサイト「Twitty」の協力により、はてなブックマークと Twitterの発言数データに基づいて44のブログを選出しました。\n\n    * アルファブロガー・アワード2010\n\n「アルファブロガー・アワード 2010」概要\n\n「アルファブロガー・アワード 2010」は、1月31日（月）よりオンライン投票で評価を行います。\n\n2011年2月14日（月）には投票を締め切り、2月15日（火）にイベント会場にて投票結果を公開します。同アワードは、得票数のみで選出されます。\n主催：アルファブロガー運営委員会\n\n（事務局：シックス・アパート株式会社／アジャイルメディア・ネットワーク株式会社）\nスケジュール\n\n<オンライン投票：2011年1月31日（月）～ 2月14日（月）23:59\n\n結果発表：2011年2月15日（火）\n※結果は2月15日に開催する「ソーシャルメディアサミット」で発表します。\n\n「ソーシャルメディアサミット」は、主力ソーシャルメディアのキーマン、企業の担当者の方々、有識者の方々にパネリストとして参加いただき、各サービスが目指す世界観や今後の方向性、日本におけるソーシャルメディアの可能性や課題について議論するカンファレンスです。\nノミネートブログ\n\n個人ブログ部門（23ブログ）", "group_id": 89, "id": 39773}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493515.6103821, "message": "Seems to handle unicode just fine", "group_id": 89, "id": 39774}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296493623.481329, "message": "~!@#$%^&*()_+-={}|\\][;':\",.<>?/", "group_id": 89, "id": 39776}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496173.645462, "message": "booter", "group_id": 89, "id": 39815}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496264.66221, "message": "booter\nbiddle\ntrizzle", "group_id": 89, "id": 39820}, {"user_id": 224, "stars": [], "topic_id": 1511, "date_created": 1296496273.392417, "message": "ah, but if you copy and paste something with line breaks, they are preserved", "group_id": 89, "id": 39821}, {"user_id": 250, "stars": [], "topic_id": 1511, "date_created": 1296702712.319443, "message": "@djchall stop screwing around!", "group_id": 89, "id": 43600}]