[{"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531306.545445, "message": "Do you use semi-automated cloud setup tools such as silverlining, kraftwerk, etc, to get a basic client instance up and running and then move on with Puppet?", "group_id": 2079, "id": 486102}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531613.280062, "message": "@jamtur01 so... how do you create a node with a certain image and a given ssh key? I have not been able to find much on that around the web, all the tutorials seem to imply that your nodes are already up and running with a Puppet client installed :-?", "group_id": 2079, "id": 486126}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531709.1272449, "message": "The only reference that I found around is this:  http://engineering.slideshare.net/2011/03/cloud-control-puppetizing-cloud-servers-on-amazon-ec2/ and it seems to be a hackish way to bootstrap in EC2 (and there are many clouds around there...)", "group_id": 2079, "id": 486134}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531023.795347, "message": "Hi there!\nI'm interested in creating a cloud cluster that should be repeatable, highly automated and\neasy to maintain. I'm reading about the awesomeness of Puppet and I keep thinking about\nthe bootstrapping problem. Puppet requires to have the master node created and then\neach client properly instanciated with a Puppet client running. But you cannot instantiate a\nnode in the cloud with Puppet! So, which tools do you use to bootstrap your instances into\nexistence?", "group_id": 2079, "id": 486080}, {"user_id": 6348, "stars": [], "topic_id": 16366, "date_created": 1301532172.243562, "message": "Try this one - http://www.puppetlabs.com/blog/aws-cloudformation-just-add-bootstrapping-with-puppet/ - for CloudFormation - but essentially any tool that can bootstrap a cloud server (Fog for example) can add a custom script that installs Puppet and runs it.  Rightscale is another way on AWS for example.", "group_id": 2079, "id": 486175}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531237.8227201, "message": "Do you manually create nodes through the available web interfaces using a home-made instance with a Puppet client already installed?", "group_id": 2079, "id": 486096}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531359.277796, "message": "Do you use an automation tool such as Fabric or Capistrano with a cloud library such as libcloud to roll your own cloud instantiator methods?", "group_id": 2079, "id": 486109}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301531370.9737, "message": "The more I think about it, the more I think it must be turtles all the way down... :)", "group_id": 2079, "id": 486110}, {"user_id": 6348, "stars": [], "topic_id": 16366, "date_created": 1301531379.396225, "message": "You can easily bootstrap a node in a variety of clouds with Puppet!  It's no different from bootstrapping any client with Cobbler, Kickstart, Jumpstart...", "group_id": 2079, "id": 486111}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301534065.9600241, "message": "It also shows that chef has a better approach to the problem (or at least, the one that I would follow :)", "group_id": 2079, "id": 486450}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301534029.4248419, "message": "That's another really nice link that I just found. It still does things manually before baking a bootstrap image and I would even end up automating that, but it also shows that everybody is rolling their own thing when it comes to cloud bootstrapping", "group_id": 2079, "id": 486446}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301533957.4119861, "message": "http://www.devco.net/archives/2010/07/14/bootstrapping_puppet_on_ec2_with_mcollective.php", "group_id": 2079, "id": 486430}, {"user_id": 6348, "stars": [], "topic_id": 16366, "date_created": 1301548358.6382909, "message": "Chef just wraps Fog in knife.  Puppet will do similar (although IMHO better things) in the near future - keep an eye out for the Puppet Interfaces/Strings release shortly.  Of course, I also think Puppet does a bunch of things in IMHO a better way to Chef.", "group_id": 2079, "id": 488382}, {"user_id": 14653, "stars": [], "topic_id": 16366, "date_created": 1301574616.636456, "message": "On the other hand, it amazes me that in this Open Source community we are in, there is nothing better than writing yourself a bunch of script to spin nodes. A software that lets you spin nodes and manage them easily, without having to reinvent the wheel again and again.", "group_id": 2079, "id": 491113}, {"user_id": 14653, "stars": [], "topic_id": 16366, "date_created": 1301574538.032742, "message": "@jamtur01 Puppet will do similar things, but it doesn't right now, which is quite sad.", "group_id": 2079, "id": 491103}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301597952.5138869, "message": "@jamtur01 Cool, thanks for the info. I'll keep an eye on it. But, as @maraujop says, it certainly amazes me that there are so little options already developed and that the common path is to roll your own (sure, using cool libraries such as libcloud but still :S)", "group_id": 2079, "id": 494818}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301598067.378412, "message": "Also, just for the record, a nice self-management setup for your cloud instances: Overmind https://github.com/tobami/overmind", "group_id": 2079, "id": 494830}, {"user_id": 22774, "stars": [], "topic_id": 16366, "date_created": 1301533272.1800721, "message": "@jamtur01 Thanks for the link! I see how using fog I could roll my own stuff, but it would be the same as using libcloud + plain Python or libcloud + fabric in the Pythonic world. Is this really how everybody rolls their clouds? I would expect to have some \"create me some nodes of type frontend in the Rackspace cloud\" functionality already in Puppet :D", "group_id": 2079, "id": 486285}, {"user_id": 6348, "stars": [], "topic_id": 16366, "date_created": 1310706335.749907, "message": "For the interest of everyone on this thread - this is the cloud provisioner I mentioned - https://github.com/puppetlabs/puppet-cloudpack - currently EC2 but soon to be others.", "group_id": 2079, "id": 1643135}, {"user_id": 44273, "stars": [], "topic_id": 16366, "date_created": 1323584473.4786129, "message": "If you don't want to go for a full-blown \"cloud provisioner\" or \"external node classifier\", just use masterless puppet to bootstrap the master: puppet apply -e 'include puppet::bootstrap;' Have another class for puppet::client. You can't use storedconfigs, but that's about the only restriction.", "group_id": 2079, "id": 2739391}]