[{"user_id": 13750, "stars": [{"date_created": 1306902447.288583, "user_id": 20118}], "topic_id": 37551, "date_created": 1306859839.7370939, "message": "Clickable: http://www.workforpie.com/ - Very much an MVP at the moment, but would love some feedback!", "group_id": 95, "id": 1238757}, {"user_id": 3444, "stars": [], "topic_id": 37551, "date_created": 1306860813.4590421, "message": "I created my profile (http://workforpie.com/CrowderSoup/). I like it so far...kinda a personal landing page for developers. The \"Transparent\" option isn't working for me on the color selector in the \"Customize\" section.", "group_id": 95, "id": 1238912}, {"user_id": 13750, "stars": [], "topic_id": 37551, "date_created": 1306861571.52037, "message": "@CrowderSoup Hey thanks for checking it out. There are definitely a few issues with some of the customization options right now. We're actually about to get started on redesigning the whole thing to make it more user friendly and easy to set up.  We'll look into the transparent thing.", "group_id": 95, "id": 1239003}, {"user_id": 2892, "stars": [], "topic_id": 37551, "date_created": 1306863341.3745849, "message": "Looks good. Could you give some information on how the scores are calculated?", "group_id": 95, "id": 1239262}, {"user_id": 13750, "stars": [], "topic_id": 37551, "date_created": 1306864015.8868971, "message": "Sure. Most basically, the biggest portion of your score comes from github and/or bitbucket.  We look at things you might expect like number of repos, followers, watchers, and forks. SO reputation is a component as is HN karma, though to a lesser extent. There are a few other things thrown in, but that's the basics. It's still an early version, so I'm sure it'll change fairly frequently in the early stages...", "group_id": 95, "id": 1239396}, {"user_id": 13750, "stars": [], "topic_id": 37551, "date_created": 1306864896.831028, "message": "@CrowderSoup saw your profile. Score is actually quite respectable.  We'll be publishing a \"what does your score mean\" in a day or two.", "group_id": 95, "id": 1239569}]