[{"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1297798249.1196711, "message": "We're still on CS3, but moving to CS5 and can't use VersionCue any longer. We need something that allows us to centrally store and \"check out\" Creative Suite files. Working off a regular file server that sends the whole file with every open and save is not really an option, as it creates too much network traffic. What's out there?", "group_id": 629, "id": 114059}, {"user_id": 5981, "stars": [], "topic_id": 6153, "date_created": 1298306011.025449, "message": "A lot of people seem to go with Perforce ( http://www.perforce.com/ )  - it's supposed to somehow handle large chunks of binary data (like graphics files) in a way that's better than the other version control systems out there.  I've used it for some 3D projects (storing maya projects) and it seemed pretty good. The only thing I can say is I generally prefer to use git for code in a project, and where possible I like to version everything together (code and graphics). Systems like git and mercurial \"blow up\" when handed large enough files (or so I'm told - I've never seen it happen).", "group_id": 629, "id": 159627}, {"user_id": 5981, "stars": [], "topic_id": 6153, "date_created": 1298306085.8729191, "message": "Also, perforce has a \"plugin\" for some applications like maya and photoshop. I stayed away from the integration and stuck with using the more general purpose p4v client.", "group_id": 629, "id": 159633}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1298388429.4410291, "message": "thanks, i'll check it out!", "group_id": 629, "id": 179703}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303419594.28351, "message": "After considering Evolphin Zoom, Perforce, Subversion, and Gridion Flow, we ended up selecting Adobe VersionCue CS4 and the Adobe Drive connector. It'll enable a fast and fairly seamless transition for my group, allow us to upgrade our client software to CS5, and it's somewhat of a stop-gap anyway, since the organization is looking at an enterprise-wide DAM solution (perhaps CQ5, once it becomes a bit more integrated with CS products?). Thanks for the advice!", "group_id": 629, "id": 775668}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303611071.862819, "message": "Hey brunning, my company is currently evaluating Evolphin Zoom , Perforce , Drive. We are strongly leaning towards Evolphin Zoom, do you have any specific experience/feedback that would be useful to our eval?", "group_id": 629, "id": 792603}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303712882.5044489, "message": "Brunning would love to hear your feedback, our mgmnt is going to pull the trigger Mon or Tue. Would love to hear your thoughts", "group_id": 629, "id": 800499}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747509.796293, "message": "The cost of Zoom was right and it seemed pretty easy to migrate content over, etc. If we did not already have an existing VersionCue install with a ton of content, I'd imagine we'd choose Zoom. Perforce looks like as reasonable solution as well, but the interface was a bit more convoluted, seemed like it was designed to store code/programming content, with visual content as an afterthought (accomplished through a plugin).", "group_id": 629, "id": 804696}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303747675.0009141, "message": "Thanks Brunning. One of our IT guy did preliminary testing with it and found slow performance, freezes and he even managed to loose versions. Cs4 version cue has such bad rap out there - http://versioncue.info/?p=11", "group_id": 629, "id": 804719}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748168.822711, "message": "Yeah that is what we like, their tech team seemed like really smart. We have dealt with a few DAM vendors where the left hand does not know what the right hand is doing.", "group_id": 629, "id": 804780}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748244.627574, "message": "Another huge plus for us is future Adobe DAM development", "group_id": 629, "id": 804785}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748381.4613941, "message": "Isn't  their DAM really expensive?", "group_id": 629, "id": 804808}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747986.5757279, "message": "migration was important, our tech guys are supporting thousands of people and my dept has very tight deadlines for national brands, so whatever can be done to make things run smoother and faster is good", "group_id": 629, "id": 804759}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748057.2106709, "message": "So if migration was not an issue, would your team recommend Zoom?", "group_id": 629, "id": 804768}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748249.56459, "message": "namely CQ5", "group_id": 629, "id": 804787}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748670.231997, "message": "and VersionCue software is (was) included with CS, so software cost is not an issue there", "group_id": 629, "id": 804840}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747641.942162, "message": "As I said above, we're happy with the way VersionCue works, but needed to upgrade both our server hardware and the server software, enabling my group to move to CS5 on our workstations. Since I'm in a large corporate environment, it seemed like the path of least resistance - even though it's VersionCue CS4 and we're connecting through the Drive plugin (kind of a kluge), it's still supported by Adobe, a company we have a good relationship with.", "group_id": 629, "id": 804713}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303747876.2681019, "message": "So migration was the key? Similar situation here.  We are talking with the Evolphin guys about migrating our CS3 Version Cue repo to Zoom. They are looking at creating an automatic migration tool using some Adobe API.", "group_id": 629, "id": 804750}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748274.264024, "message": "which will be an enormous project", "group_id": 629, "id": 804790}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748299.6495049, "message": "and migration into that is something we have to keep in mind", "group_id": 629, "id": 804795}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748348.737119, "message": "the way the reps were talking, it sounds like future CS versions will have very good integration with their DAM products, and that they will provide clear and easy migration", "group_id": 629, "id": 804802}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747768.8226669, "message": "Adobe was nice enough to send a team to our offices to demo CS5 connecting to a CS4 VersionCue server (the rep said we're the largest user of VersionCue he's seen), and the CS3-CS4 migration is an extremely easy process, and that's important to our tech team.", "group_id": 629, "id": 804731}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747368.141669, "message": "Hi Natasha, Zoom seemed to fit our operation well (we're the digital media division of a huge magazine publisher), we needed easy access, user control, visual file preview, and something that was geared towards Adobe files - 90% of our content is PSD files, the rest is other Adobe CS files (fla, il, etc), and misc stuff like fonts.", "group_id": 629, "id": 804682}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747873.8023739, "message": "Yeah, we've seen the complaining about VC CS4, but Adobe assures us that we'll end up with a stable and fast operation.", "group_id": 629, "id": 804748}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303747902.200722, "message": "We'll also be installing it on top-notch hardware, prob a new Mac Pro with everything maxed out", "group_id": 629, "id": 804753}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748079.5222311, "message": "yes, i see no reason not to use it.", "group_id": 629, "id": 804772}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748096.4474161, "message": "looks like great software and Zoom was quite responsive with answers", "group_id": 629, "id": 804774}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748326.883178, "message": "I was going to ask you. What specific features in a DAM versus a solution like Zoom matter to you? It seemed Zoom is a versioning DAM , not sure why Evolphin doesn't say so explicitly..I mean searching etc are there", "group_id": 629, "id": 804799}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748261.353869, "message": "we are moving towards a company-wide DAM", "group_id": 629, "id": 804789}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748483.898972, "message": "Our primary needs are centralized file storage, check in/out capabilities, visual file browsing, user permissions (i.e. certain users/projects are read-only, etc), basic versioning, etc", "group_id": 629, "id": 804814}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748494.734308, "message": "and yeah, everything adobe is expensive", "group_id": 629, "id": 804815}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748546.9984429, "message": "Last time we looked at it it was a factor of 4-5X more than Zoom", "group_id": 629, "id": 804821}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748579.0039921, "message": "yeah, zoom is the clear cost winner", "group_id": 629, "id": 804829}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303748601.600379, "message": "but again, we are a large operation, we probably have thousands of CS licenses, enterprise wide", "group_id": 629, "id": 804832}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303748954.4980509, "message": "I agree VCue cost isn't an issue, I was referring more to the enterprise DAM solutions. Version control is an after thought in almost all of them. They promose connectors to open source versioning tools. We tried one of the major DAM out there and boy the interface was so clunky. Their marketing was polished, our CTO et al got swayed, drank their coolade. Our designers hated it.", "group_id": 629, "id": 804867}, {"user_id": 11605, "stars": [], "topic_id": 6153, "date_created": 1303749138.4513929, "message": "We have to avoid Frankenstein solutions in this environment. Even if it's a lesser product, if it's a packaged and supported solution from a single vendor, we're probably going with it.", "group_id": 629, "id": 804885}, {"user_id": 30894, "stars": [], "topic_id": 6153, "date_created": 1303749866.7255771, "message": "Interesting point, we wanted to not keep all our eggs in one basket.  70% of our assets are 2D (Adobe PSD etc) but we also have 3D assets, Microsoft office files (ppt etc) so we gravitated towards a more general purpose solution.", "group_id": 629, "id": 804989}]