[{"user_id": 15881, "stars": [], "topic_id": 8896, "date_created": 1298609853.044184, "message": "Oki doki, very simple first question. How is it?", "group_id": 5096, "id": 205994}, {"user_id": 15325, "stars": [], "topic_id": 8896, "date_created": 1298659841.375972, "message": "So far it's not that good. The Xoom crashes a lot and loading up apps not optimized for Android 3.0 is horrible then they crash. I feel like it's more of a prototype then a production unit.", "group_id": 5096, "id": 210308}, {"user_id": 15856, "stars": [], "topic_id": 8896, "date_created": 1298687184.464416, "message": "Wow, Honeycomb running Froyo and below in a type of \"legacy\" mode? Other than the crashing, how is the battery life? Some are reporting 10 hours, have you been able to stand it long enough to use it that long?", "group_id": 5096, "id": 212587}, {"user_id": 15881, "stars": [], "topic_id": 8896, "date_created": 1298702038.3156691, "message": "K then sums it up for now I guess. I'm trying to get into Android app development (AIR apps) Would you prefer me getting a Xoom for testing or do you have any other recommendations?", "group_id": 5096, "id": 212944}, {"user_id": 15325, "stars": [], "topic_id": 8896, "date_created": 1298740859.0552919, "message": "So the battery life is not bad on the Xoom. I really haven't tested it much but after about 2 days of light use without charging it, there is still plenty of battery left.", "group_id": 5096, "id": 214953}, {"user_id": 15325, "stars": [], "topic_id": 8896, "date_created": 1298740969.949471, "message": "Janitha, as far as AIR dev goes I would only recomend getting the Xoom if you have $800 you don't mind spending. It's super expensive for a tablet, especially a dev one and unless you are really going to do native Android 3.0 dev you could probably get away with something cheaper. The only \"selling point\" right now is the screen resolution since it is currently the highest one out there. Then again you could probably yest out larger screen sizes on your computer unless you need access to multi-touch or GPS.", "group_id": 5096, "id": 214963}, {"user_id": 15325, "stars": [], "topic_id": 8896, "date_created": 1298741029.9653189, "message": "I will say this, after 3 days of using it I really like what Google has done with Honeycomb. There is a lot of potential but it's so buggy and unstable that right now it's a huge disappointed.", "group_id": 5096, "id": 214967}, {"user_id": 15325, "stars": [], "topic_id": 8896, "date_created": 1299131972.16448, "message": "I have no clue, I would imagine there would be some patch for GoogleIO. One could only hope.", "group_id": 5096, "id": 258427}, {"user_id": 15881, "stars": [], "topic_id": 8896, "date_created": 1299131021.962641, "message": "Any chance they will be fixed an sooner?", "group_id": 5096, "id": 258290}, {"user_id": 15881, "stars": [], "topic_id": 8896, "date_created": 1299225109.635458, "message": "I saw your videos running Tile Crusader on Xoom. Looks like it runs pretty smooth. Good work with line of sight thingy. (Y)", "group_id": 5096, "id": 267674}, {"user_id": 18608, "stars": [], "topic_id": 8896, "date_created": 1299248356.7633951, "message": "I want a sexy non-Apple tablet so bad, but I'm not quite seeing Xoom as the one just yet. We need a bit more software, a more stable platform, cheaper price... I held my buddy's Xoom the other day and it seems a bit heavy, too.", "group_id": 5096, "id": 269688}]