[{"user_id": 19238, "stars": [{"date_created": 1302624511.0061829, "user_id": 29027}], "topic_id": 18875, "date_created": 1302605445.5741711, "message": "want to buy iPhone, but http://buyersguide.macrumors.com/#iPhone", "group_id": 1295, "id": 640031}, {"user_id": 4149, "stars": [], "topic_id": 18875, "date_created": 1302629659.3606761, "message": "I heard that the iphone 5 will not be announced until sept because of the release of the Verizon iphone 4", "group_id": 1295, "id": 646210}, {"user_id": 23029, "stars": [{"date_created": 1302752248.999161, "user_id": 29458}, {"date_created": 1303685726.805908, "user_id": 3426}], "topic_id": 18875, "date_created": 1302629565.9910131, "message": "Apple usually announces the iPhone around June. If you can wait you can see what the new one is all about. If you like the 4 better you can save some cash because they will drop the price when the new one comes out.", "group_id": 1295, "id": 646178}, {"user_id": 18485, "stars": [], "topic_id": 18875, "date_created": 1302662891.207912, "message": "If 4g is not supported I will hold off until iPhone 6", "group_id": 1295, "id": 655696}, {"user_id": 4149, "stars": [], "topic_id": 18875, "date_created": 1302664154.7956641, "message": "@craigshipp what steve jobs doesn't have that power over you to make you feel like you need it even if you don't want it", "group_id": 1295, "id": 656216}, {"user_id": 15929, "stars": [], "topic_id": 18875, "date_created": 1302664108.4640801, "message": "i'm waiting as well, contract end in june, see what happen then...", "group_id": 1295, "id": 656198}, {"user_id": 14028, "stars": [{"date_created": 1302752402.51386, "user_id": 29458}], "topic_id": 18875, "date_created": 1302672435.126529, "message": "Wait for the iPhone 8. It will be able to make all these sorts of buying decisions for you.", "group_id": 1295, "id": 658913}, {"user_id": 12900, "stars": [], "topic_id": 18875, "date_created": 1302712907.2731831, "message": "Oops, I hate that return is the same as submit. Anyway ... @narkoz, what phone do you currently have? If you really want an iPhone, and can afford it, you may want to buy the 4 now and then buy the 5 when it comes out (even though you'll likely have to pay full price). For all you know, maybe the 5 won't offer anything new that you're interested in, and you can continue to use the 4. However, if you're relatively happy with your current phone you will definitely save money by waiting for the iPhone 5—just realize that you could be waiting until Q1 of 2012, since that's when some are speculating that the iPhone 5 will go on sale (personally, I don't think it will take that long).", "group_id": 1295, "id": 667245}, {"user_id": 12900, "stars": [], "topic_id": 18875, "date_created": 1302712561.4094009, "message": "@NARKOZ The general consensus is that the iPhone 5 will be available this fall, at the earliest. No one really knows why, but it is not because of the Verizon iPhone.", "group_id": 1295, "id": 667134}, {"user_id": 26196, "stars": [], "topic_id": 18875, "date_created": 1302741290.9220159, "message": "I'm in the same boat. I have an aging 3 GS that is on its last leg. If I buy an iPhone 4 now, and they release the 5 in June, I'll be bummed. However, if I wait until June and find out that I won't see the 5 I September or even I 2012, then I could have just bought the 4 now. I know it sounds trivial, but I'm afraid to buy the 4 because would hate to buy a phone that will be almost 3 years old by the end of its three year contract. Man I just wish Apple would make a statement and stop the torture. ; )", "group_id": 1295, "id": 674494}, {"user_id": 12900, "stars": [], "topic_id": 18875, "date_created": 1302756186.0873611, "message": "@tikishark Yeah, but you know Apple. They're not going to let anyone know their plans much in advance. From everything I've read (and it's a lot), I'd put money on a fall iPhone 5 release at the earliest. If you think you'll really like the iPhone 4 a lot better than the 3GS, then get it. I have a 4 and love it.", "group_id": 1295, "id": 678288}, {"user_id": 10903, "stars": [], "topic_id": 18875, "date_created": 1302761993.3929729, "message": "The 3GS is \"almost\" the same as the iPhone 4 in my opinion. Sure, the camera is a little better, the screen is better, the processor is a little better... All in all, not worth the upgrade, and trust me I have been itching for an upgrade for a while now! I upgraded from the original iPhone to the 3GS release weekend. I have almost pulled the trigger on an Android phone, but I just LOVE the iPhone! I am waiting for the 5... Unless an Android phone comes out that will knock the socks off the iPhone, but I don't see that happening!", "group_id": 1295, "id": 679789}, {"user_id": 18485, "stars": [], "topic_id": 18875, "date_created": 1302811214.5674219, "message": "@greeno I would say the camera is a lot better. Especially in low light.", "group_id": 1295, "id": 689644}, {"user_id": 13501, "stars": [], "topic_id": 18875, "date_created": 1302813969.0501621, "message": "By this time of the year you should wait for iPhone 5... Apple's pricing policy ensures early buyers, because they rarely discount products over time", "group_id": 1295, "id": 690611}, {"user_id": 29594, "stars": [{"date_created": 1302859253.8223231, "user_id": 15929}], "topic_id": 18875, "date_created": 1302817786.706404, "message": "I have a 3GS and will skip 4.", "group_id": 1295, "id": 691673}, {"user_id": 29458, "stars": [], "topic_id": 18875, "date_created": 1302834891.232594, "message": "Bought the 2G, skipped the 3G, bought the white 3GS and considered buying an iPhone 4 when the white came out — which it of course has not. Now, I am planning on skipping the 4 and waiting for the 5… but these rumors of delays sound pretty credible. I’m pretty committed to waiting either way, but I’m going to be irritated if the 3GS conks out before I see a 5.", "group_id": 1295, "id": 694132}, {"user_id": 29458, "stars": [], "topic_id": 18875, "date_created": 1302840296.6962659, "message": "@itsnotvalid excellent point! Apple is a marketing behemoth. Everything they do is to control purchase patterns. This seems logical, until you see how many companies do not.", "group_id": 1295, "id": 695595}, {"user_id": 3, "stars": [], "topic_id": 18875, "date_created": 1302922049.4071741, "message": "The more you use it the more you see just how great it is", "group_id": 1295, "id": 708244}, {"user_id": 3, "stars": [], "topic_id": 18875, "date_created": 1302922029.487565, "message": "Don't wait. Retina is worth it.", "group_id": 1295, "id": 708241}, {"user_id": 4149, "stars": [], "topic_id": 18875, "date_created": 1302922079.6146281, "message": "@defunkt retina is great, but you don't know that it is great until try to use an old iphone and your like is this 8-bit LOL", "group_id": 1295, "id": 708246}, {"user_id": 29458, "stars": [], "topic_id": 18875, "date_created": 1302958477.351531, "message": "@defunkt but iPhone 5 will have a Cornea display. WAY better.", "group_id": 1295, "id": 710428}, {"user_id": 16549, "stars": [{"date_created": 1303685733.7111111, "user_id": 3426}], "topic_id": 18875, "date_created": 1303140981.1759751, "message": "I'm in the same boat, think it will be Sept until we hear anything about an iPhone 5 but I'm happy ot wait with my 3GS", "group_id": 1295, "id": 727397}, {"user_id": 30148, "stars": [], "topic_id": 18875, "date_created": 1303165483.480583, "message": "I'm still using an iPhone 3G. I am resisting a 4 (a struggle) & going to hang on for the iPhone 5. I get the feeling the 5 will have sone cool new stuff", "group_id": 1295, "id": 732489}, {"user_id": 12346, "stars": [], "topic_id": 18875, "date_created": 1303592876.766499, "message": "Wait for the five. Definitely. Otherwise you will regret it later.", "group_id": 1295, "id": 791229}]