[{"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304106880.2096391, "message": "Most things are only referenced. It could probably go either way, now that I think about it.", "group_id": 2515, "id": 862323}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106685.221406, "message": "Perhaps I wasn't clear?", "group_id": 2515, "id": 862242}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304106906.1766591, "message": "But, this being an American TV pilot, she's probably a Do-er.", "group_id": 2515, "id": 862331}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106521.5918939, "message": "Isn't she taking external actions to solve her problem?", "group_id": 2515, "id": 862188}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304105929.3982329, "message": "I just read a pilot, involving a psychiatrist who feels numb but who wants to feel like she's really living, so she does risky things with her life. \n\nI see as \"Be-er\"... correct?", "group_id": 2515, "id": 861986}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106622.2651639, "message": "Hmmm", "group_id": 2515, "id": 862224}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106850.046463, "message": "hopefully chris can stop by and give the succinct super clear answer, but I think if the problem in the story is that she's pretending to be something she is not, then that would be a be-er", "group_id": 2515, "id": 862311}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106756.6779661, "message": "i thought she was going skydiving, hiking mountains", "group_id": 2515, "id": 862274}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304106686.644315, "message": "Like, \"I'm all numb, so I'm going to play at being someone I'm not... someone who dates a drug dealer.\" ... And then that's what she does.", "group_id": 2515, "id": 862244}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304106744.4399719, "message": "I'll take the blame. At least in private. Publicly, I'l hang you out to dry.", "group_id": 2515, "id": 862269}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304106741.5325029, "message": "well that sounds like a be-er type problem", "group_id": 2515, "id": 862267}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304106556.929245, "message": "But you also once told me that people changing their behavior based on what they think is 'being'.", "group_id": 2515, "id": 862200}, {"user_id": 10814, "stars": [], "topic_id": 22069, "date_created": 1304113044.210217, "message": "If the OS is about the \"adventures\", the MC could still be a Be-er who PREFERS to resolve problems internally.  I see a lot of role playing in her approaches.", "group_id": 2515, "id": 864321}, {"user_id": 7712, "stars": [], "topic_id": 22069, "date_created": 1304112689.3329179, "message": "In comparison, I think that Sofia in Shorbus (2006 - http://www.imdb.com/title/tt0367027/) would be considered a Be-er. Sofia is a family counselor who has never had an orgasm, and although the story is about her going out and discovering orgasm, it's not her choice--it's her friends that beckon her to go out and experience new things. Does that sound similar to your psychologist?", "group_id": 2515, "id": 864279}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304116836.3629971, "message": "The OS is chaotic weekends at Bellvue, dealing with psychotics. The risky behavior is her throughline.", "group_id": 2515, "id": 864773}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304117241.3967099, "message": "Part of her throughline, rather", "group_id": 2515, "id": 864794}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304182169.0303731, "message": "Speaking of Be-ers, the whole reason I watched Karate Kid was because Jim said Mr. Miyagi was a great example of a Be-er. I see how incredible Female he is, but have no idea how he is a Be-er. \nJim?", "group_id": 2515, "id": 869586}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304230266.356848, "message": "Technically I would say that Daniel is a Do-er. I don't use Be-er or Do-er to describe Impact Characters because I think that only confuses things. Sure they often are doers if they impact externally or beers if they impact internally, but I think Approach should be reserved for Main Characters. Likewise with Mental Sex, it is not always the opposite of the Main Character.", "group_id": 2515, "id": 874024}, {"user_id": 7669, "stars": [], "topic_id": 22069, "date_created": 1304230987.791667, "message": "True, Jim, you really shouldn't use Do-er or Be-er to describe an Impact Character's behavior (often that holds accurate, but not universally), but I do think it's fair to say that an Impact Character \"represents\" either the \"Do-er argument\" or the \"Be-er argument\", in contrast to the Main Character's argument.", "group_id": 2515, "id": 874044}, {"user_id": 7669, "stars": [], "topic_id": 22069, "date_created": 1304231006.2997241, "message": "After all, they're in the part of the chart they reside in for a reason.", "group_id": 2515, "id": 874045}, {"user_id": 30951, "stars": [], "topic_id": 22069, "date_created": 1304250258.1501729, "message": "To me, the problem here is, is that as the story is seen from the MC's POV, could we therefore be sure about the IC approach? Or more importantly, does knowing that make any difference to story? The only thing I would say re. Karate Kid, is that imo, Mr Miyagi changed Daniel's approach from doing something without thought, solving problems externally, to looking inside himself and realising he could be better himself. I guess he still is a do-er though.", "group_id": 2515, "id": 874671}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304273057.0353141, "message": "@SandyStone I don't know what \"represents\" means here. Can you spell it out?", "group_id": 2515, "id": 876996}, {"user_id": 7645, "stars": [], "topic_id": 22069, "date_created": 1304314936.071408, "message": "What @mikeaja said.", "group_id": 2515, "id": 880607}, {"user_id": 7669, "stars": [], "topic_id": 22069, "date_created": 1304351124.655462, "message": "The point of having an Impact Character is that he (or she or it) expresses or embodies an alternative point of view, or argument, or paradigm, to the MC.  But the IC doesn't necessarily express that point of view proactively or even consciously.  For instance, the little boy in \"Sling Blade\" doesn't know he's having a profound impact on the Billy Bob Thornton character, and certainly isn't trying to, but he definitely \"represents\" an alternative to the MC's existing and familiar paradigm.  Another for-instance, in Toy Story 1, Buzz Lightyear certainly looks like a Do-er on his own terms, but in terms of his impact on Woody, he \"represents\" the Be-er argument.", "group_id": 2515, "id": 884803}, {"user_id": 7664, "stars": [], "topic_id": 22069, "date_created": 1304367036.7966521, "message": "Thanks. I'll have to check out TS1 again, but I'm happy to have something tangible to sink my teeth into.", "group_id": 2515, "id": 888740}]