[{"user_id": 21218, "stars": [], "topic_id": 37611, "date_created": 1306887362.664283, "message": "I've always thought that threaded comments were superior because of the in-depth discussions on Reddit and Hackernews but now I'm looking at Convore and it got me thinking, how much in those threads are really worth reading?  With Reddit in particular it doesn't usually seem like I gather very much useful information from comment replies and it seems to encourage a whole lot of useless comments.  I'm on the fence.  You're the experts, what do you think?", "group_id": 95, "id": 1245124}, {"user_id": 8649, "stars": [], "topic_id": 37611, "date_created": 1307027241.2448289, "message": "In general, flat vs. nested is not something anyone has figured out a good generic solution for.  The best so far seems to be \"nested, with auto-collapse based on some user-specific score\".  But the whole notion of score then brings in ratings and karma and all this other nonsense.  Last year I had given some thought to a new way of interacting with online text that incorporated a mechanism for *semantic* folding.", "group_id": 95, "id": 1267853}, {"user_id": 8649, "stars": [], "topic_id": 37611, "date_created": 1307027117.9374321, "message": "Are you kidding?  At least 80% of the fun of Reddit is in the comments!  Otherwise you might as well visit Fark and Popurls or something.", "group_id": 95, "id": 1267838}, {"user_id": 8649, "stars": [], "topic_id": 37611, "date_created": 1307027437.0511849, "message": "It was inspired by a series of Facebook pwnings of a right-wing high school friend of mine.  I would write out long, well-thought-out arguments backed by facts and occasional links to sources, and then he would promptly nitpick a minor aspect of the first or second paragraph, or take an analogy and run with it off of a cliff.  I thought that if there was a way for me to present the general overview of my argument/counter-argument, but to provide hierarchical drill-downs, then he wouldn't get so lost and I'd be able to keep the attention focused on the original core arguments at hand.", "group_id": 95, "id": 1267869}, {"user_id": 33347, "stars": [], "topic_id": 37611, "date_created": 1307058132.6607039, "message": "Nested for me, I like setting a comment score threshold and collapsing threads I don't care for.", "group_id": 95, "id": 1272732}]