[{"user_id": 11626, "stars": [], "topic_id": 21514, "date_created": 1303860442.746119, "message": "http://www.infowars.com/government-orders-expedited-printing-of-detainee-handbook\r\n\r\nGovernment Orders Expedited Printing of Detainee Handbook\r\nKurt Nimmo\r\nInfowars.com\r\nApril 20, 2011\r\n\r\nIt suddenly disappeared from the government printing office website, but was captured by Google&rsquo;s search engine cache &ndash; a bid to print a National Detainee Handbook in English and Spanish.\r\n\r\nThe post does not mention the content of the handbook. Considering past activity by the government on detaining citizens, however, it does not take a lot of imagination to guess what will be included in the latest publication.\r\n\r\nA PDF received by Infowars.com indicates that proofs of the handbook should be sent to U.S. Customs and Border Protection.\r\n\r\nIn 2007, ICE pubished a handbook detailing detention procedures. The booklet was distributed by the Department of Homeland Security, U.S. Immigration and Customs Enforcement, and the Office of Detention and Removal Operations to detainees facing deportation. In 2003, the government launched Operation Endgame to detain and deport all removable aliens and &ldquo;suspected terrorists&rdquo; currently living in the United States by 2012.\r\n\r\nThe federal government has devised contingency plans to round up and intern people it considers &ldquo;national security threats.&rdquo; Rex 84, short for Readiness Exercise 1984, is a contingency plan developed by Lieutenant Colonel Oliver North, who worked for the National Security Council and the Reagan administration. North worked with FEMA on the plan.\r\n\r\n\r\n    * A d v e r t i s e m e n t\r\n    *\r\n\r\n\r\nRex-84 would suspend the Constitution, declare martial law, place military commanders in charge of state and local governments, and detain large numbers of American citizens. Rex 84 was publicly mentioned during the Iran-Contra Hearings in 1987 (see video below).\r\n\r\nIn addition to Rex-84, there are numerous Executive Orders associated with FEMA that would suspend the Constitution and the Bill of Rights. See Steve Watson&rsquo;s FEMA Executive Orders Paved The Way For Emerging Police State Hell.\r\n\r\nFollowing Hurricane Katrina, the media criticized FEMA for its apparent lackadaisical response to the disaster. FEMA&rsquo;s response, however, was not due to ineptitude or government bureaucratic red tape &ndash; humanitarian efforts were no longer part of its job description under the Department of Homeland Security.\r\n\r\nKatrina provided FEMA was an excuse to stage a dry run in New Orleans, specifically in regard to dispatching police and deputized security contractors to confiscate constitutionally protected firearms at gunpoint. In addition, as Wayne Madsen has noted, the natural disaster gave the agency the opportunity to beta test its &ldquo;relocation program.&rdquo; A large number of evacuees were treated as internees by FEMA and interned in toxic trailers.\r\n\r\nIn May of 2007, then president Bush expanded Rex-84 by issuing two executive orders &ndash; NSDP51 and HSDP20. The orders permit a government takeover all local governments under a national state of emergency. Author Jerome Corsi talked about Bush&rsquo;s power grab on C-Span (see video here).\r\n\r\nStock up with Fresh Food that lasts with eFoodsDirect (Ad)\r\n\r\nAgain, while the government printing bid linked above does not go into detail about the content of the handbook, we can surmise through past government behavior that it may be a guideline for further stripping Americans of their natural rights enshrined in the Constitution and the Bill of Rights.", "group_id": 3920, "id": 819961}]