[{"user_id": 10406, "stars": [], "topic_id": 40433, "date_created": 1309019683.139497, "message": "Hablando de e-marketplaces y el caso Lokuaz, estaba analizando si existe algun tipo de reglamento o manera de controlar el procedimiento interno que tienen algunos sitios de comercio electronico, para darle prioridad a algunos productos o usuarios. En otras palabras es legal o \"justo\" que la compañia manipule los resultados de busqueda, priorizacion o subastas con el fin de maximizar las ventas? Alguien nos puede auditar? Estamos en un paraiso legal? Si hablamos del open Source, es por eso que es abierto y es por eso que podemos analizar las entrañas... pero en un sitio web?", "group_id": 965, "id": 1484742}, {"user_id": 2946, "stars": [{"date_created": 1309032781.313365, "user_id": 29866}], "topic_id": 40433, "date_created": 1309031096.1742361, "message": "No tengo idea de la legalidad. Pero creo que la famosa aprobación e la Amipci da esa impresión. Le das tu cuota de protección y te dejan poner un logo que parece oficial, de gobierno.", "group_id": 965, "id": 1485387}, {"user_id": 20146, "stars": [], "topic_id": 40433, "date_created": 1309064305.0233309, "message": "Asta mi entender no, creo lo mas cercano a esto es la ley de protección de datos que en algunos lugares(como españa y algunos edos de USA) la regulación. Respecto a la apariencia de legalidad personalmente no se que tanta confianza te proporciona el logo de la Amipci,creo que da mas confianza un logo de positiveSSL, aunque depende de a que publico te intentas orientar en un caso local creo que el de Amipci es una mejor opción(Aunque personalmente pienso que ambos son un chollo)", "group_id": 965, "id": 1487279}, {"user_id": 2946, "stars": [], "topic_id": 40433, "date_created": 1309158172.116564, "message": "@fitorec No digo que la amipci sea una buena opción, pero creo que es prácticamente un esquema de protección que engaña a los usuarios haciéndoles creer que esta asociación mexicana del internet es algo oficial. Y lo triste es que empresas grandes como Paypal y Google los validan :S", "group_id": 965, "id": 1493325}, {"user_id": 10406, "stars": [], "topic_id": 40433, "date_created": 1309284505.1168571, "message": "@soska quizas no sea la mejor opcion pero es la unica. Conoces alguna otra?", "group_id": 965, "id": 1507899}, {"user_id": 29866, "stars": [], "topic_id": 40433, "date_created": 1309318239.4476521, "message": "Creo que AMIPCI la usan las empresas extranjeras para \"tropicalizar\" su producto, es algo así como, \"si a los mexicanos les da confianza comprar con ese logo, bueno, pues se lo pongo a mi \"pagina\" como dicen por allí, al final, lo que nos importa importa es que compren\" , de validez no tiene nada me encantaría ver el sitio de Apple o Facebook con el logo del AMIPCI creo que es algo que se usaba por allí en la Web 1.0, poco a poco los usuarios se hacen más instruidos y saben que si quieren meter sus datos para comprar se requiere de otros factores y no de un logo de los 90´s.", "group_id": 965, "id": 1514397}, {"user_id": 2946, "stars": [{"date_created": 1309361028.7858751, "user_id": 29866}, {"date_created": 1309421884.3029959, "user_id": 24172}], "topic_id": 40433, "date_created": 1309360973.9925301, "message": "@fservin La verdadera pregunta es: es necesaria? La respuesta es no. Por lo que a mi concierne Startups MX, Noticias Hacker son la verdadera asociación mexicana de internet.", "group_id": 965, "id": 1517638}, {"user_id": 20146, "stars": [], "topic_id": 40433, "date_created": 1309368517.3460779, "message": "Propongo un logo de aplicación emergida(ó discutida en) de StatupsMX y/ó Lanzaton.", "group_id": 965, "id": 1518739}]