[{"user_id": 30287, "stars": [], "topic_id": 43097, "date_created": 1312206920.136502, "message": "@jimhull, Regarding your latest article on the ridiculous practice of stating the goal out loud, I wanted to share with you a short passage from \"Save the Cat\", probably the most popular screenwriting book of late. This is from page 146:\n\n\"Is what your hero wants obvious to you and to the audience? If not, or if you don't know what your hero's goal is, figure it out. And make sure the goal is spoken aloud and restated in action and words throughout the story.\"\n\nSigh.", "group_id": 2515, "id": 1765907}, {"user_id": 7645, "stars": [], "topic_id": 43097, "date_created": 1312207403.1817789, "message": "Lol!! Well that explains it! (and don't read it if you're doing the back to the future analysis TONS of spoiler alerts. Plus, I could be wrong.)", "group_id": 2515, "id": 1766017}, {"user_id": 33839, "stars": [], "topic_id": 43097, "date_created": 1312219881.5416279, "message": "Ugh. Yeah, it's like self-hypnosis.  Say something enough times and it's suddenly true, lol.  I think if we were to tell a story about \"Save the Cat\" and their ilk, it would be how some of these gurus start out with good intentions, inspire a bunch of people, etc.  \n\nThen we realize all that advice has now been literally followed to a \"T\" so that every movie is beyond formulaic - they all have a cat being saved within the first 10 pages.  Even worse, the gatekeepers immediately toss your script aside if a cat isn't saved by page 10.  \n\nTHEN, just like in The Jerk, moviegoers end up cross-eyed throughout the country having developed a form of lazy eye because one half of their brains are no longer needed and Hollywood is brought to its knees by lawsuits.  \n\nNot to worry though!  If Save the Cat is the problem, then ultimately we all know the solution is Save the Dog!", "group_id": 2515, "id": 1767931}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312220549.4629099, "message": "Another favorite of mine is \"make sure the theme is stated on page 3.\"", "group_id": 2515, "id": 1768012}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312220975.4194889, "message": "The thing that we writers do forget is that, unfortunately, script readers go to Starbucks on Saturday morning with 15 scripts to read. Giving them a hand isn't the worst idea.", "group_id": 2515, "id": 1768088}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312220768.5447099, "message": "Anyway, I'm going to play Devil's Advocate here. \n\nWe can all agree that the actual OS Goal is not getting Marty back to the future. But, it is the thing in the movie that will have the most dire consequences -- a family will never form. It is the thing we see visualized in the fading photograph and Marty's hand problems when playing guitar.\n\nMost of the tension in the movie is actually tied to getting Mary back to the future. Also, it's tangible.\n\nMy point, I guess, is that the movie gives a very strong framing device to the audience -- and I think that framing devices can be a compelling storyweaving choice.", "group_id": 2515, "id": 1768051}, {"user_id": 33839, "stars": [], "topic_id": 43097, "date_created": 1312220854.2965419, "message": "I just went through a script of mine and deleted a bit of dialogue because somebody erroneously stated \"that must be your theme\" when it was but just a bit of dialogue.  I swear, somebody writes it in a book and everybody (well, not everybody) believes it... then that's what they look for... ultimately judging your story on those merits.", "group_id": 2515, "id": 1768073}, {"user_id": 13109, "stars": [], "topic_id": 43097, "date_created": 1312331138.8090489, "message": "Though I agree with the concept that \"stating your goal out loud is mind-numbingly prosaic\".  From a directors point of view I am also aware that the audience should \"know\" what the goal of the character on screen is shooting for.  The danger being if the audience doesn't know the hopes and dreams of the character - how are they to emotionally connect to the character when they are striving for their goal.", "group_id": 2515, "id": 1780564}, {"user_id": 13109, "stars": [], "topic_id": 43097, "date_created": 1312331269.2873099, "message": "A confused or absent goal being presented, takes away from the audiences ability to join in the celebration/commiseration of the character as they succeed or fail.", "group_id": 2515, "id": 1780591}, {"user_id": 13109, "stars": [], "topic_id": 43097, "date_created": 1312331687.344914, "message": "Case in point - Quantum of Solace. There was one scene where there was a fist fight between Bond and a henchman.  Both had lost their weapons but one gun was within reach of the characters.  The way in which it was shot/edited meant that I was unable to tell if the hand that was reaching for the gun was Bonds or the villain.  I was confused as to whether i should root for the hand to get the gun or not as I didn't know who's hand it was.", "group_id": 2515, "id": 1780664}, {"user_id": 13109, "stars": [], "topic_id": 43097, "date_created": 1312331795.200206, "message": "I feel the same way with character goals.  Even though it would be best not to say it out loud. The audience should know intrinsically what the goal is nevertheless.", "group_id": 2515, "id": 1780681}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312345297.2450449, "message": "I was like \"what???\"", "group_id": 2515, "id": 1782093}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312340797.883353, "message": "Thinking about BTTF, does Marty ever imply he wants to 'fix' his family?", "group_id": 2515, "id": 1781729}, {"user_id": 7645, "stars": [], "topic_id": 43097, "date_created": 1312341554.231689, "message": "If the writing is good enough, a character doesn't need to verbalize their goal. It comes off amateurish and speaks volumes as to the level of insecurity within the creator.", "group_id": 2515, "id": 1781809}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312343693.7053969, "message": "Absolutely.\n\nAll a character needs to do is try to solve his goal. We see what they are up to. (Show don't tell... Actions speak louder than words... etc.)\n\nThat's why I asked about Marty ever implying he wants to fix his family. Did he even try to do it? I think NO. I think fixing his family is all fallout from his other needs, specifically in this case, getting them to fall in love.", "group_id": 2515, "id": 1781986}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312345799.6278181, "message": "We're in the wrong thread, now, but it suddenly seems clear that Marty's motivation cannot be other than \"self preservation\".", "group_id": 2515, "id": 1782118}, {"user_id": 37586, "stars": [], "topic_id": 43097, "date_created": 1312387635.810936, "message": "@MikeDerk I deleted and moved my comments to BttF thread", "group_id": 2515, "id": 1785269}, {"user_id": 7664, "stars": [], "topic_id": 43097, "date_created": 1312419692.121685, "message": "I was worried this thread would eventually bleed back into the other one. Thanks for moving your comment.", "group_id": 2515, "id": 1789945}]