[{"user_id": 13919, "stars": [], "topic_id": 16090, "date_created": 1301431416.6930101, "message": "Hi all, I'm happy to announce the next meetup on April 19th, 2011. No details on location yet. Does anyone have a contact at the UofA if we'd like to have it there? The theme is DevOps and managing your infrastructure. It would be great to get some people to talk about how they setup their boxes to run ruby, how the manage and maintain their application and servers, and anything else related to creating agile application deployments. Is anyone able to talk about some of this?", "group_id": 4606, "id": 472265}, {"user_id": 2633, "stars": [{"date_created": 1301492101.1875949, "user_id": 14826}, {"date_created": 1301521940.5304, "user_id": 13919}, {"date_created": 1301624717.4852519, "user_id": 21844}], "topic_id": 16090, "date_created": 1301460403.2729571, "message": "I can talk about the fabric + puppet setup we use at YS, since I just wrote it this past week or so :)", "group_id": 4606, "id": 477440}, {"user_id": 21840, "stars": [], "topic_id": 16090, "date_created": 1301468737.9417429, "message": "I thought it was funny... but seeing as his is probably trolling, I don't think I'll link anything else of his starting now.", "group_id": 4606, "id": 479211}, {"user_id": 21840, "stars": [], "topic_id": 16090, "date_created": 1301468668.8826079, "message": "Apparently, the same guy who thinks Macs are horrible dev machines also thinks this exactly topic is also a \"scam\": http://teddziuba.com/2011/03/devops-scam.html", "group_id": 4606, "id": 479194}, {"user_id": 21844, "stars": [], "topic_id": 16090, "date_created": 1301584993.3101959, "message": "Guess it makes sense for me to talk about chef. Anyone have specific problems or questions? There's a lot that could be covered...", "group_id": 4606, "id": 492922}, {"user_id": 14826, "stars": [], "topic_id": 16090, "date_created": 1301592193.353406, "message": "@fnichol I'm not sure on something specific with chef.  I've found the learning curve with recipes and cookbooks and chef-solo vs chef-server and knife and shef....it takes me a while to learn and I just go back to using a bash script again.  I personally would benefit from a simple \"this is how I would teach a newbie to use chef\".", "group_id": 4606, "id": 493928}, {"user_id": 21844, "stars": [], "topic_id": 16090, "date_created": 1301601845.236372, "message": "@mm53bar I'm thinking something \"hands on\" if possible with a concrete example. the ideas and concepts are already abstract enough.", "group_id": 4606, "id": 495423}, {"user_id": 21844, "stars": [], "topic_id": 16090, "date_created": 1301601784.6018391, "message": "@mm53bar I agree with the newbie approach. I went through many starts and stops with both puppet and chef before it stuck. Think it would be overly simplistic to just focus on chef-solo (no servers, knife, etc)? That ends up being the closest analog to capistrano/linode stack scripts/shell scripts.", "group_id": 4606, "id": 495402}, {"user_id": 2633, "stars": [], "topic_id": 16090, "date_created": 1301619835.251564, "message": "@fnichol If you can compress chef into a couple files that would be awesome. Instead of the directory hell that is chef proper.", "group_id": 4606, "id": 498104}, {"user_id": 21844, "stars": [], "topic_id": 16090, "date_created": 1301624661.496628, "message": "@darkhelmetlive yeah, I'm really leaning towards simple and fewer files. Like a sinatra approach to a rails problem :) You can see how the scale up could work, but most people are interested (I'd guess) in just seeing something useful working", "group_id": 4606, "id": 498626}, {"user_id": 14826, "stars": [], "topic_id": 16090, "date_created": 1301935791.4775929, "message": "@fnichol \"Seeing something useful working\" would be a great goal.  :)", "group_id": 4606, "id": 524698}, {"user_id": 13919, "stars": [], "topic_id": 16090, "date_created": 1302186123.161922, "message": "@fnichol @darkhelmetlive would you guys be willing to team up to do a longer intro to chef? Even if it takes an hour you could start from the basics and it would give you time to go through the full setup. Thoughts?", "group_id": 4606, "id": 575493}, {"user_id": 2633, "stars": [], "topic_id": 16090, "date_created": 1302240886.0647719, "message": "I'm more of a puppet guy. I've used chef but I can't say I'm a fan, honestly.", "group_id": 4606, "id": 586960}, {"user_id": 4009, "stars": [], "topic_id": 16090, "date_created": 1302276612.623466, "message": "@darkhelmetlive How come? Is it a preference thing? I havent used puppet, so I am curious.", "group_id": 4606, "id": 591698}, {"user_id": 21844, "stars": [], "topic_id": 16090, "date_created": 1302282511.7915599, "message": "I was working with puppet before chef. I think the puppet dsl (hiding more rubiness by default) suits the traditional sysadmin types who might scoff at picking up a new programming language. In the end I liked the ruby dsl syntax with chef. To me, felt more like a high-powered script where things got tricky. But if you're looking at track record (history) and documentation (including books), puppet is the king there. I'm just glad there are excellent options out there--and I can understand the codebases.", "group_id": 4606, "id": 592889}, {"user_id": 2633, "stars": [], "topic_id": 16090, "date_created": 1302298697.531317, "message": "@x0nic Chef is epic. You say \"make me a cookbook\" and it makes like 5 directories and a bunch of files. I can do everything in one file in puppet (if I want). I'm sure I could in chef too, but i haven't found reliable docs on how to use \"basic chef\". it seems like it's all or nothing (i'm probably just missing something though)", "group_id": 4606, "id": 596304}, {"user_id": 13919, "stars": [], "topic_id": 16090, "date_created": 1302633962.48669, "message": "FYI, we've just gotten space at the UofA for this meetup. It's going to be in the same room as the BuildNight in the Computer Science building. Will send out an email with details tonight.", "group_id": 4606, "id": 647487}, {"user_id": 13919, "stars": [], "topic_id": 16090, "date_created": 1302809626.6404879, "message": "Details for the next meetup are up on the blog. Thanks for the Computer Science Faculty this is going to be our first meetup on campus! Hopefully we get lots of students out. http://yegrb.com/2011/04/13/MEETUP-April-19/", "group_id": 4606, "id": 689284}]