[{"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298395563.6297359, "message": "better to navigate, to filter, to sort, ...", "group_id": 3478, "id": 180639}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298395540.3497231, "message": "First: what is better?", "group_id": 3478, "id": 180633}, {"user_id": 14741, "stars": [], "topic_id": 8096, "date_created": 1298409715.5773721, "message": "what I feel to miss is something like \"what happened\", not \"what's happening\", for the days I can't stay up to date on some topics. Onother need is about events discovery.", "group_id": 3478, "id": 182890}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298412502.709316, "message": "yes, is very important for me too. btw: in jetwick that is already implemented when you login and save a search. jetwick tracks those search terms for you and displays only tweets you didn't already visited. but more important: you can do the search with sort=retweets", "group_id": 3478, "id": 183977}, {"user_id": 14741, "stars": [], "topic_id": 8096, "date_created": 1298419829.4078569, "message": "Yeah it's nice and have a lot of features. As a user: too much! The winning services these days are such cause they start with less feature than others (see dropbox) and add advanced features later. BTW, it's done with wicket, I can totally help there! :)", "group_id": 3478, "id": 185205}, {"user_id": 14739, "stars": [], "topic_id": 8096, "date_created": 1298445515.720041, "message": "@ildella +1 for restricted, \"most-requested\" features, and above all, clean and intuitive UI.", "group_id": 3478, "id": 186146}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298452016.1212201, "message": "thats a good news: BTW, it's done with wicket, I can totally help there!", "group_id": 3478, "id": 186313}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298452049.6270859, "message": "yeah, I know too many features ... but I like all of them too much ;) you should tell me which one you like the most", "group_id": 3478, "id": 186314}, {"user_id": 14741, "stars": [], "topic_id": 8096, "date_created": 1298469244.318841, "message": "I'd rather choose one or two scenario and implement them deeply. Think trunk.ly, it does one thing and one thing is what the user want to do and can afford (for time, competence or will) to  understand from a brand new service. A scenario like \"what happened in...\" or \"what my network tells about..\" or \"any event on...\"", "group_id": 3478, "id": 187548}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298478134.42589, "message": "yes, this would be possible. ES even implemented a percolator feature ... but I would like to offer a search. Maybe simply the UI of jetwick should be without noise ;)", "group_id": 3478, "id": 188365}, {"user_id": 14791, "stars": [], "topic_id": 8096, "date_created": 1298489312.0553069, "message": "I can desing a clean user friendly UI , if we just agree on the features and such things =)", "group_id": 3478, "id": 190186}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298491372.021827, "message": "@ilesmtz great", "group_id": 3478, "id": 190473}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298622200.363065, "message": "@ildella and there are also sites which look ugly and are user unfriendly (facebook) and tools with a complex UI and a vast feature set (research.ly) but still they have success ... I think it is all about marketing. be it money or mouth driven marketing ;)", "group_id": 3478, "id": 206581}, {"user_id": 14741, "stars": [], "topic_id": 8096, "date_created": 1298887106.328753, "message": "I was thinking about what I miss most in twitter, twitter search and web generally: something that finds events. The power of twitter search with some brain to identify events related twit, group them, make match against events site from plancast to eventful and so on... It's a search, list can be saved.", "group_id": 3478, "id": 224660}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298969001.643609, "message": "@ildella the more I think about it the more I like it :) But you should say 'hey app give me events for this search' otherwise it will bomb you with irrelevant things like my jetwot: http://twitter.com/#!/jetwot", "group_id": 3478, "id": 233233}, {"user_id": 10340, "stars": [], "topic_id": 8096, "date_created": 1298969121.800854, "message": "I would detect events either based on how many times a keyword is used in tweets (like 'trends') or based on retweets. But different searches will need a different border for those retweets. But this is all doable and would be fun to implement. Have you time? ;)", "group_id": 3478, "id": 233239}]