[{"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307732692.217485, "message": "http://t3c.ivanyv.com -- 10 años de éxito! Je, quisiera, más bien es una crónica de que no hacer.", "group_id": 965, "id": 1364537}, {"user_id": 12133, "stars": [], "topic_id": 38961, "date_created": 1307734457.7699511, "message": "chazzz me dejaste como capitulo de narutoshippuden con ganas de mas...", "group_id": 965, "id": 1364944}, {"user_id": 16337, "stars": [], "topic_id": 38961, "date_created": 1307735654.332515, "message": "seee... fue como una landing page.. \"more to come\" :P", "group_id": 965, "id": 1365213}, {"user_id": 3665, "stars": [], "topic_id": 38961, "date_created": 1307739594.0702, "message": "Oye @ivanyv una pregunta: ¿Cómo/en dónde conseguiste la BD de escuelas de todo México? Pasa que creo que necesitaré la BD de las Universidades de México y quizá las preparatorias también.", "group_id": 965, "id": 1365865}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307739281.156162, "message": "Sorry, es que se me hizo que ya estaba un poco largo lo que escribí y no quería aburrir", "group_id": 965, "id": 1365808}, {"user_id": 3665, "stars": [], "topic_id": 38961, "date_created": 1307739425.1531849, "message": "Si le sigues, no me aburro :P", "group_id": 965, "id": 1365837}, {"user_id": 3665, "stars": [], "topic_id": 38961, "date_created": 1307740063.945106, "message": "Ok, gracias! :D", "group_id": 965, "id": 1365966}, {"user_id": 13545, "stars": [{"date_created": 1307788424.2713799, "user_id": 12343}], "topic_id": 38961, "date_created": 1307739994.8385949, "message": "Al principio del proyecto era posible bajar una horrible base de datos directo de la SEP. Ahora tienes que usar esto: http://cct.sep.gob.mx/padron/external/workCenter/search/searchByNameOrKey.do?method=goInit", "group_id": 965, "id": 1365944}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307805420.7537, "message": "Estuve buscando a ver si tenia los archivos originales de esa BD, pero no... y de todas formas creo que nunca baje de las universidades.... si necesitas las preparatorias me avisas y vemos si podemos hacer algo", "group_id": 965, "id": 1370214}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307807248.9025021, "message": "Ya esta la continuación de la historia, espero no decepcionarlos :)", "group_id": 965, "id": 1370290}, {"user_id": 16337, "stars": [], "topic_id": 38961, "date_created": 1307809511.241174, "message": "mucho muy interesante tu historia, y si, creo que ser terco es parte indispensable de esto. ¿qué más nos puedes contar? debe haber algo más que compartir, entiendo que no tienes un socio ¿por qué no?", "group_id": 965, "id": 1370415}, {"user_id": 29866, "stars": [], "topic_id": 38961, "date_created": 1307826524.047646, "message": "Por otro lado, creo que tiene mucho potencial tu startup si cambiaras la experiencia del usuario. Algunas ideas serian pedirle al usuario desde el inicio que escoja su ciudad para que pueda ver todas las escuelas y niveles que hay, usar la API de Facebook y lograr que los usuarios digan que piensan de su escuela y crear una comunidad en torno a su propia escuela. Felicidades por la energía que tienes para emprender!", "group_id": 965, "id": 1371603}, {"user_id": 29866, "stars": [], "topic_id": 38961, "date_created": 1307826091.089802, "message": "Me gusta tu historia, es una historia de perseverancia. Sin embargo me doy cuenta de que \"EduPortal\" esta resolviendo un problema que la gente no ve como un problema y ese es que el usuario pueda \"comunicarse\" con su escuela y digo que no lo ve como un problema porque la Educación en México, desgraciadamente,  es un \"bien de lujo\" pocas personas creen que es la base de un verdadero cambio en nuestro país y pocas son los alumnos que \"consideran\" que su educación no es \"calidad\" y digo esto porque \"Nadie extraña lo que no conoce\" y es muy difícil que un alumno pueda entender que la calidad de su escuela es mediocre, ya que no tiene puntos de comparación. Dicho esto veo de poco sentido el \"Preguntas\" \"Quejas\" \"Cumplidos\" e \"Ideas\" en las fichas de las escuelas, porque los únicos que pueden hacer esto son los padres de familia y los alumnos. Se muy bien que se siente perder dinero en una idea, yo he perdido 30,000 USD en una Startup que inicie y en la que no puede continuar, pero he decido iniciar otra y aplicar los conocimientos adquiridos de ese fracaso para mejorar.", "group_id": 965, "id": 1371567}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307831945.369175, "message": "@chillicoder, espero poder seguir compartiendoles cosas interesantes. Respecto al socio, comparto un poco de porque fue eso en mi último post. Ahora no tengo socio porque simplemente no se ha presentado la oportunidad (y yo no la he buscado mucho), pero si me gustaria, en especial un buen diseñador para complementarnos. Ya veremos que depara el futuro", "group_id": 965, "id": 1372056}, {"user_id": 7524, "stars": [], "topic_id": 38961, "date_created": 1307829693.7154429, "message": "@ivanyv  Gracias por contarnos tus vivencias como emprendedor!! un par de consultas: Nunca hiciste un plan para delinear los caminos a seguir? Seguiste trabajando en otras cosas ademas del proyecto de Eduportal?", "group_id": 965, "id": 1371922}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307831876.179888, "message": "@josuegio estoy totalmente de acuerdo contigo, pero a la vez no :) en esta tercera iteración estoy tomando tus puntos en cuenta, y ya hablare más al respecto.", "group_id": 965, "id": 1372041}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1307832392.9085691, "message": "@juani así como un plan de negocios, no hice. Al principio de toda esta aventura si lo estaba haciendo, pero me estaba tardando más en planearlo que en hacer algo, así que lo mande por un tubo y simplemente inicie, dando tumbos aquí y allá por falta de una visión clara. Ahora si la tengo muy clara, y ya les estare platicando más.\n\nAdemás de este proyecto trabaje \"rentandome\" para otros, y también inicie algunas otras ideas mias, pero estaban mal encaminadas, así que ninguna dio frutos (casi siempre se debio a hacer algo por dinero principalmente).", "group_id": 965, "id": 1372089}, {"user_id": 2946, "stars": [], "topic_id": 38961, "date_created": 1308074554.587712, "message": "mmm por qué limitarse a escuelas de México? Ya viste que es un mercado muy limitado y lo sigues atacando? Por qué no resuelves un problema que pueda ayudar a las escuelas en una escala global?\n\nCuando era freelancer, me toco trabajar a dos o tres aplicaciones educativas y me pareció que les iba bastante bien. La educación es un buen mercado pero a escala global.", "group_id": 965, "id": 1392746}, {"user_id": 9432, "stars": [], "topic_id": 38961, "date_created": 1308098081.7041049, "message": "me encantó tu blog, escribir iteración por iteración aumenta el suspenso, creo que puedes hacer algo muy valioso si te rodeas de un buen equipo que te complemente y tape tus deficiencias. Yo estoy de acuerdo con @soska, tírale a lo grande hombre, te cuesta casi el mismo trabajo que no hacerlo.", "group_id": 965, "id": 1396226}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1308108603.975461, "message": "Gracias por sus comentarios. He considerado el mercado global para este vertical, pero creo que hay muchas diferencias en las necesidades de las escuelas de cada país. Claro que no se me escapa que existe la posibilidad de adaptarlo, pero eso lo evaluaría a su momento. De cualquier forma, con esta tercer iteración estoy creando una plataforma para algo más grande, pero eso lo iré revelando a su debido tiempo. De nuevo, gracias por sus comentarios, a lo mucho crei que iba a tener dos o tres lectores :)", "group_id": 965, "id": 1397341}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1308365479.492204, "message": "Les pido un favor. Podría alguien dejar algún comentario de prueba en cualquiera de mis entradas? Quiero ver si recibo notificación, si no para cambiar a Disqus.", "group_id": 965, "id": 1424566}, {"user_id": 24160, "stars": [], "topic_id": 38961, "date_created": 1308375760.3971009, "message": "@ivanyv Test :)", "group_id": 965, "id": 1425158}, {"user_id": 13545, "stars": [], "topic_id": 38961, "date_created": 1308409359.6052301, "message": "Je, quise decir en el blog :) pero ya revise y alguien ya había dejado un comentario, y no recibí notificación, así que cambiare a Disqus.", "group_id": 965, "id": 1427043}]