[{"user_id": 11626, "stars": [], "topic_id": 6281, "date_created": 1297835436.2670109, "message": "There is a substantial amount of controversy resulting from last week’s intelligence testimony and a lot of it has to do with conflicts in cyber space.  Arguably the following were the top three areas of greatest concern that was discussed during the hearing.\r\n\r\n    * James Clapper, DNI Chief, warned that the cyber warfare facing the U.S. is increasing in scope and scale and its impact was difficult to “overstate.” Given the U.S. has the greatest dependency on Internet infrastructure for many aspects of business, government and social interaction this is a critical vulnerability that must be addressed through cooperation of the government, military, intelligence community and the private sector.\r\n    * Jurisdictional issues continue to surround the response to cyber attacks impacting the private sector, government, intelligence and DoD. Given that at the onset of an attack or discovery of a breach you don’t know who was behind the act of cyber aggression, under the government’s current structure you don’t know who is in charge\r\n    * CIA Chief Leon Panetta stated that the Internet is “the battleground of the future” that the United States must be prepared to win. This is the battleground of today! It is difficult to pick up a defense or intelligence publication that does not cover an act of cyber aggression so we should address this threat now!\r\n\r\nSo what’s new? NOTHING! These three areas have been on the radar of defense and intelligence organizations as well as cyber adversaries for years. There are those that insist there are not threats emanating from cyber space and it appears they are winning the war of words. It is deeply concerning that our leaders in the government have not heeded the warnings from our military and intelligence leaders. It is equally concerning that the private sector has not addressed these threats to the nation before now. Many believe it will take a “Cyber Pearl Harbor” before the threat will truly be taken seriously. We should all hope they are wrong!\r\n\r\nhttp://defensetech.org/2011/02/14/congressional-hearing-on-intelligence", "group_id": 3920, "id": 117915}, {"user_id": 11626, "stars": [], "topic_id": 6281, "date_created": 1297835454.358603, "message": "Why does the title, \"Congressional Hearing on Intelligence,\" strike me as funny?", "group_id": 3920, "id": 117916}]