[{"user_id": 11626, "stars": [], "topic_id": 6631, "date_created": 1297899168.883985, "message": "South Korean police have found evidence that Google illegally collected private data while producing its Street View mapping service, a report said Thursday, amid similar claims elsewhere in the world.\r\n\r\nYonhap news agency said the police's cyber crime unit had decoded data stored on hard disks used for Google Street View and found evidence of illegal gathering of private information.\r\n\r\nStreet View allows users to see panoramic street scenes on the Google Maps site.\r\n\r\nThere have been claims in several countries that while compiling the images, Google violated home-owners' private Wi-Fi Internet connections.\r\n\r\n\"We've discovered records and contents of e-mails and online messenger chats individuals exchanged through Wi-Fi networks,\" said a South Korean police official quoted by Yonhap.\r\n\r\nAround 10 Google employees in South Korea and the United States said during the South Korean probe that they had no knowledge of what had been collected, the report said.\r\n\r\nA police agency spokesman confirmed the report but refused to give details.\r\n\r\nGoogle said Thursday it was \"profoundly sorry for having mistakenly collected\" personal data, saying it was cooperating with Seoul's telecommunication authorities and the police.\r\n\r\n\"Our ultimate objective remains to delete the data consistent with our legal obligations and in consultation with the appropriate authorities,\" the company said in a statement.\r\n\r\nPolice investigations have also taken place in the United States, Germany and Italy.\r\n\r\nGoogle has admitted its Street View cars, which have been cruising and taking photographs of cities in over 30 countries, inadvertently gathered fragments of personal data sent over unsecured Wi-Fi systems.\r\n\r\nGoogle agreed last November to delete private emails and passwords mistakenly picked up from wireless networks in Britain by its Street View cars.\r\n\r\nIt has also agreed to improve the way it trains staff on data protection issues as it seeks to manage the global row.\r\n\r\nhttp://www.spacemart.com/reports/Google_illegally_gathered_data_in_SKorea_police_999.html", "group_id": 3920, "id": 126464}]