[{"user_id": 8195, "stars": [{"date_created": 1304691769.461216, "user_id": 4149}], "topic_id": 33992, "date_created": 1304684955.761575, "message": "Do you have any plans about sell-able product to integrate into existing third party applications? I'm working on SaS product that will be internal platform and would love to provide convore functionality. Is there any roadmap plans to have it as integrable system? :)", "group_id": 88, "id": 941420}, {"user_id": 18485, "stars": [], "topic_id": 33992, "date_created": 1304690151.843219, "message": "I would like to be able to embed convore groups in my websites. Adding embedding should also help get the word out about convore. IMO we need to grow this puppy! She's ready to roll.", "group_id": 88, "id": 942186}, {"user_id": 4149, "stars": [], "topic_id": 33992, "date_created": 1304692040.339282, "message": "But I think @edvinas want a full convore server for him self which would be cool", "group_id": 88, "id": 942442}, {"user_id": 18485, "stars": [], "topic_id": 33992, "date_created": 1304692324.4541409, "message": "@italiano40 yes, but would it not be nice to have embed code available for public groups so interested parties could just copy and paste into their blog or website? I'm talking about average Internet users not programmers. As far as being beta convore may be but it works well for bata and IMO needs a lot more members to survive past that.", "group_id": 88, "id": 942473}, {"user_id": 4149, "stars": [], "topic_id": 33992, "date_created": 1304691912.598491, "message": "@craigshipp you both know there is full API that could allow you to ingrate with your site and for \"she's ready to roll\" well convore is great but growing a community like this into huge amounts of user idk about that this is still considered beta so yea not so much ready to roll", "group_id": 88, "id": 942424}, {"user_id": 8195, "stars": [{"date_created": 1304696479.1719251, "user_id": 18485}], "topic_id": 33992, "date_created": 1304694363.1840439, "message": "Having embeddable Convore would be cool tool. That is something what Google Wave wanted to have, waves all over the internet :)\n\nDefinitely, there are sites that want to have such a tool.", "group_id": 88, "id": 942675}, {"user_id": 8195, "stars": [], "topic_id": 33992, "date_created": 1304694717.521513, "message": "My perspective is little bit different but at the same time it is familiar.\nAs for my projects I want to add forum for my built community\nor I want to provide guest book to get feedback from community\nI would love to have convore where I could tell Convore that these are my users and please allow them to chat. I would embed their script and Convore chat will appear in my web application.\n\nthis is like outsourcing chat functionality to third party to get service that is maintainable and great usability for chatting :)", "group_id": 88, "id": 942714}, {"user_id": 18485, "stars": [], "topic_id": 33992, "date_created": 1304696417.361798, "message": "@edvinas so, creating a public group and then embedding it in your website would not serve your needs because you wanted to limit access to your users? How about a private group with an import tool to import your current users?", "group_id": 88, "id": 943063}, {"user_id": 4149, "stars": [], "topic_id": 33992, "date_created": 1304703195.2347269, "message": "I see where embedding is cool and stuff but there is pently of things that need to be corrected before embedding and this very beta it feels beta deep down, maybe I see it from a programmer's view but yea it is beta", "group_id": 88, "id": 944291}, {"user_id": 4149, "stars": [], "topic_id": 33992, "date_created": 1304703294.786469, "message": "And for it surviving I don't think that is a probably LOL I seen groups that only had about 50 members a month go to shot up to 1000's no shortages of members that I can see", "group_id": 88, "id": 944304}, {"user_id": 4149, "stars": [], "topic_id": 33992, "date_created": 1304703381.99962, "message": "@craigshipp it is better if you can get your own roll it your self convore server too much work of importing users from different sites and a waste of time if you ask me", "group_id": 88, "id": 944320}]