[{"user_id": 11039, "stars": [], "topic_id": 10895, "date_created": 1299275177.9661739, "message": "There are people who still buy strategy guides in this day and age of Internet access omnipresence? I can't blame Steam for selling them, but I can look askance at you for buying one when you can learn everything in one in under a minute of Googling with far less danger or being out of rev.", "group_id": 2186, "id": 273250}, {"user_id": 7352, "stars": [], "topic_id": 10895, "date_created": 1299273833.069591, "message": "I purchased the Prima R.U.S.E. Official Strategy Guide thinking it was a PDF that I could download and print out. But no! Purchasing that just allowed me to access an online strategy guide that can be viewed only one page at a time. Impossible to easily print out for reading on the train during my commute", "group_id": 2186, "id": 272938}, {"user_id": 7352, "stars": [], "topic_id": 10895, "date_created": 1299320354.0607569, "message": "Yeah. I guess you're right.", "group_id": 2186, "id": 275881}, {"user_id": 30666, "stars": [], "topic_id": 10895, "date_created": 1303501641.6225269, "message": "He said download and print out(or put on a device), not all of us have internet @ all times, many commutes involve sections of no or slow internet. It's unfortunate most \"purchases\" really mean \"rent\" or purchasing access rights.", "group_id": 2186, "id": 784374}, {"user_id": 11039, "stars": [], "topic_id": 10895, "date_created": 1303669809.3324571, "message": "@zer0her0 We'll leave aside the issue of what you need a strategy guide for a game which requires online access to play when you don't have online access for a later time. Right now we'll simply pick up the fact that there are disturbingly large number of services which exist to do nothing but download websites and convert them to PDFs or RTFs for mobile, portable access, if you spend the requisite ten minutes digging around looking for one. Which is a lot more reasonable use of one's expensive, valuable time than earning the money it costs for a static, soon-to-be outdated guide.\n\nI'd argue that if you've dropped $60 on a game with online activation and you're interested enough to look for a \"strategy guide,\" then you probably have a smartphone with a minimal data plan that allows access to web browsing, or you can afford to spend the aforementioned requisite ten minutes looking for a way to make your research portable on whatever device you own, even if it's paper as retrogressive and bulky as that may be. If those things both exceed you then you probably won't get much out of asking someone else how to play a game, anyway.", "group_id": 2186, "id": 795991}, {"user_id": 30666, "stars": [], "topic_id": 10895, "date_created": 1303745098.5598259, "message": "@SquidLord did you not read what I wrote before you wrote 2 paragraphs? I'm not defending the selling of guides, but what i'm arguing about is more and more content is solely online, no PDF/ePub format available even though it would be easy and nice if the company offered it on content that has been paid for. As for your \"argument\" I'll bite & argue: 1) that you don't travel much(either long distance or commuter) and 2) you're time is not so valuable as you're willing to spend the time searching and converting content.", "group_id": 2186, "id": 804285}, {"user_id": 11039, "stars": [], "topic_id": 10895, "date_created": 1303801715.1681449, "message": "@zer0her0 Why, exactly, should they offer a different form of content for something already purchased? Aside from \"I want it,\" which is my favourite reason but I'm reliably informed its probably arrogant to assume its motivating. \n\nI consider my time valuable enough that dropping 10min on figuring out a way to convert a free source of info into ePub or PDF is a *lot* cheaper than the $10 charges for their RUSE Strategy Guide. Not to mention useful for a number of other purposes than the one. Call me cheap, call me parsimonious, call me Ishmael, but it seems to me the alternative makes you look like kind of a dim bulb, especially in light of the fact that the info in the Prima Guides is outdated about a week after they're released. \n\nWhat I'm saying is that popping for a strategy guide is about ten years out of sensible logic and that was $10 better spent on six sliders from Steak & Shake for anyone paying attention. And that's very much being aware that I spend a lot of time reading material from my tablet and smartphone. (In fact, you'd think that spending more time traveling and using your mobile device for reading would encourage you to be more aware of ways to get media onto them. I apologize for assuming you might want to leverage such awareness, @zer0her0. You're right; I should never assume active cognizance. My apologies.)", "group_id": 2186, "id": 811298}, {"user_id": 30666, "stars": [{"date_created": 1304032498.227684, "user_id": 3399}], "topic_id": 10895, "date_created": 1303881552.350606, "message": "@SquidLord Why should they? They should provide something in a form that is often requested from paying customers, there's a novel concept of a why. But don't let economic/business models get in the way of running a business, the **AA's have proven that's not needed anymore. I really wonder if you think I'm the one that started the thread, or stated I bought a strategy guide, I've done neither, I was simply agreeing w/ the OP and stating I'm not happy w/ the current trend of digital content being released as online only content, generally in a way that is hard to make into offline content. Not to worry @SquidLord you shouldn't assume that and I'll assume one's reading comprehension isn't above grade school, and I think we'd both be better off.", "group_id": 2186, "id": 822206}]