[{"user_id": 4009, "stars": [], "topic_id": 22017, "date_created": 1304086802.215405, "message": "I have an action that will take 5 to 10 seconds to execute. What is the best way show an intermediate page telling the user to please wait, that returns as soon as the long task has completed. DelayedJob seems like over kill for this.", "group_id": 4606, "id": 856815}, {"user_id": 13919, "stars": [], "topic_id": 22017, "date_created": 1304094105.2986281, "message": "I'd love some other opinions on this though, since I've got an offline tasks tab in one of my current apps that polls a set of ongoing jobs for status changes and think my implementation could probably be improved.", "group_id": 4606, "id": 859253}, {"user_id": 13919, "stars": [], "topic_id": 22017, "date_created": 1304093650.960861, "message": "Good question @x0nic! If the request doesn't exceed your timeout you could load the page and then perform the actual request using an XHR request within the page. If the jobs were going to be longer you could instead use some sort of polling which requested the status of a job from a server at regular intervals.", "group_id": 4606, "id": 859098}, {"user_id": 21845, "stars": [], "topic_id": 22017, "date_created": 1304519079.3870749, "message": "The polling trick can cause a bit of a problem - especially in a high load situation.  Consider: Your application gets busy doing it's business logic (and by extension slower).  So the client has to poll more often.  This polling by the client introduces more load that server has to deal with.  This slows down the application more.  That said, I think that for small apps polling really isn't much of a problem.  For big apps, I'd suspect the trick is a combination of scaling out plus some sort of ESB/Messaging approach.", "group_id": 4606, "id": 913351}, {"user_id": 21842, "stars": [], "topic_id": 22017, "date_created": 1304520994.213449, "message": "Would there be some way of connecting in a node.js backend to handle this?", "group_id": 4606, "id": 913694}, {"user_id": 13919, "stars": [], "topic_id": 22017, "date_created": 1304522387.5836129, "message": "I've used Socket.IO with node and JS, but I'm not sure the best way to integrate it with Rails. One option would be to use SocketIO-rack, but I haven't used it myself (https://github.com/markjeee/Socket.IO-rack). Another would be to use something like redis to communicate between a Rails and nodejs stack. Redis queues are easy to monitor asynchronously from node and Ruby.", "group_id": 4606, "id": 913996}, {"user_id": 4009, "stars": [], "topic_id": 22017, "date_created": 1304525610.5259449, "message": "Currently this app is quite small. Adding a backend rack app would be overkill. Its something ill definitely have to worry about doing once i get any sort of traffic. For now though, all I am really concerned with is how to present this on the UI side. Ideally some sort of long polling request.", "group_id": 4606, "id": 915045}, {"user_id": 21814, "stars": [{"date_created": 1304654854.0599411, "user_id": 4009}, {"date_created": 1304657434.3694429, "user_id": 13919}], "topic_id": 22017, "date_created": 1304636238.419173, "message": "You could hook up a background process and drop in a push notification with Faye. http://railscasts.com/episodes/260-messaging-with-faye", "group_id": 4606, "id": 935339}, {"user_id": 4009, "stars": [], "topic_id": 22017, "date_created": 1304654999.3882301, "message": "@chrisyour I like that. Faye would probably work for what I need to do. The one thing that does concern me a little is the dependency on node.js. Just because it makes deployment and managing all environments more work.", "group_id": 4606, "id": 938079}, {"user_id": 13919, "stars": [], "topic_id": 22017, "date_created": 1304657494.1524451, "message": "@chrisyour I haven't seen Faye before. Will need to check that out!", "group_id": 4606, "id": 938372}, {"user_id": 2633, "stars": [], "topic_id": 22017, "date_created": 1304658301.984565, "message": "For all your notification needs. http://pusher.com/", "group_id": 4606, "id": 938522}, {"user_id": 21814, "stars": [], "topic_id": 22017, "date_created": 1304707549.446312, "message": "You have the option to run Faye on a Ruby server rather than on Node.js. Ryan talks about it in his screencast.", "group_id": 4606, "id": 944834}, {"user_id": 34207, "stars": [], "topic_id": 22017, "date_created": 1306289265.2141781, "message": "adfasdfadfa", "group_id": 4606, "id": 1172929}]