[{"user_id": 11626, "stars": [], "topic_id": 7424, "date_created": 1298092822.0142879, "message": "http://www.thenation.com/images/media/doc/b24/1226600720-large.jpg\r\n\r\nThe astonishing election of 2008 is over. Whatever else the future holds, the unchallenged domination of American national government by big business and the political right has been broken. Even more amazing, Americans have elected an African-American as president. These facts alone are rightful cause for jubilation.\r\n\r\nNaturally, people are making lists of what the new administration should do to begin to reverse the decades-long trends toward rising inequality, unrestrained corporate plunder, ecological disaster, military adventurism and constricted democracy. But if naming our favored policies is the main thing we do, we are headed for a terrible letdown. Let's face it: Barack Obama is not a visionary or even a movement leader. He became the nominee of the Democratic Party, and then went on to win the general election, because he is a skillful politician. That means he will calculate whom he has to conciliate and whom he can ignore in realms dominated by big-money contributors from Wall Street, powerful business lobbyists and a Congress that includes conservative Blue Dog and Wall Street-oriented Democrats. I don't say this to disparage Obama. It is simply the way it is, and if Obama was not the centrist and conciliator he is, he would not have come this far this fast, and he would not be the president-elect.\r\n\r\nStill, the conditions that influence politicians can change. The promises and hopes generated by election campaigns sometimes help to raise hopes and set democratic forces in motion that break the grip of politics as usual. I don't mean that the Obama campaign operation is likely to be transformed into a continuing movement for reform. A campaign mobilization is almost surely too flimsy and too dependent on the candidate to generate the weighty pressures that can hold politicians accountable. Still, the soaring rhetoric of the campaign; the slogans like \"We are the ones we have been waiting for\"; the huge, young and enthusiastic crowds--all this generates hope, and hope fuels activism among people who otherwise accept politics as usual.\r\n\r\nSometimes, encouraged by electoral shifts and campaign promises, the ordinary people who are typically given short shrift in political calculation become volatile and unruly, impatient with the same old promises and ruses, and they refuse to cooperate in the institutional routines that depend on their cooperation. When that happens, their issues acquire a white-hot urgency, and politicians have to respond, because they are politicians. In other words, the disorder, stoppages and institutional breakdowns generated by this sort of collective action threaten politicians. These periods of mass defiance are unnerving, and many authoritative voices are even now pointing to the dangers of pushing the Obama administration too hard and too far. Yet these are also the moments when ordinary people enter into the political life of the country and authentic bottom-up reform becomes possible.\r\n\r\nThe parallels between the election of 2008 and the election of 1932 are often invoked, with good reason. It is not just that Obama's oratory is reminiscent of FDR's oratory, or that both men were brought into office as a result of big electoral shifts, or that both took power at a moment of economic catastrophe. All this is true, of course. But I want to make a different point: FDR became a great president because the mass protests among the unemployed, the aged, farmers and workers forced him to make choices he would otherwise have avoided. He did not set out to initiate big new policies. The Democratic platform of 1932 was not much different from that of 1924 or 1928. But the rise of protest movements forced the new president and the Democratic Congress to become bold reformers.\r\n\r\nThe movements of the 1930s were often set in motion by radical agitators--Communists, Socialists, Musteites--but they were fueled by desperation and economic calamity. Unemployment demonstrations, usually (and often not without reason) labeled riots by the press, began in 1929 and 1930, as crowds assembled, raised demands for \"bread or wages,\" and then marched on City Hall or local relief offices. In some places, \"bread riots\" broke out as crowds of the unemployed marched on storekeepers to demand food, or simply to take it.\r\n\r\nIn the big cities, mobs used strong-arm tactics to resist the rising numbers of evictions. In Harlem and on the Lower East Side, crowds numbering in the thousands gathered to restore evicted families to their homes. In Chicago, small groups of black activists marched through the streets of the ghetto to mobilize the large crowds that would reinstall evicted families. A rent riot there left three people dead and three policemen injured in August 1931, but Mayor Anton Cermak ordered a moratorium on evictions, and some of the rioters got work relief. Later, in the summer of 1932, Cermak told a House committee that if the federal government didn't send $150 million for relief immediately, it should be prepared to send troops later. Even in Mississippi, Governor Theodore Bilbo told an interviewer, \"Folks are restless. Communism is gaining a foothold. Right here in Mississippi, some people are about ready to lead a mob. In fact, I'm getting a little pink myself.\" Meanwhile, also in the summer of 1932, farmers across the country armed themselves with pitchforks and clubs to prevent the delivery of farm products to markets where the price paid frequently did not cover the cost of production.\r\n\r\nNotwithstanding the traditional and conservative platform of the Democratic Party, FDR's campaign in 1932 registered these disturbances in new promises to \"build from the bottom up and not from the top down, that put...faith once more in the forgotten man at the bottom of the economic pyramid.\" Economic conditions worsened in the interim between the election and the inauguration, and the clamor for federal action became more strident. Within weeks, Roosevelt had submitted legislation to Congress for public works spending, massive emergency relief to be implemented by states and localities, agricultural assistance and an (ultimately unsuccessful) scheme for industrial recovery.\r\n\r\nThe unruly protests continued, and in many places they were crucial in pressuring reluctant state and local officials to implement the federally initiated aid programs. Then, beginning in 1933, industrial workers inspired by the rhetorical promises of the new administration began to demand the right to organize. By the mid-1930s, mass strikes were a threat to economic recovery and to the Democratic voting majorities that had put FDR in office. A pro-union labor policy was far from Roosevelt's mind when he took office in 1933. But by 1935, with strikes escalating and the election of 1936 approaching, he was ready to sign the National Labor Relations Act.\r\n\r\nObama's campaign speeches emphasized the theme of a unified America where divisions bred by race or party are no longer important. But America is, in fact, divided: by race, by party, by class. And these divisions will matter greatly as we grapple with the whirlwind of financial and economic crises, of prospective ecological calamity, of generational and political change, of widening fissures in the American empire. I, for one, do not have a blueprint for the future. Maybe we are truly on the cusp of a new world order, and maybe it will be a better, more humane order. In the meantime, however, our government will move on particular policies to confront the immediate crisis. Whether most Americans will have an effective voice in these policies will depend on whether we tap our usually hidden source of power, our ability to refuse to cooperate on the terms imposed from above.\r\n\r\nhttp://www.thenation.com/article/obama-needs-protest-movement", "group_id": 3920, "id": 148890}]