[{"user_id": 11626, "stars": [], "topic_id": 44657, "date_created": 1314689041.225657, "message": "TECHNOLOGY TUESDAY 8/30/11\r\n\r\nWecome to the \"Technology Tuesday\" edition of SCMLA's newsletter!\r\n\r\nMerry-Glow-Round: Theme Park Built In A Nuclear Reactor Promises A Fun-Fuelled Day\r\nDaily Mail\r\nAugust 29, 2011\r\n\r\nThese extraordinary images show what could be the world’s most bizarre theme park – built around an abandoned nuclear power station. Wunderland near Kalkar, Germany, cleverly combines a never-been-used multi-million-pound reactor with classic fair rides, including a merry-go-round, Ferris wheel, carousel and log flume. A swing ride has even been fitted inside the old cooling tower, while a 130ft-high climbing wall features on the outside. When it was originally built in 1972 the construction – dubbed the SNR-300 – was destined to be the world’s most technologically advanced nuclear power plant and Germany’s first fast breeder nuclear reactor.\r\nhttp://www.dailymail.co.uk/news/article-2029137/Wunderland-theme-park-built-nuclear-reactor-promises-fun-fuelled-day.html\r\n\r\nWeird, Birdlike Mystery Drone Crashes in Pakistan\r\nDangerRoom (via Wired.com)\r\nAugust 29, 2011\r\n\r\nIt looks a bit like silver bird. It probably was used to spy on insurgents. And now it’s in the hands of the Pakistanis. WIRED editor-in-chief Chris Anderson flags pictures of an unusual, unfamiliar drone that reportedly crashed crashed over southwestern Pakistan late last week. It’s a surveillance drone, with a camera attached — recovered from the crash but not apparently visible in this photo — rather than the larger, deathly flying robots that shoot missiles. This one looks tiny, with a wingspan not much longer than a man’s outstretched arms, and clearly light enough for a grown man to carry. The Pakistani Frontier Corps in Baluchistan province recovered the drone. And they confidently declare it to be an “American surveillance unmanned aerial vehicle.” But as Anderson points out, it doesn’t look like anything the U.S. flies — or at least acknowledges flying. What’s the deal?\r\nhttp://www.wired.com/dangerroom/2011/08/weird-birdlike-mystery-drone-crashes-in-pakistan\r\n\r\nUFO Sightings Increase 67 Percent In 3 Years, History Channel Investigates Unexplained Aerial Phenomena\r\nHuffington Post\r\nAugust 28, 2011\r\n\r\nUnemployment, gas prices, and fear over global warming aren’t the only things skyrocketing — so are mysterious objects rocketing through the sky. The Mutual UFO Network — the largest privately funded UFO research organization in the world — tells The Huffington Post that more people than ever are reporting unidentified flying objects, mostly in the United States and Canada. “Over the past year, we’ve been averaging 500 sighting reports a month, compared to about 300 three years ago [67 percent],” MUFON international director Clifford Clift said. “And I get one or two production companies contacting me every week, wanting to do stories on UFOs.” So far this week, mysterious aerial lights in Laredo, Texas, and Kansas City, MO., lived up to, at least initially, the strict definition of UFOs, namely “Unidentified” Flying Objects. That, of course, doesn’t mean that little green men are watching us. It’s generally accepted that 95 percent of all sightings are easily dismissed. Some turn out to be conventional aircraft, others are satellites or weather balloons — and then there are the hoaxers with Photoshopped concoctions. In the case of the Kansas City sighting, the UFOs turned out to be the Army Golden Knights parachuting team, performing a nighttime jump. But the explanation for the blinking light over Laredo is still up for grabs. However, the remaining 5 percent of all UFO reports aren’t as easily explained. And many of them are reported by commercial and military pilots. These were examined on Secret Access: UFOs On The Record, a new History Channel documentary that premiered on Thursday.\r\nhttp://www.huffingtonpost.com/2011/08/26/ufos-pilots-history-channel_n_935847.html\r\n\r\nCanada Seeks Stealthy Snowmobile, For No Good Reason\r\nDangerRoom (via Wired.com)\r\n August 26, 2011\r\n\r\nThe Canadian government wants a stealth snowmobile. Just, apparently, because. It’s not as if Canada has any alpine enemies to sneak up on with shadowy, frigid cavalry. But that’s not going to stop the Canadian Department of National Defence from spending a half million dollars on a prototype. The secret to the intended stealth capabilities of the snowmobile: a hybrid engine and a quieter electric motor. According to a solicitation from the department, the vehicle has to be able to travel 15 kilometers in its electric mode at an average speed of 20 kilometers per hour. Alas, hybrid snowmobiles aren’t commercially available yet, but the department wants a prototype model by March 31.\r\nhttp://www.wired.com/dangerroom/2011/08/canada-seeks-stealthy-snowmobile-for-no-good-reason\r\n\r\nFukushima caesium leaks ‘equal 168 Hiroshimas’\r\nLondon Telegraph\r\nAugust 25, 2011\r\n\r\nJapan’s government estimates the amount of radioactive caesium-137 released by the Fukushima nuclear disaster so far is equal to that of 168 Hiroshima bombs. Government nuclear experts, however, said the World War II bomb blast and the accidental reactor meltdowns at Fukushima, which has seen ongoing radiation leaks but no deaths so far, were beyond comparison. The amount of caesium-137 released since the three reactors were crippled by the March 11 quake and tsunami has been estimated at 15,000 tera becquerels, the Tokyo Shimbun reported, quoting a government calculation. That compares with the 89 tera becquerels released by “Little Boy”, the uranium bomb the United States dropped on the western Japanese city in the final days of World War II, the report said. The estimate was submitted by Prime Minister Naoto Kan’s cabinet to a lower house committee on promotion of technology and innovation, the daily said.\r\nhttp://www.telegraph.co.uk/news/worldnews/asia/japan/8722400/Fukushima-caesium-leaks-equal-168-Hiroshimas.html\r\n\r\nPentagon Isn’t Sweating China’s New Weapons of Doom\r\nDangerRoom (via Wired.com)\r\nAugust 24, 2011\r\n\r\nWhile China’s new mega-missile, aircraft carrier and stealth fighter have made for pants-pooping media panic, the Pentagon is affecting the blase posture of the Brooklyn hipste “There’s nothing particularly magical about any one particular item,” Deputy Assistant Secretary of Defense for Asia Michael Schiffer told reporters in a Wednesday briefing. And key sections of the report verge on the passive aggressive. The ultimate Chinese goal is a “regionally focused” military, (.pdf) not one that challenges the United States everywhere around the planet. ”China has made less progress on capabilities that extend global reach or power projection,” the report, released Wednesday, reads. “Outside of peacetime counter-piracy missions, for example, China’s Navy has little operational experience beyond regional waters.” Apparently, it takes more than new stealth jets, early-stage missiles and a souped-up Ukrainian carrier to get a rise out of the U.S. military.\r\nhttp://www.wired.com/dangerroom/2011/08/chinas-new-weapons-of-doom\r\n\r\nTongue-Tied Troops Can Dial a Translator for War-Zone Chats\r\nDangerRoom (via Wired.com)\r\nAugust 24, 2011\r\n\r\nIt’s been almost a decade since the United States began its wars in countries that most Americans can’t find on a map, let alone understand the native language. The military’s tried nearly everything to get around its language barriers, from spending big bucks trying to ape Star Trek’s Universal Translator to hiring expensive contractors who speak Arabic, Pashto and Dari. One defense giant thinks it’s got a better idea: war-zone conference calling. Lockheed Martin is rolling out a Dial-a-Translator system it calls LinGO Link. The gist of it is that troops needing to talk to locals in real time can call into a “bank of interpreters” that the company will maintain somewhere near the front lines. Using a specialized smartphone operating on a proprietary data network, a soldier using LinGO Link would dial himself and his local interlocutor into the call center so a native speaker can translate. “LinGo Link serves as a force multiplier by allowing interpreters, skilled in multiple languages and dialects, to be used in different areas without the need to be physically present at each location,” promises Lockheed in a statement rolling out the new service. All of which sounds fine. Except that LinGO Link is only going to be as good as the translators who work in the call center, and as powerful as the broadband that can let troops call in to have their conversations relayed. Everyone who’s been on a conference call knows how annoying it can be even in your native language. Setting up a three-way call in order to speak with someone you’re standing in the same room with could easily become a frustrating game of telephone — except this one could potentially be a life-or-death situation.\r\nhttp://www.wired.com/dangerroom/2011/08/dial-a-translator\r\n\r\nLibyan Rebels Are Flying Their Own Minidrone\r\nDangerRoom (via Wired.com)\r\nAugust 23, 2011\r\n \r\nThe Libyan revolutionaries are more of a band of enthusiastic amateurs than experienced soldiers. But it turns out the rebels have the kind of weaponry usually possessed by advanced militaries: their very own drone. Aeryon Labs, a Canadian defense firm, revealed on Tuesday that it had quietly provided the rebel forces with a teeny, tiny surveillance drone, called the Aeryon Scout. Small enough to fit into a backpack, the 3-pound, four-rotor robot gave Libyan forces eyes in the sky independent of the Predators, Fire Scout surveillance copters and manned spy planes that NATO flew overhead. Don’t worry, it’s not armed. So far, the rebels have just one Scout among them, according to Marni McVicar, Aeryon’s vice president for business development. Working with a Canadian private security company called Zariba, Aeryon delivered the Scout “several weeks” ago to rebels in the Western port city of Misurata who used it, according to McVicar, to hasten their surprisingly rapid march to Tripoli. The rebels needed barely a day of training to use a technology that many national armies would love to acquire. “We like to joke that it’s designed for people who are not that bright, have fat fingers and break things,” McVicar told Danger Room in a phone interview.\r\nhttp://www.wired.com/dangerroom/2011/08/libyan-rebels-are-flying-their-own-mini-drone\r\n\r\n‘Stealth’ warships to test China’s nerve\r\nAustralian\r\nAugust 22, 2011\r\n\r\nTHE US is deploying a new generation of high-speed stealth warships to the disputed waters of the South China Sea, in a move that is bound to raise tensions with Beijing. The vessels, which cost $US440 million ($422m) each, will be deployed in the shipping lanes between Hong Kong and Singapore, where four nations are at odds with China over who owns vast areas of ocean rich in oil and gas. The ships are designed to fight in shallow waters. They carry three helicopters and special forces units with armoured vehicles that can roll off a ramp into action, while fast gunboats can be launched from the stern. The latest version, built by General Dynamics, is an aluminium-hulled trimaran, the USS Independence. Launched last year, it is protected by Mk 110 57mm guns made by BAE Systems, plus missiles for air, land and underwater targets. The warships’ sleek silhouettes reflect their stealth technology, while the stable trimaran design suits the South China Sea, which is swept by typhoons every summer.\r\nhttp://www.theaustralian.com.au/news/world/stealth-warships-to-test-chinas-nerve/story-e6frg6so-1226119196472\r\n\r\nU.S. Spies Totally Confused by Wall Street, Too\r\nDangerRoom (via Wired.com)\r\nAugust 22, 2011\r\n\r\nIn the last few weeks the stock market has gone ballistic, with the Dow Jones Industrial Average swinging up and down by 400 points seemingly every day. Top-notch economists are scratching their heads; Wall Street traders are hysterical. Even the U.S. intelligence community is flummoxed. So those spies have decided to take matters — or markets — into their own hands. Iarpa, the intelligence community’s way-out research division, thinks it can make sense of the stock market. But first, it needs some help. At a recent conference, Iarpa introduced a new program to develop tools to help analysts “quickly and accurately assess petabytes of complex anonymized financial data.”\r\nhttp://www.wired.com/dangerroom/2011/08/spies-confused-by-wall-street\r\n\r\nTiny Pocketbots Prepped for Combat\r\nDangerRoom (via Wired.com)\r\n August 19, 2011\r\n\r\nWhen the U.S. military first got serious about ground robots, it bought up a bunch of 42-pound machines called PackBots. The name implied that infantrymen would just throw the robots in their rucksacks. In reality, the things were too heavy for already-overloaded troops to carry around on the regular. The PackBot’s main competitor, the Talon, was even more of a burden. It weighed a whopping 125 pounds. Now, there’s a new wave of reconnaissance bots being prepared for combat. And they are radically smaller than the previous generation; the tiniest of them weighs less than a pound-and-a-half. Which means they’ll not only fit inside a backpack, they might even squeeze inside a jacket or a pair of pants. Call them pocketbots. Both the U.S. Army and Marine Corps are expected shortly to issue “urgent” battlefield requests for 3,500 to 5,000 of the micro machines. The idea that these new models can be tossed into a building or over a wall, allowing an infantryman to get a sense of what’s inside a room before he kicks down the door. Three different bot-makers showed off their pocketbot models at the Association for Unmanned Vehicle Systems International conference in Washington this week. If they work as advertised, they could be the next big leap forward for military robotics. Ground robots were originally issued to a specialized few, like explosive ordnance disposal technicians. That eventually grew to an unmanned force that’s now 2,000 strong in Afghanistan. These machines are so small, the military could potentially expand the robotic army even further. “We can provide this capability to every soldier on the battlefield,” says retired Navy Captain Robert L. Moses. He’s an executive with iRobot, maker of the original PackBot — and a new, nine-inch “throwable” machine.\r\nhttp://www.wired.com/dangerroom/2011/08/pocketbots\r\n\r\nTwo Targets, One Bullet: How the Ultimate Sniper Rifle Was Made\r\nDangerRoom (via Wired.com)\r\nAugust 18, 2011\r\n\r\nIn 2007, when the Navy SEALs went looking for an alternative to the Barrett weapons system it already used — an ultra-high-caliber rifle capable of firing .5-inch cartridges at distances beyond 1,200 meters — it talked to the best weapons manufacturers across the globe. Eventually it contacted a small company with 50 employees, who, it had heard, could make a weapon suitable for its tactical and operational demands. It didn’t buy American; it skirted around the excellence of German and Scandinavian weapons design; and, unsurprisingly, it didn’t call the Russians. It went British. It approached an enterprise that embodies a high-tech, design-focused approach, blending traditional British engineering with the latest technological innovation. The Portsmouth company, Accuracy International (AI), equips the British Special Boat Service and Special Air Service with sniper rifles. In 2008, it signed a 3.7 million-pound contract to supply almost 600 sniper weapons to the UK Ministry of Defence. What came out of the SEALs’ approach to AI was a new gun. “The fact that such a small company can be a world-beater in the manufacture of quality weapon systems in a market dominated by huge American and European companies is a huge achievement,” says Color Sergeant Lee Chevenix, a British Army sniping-team instructor. “I know from first-hand experience how revered the AI product is, even in the States, where traditionally U.S. producers are favored.” AI’s weapons are now part of long-range sniping lore. Craig Harrison, a British Army sniper from the Household Cavalry, hit two Taliban machine-gunners with two consecutive shots at a range of 2,475 meters in Helmand province, Afghanistan, in 2009. Inadvertently he had taken the world sniping record using an L115A3, the 0.338-inch caliber military sniper-rifle system made by AI that is now standard issue for the British Army.\r\nhttp://www.wired.com/dangerroom/2011/08/ultimate-sniper-rifle\r\n\r\nAfter Libya Shootdown, U.S. Robo-Copter Will Weaponize\r\nDangerRoom (via Wired.com)\r\n August 18, 2011\r\n\r\nAmerica’s only combat casualty in Libya had no way of defending itself, when it was taken out by a heavy anti-aircraft weapon in late June. But that’s about to change. After spending the last few months chasing pirates in the Indian Ocean, watching over troops in Afghanistan, and flying into a pro-regime stronghold in Libya, the U.S. Navy’s Fire Scout robotic helicopter is poised to start test-firing rockets. By the end of next year, the drone should be fully weaponized, and ready to shoot back if it gets attacked. It’s another step forward for the Fire Scout, the once star-crossed robo-copter that’s quickly becoming a favorite tool of the Navy, despite years of uneven history and despite a recent Pentagon test report which said the drone was missing its missions as often as it was completing them. On June 21st, the U.S.S. Halyburton dispatched one of its two Fire Scouts to a known stronghold of forces loyal to Libyan dictator Moammar Gadhafi. The unmanned helo flew over the hostile zone, snapping video as it went and beaming the footage back to the ship. The Fire Scouts had flown as many as 15 such missions over Libya before. But this one was different. This time, the video suddenly stopped. The robo-copter’s wreckage was quickly paraded on Al Jazeera.\r\nhttp://www.wired.com/dangerroom/2011/08/after-libya-shootdown-u-s-robo-copter-will-weaponize\r\n\r\nBad Eyes Keep Unmanned Infantry Out of the Fight\r\nDangerRoom (via Wired.com)\r\n August 17, 2011\r\n\r\nThe robots were ready. Their weapons were primed. The battle was raging, and in need of new infantrymen — even if those troops weren’t necessarily human. But in the summer of 2007, the U.S. Army decided not to send its trio of armed robots onto the streets of Baghdad. Partially, the decision came from fears for safety: No one wanted the blue screen of death to actually become lethal. Partially, it was a nod to appearances: A robot grunt shooting a little kid would have been a public relations disaster. But there were technical reasons, too — reasons that continue to plague U.S. development of ground robots, and may hamper the development of the unmanned infantry for years to come. Communications between the robot and its human operator remain spotty, at best. The machine still isn’t particularly good at executing orders on his own. Perhaps most importantly, the robots have poor eyesight; the machines still can’t see as far as they can shoot. “If I’ve got a robot with a machine gun that’s got a max range of 800 meters, and a camera that can only see a couple meters, well, that’s a problem,” Lt. Col. Stewart Hatfield, chief of the lethality branch of the U.S. Army Capabilities Integration Center, told an audience at the Association for Unmanned Vehicle Systems International conference in Washington on Tuesday. (Full disclosure: I moderated a panel of my own there.) “Are we gonna get to the point of a Terminator in the [infantry] squad?” Hatfield asked. “Maybe. But we’ve got a long way to go in terms of trust and confidence and autonomy.”\r\nhttp://www.wired.com/dangerroom/2011/08/bad-eyes-keep-unmanned-infantry-out-of-the-fight\r\n\r\nRunning Robot Breaks Speed Records (Now All It Needs Is a Head)\r\nDangerRoom (via Wired.com)\r\nAugust 17, 2011\r\n\r\nAfter three years of “training”, including broken limbs, the gold medal for “the world’s fastest bipedal robot with knees” is to be hung around the neck of a robot called MABEL. The creation of a team of engineers at the University of Michigan, MABEL has just clocked a record of 6.8 miles per hour, but it’s been a tough training regime to get the robot from walking smoothly to running like a human. She was originally built by Jessy Grizzle, a professor in the University’s Department of Electrical Engineering and Computer Science and Jonathan Hurst, who was then a doctoral student at the Robotics Institute at Carnegie Mellon University. Doctoral students Koushil Sreenath and Hae-Won Park have since joined the project working on the feedback algorithms that allow MABEL to balance even when faced with uneven ground. The team says in a release that the robot “took its first jog” in July. MABEL is designed to have almost a human physiology — her weight is distributed like a human’s namely she has a heavier torso and “light, flexible legs with springs that act like tendons”. Grizzle adds that MABEL is in the air for 40 percent of each stride, “like a real runner”. In other running robots, claims the team, this “flight phase” lasts for less than 10 percent of each step.\r\nhttp://www.wired.com/dangerroom/2011/08/running-robot\r\n\r\nLockheed Drone is Inspired by Sycamore Seeds, Flies Like a Boomerang\r\nDangerRoom (via  Wired.com)\r\nAugust 15, 2011\r\n\r\nMaple seeds, sycamore seeds, whirlybirds or — if you live up north — spinning jennies. Whatever you call them, winged samara seeds are the helicopters of the natural world, whipping their blades around in the wind to travel great distances. That’s why defense contractor Lockheed Martin has been building an unmanned drone that mimics the movement of sycamore seeds. It’s called the SAMARAI, and Lockheed is showing it off at this year’s convention of the Association for Unmanned Vehicle Systems International in Washington. The one-winged drone is a foot long, and flies using a cyclic lift motion like a helicopter. It has just two moving parts (making it perfect for 3D printing), a camera and it can be piloted with a remote control or an app on a tablet. It can be tossed like a boomerang for instant deployment, dropped from a plane to collect ground-level images, or it can take off vertically and hover in place. It’s one versatile little machine. Lockheed Martin’s New Jersey-based Intelligent Robotics Laboratories has been working on the idea of a samara seed-inspired bot for five years — funded, at times, by Darpa. At one point, the robot was going to be literally seed-size, and could deliver a tiny two-gram payload. Over the years it’s grown to the big boomerang you see today.\r\nhttp://www.wired.com/dangerroom/2011/08/lockheed-sycamore-seeds", "group_id": 3920, "id": 2001508}]