[{"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1313780253.0598741, "message": "I am writing a book called Dramatica script analysis for Directors, Actors, and Designers and I would live to have a conversation here about character analysis using the Dramatica Theory, delving into the Four Dimensions and the Elements.", "group_id": 11394, "id": 1912064}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1313780406.8221819, "message": "If the discussion gets large enough we can start a separate group but for now this thread will do.", "group_id": 11394, "id": 1912077}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1313781145.3559239, "message": "Cool. Curious.", "group_id": 11394, "id": 1912194}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1313805148.932699, "message": "I am looking forward to your book, Sam.  I am, also, looking forward to the character analysis conversation, using four dimensions and elements.", "group_id": 11394, "id": 1914479}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314558670.5811441, "message": "My goal is to explore how an actor would approach a role like this.  Does each actor need to see their role as if they were the Main Character or are the 4 dimensions enough.  So I will talk through each of these eight roles and discuss how it might work in specific scenes.", "group_id": 11394, "id": 1986165}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314558525.397974, "message": "OK. I am directing the stage version of Star Wars (just go along with me) http://www.dramatica.com/story/analyses/analyses/starwars.html\n and you are my 8 main actors. playing Luke, Leia, Han Solo, Darth Vader, Obi Wan, C3PO & R2D2, Chewie, the Empire.  Before we start rehearsals I am going to explain to you my analysis of the show and what I think the big picture is (theme et.al.) and how I see your role fitting into that big picture.  We will explore your Purposes, Motivations, Methodologies, and Means of Evaluation.  My goal is that by the time we start rehearsals you will have done your work on these 4 dimensions and you won't be thinking about it as you act.  You want to be present and acting/reacting from your gut when you are on stage not in the back of your head and all cerebral.", "group_id": 11394, "id": 1986138}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314593885.6379831, "message": "@sam_potter   Number one, an actor is never to reveal his subtext to another actor.  You can only present, then watch.  If you do not like what you see the actor doing, then you present suggestions.  Be prepared to let it take on a life of its own.  Filming is so expensive, I take it that this is all theory?", "group_id": 11394, "id": 1991068}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314593288.9989901, "message": "@sam_potter  You are talking about backstory and subtext job of the actor.  You are providing springboards.", "group_id": 11394, "id": 1991006}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314593523.4739039, "message": "I am also going to explore how a director could inform his vision of the script by giving the actors the throughline information and the 4 dimension information.  These ideas are not fully formed so I am hoping to explore them here.", "group_id": 11394, "id": 1991041}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314594152.717483, "message": "PS:  or a group of friends getting camera practice, which is always a plus for actors.", "group_id": 11394, "id": 1991101}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314594376.277802, "message": "@sam_potter  It would be interesting to see what the actors end up hearing, in actuality.  Maybe we should do a scientific study <G>.", "group_id": 11394, "id": 1991125}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1314637807.8311141, "message": "I'm curious.", "group_id": 11394, "id": 1994733}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314639470.508039, "message": "Ooops.  Don't let me derail your nifty book idea with my joke.  There have been some psych studies done using actors as participants, but you are involved with the creative process.", "group_id": 11394, "id": 1995002}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314659652.7940631, "message": "If it means anything, I received my masters in the Professional Actor Training Program @ UNC-Chapel Hill, so I feel qualified to talk about acting and I have studied directing and have directed a few shows.  1. I am curious to see how useful it would be for actors to use Dramatica to do character analysis.  To find the 'spine' of their character for the whole show, for each act, for each sequence, scene, and beat.  An actor on their own could create a story form with their character as the main character no matter how large or small the part (I surmise) and decide their elements from the 4 dimensions.  It seems to me this area is mostly unexplored.  And I certainly do not have it figured out (although I would like to.)", "group_id": 11394, "id": 1997472}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314660476.661932, "message": "Casalbanca:\nIlsa (wife of Lazlo and one time lover of Rick\nPURPOSE: Desire, Change\nMOTIVATION: Consider, Feeling, Faith, Help\nMETHODOLOGY: Protection\nEVALUATION: Hunch, Test\n\nIlsa's goal or purpose is to acquire desire. \nAs defined by Dramatica, desire is the motivation toward something better. So Ilsa's purpose is not to acquire something better but it is to 'acquire the motivation toward something better. She doesn't care about anything anymore. Ilsa also has a goal or purpose toward Change. If Rick is a Change/start Character and a logical be-er than most likely Ilsa as the impact character is a steadfast/stop character who is an intuitive do-er. So her goal in the story is for Rick to change, to stop hating her. For Rick to care again. (maybe her goal of desire is for Rick not herself, after all she is the impact character.) \nIlsa's motivation or drive is to get Rick to consider the pros and cons (appeal to his logical thinking). Her intuition tells her and motivates her to get Rick to help her husband to America. Her feelings or emotional sense of how things are going. She is motivated in her faith(accepting something as certain without proof) that Rick still cares about people, that he still loves her and will help Lazlo for her sake. She is motivated by Help. She has to have Ricks help. He has the passport. He is the only one who can get them out of this country away from the Nazis.\nIlsa's methods or tactics to achieve her goals is protection (an effort to prevent interference with ones concerns.) In a strange way she does this by avoiding Rick's painful jabs at her character. If she sees his concerns as not wanting to be hurt by love again then maybe she protects him as long as she can by letting him be angry and hateful. She is also protecting her husband by using her connection, all-be-it a strained connection, with Rick to get Lazlo a passport to save his life.\n\nShe evaluates her efforts and her progress by her hunches or understandings based on insufficient circumstantial evidence. She also evaluates her progess by testing or trials to determine something validity. SO, she has a hunch Rick is not happy for disappearing on him in Paris after they proclaimed their love for each other and she is right, but she keeps testing to see if he still cares for her. She smiles, flirts, she gets hurt by Rick's remarks, she tells him the truth. She is testing to see if he is approachable. If she can get close to him again to tell him she loves him and she is sorry and to get his help.", "group_id": 11394, "id": 1997538}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314660378.7091911, "message": "Here is an example of what I am talking about perhaps:", "group_id": 11394, "id": 1997532}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314660809.4452281, "message": "The way the program stated the purpose to 'acquire desire' threw me off.  You can see how I interpreted it but wasn't sure about it.  Chris H. gave this help:\n \n\"With character elements, and all structural items per se, you can see them as having the trait or lacking the trait, having too much, or too little, having it as an attribute or having it attributed to them, having it as positive or negative, waxing and waning, etc. I often refer to this as \"flavoring.\" The item has a base meaning, but you may \"flavor\" it to give it greater subtlety and variety.\n\nFor example, if we look at the character element of Desire, we can \"flavor\" in different ways:\n\n-- Having too much desire (e.g. being overzealous, heartsick, too passionate)\n-- Having too little desire (e.g. being indifferent, blase, too dispassionate)\n-- Having a desire (e.g. wanting something or someone)\n-- Being desired (e.g. being wanted for something or by someone)\n-- Having positive desires (e.g. Love, career goals, hobbies, constructive desires)\n-- Having negative desires (e.g. obsessions, depravities, destructive desires)\n-- Having waxing desires (e.g. growing passions, gaining interest, falling in love)\n-- Having waning desires (e.g. dampening passions, losing interest, falling out of love)\n\n... And so on.\n\nIt is up to you, as the writer, to choose the type of spin you want to put on the dramatic element.\"", "group_id": 11394, "id": 1997573}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314660350.303196, "message": "If I were directing a show (in this fictional case, Star Wars) I wouldn't want everyone creating their own analysis of the story.  I would have analysed the script and decided who the story was to be about. Who is the MC and the IC.  I chose Star Wars so I can use archetypes and make it easier on myself (I hope)  I hear what you are saying about sharing with other actors but I really believe every one should be in line with the directors vision.  I don't think the actors will have to know Dramatica.  It will be up to the director to communicate what he wants.", "group_id": 11394, "id": 1997527}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314661763.1762209, "message": "I am hoping people can help with their opinions on things like Purposes vs. Motivations. etc. My instinct is that Purposes are external (as in.  I have discovered my purpose in life) Motivations are internal drivers.  \"I want...\", \"I need...\"  I seem to remember Dramatica theory suggesting one did not supersede the other.  Again, my instinct is that the hierarchy is purposes come above motivations.  I would think Purposes are constant throughout and Motivations can flux within a story and methodologies are in constant flux depending on the feedback from the means of evaluation.  \"Is it working? yes= proceed.\" \" Is it working? No=change tactics or methodologies.\"  Is it working= is my method or tactics either 'getting me what I want?' or 'having the impact on the other that I desire?'  We use to call this 'playing an action'.  The debate was, \"is it better to 'do to' the other character or to 'get from' the other character?\"  I believe Dramatica accounts for both.  Are you a do-er or a be-er?  is this an internal or an external methodology or motivation?  (these ideas are not tested and may not be valid but so far just instinct.)", "group_id": 11394, "id": 1997666}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1314673277.106374, "message": "Your credentials do matter to me. I wouldn't accept that anybody who learned Improv in a cafe really understood improv.", "group_id": 11394, "id": 1999409}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1314678068.3633771, "message": "So... my first question is this. How can you link a Dramatica element to a Chekhov Action, or a Meisner Preparation or a Method Sense Memory?\n\nHow can you make it completely un-intellectual for the actor?", "group_id": 11394, "id": 1999934}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314683723.539556, "message": "@MikeDerk (about being un-intellectual)  Don't worry, the actors will pick out one thing they understand, and run with it.  <G>", "group_id": 11394, "id": 2000617}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314685179.582669, "message": "@sam_potter   It's a relief that you have a solid background in directing and the dramatic arts.  Do you think the actors should understand their character archtypes, first?  You could jump into improv of archtypes, thinking of the dynamic opposites.  That sounds like fun.  \n\nI'm sorry I haven't check in, earlier.  Tomorrow is a busy day and night.  I want to think over your posts.  I work better with smaller chucks, btw.  more on Wednesday for sure, maybe a little tomorrow", "group_id": 11394, "id": 2000811}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314721813.2412441, "message": "@MikeDerk Yes! Un-intellectual (get out of your head meat). One of the most exciting things as an actor (or to watch an actor) is to be totally in the moment. Reacting in a zen like state to everything around you. Really listening not just waiting for your cue to recite your rehearsed line just so.  This means all this work has to be done before you begin filming or performing. This is a luxury of rehearsals although some would argue it takes away the spontaneity.", "group_id": 11394, "id": 2004653}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314725702.314364, "message": "@sam_potter   Ah, but it never loses spontaneity, even after hundreds of rehearsals/performances, in the ideal world.  Rehearsals cost money and/or time, the last of which is everyone's money.  So the argument about spontaneity might be cognitive dissonance at work.  Perhaps, the one creating the Dramatica storyform the actors use should be prepared to adjust the storyform, after the actors do their spontaneous thing.  The last thing one wants is to discourage them.  After all, this is an exercise to visualize better and greater possibilities, right?  I'm not saying not to tweak and suggest for them to do some things differently, however, \"You didn't do this--don't you remember the storyform said to do that--etc.\" might just rattle them.  If they come up with a cohesive performance, there might be gems in them there skits.  And you will want to keep them enthused.  Artists of all kinds are such fragile beings.  just thoughts", "group_id": 11394, "id": 2005066}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314851617.1913669, "message": "The drama of it all, these forums are like a good John Malkovich movie.  I am not sure, exactly, what is going on, however, before it is too late I want to give two suggestions for your book because it sounds like these chat boards are on the verge of going poof.  I would either include editors or have the book for actors, directors and crew (designers and editors).  I would strongly urge the reader never, ever to tell the actors they did something wrong in their interpretation of the Dramatica theory.  They are only providing their honesty, and that is always ok.  Instead, I would urge doing more scenes to \"flush\" things out.  just thoughts", "group_id": 11394, "id": 2017636}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314876930.4461451, "message": "I suppose we can continue here. I should try to get more members to this group.  I have several points I want to respond to but have to wait till I have time.  sorry for the delay.", "group_id": 11394, "id": 2019203}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1314897015.063905, "message": "Please don't worry about delay.  I prefer small chunks to massive amounts of information that are like a tsunami.  I love spewing out tsunami blurbs, don't get me wrong, but it is easier to process for replies when coming in smaller amounts.  \n\nI am willing to continue with this group on this forum.  I like this forum system.  Do we have to take over some kind of admin duties from Jim, or is he going to continue them on his own?", "group_id": 11394, "id": 2021566}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1314906511.8280351, "message": "Good question", "group_id": 11394, "id": 2022997}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1315001946.085247, "message": "I don't think there is much administration to this site. Anyone can start a Convore site. If Jim doesn't want to continue to be the \"owner\" of a site he rarely visits, it's easy to start another one.", "group_id": 11394, "id": 2032764}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1315024118.455224, "message": "Well, you guys be sure to copy your comments because we have not discussed all those fascinating points.  I assume you or Sam are going to keep tabs on all this?", "group_id": 11394, "id": 2034709}, {"user_id": 7664, "stars": [], "topic_id": 44118, "date_created": 1315151550.0087881, "message": "It's Sam's thread, so I'm not keeping notes.", "group_id": 11394, "id": 2043652}, {"user_id": 37586, "stars": [], "topic_id": 44118, "date_created": 1315156201.572859, "message": "I copied everything I am just working through a 'to do' list.  You both have brought up points I want to address and will try to do one at a time.", "group_id": 11394, "id": 2043972}, {"user_id": 39675, "stars": [], "topic_id": 44118, "date_created": 1315190557.8255169, "message": "ok", "group_id": 11394, "id": 2047854}]