[{"user_id": 11626, "stars": [], "topic_id": 40756, "date_created": 1309376288.833148, "message": "Russia Today\n29 June, 2011\n\nThe New Mexico wildfire that has turned America’s heads towards the Los Alamos nuke plant is inching closer and closer to the laboratory, where the Associate Press says it is now a few miles from a dumpsite.\n\nIf the fire extends another 3.5 miles, it could overtake an area where 30,000 55-gallon drums of plutonium-contaminated waste are being stored above ground.\n\nA spokesperson for Los Alamos previously denied that the drums existed, but the plant is now backtracking and admitting that the complex’s “Area G” is home to thousands of gallons of dangerous waste.\n\nLisa Rosendorf of the Los Alamos plant told the press that the drums contain cleanup from Cold War-era waste, but the Los Alamos Study Group is making claims that the waste is much newer than that. The plant, which is believed to have tested more nuclear weapons than any other facility in the world, is thought to be cranking out more nukes than ever, reports Washington’s Blog.\n\nThough the lab says that the drums are on a paved area spare in greenery and certainly safe, a special team has been called in to test plutonium and uranium levels in the air as a precaution.\n\nWatchdog group Concerned Citizens for Nuclear Safety said earlier this week that the drums were awaiting transport to a low-level radiation dump site elsewhere in the state, but Los Alamos County Fire Chief Douglas Tucker told Reuters on Tuesday that none of the drums would be moved.\n\n“It is safer where it is,” he said.\n\nBy Tuesday the fire had already engulfed 61,000 acres of the Santa Fe National Forest, which surrounds the Los Alamos lab almost entirely. A day earlier the blaze began to encroach on the lab’s property, burning around an acre before fire crews extinguished the blaze in two hours’ time.\n\nOffsite, radioactive material from nuclear tests are buried underneath canyons in rural New Mexico. Authorities say there is a chance that fire could end up engulfing that area, and New Mexico Environment Department’s Rita Bates tells the Wall Street Journal that the smoke released could potentially affect the health of the people in the region.\n\nhttps://rt.com/usa/news/los-alamos-nuclear-fire", "group_id": 3920, "id": 1520741}]