[{"user_id": 36143, "stars": [], "topic_id": 39783, "date_created": 1308785964.7054689, "message": "From one of the other topics, I guess what I'd like to do is the following workflow:\n - User not logged in lands at a login page, clicks on a provider to authenticate against\n - Get back auth ticket from provider, realize that there's not an existing account for user\n - Prompt user: Make new account?  Associate the returned ticket with an existing account?\n - Existing account could be django-auth account made through different setting\n - If new account, provide a form view to get additional information on the user that is saved along with the auth association.  IE: User gets to enter their own username, user must accept a EULA before account is created.", "group_id": 5196, "id": 1461257}, {"user_id": 20656, "stars": [{"date_created": 1308812719.350652, "user_id": 33044}], "topic_id": 39783, "date_created": 1308811054.575141, "message": "This is easily accomplished with the (a bit) recent newly-registered-user-url SOCIAL_AUTH_NEW_USER_REDIRECT_URL (https://github.com/omab/django-social-auth/blob/master/social_auth/views.py#L16 and https://github.com/omab/django-social-auth/blob/master/social_auth/views.py#L68).", "group_id": 5196, "id": 1464114}, {"user_id": 36639, "stars": [], "topic_id": 39783, "date_created": 1309279193.738776, "message": "I'm not sure I see how SOCIAL_AUTH_NEW_USER_REDIRECT_URL get used. It seems to me that when complete_process() gets called, the default redirect url from the LOGIN_REDIRECT_URL setting was already added when auth_process() or associate() was called earlier. I am also seeing this at runtime: If I social-login under a non-existing user and without next query string value set, after auth it redirects to LOGIN_REDIRECT_URL instead of NEW_USER_REDIRECT_URL. Please clarify. Thanks.", "group_id": 5196, "id": 1507319}, {"user_id": 36337, "stars": [], "topic_id": 39783, "date_created": 1309379356.8568339, "message": "Well i guess (as allauth does) a feature allowing us to request password and / or other data before saving the user would be useful", "group_id": 5196, "id": 1521539}, {"user_id": 20656, "stars": [], "topic_id": 39783, "date_created": 1309722257.6487141, "message": "@apavillet You mean adding this feature to social_auth?", "group_id": 5196, "id": 1553695}, {"user_id": 36143, "stars": [], "topic_id": 39783, "date_created": 1309789971.8744359, "message": "I looked at it a bit the other day, and from my understanding, to do what I want, Show a form to add user selected name, and user selected password / EULA, I'd have to override complete, set CREATE_USER to false, call complete_process and if user is None, display my requested form instead, passing in the data from the backend, as well as what the backend was, and if that succeeds then creating the user/social_user.  Does that sound right?", "group_id": 5196, "id": 1559944}, {"user_id": 20656, "stars": [], "topic_id": 39783, "date_created": 1309830879.9957199, "message": "@dougwarren Why not use SOCIAL_AUTH_NEW_USER_REDIRECT_URL to display that form?", "group_id": 5196, "id": 1563698}, {"user_id": 36143, "stars": [], "topic_id": 39783, "date_created": 1309875053.7818, "message": "@omab By the time that handler was invoked, there already was an entry in the User table, the username was already selected, etc...  I want to get more information prior to the creation of the user.  IE: Do an associate to an existing user (User hit fb authenticate when every other time he hit twitter and didn't realize it.), let the user select a specific username.  Let the user verify/change his e-mail address.  These are the type of things that should be done before the User itself is created", "group_id": 5196, "id": 1567135}, {"user_id": 18824, "stars": [], "topic_id": 39783, "date_created": 1314886951.3406539, "message": "@omab is there any way to pass args to SOCIAL_AUTH_NEW_USER_REDIRECT_URL ? For example if I try '/profile/account/%(user)s/edit/'  it always returns the url as is. Also if i18n prefix urls are activated it's not possible to prepend the current language to this path. For now to solve this I must create a static url and redirect to my own view.", "group_id": 5196, "id": 2020582}, {"user_id": 20656, "stars": [], "topic_id": 39783, "date_created": 1315119159.0078471, "message": "@franckbret, there's not such support at the moment.", "group_id": 5196, "id": 2041682}, {"user_id": 18824, "stars": [], "topic_id": 39783, "date_created": 1315303724.7734611, "message": "@omab We should be able to set named url, not static path. Maybe django 1.4 will introduce those features https://code.djangoproject.com/ticket/15552", "group_id": 5196, "id": 2058259}]