[{"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310750884.2530029, "message": "I'm curious if we could tell from just the pilot script.", "group_id": 2515, "id": 1647210}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310752309.5771501, "message": "Mike, have you watched the trailer? The clues crossing back and forth seems to be a major point, but I'm interested to see how it plays out.", "group_id": 2515, "id": 1647409}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310750561.040736, "message": "I have been thinking about this since watching the trailer a few weeks ago. And I still have no real idea, so looking forward to hearing opinions. My gut tells me two separate storyforms, but not having seen it (or the script), I really can't say.", "group_id": 2515, "id": 1647158}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310750187.3785, "message": "Hypothetical:\nHere is the press release for an upcoming TV show:\n\n“Awake” is an intriguing drama about a detective (Jason Issacs, “Harry Potter,” “Brotherhood”) who finds he is leading an arduous double life that defies reality. When Detective Michael Britten (Issacs) regains consciousness following his family’s car accident, he is told that his wife Hannah (Laura Allen, “Terriers”) perished but that his teen son, Rex (Dylan Minnette, “Saving Grace”), has survived. As he tries to put the pieces of his life back together, he awakens again in a parallel reality in which his wife is very much alive — but his son Rex died in the accident. In order to keep both of his loved ones alive at one time, he begins living two dueling realities in parallel worlds, which churns up confusion — in one moment, Michael and his wife debate about having another child to replace their son, while in the other reality, he is attracted to his son’s tennis coach, Tara (Michaela McManus, “The Vampire Diaries”), to fill the void from the loss of his wife. Trying to regain some normalcy, Michael returns to police work and solves crimes in both worlds with the help of two different partners — Detective Isaiah “Bird” Freeman (Steve Harris, “The Practice”) and Detective Efrem Vega (Wilmer Valderrama, “That ’70s Show”).\n\nOne day, we’ll know the real answer, but in the meantime...\n\nHow would you explore this world? Would you have two OS’s and two MC Throughlines? Would you have one? Would you give him some sort of IC who knew about both worlds so he could get some sort of comfort? \n\nHow would you use Dramatica to help you develop the story?", "group_id": 2515, "id": 1647118}, {"user_id": 10814, "stars": [], "topic_id": 42084, "date_created": 1310751242.804877, "message": "At least two storyforms, each with Michael Britten as the MC.", "group_id": 2515, "id": 1647241}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310752027.794775, "message": "The crossover is exactly what I think is interesting. I do think that, even if both \"states\" have the same Domain, that wouldn't necessarily make them into one throughline.\n\nWhat might make them into one throughline is if he can get clues on one \"state\" that solve crimes in the other \"state.\"", "group_id": 2515, "id": 1647381}, {"user_id": 10814, "stars": [], "topic_id": 42084, "date_created": 1310752241.6132209, "message": "My guess is that there is probably another story(form) that is an overarching the entirety of the two worlds.  This would explore the bigger issue of the existence of the dichotomy, the inequity that created it and the problem-solving to work it out, or justification to hide the split from the MC.", "group_id": 2515, "id": 1647406}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310751733.924715, "message": "So where the two storyforms stump me (and maybe this should be a separate topic) is with the issue of throughline crossover. Would his throughline as MC look the same in both storyforms, or same domain at least? OS seems like it would potentially be the same--say Doing (solving crimes). Is crossover desired (or even necessary)? Or am I on the totally wrong track here?", "group_id": 2515, "id": 1647315}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310751930.523145, "message": "I think this is the right topic -- this is why I brought it up!", "group_id": 2515, "id": 1647361}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310752041.9167521, "message": "Okay, just didn't want to hijack ;>", "group_id": 2515, "id": 1647384}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310752668.209353, "message": "it's here if you're interested: http://www.youtube.com/watch?v=CfPVoiQKFvk", "group_id": 2515, "id": 1647458}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310752912.2352681, "message": "Thank god it's not the one with Jessica Alba!", "group_id": 2515, "id": 1647498}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310752107.0867391, "message": "An interesting fall-out from two storyforms would be... if he learns something in one, and tries to employ it in the other, and it just doesn't work. The worlds diverse for everyone, except him.", "group_id": 2515, "id": 1647395}, {"user_id": 36437, "stars": [], "topic_id": 42084, "date_created": 1310753274.577914, "message": "I agree, common theme.", "group_id": 2515, "id": 1647547}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310752325.3463011, "message": "No, haven't seen it.", "group_id": 2515, "id": 1647411}, {"user_id": 7664, "stars": [], "topic_id": 42084, "date_created": 1310752934.8847611, "message": "Kyle Killen (the writer) seems obsessed with alternate realities. It's been in all of his work to date.", "group_id": 2515, "id": 1647504}]