[{"user_id": 1, "stars": [], "topic_id": 14252, "date_created": 1300729233.7037139, "message": "That would be awesome!", "group_id": 7274, "id": 400531}, {"user_id": 1, "stars": [], "topic_id": 14252, "date_created": 1300729246.5293851, "message": "But I'd want the widgets to be able to be placed on my home screens too", "group_id": 7274, "id": 400534}, {"user_id": 23235, "stars": [], "topic_id": 14252, "date_created": 1300729573.3891931, "message": "@rays I'm with you on that. But, knowing Apple, they'd draw the line somewhere between iPhone 3GS and iPhone 4. ;)", "group_id": 7274, "id": 400587}, {"user_id": 23224, "stars": [], "topic_id": 14252, "date_created": 1300729106.3278639, "message": "iOS applications seem to lie somewhere between OS X widgets and OS X apps. They aren’t as single serving as an OS X widget, but they certainly aren’t as robust as some desktop applications either. Apple’s doing a lot to close that gap, as evidenced by Garageband and iMovie on the iPad, but we’re still a little ways off at this point. But, OS X widgets in the dashboard are pretty much an abandoned technology. I don’t know one person who uses them on a daily basis, and if you do, I’d suggest that you’re in the minority. Taking a moment to think about it, it becomes pretty obvious that the dashboard in OS X is an awful lot like the lock screen on the iPhone and iPad. They’re both there, they’re both accessible, and they’re both rarely used for anything except checking the time (iOS) or loading a calculator (OS X). The key difference between the two is that we’re forced to look at the lock screen at regular intervals whereas the dashboard rarely ever gets opened.\n\nWhat if Apple changed their approach to the lock screen? What if they took the widget approach from OS X, and directly applied it to the lock screen of the iPhone 5? Users could then add an email list, a to-do list, a calendar, or anything else that developers could squeeze into the newly widgetized space.\n\nI often find myself clicking my lock button just to check the time, but it would be incredibly more useful if I could click the lock button and see the weather, missed calls, or latest direct message from Twitter.", "group_id": 7274, "id": 400513}, {"user_id": 10716, "stars": [], "topic_id": 14252, "date_created": 1300729415.56181, "message": "should be an iOS feature and not restricted to hardware :) I also +1 this feature", "group_id": 7274, "id": 400556}, {"user_id": 18029, "stars": [], "topic_id": 14252, "date_created": 1300730004.817528, "message": "Agree, agree. My biggest gripe with iOS is lack of usable info at rest. It's the only reason why I jailbreak to be honest. Some intelligent use of the lock screen (weather, possibly RSS/Twitter feeds?) and a revamped notification system are sorely needed in iOS.", "group_id": 7274, "id": 400649}, {"user_id": 25702, "stars": [], "topic_id": 14252, "date_created": 1301199859.7160511, "message": "Agreed. I like to keep my phone locked from others (as do many I'm sure), and not having the ability to check anything more than the time and battery life without entering my code is starting to become a bore. It's time to steer away from the minimalistic look.", "group_id": 7274, "id": 449369}]