[{"user_id": 37586, "stars": [], "topic_id": 46359, "date_created": 1318123953.7130971, "message": "I have a confession to make.  I gloss over Journey Plot Points.  I cannot conceive well how to illustrate them.  How do you illustrate movement from one concern to another in \"journey\" plot points?", "group_id": 2515, "id": 2308600}, {"user_id": 36525, "stars": [], "topic_id": 46359, "date_created": 1318125147.223537, "message": "IMHO a signpost plot point shows how something is, while a journey plot point shows how something changes to something else.  Then you get another signpost plot point showing how that new something is.  Then you get a new journey plot point showing the second something changing to a third something.", "group_id": 2515, "id": 2308691}, {"user_id": 37586, "stars": [], "topic_id": 46359, "date_created": 1318130072.736944, "message": "In the Overall Story, I guess, the story driver would help I suppose. Some decision or action changes the focus from \"future to past\" for example.  When reading the Dramatica book on signposts and journeys, I imagined the idea of focusing a story on the 3 journeys as very difficult.  I keep hearing in my head narration, \"... and little by little the folks in Frostbite Falls stopped worrying about the future and began reflecting on their past actions towards Borris and Natasia.\"", "group_id": 2515, "id": 2309051}, {"user_id": 36525, "stars": [], "topic_id": 46359, "date_created": 1318133336.4982989, "message": "Catalyst, Inhibitor, and Benchmark might be relevant.  For example, I have a storyform where one OS journey is from Obtaining to Gathering Info.  The OS Catalyst is Morality, the OS Inhibitor is Preconception, and the OS Benchmark is Doing.  So, let's say the story begins with the Obtaining of a valuable object by a group of people.  I use the first scene to describe this initial incident - most of the characters in the story are the crew of a prospecting space ship and they found a big asteroid made out of a very valuable ore.  OK now they've obtained it, don't want to dwell on that too long.  Instead the obvious question is what they are going to do with their wealth.  The prospectors have a meeting to decide what to do with the money.  Some of the crew want to spend the money the way they usually do (preconception), taking a shore leave and partying hard.  They can't see themselves as anything other than poor prospectors so they want to go back to that state.  On the other hand someone says that this is the chance for them all to have a better life (morality) by buying some mail-order brides and settling down to form a colony instead of being prospectors.  Now it becomes apparent that they will need to gather several different kinds of info: will a majority of the crew agree to go along with this plan?  Where can they settle and how can they purchase the women?  The crowning piece of info for each crew member will be which woman he likes and whether she likes him.  So eventually they will get to signpost 2 of learning about the women, but there's a lot of change in between the two signposts.", "group_id": 2515, "id": 2309261}, {"user_id": 10814, "stars": [], "topic_id": 46359, "date_created": 1318263118.6275361, "message": "It depends on the kind of feel you have for a story.  If it feels segmented to you, then the signposts are the segments and the journeys are the joints that connect the segments.  If the story feels more like a sinuous rope, then the signposts are, well, Signposts marking your progress as you slide along the story rope.  Journeys will seem to be the sinuous rope, going from one curve to the next, with the signposts indicating you are passing by some sort of notable marker.  If your story feels both segmented and flowing, then each of the signposts and journeys may have similar weight, though I don't know of too many stories that work that way.  Usually if they do it is because it is a blending of the multiple throughlines in the story.", "group_id": 2515, "id": 2318916}]