[{"user_id": 37586, "stars": [], "topic_id": 44594, "date_created": 1314563720.775403, "message": "I am just thinking out loud here.  I know I am stating the obvious but It occurred to me that Dramatica isn't a new invented theory of story but a discovery of how the mind makes patterns and how it uses those patterns to tell stories.  The genius of Dramatica is how it encodes these patterns. When Stories are analyzed that were written and produced long before Dramatica was written and produced, say Casablanca, it is amazing how well it works.  Time and time again, story forms are created from films before and after dramatica and I am blown away by the accuracy.  Is it like the I ching where we as viewers see what we need to see to help us with our own issues?  Anyway, when one studies it and learns how it works I find it hard to believe that anyone would dismiss it.", "group_id": 2515, "id": 1986948}, {"user_id": 7645, "stars": [], "topic_id": 44594, "date_created": 1314566577.710506, "message": "Yes", "group_id": 2515, "id": 1987333}, {"user_id": 10814, "stars": [], "topic_id": 44594, "date_created": 1314569271.50822, "message": "Yes, the theory is a discovery more than an invention.  The software is an invention based on the discovery.\n\nAs far as I Ching goes, the patterns are similar to the original version of the I Ching, not the revised version.  In fact, an early Dramatica user by the name of Chris Lofting noticed the similarity and wrote an article about it in 1999:  http://storymind.com/dramatica/i_ching/chris_lofting/chris_lofting_1.htm", "group_id": 2515, "id": 1987661}, {"user_id": 37586, "stars": [], "topic_id": 44594, "date_created": 1318825809.5043859, "message": "And the software is a great invention. :0)  It all is.", "group_id": 2515, "id": 2366274}, {"user_id": 37586, "stars": [], "topic_id": 44594, "date_created": 1318902620.0119309, "message": "Here is an interesting story of how the mind works and changes memories to fit a story narrative. (the way the mind works) \nhttp://www.npr.org/2011/09/27/140816037/how-psychology-solved-a-wwii-shipwreck-mystery", "group_id": 2515, "id": 2372744}, {"user_id": 36525, "stars": [], "topic_id": 44594, "date_created": 1318931656.5923049, "message": "That was a cool article.  I wonder if any of those psychologists have a theory about how to do that in reverse?  I mean go from the schema that makes simple sense, for example a story concept, to the complex and less obvious \"true story\".", "group_id": 2515, "id": 2375012}, {"user_id": 33839, "stars": [], "topic_id": 44594, "date_created": 1318952075.8520219, "message": "If you liked the article, you might want to check out some books on forensic science (if you're into that stuff).  They're loaded with solving who dunnits with some fascinating cases. \n\nAs for schemas - no, I don't think they do.  I've done lots of corporate problem solving using Kepner-Tregoe and you're batted over the head for using any pre-conceived notions that look like simple explanations.  Essentially, you're doing the same thing: working in reverse and trying to find causal patterns.", "group_id": 2515, "id": 2376864}, {"user_id": 33839, "stars": [], "topic_id": 44594, "date_created": 1318952211.783988, "message": "Schemas are how we interpret the world subjectively through our own filters, that's why I don't think it's useful for obtaining the objective truth.  But... if I remember correctly, was it The illusionist uses the complex as a guise, the answer being so simple straight forward and obvious, that it wasn't even considered a possibility.", "group_id": 2515, "id": 2376871}, {"user_id": 37586, "stars": [], "topic_id": 44594, "date_created": 1323737819.7985339, "message": "Stephen R. Covey (@StephenRCovey) 12/6/11 5:38 PM Becoming principle-centered is a process of becoming. It's a lifetime quest. We all, at times, get off track. Just get back on track.", "group_id": 2515, "id": 2741199}]