[{"user_id": 3107, "stars": [], "topic_id": 7503, "date_created": 1298142044.0500979, "message": "En su experiencia startups workers y fundadores, ¿funciona el tropicalizar app aglosajonas (gringas) a latinoamerica?", "group_id": 965, "id": 150204}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1298144347.708385, "message": "fuera de mercado libre y plan descuento, no creo que ninguna haya funcionado masivamente. En españa parece que les ha ido mejor, Groupalia, Tuenti y  MiNube por ejemplo son en cierta manera tropicalizaciones de conceptos gringos pero han sabido adaptarlos bien a su mercado.", "group_id": 965, "id": 150342}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1298144443.851542, "message": "En general estoy en contra de tropicalizar, pero creo que ver a \"Latinoamerica\" como un solo gran mercado es un error. Escuchen el episodio de This Week in Startups donde entrevistan al dude de .co", "group_id": 965, "id": 150352}, {"user_id": 3107, "stars": [], "topic_id": 7503, "date_created": 1298394678.5782039, "message": "Insteresante lo que señalas de que es un error ver a latinoamerica como un solo mercado. Entonces crees que sea mejor hacer aplicaciones dirigidas hacia el mercado gringo? He escuchado comentar a emprendedores que si tienes éxito en Estados Unidos es como si tuvieras éxito en México pero al doble?", "group_id": 965, "id": 180525}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1298395765.253222, "message": "@Carlitos Definitivamente. Quizá no tanto \"dirigido a Estados Unidos\" sino dirigido a una audiencia global pero, eso sí,  siempre lanzar primero en inglés.", "group_id": 965, "id": 180667}, {"user_id": 10406, "stars": [], "topic_id": 7503, "date_created": 1298458420.4665699, "message": "@soska es increible observar en estos lados del mundo como emprendedores europeos, consideran cada vez mas fuerte el mercado latino como un mercado meta, no por nada estamos dentro del top 3 en los idiomas mas hablados en el mundo. Tip 1: Considera lanzar tu modelo de negocio en mercado de rapido crecimiento. Estoy preparando el blog para empezar a hablar de esto.", "group_id": 965, "id": 186718}, {"user_id": 12133, "stars": [], "topic_id": 7503, "date_created": 1299514987.329962, "message": "reinventar la rueda nunca funciona!!!", "group_id": 965, "id": 288655}, {"user_id": 12133, "stars": [], "topic_id": 7503, "date_created": 1299606260.356029, "message": "ejemplo iwiks ...", "group_id": 965, "id": 297730}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299628352.029639, "message": "@zodman creo que es un terrible ejemplo :P iwiks no inventó, ni reinventó, ni hizo absolutamente nada de nada. Solo sirve de mal ejemplo.", "group_id": 965, "id": 300577}, {"user_id": 12133, "stars": [], "topic_id": 7503, "date_created": 1299686072.5909491, "message": "como no ? reinvento todo lo que hace facebook!!!", "group_id": 965, "id": 306341}, {"user_id": 3107, "stars": [], "topic_id": 7503, "date_created": 1299688419.6577511, "message": "@zodman iWiks quiso copiar pero no hizo nada ni los formularios le salieron LoL!", "group_id": 965, "id": 306600}, {"user_id": 13316, "stars": [], "topic_id": 7503, "date_created": 1299692595.295336, "message": "jajajajaja", "group_id": 965, "id": 307104}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299696455.3288059, "message": "@albrtk amén.", "group_id": 965, "id": 307428}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299697472.982904, "message": "FaceBook no fue la primer red social, pero implemento suficientes características nuevas como para crear una categoría aparte de MySpace / Hi5.", "group_id": 965, "id": 307513}, {"user_id": 19921, "stars": [], "topic_id": 7503, "date_created": 1299696008.1754451, "message": "Vamos a ser sinceros. Si bien la ejecución detrás de iWiks fue bastante pobre, la idea de hacer una Red Social con características supuestamente propias recibió bastante apoyo por parte de sus usuarios en potencia. Y claro, también esta la publicidad que recibió dicha compañía sin precedente alguno para un Startup Mexicano lo que les valió mas de 10,000 signups antes del día de lanzamiento. Eso tiene cierto merito creo yo. De cualquier manera, iWiks cayo y veo un tanto difícil que se vuelvan a levantar, pero también hay que aprender de lo que hizo mal el fundador e ir detrás de apoyos publicitarios similares para nuestros respectivos Startups, pero claro, ejecutando mucho mejor.", "group_id": 965, "id": 307388}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299696301.219085, "message": "\"la idea de hacer una Red Social con características supuestamente propias\" Por qué detenerse ahí? Si de todos modos uno va a ejecutar pobremente, hagamos una red social mexicana que cure el cancer y logre la paz mundial.", "group_id": 965, "id": 307415}, {"user_id": 2946, "stars": [{"date_created": 1299785622.5271561, "user_id": 10406}], "topic_id": 7503, "date_created": 1299696325.8135071, "message": "las ideas no valen nada, es la ejecución la que vale", "group_id": 965, "id": 307418}, {"user_id": 19921, "stars": [], "topic_id": 7503, "date_created": 1299696423.3058829, "message": "100% de acuerdo. Esa es la mantra por la cual vivimos los creyentes de la metodología del Lean Startup.", "group_id": 965, "id": 307423}, {"user_id": 19928, "stars": [], "topic_id": 7503, "date_created": 1299696431.200124, "message": "si la ejecución de iwiks hubiera sido buena, si no la hubieran tumbado, si la hubieran echo bien para acabar mas rapido, creen que una nueva red social todavia pueda darle pelea a facebook?", "group_id": 965, "id": 307427}, {"user_id": 19921, "stars": [], "topic_id": 7503, "date_created": 1299696883.4241519, "message": "@alanisdg Dependiendo del tipo de Startup son las características que necesitara para ser exitoso. Hablando de Redes Sociales, si se innova en los campos correctos (como dijera Seth Godin) considero que si hay cabida para otro competidor. La situación es que Facebook tiene acaparada la gran mayoría ese mercado, por ende un potencial competidor necesitaría ejecutar casi sin errores para atraer a grandes cantidades de usuarios.", "group_id": 965, "id": 307467}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299698139.373647, "message": "que buena se puso la platica, pero me voy a trabajar, porque este código no se escribe solo.", "group_id": 965, "id": 307574}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299697537.3365121, "message": "Creo que es virtualmente imposible ganarle a fb en su categoría, pero una startup innovadora puede crear una nueva categoría, como lo hizo twitter.", "group_id": 965, "id": 307518}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299697871.7937729, "message": "yep", "group_id": 965, "id": 307549}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299697416.9696259, "message": "@alanisdg El libro \"the 22 immutable laws of marketing\" dice que el primer jugador en llegar a una categoría la dominará, y que toda carrera eventualmente se convierte en una carrera de dos jugadores.", "group_id": 965, "id": 307505}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299698148.0390739, "message": "los leo en la noche.", "group_id": 965, "id": 307575}, {"user_id": 12133, "stars": [], "topic_id": 7503, "date_created": 1299697851.2600689, "message": "@soska se podria decir que el primero que aparece gana ?", "group_id": 965, "id": 307547}, {"user_id": 12133, "stars": [], "topic_id": 7503, "date_created": 1299698159.5052631, "message": "me too ...", "group_id": 965, "id": 307579}, {"user_id": 19928, "stars": [], "topic_id": 7503, "date_created": 1299698032.0251861, "message": "pues Biz Stone el cofundador de twitter dijo \"creo que queda mucho espacio para que triunfe otro gigante en internet\"", "group_id": 965, "id": 307564}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299697934.3657789, "message": "Por es un nuevo jugador debe concentrarse en crear una nueva categoría.", "group_id": 965, "id": 307558}, {"user_id": 2946, "stars": [], "topic_id": 7503, "date_created": 1299698004.667398, "message": "el iPhone no fue el primer smartphone, pero fue tan exageradamente diferente a los demás que creo una categoría. Ahora todos los demás están imitando al iphone.", "group_id": 965, "id": 307563}]