[{"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1308950384.9808991, "message": "I could treat this by giving him the trait of \"Re-evaluation\", or I could give him and the Captain a stand-alone relationship throughline.", "group_id": 2515, "id": 1480401}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1308950282.6747229, "message": "The story I'm currently working on has two things built into it that do not necessarily have to be approached by sticking closely to one storyform: a subplot that branches off, and a (metaphorical) father-son relationship that has enough time dedicated to it to make it a developing relationship (and not just a set of characters that interact in the OS).\n\nI hesitate to call the subplot a subplot, even. My main story (the bulk of the OS) takes place on a boat. Four people flee by stealing away on the escape vessel, after which point they have no contact with the original ship.\n\nI have considered doing several things, but have stuck close to letting them just play out the OS. (They are like a \"negative reflection\" character, actually -- they are the OS played out without anyone trying to impede the problem.) \n\nI'm toying with giving them a (severely shortened) storyform.", "group_id": 2515, "id": 1480379}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1308950412.427196, "message": "Has anybody played with things like this? What did you do? Was it effective? Did it add to the storytelling? Etc.", "group_id": 2515, "id": 1480404}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1308950350.07672, "message": "The relationship. \n\nThe Captain is my MC, and his Second Mate is the IC. The First Mate has to play in the middle of them, but has a strong relationship with the Captain. He has to come to his own decision about who to follow.", "group_id": 2515, "id": 1480397}, {"user_id": 30951, "stars": [], "topic_id": 40349, "date_created": 1309125689.300499, "message": "Is there a reason why the first and second mate are not sharing the IC role? Is it that only the second mate has influence with regard to the problem solving?", "group_id": 2515, "id": 1491310}, {"user_id": 36525, "stars": [], "topic_id": 40349, "date_created": 1309124914.7351899, "message": "I dunno if you'd prefer if I didn't respond here.  If so please just ignore this post.  But what you said about the First Mate \"playing in the middle\" and deciding whether to follow the MC or the IC makes me wonder if the First Mate could be an SS character, a partial personification of the relationship between the other two.", "group_id": 2515, "id": 1491206}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309138704.955513, "message": "@sunandshadow It's fine that you respond, so long as you acknowledge that I'm trying to solve this inside the Dramatica paradigm.", "group_id": 2515, "id": 1491990}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309139019.4038899, "message": "@sunandshadow I'm not sure what you mean by an \"SS Character\" or \"partial personification of the relationship.\"\n\nI know that there can be characters that are not part of the OS, but part of the MC Throughline only. (A fairly straightforward example would be the shrink the MC goes to talk to about their problems.) Are you suggesting there could be a similar kind of character confined to just the SS?\n\nAs for \"partial personification of the relationship\"... you mean, like a mood ring?", "group_id": 2515, "id": 1492011}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309139840.712877, "message": "@Mikeaja For a while, I thought maybe they would share the IC position. (One actually began there, and then was moved out by the other character as the outline developed.)\n\nAnd, for the 3rd Act, the 1st Mate *is* stepping in for the 2nd Mate as the IC. (The MC and IC have no contact for this act.)\n\nBut, for acts 1 and 2, the 1st Mate has his own relationship with the Captain. He's almost representing the benchmark, now that I think about it. (Maybe.) If nothing else, he's the one honestly reacting to the Captain and his antics.", "group_id": 2515, "id": 1492058}, {"user_id": 7645, "stars": [], "topic_id": 40349, "date_created": 1309148511.601855, "message": "It sounds like the First Mate is an OS character that can easily fill in for the IC when he is gone. I'm actually doing this right now in my own project. It's just a matter of setting him up early enough so that his takeover of the IC feels natural", "group_id": 2515, "id": 1492758}, {"user_id": 30951, "stars": [], "topic_id": 40349, "date_created": 1309158957.531894, "message": "Just to add to the other point, I don't think having an 'SS character' that resides there is a good way to go. I think I see what that means, but Dramatica is designed around the SS being the MC/IC, and so changing that would suggest a non-Dramatica route, as the tie-in between the two domains is lost.", "group_id": 2515, "id": 1493349}, {"user_id": 10814, "stars": [], "topic_id": 40349, "date_created": 1309183120.1263161, "message": "The Dramatica software does not support populating the non-OS throughlines with other players.  It is completely OK to do so from a theory point of view, but the software does not have tools to facilitate it other than creating them as OS characters.\n\nAnd yes, you may have players that only appear in the non-OS throughlines, though usually writers use OS players to fill in those roles.", "group_id": 2515, "id": 1495503}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309195721.3842649, "message": "So, does anyone actually have any experience with something like this? That's the real question.\n\nFor instance, George Lucas could come and say, \"Well, to really portray Han Solo the way I wanted to, I needed to concoct a story involving Greedo and Jabba the Hut.\" \n\nOr someone else could say, \"I thought I was giving two characters their own small SS throughline, but after I wrote it realized that it was no different than any two OS characters interacting.\"", "group_id": 2515, "id": 1497501}, {"user_id": 36525, "stars": [], "topic_id": 40349, "date_created": 1309200619.34126, "message": "Illustration of SS character who is a partial personification of the relationship:  First, picture a tug-of-war rope with a flag in the middle.  The rope is the relationship.  the character is the flag in the middle, his proximity to one side or the other acts as an indicator of who is winning.  Secondly, consider the domain of the SS.  Is it, for example, manipulation, and does the First Mate exist in the story mainly as an object of Manipulation?  Or is it Fixed Attitude, with each of the MC and IC taking a fixed Attitude, and a major element of the First Mate's character is that he can't/doesn't have Fixed Attitudes, so he exists within the story to waver back and forth?", "group_id": 2515, "id": 1498326}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309202817.4766891, "message": "@sunandshadow That's the position the character is in for sure. \n\nThe question now is, given that the character is in a tug of war and hence changing their loyalty, does that change follow a pattern predictable by a separate storyform? Or, does it even need to?", "group_id": 2515, "id": 1498646}, {"user_id": 36525, "stars": [], "topic_id": 40349, "date_created": 1309203293.014992, "message": "@MikeDerk Have you looked at the Catalyst, Inhibitor, and Benchmark for the SS in your current storyform?  Catalyst and Inhibitor in a non-character throughline correspond directly to Unique Ability and Critical Flaw in a character throughline.  So one possibility is treating these as the First Mate's UA, CF, and benchmark.  Another possibility is, have you looked at the Main vs. Impact Story Character Report and compared it to the portion of the Four Throughlines Themes report which talks about the SS throughline?  These two reports have different things to say about the SS, see if one of them sounds relevant to your character.", "group_id": 2515, "id": 1498718}, {"user_id": 7645, "stars": [], "topic_id": 40349, "date_created": 1309324537.365535, "message": "Or masterful!...it's up to you...:)", "group_id": 2515, "id": 1514984}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309322769.6181259, "message": "@jimhull You're doing an IC handoff, you said. Are you also doing a \"hand-back\" -- that is, does the original IC resume his original spot?\n\nIf yes, what are you doing about the development of the SS in the meantime?", "group_id": 2515, "id": 1514856}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309322808.214056, "message": "@sunandshadow I'll check that out.", "group_id": 2515, "id": 1514862}, {"user_id": 7645, "stars": [], "topic_id": 40349, "date_created": 1309323918.3093131, "message": "Yes, he hands it back. I'm only using him for the Impact Character's Signpost 3 as the \"official\" IC has gone missing. I save the SS stuff until the real guy returns.", "group_id": 2515, "id": 1514934}, {"user_id": 7664, "stars": [], "topic_id": 40349, "date_created": 1309324109.691766, "message": "I don't have enough time after the real guy returns.\n\nI'm trying to see if I can make the relationship with the Problem, as opposed to the personification of the problem (the character). It will make for an interesting bump when one stays the same (the problem) and the other changes. \n\nCould get ugly.", "group_id": 2515, "id": 1514953}]