[{"user_id": 18171, "stars": [], "topic_id": 15022, "date_created": 1300994102.630867, "message": "My wife doesn't understand what it's like to have the entrepreneurial mind set. She'd be happy to work at one job doing one thing for the rest of life. Obviously to me that sounds like a prison sentence, so we often get into arguments about my passion for creating things. And there's nothing to really explain except that it's just my \"essence\" that seeks out new enterprises.", "group_id": 250, "id": 430016}, {"user_id": 24254, "stars": [{"date_created": 1300999521.9389391, "user_id": 22183}, {"date_created": 1301098413.106751, "user_id": 3426}], "topic_id": 15022, "date_created": 1300999149.7135661, "message": "I can understand if your wife is worried about the risk in starting business ventures, but why do you both get in arguments over your creative entrepreneur mind? I am a strong believer that opposites attract so it makes sense why you two are married, but I would think she would find your passion for creation interesting. I have no wife, but my girlfriends in the past are usually impressed by my creativity or creations (then again we don't share income or anything like that)", "group_id": 250, "id": 430827}, {"user_id": 13676, "stars": [], "topic_id": 15022, "date_created": 1300999843.0342169, "message": "same here pskulte... My wife finds my creativity fascinating, not that she understands it but she totally respects that it is a particular mindset that she does not have.  Now she does at times get annoyed as when I start something I will work for days with very little sleep until I get something going.  ", "group_id": 250, "id": 430997}, {"user_id": 24254, "stars": [], "topic_id": 15022, "date_created": 1301000149.1358221, "message": "@justinschultz Yea I have the same problem. I can get really obsessed with something and work on it for days. In fact I didn't hangout with my gf yesterday just so I could work on my blog :/ ....but she understands somewhat", "group_id": 250, "id": 431052}, {"user_id": 18171, "stars": [], "topic_id": 15022, "date_created": 1301004952.958313, "message": "I think it's the risk mainly. But at the core, she doesn't understand what makes me tick in that way. It's frustrating because I tend to work out problems by talking.", "group_id": 250, "id": 431786}, {"user_id": 24254, "stars": [], "topic_id": 15022, "date_created": 1301014619.2937889, "message": "@jwwest I'm the same way I tend to ramble out loud, but then figure it out. Maybe you need to have the conversation you are having on here with her. Just try to lay it out how you think.....put it all on the table. I don't want to be super negative, but it sounds like this is a problem that if you don't fix now you could have worse problems in the future.", "group_id": 250, "id": 433577}, {"user_id": 2060, "stars": [], "topic_id": 15022, "date_created": 1301042244.378051, "message": "nope", "group_id": 250, "id": 436826}, {"user_id": 14142, "stars": [], "topic_id": 15022, "date_created": 1301044712.1430759, "message": "I have support but there are tons of doubts.", "group_id": 250, "id": 437079}, {"user_id": 7577, "stars": [], "topic_id": 15022, "date_created": 1301045437.416662, "message": "Short answer: No.", "group_id": 250, "id": 437167}, {"user_id": 6716, "stars": [], "topic_id": 15022, "date_created": 1301067980.720612, "message": "I've been married 20 years now; my wife has been with the same company for 15 years.  I've been in & out of e-projects, some successful, some not.  We did have some tensions in the beginning about my entrepreneurial tendencies, but they've mellowed over the years.  She views my projects with bemused resignation -- they're my \"thing\".  For my part, I don't try to bug her with stuff she'd rather not know about. Works for us.", "group_id": 250, "id": 439538}, {"user_id": 25399, "stars": [], "topic_id": 15022, "date_created": 1301082642.801496, "message": "Ditto blackstar.  We couldn't be more of two completely different minds on the subject.", "group_id": 250, "id": 442006}, {"user_id": 25441, "stars": [], "topic_id": 15022, "date_created": 1301096611.7729371, "message": "I am lucky. My wife gets it, and while she is stressed by my world, she us part of it and fights alongside me. :)", "group_id": 250, "id": 443345}, {"user_id": 10406, "stars": [{"date_created": 1301376256.7907901, "user_id": 22729}], "topic_id": 15022, "date_created": 1301100523.095881, "message": "Can we re-title the chat with: do you think my wife cares about entrepreneurship?", "group_id": 250, "id": 443678}, {"user_id": 14142, "stars": [], "topic_id": 15022, "date_created": 1301127281.5073209, "message": "No because some of us have a husband. I need to work full time and if I want a business then that will have to be something pursued in my spare time. Is that possible? I should start a new conversation.", "group_id": 250, "id": 445654}]