[{"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1305419606.074537, "message": "Here's a link to some how-to videos I've published on my website: https://sites.google.com/a/frederick.com/example-site-/howto", "group_id": 5971, "id": 1056601}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1306288424.334301, "message": "Get your user name(s) now: http://techcrunch.com/2011/05/24/kohort/", "group_id": 5971, "id": 1172823}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1306438125.4431469, "message": "A note about Branding. A company brand has always been important. Now with the Internet becoming the primary communications, shopping and networking tool for many individuals your on-line brand should be at the top of your priority list. Details like locking down your brand on sites including twitter, facebook, convore and many others are time sensitive. \n\nIt's best that a company's on-line brand have the same attributes as any brand name: Short, easy to spell, memorable and, most importantly: AVAILABLE. It doesn't do a business owner any good to come up with a great brand name only to find out that it's taken on twitter. Or, to find out that the brand is sixteen characters long and twitter has a fifteen character limit. \n\nIn summary, IMO it's best for a business or individual to come up with a brand that is available on the major platforms including the .com URL and then lock it down, promote it and don't look back.\n\nIn this case the ready, fire, aim approach may not be a good idea! ", "group_id": 5971, "id": 1195174}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1307127263.1808879, "message": "You can share a folder in Evernote. Then you can get a public URL to link to. Here's an example: http://www.evernote.com/pub/craigshipp/references", "group_id": 5971, "id": 1279795}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1307140961.9409339, "message": "Looking for a standup desk? The best are made in Alexandria, Virginia http://users.erols.com/standup/standup1.swf", "group_id": 5971, "id": 1282271}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1307479421.3452549, "message": "Here's me working at the standing desk: http://vimeo.com/24787341", "group_id": 5971, "id": 1327657}, {"user_id": 18485, "stars": [], "topic_id": 35331, "date_created": 1307551166.919241, "message": "http://logmein.com (FREE sort of like gotomypc)", "group_id": 5971, "id": 1339112}]