[{"user_id": 33839, "stars": [], "topic_id": 37920, "date_created": 1307063369.341162, "message": "In a sense, I see Conrad as an IC - someone whom Calvin views relationships of his wife through.  There's a key scene in the movie where Calvin visits Conrad's psychotherapist and the discussion is about Conrad and his progress before he has an epiphany, stating \"I think I know why I'm here... I came here because of me\" (or something to that affect).  It's a wonderfully written movie that's more complex than most are willing to given credit for being.", "group_id": 2515, "id": 1273270}, {"user_id": 33839, "stars": [], "topic_id": 37920, "date_created": 1307063049.7372241, "message": "Thought I would bring this up here since I love the movie/script and being familiar with numerous other story theories, I'm still not 100% sure.  Is it Conrad, who needs to overcome his the guilt he's been harboring as a survivor of the accident which took his brother's life, or is it Calvin, the father who realizes during the course of the proceedings that he doesn't love his wife anymore?", "group_id": 2515, "id": 1273222}, {"user_id": 33839, "stars": [], "topic_id": 37920, "date_created": 1307063731.873476, "message": "But I've always viewed Calvin as the MC - his inciting incident being when Beth and he come home from the play (which pertains to the theme, not by coincident), and Beth walks right by Conrad's room without so much as a care.  Calvin's response is quite different - he sees Conrad's light on and looks back to Beth as if \"aren't you concerned?\".  Robert *cough* *cough* McKee (don't ban me for those words) noted in his book that I won't even mention, that the inciting incident was Beth sending the uneaten French Toast to the garbage disposal, but I don't buy that one bit; it relates to the relationship between her and Conrad, not her and Calvin.  Thoughts?", "group_id": 2515, "id": 1273312}, {"user_id": 10814, "stars": [], "topic_id": 37920, "date_created": 1307127497.458149, "message": "In the first story, the ending is Success / Good.\n\nIn the second story, the ending is Failure / Bad (I think, though it might be Failure / Good).", "group_id": 2515, "id": 1279835}, {"user_id": 10814, "stars": [], "topic_id": 37920, "date_created": 1307127348.4980221, "message": "There are two stories in Ordinary People.  The first is about an accident survivor and the long term effects of the accident on the family.  The second is a substory about how parents (and a marriage) suffers with the loss of a child.  Both are tightly wound together and use many of the same players.\n\nIn the first story, Conrad is the MC and his therapist the IC.  His mom is the antagonist.   \n\nIn the second (sub) story, Calvin is the MC and Beth is the IC.", "group_id": 2515, "id": 1279812}, {"user_id": 10814, "stars": [], "topic_id": 37920, "date_created": 1307127423.469573, "message": "In the first story, Conrad is a Change MC and the therapist is the steadfast IC.\n\nIn the second story, Calvin is a Change MC and Beth a steadfast IC.", "group_id": 2515, "id": 1279824}, {"user_id": 33839, "stars": [], "topic_id": 37920, "date_created": 1307134694.8956809, "message": "Thanks, Chris - it certainly helps to view them separately, especially since it's a good example of how characters, as functions, can take on different roles in the same overall story.", "group_id": 2515, "id": 1281119}, {"user_id": 33839, "stars": [], "topic_id": 37920, "date_created": 1307135009.1148629, "message": "I think the second ending would be Failure / Good, as it somewhat tempers the other ending of Success / Good.  Although the marriage has suffered as a result (Failure), this is not a family struggling with a false facade anymore and (I think) we see Conrad/Calvin's relationship as more meaningful as a result (Good), especially in light of Calvin's confession that he doesn't always have all the answers and Conrad's confession of wanting to have him get on his case more often.", "group_id": 2515, "id": 1281178}]