[{"user_id": 7381, "stars": [{"date_created": 1299170867.1542189, "user_id": 7376}], "topic_id": 10470, "date_created": 1299149307.4795649, "message": "The biggest thing I'm missing from Convore is some kind of \"View new content\" functionality - all topics from all the groups I've registered interested in, in reverse chronological order of their last message.", "group_id": 88, "id": 259496}, {"user_id": 17551, "stars": [], "topic_id": 10470, "date_created": 1299149593.314379, "message": "It says it will email you when there is new stuff posted.", "group_id": 88, "id": 259503}, {"user_id": 7381, "stars": [], "topic_id": 10470, "date_created": 1299149412.0368459, "message": "On regular forums, I pretty much never browse folders/sections, I always use this kind of functionality. If the forum has significant volumes of posts in folders/sections I'm not interested in, I script 'em away, but Convore's opt-in system would negate the need to do that.", "group_id": 88, "id": 259500}, {"user_id": 17551, "stars": [], "topic_id": 10470, "date_created": 1299151202.635015, "message": "Also in the list of topics it says when there is unread new stuff. I think this is really amazing. I have been using it for a few hours now and I think it cool. And I'm not easy to please at all.", "group_id": 88, "id": 259606}, {"user_id": 7381, "stars": [], "topic_id": 10470, "date_created": 1299150081.968647, "message": "I'd rather not use my email account to keep track of what's going on on the hip and happenin' web", "group_id": 88, "id": 259527}, {"user_id": 7381, "stars": [], "topic_id": 10470, "date_created": 1299163226.9499011, "message": "...which requires you to go into each group to see what's new. The groups dropdown has a list of new stuff, but it's not much good when you come back the next day and you're back up to 300+ unread.", "group_id": 88, "id": 260351}, {"user_id": 9108, "stars": [], "topic_id": 10470, "date_created": 1299165600.6109419, "message": "@insin I'm not in that many groups right now, so even after 12+ hours of not checking, the Groups drop-down is still helpful to me. However, as the site grows in popularity and gets more users, I think a lot of the chats will move much more quickly and the Groups list will become less and less useful. There will just be too many updates for it to display pertinent information.", "group_id": 88, "id": 260648}, {"user_id": 17469, "stars": [], "topic_id": 10470, "date_created": 1299191732.8943679, "message": "Comeon guys, @Leah and others, use some histogramming and give us a ticker on the bottom with the updates on the threads we frequent the most...", "group_id": 88, "id": 264693}]