[{"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325118257.382272, "message": "Not Safe For Wife", "group_id": 965, "id": 2747944}, {"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325105909.3749349, "message": "Les presento el ultimo emprendimiento en el que estoy trabajando es una red social para adultos, este es mi mercado, soy cofounder de Giomexia.com servimos cerca de 10 millones de visitas al mes con varios de nuestros sitios para adultos. Me decidí a lanzar esta idea a andar para convertir a parte de nuestro trafico en usuarios... lanzamos el sitio el 12 de noviembre tenemos ya cerca de 6500 usuarios registrados...", "group_id": 965, "id": 2747917}, {"user_id": 2946, "stars": [], "topic_id": 48962, "date_created": 1325117365.977896, "message": "Dude. Le voy a añadir un [NSFW] al título.", "group_id": 965, "id": 2747942}, {"user_id": 42166, "stars": [], "topic_id": 48962, "date_created": 1325118188.0438559, "message": "No estoy muy seguro del modelo de ingresos. Creo que hace muy compleja la monetizacion. Me suen mas factible un trial o una parte del contenido freemium y otra pagada...en ese caso necesitas volumen que aun no tienes....es solo una opinion :)", "group_id": 965, "id": 2747943}, {"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325106210.5604069, "message": "Soy principalmente cofounder \"no tecnico\" por ello estoy buscando a algún ninja (con espada y todo) que quiera un 10% de acciones en Zubby, que sea técnico, que tenga cierta experiencia, ideas claras... tengo ya un modelo de negocio que podría ser interesante y me gustaría platicarlo con los interesados... Ademas ofrezco un pago de 500 USD al mes para \"gastos\" mientras recibimos financiamiento...", "group_id": 965, "id": 2747918}, {"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325106518.4928341, "message": "Algunos datos, desde el día del lanzamiento:\nPageviews: 3.040.997\nUsers: 6587\nIdentificaciones: 21.344 (promedio 3.5 veces a visitado un usuario Zubby)\nEmails Enviados: 254.420", "group_id": 965, "id": 2747919}, {"user_id": 22259, "stars": [], "topic_id": 48962, "date_created": 1325110730.7243941, "message": "¿Cómo lo quieren monetizar? ¿Solamente con ads?", "group_id": 965, "id": 2747929}, {"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325112233.5800469, "message": "Tenemos varias ideas para hacerlo.\n1. Crear una propia moneda interna y permitir a los usuarios vender su contenido por micropagos, 1 credit por visualizar 1 video original y 100% amateur.\n2. Ads internas para montar un Adult Adnetwork, usando CPM, CPC y CPA.\n3. Creacion de una API para desarrollar juegos sociales para adultos\n4. Permitir el ingreso de webcammers que quieran ofrecer sus servicios.\n1 y 4, ganar comision sobre la compra de credits. \n\nLas propuestas las tengo con muchos detalles, esto es solo para dar una idea...", "group_id": 965, "id": 2747932}, {"user_id": 29866, "stars": [], "topic_id": 48962, "date_created": 1325118922.823169, "message": "@cfarias No cobrar por el contenido actual por crear tu perfil y para registrarse es parte esencial del \"Customer Acquisition\", tengo otra forma que planteo para monetizar que se basa en la creación de perfiles para empresas en el sector que estén interesadas en tener contacto directo con sus clientes, en ese modelo planteo un freemium model que se basa en darle gratis al negocio su pagina, generar leads en ella, tener contacto, subir vídeos de sus negocios, fotos y contactos. Un ejemplo: http://minus.com/mMlHqUPvN#1o la categoria de negocios son : Night Clubs, Bares, Sexy Shop, Tiendas de Lencería, Masajes, Clubes etc...", "group_id": 965, "id": 2747946}, {"user_id": 40418, "stars": [], "topic_id": 48962, "date_created": 1325139578.8475749, "message": "@josuegio nosotros tenemos un perfil técnico y necesitamos esa visión de alguien  orientado a la mercadotecnia y difusión del producto que ya tenemos, podriamos intercambiar ideas y a ver que sale, como ves?? ricardo@optimit.com.mx", "group_id": 965, "id": 2748032}]