[{"user_id": 26086, "stars": [], "topic_id": 20009, "date_created": 1303080957.700758, "message": "A good index! Especially by ingredient, like bean, zucchini, tofu, etc.", "group_id": 7210, "id": 719419}, {"user_id": 29996, "stars": [], "topic_id": 20009, "date_created": 1303081072.6488659, "message": "Pictures.  Low fat (no oil etc).  Whole food plant based recipes.  Simple/few ingredients.", "group_id": 7210, "id": 719427}, {"user_id": 25797, "stars": [], "topic_id": 20009, "date_created": 1304343893.7366691, "message": "I have to agree, a good index by ingredient is a BIG plus.  Pictures in a cookbook always make me buy it.   And substitutions for ingredients that you might not have on hand that day is a huge help!", "group_id": 7210, "id": 883030}, {"user_id": 12716, "stars": [], "topic_id": 20009, "date_created": 1304469074.4995561, "message": "@Abbeygirl Noted", "group_id": 7210, "id": 904793}, {"user_id": 22946, "stars": [], "topic_id": 20009, "date_created": 1304899547.150835, "message": "@StephORama It took me a long time but i did it by ingredient--except for things like spices.", "group_id": 7210, "id": 962532}, {"user_id": 22946, "stars": [], "topic_id": 20009, "date_created": 1304899570.809737, "message": "@jrhicks both this book and my last one are full of pictures, no oil, everyday ingredients and whole foods!", "group_id": 7210, "id": 962536}, {"user_id": 24570, "stars": [], "topic_id": 20009, "date_created": 1305092351.3815701, "message": "Pictures of each recipe would be ideal. Even if some are smaller than the ones in your current book, just so that you have a general idea of what you're cooking and how it would look. I've only cooked the recipes that have pics so far! :D", "group_id": 7210, "id": 1002344}, {"user_id": 42626, "stars": [], "topic_id": 20009, "date_created": 1319682301.755353, "message": "Pictures are awesome! It's great to get an idea of where I'm heading while I'm cooking. Also, I value the cookbooks I own that have recipes I can't find somewhere else or aren't something I could have figured out how to make myself or have new ways of cooking things I haven't seen before. Nothing will get a cookbook off my shelf and off to Goodwill faster than calling for weird, expensive ingredients or is simply a rehash of recipes that I currently have in another book.", "group_id": 7210, "id": 2443478}]