[{"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304605293.8587129, "message": "ALguem pensa que a não existencia de rede de segurança, é só pontos positivos no que respeita a desenvolvimento de um projecto ?", "group_id": 6883, "id": 929673}, {"user_id": 32321, "stars": [], "topic_id": 33828, "date_created": 1304605919.0189159, "message": "depende, mas como dizia, eu falava da questão lei do trabalho. a lei sinceramente é muito subjectiva, se trabalhas numa agência web por ex (produz sites...) e vais fazer um shopify ou um  vendder estás sempre a fazer concorrência.", "group_id": 6883, "id": 929817}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304604904.252562, "message": "Penso que existe um mito por detrás deste tópico, e que certamente gerará muitas opiniões distintas, eu pessoalmante já pensei que sim, mas mudei de opinião.", "group_id": 6883, "id": 929560}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304607561.051307, "message": "a lei não é assim tão vaga, penso que se te informares terás uma agradável surpresa", "group_id": 6883, "id": 930234}, {"user_id": 32321, "stars": [], "topic_id": 33828, "date_created": 1304607436.9269791, "message": "não é a questão de criar projectos, a questão é criar projectos que afectam concorrencialmente o teu empregador: ex agência web, faz sites (empresariais, lojas online, etc etc) e tu tens em mente criar um serviço de lojas (shopify, vendder) o serviço não é o mesmo mas tás a fazer concorrencia.", "group_id": 6883, "id": 930188}, {"user_id": 32321, "stars": [], "topic_id": 33828, "date_created": 1304607537.8113301, "message": "isto também é tudo sem certezas, mas dá me a ideia que quem está em agências de comunicação é sempre quem se lixa mais (a concorrência aí é muito vaga) ao contrário de alguém que por ex é programador/designer num SAPO por ex(disse SAPO por dizer...)", "group_id": 6883, "id": 930225}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304607219.6313021, "message": "Estas a dizer que por seres programador informatico, jamais poderás programar fora do teu ambiente laboral. Isso é errado, a lei da não concorrência, pelo que sei (e nao sou entendido na matéria), é muito menos lata do que isso. Obviamente não podes criar concorrência ao teu empregador, leia-se criar uma empresa na mesma área, daí a não poderes criar projectos vai uma grande distância. A não ser que o teu empregador tenha projectos muito parecidos ao que queres criar e aí é óbvio que não podes, estás a criar concorrência directa usando conhecimento adquirido.", "group_id": 6883, "id": 930122}, {"user_id": 32321, "stars": [], "topic_id": 33828, "date_created": 1304607800.881104, "message": "não calma, não confundir o trabalhar actualmente com essas cláusulas sem sentido nenhum que é o \"ficar X meses sem trabalhar na mesma área\", falo no preciso momento. mas sim tenho que tentar saber melhor, com o unico advogado que falei respondeu-me isto mesmo \"é sempre demasiado vago, se a entidade empregadora provar que tem capacidade para produzir esse mesmo produto...\" só que lá... vago arg :\\", "group_id": 6883, "id": 930299}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304607723.7004809, "message": "Bom texto sobre isso: http://emprego.sapo.pt/executivo/guia-carreira/artigo/55/artigo.htm", "group_id": 6883, "id": 930289}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304607658.484252, "message": "Senão, imagina, quando alguém saísse de uma agência web, não podia trabalhar noutra agência web nos próximos tempos á imagem desse pacto de não concorrência.", "group_id": 6883, "id": 930278}, {"user_id": 31504, "stars": [], "topic_id": 33828, "date_created": 1304607874.978054, "message": "basicamente penso que, se a ctividade que estas a desenvolver não tiver o potencial de retirar clientela ao teu empregador, nao tens que te preocupar. mas e informares por escrito o teu empregador que estas a fazer X e tentares autorizacao, ano resulta no teu caso ? É uma solução.", "group_id": 6883, "id": 930312}]