[{"user_id": 11626, "stars": [], "topic_id": 6245, "date_created": 1297814948.2537911, "message": "There is no equivocation in how the Israeli military views cyber-security. “Using computer networks for espionage is as important to warfare today as the advent of air support was to warfare in the 20th century,” says Maj. Gen. Amos Yadlin, chief of military intelligence.\r\n\r\nSpeaking recently at the Institute for National Security Studies (INSS) here, Yadlin says the ability to collect information and launch cyber-attacks gives small countries, terror groups and even individuals the power to inflict serious damage unlimited by range on a target — the kind of damage that was once the province of large countries.\r\n\r\nNoting that the U.S. and Britain are setting up cyber-warfare commands, Yadlin says Israel has its own soldiers and officers working on an “Internet warfare” team dedicated to cyber-security. The issue is critical for many governments. In the U.S., Lockheed Martin recently opened the NexGen Cyber Innovation and Technology Center to address global cyber-security needs. The company has helped launch an industry association focusing on providing government, business and industry (including defense contractors) with integrated cyber-security solutions.\r\n\r\nIn confronting cyber-attacks, military intelligence has become a combat arm of the Israel Defense Forces (IDF). Computer networks are being exploited by hacking into databases or carrying out sabotage with malicious software (malware) that infiltrates and inflicts damage in adversary computers.\r\n\r\nTo counter cyber-attack, Yadlin says Israel’s armed forces have the means to provide adequate network security. “The cyber-warfare field fits well with Israel’s defense doctrine.”\r\n\r\nThe ubiquity of the Internet and its ease of use make it vulnerable to infiltration, exploitation and sabotage. IDF intelligence estimates that several countries in the Middle East use Russian hackers and scientists to operate on their behalf. Since the 2006 war against Hezbollah, when cyber-warfare was part of the conflict, Israel has attached growing importance to cyber-tactics.\r\n\r\nIsrael in fact is, along with the U.S., France and a couple of other nations, a leader in cyber-war planning. Cyber-warfare teams are integrated within Israel’s spy agencies, which have rich experience in traditional sabotage techniques.\r\n\r\nIsrael’s high-tech industry is at the forefront of computer and software development, particularly in the areas of security and communications. Companies such as Comverse and Nice Systems are world leaders in “legal eavesdropping” networks, while Checkpoint Software is an innovator in network security. Many international high-tech companies are locating research and development operations in Israel, where local hires are often veterans of the IDF’s elite computer units.\r\n\r\nIn fact, most of Israel’s technical know-how originates from the army, especially the computer and C4I (command, control, communications, computers and intelligence) division of the intelligence branch. Veterans of these specialized units have become the mainstay of top-secret work at tech companies.\r\n\r\nWhile it is clear Israel has successfully used cyber-tactics against enemies, it is harder to know to what extent it has been hit by cyber-attacks. Israel says little about its cyber-operations, but occasional leaks point to a trend of active involvement by computer experts in covert and sometimes overt operations.\r\n\r\nRead the rest of this story, debate the usefulness of Strykers in The Stan, check out whether Germany will send in more troops and learn about ARGUS from our friends at Aviation Week, exclusively on Military​.com.\r\n\r\nhttp://defensetech.org/2010/02/11/israel-adds-cyber-attack-to-idf", "group_id": 3920, "id": 116940}]