[{"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307029620.8996091, "message": "Is there that FEDs can write templates using django's syntax (inc inheritance) and simply compile this down to HTML without needing a working django install", "group_id": 81, "id": 1268118}, {"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307029498.576575, "message": "Just wanted to canvas opinion on the best ways of working with front-end developers.", "group_id": 81, "id": 1268108}, {"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307029576.5938759, "message": "We have several projects where FEDs handle the mark-up, CSS and javascript writing at the same time as the django back-end is being put together.  The simplest option seems to be to get FEDs to product flats which are sliced into the templates and Django's template syntax later on.  However this leads to lots of copy and paste.", "group_id": 81, "id": 1268113}, {"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307031961.3154311, "message": "Another option is to set up a dev site on a server that allows templates/css/js to be FTPed up by FEDs.  I'm not quite sure of the best way of touching the WSGI file, maybe using inotify or a minutely cron job.", "group_id": 81, "id": 1268487}, {"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307031838.163641, "message": "In general, I'm not convinced that installing django locally for all FEDs is the right way, as many of them use windows and it puts an overhead on developers to make sure FEDs have got everything set-up.", "group_id": 81, "id": 1268469}, {"user_id": 5981, "stars": [], "topic_id": 37845, "date_created": 1307030252.647006, "message": "I don't know how a way to leverage django's template engine without having django installed. Having said that, it would seem simple to setup a single view that takes a template path as a parameter then renders the template. You'd need a minimal settings module that defines static files and template locations, and a root url conf (for the custom view)....", "group_id": 81, "id": 1268219}, {"user_id": 1806, "stars": [], "topic_id": 37845, "date_created": 1307031991.0114729, "message": "Anyway - those are my disparate thoughts.  How do other django devs work with FEDs?", "group_id": 81, "id": 1268493}, {"user_id": 1147, "stars": [{"date_created": 1307309778.023385, "user_id": 27140}], "topic_id": 37845, "date_created": 1307033499.1591871, "message": "We keep a Django install on our dev server that FEDs access thru SCP. It seems everyone knows how to do that least. We then have a Django dev review the changes and commit from that environment.", "group_id": 81, "id": 1268688}, {"user_id": 31790, "stars": [], "topic_id": 37845, "date_created": 1307039339.8518331, "message": "One of the things I really like about the TAL syntax for templates is that a browser or WYSIWYG editing tool can make sense of it without passing it through a template engine. Makes round-tripping between a designer and developer a bit easier.", "group_id": 81, "id": 1269671}, {"user_id": 35069, "stars": [], "topic_id": 37845, "date_created": 1307102678.0962451, "message": "Good question, we generally just let the FEDs do everything in HTML/CSS, after which the developers jump in and put the variables and loops in. It's horrible, there must be a better way!", "group_id": 81, "id": 1276587}, {"user_id": 1243, "stars": [{"date_created": 1307212264.34953, "user_id": 1081}, {"date_created": 1307214027.9092791, "user_id": 22794}, {"date_created": 1307285289.5521171, "user_id": 8384}, {"date_created": 1307933355.8661051, "user_id": 5778}, {"date_created": 1311321252.517576, "user_id": 35545}, {"date_created": 1311709316.537173, "user_id": 4858}], "topic_id": 37845, "date_created": 1307108340.1628489, "message": "A major design goal of Django's templates is to make it possible for front-end developers to be able to edit the templates themselves. I'd argue that your FEDs should work with a checkout from the same source control everybody else is using, and interact w/ developers when they need new things in the context or a new template tag, etc.", "group_id": 81, "id": 1277307}, {"user_id": 34431, "stars": [], "topic_id": 37845, "date_created": 1307127300.458662, "message": "Is there any UML-esque contract/agreement language that could be written up for each view/template outlining what is available to the FED in terms of variables? There isn't much to learning the templating language. I can imagine the problems arising when they learn the template language, and then learn that the developers can write custom template tags to get exactly what the want", "group_id": 81, "id": 1279803}, {"user_id": 33202, "stars": [], "topic_id": 37845, "date_created": 1307213217.8210471, "message": "*amount", "group_id": 81, "id": 1287961}, {"user_id": 33202, "stars": [{"date_created": 1307213353.613904, "user_id": 1081}, {"date_created": 1307224331.693995, "user_id": 5350}, {"date_created": 1307237768.232337, "user_id": 28384}], "topic_id": 37845, "date_created": 1307213210.061234, "message": "I've had a good about of success with having front-end and other non-pythonistas modify templates on the fly using django-dbtemplates https://github.com/jezdez/django-dbtemplates/", "group_id": 81, "id": 1287957}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307233042.9538879, "message": "This whole FED is actually the main reason I enjoy working in small more-permanent teams - the overhead of setting one permanent install is severely less than working with a different freelancer with their own environment each week.", "group_id": 81, "id": 1290295}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307232970.963454, "message": "I'm seriously against storing templates in the database; that doesn't allow the front enders to develop in their own environment or if they did, would involve a lot of copy pasting which is notoriously error prone. I can't think of a single good FED who would rather code in a fancy textarea rather than what they're used to.", "group_id": 81, "id": 1290291}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307233130.0389309, "message": "re @codeinthehole's \"program that simply compiles this down to HTML without needing a working django install\". I don't know of one but that certainly sounds like a good solution if it were possible.", "group_id": 81, "id": 1290301}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307233196.252425, "message": "We're looking into Vagrant at the moment to set up some headless VM environments so the FEDs and backenders can share the same env. I can't see a better solution for now.", "group_id": 81, "id": 1290304}, {"user_id": 9307, "stars": [], "topic_id": 37845, "date_created": 1307254867.4399419, "message": "Trying to get non-programmers into our workflow at work has been an ongoing problem.  It's not that the template language is too hard for someone with a little HTML experience, but that setting up a dev environment puts designers/HTML guys WAY outside their comfort zones.  So we typically have a separate install of the site for the frontend guy to hack on, and then a dev merges their changes in.", "group_id": 81, "id": 1291829}, {"user_id": 9307, "stars": [{"date_created": 1307344047.339951, "user_id": 35238}], "topic_id": 37845, "date_created": 1307254984.4697621, "message": "That being said, I made a little App Engine app where you can put in your own dummy data (in YAML) and have it rendered into a template.  See http://tmplatur.appspot.com/. The idea was to use it when interviewing candidates, but it might be useful for prototyping beyond that even.", "group_id": 81, "id": 1291839}, {"user_id": 33202, "stars": [], "topic_id": 37845, "date_created": 1307308918.9060481, "message": "@djm what I've done is setup a custom admin form that allows the FED to upload their template directly into dbtemplates - it wouldn't be a big stretch to build a small python script that could automate the upload (through piston/tastypie) in a way similar to dropbox", "group_id": 81, "id": 1295760}, {"user_id": 3354, "stars": [], "topic_id": 37845, "date_created": 1307368384.132499, "message": "@pastylegs Is there a page template that can be used initially to dump the context in s way that's usable by the designers? That might help ...", "group_id": 81, "id": 1303315}, {"user_id": 3978, "stars": [], "topic_id": 37845, "date_created": 1307373624.5014839, "message": "debug-toolbars template context feature is very good for FED.", "group_id": 81, "id": 1304613}, {"user_id": 209, "stars": [], "topic_id": 37845, "date_created": 1307381106.397697, "message": "It sounds like there is real opportunity here for developing a small runserver + desktop app where you can plug in context and render a template.", "group_id": 81, "id": 1306939}, {"user_id": 3978, "stars": [], "topic_id": 37845, "date_created": 1307390915.7232771, "message": "@issackelly Shopify used to have server you could download called vision (http://wiki.shopify.com/Vision) that worked like that. It was basically just a rails app that got its data from a text file.", "group_id": 81, "id": 1310673}, {"user_id": 1782, "stars": [{"date_created": 1307520988.8229461, "user_id": 6396}], "topic_id": 37845, "date_created": 1307515032.4071729, "message": "This may help https://github.com/ryszard/django-template-previewer", "group_id": 81, "id": 1334412}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307521621.3844869, "message": "Looks like a step in the right direction certainly but a) still requires a Python installation. 2) Still requires knowledge of the command line. 3) Last commit was 2008 :/", "group_id": 81, "id": 1334890}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1307522146.0120871, "message": "By Python installation I mean it's a Django app; so if you wanted to get this running you'd still need to check out all your code, install Python, maybe mess around with virtualenvs, install Django, hookup the urls to use this, hope that initialising your app doesn't require a db call (else you'll have to be setting that up too). It doesn't really solve the issue of not wanting to do all this in a front-enders's environment.", "group_id": 81, "id": 1334941}, {"user_id": 1243, "stars": [], "topic_id": 37845, "date_created": 1307544355.3630149, "message": "@djm In general, setting up a new dev environment shouldn't be that big a deal. If it's too hard for a front-end person, it may be too hard in general. But even assuming (for the sake of argument) that you've simplified the process as much as possible and it's still just Too Hard™, it is probably still easier on the devs to set it up once (and then update as necessary, though it probably shouldn't be that often, especially if you script it) and then unleash the FEDs on the templates proper than to have some manual process where the devs have to manually port every change from the FEDs mock environment to the templates.", "group_id": 81, "id": 1337762}, {"user_id": 5863, "stars": [], "topic_id": 37845, "date_created": 1307549482.369688, "message": "Having a vagrant managed virtual machine, and managing the software on it with puppet or chef feels like the best solution here. That way you can have other people manage the development environment for your designer or front end dev", "group_id": 81, "id": 1338848}, {"user_id": 6396, "stars": [], "topic_id": 37845, "date_created": 1311282884.068985, "message": "@garethr Exactly what we've ended up doing and quite frankly it's brilliant because we can use the very same puppet manifests/modules for our EC2 production builds.", "group_id": 81, "id": 1692692}, {"user_id": 33202, "stars": [], "topic_id": 37845, "date_created": 1311350313.9988351, "message": "We also use virtual machines to solve the problem", "group_id": 81, "id": 1699365}, {"user_id": 34360, "stars": [], "topic_id": 37845, "date_created": 1311773461.7984071, "message": "Local Django install + Fabric scripts to help them set things up. And these devs are on Windows as well. There's a bit of pain here and there (mostly up-front, other than that, just packages that don't install via pip on Windows like lxml, psycopg). This also means they can deploy their changes to staging when they want rather than having to check in and bug me.", "group_id": 81, "id": 1731059}]