[{"user_id": 22078, "stars": [], "topic_id": 19775, "date_created": 1302926285.453625, "message": "I would like to find out how you setup a staging site and how it's meant to be used. I've used Fabric to deploy to the production server but I'm curious on how to setup a staging sub domain or server. If anyone knows of a video that shows or explains it, that would be awesome! thanks!", "group_id": 81, "id": 708668}, {"user_id": 1736, "stars": [{"date_created": 1303095585.3381021, "user_id": 20170}, {"date_created": 1303105024.6310461, "user_id": 22078}], "topic_id": 19775, "date_created": 1302932934.652957, "message": "If you use Chef, it is nice and easy :-) Just spin up a new machine with a different environment tag.", "group_id": 81, "id": 709071}, {"user_id": 25337, "stars": [], "topic_id": 19775, "date_created": 1302946838.7771449, "message": "I use staging as a dry run area for production deploys. So whatever production does, staging does that too!", "group_id": 81, "id": 710016}, {"user_id": 26100, "stars": [], "topic_id": 19775, "date_created": 1302966942.6283481, "message": "In environments where data changes frequently on the production servers (a CMS system or one with user generated content) while development is ongoing, staging servers are a good place that code going downstream can meet content coming upstream for QA in a non-critical/non-blocking environment.", "group_id": 81, "id": 711315}, {"user_id": 20278, "stars": [], "topic_id": 19775, "date_created": 1302971429.023932, "message": "@coderanger: does it make sense to use Chef for deployments with just one production server?", "group_id": 81, "id": 712016}, {"user_id": 1736, "stars": [{"date_created": 1303018561.971988, "user_id": 11971}], "topic_id": 19775, "date_created": 1302972232.0647631, "message": "@eallik Sure, even with one server you still need to be able to remake it repeatably for alternate environments (like this question asks about) or for in the event of a failure. Also things almost never stay as just one server forever, and having full automation from the start means one less thing to worry about when looking to scale up.", "group_id": 81, "id": 712136}, {"user_id": 11971, "stars": [], "topic_id": 19775, "date_created": 1303018540.1555209, "message": "+1 for the Chef recommendation... No matter how big or small your environment, Chef can help you sanely manage your environment(s).", "group_id": 81, "id": 715632}]