[{"user_id": 13109, "stars": [], "topic_id": 16205, "date_created": 1301482680.5182109, "message": "Been catching up on the DUG podcasts and had the chance to rewatch Michael Clayton. On first view when it came out I didn't rate the film that much. I think it must have been so dense with material that I missed a lot of the points that I needed to understand to enjoy the film.\n\nRewatching it has catapulted it up my list of favourite films. I am amazed how good this movie actually is. Listening to the podcast just clarified how well structured this film was. Very, very impressed by this film.", "group_id": 2515, "id": 480724}, {"user_id": 13109, "stars": [], "topic_id": 16205, "date_created": 1301482769.070787, "message": "I am a bit confused as to the seeming difference in accuracy and acceptability of behaviour.  Is there distinction between the two?  I have heard accuracy be talked of tolerances, and brought with the meaning of acceptable behaviour a couple of times in the podcasts.\n\nWould this be the way we would most likely see the element of accuracy shown on the big screen, i.e. acceptable/non-acceptable behaviour.  ", "group_id": 2515, "id": 480740}, {"user_id": 13109, "stars": [], "topic_id": 16205, "date_created": 1301482729.368284, "message": "One thing that confused me a little in listening to the podcast is regarding the element of \"Accurate\". A word that came up in the podcast to \"define\" accurate was being \"within tolerances\". Which I would understand in the engineering sense. How close are you to being exact.\n\nIn the discussion though, tolerances seemed to take on a meaning of \"tolerable\" and what behaviour could/should be \"tolerated\" and hence became more concerned with acceptance rather than accuracy.\n", "group_id": 2515, "id": 480735}, {"user_id": 10814, "stars": [], "topic_id": 16205, "date_created": 1301499490.4770701, "message": "Excellent question.\n\nHere's a round-about way of saying, \"Yes...sort of.\"\n\nThe Dramatica structure is somewhat fractal in nature, meaning the same patterns are repeated at varying scales to create a complexity of patterns.  It also represent something we call \"frictals\", by which we mean the patterns of friction between the relationships of structural items.  In that way, some structural items seem VERY similar to others, particularly at the element level.  Very often the difference between these similar structural items are the context(s) within which they exist.\n\nFor instance, the Past is similar to Memories, but the Past is in Situation (external stasis), while Memories are in Fixed Attitude (internal stasis).  Pursue is a motivation, while Proaction is a methodology, though they can often be confused with one another, especially once they have been encoded into storytelling.\n\nAccurate is a similar echo of Acceptance, though Accurate is a standard of Evaluation, whereas Acceptance is a methodology.  If I wanted to split hairs, I'd say one difference between Acceptance and Accurate  is the difference between Accept and Acceptable.  Even that analogy is \"accurate,\" though not exactly correct because it still does not take the larger context into account.", "group_id": 2515, "id": 482398}]