[{"user_id": 3617, "stars": [], "topic_id": 12129, "date_created": 1299792578.520241, "message": "So I'm getting ready to deploy a pyramid app on my server. I claim to be totally ignorant and am poking at different ways of doing this. It's not the end of the world if I bork something, but I'd rather not. I'd like to hear how other pyramid folks are doing this. ^_^", "group_id": 2163, "id": 316568}, {"user_id": 7375, "stars": [], "topic_id": 12129, "date_created": 1299793245.978092, "message": "Buildout and fabric. Mostly buildout.", "group_id": 2163, "id": 316695}, {"user_id": 3617, "stars": [], "topic_id": 12129, "date_created": 1299795637.0818081, "message": "@reedobrien That's comforting to hear since that was exactly what I'm looking at doing. ^_^", "group_id": 2163, "id": 317149}, {"user_id": 16196, "stars": [], "topic_id": 12129, "date_created": 1299800283.386409, "message": "Remotely, I use a bizarro mix of i) Apache mod_fcgi (for devt and staging sites) with supervisor-configured, fcgi-on-demand Pylons/Pyramid paster apps and ii) Apache mod_proxy with ProxyPass to supervisor-controlled running paster apps (for the production sites). It's light traffic tho'. Initial server-side deployment is via cloning of private bitbucket repos. Locally, I just run paster out of iTerm and use rsync to keep local and remote devt apps in synch with occasional commits to the repos. I use a silverlining script for maintaining a separate cloud-based Pylons app.", "group_id": 2163, "id": 317611}, {"user_id": 20261, "stars": [], "topic_id": 12129, "date_created": 1299817017.15804, "message": "We use supervisord to manage pools of gevent or pastehttp served apps behind either haproxy or nginx in development (then an F5 in production). We give each app it's own virtualenv and use git to track the changes to that environment and all the configuration related to it. Via an irc bot and fabric, developers can release packages to an internal package repository and then push them to a virtualenv and cycle the servers. \n\nIn general, provisioning a new environment for a new node is just a matter of tweaking the config and either doing a git clone (or using pip freeze to pull out a set of dependencies).", "group_id": 2163, "id": 319269}, {"user_id": 7375, "stars": [], "topic_id": 12129, "date_created": 1299821903.7151899, "message": "we used supervisor for some processes, too", "group_id": 2163, "id": 319620}, {"user_id": 19652, "stars": [], "topic_id": 12129, "date_created": 1299827663.986738, "message": "Right now I just push it to a silverlining node", "group_id": 2163, "id": 320248}, {"user_id": 7364, "stars": [], "topic_id": 12129, "date_created": 1299844695.8198011, "message": "Some security issues to consider: ensure WebError debug is off, CSRF enabled, XSS filtering on for Mako or template engine of choice.", "group_id": 2163, "id": 321489}]