[{"user_id": 28418, "stars": [], "topic_id": 18277, "date_created": 1302461114.8296399, "message": "The possibilities at the new Gangplank Tucson were endless with all that space. It was pretty cool!!", "group_id": 8644, "id": 612345}, {"user_id": 4765, "stars": [], "topic_id": 18277, "date_created": 1302465957.858984, "message": "kart track :)", "group_id": 8644, "id": 613116}, {"user_id": 4765, "stars": [], "topic_id": 18277, "date_created": 1302467238.2589929, "message": "@smjacob well we were also told we'd be meeting potential anchors.. sounds like they're way behind that and just had ppl that had heard about it. it's cool tho we just need to find a few strong anchors to hold it down and it'll catch", "group_id": 8644, "id": 613360}, {"user_id": 28418, "stars": [], "topic_id": 18277, "date_created": 1302466563.7936151, "message": "@chuckreynolds totally agree! Kart track all the way!", "group_id": 8644, "id": 613199}, {"user_id": 4765, "stars": [], "topic_id": 18277, "date_created": 1302466718.32164, "message": "@smjacob That space seems to be a commercial location for Bob... like the shows and rollerderby thing.. which I think is fine but ....", "group_id": 8644, "id": 613251}, {"user_id": 4765, "stars": [], "topic_id": 18277, "date_created": 1302466774.727823, "message": "What I wanted to see more of is how they're planning on utilizing the space for gangplank. saw the hacker space thing... and the future raw food cooking area... the bookmans warehouse part... so i'm assuming the shared work space would be in that one room we ate at???  idk just wanted to see more fleshed out ideas/layout for that.", "group_id": 8644, "id": 613275}, {"user_id": 28418, "stars": [], "topic_id": 18277, "date_created": 1302467073.3626051, "message": "Yea well my understanding was that was the very initial kickoff so those ideas still need to be fleshed out.   Maybe we need to do a huge GP Tucson Ikea run ? ??", "group_id": 8644, "id": 613344}, {"user_id": 28438, "stars": [], "topic_id": 18277, "date_created": 1302523799.3990409, "message": "There were potential anchors there, and we're currently looking at about 6-7 weeks til opening.  I was able to get us that big room, but the hackspace, kitchen and studio (we skipped Beaudry's media center next door to GP) are there and rife with potential.  I'm planning on a follow up meeting to start fleshing out layout, (and Ikea runs).", "group_id": 8644, "id": 623201}, {"user_id": 28438, "stars": [], "topic_id": 18277, "date_created": 1302528597.927695, "message": "For that follow up meeting, we're discussing using a Gamestorming presentation and session to discuss what the space needs, the schedule for certificate of occupancy and what the next steps are.  Probably next week... setting it up today.", "group_id": 8644, "id": 623865}, {"user_id": 28859, "stars": [], "topic_id": 18277, "date_created": 1302566958.1244099, "message": "@chuckreynolds we had conversations with many of the potential anchors to flesh out what they were looking for at the tour. The next step is to actually get them in the space.", "group_id": 8644, "id": 632624}, {"user_id": 28771, "stars": [], "topic_id": 18277, "date_created": 1302702226.0866511, "message": "Sorry, but what is the kart track reference about?", "group_id": 8644, "id": 665137}, {"user_id": 28859, "stars": [], "topic_id": 18277, "date_created": 1302704849.4066451, "message": "They have a huge open space that will serve as a conference center, but for now is used for roller derby practice. It could totally hold a kart track :)", "group_id": 8644, "id": 665573}, {"user_id": 29323, "stars": [], "topic_id": 18277, "date_created": 1302706384.336117, "message": "I sure wish the GPT was closer to the NW.  Or, I should say I wish I was closer to civilization.", "group_id": 8644, "id": 665868}, {"user_id": 28418, "stars": [], "topic_id": 18277, "date_created": 1302729647.3696139, "message": "Well when I first heard of Gangplank (a long time ago) I lived about 55 miles away from it and started going a few times a week.  It only matters if the distance to travel is worth it, and for me it has always been worth it!  I hope and assume that Gangplank Tucson will also be worth the travel and time spent to get there.", "group_id": 8644, "id": 672130}, {"user_id": 28438, "stars": [], "topic_id": 18277, "date_created": 1302744527.510649, "message": "The early responders have been incredible: Andrew Lenards, Art Gillespie, Aaron Eden, Warner Onstine, David Leary... I could go on, but many have told me they've already seen benefits. I certainly have myself, as well. Smart funny interesting people are great to be around, and with them focused on the GP ideals I have really high hopes. @kitplummer it is at least close to the freeway. If only the freeway was convenient to anything here.", "group_id": 8644, "id": 675315}, {"user_id": 28856, "stars": [], "topic_id": 18277, "date_created": 1302764037.1650839, "message": "I live in NW near 1st and Orange Grove. I could pick someone up to carpool on the days that I am not riding my motorcycle. Or even when I am, if you are willing to wear a helmet and be scared ;)", "group_id": 8644, "id": 680089}, {"user_id": 12259, "stars": [], "topic_id": 18277, "date_created": 1303358610.250911, "message": "Just a quick reminder that Gangplank Tucson has event on gamestorming tomorrow night. http://gptgamestorming.eventbrite.com/ and http://www.youtube.com/watch?v=w717-TtnfF4", "group_id": 8644, "id": 765481}, {"user_id": 12259, "stars": [], "topic_id": 18277, "date_created": 1303358635.896987, "message": "and I'll be there :)", "group_id": 8644, "id": 765495}, {"user_id": 12259, "stars": [], "topic_id": 18277, "date_created": 1303853754.8320141, "message": "Thanks Scott (@Espressojunky) for putting together another tour of gangplank tucson.", "group_id": 8644, "id": 819169}, {"user_id": 28438, "stars": [], "topic_id": 18277, "date_created": 1303913037.3514309, "message": "Just fyi, @JMatt was a better tour attraction than I was guide.  His story of his search for a place like Gangplank was better at explaining the why than I was showing the where! ", "group_id": 8644, "id": 826226}, {"user_id": 4765, "stars": [], "topic_id": 18277, "date_created": 1305958495.9522929, "message": "Thanks for coming up tonight to those who did. Good times hangin out tonight. :)", "group_id": 8644, "id": 1132874}, {"user_id": 28856, "stars": [], "topic_id": 18277, "date_created": 1306093456.389045, "message": "Is anyone going to Chandler for \"Startup Lessons Learned\" tomorrow?", "group_id": 8644, "id": 1143606}, {"user_id": 22692, "stars": [], "topic_id": 18277, "date_created": 1306780245.310612, "message": "Just spent the weekend in Tucson and bummed I didnt get by the new GP Tucson :(", "group_id": 8644, "id": 1229831}]