[{"user_id": 34772, "stars": [], "topic_id": 37613, "date_created": 1306887790.8660259, "message": "I'm writing an article about Convore for my publication, Xconomy. I've interviewed \"the three Erics\" and now I want to get some input from Convore users. It seems like a lot of people use Convore exactly the same way they use Quora -- by posting a question and asking for group feedback. If that's the case then how is Convore different from Quora (or IRC, or Yammer, or other real time chat systems)? I haven't tried the private groups feature, which I'm sure offers a separate set of benefits. But anyway, I'd love to hear what users think about where Convore excels, and where it falls short.", "group_id": 97, "id": 1245175}, {"user_id": 2597, "stars": [], "topic_id": 37613, "date_created": 1306908763.282449, "message": "I am interested to see reasons why Convore is not getting as big as Quora", "group_id": 97, "id": 1250329}, {"user_id": 26065, "stars": [{"date_created": 1306923934.4481089, "user_id": 9108}, {"date_created": 1306937042.3954811, "user_id": 18485}, {"date_created": 1307120487.2455499, "user_id": 5350}, {"date_created": 1308004760.7745321, "user_id": 29952}], "topic_id": 37613, "date_created": 1306912368.140599, "message": "@waderoush The difference between them is that Quora is for building a corpus of knowlege whereas convore is for fostering real time topic related communication. Those are two completely different things, like radio and tv. \n\nI use convore for quick comments. I invest much more time into quora responses as the stakes at quora are significantly higher, after all the industry is relatively small (less than 150.000 players) which means that every single post on quora might have impact on my career. I see convore as a replacement for IRC, fire and forget style, quick on the fly topic conversation, not as messy as twitter but real communication. \n\nWhat I hope for is that convore becomes a SAAS company that offers white label real time community services that can be integrated into websites. That would be a way for them to become quite big if they do it right (the whitelabel is really important here, pricing too of course)", "group_id": 97, "id": 1250823}, {"user_id": 18485, "stars": [{"date_created": 1306939095.546165, "user_id": 26065}], "topic_id": 37613, "date_created": 1306937625.0460789, "message": "@waderoush For me the advantages convore has over any other platform I've looked at is the ability to create a group in seconds and invite members also in seconds and just like that you have a public or private group for chat, information sharing, collaboration, etc. the fact that a group also comes with a easy-to-share URL is also a big plus. All we need now is a lot of users and we've got something. The ability to embed in websites should be a step convore takes sooner rather than later as it should help with uptake. They should also come out with a clear statement of fees to put early adopters at ease. Something like: \"There will always be a FREE version of convore and anyone who signs up by January 2012 will be grandfathered with a totally FREE ad FREE version for life. Those that join later will have the option of FREE ad supported or paid ad free versions. So, Join now and tell all your friends to do so too!\" \n\nThis should help with uptake so they can reach critical mass.", "group_id": 97, "id": 1253506}, {"user_id": 15929, "stars": [], "topic_id": 37613, "date_created": 1306936285.8567741, "message": "Kinda agree with @martin_sunset, I think Convore is closer to IRC / Yammer than Quora. Yes, the busiest groups are tech, hacker news, apple, etc. (where it overlaps with Quora) but for me, Convore strength is when a team on each remote locations discuss together.\n\nConvore has more context than IRC, and has better engagement (amongst the group) than Yammer.\n\nMy hope is slightly different from Martin; although some customisation would be nice, but I just wish Convore would become the _tumblr_ for communities.", "group_id": 97, "id": 1253259}, {"user_id": 18485, "stars": [], "topic_id": 37613, "date_created": 1306937698.2611699, "message": "PS: Here's one example of how convore groups can be used: http://convore.com/craig (note the easy URL)", "group_id": 97, "id": 1253516}, {"user_id": 26065, "stars": [], "topic_id": 37613, "date_created": 1306939226.302855, "message": "Funny thing, \"group in seconds and invite members also in seconds\" was what attracted me in the first place too, but I completely forgot about it. The UI is in this regard REALLY lacking, if even early adopters like myself don't remember the core value proposition. Put a large Create a group sticker to the left", "group_id": 97, "id": 1253761}, {"user_id": 9108, "stars": [], "topic_id": 37613, "date_created": 1306970187.0423689, "message": "@craigshipp I really see this part as key: \"All we need now is a lot of users and we've got something.\"\n\nIt seems like after the initial rush from when Convore first launched, there aren't nearly as many new members and things have just been slowing down since not everyone from the initial rush decided to stick around. They need a way to start attracting new users to build up the numbers. More users = more outlets for conversation = more activity on the site.\n\nI'm currently in 20 groups. During the first few weeks, if I went for a day without checking Convore my unread messages would be 300+. Now I can go for a few days without looking and that number still won't hit 100. That needs to change.", "group_id": 97, "id": 1260046}, {"user_id": 9108, "stars": [], "topic_id": 37613, "date_created": 1306970187.8717821, "message": "@craigshipp I really see this part as key: \"All we need now is a lot of users and we've got something.\"\n\nIt seems like after the initial rush from when Convore first launched, there aren't nearly as many new members and things have just been slowing down since not everyone from the initial rush decided to stick around. They need a way to start attracting new users to build up the numbers. More users = more outlets for conversation = more activity on the site.\n\nI'm currently in 20 groups. During the first few weeks, if I went for a day without checking Convore my unread messages would be 300+. Now I can go for a few days without looking and that number still won't hit 100. That needs to change.", "group_id": 97, "id": 1260047}, {"user_id": 15929, "stars": [{"date_created": 1307009841.5334561, "user_id": 9108}, {"date_created": 1307207000.9752891, "user_id": 13735}], "topic_id": 37613, "date_created": 1306980918.2104869, "message": "the article's up. http://www.xconomy.com/san-francisco/2011/06/01/convore-rebooting-irc-brings-group-chat-into-the-social-media-era/", "group_id": 97, "id": 1261592}, {"user_id": 26065, "stars": [], "topic_id": 37613, "date_created": 1306992686.321713, "message": "Ha, thanks for the mention", "group_id": 97, "id": 1263347}, {"user_id": 22241, "stars": [], "topic_id": 37613, "date_created": 1307134548.953506, "message": "http://spravodaj.madaj.net/view.php/2011/05-convore-platforma-pre-skupinovu-komunikaciu but only in slovak language...", "group_id": 97, "id": 1281102}, {"user_id": 13735, "stars": [], "topic_id": 37613, "date_created": 1307206968.545985, "message": "@waderoush Great article!", "group_id": 97, "id": 1287255}]