[{"user_id": 7712, "stars": [], "topic_id": 39126, "date_created": 1307912211.0485389, "message": "I'm familiar with the Dramatica definition of scenes located here http://www.dramatica.com/theory/d_dictionary/dictionary/s.htm, but am wondering if that definition needs to be updated to include an additional Dramatica relationships.\n\nConventional fiction writers often define a scene to include time, location, action, emotion, dialogue, and numerous other nifty items each author invents.\n\nArmando defines scenes as \"All Things That Happen Around A Single Event. Character traits, theme topics, genre features... all the dramatic items that surround a single plot event (working as its set-up or its outcome are a part of a Scene.\"\n\nFurther defining Scenes with Dramatica terminology, can it be said that scenes are made up of  an Element and Variation, further made up by the characters Purpose, Evaluation, Methodolgy and Motivation to create Empathy?", "group_id": 2515, "id": 1375849}, {"user_id": 35323, "stars": [], "topic_id": 39126, "date_created": 1307978180.310946, "message": "I'm still not really familiar with the storyweaving part of Dramatica but as I see - apart from Journeys and Signposts - the 'high resolution' parts of the story, Sequences, and Scenes aren't really defined by Dramatica in terms of what should be in there and whatnot. Having read it recently now I'm getting a grip on the 4 Throughlines and the 4 Signposts and 3 Journeys in each, but what's below that is a mistery for me. Where do Variations and Elements come into play and how? It would be great to clear it up.", "group_id": 2515, "id": 1381129}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1307986578.9849479, "message": "@Buck   good question. I don't think Scenes are defined by Dramatica at all. I doubt it would work to have scenes so linear (either in a time or storyform sense) that each scene contained a whole look at a different Variation (if that's what you mean). \n\nI've always assumed that down to Element and Variation level is our holistic view of the whole story, and Signpost / Journey level being a linear view of the whole story. \n\nScenes in Dramatica I thought were just supposed to represent the non-linear, audience view of the story, including all, some or none of the main Dramatica elements. Therefore being in any order, and, dependent on what we want / need to tell the audience, and when. I would have thought the breakdown of scenes was just dependent on the story itself, the genre and the type of project.\n\nFor example, I could imagine one scene being one situation that included a mixture of Dramatica story points and throughlines (perhaps introducing multiple characters or interaction), and another scene creating setting that included none.", "group_id": 2515, "id": 1382398}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1307994437.1756229, "message": "I think the theory book describes scenes very differently. Going through the four elements or something?", "group_id": 2515, "id": 1383522}, {"user_id": 7712, "stars": [], "topic_id": 39126, "date_created": 1307996534.3967669, "message": "@MikeDerk Yeah, I've been looking through the online version as I gave away my print copy to a fellow writing student during one of my Fall 2010 college classes. I've also searched Armando's Kindle book using the keyword scene and am still not finding the type of definition I'm seeking. Melanie has talked about them too, but it will take quite a while to review her material. Thanks.", "group_id": 2515, "id": 1383782}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1307996870.7820981, "message": "Will look into this also. I might not know . understand this part of the theory at all...... I've never come across the four element thing before.", "group_id": 2515, "id": 1383840}, {"user_id": 7712, "stars": [], "topic_id": 39126, "date_created": 1307997276.9945481, "message": "I found this on Melanie's website and think it was transcribed from the Unplugged video lesson I was thinking of http://dramaticapedia.com/2010/04/08/how-scenes-relate-to-dramaticas-story-elements/.", "group_id": 2515, "id": 1383933}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1308000458.2915111, "message": "Was just going to post same link. Now I understand more about what you meant. Very interesting. I need to get a better understanding of the difference between Structural Scenes and Storytelling scenes in this context.", "group_id": 2515, "id": 1384727}, {"user_id": 10814, "stars": [], "topic_id": 39126, "date_created": 1308009829.2803481, "message": "Here is some information I have put in Dramatica Pro 5 as an indication of what goes into a scene:\n\nScenes and Chapters are storytelling containers into which character interactions, plot points, theme and genre elements, and other story points are placed.  This makes the number of Scenes or Chapters seem arbitrary.          \n\nWhat determines how many scenes you need?  \n\nThe short answer is, \"As many as you want, but no more than you need.\"          \n\nThere are several factors to consider when creating scenes, including:\n\n-- The length of the finished work.\n\n-- The type of work, e.g. novel, script, short story, etc.\n\n-- Conventions of the medium or genre.  For example, comedies tend toward shorter scenes, whereas dramas generally move at a slower pace and have longer scenes.  Screenplays often have scenes no longer than three pages.  Novels often have chapters dozens of pages long.\n\n-- Your personal storyweaving style, such as quick and short, slow and long, or some combination of the two.\n\n-- There are other factors to consider as well, though too many to list here. \n\nSeveral approaches are suggested in this Dramatica Pro.  One approach may be found in the StoryGuide topic list.  Another is described in the Instant Dramatica topic list.", "group_id": 2515, "id": 1386186}, {"user_id": 13650, "stars": [], "topic_id": 39126, "date_created": 1308570805.693583, "message": "I'm a glutton for pumishment (it is Monday morning). It would \"seem\" that scenes are critical to any work. So DP should help us create/develop/understand/improve A SCENE. So can some give a \"concrete\" example of JUST that using all parts (screens) of DP that we could all follow and understand? I'm not talking about looking at a Movie scene already produced- that ostensibly HAS BEEN fixed. I can offer something as a start but would rather see someone else do something completely. (key completely using DP)", "group_id": 2515, "id": 1437836}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1308572673.559216, "message": "Nice idea, but imo, a better example would be using an existing story. Then we can relate to it. But that's just me.", "group_id": 2515, "id": 1438042}, {"user_id": 7645, "stars": [], "topic_id": 39126, "date_created": 1308576428.2345109, "message": "@mp131 I'm not sure a concrete example would be very helpful. As Chris posted, scenes are so dependent upon the talent and taste of the individual writer, that an example would fail to be productive. Once you have the storyform figured out, you simply have to sit down and start writing.", "group_id": 2515, "id": 1438345}, {"user_id": 7645, "stars": [], "topic_id": 39126, "date_created": 1308576450.928669, "message": "Dramatica doesn't help you write, it helps you write better.", "group_id": 2515, "id": 1438346}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1308587562.5704639, "message": "To echo  @jimhull , Dramatica isn't a writing program. It's a lot, but it doesn't teach you how to write.\n\nI didn't know how to write until I wrote 500 words a day for six months. Now, of course, I look back at the things I wrote at the end of that process and realize I still didn't know how to write.\n\nI really think the way you learn is two fold: write, and analyze. But to analyze, you need a sample scene.", "group_id": 2515, "id": 1440052}, {"user_id": 13650, "stars": [], "topic_id": 39126, "date_created": 1308659853.801481, "message": "I understand (agree) that DP can't teach anyone to write. I took \"writing courses\" at a university (back before the printing press was invented) and had the luck to work with writers and academics such as Anthony Burgess, James Dickey, George Garrett and a host of others. All would have said only writers who hold a pen or pencil (or  sit at typewriter (anyone remember those?) for hours and write can improve writing. My \"hope\" when I read about DP was that it would be a tool to \"quickly\"  start a story AND a tool to quickly IMPROVE a story. I then read the \"Theory\" book and banged my head against DP. So far (unlike a few) I've had NO \"enlightenment\" experience.  Now as for \"scene\" even a scene could be considered a story and if you agree with that then DP could/might/should be used to create just a scene.", "group_id": 2515, "id": 1447713}, {"user_id": 13650, "stars": [], "topic_id": 39126, "date_created": 1308660137.549262, "message": "So someone mentioned an \"existing\" scene. I will suggest that \"my\" problem with that is that if it is a movie it should (ostensibly) have already been fixed. Same goes for a published work. So unless someone has a scene in one of those that has gone through the process we can't see it go through the DP process. THAT is what I'd like to see. Armando came close a couple of times but I can't remember a \"scene\" that went through the whole process- he changed scenes each time he discussed a part of the process.", "group_id": 2515, "id": 1447736}, {"user_id": 33839, "stars": [], "topic_id": 39126, "date_created": 1308664297.8642781, "message": "...it's just that, to borrow from psycholinguistics, the semantics are a bit different within the context of the message.  So, while I may know something intuitively or have a different way of defining it based on past experience, where the struggle lies is understanding it within the context of Dramatica itself.  It's not that the language I've been speaking all these years is wrong, but that if I want to speak with the French in France, I need to learn that language.  For all I know, someone could look at one of my stories and say \"yep, that's a complete story\".", "group_id": 2515, "id": 1448565}, {"user_id": 33839, "stars": [], "topic_id": 39126, "date_created": 1308664081.1701241, "message": "@mp131 Here's my take, fwiw, because I'm fairly new at this... but not writing.  Dramatica is like learning a new language.  A lot of the concepts are no different than those found in other story theories (I've read just about all, except that Cat one, believe it or not).  A lot of the concepts are no different than one would get some corporate training problem solving courses, like Kepner Tregoe.  And a lot of the concepts are something people who write and write well, do intuitively without Dramatica-izing it.  That doesn't mean it doesn't go further than other theories, because it most obviously does...", "group_id": 2515, "id": 1448511}, {"user_id": 33839, "stars": [], "topic_id": 39126, "date_created": 1308664855.940074, "message": "As for writing itself, I believe it can help one write better... But I would draw a line between writing and being creative.  It's like music: you can study all the theories you want, take vocal lessons, etc., but if you don't have a voice... But being creative isn't enough to succeed either, it needs to be tempered with parameters/boundaries as well - and I think that's where Dramatica can help the creative writer fulfill their potential, otherwise their work may end up meaningless... which is ok if one is into Dada.", "group_id": 2515, "id": 1448648}, {"user_id": 7645, "stars": [], "topic_id": 39126, "date_created": 1308668604.7896891, "message": "@mp131, The passive-aggressive nature with which you categorize the \"few\" who get Dramatica is getting old. I have received countless emails from writers who have found the articles on my site both insightful and beneficial towards improving their craft. Where do you think 97% of all my insights come from?  Dramatica.", "group_id": 2515, "id": 1449128}, {"user_id": 7645, "stars": [], "topic_id": 39126, "date_created": 1308668660.3844061, "message": "Dramatica doesn't make writing easier, if anything it makes it more difficult. If you have something you want to say with your work, something meaningful, then you will appreciate that challenge. If you just want to get it done, then I would suggest Save the Cat.", "group_id": 2515, "id": 1449132}, {"user_id": 7645, "stars": [], "topic_id": 39126, "date_created": 1308668630.4743659, "message": "You will never find a model for constructing a scene because at that resolution there is no commonality. One scene could show the Main Characters Problem, the Overall Story Catalyst and Story Limit. Another could have the Relationship Issue, the Impact Character's Response and the Main Characters Critical Flaw. Another could have nothing -- it could be strictly storytelling.", "group_id": 2515, "id": 1449129}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1308682717.375746, "message": "I think, or I wonder, if perhaps there can be a false paradox (whatever that means!) with Dramatica. I've often wondered where / how Dramatica helps. I know it helps, because I am a better writer now than before Dramatica. Mainly because I think more about it. \n\nOne of the early things I did with Dramatica was use it to re-write a short story. I made a huge mistake - I tried to get Dramatica to help me with storytelling. I started almost trying to translate Dramatica terms into story. After finished the re-write, although I felt it was a better story, it had less heart. The mistake was trying to pull storytelling from the Dramatica storyform. What I should have done was pull structure, work out how to use a limited part of that within the scope of a short story, then use that to as a base write a story from. At least, that's what I took from that.", "group_id": 2515, "id": 1450930}, {"user_id": 7712, "stars": [], "topic_id": 39126, "date_created": 1308695108.2569311, "message": "@Mikeaja Somewhere in Melanie's vast Dramaticapedia she mentioned that the passion of the story, the emotion in it, will pull the audience through it to the end and that structure is something only to be used when something's not going quite right. That may have been said in one of her initial Weekend Writing Workshop videos (can't quite recall the first one).", "group_id": 2515, "id": 1452850}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1308694693.3939741, "message": "@mp131 You've been a part of the Dramatica culture for a year now, but I think I've yet to see you ask a specific question about a story.\n\nDoes your story end in success or failure? Does the MC feel good or bad? Is the problem X or Y? \n\nI just get this sense that you are waiting for an epiphany, but aren't helping that process along by forcing yourself to answer specific questions.", "group_id": 2515, "id": 1452812}, {"user_id": 13650, "stars": [], "topic_id": 39126, "date_created": 1308706165.7563341, "message": "A fat lady in a girdle is still a fat lady.  Shoo shoo shupe.", "group_id": 2515, "id": 1453825}, {"user_id": 13650, "stars": [], "topic_id": 39126, "date_created": 1308706056.691144, "message": "Mike you are right no epiphany and I've asked no questions. I must have it all figured out. Thanks.  Since you asked: my story (current) ends in success.THe MC succeeds and the IC fails. Wonder of wonders.  But let's not quibble over details; I have a complete understanding of DP and I'm leaving town for vacation. Mission Accomplished.", "group_id": 2515, "id": 1453814}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1308710565.375504, "message": "@mp131 \"The MC Succeeds and the IC fails.\" \n\nSee, now you've said something I can help you with. The above statement is a muddy blend of a few concepts of Dramatica that can be cleared up.\n\nThe MC does not \"succeed\" in Dramatica terminology. \nThe MC overcoming their problem does not mean the IC fails.\nThis was the kind of thing I was referring to when I said, \"tackle the basics, and get them down cold.\"\n\nIt's a shame that you've finally opened up, put something into the forum that can be addressed, all in the name of making me feel, what? Guilty? Shamed? Like a prick?\n\nBut let's not quibble over details.", "group_id": 2515, "id": 1454354}, {"user_id": 36525, "stars": [], "topic_id": 39126, "date_created": 1308722830.1394329, "message": "Actually if you look at the Four Throughlines Themes report there is a section for the MC and a section for the IC.  Each of these has a subsection where it says something like \"Only if the MC [IC] comes to recognize that it is  their own lack [overabundance] of [Insert Dramatic Term Here] which is causing all the problems will she be able to set things right.\"  So each character either succeeds or fails at solving their own personal problem.\n\nA situation with a Steadfast MC and a Change IC could also be interpreted as the MC 'winning' the thematic argument between the MC and IC. (This assumes the MC has the 'right' idea from the beginning. It could also be done the other way around - the MC and IC share the same wrong opinion at the beginning but the MC 'wins' by changing to the 'right' idea while the IC steadfastly stays 'wrong'.)", "group_id": 2515, "id": 1455011}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1308743339.6792271, "message": "@mp131 Just to add, and really not wanting to fuel the fire here.......... but I do think MikeDerk's point about the terminology is valid. The thing is, understanding posters story ideas / questions can be confusing anyway, due to the theory being something quite encompassing and complex. Therefore, it's confusing, imo, if someone says something like 'The MC succeeds'. Immediately when you say Success, I think of the OS Outcome. \n\n. @sunandshadow    As I see it, that quote from the report doesn't suggest success, it suggests the MC is on the way to solving the problem. Or more to the point, the MC now knows what they need to do to solve the problem. The OS Outcome might still be Failure, the MC Judgement might still be Bad.", "group_id": 2515, "id": 1456250}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1308760090.674144, "message": "@sunandshadow Great. Meet @mp131 your new student. @mp131 meet @sunandshadow, your new mentor.\n\nEnjoy your follie a deux.", "group_id": 2515, "id": 1458361}, {"user_id": 36525, "stars": [], "topic_id": 39126, "date_created": 1308772795.9885371, "message": "@MikeDerk Believe it or not I have mentored several writers, both within the context of Dramatica and outside it, and those people have repeatedly told me they found my comments to be very helpful toward improving their story or clarifying their understanding.  However, I disagree with mp131's statement that \"even a scene is a story\".  No, in my opinion a single scene does not a story make because it doesn't demonstrate any plot structure.  And Dramatica simply doesn't contain any tools useful for evaluating whether a single scene is good or not.  I'm all for doing various analytical and exploratory exercises, but this particular one is impossible as currently proposed.", "group_id": 2515, "id": 1459702}, {"user_id": 36525, "stars": [], "topic_id": 39126, "date_created": 1308772072.1935599, "message": "@Mikeaja I was not talking abut Success with a capital S because I assume mp131 was not either.  It would be a bit paralyzing to not be able to use any Dramatica terms in their everyday meanings when discussing anything Dramatica-related.  Characters have been succeeding and failing at various things (typically, solving some sort of problem, also in the lower-case everyday sense of the word) in stories since stories were invented, long before Dramatica came along.  Personally I try to use capitalization to indicate when I am using a Dram term.", "group_id": 2515, "id": 1459618}, {"user_id": 30951, "stars": [], "topic_id": 39126, "date_created": 1308772510.3118241, "message": "I appreciate what you mean, but take a look back at the original post. Not suggesting it is wrong, but I think it's fair to suggest it's confusing. It referred to the MC and IC, so in that sense it related to Dramatica-speak. The question preceding was about Dramatica questions.\n\nStill whether we talk about success or Success, the quote from that report doesn't suggest either to me, it only suggests the MC has the ability to solve.", "group_id": 2515, "id": 1459669}, {"user_id": 7664, "stars": [], "topic_id": 39126, "date_created": 1308773475.486259, "message": "[citation needed]", "group_id": 2515, "id": 1459800}]