[{"user_id": 11626, "stars": [], "topic_id": 7414, "date_created": 1298087894.092077, "message": "http://static.infowars.com/2011/02/i/article-images/mcgovernassaulted.jpg\r\n\r\nYesterday, thousands of Wisconsin public workers protested the state's plan to cut benefits:\r\n\r\nAs USA Today notes:\r\n\r\n    House Budget Chairman Paul Ryan compared the protests in his home state of Wisconsin over Gov. Scott Walker's budget plan to the pro-democracy movement in Egypt.\r\n\r\n    Ryan, a Republican from Janesville, made his comments on MSNBC's Morning Joe program. In the Wisconsin state capital, teachers and labor union supporters swarmed the Senate chambers today to protest a bill that would strip most public employees of nearly all their collective bargaining rights.\r\n\r\n    \"It's like Cairo's moved to Madison these days,\" Ryan said on MSNBC. \"All of this demonstration ... it's fine. People should be able to express their way.\"\r\n\r\nMother Jones points out:\r\n\r\n    For the second straight day, demonstrators have been pouring into the streets of Madison, Wisconsin to protest Republican Governor Scott Walker's anti-union plan to address the state's $137 million budget shortfall, prompting comparisons (and denounciations of these comparisons) to the uprising in Egypt. Walker's proposal would limit the collective bargaining power of many state and local employees, and roughly doubles their health care premiums. It would also give public union members the right not to pay their dues, deflating the groups' coffers. Experts expect that Walker's provisions will be voted into law by the end of the week by the state assembly and senate—both of which are controlled by Republicans.\r\n\r\n    In response, Madison public school teachers have called in sick for a second straight day. And teachers in over a dozen other school districts have followed suit. Meanwhile, union leaders are picketing the capitol, planning vigils and setting up phone banks to try to block Walker's effort.\r\n\r\n    ***\r\n\r\n    Protestors say that sounds a little…Mubaraky. They're carrying signs saying things like \"Mubarak-check. Walker—?\" and \"Hosni Walker, Elected Dictator.\" And local liberal pundits are feeding the flames of anti-MubWalkerism. Liberal columnist Pat Schneider wrote that \"[t]he success of a grass-roots uprising in Egypt in toppling strongman Hosni Mubarak was a source of inspiration for many of those who brainstormed Tuesday in Madison about resistance to attacks on US workers in several states.\" Meanwhile, Rep. Paul Ryan (R-Wisc.) told CNN \"it's like Cairo's moved to Madison these days…[h]e's basically saying I want you public workers to pay half of what our private sector counterparts are, and he's getting riots.\"\r\n\r\nAOL News reports:\r\n\r\n    Walker has upped the ante by threatening to bring in the National Guard if public workers decide to walk off the job or if their protests disrupt services around the state.\r\n\r\n    Labor activists responded by saying that Walker could ignite a \"class war.\"\r\n\r\n    And now many are comparing Walker to former Egyptian President Hosni Mubarak, who tried to cling to power while protests roiled his country.\r\n\r\nDylan Ratigan notes that a large proportion of Wisconsin public employees' pension funds go to Wall Street:\r\n\r\n    The average Wisconsin state employee gets $24,500 a year. That’s not a very big pension. The state pension plan, 15% of the money going into it each year is being paid out to Wall Street to manage the money. That’s a really huge high percentage to pay out to Wall Street to manage the money.\r\n\r\nAnd the Governor has ordered the Wisconsin state police to arrest all of the Democratic State Senators and return them to the Capital, but the Senate Democrats have fled the state.\r\n\r\nConservative writers like Mish and Karl Denninger slam the protesters (they're anti-union).\r\n\r\nIndeed, the Democratic National Committee is apparently helping to organize the protests.\r\n\r\nBut Max Keiser writes:\r\n\r\n    It’s foolish to say these protests are about ‘labor’ or ‘unions.’ They’re about people getting their wealth stolen by banks. And whether it’s Cairo or Ohio, it’s the same banks. We are witnessing a Global Insurrection Against Banker Occupation.\r\n\r\nAnother poster writes:\r\n\r\n    The one good thing that has come out of this is simply the fact that, for right or for wrong, people are getting off their [back sides] and doing something about something.\r\n\r\nAnd in related \"Mubaraky\" news, Ray McGovern - a 27-year CIA veteran, who chaired National Intelligence Estimates and personally delivered intelligence briefings to Presidents Ronald Reagan and George H.W. Bush, their Vice Presidents, Secretaries of State, the Joint Chiefs of Staff, and many other senior government officials - was bloodied, bruised and beaten for peacefully protesting a speech by Hillary Clinton (Clinton's speech was about the importance of protecting free speech):\r\n\r\nMcGovern Bloodied and Arrested at Clinton Speech mcgovernassaulted\r\n\r\nAs Raw Story points out:\r\n\r\n    Former CIA agent Ray McGovern, an outspoken critic of US foreign policy, stood silently in the auditorium's center aisle, and turned his back on Clinton.\r\n\r\n    For his symbolic and otherwise non-disruptive protest, he was quickly accosted by security agents. As they struggled to pull him out of the room, a CNN news camera caught the tail end of the ordeal.\r\n\r\n    \"SO THIS IS AMERICA?!? This is America? Who are you?\" the 71-year-old McGovern shouted as he was hauled away.\r\n\r\n    ***\r\n\r\n    McGovern was being represented by the Partnership for Civil Justice Fund (PCJF).\r\n\r\n    \"It is the ultimate definition of lip service that Secretary of State Clinton would be trumpeting the U.S. government's supposed concerns for free speech rights and this man would be simultaneously brutalized and arrested for engaging in a peaceful act of dissent at her speech,\" a spokeswoman for the group said in a published statement. [The group also noted that McGovern was \"left bleeding in jail\".]\r\n\r\n    US officials came under similar rhetorical fire in December, when they announced plans to host \"World Press Freedom Day.\" The announcement was made on the same day that Sen. Joesph Lieberman (I-CT) declared that WikiLeaks founder Julian Assange should be prosecuted for espionage over his role in the release of US diplomatic cables.\r\n\r\n    \"When people die because we have hypocrites at the top of our government, that compels me to make a statement in whatever way I can,\" McGovern later told Rob Kall, who posted the remarks to Op Ed News. \"It was not the theme of her speech that I was protesting. It was her war policies and support of Mubarak.\"\r\n\r\nAnd see this and this.\r\n\r\nhttp://www.washingtonsblog.com/2011/02/revolt-spreads-to-america.html", "group_id": 3920, "id": 148816}]