[{"user_id": 7219, "stars": [], "topic_id": 12753, "date_created": 1299993098.422389, "message": "Im not sure if there is a thread for this yet, not gonna lie i was to lazy to look =P anyways i think it would be really cool if there was a way to upload pictures to either profiles, threads or anything new and cool?", "group_id": 88, "id": 339009}, {"user_id": 4149, "stars": [], "topic_id": 12753, "date_created": 1299993302.3971119, "message": "You can put links to pics and they show in line", "group_id": 88, "id": 339019}, {"user_id": 19160, "stars": [], "topic_id": 12753, "date_created": 1300024885.629801, "message": "@gunnarsipper I agree there should be an image upload tool here in the browser and in the iPhone app. This would save the step of uploading to another service and then getting the URL and placing it here.", "group_id": 88, "id": 341042}, {"user_id": 19160, "stars": [], "topic_id": 12753, "date_created": 1300026453.3713801, "message": "Also, it would be cool if youtube videos were displayed in-line like facebook: http://www.youtube.com/watch?v=FBu4C5gmRas", "group_id": 88, "id": 341090}, {"user_id": 28, "stars": [{"date_created": 1302809106.7203541, "user_id": 18485}], "topic_id": 12753, "date_created": 1302806264.6808741, "message": "...but as a collaborative tool it is great.   Shared conversation and information.  It could be much greater if you could share simple docs and have them there for reference by all.", "group_id": 88, "id": 688452}, {"user_id": 28, "stars": [{"date_created": 1302809081.4354351, "user_id": 18485}], "topic_id": 12753, "date_created": 1302804415.969301, "message": "I've introduced Convore to a group to help prepare for an event this summer.  Feedback has been good, but a simple pic/file document upload inside of Convore is what they really want.  Not everyone wants to mess with imgur and upload tools.", "group_id": 88, "id": 688018}, {"user_id": 4149, "stars": [{"date_created": 1302805836.7651861, "user_id": 28577}, {"date_created": 1302860494.1001461, "user_id": 14057}, {"date_created": 1302860874.8585041, "user_id": 7517}], "topic_id": 12753, "date_created": 1302804725.8072641, "message": "@Jabushey convore is a forum at the core, i think uploading tools would take away from what this is support to be, we don't need this turning into 4chan or an imageboard just saying", "group_id": 88, "id": 688093}, {"user_id": 4149, "stars": [], "topic_id": 12753, "date_created": 1302806321.248847, "message": "but you know this is beta and they don't have 100 developers and this is suppose to be like IRC not a whole collaborative tool other wise i think campfire is for you", "group_id": 88, "id": 688458}, {"user_id": 4149, "stars": [], "topic_id": 12753, "date_created": 1302806673.6138079, "message": "@Joltrast http://campfirenow.com/ here and google wave was cool, but it is open source so you can install it if you have a good server", "group_id": 88, "id": 688544}, {"user_id": 28577, "stars": [{"date_created": 1302805796.8553829, "user_id": 4149}], "topic_id": 12753, "date_created": 1302805754.852493, "message": "Personally, I would like it to remain text-based. I don't need another social media site. I have plenty of those. :o)", "group_id": 88, "id": 688358}, {"user_id": 28577, "stars": [], "topic_id": 12753, "date_created": 1302806407.2338841, "message": "It's a shame GWave died a slow and painful death - now that was a collaboration tool :o)", "group_id": 88, "id": 688477}, {"user_id": 28577, "stars": [], "topic_id": 12753, "date_created": 1302806350.711822, "message": "Do you have a link for campfire? I would like to look into that - thanks", "group_id": 88, "id": 688468}, {"user_id": 28577, "stars": [], "topic_id": 12753, "date_created": 1302806815.313102, "message": "Aha! I knew 37signals rang a bell! http://37signals.com/rework/", "group_id": 88, "id": 688595}, {"user_id": 28570, "stars": [], "topic_id": 12753, "date_created": 1302811421.1720181, "message": "@craigshipp I agree. I would love to dump twitter and keep convore if more people start using convore.", "group_id": 88, "id": 689703}, {"user_id": 18485, "stars": [{"date_created": 1302809637.5203049, "user_id": 13339}], "topic_id": 12753, "date_created": 1302809496.820004, "message": "I understand those that want to keep this text based but to go main stream and to be the next big thing IMO convore can add a few more tools and meet most needs while still staying true to the core functions. Being able to easily share photos, documents and YouTube videos in-line with easy tools would be great. After all, we can already share links and place photos in-line but the later still requires that the image already be on-line and that we get the URL of the image and paste it in.", "group_id": 88, "id": 689238}, {"user_id": 4149, "stars": [], "topic_id": 12753, "date_created": 1302809754.0962789, "message": "@craigshipp first mainstream what do mean, the released it and it is mainstream, also yea more links in line is cool but to be uploading to convore will cause problems and take away from the text and I think the URL to share is good, I think your misguided in what convore is suppose to be and what is building on", "group_id": 88, "id": 689311}, {"user_id": 6366, "stars": [], "topic_id": 12753, "date_created": 1302810220.1113811, "message": "hey guyz", "group_id": 88, "id": 689424}, {"user_id": 18485, "stars": [], "topic_id": 12753, "date_created": 1302809985.098716, "message": "@italiano40 could the images not be hosted by other services like yfrog, etc? By mainstream I mean a lot of uptake and pulling users away from other services like twitter and facebook. I love convore and would like to see everyone using it. My hope is that some additional tools could be added without straining their resources or distracting them from their mission.", "group_id": 88, "id": 689379}, {"user_id": 4149, "stars": [], "topic_id": 12753, "date_created": 1302810177.213711, "message": "@craigshipp it isn't suppose to take away from twitter Facebook all three are different services", "group_id": 88, "id": 689413}, {"user_id": 1706, "stars": [{"date_created": 1302815746.5701959, "user_id": 13339}], "topic_id": 12753, "date_created": 1302810277.7560019, "message": "I can't speak for the Convore developers but it strikes me that the \"mission\" is to create a low-friction tool for group communication. *Immediacy* is key and being able to upload files contributes to that immediacy and lack of friction. I am 100% confident that Campfire would not be as popular if it didn't have file uploads.", "group_id": 88, "id": 689443}, {"user_id": 18485, "stars": [], "topic_id": 12753, "date_created": 1302810542.0362799, "message": "@italiano40 If you're like me you only have a max of 24 hours in a day and I, for one, have taken some of the time I was spending on twitter and facebook and allocated it to convore. Because I like convore's clean interface, the people here, and see it as a tool I can really use for both personal and business purposes. For me, in many ways, convore does replace many of the functions of twitter and to a lesser extent facebook.", "group_id": 88, "id": 689493}, {"user_id": 6366, "stars": [], "topic_id": 12753, "date_created": 1302810602.250036, "message": "meow", "group_id": 88, "id": 689505}, {"user_id": 18485, "stars": [], "topic_id": 12753, "date_created": 1302810758.133652, "message": "Here's a thread I start to share the many use cases for convore. Please share some of your hopes and dreams for the platform: https://convore.com/craig/why-convore/", "group_id": 88, "id": 689558}, {"user_id": 18497, "stars": [], "topic_id": 12753, "date_created": 1302813212.213299, "message": "Yep convore all the way! twitter and facebook RIP", "group_id": 88, "id": 690295}, {"user_id": 4149, "stars": [{"date_created": 1302860587.217068, "user_id": 14057}], "topic_id": 12753, "date_created": 1302815876.930753, "message": "@kevindolan  @uscute  @craigshipp you guys are misguided, convore is not a social network nor should try to become one, it is text based forum to exchange ideas, i wouldn't dump facebook or twitter for convore, they all 3 different services i mean you can use convore how you want, but still there are things that are more important then sharing files and pictures", "group_id": 88, "id": 691174}, {"user_id": 28, "stars": [], "topic_id": 12753, "date_created": 1302819825.4845729, "message": "I may be misguided, but I know what I like.   I also am probably a very small minority here in that I don't use Twitter or Facebook.  Convore is working great to bring a small private group of people together to share information of common interest and import.  That can be more easily done without the need to refer to external sites to upload at a photo or pdf.  One stop!", "group_id": 88, "id": 691917}, {"user_id": 18497, "stars": [], "topic_id": 12753, "date_created": 1302821154.6105759, "message": "@Joltrast My guess is the convore team is up to the challenge of continuing to improve the platform while keeping true to their mission: \"Convore is a quick way to instant message with groups of friends in real-time. You can join in on conversations about topics that interest you, or start your own conversations. Don't worry about missing anything, because we keep track of what you're not seeing, so that when you return, you can easily catch up! But don't take our word for it, join in on the fun and see for yourself.\"", "group_id": 88, "id": 692094}, {"user_id": 28577, "stars": [], "topic_id": 12753, "date_created": 1302821543.641325, "message": "Some people are just odd though, they want to move away from one form of communication, but then they want the new one to be a carbon copy of the old one. :o)", "group_id": 88, "id": 692149}, {"user_id": 18497, "stars": [], "topic_id": 12753, "date_created": 1302820336.447428, "message": "@italiano40 all these services are, at the base level,  about communication and I agree that what I've seen so far I would pick convore over twitter or facebook to communicate and share with my friends. I just need to get all my friends on here and I'm working on it. Two so far and three more to go :)", "group_id": 88, "id": 692003}, {"user_id": 28577, "stars": [], "topic_id": 12753, "date_created": 1302820840.052645, "message": "My only concern is that all these wonderful new ways to communicate get watered down in order to be the next twitter/facebook killer and they all start to look the same but with a slightly different UI. If you think about it, Twitter and Facebook have little in common with each other. JMHO.", "group_id": 88, "id": 692057}, {"user_id": 18485, "stars": [{"date_created": 1302821879.9779451, "user_id": 18497}], "topic_id": 12753, "date_created": 1302821856.4289939, "message": "@Joltrast I want convore to continue to be better than the others and right now I think they are on the right track. So far it appears to me that they listen to all feedback and then take a slow, thoughtful approach to innovation. The level of quality I see here tells me we can expect great things from both the convore development team and the community that's forming here.", "group_id": 88, "id": 692193}, {"user_id": 28577, "stars": [{"date_created": 1302832152.928648, "user_id": 4149}], "topic_id": 12753, "date_created": 1302828048.4259739, "message": "Oh, I have no doubt of that. The devs have done an outstanding job. I just don't want to see this turn into another clone. This format appeals to a certain demographic in the same way that Twitter and Facebook do. There are Twitter users that have no interest in FB and vice versa", "group_id": 88, "id": 692904}]