[{"user_id": 7664, "stars": [], "topic_id": 6450, "date_created": 1297883204.587044, "message": "Chris, do you have any plans (or would be open to the suggestion) to release the gist list prior to the release of DP5? I have created my own list (short, maybe 300 so far) but there are certain terms that are weirdly hard to get my head around. (Example: Cause. It's easy to do things like \"Fighting for equal treatment\" -- that's a cause -- but is \"structural damage to a dam\" a cause? (It certainly would cause a breach eventually.)) Having a master list to draw from, and use as a springboard, would be great!", "group_id": 2515, "id": 122914}, {"user_id": 10814, "stars": [], "topic_id": 6450, "date_created": 1297967476.7676611, "message": "\"Structural damage to a dam\" is not inherently a good gist for \"Cause\", though I think it might work if you rephrase it to something like \"Causing structural damage to a dam,\" or \"Structurally damaging a dam.\"  I think those would \"read\" better.", "group_id": 2515, "id": 133950}, {"user_id": 10814, "stars": [], "topic_id": 6450, "date_created": 1297967347.32581, "message": "Sort of -- We have tentative plans to do some gist building during the beta period of the software.  We'd like to build a substantial database, which will take time and lots of participants.", "group_id": 2515, "id": 133921}, {"user_id": 7664, "stars": [], "topic_id": 6450, "date_created": 1297967730.1738091, "message": "Now you've opened yourself up to a variant of \"when are you releasing DP5\"... When are you going into beta?", "group_id": 2515, "id": 133986}, {"user_id": 7664, "stars": [], "topic_id": 6450, "date_created": 1297967733.5159919, "message": "haha", "group_id": 2515, "id": 133987}, {"user_id": 10814, "stars": [], "topic_id": 6450, "date_created": 1297970976.0390551, "message": "No date yet, though we were talking about that today in our managers' meeting.  Trust me, you'll hear about it when we announce the beta cycle.", "group_id": 2515, "id": 134559}]