[{"user_id": 38834, "stars": [], "topic_id": 42833, "date_created": 1311811386.1435821, "message": "I'm developing an Ender library component, and have some questions about workflow... I want to be able to execute the \"ender\" command to build an ender library for testing as I develop, but it seems that ender wants the version of the code in the [node-modules] directory... but that is circular since the [node_modules] is for the module I'm developing.", "group_id": 9901, "id": 1735308}, {"user_id": 38834, "stars": [], "topic_id": 42833, "date_created": 1311820254.1508191, "message": "I've provided much more detail here: http://stackoverflow.com/questions/6853491/workflow-in-developing-an-enderjs-library-component", "group_id": 9901, "id": 1735938}, {"user_id": 38834, "stars": [], "topic_id": 42833, "date_created": 1311874008.1030519, "message": "I've been looking at the ender source, and here's what it seems to me is happening: when I execute \"ender build\", ender presume to build \".\" (which is goodness). In ender-file.js, constructDependencyTree detects this (isRoot); when the package.json file is read, the \"name\" attribute is consumed and used as the name of the package in the tree. Then, when processPackages processes the (flattened) tree, it looks for the named package in the node_modules directory... but it is not there, and so reports \"dependency <name> is currently not installed... for details check: $ ender info\".  So, either I need to have an entry in the node_modules (perhaps a symlink back up a directory??), or ender-file needs to recognize that \".\" needs to be handled specially. Does this make any sense?", "group_id": 9901, "id": 1741004}, {"user_id": 38834, "stars": [], "topic_id": 42833, "date_created": 1311877467.619766, "message": "Presuming that ender should succeed at constructing an ender.js file when given the command \"ender build\" (using the local module's source), I have forked Ender, and created a branch called \"build-devl\" ... and made a few changes that get this to work. This has been pushed to my GitHub repo for my branch: \n https://github.com/Zhami/Ender/tree/build-devel    \n\nYou can see the specific changes in this commit:\n https://github.com/Zhami/Ender/commit/aa9486442a3e08a06edf7cf9187b8a10d9d38440", "group_id": 9901, "id": 1741538}]