[{"user_id": 3337, "stars": [], "topic_id": 19010, "date_created": 1302639669.3255889, "message": "My name's Joe - UX designer at reed.co.uk. Working on a multiplayer word game using Node.js and socket.io", "group_id": 8800, "id": 649631}, {"user_id": 29108, "stars": [], "topic_id": 19010, "date_created": 1302684526.8116519, "message": "My name is Rob – I am a serial experimenter and I use node.js for developing multiplayer JavaScript games, as well as for performing data analysis with the Twitter Streaming API.", "group_id": 8800, "id": 661571}, {"user_id": 7465, "stars": [], "topic_id": 19010, "date_created": 1302689661.8323481, "message": "I'm Chris (@cwaring), Creative Lead for Kasabi & avid Semantic Web hacker. Mostly interested in front end web technologies and using Node.js to build data driven web apps.", "group_id": 8800, "id": 662479}, {"user_id": 3337, "stars": [], "topic_id": 19010, "date_created": 1302708714.456233, "message": "@robhawkes I didn't know you used it for data analysis - you got a blog post or anything on that? So does that mean youre doing the analysis in realtime?", "group_id": 8800, "id": 666341}, {"user_id": 29285, "stars": [], "topic_id": 19010, "date_created": 1302716587.0914519, "message": "Hi, I'm Zach (@zbeauvais) Community manager for Kasabi (blog.kasabi.com). I blog about related fields, and have written occasionally for tech blogs and fan of Linked Data concepts.", "group_id": 8800, "id": 668339}, {"user_id": 29489, "stars": [], "topic_id": 19010, "date_created": 1302770758.9164629, "message": "Hi, I'm Ash (@dragongraphics) and am a Front end developer at MomentumWW.  I'm interested in all things front end web and am interested in learning more about node and using social media API's for better realtime interactions.", "group_id": 8800, "id": 681160}, {"user_id": 29103, "stars": [], "topic_id": 19010, "date_created": 1302770070.861902, "message": " Hi, I'm Syd (@sydlawrence), I am a (soon to be) freelancer. I love dabbling in new technologies. I have only recently created my first node js app, nothing special, just to learn the concepts. I want to learn more about node :)", "group_id": 8800, "id": 681043}, {"user_id": 29108, "stars": [], "topic_id": 19010, "date_created": 1302854997.0546589, "message": "Seeing as everyone is including their employment details… I'm currently a student at Bournemouth University, but from June I will be working as a Technical Evangelist at Mozilla (part of the Developer Engagement team). I will still be based in Bournemouth.", "group_id": 8800, "id": 697809}]