[{"user_id": 23332, "stars": [], "topic_id": 34667, "date_created": 1305070775.4512401, "message": "One of my friends may have a room open for rent sometime in July. I'll talk to him about it and see if I can help someone that is looking for a place to stay.", "group_id": 9761, "id": 997883}, {"user_id": 32957, "stars": [], "topic_id": 34667, "date_created": 1305133175.9752841, "message": "Hey everyone how are you doing. This is a side question but do you guys know how much or if any relocation expenses we are allocated for?", "group_id": 9761, "id": 1010276}, {"user_id": 32989, "stars": [], "topic_id": 34667, "date_created": 1305157141.6662941, "message": "When you relocate to blaine, save all of your receipts and PTC will reimburse you for it (atleast that's what I was led to believe). And as far as that place for rent, let me know. I'm coming a long ways to a place I've never been so I'm looking to find a place quickly that isn't too expensive. Thanks and I look forward to meeting everyone!", "group_id": 9761, "id": 1016136}, {"user_id": 32957, "stars": [], "topic_id": 34667, "date_created": 1305212486.577971, "message": "Thanks Matt", "group_id": 9761, "id": 1025283}, {"user_id": 33068, "stars": [], "topic_id": 34667, "date_created": 1306360741.6072831, "message": "Any update with your friend Victor?  My current plan is to stay at a cheap extended stay place until I can find an apartment and roomie.  I hope to get there 5-6 days early and find somewhere tolerable to stay and some Ikea / Salvation Army furniture", "group_id": 9761, "id": 1184671}, {"user_id": 32989, "stars": [], "topic_id": 34667, "date_created": 1306368665.1719041, "message": "Hey Todd, just wanted to let you know that I've got essentially the same plan if you need a roommate. I'm gonna try to be there a full week before we start the academy to try and get things figured out. I'm keeping an eye out on craigslist for housing possibilities also.", "group_id": 9761, "id": 1185961}, {"user_id": 34165, "stars": [], "topic_id": 34667, "date_created": 1307164927.0551779, "message": "Hey if anyone is still looking for a roommate let me know I am still trying to find one.", "group_id": 9761, "id": 1284630}, {"user_id": 32989, "stars": [], "topic_id": 34667, "date_created": 1307224176.247026, "message": "I too will be needing rommates, but do you have somewhere to live already? I'm still trying to find a place.", "group_id": 9761, "id": 1289376}, {"user_id": 35509, "stars": [], "topic_id": 34667, "date_created": 1307468755.2580669, "message": "Hello everyone!  I am looking for places and roommates myself.  If I find anything I will post a link.", "group_id": 9761, "id": 1324992}]