[{"user_id": 11626, "stars": [], "topic_id": 6319, "date_created": 1297847810.5229089, "message": "They are also conditioning us to accept government crackdowns on free speech. They will be coming after political speech next, you wait & see.", "group_id": 3920, "id": 118512}, {"user_id": 11626, "stars": [], "topic_id": 6319, "date_created": 1297847799.4976449, "message": "This is the ultimate in hypocrisy. Who wants to bet that they seized it for their own use?", "group_id": 3920, "id": 118511}, {"user_id": 11626, "stars": [], "topic_id": 6319, "date_created": 1297847406.0061691, "message": "\"Each year, far too many children fall prey to sexual predators and all too often, these heinous acts are recorded in photos and on video and released on the Internet,\" said Secretary of Homeland Security Janet Napolitano. \"DHS is committed to working with our law enforcement partners to shut down websites that promote child pornography to protect these children from further victimization.\"\r\n\r\n\"For all its positive impact, the Internet has also unfortunately created a new way for child predators to commit their inexcusable crimes,\" said Assistant Attorney General Lanny A. Breuer of the U.S. Department of Justice, Criminal Division. \"The production and distribution of child pornography wreak havoc on innocent lives. With these domain seizures, we are taking our fight against child pornography to websites that facilitate the exchange of these abusive images.\"\r\n\r\nThis enforcement action was spearheaded by ICE’s Cyber Crimes Center (C3), under a nationwide ICE initiative to identify, investigate and arrest those who prey on children. Individuals attempting to access the seized websites will now find a banner notifying them that the domain name of that website has been seized by federal authorities.\r\n\r\n\"Operation Protect Our Children\" leverages the resources of ICE Homeland Security Investigations, the DOJ Criminal Division’s Child Exploitation and Obscenity Section (CEOS) and the DOJ Asset Forfeiture and Money Laundering Section to investigate and prepare seizure warrants against the domain names of websites that host child pornography.\r\n\r\nhttp://www.dhs.gov/ynews/releases/pr_1297804574965.shtm", "group_id": 3920, "id": 118495}]