[{"user_id": 11626, "stars": [], "topic_id": 43511, "date_created": 1312883245.4697981, "message": "MARTIAL LAW MONDAY 8/8/11\n\nWelcome to the \"Martial Law Monday\" edition of SCMLA's News Digest!\n\n\nTroop Movements: Shepard Ambellas On Clyde Lewis’ – Ground Zero Radio\nThe Intel Hub\nAugust 8, 2011\n\nShepard Ambellas recently did a two and a half hour interview on Ground Zero Radio with Clyde Lewis on Portland radio station KXL 101 FM. The interview was in response to military and equipment movements inside the CONUS (continental United States) that The Intel Hub has been receiving over the past 6 – 8 weeks. One report that got a huge amount of attention from the general public was originally aired on The Power Hour with Joyce Riley when a trucker claimed that he hauled military equipment that included rocket launchers and ground to air missiles to upstate New York.\nhttp://theintelhub.com/2011/08/08/troop-movements-shepard-ambellas-on-clyde-lewis-ground-zero-radio\n\nLondon Set To Be Under Martial Law In Next 24 Hours – Troops To Deploy Against ‘Teenage’ Population\nThe Intel Hub\nAugust 8, 2011\n\nRiots have intensified on the streets of London as police and bystanders fear for their lives as people protest in anger with their government. Large swaths of the city have been overran by violence as the government hides the true reasons behind the rioting. Some of the violence was captured by RT: The rioting and violence has now spread to multiple sectors in and around London North, east and now south. In a move that many fear will happen on the streets of America, there is talk of using the military to quell civil unrest on the streets of London as they continue to burn. Widespread looting has taken place throughout the city which does not look good in wake of the coming Olympics. Here is a local report of the much wider social problem: The riots, which have been termed a protest for days, are now being labeled an all out free for all. The Channel Ten reporter Bret Mason said, “What London really needs is to put the troops on the streets and really put those kids in their place” This also lines up directly with what the government and press are pushing for around the world; “Oh it’s good for you to put troops on the streets… its for your safety.”\nhttp://theintelhub.com/2011/08/08/london-to-be-under-martial-law-in-next-24-hours-troops-to-deploy-against-population-in-london\n\nPartnered again: Russia and NORAD conduct Exercise Vigilant Eagle 2011\nJoint Base Elmendorf-Richardson\nAugust 8, 2011\n\n(Exercise simulated U.S. flagged carrier, under call sign of Fencing 1220, on international flight which had been seized by terrorists.) Within minutes after takeoff the first fighter aircraft are visible off the left wing and Exercise Vigilant Eagle 2011 is well underway. The Russian Federation Air Force and the North American Aerospace Defense Command (NORAD) conducted their second Vigilant Eagle cooperative exercise Aug 5-9, further strengthening the communication channels between Russia and NORAD in the event of a hijacked aircraft transiting across the Bering Sea.\nhttp://www.jber.af.mil/news/story.asp?id=123267246\n\nGovernment agents stole $9,000 in cash during Rawesome Foods raid, says witness\nNatural News\nAugust 8, 2011\n\nA witness on the scene during the Rawesome Foods raid has publicly stated that an agent of the Specialized Surveillance & Enforcement Bureau of the Los Angeles County Department of Public Health stole $9,000 in cash from James Stewart after placing him in handcuffs. The $9,000 in cash was about to be used to acquire food products (honey, watermelons, eggs and others) that are offered to club members of Rawesome Foods. During the raid on Rawesome Foods, $4,500 in cash was taken from the store and $9,000 confiscated from James Stewart, but only the $4,500 in cash was noted on the warrant. California law requires that all items seized at the raid are noted on the warrant, but the LA County Department of Public Health failed to note the $9,000, meaning there is no longer any paper trail for this cash that was taken from James. Lela Buttery, a witness at the raid, explained this on the Robert Scott Bell Show (www.NaturalNewsRadio.com) Sunday, August 7, 2011: “The warrant states that they are to take various samples of dairy products. It also says that they can take files, computers, hard drives, cash, etc., but they have to account for everything. So all of the milk that was dumped out is not accounted for. There’s a part of the warrant that they have to say what they confiscated. There were envelopes in the office that were already set out to pay these vendors… that was about $4500, but when Terrence Powell asked James Stewart how much money is on the premises — that was one of the first questions that was asked — so he said he had nine grand on him, and Terrance asked why would you have so much money on you right now? That money was taken and on the currency sheet it is not on there. So I’m looking at some government agencies that are pocketing some dough right now.”\nhttp://www.infowars.com/government-agents-stole-9000-in-cash-during-rawesome-foods-raid-says-witness\n\nQuartzsite Police Chief Calls Oath Keepers and Tea Party “Terrorists” and Reports them to the FBI\nOath Keepers Response: “We’re your huckleberries, Chief!”\nOath Keepers\nAugust 7, 2011\n\nAccording to two confirmed eye witnesses, Quartzite Chief of Police Jeff Gilbert referred to the Oath Keepers, the Greater Phoenix Tea Party, and the Sons of Liberty Riders as “terrorists” during a public “coffee with the Chief” meeting on August 3, 2011. Reportedly, Chief Gilbert made the reference while discussing the upcoming August 27, 2011 rally that will be carried out by Oath Keepers, the Greater Phoenix Tea Party, and the Sons of Liberty Riders, telling the audience “”I take these terrorist threats very seriously and I have reported them to the FBI and anyone else who will listen.” This was first reported by the Greater Phoenix Tea Party at http://phoenixteaparty.ning.com/profiles/blogs/greater-phoenix-tea-party-have A public information request has been filed to secure the video and audio of the meeting. The Quartzite Chief of police is apparently following the playbook of the Southern Poverty Law Center, DHS, and of political elites, such as Joe Biden who recently compared the Tea Party to “terrorists.”\nhttp://www.infowars.com/quartzsite-police-chief-calls-oath-keepers-and-tea-party-%E2%80%9Cterrorists%E2%80%9D-and-reports-them-to-the-fbi\n\nMexican military helicopter lands in Laredo by mistake\nChron\nAugust 7, 2011\n\nA Mexican military helicopter landed Saturday afternoon at Laredo International Airport by mistake, said a spokeswoman for U.S. Customs and Border Protection. Mucia Dovalina, the uniform public affairs officer for the Laredo Port of Entry, said the helicopter landed about 3 p.m., but she couldn’t share details such as the number of occupants or whether they were armed. Dovalina said that, following protocol, CBP officers checked out the helicopter’s occupants, then allowed them to return to Mexico in the aircraft. “The only thing that I can tell you is that they did land here,” she said. “It was by mistake. They were processed and they were returned to Mexico.” According to a statement from CBP, the pilot mistook the airport for a landing strip in Nuevo Laredo. This is the latest such incursion that officials have called inadvertent as the Mexican military increases troop deployments in northeastern Mexico.\nhttp://www.chron.com/disp/story.mpl/metropolitan/7686830.html#ixzz1UOJxjnBQ\n\nStates can't opt out of Secure Communities program\nLos Angeles Times\nAugust 6, 2011\n\nIn an unusual move, the Obama regime has told governors they cannot exempt their states from the controversial Secure Communities program, which uses fingerprints collected by local and state police to help immigration authorities identify and deport tens of thousands of criminals each year. The Department of Homeland Security notified 39 governors Friday that the fingerprint-sharing program did not need their approval to operate in their states, and said it had voided agreements they had signed to authorize their states' participation, according to a copy of the letter.\nhttp://www.latimes.com/news/nationworld/nation/la-na-secure-communities-20110806,0,3349318.story\n\nLow Flying Helicopters Over Boston For Urban Warfare Military Exercise As Military Movements Continue To Increase\nThe Intel Hub\nAugust 4, 2011\n\nIn the last two months we have witnessed a huge increase in military movements that have some believing that something sinister is in the works.Whether it be numerous black helicopters, large scale military exercises, or massive train convoys, military movements have increased tenfold.On August 3rd, a concerned citizen filmed multiple army helicopters taking part in a military exercise directly over the city of Boston.That’s right, rather then train away from civilian populations, the Army is actively involved in drills that simulate them operating against U.S. citizens. A news release by the City of Boston confirms that the exercise was meant to test the military’s ability to operate in urban environments.... The Boston Herald has published an article on the military helicopters flying low over the city. The article is written from the perspective that this is completely normal and is actually a good thing. Apparently the idea of the military working against the population isn’t a problem to the corporate controlled media. Everyday it becomes clearer and clearer that at least some aspects of the military are planning an operation against the American people due to large scale civil unrest caused by terrorist attack or economic collapse.\nhttp://theintelhub.com/2011/08/04/low-flying-helicopters-over-boston-for-military-exercise-as-military-movements-continue-to-increase\n\nMilitary buzzes Boston buildings\nBoston Herald\nAugust 4, 2011\n\nMilitary helicopters flying low over the city last night were part of an ongoing training exercise, officials said. The choppers were taking part in Special Operations Command training when they buzzed between building tops with lights out around the Financial District between 9 p.m. and 11:10 p.m., said military public affairs officer Kim Tiscione. She said the urban environment training, in which the choppers did approaches to a downtown building, were part of training exercises in and around the city that have been ongoing since last week. The training continues through Friday, but there will be no more flights through the Financial District, Tiscione said. “It was certainly the most visible part of the training we were doing in the City of Boston,” she said. The city and military both made attempts to inform residents in advance of the maneuvers, Mayor Thomas M. Menino’s spokeswoman Dot Joyce said. Tiscione said the military coordinated with city officials “at every level” and had people on the ground and in constant communication through the exercises to ensure safety.\nhttp://www.bostonherald.com/news/regional/view.bg?articleid=1356375&srvc=rss\n\nThe Committee of 13\nInfowars.com\nAugust 4, 2011\n\nThe so-called debt ceiling crisis has nothing to do with the government running out of money. It is about the creation of a super committee, a council of thirteen, designed to circumvent Congress and ignore the will of the American people. The ruling elite have a plan to take America down. The takedown has a timeline, a schedule, and it has been interrupted and set back by Congress. Despite the fact Congress usually does whatever the globalists tell them to do, certain members hold up the agenda by holding hearings and introducing resolutions on everything from the Federal Reserve to the globalist wars in the Middle East, South Asia and now Africa. The handpicked “super Congress” – six members from the Senate, six from the House, and the president forming a committee or gang of 13 – will now push through the elite’s agenda behind closed doors in direct violation of the Constitution. Like the Supreme Soviet, the Council of 13 will take on the trappings of democracy – because the committee was proposed by elected officials, namely Senate Minority Leader Mitch McConnell and his counterpart Majority Leader Harry Reid with the consent House Speaker John Boehner – but will act as dictatorship by committee. If allowed to stand, the United States will have its own Central Committee, just like the former Soviet Union.\nhttp://www.infowars.com/the-committee-of-13\n\nTerror Crisis Or Debt Crisis, The Solution Is Always A Super Dictatorship\nTHE EXCAVATOR\nAugust 4, 2011\n\nThis agenda includes the gutting of Social Security and Medicare, an endless war for empire, the economic, security and political unification of Mexico, America and Canada, and top-down control of the economy and society by a technocratic class that answers to criminal bankers and criminal corporations. The creation of the Super Congress is another step in a process that began long ago, and won’t end until the structures that underpin the American constitutional republic are destroyed once and for all. By the swish of a pen, the treasonous political leaders from both parties overstepped their colleagues, who are considered half-wits that are blocking their secret agenda of control. “This provision,” said Congressman Ron Paul, commenting on the Super Congress, “is an excellent way to keep spending decisions out of the reach of members who are not on board with the leadership’s agenda.” Both President Obama and his treasonous comrades on the other side of the aisle are taking advantage of this hyped crisis to fundamentally change the character of the American political system and pass draconian laws without the active resistance of Congress. During a calmer state of affairs in Washington they would not have been able to get away with establishing a new legislative body which decisively ends the illusion that Washington can be held accountable to the American people through the voting box.\nhttp://disquietreservations.blogspot.com/2011/08/whether-it-is-terror-crisis-or-debt.html\n\nAgenda 21 training in MN\nWe Are Change\nAugust 3, 2011\n\nRight in our own backyards they are violating the constitution in the name of security.   We need to get informed about what is going on and put an end to it all.  Re-instate the Constitution, we need a new Modern Day Constitutional Convention.  I nominate Dr. Ron Paul to lead the fight vs tyranny.   Freedom is worth fighting for!  If we sit back and waste time then we will have no time left for change…\nhttp://www.wearechange.org/?p=8941\n\nGOA Chief: Super Congress ‘Will Lead Us Into Dictatorship’\nInfowars.com\nAugust 3, 2011\n\nGun Owners of America chief Larry Pratt warns that the new “Super Congress” created by the debt deal will lead America into dictatorship, labeling the move a “coup d’état” by the political class aimed at transforming the entire structure of government in the United States. Comparing the super committee to Plato’s council, Pratt pointed out that it would take just 34 Senate votes to sustain a bill put forward by the group, noting that it has been set up specifically to prevent lawmakers getting in the way of its agenda by necessitating a super majority to overturn anything introduced by the committee. “The first act of the next Congress hopefully is going to be to repeal this horrible piece of legislation, Pratt told the Alex Jones Show, adding that the committee could be used to target gun owners, property owners, taxpayers and businesses. “This is a game changer, they’ve decided that we don’t need the House of Representatives to originate revenue bills, we’ll just have the ‘super 12′ do that,” said Pratt, adding that Barack Obama would become the de facto deciding 13th member.\nhttp://www.infowars.com/goa-chief-super-congress-will-lead-us-into-dictatorship\n\nInfowars Special Report: Super-Congress Paves ‘Super Highway’ to Gun Control\nInfowars.com\nAugust 2, 2011\n\nAn Infowars Special Report covers the breaking news that the unconstitutional powers now being handed to the Super-Congress under the debt ceiling deal will be used to pursue gun control legislation, which has been too inflammatory to introduce under regular House and Senate rules. This, even as President Obama begins to restrict the 2nd Amendment via new ATF regulations placed on gun dealers throughout the Southwest United States in the name of stopping the flow of arms to drug cartels South of the border. Aaron Dykes reports.\nhttp://www.infowars.com/infowars-special-report-super-congress-paves-super-highway-to-gun-control\n\nCouncil Of 13 To Rule America (video)\n TheAlexJonesChannel\n August 1, 2011\n\nThis evil power grab is out in the open. Freedom dies not with a bang, but a bureaucratic whimper. Please warn whoever you can; the enemy is moving fast!\nhttp://www.infowars.com/council-of-13-to-rule-america", "group_id": 3920, "id": 1829620}]