[{"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300793378.463376, "message": "Falou-se em cooperação. Multidisciplinas. Elistismo. parece-me que na sua maioria, a comunidade que se interessa por todos os assuntos startups será mais pessoal ligado ao Tech, informática, etc.", "group_id": 6883, "id": 406356}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300793571.5366001, "message": "Ah e não estou a falar de \"designers\" que são os que fazem \"gráficos giros\", como já devem ter percebido.", "group_id": 6883, "id": 406361}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300793274.877687, "message": "Estava a ler o tópico da startup @InfluAds e \"bateu-me\" esta. Do pessoal que \"circula\" estes assuntos, quantos são memso designers?", "group_id": 6883, "id": 406353}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300793446.7715161, "message": "Já percebi que isto será um padrão, visto serem os que conseguem \"produzir\" a coisa própriamente dita. Agora...quantos conseguem mesmo perceber algum valor de estar um designer integrado nestes projectos?", "group_id": 6883, "id": 406357}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300793531.7180791, "message": "Provavelmente muitos me dirão que sim que sabem que é útil e importante, mas quantos de facto já o fizeram, fazem e que expêriencia tem sobre o assunto? é que apesar de tudo, podem saber que é importante mas achar que em \"tempos de crise\" pode-se cortar.", "group_id": 6883, "id": 406359}, {"user_id": 13689, "stars": [], "topic_id": 14436, "date_created": 1300793782.9079361, "message": "hoje em dia há mtos frontender's q são um mix entre design e developer em termos skill e sensibilidade. Mtos, como o @f, têm um background de desenvolvimento fortemente suportado por design", "group_id": 6883, "id": 406371}, {"user_id": 13689, "stars": [], "topic_id": 14436, "date_created": 1300794030.979584, "message": "A minha experiência, para lançar umas farpas provocadoras e iniciar discussão, é q designers puros (q não codificam) raramente s dedicam a projectos no mto longo-prazo. Penso q tem a ver com criatividade e ADD para tudo o q seja menos excitante do q as 1as semanas de um projecto. Tbm penso q esses têm pouco futuro pois o desenvolvimento web / mobile está cada vez mais associado a UX e é muito necessário estar-se mto por dentro de HTML5 por exemplo para se conseguir desenhar conceitos inovadores com detalhes q outros normalmente não consideram com designs \"incrementais\"", "group_id": 6883, "id": 406380}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300794219.8568871, "message": "Acho que isso tem haver com atitude e com o tipo de designer que pretendes ser. Há de facto aqueles que sim só se preocupam com o que tem de fazer no momento e quando deixa de ser \"criativo\" deixa de ser interessante. Concordo que será isto na sua maioria.", "group_id": 6883, "id": 406388}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300794524.4528821, "message": "Por vezes não tem haver com o saber ou não codificar, penso que terá muito haver com a \"sensibilidade\" e forma de ver as coisas. Designers, por princípio, terão uma mente menos analítica, daí serem criativos de forma diferente de um developer. Logo o imprint que podem dar, desde que dentro do assunto como referiste, será sempre diferente e numa perspectiva virada para o público alvo....design é isso basicamente, pensar com um público em mente.", "group_id": 6883, "id": 406394}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300794645.8771329, "message": "Agora...a grande dificuldade está em ter percepção desse valor. Já que código é algo que existe e funciona (ou não). O funcionamento de um designer, a não ser que seja algo palpável como um layout, um icon, uma cartaz, um objecto é mais difícil de percepcionar e creio que muito pouca gente o compreenda.", "group_id": 6883, "id": 406398}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300794362.5135851, "message": "Eu por exemplo não codifico, pelo menos nada pesado o suficiente para poder construir uma app. HTML e CSS. Infelizmente não consigo agora de repente fazer 5 anos em desenvolvimento numa universidade e sinceramente acredito mais no team work. isto porque sei que ou me vou dedicar a aprodundar a disciplina do Design, pelo menos mais ligado à parte Web, Ux e Service design ou então apenas serei um biscateiro ;) o que não me interessa.", "group_id": 6883, "id": 406393}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300794742.2835641, "message": "Agora...também sei que Designers (\"puros\") interessados em negócios, startups, investimentos, e código não são assim tantos :)", "group_id": 6883, "id": 406408}, {"user_id": 21945, "stars": [], "topic_id": 14436, "date_created": 1300796507.498383, "message": "É fácil perceber a importância de um designer nestas andanças. Em proporção, não são muitas as startups que primam pela tecnologia (leia-se: cujo produto tenha como base uma tecnologia revolucionária). Resume-se, portanto, à experiência que se pretende dar ao utilizador. Eu não vejo, por exemplo e falando em projectos nacionais, o bundlr como um sítio que, através de um bookmarklet, eu guarde coisas interessantes, mas sim uma solução extremamente simples para o meu problema de organizar conteúdo que encontro.", "group_id": 6883, "id": 406580}, {"user_id": 21945, "stars": [], "topic_id": 14436, "date_created": 1300796720.7222791, "message": "E essa relação dev-designer \"eu não preciso de ti, mas tu precisas de mim\" apenas funciona na teoria, porque se queres ter um algo sólido vais precisar dos 2.", "group_id": 6883, "id": 406598}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300797312.8618209, "message": "@ricardogo Precisamente. A minha questão é exactamente sobre essa percepção e a experiência que cada tem relativamente a este assunto. Pt é pequeno demais? Há pouco para todos para sermos fechados e criar esta cultura de elitismo onde se acha que não se precisa de ninguém? È apenas pela questão \" Não tenho dinheiro para pagar a um dev/designer?\" ou \" Design não é crucial, fica para quando houver dinheiro\"?", "group_id": 6883, "id": 406642}, {"user_id": 21945, "stars": [], "topic_id": 14436, "date_created": 1300806433.3809941, "message": "acho que este artigo pode ser interessante para esta discussão: http://helloform.com/blog/2010/11/designer-as-investor/", "group_id": 6883, "id": 407988}, {"user_id": 11987, "stars": [], "topic_id": 14436, "date_created": 1300816294.189096, "message": "ia mesmo linkar para isso, Ricardo. Thanks.", "group_id": 6883, "id": 409509}, {"user_id": 11987, "stars": [], "topic_id": 14436, "date_created": 1300816321.452215, "message": "para além desse, escrevi isto também: http://helloform.com/blog/2010/11/so-what-is-a-designer/", "group_id": 6883, "id": 409511}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300872537.599407, "message": "Nesse sentido até fui a uma entrevista com a Gesbanha (falei com o Francisco Banha mas a reunião não foi com ele), porque gostava exactamente de ter uma noção de como investidores tem uma ideia relativamente ao design e se conseguem compreender o apoio que um designer pode dar ao nível startup.", "group_id": 6883, "id": 415610}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300872717.801007, "message": "O que eu acho de fundo é que deveriam haver acções e plataformas que ajudassem a mudar de fundo o que se percepciona como designe/designer. Apesar da minha formação académica ser de design, fui \"treinado\" a pensar e não a seguir um padrão rígido (gráfico, industrial, etc) daí o pensar e ver isto de forma diferente.", "group_id": 6883, "id": 415626}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300872778.406661, "message": "De qualquer forma e voltando ao tópico, tenho interesse em saber, do pessoal tech, IT, business, que visão tem realmente sobre o designer/design. Uma opinião sincera mesmo que saibam que é contra o senso comum.", "group_id": 6883, "id": 415631}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1300872421.2622559, "message": "Eu na verdade já sabia que a este nível estava em sintonia com o @fred. Ele compreende perfeitamente a situação e é interessante que em relação ao  artigo do designer como investidor, cheguei exactamente às mesmas conclusões e ainda ando a pensar como dar a volta ao padrão...como designer freelancer é-me complicado trabalhar para equity..pelo menos a um ritmo interessante, ou então vivia com a familia debaixo da ponte.", "group_id": 6883, "id": 415587}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1300962482.895277, "message": "@nunorod Acho que descuraste o conceito que deu título ao teu post: o Design Thinking. Sendo um modo de pensar criativo, inato ao papel do designer, no conceito original o DT envolve sempre um misto de empatia, criatividade e racionalidade. O objectivo? Resolver problemas ou criar novas soluções tendo em vista as necessidades reais do utilizador e o sucesso do modelo de negócio. (http://www.amazon.com/Design-Thinking-Integrating-Innovation-Experience/dp/1581156685)", "group_id": 6883, "id": 425462}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1300962657.315187, "message": "Mas sem bs, o Iain Barker fez uma apresentação que referenciei na minha tese de mestrado (mas que já não está online pelos vistos) em que ele cruzava ou comparava duas correntes semelhantes: o Design Thinking e o UX Design. Dizia ele, e com razão, que as sensibilidades de uma área e de outra são semelhantes.", "group_id": 6883, "id": 425466}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1300962786.068146, "message": "Na realidade, o DT parece-me ser nada mais do que o ingrediente essencial que faz com que um Designer (puro ou não que isso a meu ver é uma utopia) queira saber como funciona o meio em que trabalha (seja ele o papel, a web, o vídeo, whatever…). E o contrário também serve! Conheço muito developer que consegue ganhar sensibilidade para alguns dos aspectos em que um designer tem de pensar…", "group_id": 6883, "id": 425470}, {"user_id": 21945, "stars": [], "topic_id": 14436, "date_created": 1301044590.2318959, "message": "@nunorod @tiagopedras por coincidência, li isto ontem e encaixa-se perfeitamente neste tema. here you go: http://www-course.cs.york.ac.uk/ait/classes/class16/materials/UX%20and%20the%20idea%20of%20design.pdf", "group_id": 6883, "id": 437071}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1301051415.4530189, "message": "@ricardogo Muito bom mas muito académico. Prefiro uma abordagem um bocadinho mais aberta…", "group_id": 6883, "id": 437603}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301075547.82516, "message": "O que eu acho é que o que hoje se chama de UX Design, na verdade é simplesmente uma palavra bonita para o que já é o processo de design em sí.", "group_id": 6883, "id": 440737}, {"user_id": 21978, "stars": [{"date_created": 1301224212.4881189, "user_id": 22444}], "topic_id": 14436, "date_created": 1301076174.765851, "message": "Agora surgem é diferentes formas de aplicar esse processo, essa criatividade e essa forma de pensar daí o UX, Service Design e Design Thinking.", "group_id": 6883, "id": 440813}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301075720.8128681, "message": "Em bom português, design traduz-se por desígnio. Os espanhois nesse aspecto foram mais espertos porque separam, diseño, de design e de dibujo. Desígnio, podem ver em qualquer diccionário (escreve-se sem c agora?) é:\" Intenção, projecto, plano, propósito; vistas.\"  Acho que esta definição diz tudo.", "group_id": 6883, "id": 440757}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301075847.974788, "message": "A questão é que muitos dos recém formados designers, que já foram mais orientados a uma disciplina em sí (gráfico, web ou industrial) estão a descobrir agora as raízes do design em sí, do seu âmago. Como disseste e bem @tiagopedras \"Resolver problemas ou criar novas soluções tendo em vista as necessidades reais do utilizador e o sucesso do modelo de negócio. \"", "group_id": 6883, "id": 440776}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301076568.104085, "message": "Qual é o sentido que faz um designer no processo de criação de uma startup ou mesmo na fase mais avançada, seja ela de um produto web como de um serviço? Esta é a pergunta que fica sempre no ar e que dificilmente se compreende no geral.", "group_id": 6883, "id": 440855}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301077587.278579, "message": "Estava a ler de novo o que o @fred escreveu no artigo dele na parte onde começa \"The designer you need today is different.\" http://helloform.com/blog/2010/11/so-what-is-a-designer/ A verdade é que isso sempre foi o o processo de trabalho de um designer!! Só que durante os ultimos anos começaram a aparecer os tais \"designers\" do photoshop e a imagem do designer passou a ser outra! Vão e leiam sobre um dos nosso grandes (Sebastião Rodrigues) e vão perceber o que digo.", "group_id": 6883, "id": 440981}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301077720.2677219, "message": "Eu por exemplo estive 5 anos a estudar, antropologia, museologia, ergonomia, historia da arte, anatomia, desenho, historia do design, etc etc. o Photoshop aprendi por iniciativa! Assim como a programar HTML e CSS! Portanto o que estudei foi design! e não estilimo e de facto chateia-me imenso que agora falem dessen processo, UX entre outros como \"a nova onda\", quando essa onda já existe há muito, simplesmente não é reconhecida.", "group_id": 6883, "id": 441005}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301077815.104739, "message": "Agora, concordo com p @fred quando diz que isso pode ser aplicado em algo masi do que fazer cartazes. Concordo e é por isso que estou a lutar, só não sei é como o resto percepciona isto.  Desculpem o rant...", "group_id": 6883, "id": 441024}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301077200.7050531, "message": "Bom isto ja´vai muito confuso. No fundo o que queria indagar era sobre o facto de eu ser designer de formação académica (em Design de Comunicação, posso explicar melhor se quiserem saber) e tenho vindo a explorar cada vez mais sobre o processo em sí, o universo UX, Web, \"startup culture\" e como as minha polivalências podem influenciar nestes meios. Gostava de saber se há mais casos como eu nestes círculos, e se há algum valor reconhecido a este respeito. Ou se designer é apenas o gajo(a) que faz o visual das coisas.", "group_id": 6883, "id": 440936}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1301224334.890574, "message": "@nunorod Duas coisas: Técnicos VS Designers sempre existiu (quase como Engenheiros VS Arquitectos). Outra coisa e só por curiosidade, onde tiraste o curso?", "group_id": 6883, "id": 450696}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1301306934.215977, "message": "Acho que aqui a questão é mesmo técnicos+designers=bom produto/serviço :)  . Tirei nas Belas Artes LX, mas o estilo de curso já mudou um pouco creio.", "group_id": 6883, "id": 456856}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1301390987.7799389, "message": "@nunorod Claro. O perfil das pessoas é que tem de ser de inteligência, pro-actividade e flexibilidade para que tudo corra bem ;)", "group_id": 6883, "id": 468331}, {"user_id": 32665, "stars": [], "topic_id": 14436, "date_created": 1304949732.2864759, "message": "Simplesmente esta havendo uma confusão sobre design e metodologia de trabalho. Qualquer curso de design que se preze tera em seu currículo todas esta cadeiras.", "group_id": 6883, "id": 971949}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1305018033.8434479, "message": "Claro, qualquer que se preze...infelizmente creio que muitos dos chamados cursos de Design são apenas cursos técnicos de saber mexer em software. Mas neste momento também creio que há escolas de Design excelentes!", "group_id": 6883, "id": 987084}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1305033372.568831, "message": "@nunorod sim, ainda existem algumas boas escolas em que o Design é ensinado à séria. Cursos técnicos são outra coisa diferente. Toda a bagagem teórica que faz de ti um designer não se consegue em formações técnicas obviamente.", "group_id": 6883, "id": 989139}, {"user_id": 22444, "stars": [], "topic_id": 14436, "date_created": 1305033281.8343141, "message": "@jorgedesignerbr design é uma metodologia, um processo, e não um resultado", "group_id": 6883, "id": 989109}, {"user_id": 32321, "stars": [], "topic_id": 14436, "date_created": 1305100213.7896099, "message": "dos 10~12 designers que conheço pessoalmente, nenhum tem skill's para desenvolver um destes projectos, não só porque não foi ensinado na escola como eles próprios não se interessam, pois muitos deles \"chateiam-se\" em ficarem \"limitados\" com as \"regras\" do \"bom senso\".", "group_id": 6883, "id": 1003383}, {"user_id": 32321, "stars": [], "topic_id": 14436, "date_created": 1305100061.1277699, "message": "os cursos... os cursos... trabalho como developer numa agência de comunicação e imagem, temos designers, uns licenciados em Design de Comunicação pelas Belas Artes de Lisboa e uns pela ESAD Caldas da Rainha em Design de Multimédia. Infelizmente para a ESAD Design de Multimédia é Flash (no kidding), não como um meio, mas sim a \"definição\" de Multimédia.", "group_id": 6883, "id": 1003351}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1305102502.6090641, "message": "A questão tem a ver à posteriori com o desenvolvimento pessoal. A mim nunca me foi ensinado a trabalhar com um software, tive que aprender. As metodologias de User Experience para Web também as tive de aprender, HTML e CSS, também tive que aprender. O problema é maioria do pessoal achar que depois do curso, não precisam de mais nada. Mas também aí o problema está no ensino que não promove este tipo de pensamento.", "group_id": 6883, "id": 1003782}, {"user_id": 32775, "stars": [], "topic_id": 14436, "date_created": 1305193580.25911, "message": "@nunorod Por acaso nunca conheci ninguém da área de web design que achasse que não precisava de mais nada depois do curso. Tenho sorte ou isso é mais mito do que outra coisa?", "group_id": 6883, "id": 1022901}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1305275247.215703, "message": "Mas já estou a divagar :)", "group_id": 6883, "id": 1038303}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1305275052.7789321, "message": "Espero que seja mais mito do que outra coisa, mas infelizmente, sei de coisas muito tristes, género um rapaz ir trabalhar para uma empresa de webdesign, curso de design (não sei qual específicamente), e não sabia mexer nem no photoshop nem fireworks, assim como não sabe trabalhar com um browser!!! Mas acredito que não seja tudo assim. Espero mesmo que seja mais um mito do que outra coisa. O que acontece mais é sairem do curso, meterem-se numa empresa e ficar por ali a trabalhar por amendoins, acabar os contratos, irem para o desemprego e terem de trabalhar em lojas.", "group_id": 6883, "id": 1038240}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1305275234.320946, "message": "Depois há o pessoal que sabe mexer em photoshop, fazem uns \"layouts\" ou umas cenas em flash e intitulam-se de webdesigners. Conseguem/convencem clientes a fazer esses projectos e pronto está o negócio feito.", "group_id": 6883, "id": 1038299}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1308299202.0354669, "message": "Interessante este artigo: http://www.fastcodesign.com/1664034/can-silicon-valleys-next-star-be-a-designer-rather-than-a-techie?partner=co_newsletter", "group_id": 6883, "id": 1417144}, {"user_id": 32321, "stars": [], "topic_id": 14436, "date_created": 1308753290.858362, "message": "E depois não sei se é uma \"tendência\" (como por ex o facto serem praticamente só homens no mundo da informática), mas os designers (de formação e vocação) não têm geralmente grande paixão pela \"web\", vejo isso bastante mais em progamadores que como eu, acabam por tentar mais tarde e em desespero, arranhar alguma coisa em Design.", "group_id": 6883, "id": 1457437}, {"user_id": 32321, "stars": [], "topic_id": 14436, "date_created": 1308753154.6370201, "message": "já tive o prazer de trabalhar (e actualmente trabalho) com malta muito criativa, mas a maioria deles tem como \"escola\" (falo não da escola  em si, mas do interesse, experiência) o design de Print ou Video/Motion... ou seja. Todos querem desenhar o \"próximo 2advanced.com\". Nenhum deles tira prazer em desenhar algo como por exemplo a homepage do SAPO. Isto para dizer que em certas áreas da Web, como as aplicações web e afins, acho que o melhor colaborador que podemos ter é de facto um apaixonado da web com alguma criatividade e não o oposto.", "group_id": 6883, "id": 1457409}, {"user_id": 21978, "stars": [], "topic_id": 14436, "date_created": 1311084999.6548049, "message": "É porque ainda não os conheceste ;)", "group_id": 6883, "id": 1671362}]