[{"user_id": 11039, "stars": [], "topic_id": 10900, "date_created": 1299275514.9385331, "message": "I just finished putting in the wooden floor and rimming for the second floor of Port Salamander. I layered on an extra inner rim of dirt with torches to provide a place to hang the eaves for the spheres on the roof outside of; no one'll ever see the dirt anyway and its easy to clean up after. Plenty of harvested wood in the box in the aftermath and a shedtonne of birch logs.", "group_id": 5836, "id": 273283}, {"user_id": 11038, "stars": [], "topic_id": 10900, "date_created": 1299370151.8329501, "message": "We don't need no stinking dirt... Well, except for scaffolding.", "group_id": 5836, "id": 278031}, {"user_id": 11039, "stars": [], "topic_id": 10900, "date_created": 1299372603.681952, "message": "Dirt! Dirty, nasty, ugly. Except now its not. Except now I've started the tunnel dig to the subaquatic entrance and hit a huge cave, which I spelunked naked and survived a shootout with four skeletons without taking a hit. Seriously. Bruce was listening when it happened.", "group_id": 5836, "id": 278105}, {"user_id": 29818, "stars": [], "topic_id": 10900, "date_created": 1302927801.751195, "message": "This is now lost somewhere, what with there being a new warp system and I don't think it ever got linked.", "group_id": 5836, "id": 708797}, {"user_id": 11039, "stars": [], "topic_id": 10900, "date_created": 1302927842.3536401, "message": "@TheBigLeneski We'll find it. Its out there. The truth is out there.", "group_id": 5836, "id": 708801}, {"user_id": 21168, "stars": [], "topic_id": 10900, "date_created": 1302930415.4600129, "message": "Oh, so that's why warps aren't working.", "group_id": 5836, "id": 709004}, {"user_id": 21168, "stars": [], "topic_id": 10900, "date_created": 1302930431.777221, "message": "Wait.....I'd have to be able to get on the server to know that. Hmmm......", "group_id": 5836, "id": 709005}, {"user_id": 11039, "stars": [], "topic_id": 10900, "date_created": 1302933310.367204, "message": "@nelalhurcran Yeah, the warps seem to get reset when the underlying guide architecture gets changed. Going to Canary was a big change for it.", "group_id": 5836, "id": 709148}]