[{"user_id": 11626, "stars": [], "topic_id": 6228, "date_created": 1297810647.137886, "message": "So, the world’s most mysterious UAV is set to return to Earth after spending nearly eight months in space where it did lord only knows what.\r\n\r\nCourtesy of the LA Times:\r\n\r\n    The X-37, an unmanned spacecraft that resembles a miniature version of the space shuttle, is set to land at Vandenberg Air Force Base as early as this week — more than seven months after it was launched into orbit.\r\n\r\n    The Air Force, which has been developing the X-37 pilotless space plane, has kept the ultimate purpose of the program hush-hush. It was launched April 22 from Cape Canaveral, Fla.\r\n\r\nThe Little Spaceplane That Could came on-line as the U.S. began to wind down space shuttle ops. As many know, space shuttle missions often split public NASA missions with secret Defense Department missions launching spy payloads into orbit. Well, the Boeing-built X-37 looks a lot like a mini space shuttle, complete with what looks like a cargo bay for launching or recovering mystery payloads. (Many people speculate that it is used to ferry weapons into space.)\r\n\r\nWhile there’s been a ton of speculation as to what the X-37 spaceplane does, I’d venture to guess a lot of its “experimental” missions have to do with Space Situational Awareness. Simply put, figuring out what everyone else is doing up there.\r\n\r\nThis has been the focus of Pentagon space planners for years now. Space is getting dangeroulsy crowded and countries like the U.S. and China are occasionally shooting down their own (for now) satellites. This means American military officials have a serious need to know what satellites are on-orbit and what they are doing up there.\r\n\r\nWhile we already have several ground-based SSA tools, they are not satisfying U.S. Air Force officials. The X-37 might be the next step in ramping up our efforts to know what other objects are up there and what they doing. Think about it, the X-37 can stay aloft for long periods of time and can change course to get close to other satellites. Who knows what it can do once it’s near them.\r\n\r\nhttp://defensetech.org/2010/12/01/mystery-space-plane-coming-home-still-no-clue-what-it-does", "group_id": 3920, "id": 116463}]