[{"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298323258.486259, "message": "Just in time for the final, just under a week away. Very bad tempered last league match away to Brum Ceetuh and they'll be hoping they can make good on their brutal tactics this time.  We'll have had the warm-up against Stoke mid-week, and will have to cross our fingers for no injuries.  Come on the boys! Time to put an end to the jibes about \"no trophies for The Emirates era.\"", "group_id": 858, "id": 170187}, {"user_id": 3722, "stars": [], "topic_id": 7898, "date_created": 1298325855.5919909, "message": "I think we will perform well since this is for a trophy and the A squad will be playing. If we win this one this is the stepping stone to EPL, FA and CL trophies.", "group_id": 858, "id": 172134}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298325441.4956801, "message": "Kind of worried about this game now. Everyone thinks we have it in the bag but it's a one-off game, on a relatively poor pitch, against a overtly physical and cynical side who will up for it. It will be a big test of character for Arsenal, given that it's this team's first chance of winning a trophy. If they were to lose the game the impact on the confidence of the side, and the amount of stick and negative press we'll get will be unbearable.", "group_id": 858, "id": 171999}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298325520.940989, "message": "That said we have dealt will with them, and other, physical sides this season. Presuming the same back four as we have had recently then I fancy our chances. They have been more than capable of deal with balls lofted into the box, there is confidence in the keeper and players up for the challenge.", "group_id": 858, "id": 172076}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298325563.726167, "message": "Bigger game than Barcelona IMO. Winning a title might just transform this team into the force that can be if they just had that extra quality title winning teams have :)", "group_id": 858, "id": 172113}, {"user_id": 3722, "stars": [], "topic_id": 7898, "date_created": 1298325819.128031, "message": "I had the same thoughts, from a confidence standpoint we need to win this game. It doesn't matter if it's not the top of the trophy list, we need to know this squad can perform in a big game when there is real pressure on the line. Barca isn't as much pressure because people expect us to lose that game.", "group_id": 858, "id": 172132}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298444501.200192, "message": "Definitely a bigger game than Barca.  They need to get addicted to winning, and Sunday could do the trick if they don't fold.  I'm only worried about the game if Wenger doesn't get the squad right.  If we play the full first team, with no more than a few judicious subs maybe, I think we have too much for them.  In particular we need Djourou, Fabregas and van Persie on the field.  That's our backbone now and we pretty much beat anyone with that set up.  Nasri is important but now that Arshavin is coming back into form it's nice to have options there, and I expect we'll want Wilshere to command the center of the pitch (amazing, can you imagine saying that of a 19 y.o?!) and Walcott to give us a credible wing outlet from pressure.  I'm not overconfident at all, but I'm definitely looking forward to the game.", "group_id": 858, "id": 186123}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298560753.2331121, "message": "Nice result to set us up for the weekend. Is it me or do Arsenal lose fluency with RVP out?", "group_id": 858, "id": 198310}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298566011.329004, "message": "Boy do they ever lose fluency!  And i was amazing to see how much snap they lost when CF4 limped off.  Fingers tightly crossed it's as precautionary as they are saying. I mentioned our backbone as Djourou, Fabregas and van Persie and you could really tell how much of it we lost yesterday.  Still much respect to the rest for gutting out the result.", "group_id": 858, "id": 199053}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298568683.5951891, "message": "Hmm. CF4 on twitter: cesc4official I dont know if ill make sunday or no,@but all i know is that from this moment to sunday 16'30 i wont sleep if its necessary.@Ive waited Too long to captain a final for arsenal and i wont give up till the last second.", "group_id": 858, "id": 199346}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298568693.5492311, "message": "Fingers crossed even tighter", "group_id": 858, "id": 199349}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298624810.210134, "message": "Won't make it :(", "group_id": 858, "id": 206688}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298689223.902755, "message": "Yeah too bad for El Capitan. Recently we play so much better with him on the field.  At least we'll probably have RvP.", "group_id": 858, "id": 212677}, {"user_id": 6225, "stars": [], "topic_id": 7898, "date_created": 1298975254.3891439, "message": "Well, that was a disaster wasn't it. Any news on RVP injury yet?", "group_id": 858, "id": 233552}, {"user_id": 14322, "stars": [], "topic_id": 7898, "date_created": 1298987265.9105761, "message": "I don't want to talk about it. Nothing happened this weekend.", "group_id": 858, "id": 234580}, {"user_id": 831, "stars": [], "topic_id": 7898, "date_created": 1298996439.3503931, "message": "@Damien I agree. Heck of a lot of fuss to follow such a quiet weekend. I understand RvP hurt his knee rescuing an old lady from a mugging by a miscreant wearing full medieval armor. He's suspected out for at least 2 weeks.", "group_id": 858, "id": 236013}]