[{"user_id": 38123, "stars": [], "topic_id": 42076, "date_created": 1310743852.8016491, "message": "Is the wiki page the only source of task allocation?", "group_id": 8618, "id": 1646188}, {"user_id": 38123, "stars": [], "topic_id": 42076, "date_created": 1310742931.2335, "message": "As instructed in the wiki page, I've forked the repository and the setup is complete. I would like to start contributing with coding. Among the currently unallocated tasks, \"Make sure the code follows PEP 8, strip whitespace from code\" seems to be one I would like to go for first. Although I've read the PEP8 long time back, but I'm not sure how to go about this task. Is there any tool or library which I can use, to make sure that the code follows PEP8?", "group_id": 8618, "id": 1646003}, {"user_id": 38123, "stars": [], "topic_id": 42076, "date_created": 1310757356.6740251, "message": "Okays. I'll go through the tools to get started first, then I'll start work on this task. So should I go ahead and update the wiki page, and assign the task to myself?", "group_id": 8618, "id": 1648046}, {"user_id": 24018, "stars": [], "topic_id": 42076, "date_created": 1310756972.8946359, "message": "Yes, the wiki is currently the main (and only) source of task allocation. As for the tools, several exists: pyflakes, pep8 and pylint being the most well known", "group_id": 8618, "id": 1647998}, {"user_id": 24018, "stars": [], "topic_id": 42076, "date_created": 1310757549.5550399, "message": "Sure, go ahead", "group_id": 8618, "id": 1648060}, {"user_id": 38123, "stars": [], "topic_id": 42076, "date_created": 1310762402.4980659, "message": "Should the entire code strictly follow PEP 8, or should I look for only whitespace related stuff?", "group_id": 8618, "id": 1648451}, {"user_id": 1167, "stars": [], "topic_id": 42076, "date_created": 1310837676.0877111, "message": "@subhranath make sure your changes don't onflict with the work being made in other branches, namely \"geodjango\" and \"class-based-views\". I usually \"clean\" a file when I start working on a class or function in it, so maybe some files are already pep8-compliant in a branch but not merged yet", "group_id": 8618, "id": 1652872}, {"user_id": 38123, "stars": [], "topic_id": 42076, "date_created": 1310910623.9642961, "message": "then any specific app or python modules which i shouldn't clean up? and the my last question is still open. Should the entire code strictly follow PEP 8, or should I look for only whitespace related stuff?", "group_id": 8618, "id": 1656767}]