[{"user_id": 24734, "stars": [], "topic_id": 38444, "date_created": 1307440597.929539, "message": "I feel horrible that I was not much help to you in your time of need. You are a kind and good soul and it breaks my heart to know your heart is broken.   I know you are having a rough time right now my friend, I wish I had words of wisdom to give you the courage and the strength to overcome your grief. But I am not gifted with words of such power so I turned to the words of the only being that has such power; The Lord.  I've picked a few verses that I pray you will find somehow comforting and if not then I pray He will give me the words or wisdom to comfort your mind in knowing your friend is in a much better place than we.       Kirstin,  I know I'm a mess myself right now and I don't always know what to say but please know I AM always here for you and will do all I can in any situation you may need me for. God Bless.  Verses to follow....  Psalm 30:5 Weeping may remain for a night, but rejoicing comes in the morning.  Psalm 55:22  Cast your cares on the LORD and he will sustain you;he will never let the righteous fall.     Isaiah 25:8  He will swallow up death forever. The Sovereign LORD will wipe away the tears from all faces; he will remove the disgrace of his people from all the earth. The LORD has spoken.  Last one.... Isaiah 40:18-31 Do you not know? Have you not heard? The Lord is the everlasting God, the Creator of the ends of the earth. He will not grow tired or weary, and his understanding no one can fathom. He gives strength to the weary and increases the power of the weak. Even youths grow tired and weary, and young men stumble and fall; but those who hope in the Lord will renew their strength. They will soar on wings like eagles; they will run and not grow weary, they will walk and not be faint.  Your \"Good\" friend or so I hope, Teddy.", "group_id": 9873, "id": 1318961}, {"user_id": 30352, "stars": [], "topic_id": 38444, "date_created": 1307466692.566324, "message": "Teddy, you were/are more help than you realize. Just knowing that you care about me is more condoling than I could ever hope for. You do not give yourself enough credit at all. These words that I have just read from you will always mean something to me. I cherish you as a best friend. I know you are here for me, and I thank you for being someone that I can turn to. That means the world to me. Those are GREAT verses. God really covered every single aspect of life in the Bible, didn't He? Reading the last verse brought tears to my eyes once again because that is my favorite verse and the verse that I sent you when you were down. Thank you for that. I cannot express my gratitude. I am strong. I know Quortez is in a much better place, where there is no more night, no more pain, no more tears. He never has to cry again. I will rejoice because of that. I will celebrate the short life he had, and I will look forward to seeing him again someday. As for \"Your Good friend or so I hope\", You are entirely more than a good friend to me. I consider you a best  friend. A true friend. You don't get many of those in life, and I plan on keeping you around for a while. Yep, you're stuck with me. Sorry! -Kirstin.", "group_id": 9873, "id": 1324188}, {"user_id": 24734, "stars": [], "topic_id": 38444, "date_created": 1307472335.3198421, "message": "Sometimes I do not feel I have the right words to say to someone when they confide in me. I've been Blessed with some weird charm or magnetism which draws ppl to me and for w/e the reason they just enjoy my presence. More than that they find it very easy to talk to me and I've felt for many years the Lord has wanted me to use that gift to help even if in some small way, these fine ppl. So I've prayed about it and I hope I've helped ppl over theyears. That said let me explain something else; I agree with your feelings about TRUE friendship. All my life I've been fairly popular bc of the thing I mentioned above so I've been fortunate enough to \"know\" many ppl. There's a big difference to me, between knowing someone and calling that person \"My Friend\". I take that word very seriously. So seriously in fact I'll lay out for you the ppl I consider to be my real life FRIENDS as well as my \"Internet Friends\". The list of names are not only my friends but my very best of friends. Wayne, Bob and Jerry I have known over 20 years and in all those years we've all gone through good times and bad but our friendships hv remained solid. April, I've known her almost 16 yrs and we've been married 14 of those years. To this day we've never raised our voices to one another and we've also remained the best of friends. 10 years ago when I went back to school I met Josh and after a rocky first few months (I'll explain sometime lol) we became great friends. In 2004 I met Louis AKA TopGun and even though we've gone over a yr once or twice without speaking we are and will always be friends.  FF to 2010 when I met Billy. We didn't hit it off right away but I could tell he would eventually become another real friend to me. Then this year, when I replied to your email about the chemotherapy I knew then that God had something in store bc back to my original statement \"I don't always have the right words\" sometimes I'll start an email or such without thinking about what to say and I swear it's God Almighty himself typing through me bc when I'm finished it seems I've always said the right thing. I give all that praise to Jesus as do I thank him for adding one more name to my short list of lifelong friends. I know being our ages we probably shouldn't have ever registered on one another's radar but we did so there must be a reason. I'm very proud to call you my Besty even though I way to old to use that word lol. God Bless Besty!", "group_id": 9873, "id": 1326092}, {"user_id": 30352, "stars": [], "topic_id": 38444, "date_created": 1307473926.436192, "message": "You are probably tired of me responding to your posts, and you do not have to reply to this one at all if you do not have time or simply do not want to. You are right about our ages.. Lol. We can always say that you are my \"mentor\". Actually, scratch that. To be honest with you, I am not ashamed, but proud to have you as a besty, even if you are older. You are wiser and have much more experience and that is the type of person I need in my life, considering I don't have anyone except a brother out of state. I would stand on a very tall building and shout to the world, \"Alla is my besty!\" As long as I could bungee jump off the building afterwards! I know that God brought you into my life for a reason, and that reason may just be just to have a true friend to talk to. However, I tend to babble, so just tell me to shut up every now and then, lol. I wish you and your family the absolute best. From what you have told me, I can tell that Mrs. April is an amazing woman. She is very lucky to have you. I had a little insight today, I hope you don't mind me sharing. I am volunteering at the hospital this summer. I will be volunteering throughout the summer until the end of July. I had orientation for that today. I will be working in the Clinical Lab Department, collecting blood & all that good stuff. AWESOME! Anyways, at our hopsital, everytime a baby is born, they chime a bell, and it can be heard throughout the entire hospital. While we were in the middle of orientation, that bell chimed. And we all just stopped... and gasped. And it was like a total moment of silence. And I realized that for every person God takes out of this world, He brings another one in. Of course, that baby isn't Quortez, but that baby is a miracle. The magical part about it is... Quortez LOVED babies. He adored them. He took care of his younger siblings all the time. He was a baby person. And I knew God was showing me when that chime went off that it's all going to be okay. Miracles are real, I am a firm believer. I was told I would never be able to have children. Well, I believe in miracles, and I believe I will have them. I was told I would have to receive treatments for the rest of my life. Well, God performed a miracle, and I no longer have to take the treatments. I know to always trust in Him. And I know that I can trust you, Teddy. I apologize for babbling. I hope you are feeling better today and I surely hope to see you tonight!", "group_id": 9873, "id": 1326434}, {"user_id": 24734, "stars": [], "topic_id": 38444, "date_created": 1307474843.266057, "message": "You are not basbbling but rather communicating IMO. This is how we get to know one another so do not ever apologize for or think I do not want to read another post by you. As much as I enjoy your jokes, I would much rather hear about KIRSTIN! (did i spell that correctly?) April is a VERY special person, she was born to take care of others and she is so very compassionate. She could have gone to school to become a doctor but she knew her calling long before graduating HS and in fact she graduated the month after she turned 17 yrs old!! She basically graduated as a junior! I did not know her then but I am still very proud of her. She was a LPN by age 18 and RN by age 20 and she is phenomenal at it. I have always been so proud to say my wife is an RN. Just as proud as I will be to say My Besty is a Doctor and is buying me a condo at the beach to retire in.. lol see how I added that in? lol You never cease to amaze me as you just did by telling me of your volunteering at a hospital... That is so AWESOME!!! Your friend knows how much you care for him and he is there anytime you want to speak to him. Call me silly but I have to believe that. It's one of the only things that got me through losing TJ so many years ago. I am here for you as are many others and together WE will make it through this.", "group_id": 9873, "id": 1326621}, {"user_id": 30352, "stars": [], "topic_id": 38444, "date_created": 1307493538.6425581, "message": "I am very excited about working at the hospital. I was hoping they'd let me work in the psych ward, but they won't :( Lol. I will be collecting blood and ... \"other\" specimens & running them through machines, la de da. I am hoping they will teach me how to draw blood too. That'd be awesome! I honestly had no idea that you had lost a son. And I am SO sorry. You were right on the market when you said no one should ever have to go through that, and I am so sorry that you did. Wow, April must be very intelligent. I admire her so much without even knowing her, first of all because she puts up with you. Secondly, because I would never have the patience to be a nurse. Some people were just made to be nurses though, and it seems like she is one of those people! Yes, you spelled it right! Oh yes, what part of the beach would you like your condo to be on, sir? :) I will be buying myself a condo also. We will have to visit each other, lol. I have been talking to Quortez all day today. I think he'd be extremely proud of me.. Thank you Alla.", "group_id": 9873, "id": 1331377}, {"user_id": 24734, "stars": [], "topic_id": 38444, "date_created": 1308270698.293447, "message": "I've not spoken to u about this all week. I pray you are doing better with this. As for the hospital, they get so many frivolous law suits everyday that they have to limit what volunteers can do. It's a shame but necessary. Have you considered working as a Certified Nurses Aid while in college? Just a thought.", "group_id": 9873, "id": 1414978}, {"user_id": 30352, "stars": [], "topic_id": 38444, "date_created": 1308335052.590004, "message": "Speaking of college.. I don't think I am going to try and be a Psychiatrist anymore. Simply because I really am terrible at math & chemistry, and I would have to learn all of those things for Psychiatry. I don't think I'd ever make it. :( I'm thinking about just majoring in Psychology instead, so that I don't have to worry about all that extra stuff. What do you think?", "group_id": 9873, "id": 1421329}]