[{"user_id": 7664, "stars": [], "topic_id": 34903, "date_created": 1305182196.4689, "message": "The Dramatica Dictionary has an entry for Blind Spot, and lists it as a Character Appreciation, but it's the only reference to it that I see. What is it?\n\nI think that there are two: one for the MC, one for the IC. Perhaps there is one in the SS?\nMy OS Symptom is Hinder, as is my MC's Symptom... so is Hinder the MC Blind Spot?\n\nAnd that means that my MC can't see that he Hinders himself? (which would be true)", "group_id": 2515, "id": 1021000}, {"user_id": 30287, "stars": [], "topic_id": 34903, "date_created": 1305209229.8733361, "message": "Very interesting!  Since it's not discussed anywhere in the text of the book, could it be a relic from an old version?", "group_id": 2515, "id": 1024737}, {"user_id": 10814, "stars": [{"date_created": 1305585450.4765019, "user_id": 7645}], "topic_id": 34903, "date_created": 1305216281.5520849, "message": "When a character comes to a story with an existing problem, he can no longer see the problem.  It is, therefore, his blind spot.  For example, if you ask Luke what the source of his personal problems is, he would never identify \"Test\" as his problem because he cannot see it as a problem.  It is in his blind spot.  However, what he would say his problem is comes from \"Unending\", which is the primary symptom of his problem (e.g. \"I'll never get off this planet because I have to help on the farm,\" or \"I'll never be a Jedi Knight because of all the training,\" or \"I'll never get to join the rebellion because it's so far away,\" etc.).\n\nBlind spots are created when we are unable to solve a problem and need to hide it from our awareness through the process of justification.  Sometimes we hide it so well that we cannot see it directly any longer, only the symptoms that indicate it's presence.", "group_id": 2515, "id": 1025894}, {"user_id": 7645, "stars": [], "topic_id": 34903, "date_created": 1305217514.5767391, "message": "The MC is aware of their symptom regardless of Resolve.", "group_id": 2515, "id": 1026037}, {"user_id": 7664, "stars": [], "topic_id": 34903, "date_created": 1305217328.2394409, "message": "Okay, thanks.\n\nI would have said this was a synonym for Problem. It's interesting to me that the MC can't see his symptom (yes, he's steadfast) or the Symptom in the OS.\n\nDoes he also not recognize the Symptom in the OC -- which is also Hinder? Or am I carrying it too far?", "group_id": 2515, "id": 1026026}, {"user_id": 7664, "stars": [], "topic_id": 34903, "date_created": 1305218276.93872, "message": "I had misread the definition. In a Change Character, the MC is blind to the source of the problem shared by his throughline and the OS. I thought the shared element was the \"blind spot\" and in a Steadfast character, that is the Symptom. My bad.", "group_id": 2515, "id": 1026198}, {"user_id": 7669, "stars": [], "topic_id": 34903, "date_created": 1305275154.26317, "message": "You're thinking of the \"Crucial Element\".", "group_id": 2515, "id": 1038266}, {"user_id": 7664, "stars": [], "topic_id": 34903, "date_created": 1305297192.0436831, "message": "On advice of council, I stay away from the crucial element.", "group_id": 2515, "id": 1042111}, {"user_id": 13650, "stars": [], "topic_id": 34903, "date_created": 1305301628.78229, "message": "Blind spot is also referenced on page 258 as \"misdirection to impact an audience's subconscious. Most interesting is the statement that this is where the audience \"personalizes the story\" by filling in the blanks.", "group_id": 2515, "id": 1043293}, {"user_id": 7664, "stars": [], "topic_id": 34903, "date_created": 1305304902.3938761, "message": "That is a very interesting statement. I hope they don't personalize it by saying \"Mike also has that kind of problem.\"", "group_id": 2515, "id": 1043886}]