[{"user_id": 481, "stars": [{"date_created": 1297301195.7030809, "user_id": 3952}, {"date_created": 1298203667.279566, "user_id": 8985}], "topic_id": 3000, "date_created": 1297300404.8679161, "message": "Depends on the startup.", "group_id": 250, "id": 62135}, {"user_id": 3923, "stars": [{"date_created": 1297341767.5701859, "user_id": 2239}], "topic_id": 3000, "date_created": 1297301044.92033, "message": "sounds like does having a boarding pass ensure a safe and happy journey", "group_id": 250, "id": 62282}, {"user_id": 3952, "stars": [], "topic_id": 3000, "date_created": 1297301235.655436, "message": "I'd like to add that it depends on your role in the business. Coder or business guy?", "group_id": 250, "id": 62325}, {"user_id": 1809, "stars": [], "topic_id": 3000, "date_created": 1297305517.6715031, "message": "Will having an MBA help you find value to deliver to customers? That is all that matters. Hire anything else.", "group_id": 250, "id": 63570}, {"user_id": 1809, "stars": [], "topic_id": 3000, "date_created": 1297305489.8703389, "message": "If you're a founder the most important thing is mastery of your field. If your business is \"business\" you may have a hard time finding a product.", "group_id": 250, "id": 63567}, {"user_id": 4295, "stars": [], "topic_id": 3000, "date_created": 1297306427.9305949, "message": "i agree, depends on the startup", "group_id": 250, "id": 63771}, {"user_id": 2451, "stars": [{"date_created": 1297372928.400177, "user_id": 6312}], "topic_id": 3000, "date_created": 1297306689.441082, "message": "I'd argue that is hinders. There is value to a mind that hasn't been filled with years of preconceived MBA notions.", "group_id": 250, "id": 63807}, {"user_id": 4467, "stars": [], "topic_id": 3000, "date_created": 1297310276.2706461, "message": "I'm an MBA with a 5 years of Work Experience prior to my MBA and I would like to add up here that 'Yes' it does help but if you have fair amount  of work experience than you might not need it in general.", "group_id": 250, "id": 64508}, {"user_id": 5363, "stars": [], "topic_id": 3000, "date_created": 1297338529.179105, "message": "MBA hinders definitely. Look at the biggest businesses - they were built by minds unadulterated by MBA's. The biggest businesses are built on breaking existing rules, not following the already existing ones - which is what B-schools are good at. In any case if you dont figure this out, or if you lack the drive so much so that a B-school degress doesnt seem like a unnecessary hindrance in your plans for world domination, then anyways you wont make it big.", "group_id": 250, "id": 68601}, {"user_id": 4875, "stars": [], "topic_id": 3000, "date_created": 1297371282.5083511, "message": "I think the diploma is not too important in managing the business. but most importantly the skill, perseverance. and innovation", "group_id": 250, "id": 74491}, {"user_id": 6312, "stars": [], "topic_id": 3000, "date_created": 1297372620.2072179, "message": "Probably hurts.", "group_id": 250, "id": 74727}, {"user_id": 6177, "stars": [{"date_created": 1297463285.799865, "user_id": 4250}], "topic_id": 3000, "date_created": 1297372438.9711931, "message": "read rework by dhh & jason friend and skip the mba ;-)", "group_id": 250, "id": 74703}, {"user_id": 6305, "stars": [], "topic_id": 3000, "date_created": 1297375161.466325, "message": "All other things being equal, it helps... but there's the rub - all other things are rarely equal. Exposure to business concepts and practices will never be a substitute for passion and experience in a field, but can help you think through how to deliver value to your customers in a long term profitable, scalable way.", "group_id": 250, "id": 75129}, {"user_id": 6950, "stars": [], "topic_id": 3000, "date_created": 1297430001.513242, "message": "I'd say it doesn't really hurt to have one, but yea it depends on the startup and what you're role is. If you're actively engaged in trying to get funding or dealing with partners, then it's probably a good idea to have one.", "group_id": 250, "id": 80213}, {"user_id": 6950, "stars": [], "topic_id": 3000, "date_created": 1297430040.942852, "message": "You can probably get by without it, an MBA is just a refining of business skills that any entrepreneur should already be aware of.", "group_id": 250, "id": 80215}, {"user_id": 4875, "stars": [], "topic_id": 3000, "date_created": 1297457784.5741489, "message": "@JeffBajayo I agree with your opinion", "group_id": 250, "id": 83319}, {"user_id": 7064, "stars": [], "topic_id": 3000, "date_created": 1297459294.0233259, "message": "Really depends on the person and their experience. If the MBA has helped them get great understanding of concepts, and their experience has helped them implement in the past, then the combination may be helpful. A lot of people are answering the \"Do you need an MBA to start a startup?\" question and some are answering the \"Should I get an MBA before I do a startup\" question, so your original question needs tuning. Suggest you take it to Quora.", "group_id": 250, "id": 83584}, {"user_id": 7345, "stars": [], "topic_id": 3000, "date_created": 1297469408.0220759, "message": "Speaking from personal experience as someone who started a business with nothing, learned from my mistakes as i went along and was able to develop along the way. My decision to get my MBA after the experience was more valuable to me as an enhancement tool than it would have been had i not had my blind experience first. So its not that its a hinderer, its actually a valuable tool that makes up 1/3 of the three necessities, the other two being hands on experience and most importantly a natural drive for innovation.", "group_id": 250, "id": 84699}, {"user_id": 6950, "stars": [], "topic_id": 3000, "date_created": 1297640781.2806211, "message": "@stevennathaniel thanks :D", "group_id": 250, "id": 94659}, {"user_id": 9321, "stars": [{"date_created": 1298203860.708389, "user_id": 8985}], "topic_id": 3000, "date_created": 1297654322.806052, "message": "If you think that an MBA will be your key to a successful startup, you are fooling yourself. On the other hand, people that think that they can run a business with no experience and no training are also fooling themselves. Great ideas can come from anywhere - having the drive and ability to work on an idea can come from anywhere. And it certainly doesn't hurt if you can talk intelligently about business concepts instead of having no clue about how to run a business.", "group_id": 250, "id": 95951}, {"user_id": 9392, "stars": [], "topic_id": 3000, "date_created": 1297657344.187108, "message": "@Mattarata So what would be more effective ways to learn how to run a business other than a MBA? Random courses? Trial and error? Reading?", "group_id": 250, "id": 96131}, {"user_id": 224, "stars": [], "topic_id": 3000, "date_created": 1297909182.7165029, "message": "@kwogger work at businesses, and learn what to do, and what not to do... then start your own and learn from that", "group_id": 250, "id": 128624}, {"user_id": 11933, "stars": [], "topic_id": 3000, "date_created": 1297964716.678318, "message": "Oh boy, the timeless debate of MBA vs Startup.  I've come full circle, and around again on this topic through my experience of doing both simultaneously.  A few things.  First: student loans are a great way to get cheap funding.  Second, say goodbye to friends and a social life.  Third, if you want to learn how to start a company, start a company. If you want to learn how to be an academic, then go to school.  Disclaimer: I'm graduating from the Univ of Chicago Booth in about a week, and built two startups during that time period.", "group_id": 250, "id": 133464}, {"user_id": 8985, "stars": [], "topic_id": 3000, "date_created": 1298203785.4217131, "message": "@PistolPeteX8 reading rework dosent neccessarily give you skills to run a business. even though its an awesome book :p", "group_id": 250, "id": 153101}, {"user_id": 8985, "stars": [], "topic_id": 3000, "date_created": 1298204177.202831, "message": "\"if you want to learn how to start a company, start a company. If you want to learn how to be an academic, then go to school. \" seanmeverett   - i like this way to put it!", "group_id": 250, "id": 153119}, {"user_id": 11933, "stars": [], "topic_id": 3000, "date_created": 1298239924.3057981, "message": "@StigFrahm thanks man, what are you working on these days?", "group_id": 250, "id": 154876}, {"user_id": 9321, "stars": [], "topic_id": 3000, "date_created": 1298268953.066237, "message": "@kwogger As others have said...just diving in and failing often teaches you what you need to know. Asking questions, having mentors, reading, researching, etc... all can give you most of what an MBA can give you. An actual MBA will either 1) help you learn complex financial stuff needed to go into investment banking or derivatives or 2) round out those un-answered questions in a variety of business aspects that help most MBA students understand more about what is needed to run a larger business or scale up a smaller one.", "group_id": 250, "id": 156852}, {"user_id": 13750, "stars": [], "topic_id": 3000, "date_created": 1298269788.4564509, "message": "Depends on the person, right?  I was a \"career switcher\"--taught high school and did a few other things before heading back to business school.  A lot of folks go to b-school because they want to work in consulting or investment banking, but there are some of us who went back simply to learn business.  I'm an entrepreneur now, and I don't think I would do it differently.  The connections I made in business school were invaluable, and I learned how not to do things just as often as I learned complex financial stuff and the like.  Ultimately it's a tool, just like the ability to code is a tool.  You need a lot of tools to start a business--those you learn \"on the street,\" those learned--as mentioned--from failing, those you taught yourself, and yes, some of the business tools as well.  If anything it's going to help when you get in a room with a bunch of MBAs and a term sheet in front of you...", "group_id": 250, "id": 156887}, {"user_id": 8985, "stars": [], "topic_id": 3000, "date_created": 1298299978.9936309, "message": "@seanmeverett I have alot of projects going on. Currently im doing marketing in in organization called Mobilize Europe - that creates greater awareness of the EU. Also im helping to market a book which is alot of fun. And then i have my job at Greentech Solutions where i do marketing, pr. What have you been working with recently? :)", "group_id": 250, "id": 159077}, {"user_id": 11933, "stars": [], "topic_id": 3000, "date_created": 1298324577.895812, "message": "@StigFrahm curious about the book, what's the topic? What are the challenges? Have been considering writing a short kindle minibook.", "group_id": 250, "id": 171265}, {"user_id": 14491, "stars": [], "topic_id": 3000, "date_created": 1298333972.3073039, "message": "can't hurt can it", "group_id": 250, "id": 175794}, {"user_id": 14637, "stars": [], "topic_id": 3000, "date_created": 1298366536.9093959, "message": "to conclude and answer the question, if you have experience as well, it helps, if not it hinders.", "group_id": 250, "id": 178001}, {"user_id": 14637, "stars": [], "topic_id": 3000, "date_created": 1298366478.871407, "message": "I take both sides here, I decided to complete my MBA after I had founded and exited my first company and whilst I had founded my next company.  It is frustrating to see the number of people taking MBAs who believe that after completion they will be able to start their own company.  Im my opinion, if you think you need an MBA then you don't have what it takes to succeed in the startup world otherwise you would have already done it.  I chose to do an MBA, not because I need it, or I think it is necessary but because it was interesting an useful but only after I had spent years running companies.", "group_id": 250, "id": 177999}, {"user_id": 8985, "stars": [], "topic_id": 3000, "date_created": 1298376617.364604, "message": "if it is even possible :p", "group_id": 250, "id": 178728}, {"user_id": 8985, "stars": [], "topic_id": 3000, "date_created": 1298376439.5885899, "message": "@seanmeverett The book is a guide for enhancing ones communication/stage skills, almost like a guide, which is extremely suitable in e format. The challenges depend on your resources, and the effort you are willing to put in it. I definetly think you should go for it! Let me hear your thoughts on it?  This is kinda out of topic so you should pm me!", "group_id": 250, "id": 178712}, {"user_id": 14669, "stars": [], "topic_id": 3000, "date_created": 1298376977.937547, "message": "I would say MBA helps a lot in starting up your own venture. It is not only about having the right education which u get via MBA, but it helps a lot in building right contacts and build network.", "group_id": 250, "id": 178744}, {"user_id": 11933, "stars": [], "topic_id": 3000, "date_created": 1298476080.5254271, "message": "@StigFrahm no way to PM on convore, hit me up on twitter: @SeanMEverett", "group_id": 250, "id": 188209}, {"user_id": 14776, "stars": [], "topic_id": 3000, "date_created": 1298479619.7407141, "message": "I think it is great for making connections but it isn't going to help you build a better company. It seems like a lot of money to spend that you could put into your company. But, it definitely won't hurt you.", "group_id": 250, "id": 188613}, {"user_id": 14970, "stars": [], "topic_id": 3000, "date_created": 1298482040.5798039, "message": "@kwogger random courses and resources help. Trial and error is good as well, but more important a very realistic view of your own skill sets, strengths and weaknesses is required. Even further, weakness awareness isn't always necessary, just know what your strengths are and focus on that. Speaking to comparative advantage, source someone else to do what you're not good at. \n\nNow this moves off the topic of \"Does having an MBA help or hinder when doing a startup?\" so I'll bring it back. NEITHER. I know MBAs and non-MBAS that suck at running businesses, accounting, finance or marketing (regardless of their education and experience). On the flip-side I also know some MBAs and non-MBAS that have started, sold and developed profitable businesses that exited favorably. \n\nOne thing to understand is the foundations on which the MBA environment operates. You learn a lot from your peers so unless you have some lessons to share do yourself and others a favor and try going balls-deep in your career prior to attending. Alternatively, while I know of people very successful in studying Finance, Marketing, IT or entrepreneurship in the MBA you have to understand that business school in general is a soft subject. Its not like engineering or mathematics. With that said, if you're going back to business school for an MBA and want to participate in startup, study accounting with exposure to corporate finance. Its one of the most useful streams and I would suggest this stream strongly. The success of a business, regardless of your idea, is going to come down to 1) the people and 2) accounting. If you can't control cash, your business will fail. If you can't budget for resource scaling, salaries, mortage, etc, your business will fail. If you don't know the first thing about raising money, or structuring money, you might leave money on the table. Will accounting make you a better startup entrepreneur? Probably not, but it'll help in the beginning of your business and you'll thank your accounting prof.", "group_id": 250, "id": 188928}, {"user_id": 1116, "stars": [], "topic_id": 3000, "date_created": 1298840647.3623569, "message": "Depends on what you have other than the MBA and your role in the company.", "group_id": 250, "id": 220716}, {"user_id": 22729, "stars": [{"date_created": 1301378828.187381, "user_id": 22183}], "topic_id": 3000, "date_created": 1301376751.3165939, "message": "My $.02. I'm an entrepreneur in the Internet field and my personal opinions is that it either does nothing or hurts. Reason being that I see most mbas as being useful in later stages of a developed company and not great as early stage talent. This is because most mbas I know tend to be in biz dev roles. It's rare to meet an MBA that was a good product manager which is what startups need.", "group_id": 250, "id": 466544}]