[{"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298682767.241677, "message": "Why do these companies try to lock you into their service by making you sign up with your card. Because they know many users won't use the product and will forget to cancel and they will get paid.", "group_id": 95, "id": 212352}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298682824.4998591, "message": "Don't you think this is almost like saying ' we don't think you'll like our product so we'll try and make sure you can't leave'. I mean for them they know if you find the competition you won't want to switch because of the hassle but surely these companies should be thinking \"let's be better than the competition\". Thoughts?", "group_id": 95, "id": 212360}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298683395.174535, "message": "I generally have no problem with a time-limited free trial.", "group_id": 95, "id": 212411}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298682856.963403, "message": "Free trial with credit card up front is basically a deal breaker for me.", "group_id": 95, "id": 212370}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298683434.6112931, "message": "I guess AWS sort of works that way now.  Do you need to give them a credit card?", "group_id": 95, "id": 212417}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298683108.612371, "message": "Wasn't there a report saying that most of the money AOL makes comes from people forgetting to cancel the trial they signed up for when they got AOL installed on their computer. Not sure about the credibility of this report but it makes sense.", "group_id": 95, "id": 212400}, {"user_id": 3159, "stars": [], "topic_id": 9181, "date_created": 1298683139.7435131, "message": "Definitely makes it seem like a scam to me", "group_id": 95, "id": 212402}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298683264.996891, "message": "Also even without credit card, the word 'free trial' scares me slightly. As if i'm going to get spammed with messages or my email sold. I think the best way is freemium, have a basic plan with minimal features so users can play around with the service and hopefully want to upgrade.", "group_id": 95, "id": 212404}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298683321.464294, "message": "If you can't convince yourself that what you're doing is good then how on earth could you convince a customer from the content on your site.", "group_id": 95, "id": 212407}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298683479.8600659, "message": "Netflix sends me loads of emails because I didn't subscribe but signed up to test it. It's put me off some free plans, mostly from big companies vs startups.", "group_id": 95, "id": 212420}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298683407.4268939, "message": "Although, I'm trying to think of a service I've used that worked that way.", "group_id": 95, "id": 212413}, {"user_id": 3531, "stars": [], "topic_id": 9181, "date_created": 1298685771.958611, "message": "@cdmoyer Yes.", "group_id": 95, "id": 212535}, {"user_id": 8668, "stars": [], "topic_id": 9181, "date_created": 1298688786.4312129, "message": "Guess who forgot to cancel his lovefilm (British netflix) sub before the free trial ran out!", "group_id": 95, "id": 212652}, {"user_id": 8668, "stars": [], "topic_id": 9181, "date_created": 1298688820.257297, "message": "Even more annoyingly, I kinda want to a continue - but on a cheaper plan, but you can't change plans while your account is on hold, so I have to pay a month of the most expensive package first", "group_id": 95, "id": 212653}, {"user_id": 7377, "stars": [], "topic_id": 9181, "date_created": 1298711546.6390691, "message": "there are some reports about the percentage of sign ups that do not cancel.. forget to cancel, or are to lazy to cancel. The number is big enough to encourage these companies to keep doing this even at the expense of poor customer service.", "group_id": 95, "id": 213390}, {"user_id": 15434, "stars": [{"date_created": 1299202814.416482, "user_id": 14571}], "topic_id": 9181, "date_created": 1298723034.1094799, "message": "What's the worst is companies that require a card during signup (which is done in 15 seconds online) but give no way to cancel online. Those in my opinion are borderline scams and I avoid them like crazy.", "group_id": 95, "id": 213882}, {"user_id": 15516, "stars": [], "topic_id": 9181, "date_created": 1298733340.1631279, "message": "A web hosting company ('free trial') and Lovefilm made me cancel via the phone to cancel.", "group_id": 95, "id": 214415}, {"user_id": 8327, "stars": [], "topic_id": 9181, "date_created": 1298736648.209064, "message": "Any stats on success rates between demanding a card number and not?", "group_id": 95, "id": 214512}, {"user_id": 2458, "stars": [], "topic_id": 9181, "date_created": 1298736312.2084661, "message": "One thought is that you weed out a lot of the not-so-serious users. Those are the kind that sign up for anything just because it's free, waste your resources, and were never going to convert to a paid user. If someone is truly interested in the service then they won't mind breaking out the CC for a free trial.", "group_id": 95, "id": 214492}, {"user_id": 2458, "stars": [], "topic_id": 9181, "date_created": 1298736350.7400911, "message": "I don't know if that is the right mindset to have about it or not, but having asked a few companies why they ask for a CC for a free trial that's been one of the answers given.", "group_id": 95, "id": 214493}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298737612.964186, "message": "I wonder what the real cost of a signup that never logs in is for most companies.", "group_id": 95, "id": 214582}, {"user_id": 12108, "stars": [], "topic_id": 9181, "date_created": 1298737620.8350739, "message": "A row or 5 in the database?  fractions of a penny?", "group_id": 95, "id": 214584}, {"user_id": 2458, "stars": [], "topic_id": 9181, "date_created": 1298754111.9701369, "message": "@cdmoyer It may not be a high cost on a small scale, but tens of thousands of trial users with virtually no conversions does take its toll. I've never worked on a project that large to say if the database/storage cost factors into the reasoning.", "group_id": 95, "id": 215624}, {"user_id": 8668, "stars": [], "topic_id": 9181, "date_created": 1298753606.0384851, "message": "@matthias good point to be honest, maybe you drive some people away but at least you know those that stay are semi-serious, that's worth it", "group_id": 95, "id": 215580}, {"user_id": 8668, "stars": [], "topic_id": 9181, "date_created": 1298753619.806411, "message": "Saying \"I'd pay for that\" and actually forking over card details are very different things", "group_id": 95, "id": 215581}, {"user_id": 2458, "stars": [], "topic_id": 9181, "date_created": 1298753987.223892, "message": "@ZoFreX Yep, I'm sure that the trial to paying user conversion is much higher for a site that asks for CC first. I've researched and haven't found any case studies though.", "group_id": 95, "id": 215611}, {"user_id": 8327, "stars": [], "topic_id": 9181, "date_created": 1298759257.7610469, "message": "@matthias Question is; is the conversion rate higher because people want it, or does it drop off a cliff after a month when people realise they forgot to cancel?", "group_id": 95, "id": 215876}, {"user_id": 7540, "stars": [], "topic_id": 9181, "date_created": 1298787687.740422, "message": "@matthias That's a canned response meant to make Company X look smarter and more [buzzword]. Sites want more users to register; it allows them to pad their stats. It makes them look more prominent, both to customers and to investors.", "group_id": 95, "id": 216680}, {"user_id": 7540, "stars": [], "topic_id": 9181, "date_created": 1298787740.8153009, "message": "If you're hurting financially enough that the negligible cost of extra database entries would put your company under, you're doing it wrong.", "group_id": 95, "id": 216682}, {"user_id": 15929, "stars": [], "topic_id": 9181, "date_created": 1298788489.967541, "message": "in most cases i agree with OP, however if the product / services is easily abused by having no-risk free trial, e.g. audible.com risky free trial is justified.", "group_id": 95, "id": 216692}, {"user_id": 13501, "stars": [], "topic_id": 9181, "date_created": 1298792196.5208189, "message": "having to input the credit card for trial is not risk-free (the term itself is already untrustworthy) since there is a risk of forgetting canceling a service. Before entering into any deals (a.k.a. signing any contracts) always read the contracts and some companies may simply don't bother to cancel since anyone who cancels is a *bad* customer.", "group_id": 95, "id": 216767}, {"user_id": 14930, "stars": [], "topic_id": 9181, "date_created": 1298834925.5008731, "message": "Credit card checks have the inherent effect of cutting down on fraud by a large margin. The cc# also ensures that the client is serious about paying for your service. IMHO, if you don't feel like entering your CC# for access to a free trial -- no obligation, no risk -- then the chance of you actually following through and paying for the service later on is negligible.", "group_id": 95, "id": 219842}]