[{"user_id": 5136, "stars": [], "topic_id": 16485, "date_created": 1301578152.3908589, "message": "Here a frontend little little bug http://ge.tt/4yhmv6V The X to close the window is a bit hidden. Obviously not important...", "group_id": 88, "id": 491651}, {"user_id": 12304, "stars": [], "topic_id": 16485, "date_created": 1301580533.0624361, "message": "just saying that \"real-time\" (incl. streaming effects) is evoked as a major difference of Convore vs plainold forums, and I'm wondering if the public will validate this.", "group_id": 88, "id": 492131}, {"user_id": 12304, "stars": [], "topic_id": 16485, "date_created": 1301579926.9756401, "message": "@ccarnino yeah, bummer about no line breaks in a message, but I guess this is to encourage short messages and rapid exchanges, esp. since IRC is mentioned as an inspiration by @leah. I'd actually love to see a Convore group with IRC-style rapid-exchange going on.", "group_id": 88, "id": 492001}, {"user_id": 24490, "stars": [], "topic_id": 16485, "date_created": 1301583286.6143701, "message": "my message input looks like a one-liner initially and since entering a sentence or two is what you usually want to do, enter seems like a fine shortcut for sending a message", "group_id": 88, "id": 492699}, {"user_id": 24490, "stars": [], "topic_id": 16485, "date_created": 1301582463.8687301, "message": "@zenbat If you press shift-enter in the input area you get what I would call a line break.\n\nIs this not what you mean?", "group_id": 88, "id": 492533}, {"user_id": 12304, "stars": [], "topic_id": 16485, "date_created": 1301583157.0349331, "message": "@jonathanj thanks, actually I realised I'd missed something looking at @ccarnino's post. But if line-breaks are legal, then <ENTER> should be have the expected behaviour, given that the message input looks like a textarea.", "group_id": 88, "id": 492677}, {"user_id": 12304, "stars": [], "topic_id": 16485, "date_created": 1301583674.055383, "message": "sure - what's the worst that can happen: make the mistake once, delete, re-send...", "group_id": 88, "id": 492813}, {"user_id": 5136, "stars": [], "topic_id": 16485, "date_created": 1301578047.00913, "message": "Hi @convore team!\nHere is some feedback that I've collected and I want to share with you. \n-Hour 2am San Francisco, the server takes about 5-10 to serve the pages.\n-Lot of groups but very few discussions\n-Edit the message I've sent. With enter occurs to send a message not finished. I can't edit. I can delete and resend.\n-I would love to have the notifications just about the conversation where I've participated or followed, not the entire group. This because there is a lot of conversation and I'm not intereste to all the conversation about HN... This is personal.\n\n-Great design and frontend interaction!\n-Great minimal design!\n-Great there's a mobile app. Also if minimal.", "group_id": 88, "id": 491629}, {"user_id": 5136, "stars": [], "topic_id": 16485, "date_created": 1301691042.5621531, "message": "I know about shift enter, was just feedback for a user who for the first time approach to this service", "group_id": 88, "id": 505632}, {"user_id": 5136, "stars": [], "topic_id": 16485, "date_created": 1301691079.244343, "message": "It's true that if that \"limitation\" is a will fo the creators means that want  create a certain behavior in the usage of the service", "group_id": 88, "id": 505639}]