[{"user_id": 11626, "stars": [], "topic_id": 43869, "date_created": 1313482276.7287011, "message": "TECHNOLOGY TUESDAY 8/16/11\r\n\r\nWelcome to the \"Technology Tuesday\" edition of SCMLA's News Digest!\r\n\r\n\r\nCalifornia Researchers Detect Radioactive Release From Fukushima Plant\r\nBloomberg\r\nAugust 16, 2011\r\n\r\nCalifornia Researchers Detect Radioactive Release From Fukushima Plant 15 Aug 2011 California scientists witnessed a spike in radioactive airborne material in March following the meltdown of Japan's wrecked Fukushima Dai-Ichi nuclear power plant, a study showed. Researchers at the University of California, San Diego, observed the highest levels ever detected of radioactive sulfur in the atmosphere, 15 days after Fukushima’s operators cooled the damaged reactors by pumping in seawater, according to a study published today in the Proceedings of the National Academy of Sciences.\r\nhttp://www.bloomberg.com/news/2011-08-15/california-researchers-detect-radioactive-release-from-fukushima-plant.html\r\n\r\nNuclear Expert: Radioactive Rain-Outs Will Continue For a Year\r\nEven In Western U.S. and Canada – Because Japanese Are Burning Radioactive Materials\r\nWashington’s Blog\r\nAugust 15, 2011\r\n\r\nNuclear expert Arnie Gundersen says in a new interview that the Japanese are burning radioactive materials. The radioactivity originated from Fukushima, but various prefectures are burning radioactive materials in their terroritories. Gundersen says that this radioactivity ends up not only in neighboring prefectures, but in Hawaii, British Columbia, Oregon, Washington and California. He notes that radioactive rain-outs were documented recently in British Columbia and Oklahoma with geiger counters. Gundersen is working with scientists who will publish a paper in the near future definitively debunking Canadian and American health officials’ claims that only harmless levels of radiation are being released. Gundersen has a high-level contact in the State Department who says that the U.S. government has decided – within various agencies, including the State Department, FDA, and other agencies – to downplay the dangers from Fukushima. Because of this policy decision, the government is not really testing for radiation. Gundersen says that well see another year of radioactive rain-outs, as the Japanese continue to burn radioactive materials.\r\nhttp://www.washingtonsblog.com/2011/08/nuclear-expert-because-japanese-are.html\r\n\r\nDamaged Reactor Gets New Way to Curb Radiation Leaks: a Tent\r\nWall Street Journal\r\nAugust 13, 2011\r\n\r\nThe operator of Japan's damaged Fukushima Daiichi nuclear-power plant is building a huge tent to cover one of the worst-hit reactors, officials said. Officials hope the cover will keep radioactive materials that have already leaked from spreading, prevent rainwater seepage and offer a barrier from possible leaks or blasts in the future. The tent is made of airtight polyester. It will stand 177 feet tall and stretch 154 feet in length.\r\nhttp://online.wsj.com/article/SB10001424053111903918104576504581519139352.html\r\n\r\nReal Domestic Terror As Microwave Weapons Used On Populace\r\nAmerican Free Press\r\nAugust 12, 2011\r\n\r\nThere is an array of high-tech populace control weapon devices that are being used on the American people, and it’s time someone stepped up and admitted their existence. Who do you think these weapons are being used on? Victim testimony at the recent Bioethics Commission helps answer the question. One control device was featured on the PopSci website: “The U.S. Defense Department has tested some spooky weapons, but those involving mind control and telepathic attack may be near the top of the list. A newly declassified 1998 document released under the U.S. Freedom of Information Act describes potential weapons for crowd control, such as a microwave gun that could beam words silently into people’s ears, and an electromagnetic pulse that causes epilepsy-like seizures.”\r\nhttp://www.americanfreepress.net/html/real_domestic_terror_281.html\r\n\r\nElectronic skin tattoo has medical, gaming, spy uses\r\nAFP\r\nAugust 12, 2011\r\n\r\nA hair-thin electronic patch that adheres to the skin like a temporary tattoo could transform medical sensing, computer gaming and even spy operations, according to a US study published Thursday. The micro-electronics technology, called an epidermal electronic system (EES), was developed by an international team of researchers from the United States, China and Singapore, and is described in the journal Science. “It’s a technology that blurs the distinction between electronics and biology,” said co-author John Rogers, a professor in materials science and engineering at the University of Illinois at Urbana-Champaign. “Our goal was to develop an electronic technology that could integrate with the skin in a way that is mechanically and physiologically invisible to the user.”\r\nhttp://www.breitbart.com/article.php?id=CNG.6e1e2ad90e2d94b12b6258b7e9c5b33d.611&show_article=1\r\n\r\nSecurity flaw found in feds' digital radios\r\nCNET\r\nAugust 11, 2011\r\n\r\nExpensive high-tech digital radios used by the FBI, Secret Service, and Homeland Security are designed so poorly that they can be jammed by a $30 children's toy, CNET has learned. A GirlTech IMME, Mattel's pink instant-messaging device with a miniature keyboard that's marketed to pre-teen girls, can be used to disrupt sensitive radio communications used by every major federal law enforcement agency, a team of security researchers from the University of Pennsylvania is planning to announce tomorrow.\r\nhttp://news.cnet.com/8301-31921_3-20090434-281/security-flaw-found-in-feds-digital-radios\r\n\r\nAP: Facial recognition in use after riots\r\nCBS News\r\nAugust 11, 2011\r\n\r\nFacial recognition technology being considered for London's 2012 Games is getting a workout in the wake of Britain's riots, a law enforcement official told The Associated Press on Thursday, with officers feeding photographs of suspects through Scotland Yard's newly updated face-matching program. The official said that the Metropolitan Police's sophisticated software was being used to help find those suspected of being involved in the worst unrest the force has faced in a generation, although he cautioned that police had a host of other strategies at their disposal.\r\nhttp://www.cbsnews.com/stories/2011/08/11/ap/tech/main20091203.shtml\r\n\r\nPentagon loses billion-dollar hypersonic aircraft over Pacific Ocean\r\nTG Daily\r\nAugust 11, 2011\r\n\r\nThe Pentagon lost contact with the Falcon HTV-2 as it attempted to conduct a hypersonic test flight over the Pacific Ocean. After successfully launching from Vandenberg Air Force base in California, the HTV-2 separated from the Minotaur IV rocket at a sub-orbital altitude and began its return to Earth. All seemed well until the billion dollar aircraft went silent during the gliding stage of the flight, when it was slated to fly above the Pacific at 20 times the speed of sound (13,000 mph), or Mach 20, in a series of complex maneuvers.\r\nhttp://www.tgdaily.com/space-features/57835-pentagon-loses-hypersonic-aircraft-over-pacific-ocean\r\n\r\nCIA tracked Canada's Cold War satellite research\r\nThe Star\r\nAugust 9, 2011\r\n\r\nDeclassified records show the CIA closely tracked Canadian satellite and imaging research during the Cold War. Documents indicate the U.S. spy agency saw Canada's fledgling telecommunications satellite network as an influential project that would set the pace for other nations planning to launch their own systems. A still heavily censored memo reveals the CIA also took a special interest in research by an Ottawa university on Soviet commercial enterprises.\r\nhttp://www.thestar.com/news/canada/article/1037132--cia-tracked-canada-s-cold-war-satellite-research", "group_id": 3920, "id": 1882083}]