[{"user_id": 8474, "stars": [], "topic_id": 4573, "date_created": 1297614724.0825601, "message": "svg doesn't work on android (although it will in android 3.0), and there are plenty of structured/vector graphics wrappers on top of canvas (like dojo.gfx or many others), and there are wrappers that make canvas work on IE 8 or older, like excanvas and flashcanvas.", "group_id": 1270, "id": 91760}, {"user_id": 2106, "stars": [], "topic_id": 4573, "date_created": 1297632003.7011931, "message": "for IE8 <, you have to use VML ... older version of IE doesn't support SVG or canvas.", "group_id": 1270, "id": 93795}, {"user_id": 5372, "stars": [], "topic_id": 4573, "date_created": 1297788031.663734, "message": "I like prototyping in SVG. Vector graphics are easy to setup with libraries like Raphael ( http://raphaeljs.com/ ). Click events are easier to handle on SVG since they are actual elements. In the end though, I get better performance out of Canvas across browsers (well, maybe I'm doing something wrong, but still...).", "group_id": 1270, "id": 112631}, {"user_id": 5372, "stars": [], "topic_id": 4573, "date_created": 1297788404.7085891, "message": "In the end though, I think it all depends on what you want to do...", "group_id": 1270, "id": 112667}, {"user_id": 3774, "stars": [], "topic_id": 4573, "date_created": 1298048338.2986879, "message": "@goofydelinquent if you get better performance out of canvas across browsers, what about IE6-8? Do you use any particular js libraries?", "group_id": 1270, "id": 144347}, {"user_id": 13562, "stars": [], "topic_id": 4573, "date_created": 1298049370.619422, "message": "I totally depends on what you want to do. In SVG you handle elements on which you can attach events (which gets quite difficult with Canvas). On the other hand, since the Browser needs to take care of all these elements, the performance gets bad with many elements (>400). \n\nhttp://borismus.com/canvas-vs-svg-performance/ \nhttp://ajaxian.com/archives/rendering-performance-in-canvas-compared-to-svg-and-vml \nhttp://dev.opera.com/articles/view/svg-or-canvas-choosing-between-the-two/", "group_id": 1270, "id": 144447}, {"user_id": 5372, "stars": [], "topic_id": 4573, "date_created": 1298215115.4309361, "message": "@aidz usually I don't target those browsers when working with Canvas and then suggest the users use ChromeFrame or ExplorerCanvas. I like modernizr to detect what browser features are available and fall back to something else if they're not available.", "group_id": 1270, "id": 153760}]