[{"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1307014417.428525, "message": "http://www.neogaf.com/forum/showthread.php?t=432160", "group_id": 9493, "id": 1265577}, {"user_id": 31852, "stars": [], "topic_id": 37807, "date_created": 1307016806.2500989, "message": "If those aren't bullshots, then ... WOW. Uncharted looks incredible.", "group_id": 9493, "id": 1265731}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307017249.406466, "message": "Take THAT, iPhone.\n\nNot that… today's average mobile Angry Birds gamer cares.", "group_id": 9493, "id": 1265777}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1307021016.154814, "message": "Well, in a year iPhone 5 will probably thump that too.", "group_id": 9493, "id": 1266585}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1307021521.914315, "message": "Also, I'm not really THAT impressed with Wipeout. Expected more. Uncharted on the other hand... it looks great. I'm sure Neilan was not involved in the making of that game. I don't see any mini games fitting in there.", "group_id": 9493, "id": 1266675}, {"user_id": 25703, "stars": [], "topic_id": 37807, "date_created": 1307035144.1008329, "message": "I'm the anti-minigamer!", "group_id": 9493, "id": 1268835}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307035196.782589, "message": "@dawid22 The original NGP specs are give it roughly 2x the horsepower of the iPhone 4.  Also, a dedicated portable console doesn't have quite the priorities of a mobile phone in terms of portability, not being overly power-hungry, &c.", "group_id": 9493, "id": 1268840}, {"user_id": 31852, "stars": [], "topic_id": 37807, "date_created": 1307046580.161865, "message": "A slew of previews of both the hardware and games have hit the web, and have been very positive. Also, the system apparently not only boasts full backwards compatibility with PSP games, but will also render them at a higher resolution and enable both analog sticks to be used.", "group_id": 9493, "id": 1270845}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1307602583.004395, "message": "Just read that the VITA will be region free. That's a good start", "group_id": 9493, "id": 1346954}, {"user_id": 35617, "stars": [], "topic_id": 37807, "date_created": 1307604600.180603, "message": "Which still makes me wonder why the damn 3DS is region locked.\n\nAlso: Wake me up when they announce a Persona game for the Vita.", "group_id": 9493, "id": 1347101}, {"user_id": 32692, "stars": [], "topic_id": 37807, "date_created": 1307607251.0564001, "message": "The Vita's screen is stunning, especially when you're looking at a vibrant game like Blazblue. I did find it a little too easy to accidentally activate the rear touch pad. Not a huge inconvenience (it's easy to adjust), but I blew quite a few power-ups in Super Stardust that way.\n\nThe front (capacitive) touch screen is a pretty unobtrusive addition. For the most part, I've seen it being used for interface stuff, such as tapping a map icon on the screen. Hardly essential, but sometimes it just seemed more natural to tap the screen for quick access to something. \n\nThe analog sticks are ... about as good as you might expect given the system's size. They feel a little flimsy, and aren't deep enough to match the range of, say, the Dual Shock, though they're certainly better than the PSP's awkwardly placed nubbin. The biggest surprise? The Vita is much lighter than you think.\n\nGraphically, I think \"PS3-level\" is an exaggeration at this point. Uncharted: Golden Abyss is probably the best looking game so far, and it's not quite up to the level of Uncharted 1.", "group_id": 9493, "id": 1347291}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307607809.380409, "message": "Hmmmmmmmm.  I think I potentially want one of these…", "group_id": 9493, "id": 1347312}, {"user_id": 31753, "stars": [], "topic_id": 37807, "date_created": 1307611168.0390229, "message": "I am strongly leaning towards getting one when they get released here. At the moment it appeals more to me then the 3DS does.", "group_id": 9493, "id": 1347596}, {"user_id": 31852, "stars": [], "topic_id": 37807, "date_created": 1307612133.940583, "message": "Just play it on any of the nineteen platforms you've already bought it for. Problem solved!", "group_id": 9493, "id": 1347688}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307611371.253633, "message": "The only problem is that I'm going to HAVE to play Ocarina.", "group_id": 9493, "id": 1347625}, {"user_id": 31852, "stars": [], "topic_id": 37807, "date_created": 1307612208.3259439, "message": "I do empathise, though. I've not played Ocarina, and I was kinda wanting to play it on 3DS, despite owning the GameCube port.", "group_id": 9493, "id": 1347696}, {"user_id": 31852, "stars": [], "topic_id": 37807, "date_created": 1307612236.286932, "message": "Also, that Mario game they showed looked great.", "group_id": 9493, "id": 1347698}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307616740.349668, "message": "I saw some side-by-side shots of Ocarina original vs. 3DS the other day — can't even remember there.  Suffice to say they've sharpened up geometry and textures a fair bit.  So… you know… it being that I'm in the embarrassing situation of never having finished the \"best game of all time\", I can hardly afford to miss this opportunity.\n\n(…but it may have to wait a bit, seeing as I'm cutting back on my discretionary purchases in order to budget for a biggish expense.)", "group_id": 9493, "id": 1348219}, {"user_id": 25703, "stars": [], "topic_id": 37807, "date_created": 1307640202.443356, "message": "I'm definitely getting one, even I don't expect it to be a massive hit. :\\", "group_id": 9493, "id": 1352039}, {"user_id": 25703, "stars": [], "topic_id": 37807, "date_created": 1307640288.3178351, "message": "I'm really hoping for some quality experimental indie games on the PSN store, that alone would make it worthwhile.", "group_id": 9493, "id": 1352049}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1307652006.380367, "message": "I've not heard much about Wipeout. Genuchi, you feel like giving me some feedback on your last day. I need to know what that is looking/feeling like.", "group_id": 9493, "id": 1353518}, {"user_id": 31927, "stars": [], "topic_id": 37807, "date_created": 1307688424.210562, "message": "So, a few weeks back there were rumours that there would be two models of the NGP (as it was then), differentiated mostly by the amount of memory they have available(?)\n\nSince the official announcement, has there been any indication so far that the 3G model has any other technical advantages over the Wi-Fi-only model?", "group_id": 9493, "id": 1357822}, {"user_id": 25703, "stars": [], "topic_id": 37807, "date_created": 1312307294.5538249, "message": "How the PS3 and Vita will work together: http://www.joystiq.com/2011/08/02/sony-on-how-ps3-and-vita-will-play-together/", "group_id": 9493, "id": 1777288}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1313868097.4854109, "message": "Those who like a good Wipeout soundtrack - They've signed up Orbital, Sounds of London, Noisia and some oldies from back in the day and doing more current remixes for some of the original tracks on Wipeout and 2097. Damn developers... make me get this on launch now. I'll just have to be strong and buy a $1 game on my iPhone instead.", "group_id": 9493, "id": 1918126}, {"user_id": 33318, "stars": [], "topic_id": 37807, "date_created": 1313867988.4304841, "message": "Right, so I had some good hands-on time with the Vita and I walked away wanting one. Make no mistake, that second analogue stick changes everything. Console games on-the-go just works with that now. Secondly, that screen looks mighty fine and the unit does not feel that heavy in your hands. I have not compared it to the 3DS yet (in the weight department) but I could swear that it felt very similar. Wipeout 2048 is fantastic, after I originally had concern for it.", "group_id": 9493, "id": 1918119}]