[{"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308187425.7254529, "message": "Good question, have to think about it.  How about John Doe in Seven?", "group_id": 2515, "id": 1406463}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308186929.461237, "message": "My mind is drawing a blank at moment.  I was looking through the book and there aren't any examples listed, so I thought I'd throw it out there and see if I can get any good examples here.  I'm sure there's tons, but my mind is not clicking at the moment (I'm thinking perhaps Lotso in Toy Story 3 may qualify, since Woody and he essentially share the same problem, but Lotso's approach is to the extreme which forces Woody to reconsider).", "group_id": 2515, "id": 1406415}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308187210.309324, "message": "First example that comes to mind is The Exorcist -- \"The Devil\" is both Antagonist & Impact Character.", "group_id": 2515, "id": 1406449}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308187272.412478, "message": "I'm also thinking of Die Hard -- but is the Alan Rickman character, obviously the Antagonist, also the Impact Character?  Or is the wife the IC?  Anyone?", "group_id": 2515, "id": 1406454}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308187416.853482, "message": "Re: Toy Story 3, in my view the Impact Character is \"the other toys\" as a group.  That's where the emotional argument primarily lays--between Woody and the other toys--I think.", "group_id": 2515, "id": 1406462}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308188555.044044, "message": "I know reading through the book, it says it's used less frequently so part of what I'm trying to determine by examples is really how frequent.  I would like to think in a story like Tootsie, somebody has to qualify as well since all the other main players, save Jeff, eventually end up being antagonist to him in their particular story-lines - I'm just not quite sure if it would be right to say they're all antagonists/impact characters.  It doesn't \"feel\" right, but at the same time, they all more or less contribute to the function on some level.", "group_id": 2515, "id": 1406566}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308187623.198359, "message": "In TS3, I see the issue Lotso and Woody sharing as one of abandonment.  Lotso already has been abandoned by his owner whereas Woody is afraid of it.  I thought the other toys were more or less resigned to it.  As the story progressed, I saw Lotso as dealing with having been abandoned by becoming bitter and enslaving all the other toys (when they arrive, he says they'll never have to worry about being hurt again).", "group_id": 2515, "id": 1406481}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308188319.291311, "message": "Ooops, never mind that.  I may have to read through that TS3 screenplay again tonight, just for the heck of it.", "group_id": 2515, "id": 1406543}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308187684.228142, "message": "As I recall the movie, that's probably a good example!", "group_id": 2515, "id": 1406489}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308187741.18415, "message": "That's how I sort of drew a parallel to Woody's take on the issue, believing through the course of the story, he saw how that was the wrong approach to the issue.  I could be wrong as I never sat down and analyzed it, but that's kind of how it came off in my head.", "group_id": 2515, "id": 1406498}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308188041.1433129, "message": "Actually, I saw Woody as the Steadfast character, never losing faith in Andy, and ultimately he \"wins\" the argument.  It's the Other Toys who need to \"change\" their outlook.  And in fact Lotso kinda does too, echoing in the Objective Story the themes of the Subjective Story.  That's how I read it.  Jim Hull, your thoughts?", "group_id": 2515, "id": 1406522}, {"user_id": 7669, "stars": [], "topic_id": 39506, "date_created": 1308188193.712914, "message": "Another thought on Antagonist/IC doubling up -- it was many many years ago that we discussed this in our group meetings, but doesn't \"In the Line of Fire\" fall into that category?  (The John Malkovich character.)  Chris or Jim, am I recalling that right?", "group_id": 2515, "id": 1406532}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308189148.3957281, "message": "Ok, TS3 - not so much abandonment but thrown away.  Woody's perfectly fine with being in the attic, saying that maybe one day, Andy will have kids of his own.  They think they're \"job\" is to always be there for Andy.  Lotso, on the other hand, believes he was thrown away.  Then the toys here Andy being given a deadline of Friday to make a decision, to which he says nobody will want the toys because they're junk.  That's how they're separated, so yeah, I can see Woody being steadfast at that point - which leads to the bittersweet ending because while they're saved (not thrown out) in the end, they have to let go of Andy (or at least Woody does) as much as Andy needs to let go of them.", "group_id": 2515, "id": 1406609}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308191903.552927, "message": "When in doubt, go read Jim's website.  Twice (lol).  I'm glad I wasn't the only one who didn't see two stories here, but going to re-read his original review of the TS3, I see he's updated it and I can see where some of my confusion was stemming from.", "group_id": 2515, "id": 1406793}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308197288.6363339, "message": "Yes good idea! Lotso is the Antagonist, Buzz/other toys are the collective IC. Woody changes (taking buzz's hand in the death machine) while the toys remain steadfast. In the larger trilogy story - encompassing all 3 films, Woody is the Steadfast character as you describe with Andy being Change.", "group_id": 2515, "id": 1407180}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308197410.0142391, "message": "I had huge issues with it until Chris enlightened me on looking at all 3 films as working towards the Woody/Andy story. I was seeing stuff that didn't gel with the Woody/Buzz story. Now it seems super obvious, but last year I was a bit perplexed.", "group_id": 2515, "id": 1407198}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308197534.3968639, "message": "@SandyStone yes to the example from In The Line of Fire. The biggest example in recent years would be The Dark Knight. Joker works as Antagonist/IC for the caped one.", "group_id": 2515, "id": 1407215}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308199641.604007, "message": "Also, in Die Hard the IC is the cop, MC Steadfast, IC Change -- he is finally able to shoot his gun (complete with the Aliens soundtrack playing in the background!)", "group_id": 2515, "id": 1407413}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308226072.0956249, "message": "I guess where I saw Lotso as being somewhat of an IC is where in my own experiences, I've learned from others simply by watching them fail miserably in their approach to whatever problem they are (or aren't) dealing with.  When Woody has his epiphany near the end, it's right after the dialogue between Andy and his mother, where Andy states she'll always be with him.", "group_id": 2515, "id": 1409282}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308226405.9486511, "message": "I looked at that as having realized that, as Andy stated to his mother, she'll always be with him.  This is where Lotso failed in his approach to being separated.  The difference being, while Woody was able to identify the circumstances with Lotso, it wasn't until this moment between Andy and his mom that he realized the importance for him, too.", "group_id": 2515, "id": 1409308}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308226856.669199, "message": "Meaning more or less both characters were dealing with different personal perceptions of not being with their \"owners\" anymore.  Anyway, that's how I came to this originally.  Lotso even sort of fits the literal definition of IC (friend or foe?) in some ways and I saw his approach to \"abandonment\" by his owner, even though we learn it was misconstrued, was an alternate approach to Woody's \"Let's prepare ourself for the attic and hope Andy has kids some day, because we need to always be there for him\".  Lotso's was, welcome to Sunnyside - you won't have to worry about ever being abandoned again, because no one will ever own you here; when the kids grow up, new ones come in and take their place - both two different moral views and ways of dealing with attachment disorders.", "group_id": 2515, "id": 1409352}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308226231.0018561, "message": "Within the context of just TS3, that wasn't enough to warrant Woody's change - so that's where I'm kind of hung up a little, because Woody goes from steadfast all the way through in terms of being there for Andy, then he changes and puts himself in the box with the other toys for donation.", "group_id": 2515, "id": 1409292}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308228756.2327459, "message": "This is where Woody finally understands that truly caring/loving someone means letting them go/grow, whereas Lotso chose to believe he was never loved to begin with and that's why he was \"thrown out\".  As much as I think Woody understood and could see what Lotso was doing wrong, he wasn't able to out that final piece together until something much bigger than himself, Andy's own mother, had to do the very same thing.  We all do - it's part of life.", "group_id": 2515, "id": 1409547}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308231594.7118499, "message": "Ok, but a Change Main Character adopts the perspective of the Impact Character. Woody doesn't accept Lotso's way of seeing things. He does, however, accept Buzz's and the toy's approach.", "group_id": 2515, "id": 1410096}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308232986.523814, "message": "Right, I understand what you're saying, but I've seen a number of times here the advice given not to accept definitions literally.  So, in that regard, one doesn't have to accept another's way of seeings things for them to have an impact or foster change.  That's why I used my own personal experience - watching my boss handle his other employees wrong had an impact on me to take a much different approach than he, not the same one.  I didn't accept his approach at all and more importantly, it wasn't even something he did directly to me.", "group_id": 2515, "id": 1410277}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308236199.541908, "message": "This is where Woody views the conversation between Andy and his mother and has his epiphany and Woody \"influences\", for the lack of a better word, Andy's ultimate decision by posting Bonnie's address on the box.  So from this, I'm not sure how the toys remained steadfast as the ending is more or less a compromise of letting go, but doing so in a way that also means moving on (continuing to be played by Bonnie, who's \"mentored\" by Andy on how to play with the toys respectfully).  This is what makes it bittersweet because they ultimately get to be played with and have fun, but have to let go of Andy as much as he has to let go of them in the process.", "group_id": 2515, "id": 1410907}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308235260.521199, "message": "I can definitely see what you're saying with regards to Buzz and the other toys as I go through the script here, but I still don't think it's a viewpoint of being there for Andy vs. being played with for other kids because we see that, although this is the other toys desire, it backfires: they all complain afterward, Rex noting \"Andy never played with us like that!\".  Mrs. Potato head sees with her other eye that Andy and his mother are distraught, that they in fact were wanted and meant to be in the attic - to which they all agree the need to get back to Andy.  This is where Lotso uses Buzz as a Contagonist, I would say, by re-setting his defaults.", "group_id": 2515, "id": 1410712}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308235772.6440859, "message": "In the face of meltdown and having survived, the toys reconsider: Andy's attic isn't so bad after all.  But Woody and the rest of the toys change their perspectives: Woody says, maybe Andy's attic isn't the answer, while the rest of the toys beg to differ now.   Jessie says \"We're Andy's toys, Woody...\", Buzz saying \"We'll be there for him, together\".  At this point, the toys are heading for the attic, except Woody who is heading to College with Andy.", "group_id": 2515, "id": 1410798}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308240019.241554, "message": "How would you label the relationship between woody and Losto? How does this differ from their relationship in the OS?", "group_id": 2515, "id": 1411502}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308242320.1041889, "message": "Well, first, one would have to define the OS.  In my head, I see it as Andy's heading off to college and his mother is cleaning up, demanding he make a decision with his stuff by Friday.  As it pertains to the toys, the question becomes, will they go up in the attic and continue their long \"rain delay\"; will Andy decide to take them with him; will he trash them; or donate them?", "group_id": 2515, "id": 1411736}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308242729.6168001, "message": "The relationship between Lotso and Woody is different in the sense that Lotso represents a toy who comes to believe he's been tossed to the curb and never loved.  Everything that he does is reflected by his worldview of fear, abandonment, etc.  His view is here, you'll never have to worry about being hurt again - because he's been hurt.  Woody, however, points out the truth to what happened, that he was lost by accident - something the rest of the toys are dealing with now.", "group_id": 2515, "id": 1411781}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308243394.7813721, "message": "It fits well if you see the two different complete stories -- the Woody/Andy one and the Woody/Buzz and Co. one. Woody, like all Main Characters has an approach to solving problems. If you want to say Lotso is the Impact Character then he has a different approach to solving problems. But then what problematic relationship do they have between each other? Their point-of-views are taken care of in their individual throughlines. The relationship is a different perspective.", "group_id": 2515, "id": 1411865}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308242296.1828029, "message": "Also, in regards to taking definitions literally, what they mean is that there are some Dramatica terms that actually mean something different from the norm. Morality isn't a religious thing (as it most often is looked at), but rather it is about putting others first.", "group_id": 2515, "id": 1411728}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308242902.890723, "message": "So Lotso and his band of toys sort of represent what happens when you're unable to let go. They don't need anybody, or so they feel.  Their opinions collide because of their views, which when happens, impacts the other toys of Andy.  That's about when Mrs. Piggy views what really happened, too, with her other eye.", "group_id": 2515, "id": 1411794}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308242355.0253429, "message": "The whole point of the storyform is to show the appropriateness of a particular approach to solving problems. If the MC doesn't adopt the IC's approach then what is the story saying?", "group_id": 2515, "id": 1411743}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308243219.8766999, "message": "Ultimately, I don't think it's a story that fits into the Dramatica form very well which explains the problems within the structure.   How is it you view the other toys as being steadfast (to what end are they steadfast?).", "group_id": 2515, "id": 1411825}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308242548.633038, "message": "What throws everything into action is the mother putting them to the curb by accident.  From there, they explore each of these option, coming to the conclusion the one they already know, not being played with, is akin to staying in the attic... but at least they're safe there.", "group_id": 2515, "id": 1411767}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244482.6211669, "message": "Having not seen it in forever those sound like MC moments to me.", "group_id": 2515, "id": 1412100}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244011.534847, "message": "The Relationship Throughline is about a relationship - father/daughter, husband/wife, mentor/mentee, brothers, and so on.", "group_id": 2515, "id": 1412030}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308243417.5899279, "message": "The only relationship I see is adversarial - which is more descriptive of the OS.", "group_id": 2515, "id": 1411872}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308245780.531924, "message": "I can look at it from that perspective and the desire for Buzz and co. to stay together as satisfying the OS.  It's brought up numerous times about staying together and the scene you mentioned where Buzz grabs his hand would make more sense from that perspective.", "group_id": 2515, "id": 1412203}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308243597.069906, "message": "Let me back out of TS3 and bring up a movie I mentioned earlier that I've seen probably 50 times (Tootsie).  My guess is Dramatica would say Jessica Lange's character is the IC to Michael Dorsey because he \"adopts\" her views (I can't say Dorothy, because Dorothy is Michael).  But that would totally negate the fact that much of what transforms Michael comes from Michael impacting with other men and seeing how they treat him as a women.  He doesn't adopt their traits by any means and therefore, the impact is driven more from Ron's treatment of Julie, not Julie herself.  Sorry to shift gears, but it's sort of the same argument.", "group_id": 2515, "id": 1411913}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308244036.531698, "message": "Yeah, I read through that analysis of Tootsie earlier today.  It's in depth and uses direct quotes from the movie, which is great, but I didn't see anything specifically calling out who the IC was.", "group_id": 2515, "id": 1412037}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308244260.464335, "message": "Yeah, I got that... I guess what I'm trying to say is somehow, Woody changes his mind and the other toys do as well - they actually reverse their stances.  But the toys don't make the decision to go to Bonnie's... Woody makes it for them.  So if we look at it as two different stories, how is that not considered a change for Woody as well?  We know Andy changes because he ultimately lets Woody go.  But it's Woody that actually influences him with the note (because Andy asks his mom if that's what she thinks he really should do).  He just doesn't know Woody's in the box.  I understand looking it at in context of all three movies, but at the same time, we sort of had to look at Star Wars IV as a stand-alone.", "group_id": 2515, "id": 1412071}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308244596.8514371, "message": "back to TS3, you don't view Woody making a change after that epiphany as it relates to both the OS and the SS, being agreeable here that it's with the other toys?", "group_id": 2515, "id": 1412113}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308243789.752702, "message": "Yeah, I haven't seen Tootsie in a million years so I can't really comment with much accuracy. I would suggest reading through the entire storyform online (currently http://www.dramatica.com/story/analyses/analyses/tootsie.html) and see if it makes sense.", "group_id": 2515, "id": 1411971}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244261.114234, "message": "It's pretty clear that Julie Nicols is the IC - if you scroll down to the bottom where it says Julie Nichol's Throughline, that's the description of her as the Impact Character. The Subjective Story section just above it describes their relationship with each other.", "group_id": 2515, "id": 1412072}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244352.9921081, "message": "We looked at Star Wars IV as a stand-alone because it wasn't trying to incorporate the other films within the telling.", "group_id": 2515, "id": 1412086}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308243916.451086, "message": "What problematic relationship do they have between each other... Lotso won't let them go, believing what he's doing is \"right\" for the toys.  He's controlling, manipulative, and believes they shouldn't be owned by anyone which conflicts with Woody's being adamant that they belong to Andy and need to get back.   Lotso sees pain and suffering from being owned since he's been hurt, whereas Woody sees comfort, love and Duty with Andy.", "group_id": 2515, "id": 1412000}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308243970.8969481, "message": "I realize those are different viewpoints, but that's essentially what's being battled-over once Andy's army of toys realize they want out.", "group_id": 2515, "id": 1412010}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308244454.500711, "message": "But even as such with Julie, it sort of defeats the purpose of Michael having had interactions with his boss, Dr. Brewster and all these other characters who ultimately showed him how chauvinistic men are - that's not something Julie could do.  Does that make sense?  That's what's sort of leaving me scratching my head because he learns without taking on those traits, rather, by shedding them when in the presence of Julie... just as a women.", "group_id": 2515, "id": 1412099}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244651.2898231, "message": "I'm not sure what you're asking.", "group_id": 2515, "id": 1412117}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308244763.210902, "message": "Woody's decision to box himself up with the other toys and labeling to send to Bonnie:  doesn't this exemplify a change on his part, one which satisfies the relationship with the other toys being being the IC, but also resolving the relationship with Andy?", "group_id": 2515, "id": 1412124}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308244913.64182, "message": "Woody changes in the Woody/Buzz and Co. story. Andy changes in the Andy/Woody story.", "group_id": 2515, "id": 1412136}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308246011.8159461, "message": "Also, in the scene where Andy gives Bonnie Woody, he says the thing that makes him special is the fact that he will never give up on you, no matter what.  I think that was important for Woody to hear.", "group_id": 2515, "id": 1412226}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308245184.3489079, "message": "Then what part of the story does his labeling the box of toys to Bonnie satisfy/fulfill?  See, I keep looking at this as the need for Woody to let go, too, though I suppose if Andy were to have told Bonnie, no, can't have him, I'm taking him with me - it would have ultimately been his decision (though not a good ending).   But Woody doing this is well after the Buzz and Co. storyline has ended.  For all they know, they're heading up to the attic.", "group_id": 2515, "id": 1412169}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308245525.0539939, "message": "It doesn't feel like it's merely closure to the OS because it directly impacts both of those other story lines (between Andy and Buzz and Co.).", "group_id": 2515, "id": 1412186}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308245616.935426, "message": "I think the Woody/Buzz and Co. relationship mends when Andy pulls Woody out of the box. That's when everyone starts to cry. Then, when Andy says you can have him, the Andy/Woody relationship has come to a close and that's when the crying *really* starts!", "group_id": 2515, "id": 1412191}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308246888.3210471, "message": "Here's a question that sort of brought all this up:  can a MC and an IC who is the antagonist BOTH change?  I've just written a first draft of a farce and that's pretty much how it turned out.  The MC has to adopt other personalities because of circumstance, but sees with interacting directly with the Antagonist that his approach is wrong (the two are actually doing the sharing the same approach, they're just not aware of it).  So, the MC \"changes\", because of this - recognizing he's avoiding issues just as the Antagonist is, his new goal is to then redemption and to change how the Antagonist perceives himself.  Doing this has the other players change as well, because they've forced the MC into these other various roles for their own benefit.  (basically, everybody is using everyone else).", "group_id": 2515, "id": 1412295}, {"user_id": 10814, "stars": [], "topic_id": 39506, "date_created": 1308246360.9922409, "message": "The reason there do not seem to be lots of MC/Antagonist combinations is because we generally associate the antagonist as \"the villain\".  One might think that Shakespeare's villains are MC/Antagonists because they are the \"bad guys\" and MC's.  However, the reason they are in TRAGEDIES is because they FAIL to achieve their goal as protagonist.  For example, Macbeth wants to take over the line of succession.  He fails.   Richard III wants the same thing and fails.  They fail because they are the protagonists, as opposed to Succeeding as antagonists.", "group_id": 2515, "id": 1412255}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308247231.484041, "message": "I know that conflicts with the theories here, but I can't think of any stories out there where something like this would occur.  The MC is wrong in their approach, realizes it, changes course and tries to save Antagonist who unknowingly impacted them (because he was in disguise) because he realizes they both have the same problem.  But he knows he can't change the antagonist, he can only influence his thinking and get him to change himself - which he ultimately does by coming to terms with who he is.  Possible, or am I totally playing with fire here with trying to go back and analyze it through Dramatica?", "group_id": 2515, "id": 1412324}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308248143.8789251, "message": "I would say, in regards to your story,the confusing nature of your explanation of it might indicate that the audience will have a difficult time trying to comprehend the meaning of what you are trying to say. I had to read your last explanation several times before I had an idea of what you were saying.", "group_id": 2515, "id": 1412432}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308247123.546469, "message": "@JBarker, re-reading I just noticed your question about Se7en. Somerset (Morgan) is the MC, John Doe (Spacey) is the Antagonist, Mills (Brad Pitt) is the IC. Somerset adopts Mill's perspective when he reacts impulsively and slaps John Doe to shut him up (Change). Brad takes vengeance, John wins (Failure in the OS). Somerset stays on even though he doesn't think the world is a fine place (Bad Judgment).", "group_id": 2515, "id": 1412313}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308247610.9568939, "message": "Right, when I wrote that last night I was thinking it terms of Mills being the MC, but he's not.  If anything, the events pretty much confirm Somerset's worldview, if I recall correctly, as he questions why Mills would ever want to take a job there to begin with.  Does Somerset actually stay on or retire, since that was his desire.", "group_id": 2515, "id": 1412368}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308248159.5464489, "message": "Of course, you're always free to write whatever you want!", "group_id": 2515, "id": 1412436}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308249816.7498751, "message": "I'm just not going to find any examples here, lol.  I'll have to brainstorm and see if I can come up with something where the antagonist becomes a positive force/character whatever and work my way backwards to see if they're actually a MC or if they've changed because of someone else.  I know there's stories like that, at least... just got to sniff them out.", "group_id": 2515, "id": 1412628}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308251407.3310499, "message": "@jimhull Oh no, it's pretty blatantly clear what the meaning is once the MC becomes aware of what the antagonist's problem is because he has a self-revelation as a result.  It's hammered home after that (the message being you need to accept yourself and love yourself for who you are rather than try to be someone else).  The MC is forced to be anyone other than himself because he's in hiding.  His desire is to get out of dodge.  His friends become antagonistic to this goal by using him while he's in disguise for their own purposes.  He learns, in disguise while with the Antagonist, that the Antagonist is there because he's running from who he is: a failed former 1st round draft pick seeking anonymity in a small town.  Both their issues stem from something deeper they share together, the perception of failure in their father's eyes.  Once the MC realizes problems aren't resolved by merely running away, exemplified by the Antagonist and his continued issues, he realizes he needs to change approach and come clean with who he really is - which in turn influences the Antagonist to do the same.  Once the audience knows what the Antagonist's problem is, we want to see him overcome it as well - but the only way to do that is for the MC to change and accept who he is first.", "group_id": 2515, "id": 1412829}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308257051.196305, "message": "The second story, with Antagonist as MC would have the original MC as the IC, but if it is only at the very end, I'm not sure how the Antagonist would grow to where their change would seem emotionally right, i.e. the change sounds like it comes out of nowhere. You need to have that time for the emotional growth to make \"sense\", and that would only come from an Impact Character's influence felt throughout the four acts.", "group_id": 2515, "id": 1413674}, {"user_id": 7645, "stars": [], "topic_id": 39506, "date_created": 1308257042.8459461, "message": "That sounds like you have two stories going on at once, one of them incomplete. The first story, the one where the MC has to change and accept who he is, does not have an Impact Character in it. Your description of the Antagonist's influence on him sounds more like a negative reflection character that I have heard Chris mention from time to time, but really isn't a part of the theory. Stories that use this device have the MC see a reflection of who they'll be, and that influences their Main Character Throughline. It's not an Impact Character as Dramatica defines it, it's something completely different and non-essential towards telling a Grand Argument Story (Dramatica-type story).", "group_id": 2515, "id": 1413672}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308259856.373229, "message": "Yes, it occurs near the end - but it's set up earlier via their dialogue.  Essentially, the Antagonist not only represses who he is, he projects his hatred of self onto others - including the MC, to the MC, who's in disguise.  The MC still isn't fully aware of the real issue until later, when the thoughts projected onto himself become very clear when another character has to reveal who they really are and why they're there.  Yeah, it sounds confusing, but it's a farce where there's lots of mistaken identities and multiple disguises.", "group_id": 2515, "id": 1413918}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308260307.566648, "message": "The negative reflection does sound like it's pretty much what's happening as the MC essentially sees the Antagonist as being wealthy and famous (albeit a bust), but running from his problems with follow, hence the need for the MC to change course. I *think* I have the emotional growth somewhat through the four acts because they're both have used the same girl for different reasons, but are both \"suspects\" in her disappearance.  When the MC comes clean with having used other people and having had to \"walk in their shoes\" over the course of the story in return, the Antagonist realizes he's used her as well.", "group_id": 2515, "id": 1413947}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308260440.131547, "message": "There's an entire scene, much like in Little Miss Sunshine, where all the main players are forced to confront the same problem, done in such away there's obviously self-awareness, but it doesn't quite get everybody over the hump.  It's a liberating scene in a sense, but the characters still need to account for the troubles they've caused each other.", "group_id": 2515, "id": 1413961}, {"user_id": 33839, "stars": [], "topic_id": 39506, "date_created": 1308261660.3750479, "message": "And yes, two separate stories - I didn't even think of that when writing it (it came out fast over about a three week period), but the Antagonist as MC thread has its own inciting incident caused by the IC - his actions upset the apple cart and put focus on the Antagonist for the disappearance, something he can't afford due to his past.  Both the IC and Antagonist are innocent of the girl's disappearance (which factors into the other story thread as well, implicating the IC as MC there), but because of the unequity his actions caused threaten and ultimately cause him to realize the Antagonist's false facade, he feels the need to make things right by getting the Antagonist to ditch the facade (his using the girl being part of that support for the facade.)", "group_id": 2515, "id": 1414111}]