[{"user_id": 13949, "stars": [], "topic_id": 42610, "date_created": 1311576231.9684529, "message": "If you want to discuss something in more detail, please start a new topic. This should be a high level view of pitching ideas.", "group_id": 11134, "id": 1714021}, {"user_id": 13949, "stars": [], "topic_id": 42610, "date_created": 1311576058.7323921, "message": "Some possible solutions included mentoring, building more exposure into school programs, poaching, workshops, etc. One problem that was mentioned was \"newsrooms still dont value prgrmming enough\". Please reiterate your thoughts from last night and continue the conversation.", "group_id": 11134, "id": 1714005}, {"user_id": 38663, "stars": [], "topic_id": 42610, "date_created": 1311636576.26811, "message": "Another good opening: college media. Used to be a good bit of work going on there, tho I haven't been following lately.", "group_id": 11134, "id": 1719280}, {"user_id": 38659, "stars": [], "topic_id": 42610, "date_created": 1311642750.3933239, "message": "We should work on compiling resources, like a syllabus or cookbook, for learning various skills. It doesn't solve the problem of inspiring people to learn, but it will make it that much easier for those who do. Also, people can't say, \"Oh, I don't know where to start...\" if we give them nice starting point.", "group_id": 11134, "id": 1719811}, {"user_id": 38662, "stars": [], "topic_id": 42610, "date_created": 1311676230.8234639, "message": "I feel like Medill has a good recipe going but not turning out grads fast enough. Also, we do a poor job of transferring the understanding and importance of the 'love of the work' when it comes to working in news. How can we make this work more attractive?", "group_id": 11134, "id": 1722130}, {"user_id": 38663, "stars": [], "topic_id": 42610, "date_created": 1311678821.022568, "message": "News orgs should offer internships for these kinds of positions.", "group_id": 11134, "id": 1722260}, {"user_id": 38659, "stars": [], "topic_id": 42610, "date_created": 1311709119.505933, "message": "How do we change the assumption to \"everyone (not just journalists) should learn at least some coding?\"", "group_id": 11134, "id": 1725717}, {"user_id": 38649, "stars": [], "topic_id": 42610, "date_created": 1311708637.174515, "message": "More news orgs should be explaining how this work is done -- what makes the \"magic\" (ugh, hate that term) work.  Demystify it -- it IS something you can do!", "group_id": 11134, "id": 1725666}, {"user_id": 38649, "stars": [], "topic_id": 42610, "date_created": 1311708778.233927, "message": "More jprofs/staff in schools who actually can answer the coding questions once a student starts self-teaching.  All too rare to find an in-person resource to help people get started.  Can be much more helpful and inspiring than looking things up online.", "group_id": 11134, "id": 1725684}, {"user_id": 38649, "stars": [], "topic_id": 42610, "date_created": 1311708708.68274, "message": "Chicago Trib (http://blog.apps.chicagotribune.com/) and ProPublica (http://www.propublica.org/nerds) are doing a great job with this, but I wish there were more.", "group_id": 11134, "id": 1725675}, {"user_id": 38649, "stars": [], "topic_id": 42610, "date_created": 1311708984.9190271, "message": "More entry points in news orgs for those beginning this type of work.  Yes, there are a lot of openings right now.  But as someone fairly new, how do I get from \"aspiring coder\" or \"learning Django\" to \"Yes, I can be your solo/one of two/three programmers\"?  Where's the middle step?  Or...how do I find the job where I can use most of my code to tell stories as opposed to Web/system administration? How do I find the job where I don't switch from being a journalist to a Web developer because I'm inspired by these projects, but I use Web development to practice journalism and can get continued mentoring on journalism and programming sides so I can keep getting smarter?  IMO, we don't have enough of those.", "group_id": 11134, "id": 1725698}, {"user_id": 38663, "stars": [], "topic_id": 42610, "date_created": 1311719483.9327581, "message": "Get Hacks/Hackers involved with mentoring programs, education. Get H/H onto campuses.", "group_id": 11134, "id": 1726844}, {"user_id": 38663, "stars": [], "topic_id": 42610, "date_created": 1312819284.0694981, "message": "Emptied my head into a little blog post, hope we can get this convo going again. http://www.megantaylor.org/2011/08/08/the-news-dev-pipeline-problem-2/", "group_id": 11134, "id": 1822218}, {"user_id": 38659, "stars": [], "topic_id": 42610, "date_created": 1312819846.4339371, "message": "+1 to restarting the conversation", "group_id": 11134, "id": 1822280}, {"user_id": 38663, "stars": [], "topic_id": 42610, "date_created": 1313435449.4525111, "message": "The AP-Google Journalism and Technology Scholarship: http://ap-google.onlinenewsassociation.org", "group_id": 11134, "id": 1877812}, {"user_id": 13949, "stars": [], "topic_id": 42610, "date_created": 1315359541.325891, "message": "@greglinch +1 for restarting the conversation.", "group_id": 11134, "id": 2064030}, {"user_id": 13949, "stars": [], "topic_id": 42610, "date_created": 1315359721.3257101, "message": "Maybe we should try to identify the major topic areas of development, then break those in conversations? i.e... maybe the following should be conversations... formal educational opportunities (university, day courses, conference courses, etc.), fo' reelz (on the job training, internship)?? Any thing else?", "group_id": 11134, "id": 2064054}]