[{"user_id": 33839, "stars": [], "topic_id": 43446, "date_created": 1312767237.9396119, "message": "You gave a good example, I'm just trying to run it through my head as it would relate to my story... but your comments here also bring up a good point.  \n\nIn my case, the IC doesn't know what her actual problem is as its occurring, but figures it out right before her death.  The storyform problem is, I think, Actuality: she can't explain (at first) what she's seen, but everybody thinks she's crazy.  When she writes in her diary, right before her death, that the \"apparition\" is suddenly clear - it looks like her but isn't, she's still not 100%, but questions whether she's being haunted by the vision of her daughter's death in the future, rather than something from the past.  \n\nAnd, as it turns out... she's 100% right.  The ghost she kept seeing hanging via suicide, which caused everybody to think she was crazy, ends up being the climax in the present storyline with her daughter who's suffered from post-partum psychosis who was seeing \"ghosts\" of her own - delusions - having suffered from the loss of her child at birth.  \n\nAs a result, everybody's perception changes of the past even because of the present.  She's no longer \"crazy\" (though, really, she was thought to have been suffering from PPS herself, but wasn't).", "group_id": 2515, "id": 1817602}, {"user_id": 7664, "stars": [], "topic_id": 43446, "date_created": 1312766479.993458, "message": "@JBarker's thread got me to thinking -- how aware are people of the Problem, ever?\n\nIn a recent storyform, non-accurate was the Symptom, accurate was the Response. Process was the solution.\n\nCan the character ever get to the Solution (as a desperate attempt to solve the Symptom, or something) without hitting on the Problem of Result?", "group_id": 2515, "id": 1817522}, {"user_id": 7664, "stars": [], "topic_id": 43446, "date_created": 1312769866.754324, "message": "Jim has said something similar: that a character only perceives their problem just as they solve it (or just before). \n\nBut in both those cases, the character does actually see the problem.", "group_id": 2515, "id": 1817795}, {"user_id": 7645, "stars": [], "topic_id": 43446, "date_created": 1312775691.022922, "message": "Well that would be up to Chris to more accurately explain. I think the idea is that if they were aware of the problem then they would solve it -- thus no need for a story. I think they can only see a problem for what it is at the end. Until then, they're just focused on the symptom.", "group_id": 2515, "id": 1818410}, {"user_id": 7664, "stars": [], "topic_id": 43446, "date_created": 1312817414.8501229, "message": "I suppose another angle on the  question could be: how aware are people that their Reaction to the Symptom *isn't* solving anything? (Or, solving enough.)\n\nBecause then they're on the lookout for a better solution, even if they don't know exactly what they are solving.", "group_id": 2515, "id": 1821970}, {"user_id": 10814, "stars": [{"date_created": 1312917315.39608, "user_id": 36437}, {"date_created": 1312918455.259887, "user_id": 7664}, {"date_created": 1313165778.6370671, "user_id": 35141}, {"date_created": 1313714964.3461139, "user_id": 13109}], "topic_id": 43446, "date_created": 1312916357.2845399, "message": "Sometimes responding to a symptom is enough to resolve the inequity.  That is the heart of what every steadfast character thinks, which is sometimes proven correct.  A person with a deep-seated problem cannot see their own problem or recognize its solution because the problem is hidden behind the justifications he has built (backstory) to 'blind' them from it.  It takes the tearing down of those justifications, act by act in response to the pressures from the Impact Character, to bring the character to the point where he can see BOTH the symptom and the problem.  At that point the MC can choose to continue applying effort to respond to the symptom (steadfast), or adopt the newly available path of addressing the problem by adopting the solution (change).", "group_id": 2515, "id": 1833731}]