[{"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308570113.5720401, "message": "So I went to that healing conference. I was not too happy with what I heard or what I saw. If you want my notes just let me know and I can mail them to you. I left there with questions though. I heard a lot of \"small\" ailments being healed but not the wheel chair bound lady. One Cerebral palsy lady claimed she could move her hand more, that in fact it was 70% better.\n\nQuestions:\n1. Does God not heal 100%? I was pointed to Mark 8:24 to show that He does not always.\n2. Why does it seem that all \"smaller\" healing happen at these things but the lady in the wheel chair stays in the chair? I wonder sometimes how that person must feel. Everyone is healed and God side stepped her.\n3. Does the healing that happens depends on the faithfulness of the receiver?", "group_id": 9787, "id": 1437769}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308577560.3662331, "message": "I guess by extension the Luke 23:40-43 is similar", "group_id": 9787, "id": 1438445}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308574736.883122, "message": "Technically, God doesn't heal 100% here and now because everyone dies. The cure for death is something that happens after death I guess. That implies all healing is partial in this life. Unless that lady was healed of her CP, then what happened was an easing of her pain perhaps? I am not going to say God can't or won't... or even that I have to see a reason for what he does. I am a sceptic though, and things like that always get my cynicism furnace burning hotter. I equate that kind of thing to the \"power balance\" video's (if you don't know of them, go and watch them. \n\nAs for the Mark 8:24 text, that is once again taken out of the larger text to add weight to an argument,  if you read the preceding and following verses you find an interesting thing. Jesus is speaking about the blindness of his disciples, bringing to mind their failure to see and understand. Jesus spits on the mans eyes, lays hands on him and asks him about his sight, it is imperfect, then Jesus places his hands on him again and there is healing. Jesus did heal the man properly in this text, he just did it in a different manner, and it is congruent with the apparent lesson of the earlier text, it's not about Jesus having to practice healing to get better at it, and it's not about Jesus being a demonstration of a try try again mentality. It's not even principally about the physical healing I don't think.\n\nAs for the lady that wasn't healed while around her more \"minor\" healings were taking place, if I am totally honest, my initial reaction is that it's charlatanism going on. But I must concede that God has his reasons, and it could be that he has a greater purpose for her in the wheelchair? Perhaps the people doing the healings feared their own lack of faith? I don't know.\n\nThere are a few texts that indicate that the faith of the healed is responsible for the healing etc. Mark 10, luke 7 and luke 18 luke 17 (mark and luke accounts the same event)", "group_id": 9787, "id": 1438181}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308577312.047214, "message": "@LintonCaldecott Thanks. Gonna have a look at some of those.", "group_id": 9787, "id": 1438423}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308585545.3371191, "message": "@LintonCaldecott almost hit on an important point. God is most interested in the state of our immortal soul. Not so much with the physical well-being of our earthly bodies. Sure Jesus did heal, but he got pretty fed up with people seeking the showy miracles all the time without grasping the significance of the deeper healing - that of the soul. For this Mark 8 is actually very instructive.", "group_id": 9787, "id": 1439730}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308591512.434598, "message": "@pevans_om @LintonCaldecott I get what you guys are saying. I am just wondering more on what happened at this conference and the thoughts/answers given to me when I asked about it.\n\nAre these valid? Does God want/need full faith to heal someone? Is that why it never happened? Why did God almost heal everyone with small ailments and the lager ones were either a \"half job\" or completely ignored?\n\nI know I can only really get guess answers here. Since none of us can really know what happened there or what God did or did not choose to do. I just wonder if there is a biblical president that I can measure with. Is it fair for me to say I don't think it was God if it does not measure up to <whatever>? Or do I just need to shrug my shoulders and say \"I suppose God could have worked like that?\"\n\nMy main gripe is... It seems weak!?! Where is the God of power. Creator of Heaven and Earth. The God of miracles. The people at the conference go crazy and praise and shout and I'm left wondering if that was really Him working so \"mysteriously\"?\n\nNot sure if I am articulating my confusion well :-/ I know God is working miracles. And we can read these things from many sources and hear testimonies from all over. So that's not my issue. I want to know if we can separate the cruft from the real deal.", "group_id": 9787, "id": 1440537}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308591602.0560429, "message": "Yah, I almost hit that point, I meant to expand and then I got frothy in the mouth about something else. heh.", "group_id": 9787, "id": 1440546}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308591736.35357, "message": "Lots of what God does i think he have to shrug our shoulders about. My understanding from scripture (which is a little dodgy because it was written with hindsight) is that many of the miracles performed had a pretty specific purpose and the teaching always came sooner or later. The point with Jesus has always been that the miracles are not the point. If the point at any conference service whatever is the amazing magic, i'd say that's \"cruft\". But always factor in that we might not see the big picture.", "group_id": 9787, "id": 1440561}, {"user_id": 32900, "stars": [{"date_created": 1308644854.857806, "user_id": 13817}], "topic_id": 39857, "date_created": 1308594513.1450379, "message": "I understand the frustration. I mean....where is the God who healed everyone on whom Peter's shadow fell? Or who touched a piece of Peter's clothes? \nI get pretty cynical about the minor healings too. It's pretty hard to know whether a person with a sore back is actually relieved of pain or whether peer pressure causes them to declare it. A woman in a wheelchair can't pretend. There's also a lot to be said about the effects of positive psychological reinforcement on sick people - this can lead them to believe they feel better.\nIt's easy to see why some believers have decided that this sort of healing ministry was for the time of the apostles. I almost agree - differing only in that I think God has raised up this ministry at other times too. Specific times to fulfil His specific purpose.\n\nWe all seem to agree, it's not about the physical healing, it's about spiritual healing. So look for the signs and wonders, but don't be too disappointed when they seem not to manifest. Ultimately God works for HIS Glory, not ours.", "group_id": 9787, "id": 1441026}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308650060.6221111, "message": "Oh, I forgot about Jesus being near his home town, he didn't perform any miracles there either, because of the PEOPLES lack of faith.", "group_id": 9787, "id": 1446945}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308651796.2839251, "message": "@LintonCaldecott O yes. Interesting. The more I think of faith the less I know what it is? I mean, what is faith that I can get more of it?", "group_id": 9787, "id": 1447032}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308651858.851512, "message": "I suppose that could go in the Faith topic.", "group_id": 9787, "id": 1447037}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308660855.0008309, "message": "Faith - how I see it - is trusting God's words are more true than any other thing - things seen or felt or thought...", "group_id": 9787, "id": 1447835}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308660981.698312, "message": "@andreatrue shoot!", "group_id": 9787, "id": 1447856}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308661971.6341341, "message": "to continue the idea, it's not even as if the disciples had amazing faith anyway. they certainly only really understood after the resurrection...", "group_id": 9787, "id": 1448087}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308660944.1804919, "message": "@andreatrue move to https://convore.com/christian-thinking/faith/ Let's continue there. And it's great to see you here :)", "group_id": 9787, "id": 1447851}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308661630.283226, "message": "so, who is supposed to steward the smaller miracles for the big stuff to come about... Also as a repetition of something that i've said a few times if we seek to steward smaller miracles for the sake of the bigger, then our focus is out of joint and that seems to be very specifically what Jesus was against, i.e. focus on the physically miraculous and miss the spiritual healing stuff.", "group_id": 9787, "id": 1447999}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308660961.31305, "message": "I was thinking about healings etc. and I had a few thoughts - we can melt them down and get the gold out - those who seek the Truth find it :)", "group_id": 9787, "id": 1447852}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308660986.3728111, "message": "@andreatrue GO!", "group_id": 9787, "id": 1447857}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308661096.1585851, "message": "On healing: I was thinking: what if God will only reveal miracles in awesome power when we can and do steward 'smaller miracles' as He wants us to - those who can be trusted with little can be trusted with much...", "group_id": 9787, "id": 1447875}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308661881.7343631, "message": "I was responding to Andreatrue's comment about revealing miracles in awesome power when we steward the smaller stuff. How many people should steward the smaller stuff, for how long? What about a group setting where one person has been \"stewarding the smaller stuff\" for ages and the rest of the group not, would that in effect hamper a working of great power? I realise the gospels arent exactly blow by blow day by day accounts of what everyone did, but looking there, there are some really bizarre things. the disciples get unleashed and they do amazing things, they are not required to partially heal people for x number of years before God grants them the power to heal and cast out demons. It seems to be a pretty instant thing.", "group_id": 9787, "id": 1448059}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308661883.1203201, "message": "@andreatrue That principle is certainly true of many things, not least of faith.\n\nRecently we received a story from Mozambique where a young boy prayed for his young friend who had died. The friend was raised to life again. This isn't an example of small things first, but clearly God had His plan here and the young boy heard and obeyed (the parents of the sick child immediately put their faith in God!)", "group_id": 9787, "id": 1448060}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308661650.078428, "message": "@LintonCaldecott critical mass? I don't think it's something that can be analysed. I think God heals when and how He wants. Sometimes as a reflection of faith, sometimes for His Glory. This is why I've always felt that discernment is the more important gift. To hear from God and pray and ask according to His will. Jesus did this pretty well.", "group_id": 9787, "id": 1448006}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308662503.7413371, "message": "I agree that this should not be our focus. Our focus is to know God. My wonderings are more on the side of, is there a right and wrong? Or are we left shrugging our shoulders? Can we be deceived in thinking we are working miracles with the power of God and still not even know God?", "group_id": 9787, "id": 1448187}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308663818.887814, "message": "@penkin He tried out his faith on the lions and bears. The success of those fed his faith in God making it easier for him to trust that God would be with him when facing Goliath.\n\nA much bigger test of faith, Goliath, because the others had happened in the fields alone without witness....now he was about to make a fool of himself in front of the entire army.....needed quite big kahunas!", "group_id": 9787, "id": 1448433}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308661531.620285, "message": "What is the critical mass though? How many people need to believe? Biblically we have some apparent differences in faith healing. In one case Jesus heals a guy by getting rid of demonic possession, only his authority is required there, another time he heals someone (a few cases) where that persons faith is sufficient, Jesus even says \"Your faith has healed you\" in one case he says your faith has saved you and then finally we have a case where the faith of OTHERS led to someone's healing i.e. the guy that was let in through the roof.", "group_id": 9787, "id": 1447972}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308662244.6110239, "message": "I don't think it's a matter of training. I can't see any place (still reading the bible though) that seems to suggest this. Do your healing push-ups and one day you can heal a lame person. For now, stick to the little aches and pains.", "group_id": 9787, "id": 1448140}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308662883.9446831, "message": "@pevans_om Interesting.", "group_id": 9787, "id": 1448247}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308663172.4411221, "message": "@LintonCaldecott the false teacher. Nice guy. NICE! :P", "group_id": 9787, "id": 1448302}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308664120.8644471, "message": "God will protect me!....\nOh......how embarassing........I think his ego is now a little....deflated.......hehehe", "group_id": 9787, "id": 1448524}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308662798.4556201, "message": "@pevans_om So to my original point... would then God heal half way or is that not God?", "group_id": 9787, "id": 1448232}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308663144.201436, "message": "@pevans_om ok, that answers whether i said what i meant correctly.", "group_id": 9787, "id": 1448297}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308663374.1021831, "message": "@andreatrue I know the story, i don't understand how that relates to bethel and them not publishing or broadcasting the miracles?", "group_id": 9787, "id": 1448340}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308661932.359879, "message": "@LintonCaldecott Right....I was trying to remind everyone again of who the healer is...", "group_id": 9787, "id": 1448076}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308662562.7715559, "message": "Jesus in his story of not working any miracles in or near his home town said the people have little faith. If it's true (and it is) that the purpose of the miracles was something other than the miracles themselves then it's not that the towns put a dampener on his ability to perform miracles it's that there would be no faithful response... the miracles always have another point, here they would be without focus...", "group_id": 9787, "id": 1448195}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308662132.8405221, "message": "@pevans_om well, that's great then and totally true, God is the healer. So what would our level of faith exercises have to do with healing? In my comment i mentioned 3 different settings of healing, faith by jesus alone, faith from the healed and then faith displayed by the healed one's friends. How does that aid or hamper God if he wants to do something. It seems incongruent that we can exersize ourselves up to a level that we are suddenly able to do the big stuff.", "group_id": 9787, "id": 1448114}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308662655.3004069, "message": "It fits in with Seeking God's kingdom. When you are in tune with God, obeying Him, following His will, listening to Him then if He needs to heal someone through you for His Glory or Purpose then you will be ready and available.\n\nIn my mind this is what Jesus did", "group_id": 9787, "id": 1448206}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308662831.8389721, "message": "@LintonCaldecott I'm not sure you've got the bit about Jesus home town right\n\n\"And(J) he could do no mighty work there, except that(K) he laid his hands on a few sick people and healed them.\"\n\nSeems He did heal people.....so what is the mighty work? I would suggest that it's got something to do with people turning from their unbelief, because it ends:\n\n\"And(L) he marveled because of their unbelief.\"", "group_id": 9787, "id": 1448238}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308662886.812597, "message": "@penkin It depends on His purpose - which sounds like a huge cop-out! But it's the best I can offer", "group_id": 9787, "id": 1448248}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308662838.9748521, "message": "@pevans_om Is it a learning process or is it a matter of God wanting to do something and BAM! 100% Gods Power heals for the purposes He determines?", "group_id": 9787, "id": 1448239}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308662939.575345, "message": "Also, Chris: in a previous conversation you asked why they don't at Bethel church broadcast the miracles they've seen there (blind given sight, cancer cured, people raised from the dead(?)) - I remembered what the minister said: He said they wanted to build a 'personal testimony' - he gave the example of David and Goliath - David knew God would help him to defeat the giant as He had helped him kill the lion and the bear... at the moment he sees them killing lions and bears... the more of a testimony they have the more prepared in character and experience they will be to handle the spotlight and scrutiny of the world...", "group_id": 9787, "id": 1448257}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308663040.338321, "message": "@andreatrue I don't understand the David and Goliath analogy with personal testimony thing?", "group_id": 9787, "id": 1448275}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308662573.0750179, "message": "i don't know if i said that correctly...", "group_id": 9787, "id": 1448196}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308663438.7396109, "message": "David and Goliath is a good scripture for growth of Faith though :)", "group_id": 9787, "id": 1448357}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308662883.847466, "message": "I think it's about us hearing God and being obedient to Him... That to me is what stewardship is all about - if God says spit in his eye then spit in his eye and if God says to lay hands on his head then do that - I think it's about listening and obeying and perhaps also about how we handle ourselves when we see results and when we don't - and when He can trust us to do well in the small things, He can trust us to do well in the big things - I believe what you say that spiritual healing is more important than physical healing because the 1 is temporal the other is eternal - but I very definitely believe and have heard testimony that when God heals a body, the person now faced with the reality of the Truth can no longer claim disbelief and a choice must be made to which they often then yield their life to Him. I believe God in His mercy faces us all with that choice - to live for Him or against Him - and gives enough 'evidence' for us to believe, so I find physical healing very important and believe that this 'movement' of supernatural life and healings is something God is bringing and calling His church to.", "group_id": 9787, "id": 1448246}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308663266.177846, "message": "@andreatrue wouldn't documented verifiable evidence be a good thing to have in handling the spotlight and scrutiny of the world? Anyway, that means the spotlight is back on the miracles themselves i guess... but that seems to be the focus of that ministry, supernatural miracles... whereas that doesn't seem to be very prominent in Jesus' teaching", "group_id": 9787, "id": 1448314}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308663229.564214, "message": "1Sa 17:33  \"No,\" answered Saul. \"How could you fight him? You're just a boy, and he has been a soldier all his life!\" \n1Sa 17:34  \"Your Majesty,\" David said, \"I take care of my father's sheep. Any time a lion or a bear carries off a lamb, \n1Sa 17:35  I go after it, attack it, and rescue the lamb. And if the lion or bear turns on me, I grab it by the throat and beat it to death. \n1Sa 17:36  I have killed lions and bears, and I will do the same to this heathen Philistine, who has defied the army of the living God. \n1Sa 17:37  The LORD has saved me from lions and bears; he will save me from this Philistine.\" \"All right,\" Saul answered. \"Go, and the LORD be with you.\" \n", "group_id": 9787, "id": 1448306}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308663282.0486469, "message": "I don't have the confidence of knowing God helped me kill the lion or bear to go forward and kill the giant", "group_id": 9787, "id": 1448316}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308663388.462997, "message": "I think they do have that - you can maybe try find it on their site?", "group_id": 9787, "id": 1448347}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308663399.7867441, "message": "@andreatrue I'm not sure that that is proof text to say we can do small healing (lions and bears) and that later we will do \"bigger\" healing (giants). Seems like that is completely out of context?", "group_id": 9787, "id": 1448351}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308663478.13076, "message": "Sorry - I have to go... thanks for the chat! Hello and goodbye to all!", "group_id": 9787, "id": 1448365}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308664365.5573189, "message": "@LintonCaldecott Maybe you and me are just different", "group_id": 9787, "id": 1448580}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308663494.425602, "message": "@pevans_om Seems from what is there he had the faith :) He knew that God was with him. That He had beaten these beasts and that God would be with Him against this man.", "group_id": 9787, "id": 1448368}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308663517.729115, "message": "@andreatrue No. Stay! I command it!", "group_id": 9787, "id": 1448371}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308663896.055573, "message": "I don't see any scriptural evidence for small healings practice leading to bigger healings or small prophecies to bigger. Gifts were gifts. They didn't need growth. Faith, however, that's a different story. faith needs growth.", "group_id": 9787, "id": 1448455}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308663919.669023, "message": "I don't think David was worried about making a fool of himself. It's death here... not just the lame person being picked up out of the wheelchair to fall down.", "group_id": 9787, "id": 1448459}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308664093.1520009, "message": "@LintonCaldecott I think if David wasn't afraid of looking a fool then he wasn't human (sure possible death probably competed for access to his knocking knees...) But if I think as a human....\n\nCheck it out guys......God is awesome and will protect me! Splat!\nWhat did he say?", "group_id": 9787, "id": 1448517}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308664162.3319039, "message": "Coulda been a bit awkward explaining to his family why he ended up in hospital and they now have to leave the area out of shame...", "group_id": 9787, "id": 1448542}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308664000.6724839, "message": "And the relationship between lack of faith and healings......I dunno..... I suspect that the lack of faith didn't mean Jesus couldn't heal. I think He could heal anyone anywhere anyhow, otherwise God would be limited.... I suspect that Jesus was tired of people coming for the magic tricks and not believing in God 1 iota..... I suspect.....I can't prove...", "group_id": 9787, "id": 1448481}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308664257.099508, "message": "I think like a human too... and facing a gigantic soldier it's not looking stupid that has me worried even a little bit. It's not kickboxing either. David didn't just try to score points off of Goliath, and I am pretty sure Goliath wasn't looking to win the bout on points either. It was pretty clearly about fighting to the death. Looking foolish is a really thin motivator.", "group_id": 9787, "id": 1448561}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308670475.4035039, "message": "I was thinking about Matthew I think it is where they say we prophesied in Your name, healed... and are told I never knew you. Seems they believed they were doing these miracles and or were in fact doing them. How would that fit in with the faith? In the end they are not saved.", "group_id": 9787, "id": 1449431}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308678523.07692, "message": "I think faith has a lot more to do with God moving powerfully than we realize... not because He needs us or we are powerful but because that's the way He has chosen to make it... He is moved by faith... and He has chosen to involve us in bringing His will on earth...", "group_id": 9787, "id": 1450340}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308676346.6331649, "message": "Psa 78:40  How oft did they provoke him in the wilderness, and grieve him in the desert! \nPsa 78:41  Yea, they turned back and tempted God, and limited the Holy One of Israel. \nPsa 78:42  They remembered not his hand, nor the day when he delivered them from the enemy. \nPsa 78:43  How he had wrought his signs in Egypt, and his wonders in the field of Zoan: \nPsa 78:44  And had turned their rivers into blood; and their floods, that they could not drink.", "group_id": 9787, "id": 1450012}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308676334.044328, "message": "@pevans_om - limiting God - I don't understand it fully and I would have to study it further but I think the Bible says He could do no miracles because of their lack of faith... also I was amazed when I read this verse:", "group_id": 9787, "id": 1450011}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308679809.1942861, "message": "This brings to mind the whole Ezekiel in the valley vision... thing. God asks Ezekiel \"Son of man, can these bones live?\"", "group_id": 9787, "id": 1450509}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308679571.212863, "message": "@andreatrue Matthew says he would do no great work because of the lack of faith, mark says he could do no great work because of their lack of faith but that he simply laid his hands on some and healed them. To take this further, Jesus did pretty much everything there was to do in terms of physical magical woo stuff... He manipulated elements into other substances, he calmed the turmoil of a raging storm, he multiplied food, he healed people actively and passively (lady with the bleeding problem) he brought people back from the dead and he came back from the dead himself. He then calmly tells his disciples that they would do even greater things than these. Does that mean they would heal while juggling the multiplying fish, or could it mean that Jesus was not indicating the physical magical woo miracles? That he meant their greater things would be something else, some emphasis on something other than the 'miraculous' that we all tend to get caught up in too often? \n\nWe speak of a powerful act of God, this is what Jonathan Edwards had to say about the powerful acts of God.\n\"The power of God most gloriously appears in man's, being actually saved and redeemed in this way. In his being brought out of a state of sin and misery, into a conformity to God; and at last to the full and perfect enjoyment of God. This is a more glorious demonstration ofdivine power, than creating things out of nothing, upon two accounts. One is, the effect is greater and more excellent. To produce the new creature is a more glorious effect, than merely to produce a creature.—Making a holy creature, a creature in the spiritual image of God, in the image of the divine excellencies, and a partaker of the divine nature—is a greater effect than merely to give being. And therefore as the effect is greater, it is a more glorious manifestation of power.\"", "group_id": 9787, "id": 1450493}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308743372.0000999, "message": "There is certainly a correlation between faith and miracles. But even the tiniest bit of faith can supposedly move mountains.", "group_id": 9787, "id": 1456254}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308771218.9428051, "message": "@LintonCaldecott - I think the \"greater things than these\" could be referring to that Paul brought healing in ways Jesus did and in unusual ways like with his shadow or with handkerchiefs etc...? But whatever the 'greater things' are - it would include what Jesus did - which was heal people and raise the dead...", "group_id": 9787, "id": 1459548}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308773560.741375, "message": "@andreatrue So do you think the greater things are that we beat Jesus in healing ability? Or at least can?", "group_id": 9787, "id": 1459809}, {"user_id": 32935, "stars": [], "topic_id": 39857, "date_created": 1308772262.3188231, "message": "w.r.t. the David lions and bears thing and building up a personal testimony with God where you can look at past victories and so build your faith to push forward into things requiring greater faith - I was thinking about it after we spoke the other day - I think why he (Bill Johnson) might be referring to where they are now as 'lions and bears' (my words) is because they are not yet walking in the success-rate Jesus had - some places Jesus went - everyone was healed... They've come a long way - from no healings to some to seeing what they call 'creative miracles' - where in 1 testimony God made a false eye into a real working one! I believe they've seen dead people raised to life too - they are definitely building a testimony and what I think is also cool is that their focus is toward getting a generation to operate in the supernatural - with their school etc... and it's not about 1 person being used of God in miracles and power which has been the model more-or-less for all previous moves of God looking at church history...", "group_id": 9787, "id": 1459649}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308774767.84497, "message": "@andreatrue I don't know about that, different doesn't mean greater. I don't think Jesus would have bothered to say something like \"greater than these\" if he just meant same stuff as me only different. In fact, Jesus says same stuff and more bigger. The more bigger is not the same stuff with different wrapping, surely? In what way is healing with a handkerchief greater than healing with spit, or the touch of a robe? Indeed, if items are used then eventually the items get idolised, just look at the catholic church selling pieces of the cross and what not for repentance of sin. Healing with props doesn't seem to be what Jesus means. Maybe you can explain to me in what way accomplishing the same result (healing, raising from the dead...) in a different manner is \"greater\"? \n\nAt any rate, we have to remember the one that actually does the healing, it's not us.", "group_id": 9787, "id": 1459991}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308775572.117156, "message": "@andreatrue Some places Jesus went, everyone was healed... but not all places. Does that mean that Jesus felt like he failed in those places? Why does it seem that the metric for success for Bill Johnson is 'a greater number of healings'? It doesn't seem to be Jesus metric for success or even his focus. It also still doesn't explain why they don't publish those amazing things, eyes that spontaneously regenerate from false eyes? That would be something amazing... I don't understand why you need to build up a better success rate for a ministry before making it known? Also, I still don't see much biblical evidence for miracles getting stronger and better with practice?", "group_id": 9787, "id": 1460166}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308775363.77741, "message": "Or even a better success rate? My 2c :P", "group_id": 9787, "id": 1460123}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308775323.281055, "message": "@andreatrue  @LintonCaldecott The other thing for me is Jesus healed 100% of the people He wanted to 100% of the time. He fed thousands with little every time He tried. Not sure we can do it greater if in fact greater meant better miracles than Him?", "group_id": 9787, "id": 1460119}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1308779735.0279729, "message": "Luk 10:19  Behold, I have given you authority to tread on serpents and scorpions, \nand over all the power of the enemy, and nothing shall hurt you. \nLuk 10:20  Nevertheless, do not rejoice in this, that the spirits are subject to you, \nbut rejoice that your names are written in heaven.\" \n\nInteresting passage if viewed in the context of this discussion.", "group_id": 9787, "id": 1460631}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308816594.7063029, "message": "Maybe we need some of this? http://failblog.org/2011/06/22/epic-fail-photos-wal-mart-product-fail/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+failblog+%28The+FAIL+Blog+-+Fail+Pictures+%26+Videos+at+Failblog.ORG%29&utm_content=Google+Reader", "group_id": 9787, "id": 1464424}, {"user_id": 13817, "stars": [], "topic_id": 39857, "date_created": 1308816598.4053459, "message": ":P", "group_id": 9787, "id": 1464425}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308834604.9549861, "message": "I am concerned, however, when people turn this sort of kingdom principle into a 7-step program. We can't manipulate God in to doing things our way....\n\n....\n\n....well actually biblical occasionally man did manipulate God into doing things man's way.....but it always ended BADLY!", "group_id": 9787, "id": 1465822}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1308834445.524507, "message": "I think that a core kingdom principle is that of being faithful in little leads to being faithful in lots. To be a good steward of little leads to you being given greater responsibility. From that perspective I understand the 'small miracles' principle. Faith is a tough thing, speaking from personal testimony now. I've had to learn a lot about trusting God. But there was no way my current faith over current things could have been realised 8 years ago. I've had to learn. Take a small risk, trusting God, followed by bigger and bigger risks. this is not a limitation of God, it's my own limitation of faith (whether of myself or given by God - refer the faith discussion...)\n\nSo I can understand a principle that asks people to start small and try out a 'step-of-faith'; to use an old cliche", "group_id": 9787, "id": 1465801}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1309438057.7117109, "message": "Sort of related:\n\n\"Now when the apostles at Jerusalem heard that Samaria had received the word of God, they sent to them Peter and John, who came down and prayed for them that they might receive the Holy Spirit, for he had not yet fallen on any of them, but they had only been baptized in the name of the Lord Jesus.\" Acts 8:14-16\n\nThis passage suggests that only the apostles could pray for people to receive the Holy Spirit. Does this still apply? Are only certain people able to do this? or what?", "group_id": 9787, "id": 1527498}, {"user_id": 32888, "stars": [], "topic_id": 39857, "date_created": 1309495560.0127959, "message": "That happened once (or twice i forget), and is the only (one of two?) specific places that this is mentioned, everywhere else in scripture it is implied or stated that to be with Christ is to have his spirit. I think it's a text used to support the idea of baptism in the holy spirit that is not really backed up or supported by the rest of the new testament.", "group_id": 9787, "id": 1537549}, {"user_id": 32900, "stars": [], "topic_id": 39857, "date_created": 1309506834.70649, "message": "@LintonCaldecott So then why in this case?", "group_id": 9787, "id": 1538272}]