[{"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304306974.944098, "message": "website: dapshare.com.  The website has a deliberate Australian flavour; intention is to market locally to Australian universities (the only site functionality relating to this is bank account details).", "group_id": 95, "id": 879888}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304307097.6471291, "message": "Appreciate any of your comments; thanks for taking a look.", "group_id": 95, "id": 879893}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304307068.9252939, "message": "A google search produces many sites trying to do the same thing.  How is dapShare any different? 100% free, integrated commenting, news feed, and customisable debt reminders.", "group_id": 95, "id": 879892}, {"user_id": 842, "stars": [], "topic_id": 33121, "date_created": 1304308520.3952439, "message": "Hmm...  I just use a Google speadsheet for this sort of thing.  It's pretty easy.  Not sure I see a need for something like this.", "group_id": 95, "id": 879990}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304311100.659317, "message": "I've used a spreadsheet in the past.  What I found is that a lot of my housemates weren't tech savvy enough to use it.  This app also allows for easy discussion of each item, and automatically sends notifications and reminders.", "group_id": 95, "id": 880255}, {"user_id": 3135, "stars": [], "topic_id": 33121, "date_created": 1304390811.0295489, "message": "@robertdapice Looks good. One piece of feedback might be to have more of a \"taste\"of the app on the front page. (more screenshots? a screecast?). A similar American company, WePay might be a place to look for inspiration. (I think they are a YCombinator company, grew out of a similar need to collect money from roommates, etc, and now have more general use-cases as well.)", "group_id": 95, "id": 892593}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304404573.9947031, "message": "@thesethings, thanks for the thoughtful feedback.  You're absolutely right about having 'more' on the homepage - I was thinking a scrolling series of screenshots each showing different features of the app.  A video would be great, but I think they can look v amateurish if not done really well.", "group_id": 95, "id": 894787}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304404759.2901759, "message": "There are bunch of great websites in the US in the personal finance space (Mint, for one).  It's a shame they never come to Oz.  Well, perhaps a shame, perhaps an opportunity... :)", "group_id": 95, "id": 894794}, {"user_id": 3135, "stars": [], "topic_id": 33121, "date_created": 1304491575.002233, "message": "@robertdapice To address you amateur-looking-video concerns, one cool thing about screencasts (or any other type of \"in the box\" video) is that at least at a compositional level, every shot is \"perfect.\" With live action videos there is so much to go wrong (bad camera, bad sound, bad light, etc).", "group_id": 95, "id": 909250}, {"user_id": 3135, "stars": [], "topic_id": 33121, "date_created": 1304491600.684164, "message": "@robertdapice in any case, a slideshow of screenshots would be great.", "group_id": 95, "id": 909257}, {"user_id": 24954, "stars": [], "topic_id": 33121, "date_created": 1304493430.9925461, "message": "@thesethings, Thanks very much for the tips.  Ill have a shot at building a slideshow or video over the next few days.", "group_id": 95, "id": 909648}]