[{"user_id": 2597, "stars": [], "topic_id": 11758, "date_created": 1299695298.5618041, "message": "paid or unpaid?", "group_id": 95, "id": 307354}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299693971.3478479, "message": "I'm working on this start-up that's in the college-dating space except it's not college-dating. The site is called TheLBB (www.thelbb.com). Right now it's in private beta in the San Diego area with about 200 college students.", "group_id": 95, "id": 307258}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299694128.322614, "message": "I'm looking for a rock-star developer (we're using PHP) who can bring innovative ideas to life as well as bring ideas to the table. Feel free to shoot your questions off in here, I'll be listening.", "group_id": 95, "id": 307268}, {"user_id": 2597, "stars": [], "topic_id": 11758, "date_created": 1299695327.4399259, "message": "you want the candidate to start asap", "group_id": 95, "id": 307355}, {"user_id": 2597, "stars": [], "topic_id": 11758, "date_created": 1299695334.2652121, "message": "what are the responsibilities of the dev?", "group_id": 95, "id": 307356}, {"user_id": 8501, "stars": [], "topic_id": 11758, "date_created": 1299697105.036756, "message": "How does your startup plan to make money?", "group_id": 95, "id": 307486}, {"user_id": 10237, "stars": [{"date_created": 1299698039.505168, "user_id": 719}, {"date_created": 1299704808.156328, "user_id": 314}, {"date_created": 1299707425.0734921, "user_id": 1661}, {"date_created": 1299709238.7146831, "user_id": 2293}], "topic_id": 11758, "date_created": 1299695716.0785971, "message": "You should probably not use the term \"rock-star,\" most developers I know despise it.  There might be good candidates who would completely overlook the opportunity just because of that.", "group_id": 95, "id": 307374}, {"user_id": 8501, "stars": [{"date_created": 1299709260.9417429, "user_id": 2293}], "topic_id": 11758, "date_created": 1299696872.243257, "message": "There are thousands of job ads for web developers. If you don't even hint about how much money is under consideration, no \"rock star\" will take you seriously. And if you bring up equity as the primary remuneration, everyone knows (or should know by now) that chances are it will be worthless.  You've got the attention of hundreds of devs by posting here; sell us on how it would be worthwhile to help your startup.", "group_id": 95, "id": 307465}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299704930.4222131, "message": "Yea, I'm listening except I was listening in my inbox. I thought I'd get email notifications. Let me address all your questions.", "group_id": 95, "id": 308345}, {"user_id": 8501, "stars": [], "topic_id": 11758, "date_created": 1299704170.4179709, "message": "@themadray Are you still listening? ;)", "group_id": 95, "id": 308271}, {"user_id": 2067, "stars": [{"date_created": 1299706306.3560441, "user_id": 719}, {"date_created": 1299709324.4622929, "user_id": 2293}], "topic_id": 11758, "date_created": 1299706161.8503399, "message": "All good questions so far.\n\nFirstly, I retract the term 'rock star' but I'd really want this person to be freaking good. No joke. \n\nThis would be paid - that's something to discuss further but in addition this person would have equity in the company. Yes, I know equity means nothing which is why we would discuss paid terms. Think of it as both equity and paid because I know a great developer is probably not within our reach with this all being self-funded.\n\nThe company makes money under a subscription type model. I really don't think I can get into it further except with serious candidates.\n\nHere's my pitch to developers.\nCollege-Only recently raised $1.1M with investors including Peter Thiel. Research shows the college only space lacks a proper solution for college only networking or dating. Start-ups like datemyschool.com and others are trying but they are merely copies of okcupid.com which has a saturated demographic of 18-24yr olds - the college demographic. Okcupid was recently purchased by match.com for $50M while Zoosk who also does well in the college demographic made $90M in 2010. \n\nWhat this means is that there are opportunities in this space and we all know niche does well. Even though this is a niche, it's scalable though challenging. In comparison to the leaders in the college space (plentyoffish.com, okcupid.com, zoosk.com) our leverage is that it's 100% college only. In fact, we've discovered a few things to ensure it stays that way. And no, I do not mean .edu emails. That's just a basic 1 step to protecting the site from non-students.\n\nPlentyoffish.com is the leader in the college-only space and have been mentioned in pop-videos. Has anyone seriously looked at this site? Is this the best we have to offer college students. I don't think so. \n\nI feel I have to touch on Facebook since they practically invented this space. They did well but then they left it and college kids are clearly yearning for something truly their own - no parents. no bosses. just their peers.\n\nSo with the idea, great design (I'm being subjective), user experience and effective marketing this will work. However, the key ingredient is a developer who can innovate. One who can look at what others are doing and use it as inspiration to create something better. For example, okcupid.com boasts about their algorithm... It is good but it's no rocket science. I have ideas on how to put to shame their programming. However, it's just an idea with no one to let me know if it's doable or not or even to improve upon the idea.\n\nThe very least: let me know if I did well pitching the idea.", "group_id": 95, "id": 308552}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299707473.2504129, "message": "It's a matter of positioning. Every one of these sites say 'join for dating' right? They position themselves as 'dating'. With us, our branding and positioning is that TheLBB is what you make of it: make new friends. connect with old ones. \n\nOur tagline is \"expand your scene\" so we stay true to it by providing the means that allow students to do this. We do this because college is a social experience as much as it is academic and we all know well that the connections made at this level can lead to great things,e.g., husband and wives meet, business partnerships are made and co-founders are discovered.\n\nLet's not kid ourselves, at this level, kids are looking to 'hook-up' so I'm not saying the site wouldn't be used for that. What our brand positioning isn't is \"this is a dating site\". In fact, you won't see: \"I'm a boy looking for a girl\". \n\nI certainly can't say too much about our ideas for the public domain but let's just say we want to enhance college experience in a more meaningful way as oppose to the obvious.", "group_id": 95, "id": 308760}, {"user_id": 2597, "stars": [], "topic_id": 11758, "date_created": 1299708734.9412739, "message": "my question remains un-answered, what is the start date... are you looking for someone immediately?", "group_id": 95, "id": 308928}, {"user_id": 8501, "stars": [], "topic_id": 11758, "date_created": 1299706653.40238, "message": "So it's a dating site for college students. You said at the top, \"...except it's not college-dating.\" Can you expand on how it is college-dating, without being college-dating?", "group_id": 95, "id": 308629}, {"user_id": 8501, "stars": [], "topic_id": 11758, "date_created": 1299706933.722096, "message": "How are you planning to address the chicken-and-egg problem, common with relationship sites?", "group_id": 95, "id": 308667}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299708884.0990341, "message": "@equinox Yea, we'd like this person to start asap. We can continue building out for a while but the sooner the better. We're not exactly in a situation where if we don't get a dev now, nothing progresses. It's all about finding the right fit and someone capable. This brings me to responsibilities which I'll get to in a bit.", "group_id": 95, "id": 308951}, {"user_id": 8501, "stars": [], "topic_id": 11758, "date_created": 1299708459.847666, "message": "I just read the faq: http://thelbb.com/faq. I like the idea of the service introducing users to 3 new students every day, carefully filtered based on the interests listed on users' profiles. What happens when there aren't enough students in the system to provide 3 new introductions a day? Unless... you don't launch a college until you get x number of students.", "group_id": 95, "id": 308898}, {"user_id": 2597, "stars": [], "topic_id": 11758, "date_created": 1299709050.0393, "message": "@themadray also any plan for thelbb to hire as an internship during the summer, I am still studying now but is really interested about the idea and would like to contribute", "group_id": 95, "id": 308969}, {"user_id": 2293, "stars": [], "topic_id": 11758, "date_created": 1299709440.879039, "message": "I like the idea. I assume you're looking for someone full time?", "group_id": 95, "id": 309014}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299708765.6785941, "message": "The best and only way to deal with the chicken and egg problem is to ensure the site is an extension of existing social networks. We aren't starting this to compete or replace Facebook, only to compliment it. As an extension, we get friends to invite friends and yes, there's a benefit in inviting aside from setting comfort level.\n\nWe launch by cities and everything is  localized. A number is definitely required to launch and we're experimenting with all this in San Diego.", "group_id": 95, "id": 308932}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299711043.361201, "message": "@barkerja Yes, this is full-time. As stated, this individual would be part of the founding team which means at a VC presentation, this individual would be mentioned as Technical Lead in our decks and BP.", "group_id": 95, "id": 309139}, {"user_id": 2293, "stars": [], "topic_id": 11758, "date_created": 1299711203.7126291, "message": "Needs to be local to the San Diego area?", "group_id": 95, "id": 309156}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299711797.635617, "message": "@barkerja It's not required but it would be nice because we can have hack-a-thon sessions and such. However, the internet breaks down those barriers so no, San Diego isn't required. \n\nFor all to know and consider, there's 2 things that truly matters in this hire:\n1. Your Skills - I'd like someone to look at programming the way I look at design - it can solve any world problem.\n\n2. The Fit - Essentially, you being a team player, a great person to work with. \n\nEverything else is negotiable.", "group_id": 95, "id": 309184}, {"user_id": 2067, "stars": [], "topic_id": 11758, "date_created": 1299711443.927511, "message": "@equinox Yes, that's something we'd like. Send me your resume to themadray[at]thelbb.com. If you've got free time, you could help us out not, that is, after we get lead dev in place.", "group_id": 95, "id": 309165}]