[{"user_id": 7664, "stars": [], "topic_id": 16060, "date_created": 1301422472.5730381, "message": "I'm thinking of watching The Wire with an eye to how it lines up with Dram and story. I'm assuming it will have a storyform for the first season. If not more.\n\nBut, before I log 20 hours just watching the show, I'm curious if this seems like a reasonable assumption (that it will have a storyform to suss out). \n\nThoughts?", "group_id": 2515, "id": 471200}, {"user_id": 7645, "stars": [], "topic_id": 16060, "date_created": 1301422954.850693, "message": "If anything it probably has at least 5 different storyforms...I started watching the first season last year and absolutely loved it...but of course, got busy with other things, but I had a sense that there wasn't so much one storyform as the beginnings of many...I could be totally wrong, and this would give me a good reason/excuse to watch the whole thing", "group_id": 2515, "id": 471260}, {"user_id": 7664, "stars": [], "topic_id": 16060, "date_created": 1301436468.6638939, "message": "From what I've watched, I assumed there would be more than one, but I wanted to make sure that it wasn't a mirage.\n\nThe thing that I find totally baffling is how a show told over so long a period with different writers can still end up with a storyform.", "group_id": 2515, "id": 473043}, {"user_id": 10814, "stars": [], "topic_id": 16060, "date_created": 1301439574.419986, "message": "On the other hand, it seems that it would be odd if something that held together so well (according to reviews I've read) over such a long period of time DID NOT have an underlying structure holding it together to give it greater meaning than its individual parts.\n\nSeeing the slow transition of a change character often feels more real because of the amount of calendar time passing during the audience reception.  What might feel \"melodramatic\" when watched back to back may appear to have more gravitas spread over thirteen or twenty-six weeks.", "group_id": 2515, "id": 473376}, {"user_id": 7664, "stars": [], "topic_id": 16060, "date_created": 1301449842.5852621, "message": "I meant something more akin to: it's amazing that several writers who work semi-autonomously (although with a show-runner) will put together a story that coheres so well.", "group_id": 2515, "id": 474950}, {"user_id": 7664, "stars": [], "topic_id": 16060, "date_created": 1301593541.740958, "message": "Yep. I have a general sense that works well-enough for kicking things off, but haven't thought much past the opening salvo. It's like I'm dealing with the symptom of the symptom at this point when I try to pinpoint WHO she is.", "group_id": 2515, "id": 494078}, {"user_id": 7664, "stars": [], "topic_id": 16060, "date_created": 1301527386.4260731, "message": "Been thinking on this. Okay, so here's what I find amazing and baffling. I have written a pilot; I have not outlined the first season. Now, I imagine that the season will comprise one or more storyforms -- let's go with one. \n\nI sat down and tried to work my magic, but I could only get down to 8 potential storyforms. (Still undecided: Resolve, Problem, Growth, MC Issue, MC Critical Flaw....)\n\nI'm assuming that the PSRs for each of these storyforms will be different. I'm also assuming they will be accurate. However, seeing as I have 8 potential paths to walk, but have already written my first episode... how is this possible?", "group_id": 2515, "id": 485775}, {"user_id": 10814, "stars": [], "topic_id": 16060, "date_created": 1301592329.3390191, "message": "Is it possible you have not clearly identified WHO your Main Character is?  That would make those decisions difficult.", "group_id": 2515, "id": 493951}]