[{"user_id": 22060, "stars": [], "topic_id": 19023, "date_created": 1302643294.890687, "message": "Trying to boot into the CD (I also have a backup of the CD on a USB) so i can repair a drive. I hold down opt during boot and it comes up with the boot menu. I select CD and then nothing. Just sits with the apple logo forever. Ive tried the DVD that came with my laptop and a standard off the shelf OSX disk. Ive also tried resetting the PRAM. Anyone got a suggestion as to why this is happening?", "group_id": 1295, "id": 651021}, {"user_id": 27275, "stars": [], "topic_id": 19023, "date_created": 1302684853.862349, "message": "Try holding the letter C during boot to bypass the selection process", "group_id": 1295, "id": 661648}, {"user_id": 4149, "stars": [], "topic_id": 19023, "date_created": 1302701636.07408, "message": "I also pretty sure you can't boot off a USB without a little hacking", "group_id": 1295, "id": 665041}, {"user_id": 24930, "stars": [], "topic_id": 19023, "date_created": 1302703996.109859, "message": "@undefined Sometimes it can be a problem with the HD that locks the bus, so the system never attempts to boot anything other than the HD.. to fix it you'd have to replace the HD.", "group_id": 1295, "id": 665410}, {"user_id": 21389, "stars": [], "topic_id": 19023, "date_created": 1302723980.672507, "message": "@italiano40 Intel Macs natively support USB and Firewire booting. Apple Geniuses regularly boot off an external USB drive that has about 6 or 7 different versions of the OS when they debug problems.", "group_id": 1295, "id": 670479}, {"user_id": 4149, "stars": [], "topic_id": 19023, "date_created": 1302725685.7112329, "message": "@alexandru I have an intel Mac and it took me some hacking to get booting off a USB and I know it can boot off FireWire and the apple store actually does a network boot", "group_id": 1295, "id": 671040}, {"user_id": 21389, "stars": [], "topic_id": 19023, "date_created": 1302830980.7716701, "message": "@italiano40 not sure what's hacky about holding down Option on boot (http://support.apple.com/kb/ht1948) The only issue one might encounter is from using the low-powered USB port on a laptop.", "group_id": 1295, "id": 693353}]