[{"user_id": 16440, "stars": [], "topic_id": 13218, "date_created": 1300209511.622937, "message": "Hi, I'm kind of new to this game. Started a few day's back and working some of the first quests :) I have trouble finding out what to do on this certain quest though. Any body that can help? :)", "group_id": 3048, "id": 358751}, {"user_id": 16440, "stars": [], "topic_id": 13218, "date_created": 1300209571.3321681, "message": "The details of the quest are: \"Use ireroot seeds to kill 12 grellkin in Fel Rock.\". But I am not sure how to use the ireroot seeds to do this? It might be very simple, am I overlooking something? :)", "group_id": 3048, "id": 358759}, {"user_id": 11421, "stars": [], "topic_id": 13218, "date_created": 1300210114.64061, "message": "The quest giver should have given you the item (ireroot seeds). If you don't have it anymore you can abandon the quest from the quest log and retake it from the quest giver, who should give you another seed. But it's probably somewhere in your bags without you having noticed it.", "group_id": 3048, "id": 358828}, {"user_id": 11421, "stars": [], "topic_id": 13218, "date_created": 1300210145.5076721, "message": "In general you can look up these things easily on spoiler sites such as <a href=\"http://www.wowhead.com/quest=13946\">Wowhead</a>.", "group_id": 3048, "id": 358835}, {"user_id": 16440, "stars": [], "topic_id": 13218, "date_created": 1300213505.3578351, "message": "@sdfjkl Yeah I have got the ireroots. Uhm, but how do I use it? I can select it, but nothing happens. I need to apply it somewhere I guess, as I can drag it when selecting, but I have no clue as to how or where? Also the above page does not suggest anything on that matter. One comment on there suggests 'spamming' the item, but how?", "group_id": 3048, "id": 359165}, {"user_id": 11421, "stars": [], "topic_id": 13218, "date_created": 1300462747.671052, "message": "You can activate \"on use\" items by right-clicking on them in your inventory.", "group_id": 3048, "id": 382893}, {"user_id": 16440, "stars": [], "topic_id": 13218, "date_created": 1300480983.8968771, "message": "@sdfjkl Ah great, that is what I was looking for, finally got to finish the quest :D Thanks mate!", "group_id": 3048, "id": 385206}]