[{"user_id": 20521, "stars": [], "topic_id": 39278, "date_created": 1308020626.0745261, "message": "Alguien ha hecho algo serio en alguna de estas plataformas? Vale la pena usarlas no solo tomando en cuenta lo técnico? Leo que muchos se quejan de que app engine no es una buena plataforma tecnológica para una startup por el simple hecho de que no hay  suficiente control. Que piensan? Ya de plano mejor un dedicado y configurar todo a mano?", "group_id": 965, "id": 1386916}, {"user_id": 24160, "stars": [], "topic_id": 39278, "date_created": 1308021376.829201, "message": "@nekrox Yo he usado Heroku tanto para proyectos personales cómo para mi startup y te lo recomiendo mucho si tu stack está basado en Ruby. Una de las cosas que más valoro como fundador es poder enfocarme en dónde yo agrego valor y en este caso la infraestructura no es ese punto. Nuestro producto (http://yondify.com) estaba basado en Sinatra y nos funcionó muy bien. No me qujaría de ninguna cosa. En cuanto al control, el stack nos quedaba muy bien: Ruby 1.8.7, PostgreSQL y una amplia variedad de addons que nos ayudaban a extender la aplicación con poco esfuerzo. El único \"problema\" que encontramos es la incapacidad de utilizar algunas librerías en C (Heroku sólo soporta gemas en Ruby). Al ser completamente basado en Git, también se nos facilitó mucho el deployment y el control de versiones.", "group_id": 965, "id": 1386955}, {"user_id": 24160, "stars": [], "topic_id": 39278, "date_created": 1308021506.495713, "message": "Supongo que otras PaaS son similares (aunque tendran sus detalles). Si necesitas saber sobre AppEngine, te recomiendo contactar a @dfect, entiendo que él ha hecho bastante por ahí. También te recomendaría echarle un ojo a DotCloud, aunque no tengo ninguna experiencia de primera mano con este servicio.", "group_id": 965, "id": 1386960}, {"user_id": 13545, "stars": [], "topic_id": 39278, "date_created": 1308022772.802871, "message": "Yo solo he usado solo VPS para producción. He probado Heroku, pero para mi fue más importante el precio mucho más bajo de un VPS y su versatilidad. @cesarsalazar tiene un excelente punto, y es el poderse enfocar en el negocio y no en la infraestructura. Aunque a mi también me gusta mucho meterle mano a esas cosas, así que no fue problema.", "group_id": 965, "id": 1387084}, {"user_id": 20521, "stars": [], "topic_id": 39278, "date_created": 1308051443.553762, "message": "Heroku lo he probado y creo que de los PaaS es lo mejorsito igual eh probado otros en python incluyendo dot cloud aun no tienen precios bien definidos, me voy arriesgar con app engine a ver que onda. Y por lo mismo que me quiero concentrar en la app quiero probar con algun PaaS, igual me gusta configurar servers y todo pero ahora si el tiempo anda corto. Hacer deploy con un par de click es muy tentador.", "group_id": 965, "id": 1390225}, {"user_id": 24170, "stars": [], "topic_id": 39278, "date_created": 1308057319.4837551, "message": "Al igual que @cesarsalazar creo que heroku es bastante facil de usar y se puede tener aun aplicación en linea en unos minutos, olvidandose de la parte de infraestructura. Desde antes como consultor independiente yo lo use para proyectos con clientes y ahora - que trabajo para Crowd Interactive - lo sigo usando en proyectos internos y de clientes.", "group_id": 965, "id": 1390844}, {"user_id": 34161, "stars": [], "topic_id": 39278, "date_created": 1308063996.1988111, "message": "http://www.carlosble.com/2010/11/goodbye-google-app-engine-gae/", "group_id": 965, "id": 1391672}, {"user_id": 12133, "stars": [], "topic_id": 39278, "date_created": 1308063113.329227, "message": "@nekrox te has olvidad de gondor.io ep.io para python que igual son PAAS escalables", "group_id": 965, "id": 1391549}, {"user_id": 34161, "stars": [], "topic_id": 39278, "date_created": 1308063468.5491259, "message": "No he probado Heroku, pero GAE tienes varias caracteristicas que hacen dificil trabajar con el, apenas le voy a dar un vistazo a Azure a ver si ese si esta listo para la empresa.", "group_id": 965, "id": 1391586}, {"user_id": 20521, "stars": [], "topic_id": 39278, "date_created": 1308063970.4495771, "message": "gondor es solo para django me parece y epio lo eh usado pero aun esta algo verde ademas podria ser algo caro a la larga. Azure soporta python? app engine me va perfecto con los frameworks que trabajo y las herramientas que uso hasta ahora, pero me preocupa en caso de que tenga que migrar a un dedicado la exportada de datos, aun así pienso arriesgarme con el.", "group_id": 965, "id": 1391666}, {"user_id": 35932, "stars": [], "topic_id": 39278, "date_created": 1308064403.588516, "message": "Usar GAE incluso para una ministartup en mi opinión es demasiado riesgoso ya que estás sujeto a fallas de servidor casi aleatorias, te vuelves dependiente de su dinosáurico DataStore, de componentes obsoletos, etc.", "group_id": 965, "id": 1391720}, {"user_id": 26088, "stars": [], "topic_id": 39278, "date_created": 1308065009.077425, "message": "Yo uso Azure :) y creo si se puede meter ruby y python http://channel9.msdn.com/events/MIX/MIX11/SVC04", "group_id": 965, "id": 1391811}, {"user_id": 20146, "stars": [], "topic_id": 39278, "date_created": 1308069989.172127, "message": "Comparto la opinión de @ivanyv un VPS creo que es una mejor opción técnicamente hablando. Es cuestión del tiempo que le puedas llegar a dedicar a la config. tu server (aunque honestamente no creo que lleve mucho tiempo configurar un servidor web de producción + repositorio p.e. git).", "group_id": 965, "id": 1392322}]