[{"user_id": 31441, "stars": [], "topic_id": 21923, "date_created": 1304050430.6329069, "message": "Honestly are these correct? Some of the things I see trending just have me wondering how accurate it is.", "group_id": 553, "id": 851523}, {"user_id": 31441, "stars": [], "topic_id": 21923, "date_created": 1304050745.0935111, "message": "Today for example \"Lil Zane\" (no idea who he is) is trending but something like the NFL draft isn't. I know not everyone watches the NFL Draft but it's a pretty big deal for a lot of tweeps.", "group_id": 553, "id": 851601}, {"user_id": 9391, "stars": [], "topic_id": 21923, "date_created": 1304058861.510998, "message": "Well it also depends on how many people are online at the time. Americans are into football a lot, but with other countries not so much. Twitter is global anyways. And topics that aren't trending can still get a lot of activity. Just search for NFL draft and I'm sure you'll see hundreds of messages within minutes.", "group_id": 553, "id": 852625}, {"user_id": 31441, "stars": [], "topic_id": 21923, "date_created": 1304081565.2906411, "message": "I was just using the NFL as an example. I understand it may not be trending I just happen to see a lot of unusual topics trending and was curious how accurate trending topics was. I use search.twitter.com all the time. It's a great service.", "group_id": 553, "id": 855635}, {"user_id": 29649, "stars": [], "topic_id": 21923, "date_created": 1304108445.8065441, "message": "I think it is fairly accurate because music/celebrities are more universal than a local sport and the fact that like Facebook, Twitter gets 70% of it's traffic from countries outside the us.", "group_id": 553, "id": 862881}, {"user_id": 31441, "stars": [], "topic_id": 21923, "date_created": 1304110635.328372, "message": "That makes sense although I thought I had my trending topics to just read US... maybe not.", "group_id": 553, "id": 863763}, {"user_id": 31441, "stars": [{"date_created": 1306052721.661119, "user_id": 13735}], "topic_id": 21923, "date_created": 1304221118.9244931, "message": "So after the NFL draft is over #NFLDraft is trending and promoting. Just odd to me.", "group_id": 553, "id": 873754}]