[{"user_id": 10890, "stars": [], "topic_id": 5921, "date_created": 1297747542.174619, "message": "The topic comes from Nick BOSTROM's 2003 paper in the Philosophical Quarterly: http://www.simulation-argument.com/simulation.html -- let's discuss it...", "group_id": 12, "id": 109398}, {"user_id": 10890, "stars": [], "topic_id": 5921, "date_created": 1297748020.921366, "message": "It's interesting because if our universe were one of many being simulated, the simulation argument could therefore be statistically applied to the creators saying they are in a simulation. That is sort of a reversal on an infinite regress: what created God (the primary mover in Aristotle's sense).", "group_id": 12, "id": 109411}, {"user_id": 10893, "stars": [], "topic_id": 5921, "date_created": 1297778964.165447, "message": "to describe the entire state of the universe, you'd need a memory address for every atom.  If we are in a simulation, it's a message-passing one.", "group_id": 12, "id": 111428}, {"user_id": 8430, "stars": [], "topic_id": 5921, "date_created": 1297848213.2135601, "message": "from that perspective, doesn't light speed kind of imply message passing as well?", "group_id": 12, "id": 118522}, {"user_id": 10893, "stars": [], "topic_id": 5921, "date_created": 1297879478.7614009, "message": "yes, I mean anything can be a message.  My point is, a shared coherent memory architecture is impractical for modelling the universe :-).", "group_id": 12, "id": 121996}, {"user_id": 14340, "stars": [], "topic_id": 5921, "date_created": 1298284948.7715681, "message": "gtrak, can you elaborate more? why memory addressing each atom would be impractical anf imply message passing (if I understand the argument correctly)?", "group_id": 12, "id": 157838}, {"user_id": 10893, "stars": [], "topic_id": 5921, "date_created": 1298363472.3632901, "message": "haha, well, it's the same reason why shared memory and cache coherence only lets you scale to about 100 cores.  There's a lot of overhead.  Plus, if you're keeping track of each atom, you'd need at most 1 atom per atom, so that would imply 2 universes.  If there's some model of the universe that's better than that, then you could cut it down a bit.", "group_id": 12, "id": 177796}, {"user_id": 15102, "stars": [], "topic_id": 5921, "date_created": 1298443183.762301, "message": "So it's turtles all the way up and down. Maybe there's some shady hacks going on in the upper simulation since we get glitchy things like quantum tunneling, and utter chaos at planck sizes. :P Must be using Eulers method for approximation.", "group_id": 12, "id": 186079}, {"user_id": 14326, "stars": [], "topic_id": 5921, "date_created": 1298631705.237319, "message": "What I understand is this: for us to live in a computer simulation, it would not be necessary to simulate all of the universe with every single atom. It'd do to simulate us, the intelligent beings, as we perceive the world auround ourselves, and just enough of this world to satisfy our peception. As long as this relatively small piece of world appears consistent to us, most of us will never question if all that's beyond does exist at all. Take me for example: I write -or I'm at least trying to- as if I was a thinking, somewhat reasonable being, so you'll probably take it I'm a human. You may never know if I am, and what does it matter if I got all my atoms together...", "group_id": 12, "id": 207116}, {"user_id": 10890, "stars": [], "topic_id": 5921, "date_created": 1298834677.3142991, "message": "more along the lines of @Tushulud, a look at brain microtubules and quantum consciousness http://ff.im/yZzNP -- but there's no clear explanation for \"awareness.\"", "group_id": 12, "id": 219743}, {"user_id": 18606, "stars": [], "topic_id": 5921, "date_created": 1299212390.854104, "message": "3. r = infinity.  We are continuously and subconsciously going through more and more levels of reality when a simulation splits an event into its multiply possible event states.  This spawns alternate universes, and propagates fragments of reality down the line as time goes on", "group_id": 12, "id": 266522}, {"user_id": 18606, "stars": [], "topic_id": 5921, "date_created": 1299212284.547349, "message": "Listen: we really don't know how the brain works.  So it is more holistic to observe the scheme of observation and reality.  I see 3:\n\n1. r = 0.   We are real, but are living through a computer simulation, and the number of reality \"levels\" is unknown at the moment", "group_id": 12, "id": 266507}, {"user_id": 18606, "stars": [], "topic_id": 5921, "date_created": 1299212422.0377109, "message": "Personally, I think that all 3 have some merit, but I would rather want to believe in 2, if I could choose so", "group_id": 12, "id": 266528}, {"user_id": 10858, "stars": [], "topic_id": 5921, "date_created": 1299214438.979578, "message": "John Tierney, a reporter for the NYT wrote an interesting article about this back in 2007, quoting a Dr. Bostrom that says he believes there's about a 20% chance that we are in fact living in a computer simulation: http://jmsplng.me/fPQtMj", "group_id": 12, "id": 266682}, {"user_id": 18606, "stars": [], "topic_id": 5921, "date_created": 1299212315.776999, "message": "2. r = 1.   We are living in the one, single, true reality, but are acting through a computer simulation.  There is 1 reality and 1 siulation", "group_id": 12, "id": 266511}, {"user_id": 10890, "stars": [], "topic_id": 5921, "date_created": 1299215975.882338, "message": "@jamespoling that link does not seem to work... alternative: http://www.nytimes.com/2007/08/14/science/14tier.html?_r=1&pagewanted=all -- 20% is his \"gut feeling.\" :-) But the most amusing remark is by an economist, \"you should try to be as interesting as possible, on the theory that the designer is more likely to keep you around for the next simulation.\" \\\\ @psybuzz, article ends on this note, \"Insufficient Memory to Continue Simulation -- Game Over.\"", "group_id": 12, "id": 266844}]