[{"user_id": 1, "stars": [], "topic_id": 15729, "date_created": 1301291367.954684, "message": "That said, I know they sometimes hold up in other states.  Specifically when monetary compensation is offered in lieu of competition.", "group_id": 250, "id": 455571}, {"user_id": 25551, "stars": [], "topic_id": 15729, "date_created": 1301291282.8713441, "message": "Let's say I work for a large company that makes a lot of stuff, including toasters and washing machines. If I work for the toaster department and decide I want to start a company selling washing machines, could I be affected by a non-compete?", "group_id": 250, "id": 455564}, {"user_id": 1, "stars": [], "topic_id": 15729, "date_created": 1301291342.938715, "message": "Not in California, they don't hold up in court in the state of CA.", "group_id": 250, "id": 455569}, {"user_id": 1, "stars": [], "topic_id": 15729, "date_created": 1301291399.463464, "message": "IANAL though", "group_id": 250, "id": 455572}, {"user_id": 13321, "stars": [{"date_created": 1301293153.8237829, "user_id": 1}], "topic_id": 15729, "date_created": 1301293071.170927, "message": "Affected? Yes. A couple of things you may want to mind. This being the internet, I think the company can choose a more company-friendly state than CA to try the suit. Also, there's nothing stopping a company from terminating at-will employment.", "group_id": 250, "id": 455631}, {"user_id": 13676, "stars": [], "topic_id": 15729, "date_created": 1301320270.561806, "message": "I will say this up front... Most non-competes are for the purpose of make your life hell for a few months so you lose income when a cease and desist letter goes out and you have to waste time with lawyers and court.  Wit that said, If you sign a non-compete and you are in an at will state you can still be held liable depending on the non-compete wording. Usually if it is overly ridiculous (ex. You can't do business with any home/business appliance companies or users in the USA or any other country we do business for 5 years) then it will not hold up unless you were paid for that 5 years.  Other wise they do have a chance if it was specific (ex. You cannot compete in the toaster and washing machine market for 1 year)... and if they paid you then you will lose for sure.  Not a lawyer but am in an at will state and have been totally shocked several times when I saw people lose out to a non-compete.", "group_id": 250, "id": 457889}, {"user_id": 9321, "stars": [], "topic_id": 15729, "date_created": 1301327901.606231, "message": "IANAL as well, but if they paid you to not compete, then you shouldn't compete. If you had nothing to do with the washing machines previously, and had no specific knowledge about how your company built or sold them, then you should be fine. There is also a thing called \"right to work\" and even in the most corporate friendly states, most courts will not inhibit a person's right to work in their given profession. If you have experience in consumer household goods (toasters) you can use that experience to sell similar goods at a different company, as long as you do not specifically target/steal the customers of the old company.", "group_id": 250, "id": 459009}, {"user_id": 9321, "stars": [], "topic_id": 15729, "date_created": 1301327981.510148, "message": "Even in a high profile case such as the Mark Hurd HP-Oracle deal, HP settled with Hurd and he had to give back some of the compensation he took under his severance agreement. http://www.law360.com/topnews/articles/195111/hp-settles-trade-secrets-suit-with-ex-ceo - enabling him to continue working in his chosen profession.", "group_id": 250, "id": 459017}, {"user_id": 18478, "stars": [], "topic_id": 15729, "date_created": 1301492072.863508, "message": "I hada  non-compete clause in the partnership agreement with the web hosting company in which I was in charge of running a sister company for.  It said I could not start nor work for a competitor for a period of 1 year.  I have not worked for that company since March 19 as I was not satisified with the \"Parent Companies\" plans overall.", "group_id": 250, "id": 481597}, {"user_id": 18478, "stars": [], "topic_id": 15729, "date_created": 1301492455.7661941, "message": "I had one of those when I ran a sister company in the web hosting industry for about 1 month.  Said I could not run my own or work for another hosting company for a period of 1 year.  Thing is the company is in California and I am not a USA Citizen and actually live on the East coast in Atlantic Canada.  I want to start my own company based in eastern Canada but am hesitant to.", "group_id": 250, "id": 481652}, {"user_id": 18478, "stars": [], "topic_id": 15729, "date_created": 1301492467.2287779, "message": "I quote\" thereafter, the Employee shall not, directly or indirectly, acting alone or in conjunction with others:\nA. Request any customers of any business then being conducted by the Company to curtail or cancel their business with the Company;\nB. Solicit, canvass or accept any business or transaction for any other person, firm or corporation or business similar to the business of the Company, from any past or existing customers of the Company;\nC. Induce, or attempt to influence, any employee of the Company to terminate employment with the Company or to enter into any employment or other business relationship with any other person (including the Employee), firm or corporation; or\nD. Act or conduct himself in any manner which is contrary to the best interests of the Company.\nThe Employee recognizes that immediate and irreparable damage will result to the Company if the Employee breaches any of the terms and conditions of this Paragraph 4 and, accordingly, the Employee hereby consents to the entry by any court of competent jurisdiction of an injunction against him to restrain any such breach, in addition to any other remedies or claims for money or damages which the Company may seek. The Employee represents and warrants to the Company his experience and capabilities are such that he can obtain employment in business without breaching the terms and conditions of this Paragraph 4, and that his obligations under the provisions of this Paragraph 4 (and the enforcement thereof by injunction or otherwise) will not prevent him from earning a livelihood. The Employee agrees to pay any and all reasonable attorney fees sustained by the Company in connection with any breach of this Agreement.\"", "group_id": 250, "id": 481656}, {"user_id": 18478, "stars": [], "topic_id": 15729, "date_created": 1301492489.05446, "message": "Am I bound to this contract?", "group_id": 250, "id": 481660}, {"user_id": 22183, "stars": [], "topic_id": 15729, "date_created": 1301509949.344692, "message": "@MarkLaViolette Check the context of the non-compete and probably have a lawyer to look at it.  You probably don't want the company to file something in the US, and the custom will give you trouble next time you go on vacation or conference to US.", "group_id": 250, "id": 483783}, {"user_id": 9321, "stars": [], "topic_id": 15729, "date_created": 1301512366.3737569, "message": "@MarkLaViolette Unless I am missing something, these clauses seem reasonable, with the exception of soliciting business from \"past customers\" of the company. If a customer is no longer a customer of your former company, then you doing business with them could not harm your old company and thus should be acceptable. The rest of it just says \"don't steal our customers\" which you certainly should not do. Other than that I think you should feel free to start your own company ESPECIALLY if it focuses on a different market than the old company.", "group_id": 250, "id": 484169}, {"user_id": 18478, "stars": [], "topic_id": 15729, "date_created": 1301515480.5282159, "message": "@Mattarata It would be the type of business as my past company. (Web Hosting)", "group_id": 250, "id": 484680}, {"user_id": 25852, "stars": [], "topic_id": 15729, "date_created": 1301550602.676944, "message": "I believe the effectiveness of these vary from state to state. CA, for instance, favors employees generally, and non-competes are notoriously difficult to enforce.", "group_id": 250, "id": 488906}, {"user_id": 9321, "stars": [], "topic_id": 15729, "date_created": 1301586438.248904, "message": "@MarkLaViolette Same type of business sure - but you said you were going to focus on a different target market or type of customer or customers in a different region, so I think you should be more than fine. And if the old company was relatively small with little resources, I wouldn't worry about them coming after you, especially if you complied with the spirit of the non-compete. No lawyer is going to pursue a case with little chance of winning.", "group_id": 250, "id": 493082}]