[{"user_id": 22669, "stars": [], "topic_id": 40075, "date_created": 1308714251.720114, "message": "Amazing end to the first season in my opinion. So for everyone that read the book, how did you feel it was depicted on the show? And for anyone that is new to the series, and has not read the books were you surprised? How did you like the finale?", "group_id": 8925, "id": 1454653}, {"user_id": 34156, "stars": [], "topic_id": 40075, "date_created": 1308717526.3577249, "message": "It was a good episode but I think episode 9 was more exciting. I can't wait for the next season to start... so I started reading \"A Clash Of Kings\" today. It's great!", "group_id": 8925, "id": 1454786}, {"user_id": 25703, "stars": [], "topic_id": 40075, "date_created": 1308718793.3388629, "message": "The Night Watch riding north was a fantastic moment too. Other than those two final sequences, I guess it was more an episode of wrapping up and teasing, but that's pretty par for the course for most HBO shows - the climactic shockers are normally in the penultimate episodes. I actually couldn't remember much of what happened in the book after Ned died, so I was worried that it would be an episode of mostly nothing until the dragon reveal, but they kept it exciting.", "group_id": 8925, "id": 1454850}, {"user_id": 25703, "stars": [], "topic_id": 40075, "date_created": 1308718718.6821821, "message": "I thought it was a stunning finale. I think the imagery evoked in the books (if I remember correctly) with Daenerys walking out of the fire with the dragons was stronger, and I was looking forward to that - the scene transition in the show felt a little awkward, but it was a fantastic moment nonetheless. I'm impressed by how good the dragons look, it's not film-grade CGI, sure, but for a TV series it's outstanding.", "group_id": 8925, "id": 1454845}, {"user_id": 31852, "stars": [], "topic_id": 40075, "date_created": 1308722783.6459589, "message": "Yes, I agree with you regarding the imagery in the books -- it was definitely more successful in getting the \"Mother of Dragons\" thing across. Although, I guess that sequence could've come across as quite tacky on screen, so I understand why they deviated from it.", "group_id": 8925, "id": 1455006}, {"user_id": 25703, "stars": [], "topic_id": 40075, "date_created": 1308724802.556689, "message": "Probably would've been a nightmare to film, too.", "group_id": 8925, "id": 1455088}, {"user_id": 36069, "stars": [], "topic_id": 40075, "date_created": 1309043045.4044869, "message": "It felt to me at the ep was missing something", "group_id": 8925, "id": 1486145}, {"user_id": 22669, "stars": [], "topic_id": 40075, "date_created": 1309062145.427264, "message": "I had only heard about the books when the show was announced, and started reading them in sequence as the show started. As someone who finished the first book just before the finale aired I wad actually quite impressed with the visuals they ended up with.", "group_id": 8925, "id": 1487223}]