[{"user_id": 29357, "stars": [], "topic_id": 19366, "date_created": 1302772300.3963699, "message": "Aedamon? Spam and plagiarism. Should be able to ban in mod with 3 votes for 1 week", "group_id": 8807, "id": 681481}, {"user_id": 29357, "stars": [], "topic_id": 19366, "date_created": 1302772236.7187829, "message": "So.... Spam is promotion of a product or service repeatedly? I think it should also include user names. There are people like \"ifixmacs.com\"  etc. Sometimes their advice is good but the name is spam", "group_id": 8807, "id": 681472}, {"user_id": 29484, "stars": [], "topic_id": 19366, "date_created": 1302776208.788604, "message": "Aedamon is the one that I was watching tonight. Lots of the same answer, cut and past not even device specific. So i sort of took it as spam, did not have the Bonehead option :-)", "group_id": 8807, "id": 682072}, {"user_id": 29436, "stars": [], "topic_id": 19366, "date_created": 1302802360.2318649, "message": "Spamming is a grey area. We want to encourage businesses using our site and we don't mind them putting their business name in their username or links/adverts in their about us. Signatures on every answer are shady but again, if the content is useful and the spam's not too intrusive it's probably ok. If the content is worthless + spam, then we should take action.", "group_id": 8807, "id": 687653}, {"user_id": 29357, "stars": [], "topic_id": 19366, "date_created": 1302805624.9540031, "message": "You are encouraging business away from yourselves then. Mr fix computers isn't going to buy your parts when he prob has the same supplier... It's like letting the bakers next door put a sign in your bakery window!", "group_id": 8807, "id": 688333}, {"user_id": 29436, "stars": [], "topic_id": 19366, "date_created": 1302809103.4617939, "message": "Well sure, if the answers are filled with people saying \"don't buy from ifixit, buy from over here\" then we'll have some issues; but I don't think that's been a big problem. We are expanding into areas where we don't have the parts to sell (car/bike/clothing repair) and we want people to exchange links for parts that we don't offer. It's hard for us to draw a line in the sand and say \"No spam\" because \"Spam\" is a really loose definition. The correct answer could be a product outside of iFixit or getting service from a company that's not affiliated.", "group_id": 8807, "id": 689114}, {"user_id": 22563, "stars": [], "topic_id": 19366, "date_created": 1302902658.466773, "message": "Or we could say we are a flower company selling to bakers. We want them to promote competition with each other and also use our product.", "group_id": 8807, "id": 705495}, {"user_id": 29434, "stars": [], "topic_id": 19366, "date_created": 1302919245.6838319, "message": "@Chris_Cline  @icco Thank  you for the clarification.", "group_id": 8807, "id": 707981}, {"user_id": 29484, "stars": [], "topic_id": 19366, "date_created": 1302964251.7523799, "message": "There is nothing wrong with competition, but there is something wrong with answering multiple postings with the identical cut and paste answer and promote websites that lead you to anything but what you are looking for. If I would be the person that is searching for an answer would receive that as my answer, I'd be thinking twice about a. the validity of any other answer and b. about the credibility of the original site. So I think if we can edit the answer by removing the website but leave what \"could\" be an answer we should leave it alone. Personally I do use a lot of links and yes, I do have my favorite, but that does not mean that I have to add it to all of my answers....just my 2 cents.", "group_id": 8807, "id": 710875}, {"user_id": 29475, "stars": [], "topic_id": 19366, "date_created": 1303080847.8917561, "message": "Nat, I think the less said about iFixit prices, the better.  I have a real hard time sometimes listing your parts, but I do my best to keep my mouth shut.", "group_id": 8807, "id": 719407}, {"user_id": 29475, "stars": [], "topic_id": 19366, "date_created": 1305182002.7767689, "message": "Does anyone else have a problem with this guys name? FKHAR, Youssef.  I think it's spam.  http://www.ifixit.com/Answers/View/19946/Which+CPU+would+work+in+a+Mac+Mini+A1176", "group_id": 8807, "id": 1020988}, {"user_id": 29142, "stars": [], "topic_id": 19366, "date_created": 1305265727.294944, "message": "Could be… someone want to run virus check on that file?", "group_id": 8807, "id": 1036220}, {"user_id": 31265, "stars": [], "topic_id": 19366, "date_created": 1305302099.697443, "message": "Just checked it on my android... It's an older code but it checks out all right", "group_id": 8807, "id": 1043379}, {"user_id": 29475, "stars": [], "topic_id": 19366, "date_created": 1305352452.7126689, "message": "Not the link.  The name.  Say it out loud.", "group_id": 8807, "id": 1050553}, {"user_id": 29484, "stars": [], "topic_id": 19366, "date_created": 1305395410.837579, "message": "I do agree with mayer that there is something odd, but may be its just me being paranoid. I downloaded the file in question and it looks like machead is right. No spam or malware after virus check etc.", "group_id": 8807, "id": 1053767}, {"user_id": 31265, "stars": [], "topic_id": 19366, "date_created": 1305480278.5535519, "message": "yeah i think we all realized that, probably just a joke...", "group_id": 8807, "id": 1061212}]