[{"user_id": 17584, "stars": [], "topic_id": 13000, "date_created": 1300113372.2289381, "message": "Is it just me? or does anyone find the SXSW coverage by Twit overdone? It seems like one remote crew would be more than adequate. I know that SXSW is supposed to be a great event but walking around the streets of Austin is about as exciting as watching grass grow (to some). I mean, really. Do we really need to watch Leo crowd surf, again? I think Twit viewers would be best served by having a booth where tech celebs stop by, quip and leave. But watching Tom and Brian walking around, simulating \"cool\"  with their StarTrek-ish sunglasses looks...uh, silly. Your thoughts?", "group_id": 5074, "id": 347678}, {"user_id": 15929, "stars": [], "topic_id": 13000, "date_created": 1300115789.2170999, "message": "barely seen any... they're still running last week's playlist for the rerun... one of the problem with living in the part of the world where we sleep when SXSW is going and wake up when SXSW ready to call it a day...", "group_id": 5074, "id": 348129}, {"user_id": 15929, "stars": [], "topic_id": 13000, "date_created": 1300115882.6233449, "message": "watched the ipad 2 launch... don't think twit video is out yet...", "group_id": 5074, "id": 348151}, {"user_id": 16903, "stars": [], "topic_id": 13000, "date_created": 1300115584.4886179, "message": "I would have liked to see more panels like the twit show at SXSW.  Really take avantage of having everyone in one town for more discussions. More Tech discussions and less \"Parties\".", "group_id": 5074, "id": 348097}, {"user_id": 16859, "stars": [{"date_created": 1300129613.9257281, "user_id": 1}], "topic_id": 13000, "date_created": 1300116950.463949, "message": "Actually I generally liked it. Its like a discount travelogue, with two wise guy guides walking around snarking at the locals *g* Brian's got the gift of the gab (and probably talks in his sleep) and Tom knows so much general trivia he can always whip up some vaguely relevant tangent on any topic :)", "group_id": 5074, "id": 348383}, {"user_id": 17584, "stars": [], "topic_id": 13000, "date_created": 1300127835.2857971, "message": "@ljsworld I tend to agree with you. It seems that SXSW panels are spread out and run simultaneously. It woulds serve everyone better if there was one central venue with sequentially scheduled panels. They could be recorded live and posted online for review. That would work for me. The ability to \"scrub\" a recorded file, to me, is a must. Watching live panels is a tough feat for me. More often than not, I find myself dozing off.  Maybe it's just me, but recorded panel discussions are my preferred tech plate of choice during conferences. A good editor, with good cam coverage, could even make it interesting.", "group_id": 5074, "id": 349754}, {"user_id": 17097, "stars": [], "topic_id": 13000, "date_created": 1300277473.9423521, "message": "As much as I\"m a creature of routine, I like variety. Overdone? Or just for fun? I actually missed the crowd surfing but watched before that and I can see why Leo does this.  It is aimed at the younger audience, I believe, to keep the show(s) interesting, fresh, alive, etc. for the not-as-geeky. Some can live, eat and breathe tech 24-7, some like a break. Easy solution for me, when I find any program or episode I don't like...click. But I see what you mean, Leo could have hit on a few of the topics of the conference, at least. I'm pretty sure we are seeing how stress can affect ones actions. Leo is having to swallow a lot of new and expensive long-term commitment of late..gotta take a toll.", "group_id": 5074, "id": 364637}, {"user_id": 2109, "stars": [], "topic_id": 13000, "date_created": 1300297665.21773, "message": "I've never been to SXSW but this video explains it all, hilarious! \"The Downfall\" - Hitler Responds To Recent Trends At SXSW - http://www.youtube.com/watch?v=z66_RnVLOJQ", "group_id": 5074, "id": 367948}, {"user_id": 17584, "stars": [], "topic_id": 13000, "date_created": 1300365653.6478391, "message": "i guess that i just don't like the long feeds from SXSW. edited highlights and recaps would suit me better. it seems like we're often getting tunnelvision coverage of SXSW, and not the big picture from the start. After all, tech was hardly the focus of SXSW in the beginning. I guess it's all based on who's producing the coverage. i'm sure it'll get better.", "group_id": 5074, "id": 373397}, {"user_id": 17584, "stars": [], "topic_id": 13000, "date_created": 1300365744.685066, "message": "this year the highlight of the crowd surf was Lisa Bettany. Not just for the obvious, but because she seems to be bringing new energy to TWIT... and Leo.", "group_id": 5074, "id": 373416}, {"user_id": 15780, "stars": [], "topic_id": 13000, "date_created": 1300372106.5364449, "message": "I see where you're coming from on the length. However, I think there are a lot of people who wish they could be there for everything. I'm sure his advertisers don't mind either.", "group_id": 5074, "id": 374348}, {"user_id": 22453, "stars": [], "topic_id": 13000, "date_created": 1300377872.947268, "message": "Is Leo Laport on here", "group_id": 5074, "id": 375152}, {"user_id": 17124, "stars": [], "topic_id": 13000, "date_created": 1300385486.6370921, "message": "Overdone? -I have no idea, because I've only seen the iPad coverage and a short clip from the TWiT panel so far, but I believe no. There is so much more in life than just TWiT, so whenever the programming doesn't feel compelling, I look elsewhere, or do something else. I don't even have that many chances to watch the TWiT shows live.\n\nAs for the SXSW, it's just a big party for the geeks, a bit like today is for certain stout lovers. I for one would love to be there at least once. But living far away from Austin, TX, that's easier said than done, so I don't mind getting a quick glimpse of the silly little event. It's just a bit of harmless geeky fun. When it gets boring, I just surf some place else.", "group_id": 5074, "id": 376170}]