[{"user_id": 25703, "stars": [], "topic_id": 41386, "date_created": 1310062050.707247, "message": "Are XBLA games downloaded on a specific XBL account locked to that account for online play?\n\nAlso, if someone in SA was creating a new Live account today, is there any reason not to make it a South African account?", "group_id": 9493, "id": 1586256}, {"user_id": 31852, "stars": [], "topic_id": 41386, "date_created": 1310064431.0874519, "message": "The SA marketplace is still pretty dismal compared to the UK/US ones -- most of the older releases are not available on the local store. Plus both subscriptions and MS points are more expensive locally.\n\nAs for XBLA games, the answer is \"kind of\". XBLA games aren't just locked to a profile, but also a specific console. If you're playing on the console on which the game was originally purchased and downloaded, then the game is available in full to all profiles on that console. However, once the console gets replaced, it'll only be available to the profile which purchased it, and only when that profile is connected to Live. But this can be fixed by using the online purchases transfer tool to link all past Live purchases to the new console, which can be done once a year.", "group_id": 9493, "id": 1586581}, {"user_id": 25703, "stars": [], "topic_id": 41386, "date_created": 1310064682.777638, "message": "Oh, interesting, that I wasn't expecting. Thanks!", "group_id": 9493, "id": 1586631}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310070017.0259061, "message": "Also, the licence migrator:  http://www.xbox.com/en-US/Support/LicenseMigration/Home", "group_id": 9493, "id": 1587516}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310069965.409164, "message": "I'll just add one thing to Mark's explanation:\n\nAs far as I know, if a profile that \"owns\" Game X is logged into a console that doesn't \"own\" Game X, then any profile on that console can play the game.  (Keep in mind that the Xbox 360 operating system does allow multiple simultaneous logins.)\n\nTo clarify:  I can take my profile to a friend's house on a memory card, log in to his Xbox 60 and redownload an XBLA title I own.  He can then pick up a second controller, log in under his own profile, and (as long as I don't sign out) play the game.\n\nAt any rate, it used to work like this, but I haven't checked in a while.  (You tend to run into these things if you have multiple Xboxen and multiple gamers in the same household.)", "group_id": 9493, "id": 1587508}, {"user_id": 25703, "stars": [], "topic_id": 41386, "date_created": 1310071221.984606, "message": "But, I don't lose the ability to download and play my profile's games even in the event of b), right?", "group_id": 9493, "id": 1587735}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310070151.723598, "message": "I guess it will definitely fail once you use the licence migrator to migrate all your licences to your new console.", "group_id": 9493, "id": 1587543}, {"user_id": 25703, "stars": [], "topic_id": 41386, "date_created": 1310070083.609118, "message": "See, now, my brother claims to be able to play Guardian of Light on my old Xbox, with his profile, and I can definitely still load it up on my new console (having brought it over on a flash drive) with my profile. At what point will/should this fail were we to try play a game with each other?", "group_id": 9493, "id": 1587527}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310070592.6034839, "message": "(a) If someone who isn't you wants to play your old XBLA games on your new console without having to ask you log in first every time.\n\n(b) If you lose access to the old console completely, through, say, an Act of God or (worse!) a RRoD.\n\n(c)  Neatness and obsessive compulsiveness.", "group_id": 9493, "id": 1587622}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310070642.2512579, "message": "MASSIVE DAMAGE!", "group_id": 9493, "id": 1587625}, {"user_id": 25703, "stars": [], "topic_id": 41386, "date_created": 1310070441.3451819, "message": "So why would I do this exactly? :\\", "group_id": 9493, "id": 1587601}, {"user_id": 31927, "stars": [], "topic_id": 41386, "date_created": 1310071723.9887149, "message": "Nope, they're tied to your profile.\n\nThere's really no general reason to have all your games linked to a specific console rather than spread around over consoles you own.  I mean, in some specific cases you may find it more convenient to have a game on a certain console, but there's no *general* reason.\n\nI mean, I have all my games tied to my \"primary\" Xbox, but that's just due to… neatness and obsessive compulsiveness.", "group_id": 9493, "id": 1587814}]