[{"user_id": 40499, "stars": [], "topic_id": 48718, "date_created": 1324062323.4665821, "message": "si, convore como que siempre está lento.  Yammer está curado", "group_id": 12398, "id": 2743800}, {"user_id": 2984, "stars": [], "topic_id": 48718, "date_created": 1323880799.768569, "message": "Siento lentísimo a convore. Voy a estar revisando communityengine, aunque a mi me gustaba mucho yammer :P", "group_id": 12398, "id": 2742386}, {"user_id": 21823, "stars": [{"date_created": 1323824459.5018909, "user_id": 21828}, {"date_created": 1323836471.0076921, "user_id": 2984}], "topic_id": 48718, "date_created": 1323813349.1540129, "message": "A como la vea, las alternativas que tenemos hasta ahora para organizarnos, compartir informacion y demas son:\n\na) Crear una solucion desde cero para nosotros\n\nb) Instalar/configurar algun software de social network en un server nuestro como:    http://communityengine.org/ \nhttp://buddypress.org/ \ndiaspora*\n\nc) Decidir usar para estos propositos alguna de las redes sociales que ya tenemos (g+, fb, convore)\n\nd) checar nuevas redes sociales mas orientadas a eso, aunque no sean tan populares como: \nhttp://en.wikipedia.org/wiki/Category:Social_planning_websites\nhttp://mashable.com/2010/10/04/event-planning-social-media/\nhttp://downloadsquad.switched.com/2007/03/19/socializr-social-event-planning/\n\nA mi particularmente a) me parece inviable por lo tardado, laborioso y demas razones que  conlleva el desarrollo de sw, de cierta manera me parece como matar moscas con un misil.\n\nLa b) me gusta sobre todo lo de communityengine es un plugin sobre rails y de ahi se personaliza y demas, muy al estilo de buddypress (pero ese es para php y @axel lo calo y parece que no le gusto mucho), Diaspora tambien es buena opcion pero quiza no tan configurable, quiza...\n\nEn cuanto a c) a mi me parece bien convore para empezar, es privado, sencillo, simon nadie lo usamos regularmente, pero es cuestion de empezar (yo aqui estoy planteando esto no?)\n\nPor ultimo d) esta curado pq son apps especialmente orientadas a planeacion de eventos, que es uno de los puntos fuertes de lo que queremos, claro esta el asunto de que es latoso darse de alta a una SN nueva, y otros no les gusta compartir datos por ahi.\n\nEn resumen, yo digo que sigamso con convore por un rato en lo que echamos a andar algo de la opcion b) que no mi apa'?", "group_id": 12398, "id": 2741910}, {"user_id": 21823, "stars": [], "topic_id": 48718, "date_created": 1323813994.8173251, "message": "ps: ponganmeN muchas estrellitas", "group_id": 12398, "id": 2741916}, {"user_id": 40499, "stars": [{"date_created": 1323836476.1528561, "user_id": 2984}], "topic_id": 48718, "date_created": 1323818253.105916, "message": "I agree, convore por el momento y la opción b :)", "group_id": 12398, "id": 2741941}, {"user_id": 40514, "stars": [], "topic_id": 48718, "date_created": 1323821406.529285, "message": "hagan lo que quieran, y vine a cocinar.... nomás me avisan", "group_id": 12398, "id": 2741974}, {"user_id": 2984, "stars": [], "topic_id": 48718, "date_created": 1323836459.2057829, "message": "Si, yo probé budypress y la neta eso de estar brincando de la interfaz de social network a la del backend de wordpress está de la shit.", "group_id": 12398, "id": 2742099}, {"user_id": 40497, "stars": [], "topic_id": 48718, "date_created": 1323845316.949717, "message": "BTW, sigo prefiriendo G+, pero ya abrieron Convore... ya que chingados jajajaja :D", "group_id": 12398, "id": 2742146}, {"user_id": 40497, "stars": [], "topic_id": 48718, "date_created": 1323845164.2120991, "message": "yo digo que el doc nos prepare botanillas en lo que nos decidimos, yo puedo ir abriendo algunas botellas :D", "group_id": 12398, "id": 2742144}, {"user_id": 40514, "stars": [], "topic_id": 48718, "date_created": 1323929978.2670839, "message": "estoy de acuerdo, convore esta algo lento, pero me atengo a sus deseos, malditos geeks", "group_id": 12398, "id": 2742828}, {"user_id": 21823, "stars": [], "topic_id": 48718, "date_created": 1324140338.367909, "message": "o'right deberiamos de calarlo como la alternativa 'mientras-hacemos-algo-custom'. Pense que esa onda era empresarial only, a ver me hare una cuenta...", "group_id": 12398, "id": 2743969}]