[{"user_id": 11626, "stars": [], "topic_id": 42850, "date_created": 1311831220.6697819, "message": "Welcome to SCMLA's CyberWar Wednesday!\r\n\r\nScotland Yard: We've arrested LulzSec spokesman\r\nAssociated Press\r\nJuly 27, 2011\r\n\r\nLONDON (AP) -- Scotland Yard's cybercrime unit on Wednesday arrested a teenager it accuses of working as the spokesman for the Lulz Security hacking collective, the force said in a statement. Scotland Yard said its Central e-Crime Unit arrested a 19-year-old at an address in Scotland's remote Shetland Islands. His name wasn't released, but the force said he used the online nickname \"Topiary.\" LulzSec, an offshoot of the amorphous hacking collective known as Anonymous, has claimed responsibility for a series of hacking attacks on both sides of the Atlantic. In interviews with media organizations including The Associated Press, Topiary described himself as one of LulzSec's six members. Topiary's once-plentiful Twitter feed was practically wiped clean Wednesday. The only remaining post, from nearly a week ago, read: \"You cannot arrest an idea.\"\r\nhttp://hosted.ap.org/dynamic/stories/E/EU_BRITAIN_LULZSEC?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2011-07-27-12-51-19\r\n\r\nAnonymous forces Cyber Tsar to resign\r\nRussia Today\r\nJuly 26, 2011\r\n\r\nIf your position at Homeland Security requires you to keep cyber attacks at a minimum, you might not have been doing your job justice as of late. It’s no surprise then that Randy Vickers, director of the US computer emergency readiness team (CERT), resigned on Friday. Vickers unexpected stepping-down comes after a slew of cyber crimes targeted some of the biggest — and presumably impenetrable — computer networks of the US government. In only the last few months, hacktivists collectives Anonymous and LulzSec have taken credit for attacking the websites for the CIA, Senate and FBI, among others.\r\nhttp://rt.com/usa/news/anonymous-cyber-resign-director\r\n\r\nHead of U.S. cyber agency resigns suddenly\r\nReuters\r\nJul 25, 2011\r\n\r\n(Reuters) - The head of a U.S. agency that helps respond to cyber attacks resigned suddenly after several high-profile attacks on government computer systems but the Department of Homeland Security declined Monday to comment on the reason. Randy Vickers resigned as director of the U.S. Computer Emergency Readiness Team Friday, according to an email from Roberta Stempfley, acting assistant secretary for cyber security and communications at Homeland Security, which was sent to some employees. The email, obtained by Reuters, did not disclose any reason for the resignation, and a Homeland Security official would only say: \"we aren't commenting on personnel matters.\" Vickers' resignation follows several high-profile hacker attacks against the Pentagon and public websites of the Central Intelligence Agency and U.S. Senate. Lee Rock, who was deputy director, will serve as acting director until a new head of the agency is named. The email from Stempfley said, \"we are confident that our organization will continue its strong performance under his leadership.\"\r\nhttp://www.reuters.com/article/2011/07/25/us-usa-security-cyber-idUSTRE76O5RH20110725\r\n\r\nCybercrime expert is victim of hostage hoax in NJ\r\nAssociated Press\r\nJuly 25, 2011\r\n\r\nNEWARK, N.J. (AP) — Authorities on Monday sought a man responsible for calling in a fake hostage report that targeted a well-known Internet security expert and encumbered about 30 police officers and SWAT team members for three hours over the weekend. The caller claimed to be in a house in Wyckoff, a suburb about 15 miles west of New York City, belonging to Parry Aftab, a lawyer specializing in Internet privacy and security and a frequent media commentator. The man said he was armed and had two hostages. Police and SWAT team members surrounded the home for about three hours Saturday and eventually shot tear gas canisters inside, but found only Aftab's cat inside.\r\nhttp://news.yahoo.com/cybercrime-expert-victim-hostage-hoax-nj-180439503.html\r\n\r\nHackers steal data from Austria TV fee collector\r\nAssociated Press\r\nJuly 25, 2011\r\n\r\nVIENNA (AP) — The Austrian authority that collects state television fees from customers says hackers have stolen 214,000 data files from its server, including 96,000 containing sensitive bank account information. GIS says the cyberattack by a group identifying itself as \"AustrAnon\" occurred Friday. It said Monday that it has started informing customers whose data has been stolen and is taking steps to improve security. Austrian state television is partially funded by viewers' fees. The culprits are believed to be linked to the loosely knit hacker group \"Anonymous,\" known for cyberattacks worldwide.\r\nhttp://news.yahoo.com/hackers-steal-data-austria-tv-fee-collector-130757571.html\r\n\r\nInvestigators Say China Was Behind The ‘Very Major’ IMF Hack Attack\r\nBusiness Insider\r\nJuly 23, 2011\r\n\r\nWhen the IMF was breached in a very major hacking attack last month, sources said that the attack was suspected to be related to a foreign government. Take one guess who it could be. Correct! Chinese cyber spies — like those who hacked Google and the Pentagon — were behind the IMF attack, sources close to the investigation tell Bloomberg. Evidence pointing to China includes an analysis of the attack methods, as well as the electronic trail left by hackers as they removed large quantities of documents from the IMF’s computers. The multistaged attack, which used U.S.-based servers as part of their equipment, ended on May 31, people involved in the investigation said on the condition they not be identified because they aren’t authorized to speak about it.\r\nhttp://www.businessinsider.com/china-imf-hack-2011-7\r\n\r\nAnonymous, LulzSec: 'Your threats to arrest us are meaningless'\r\nWashington Post\r\nJuly 22, 2011\r\n\r\nAnonymous and LulzSec released a joint statement responding to the FBI on Thursday morning, defending their practices and insisting that their hacks will effect social change. The groups said that they are executing their attacks because governments are lying to their people and conspiring with corporations and lobbyists. \"These governments and corporations are our enemy,\" the statement said. \"And we will continue to fight them, with all methods we have at our disposal, and that certainly includes breaking into their websites and exposing their lies.\"\r\nhttp://www.washingtonpost.com/blogs/faster-forward/post/anonymous-lulzsec-your-threats-to-arrest-us-are-meaningless/2011/07/21/gIQAuU8mRI_blog.html\r\n\r\n4 Dutch men suspected of hacking attacks released\r\nAssociated Press\r\nJuly 22, 2011\r\n\r\nAMSTERDAM (AP) — National prosecutors say four Dutch hackers arrested on suspicion of involvement in cyber attacks have been released. Prosecutors say the four men, who have only been identified by their ages, cities of residence, and hacker nicknames, have confessed to infiltrating websites and publishing confidential information. They were arrested Tuesday as part of an international sweep in coordination with U.S. and British authorities against the loosely knit hacker group known as \"Anonymous.\" The Dutch suspects are thought to belong to a splinter group called AntiSec NL. In a statement Friday the national prosecutor's office said the investigation is the case is ongoing and it is not certain what charges they will face.\r\nhttp://news.yahoo.com/4-dutch-men-suspected-hacking-attacks-released-154911539.html\r\n\r\nHackers to FBI: 'We are not scared anymore'\r\nMSNBC\r\nJuly 21, 2011\r\n\r\nHacker groups Anonymous and LulzSec, which had 16 of their alleged members arrested this week in the U.S. by the FBI, don't usually respond to statements written or made about them. But when the FBI's deputy assistant director gave an interview to NPR saying those arrests send \"a message that chaos on the Internet is unacceptable,\" the hacking collective erupted, with a statement of its own: \"We are not scared any more. Your threats to arrest us are meaningless to us as you cannot arrest an idea. Any attempt to do so will make your citizens more angry until they will roar in one gigantic choir. It is our mission to help these people and there is nothing — absolutely nothing — you can possibly to do make us stop.\" In the NPR interview that aired Wednesday, Steven Chabinsky, of the FBI said that even if \"hackers can be believed to have social causes, it's entirely unacceptable to break into websites and commit unlawful acts.\"\r\nhttp://technolog.msnbc.msn.com/_news/2011/07/21/7133871-hackers-to-fbi-we-are-not-scared-anymore\r\n\r\nNATO hacked by Anonymous\r\nRussia Today\r\nJuly 21, 2011\r\n\r\nComputer hackers working for the activism collective Anonymous announced today that NATO has been the victim of their latest Internet crime. In a tweet today from the hacktivist group responsible for such high-profile infiltrations as ones perpetrated again Mastercard, Visa and PayPal in the past, Anonymous announced that, “Yes, we haz [sic] more of your delicious data.” Anonymous doesn’t intend on disclosing all of what they’ve lifted from NATO servers, however — that, says the group, would be “irresponsible.” So far they have only released a single PDF file of a document headed with the message “NATO Restricted” dated to August of 2007. The group has hinted that some of the info will be leaked in the days to come. The group notes that they have obtained roughly 1 GB of computer data.\r\nhttp://rt.com/usa/news/nato-anonymous-today-hackers\r\n\r\nHuge Trove of Academic Docs Posted Online in Response to Activist Arrest\r\nWired,com\r\nJuly 21, 2011\r\n\r\nJust two days after activist hacker Aaron Swartz was charged with hacking for downloading too many academic articles, a giant collection of articles from the same service has been posted to the notorious file sharing search engine, The Pirate Bay. The documents are allegedly 18,952 scientific articles from the Philosophical Transactions of the Royal Society that were downloaded at some point from the scholarly archive service JSTOR. JSTOR is the same service that Swartz is accused of stealing from for downloading 4 million articles via a guest account at MIT. But according to the note accompanying the huge download, these are not the files that Swartz is accused of downloading (and returning). Instead, the manifesto says the documents came from another source, and the manifesto is signed by a person identifying himself as Greg Maxwell. The manifesto says the documents date back before 1923, making them public domain — though that contention might not be the case, given the difference between U.S. and U.K. copyright laws.\r\nhttp://www.wired.com/threatlevel/2011/07/science-pirate-bay/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+wired27b+%28Blog+-+27B+Stroke+6+%28Threat+Level%29%29\r\n\r\nIsrael Hires Internet Soldiers to Penetrate American Forums, Chatrooms\r\nDeadline Live\r\nJuly 20, 2011\r\n\r\nFile under “cat out of the bag.” “Israel hires Internet soldiers,” Israeli students and demobilized soldiers get paid to pretend they are just regular folks and leave pro-Israel comments online. Israeli Foreign Ministry Deputy Elan Shturman is quoted from the Israeli Occupation Magazine saying: Quote: “Our people will not say: ‘Hello, I am from the hasbara department of the Israeli foreign ministry and I want to tell you the following.’ Nor will they necessarily identify themselves as Israelis,” he said. “They will speak as net-surfers and as citizens, and will write responses that will look personal but will be based on a prepared list of messages that the foreign ministry developed.” Counterpunch’s Jonathan Cooke in “Israel’s Internet Wars” describes: Quote: a special undercover team of paid workers whose job it will be to surf the internet 24 hours a day spreading positive news about Israel. Internet-savvy Israeli youngsters, mainly recent graduates and demobilised soldiers with language skills, are being recruited to pose as ordinary surfers while they provide the government’s line on the Middle East conflict…About $150,000 has been set aside for the first stage of development, with increased funding expected next year. Occupation Magazine states in “The Foreign Ministry presents: talkbackers in the service of the State”: Quote: “paid Internet talkbackers are being mobilized in the service of the State. The Foreign Ministry is in the process of setting up a team of students and demobilized soldiers who will work around the clock writing pro-Israeli responses on Internet websites all over the world,” The team will fall under the authority of a large department already dealing with what Israelis term “hasbara”, officially translated as “public explanation” but more usually meaning propaganda.\r\nhttp://deadlinelive.info/2011/07/22/israel-hires-internet-soldiers-to-penetrate-american-forums-chatrooms", "group_id": 3920, "id": 1736839}]