[{"user_id": 33982, "stars": [], "topic_id": 36414, "date_created": 1306145548.7282629, "message": "Bit of a poll, how is your development server set up on osx? XAMPP? MAMP? Homebrew/Macports? OSX's Apache/PHP", "group_id": 499, "id": 1150928}, {"user_id": 4149, "stars": [{"date_created": 1306158602.3609619, "user_id": 1881}], "topic_id": 36414, "date_created": 1306155459.5096929, "message": "It should be exactly how your web servers are setup, I would use nginx", "group_id": 499, "id": 1151863}, {"user_id": 3444, "stars": [], "topic_id": 36414, "date_created": 1306156588.7300799, "message": "@firebathero Never used OSX for dev, but on Windows I use WAMP. I tried the windows version of XAMPP, but WAMP seemed to function a little better. Another thing I've done is set up an Ubuntu Server VM on my machine, then link a folder from OSX into the VM's web root.", "group_id": 499, "id": 1152090}, {"user_id": 1881, "stars": [], "topic_id": 36414, "date_created": 1306158693.1447749, "message": "I use Vagrant or a virtual machine with image of production server. As for package manager, I've been pretty happy with Homebrew.", "group_id": 499, "id": 1152486}, {"user_id": 3444, "stars": [], "topic_id": 36414, "date_created": 1306166508.185003, "message": "@italiano40 You know, I'm a fan of OSX, but I just don't have the money to shell out for a powerbook. I'd rather stick with Ubuntu on a PC (every bit as good as OSX IMO), but sometimes you just have to use windows as work. I actually just landed a new job building sites using ASP.Net(C#), so while I would rather be doing PHP, Ruby, Python, etc, I do what pays the bills.", "group_id": 499, "id": 1154147}, {"user_id": 4149, "stars": [], "topic_id": 36414, "date_created": 1306165842.6800461, "message": "@CrowderSoup do you know that OSX is becoming developers number one operating system if you saw the tech crunch hackaton, only a handful of pc's were there so OSX is becoming really strong in dev, thanks to the intel core processor", "group_id": 499, "id": 1154056}, {"user_id": 8637, "stars": [], "topic_id": 36414, "date_created": 1313274782.7942691, "message": "I use crunchbang Linux all that stuff is just an apt-get away", "group_id": 499, "id": 1866086}, {"user_id": 22060, "stars": [], "topic_id": 36414, "date_created": 1313535071.4461961, "message": "MAMP Pro does pretty much everything i need it to do and it crazy simple to get working", "group_id": 499, "id": 1887126}]