[{"user_id": 25716, "stars": [], "topic_id": 16741, "date_created": 1301679172.516166, "message": "Just want to know the reasons you have started a business. And a bit related, what was the most difficult thing that you had to overcome (can be before the start of the business, during the business, I just want to figure out what experience people had) :)", "group_id": 250, "id": 503732}, {"user_id": 21620, "stars": [], "topic_id": 16741, "date_created": 1301686949.3083391, "message": "I started a business for multiple reasons.  (1) Control.  I get to work on things that interest me.  No managers, VPs, CEOs to hold me back. (2) Money (3) Too many good opportunities out there (mobile, social, web).  Probably the most difficult thing to overcome was getting started.  There are questions that enter your mind like: Can I make money? Am I good enough to succeed?  What happens if I fail?  If a person is considering starting a business, they should spend some time seriously thinking about it.  Everyone has a different financial situation, family situation, skill set, timeline, etc.  And most businesses fail, so I think people should have a backup plan if that happens (e.g. try for 2 years, and find a regular day job if it doesn't work out)", "group_id": 250, "id": 504991}, {"user_id": 25716, "stars": [], "topic_id": 16741, "date_created": 1301687239.7793181, "message": "@jumpshot23 and I agree, risk management is something everyone should understand, of their own life and of their business. What is the current worst case scenario? What can you do to make it less difficult?", "group_id": 250, "id": 505031}, {"user_id": 25716, "stars": [], "topic_id": 16741, "date_created": 1301687156.9300931, "message": "@jumpshot23 nice, thanks for sharing :) let me shortly make my contribution as well. Reason was simply freedom. Freedom from money I need, freedom from work I don't like, freedom to live anywhere I want to. The most difficult thing I had to overcome yet was to really jump into that place where I completely give up my false sense of security and only have a choice to fight or to die. After a year of very hard living, I finally begin to taste the fruit and it has been all worth it. Never been more happy  :)", "group_id": 250, "id": 505020}]