[{"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1308635111.8740039, "message": "The Shinji Mikami/ Suda 51 collaboration is out on Friday. Anyone else excited by an eccentric Suda 51 game that plays like a game by Mikami - ie will actually be fun to play unlike anything else Suda 51 has done?", "group_id": 9493, "id": 1445984}, {"user_id": 32692, "stars": [], "topic_id": 39948, "date_created": 1308674309.171711, "message": "YES. You couldn't have said it better. Suda 51 takes care of the weirdness, and Shinji Mikami makes sure it's actually fun to play. Too bad it's going to be a commercial disaster, despite being the closest thing we'll get to a new Resident Evil this year.", "group_id": 9493, "id": 1449836}, {"user_id": 31866, "stars": [], "topic_id": 39948, "date_created": 1308806192.9882841, "message": "Really want to get this asap but my backlog is already a few titles deep. However, it's nice to see that Mikami has learned something from Dead Space this time around, you can now move AND shoot at the same time! Looks like a trippy ride, can't wait!", "group_id": 9493, "id": 1463799}, {"user_id": 32692, "stars": [], "topic_id": 39948, "date_created": 1308819941.9524939, "message": "Hey, he did Vanquish, where you could do a lot more than just \"move\" and shoot. :)", "group_id": 9493, "id": 1464637}, {"user_id": 31866, "stars": [], "topic_id": 39948, "date_created": 1308842856.508503, "message": "Ah, forgot about Vanquish (HOLY CRAP, I forgot about Vanquish! Didn't I want to play that like at launch already...? GAH!)", "group_id": 9493, "id": 1467077}, {"user_id": 31927, "stars": [], "topic_id": 39948, "date_created": 1308856839.0660939, "message": "Dude.  It's like only one of the best action games.  EVER.", "group_id": 9493, "id": 1469770}, {"user_id": 33318, "stars": [], "topic_id": 39948, "date_created": 1308923265.230768, "message": "Jevous, if I could slap you from here I would. *SLAP* *BACKHAND SLAP*", "group_id": 9493, "id": 1476394}, {"user_id": 31866, "stars": [], "topic_id": 39948, "date_created": 1308933702.0911729, "message": "Having not yet played it is punishment enough thank you!", "group_id": 9493, "id": 1477813}, {"user_id": 32057, "stars": [], "topic_id": 39948, "date_created": 1309029584.4543331, "message": "It will only truly feel like punishment once you do play it, then see what you have missed.", "group_id": 9493, "id": 1485307}, {"user_id": 32692, "stars": [], "topic_id": 39948, "date_created": 1309034969.0757439, "message": "Shadows of the Damned is totally making up for Blue Dragon -- the last time a Japanese dream team got my hopes up.", "group_id": 9493, "id": 1485641}, {"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1309126529.514956, "message": "Dick jokes seem to be spreading like herpes in the gaming industry . Still, I'm really enjoying this game as an example of retro done right. The shooting mechanics are nice and tight, and the visual design is wonderfully weird. Although it has some similarities with Duke Nukem Forever (rude humour, gameplay design that is a throwback to seven years earlier), it works so much better. It comes across as goofily good-natured and silly rather than stupid and rampantly offensive. That is quite an accomplishment for a game that seems to think the mere mention of the words 'boner', 'big boner'; and 'johnson' should leave you doubled over with laughter. And there are some neat little surprises around halfway through.", "group_id": 9493, "id": 1491342}, {"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1309126613.4157741, "message": "It is really a low-rent version of Resident Evil 4. It's not as polished as some of Mikami's stuff and it needs to be relished in the way you'd dig a Robert Rodriguez or John Carpenter film. It's gourmet hamburger.", "group_id": 9493, "id": 1491348}, {"user_id": 33318, "stars": [], "topic_id": 39948, "date_created": 1309127854.997561, "message": "Retro done right? Now I will have to get it.", "group_id": 9493, "id": 1491391}, {"user_id": 32692, "stars": [], "topic_id": 39948, "date_created": 1309130491.8484919, "message": "Sounds like Lance and I are on the same page about this. The goofy presentation is great, and it's clearly a Mikami game in the way the reliable combat mechanics, challenging boss fights and pressurized encounters come together.\n\nI think the element of darkness -- which is somewhat reminiscent of Alan Wake's shooting -- is particularly well designed. It forces you to place yourself into danger and attempt to manage what could be a never-ending onslaught of monsters.", "group_id": 9493, "id": 1491515}, {"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1309778832.5523429, "message": "of the year, not tear. Sigh", "group_id": 9493, "id": 1559015}, {"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1309778436.515444, "message": "According to Digital Edge, the PS3 version has a bit of a visual edge over the 360 version, which is pretty rare for an Unreal Engine game.", "group_id": 9493, "id": 1558989}, {"user_id": 32282, "stars": [], "topic_id": 39948, "date_created": 1309778673.9094651, "message": "I'm on the last boss. Loved the way this game channels classic Capcom and Sega titles, as well as calling up the spirits of John Carpenter and Sam Raimi. It's one of those very unusual games that makes you love boss fights - seriously, why can't they all be this good? My only major gripe is that it needed slightly more enemy and weapon variety because my interest was starting to flag by the beginning of Act 5. Good B grade stuff. I wouldn't go as far as Mr GT who proclaims it his favourite game of the year (is that a swipe at the many disappointments of the first half ofthe year or an endorsement of SotD?), but it's certainly one of the enjoyable and fun titles of the tear.", "group_id": 9493, "id": 1559000}, {"user_id": 32692, "stars": [], "topic_id": 39948, "date_created": 1309782774.5081141, "message": "How amazing was the Evil Dead-themed act?\n\nAlso, yes, game of the year for me so far. I'll fight anyone.", "group_id": 9493, "id": 1559372}]