[{"user_id": 19948, "stars": [], "topic_id": 33959, "date_created": 1304660163.61973, "message": "I break my one frame into multiple windows (not in the window manager sense of the word window, but 'windows' in the emacs world)... but NEVER use multiple frames. Anybody use multiple frames? How, why?", "group_id": 83, "id": 938683}, {"user_id": 218, "stars": [], "topic_id": 33959, "date_created": 1304662211.0546651, "message": "I have used it here or there to have logically different buffers active on different desktops", "group_id": 83, "id": 938883}, {"user_id": 218, "stars": [], "topic_id": 33959, "date_created": 1304662225.5630119, "message": "ie: one frame with 10 channels of ERC, another frame split up into \"coding mode\"", "group_id": 83, "id": 938884}, {"user_id": 25106, "stars": [], "topic_id": 33959, "date_created": 1304724872.7172401, "message": "I do. I don't really know my rationale, it kind of just depends on my mood, I guess. I often go down to one window, so frames are a bit more permanent. I also use frames for both of the reasons Justin gave above.", "group_id": 83, "id": 947649}, {"user_id": 1994, "stars": [], "topic_id": 33959, "date_created": 1304732661.713177, "message": "I'll split a new frame out for an ERC buffer that I want to monitor passively, or a log file, or something else that I want to keep half hidden behind the one I'm working on. I have CMD-~ bound to cycle frames, so it's easy to manage them separately from windows.", "group_id": 83, "id": 948254}, {"user_id": 1994, "stars": [{"date_created": 1304739500.7078259, "user_id": 12404}], "topic_id": 33959, "date_created": 1304732705.7265539, "message": "I also have a function to make a small window (10 lines) pinned at the top as a dedicated window to a particular buffer, that I use when I want an ERC buffer always present in the current frame. Quite handy.", "group_id": 83, "id": 948259}, {"user_id": 12404, "stars": [], "topic_id": 33959, "date_created": 1304739640.8789239, "message": "@ivey that's a neat idea. lately I've been using one frame, but there's a few cases where being able to passively monitor would be cool. erc as you mentioned, tail -f etc.....", "group_id": 83, "id": 948625}, {"user_id": 6543, "stars": [], "topic_id": 33959, "date_created": 1305084633.4321489, "message": "i use multiple frames always.. no apparent reason, just started that way.. guess i learned ctrl-X-5 early", "group_id": 83, "id": 1000877}, {"user_id": 31771, "stars": [], "topic_id": 33959, "date_created": 1305291388.1678109, "message": "I usually use a few frames, when I want to be able to \"monitor\" the contents at a glance or group a set of tasks. Dedicated coding frame, identica-mode, jabber.el, Gnus, etc...", "group_id": 83, "id": 1040619}, {"user_id": 40095, "stars": [], "topic_id": 33959, "date_created": 1314059068.271517, "message": "It's nice to be able to view a lot of code at once on multiple monitors, as well. I have two monitors and I usually run with a frame on each monitor, split into two windows with ECB views on the left hand side of each frame.", "group_id": 83, "id": 1935495}]