[{"user_id": 2946, "stars": [], "topic_id": 48114, "date_created": 1322259290.129163, "message": "Interesante. Han habido otros intentos sin éxito para emular Yelp en México, pero estos parece que van en serio. Genial video de Grumo Media.", "group_id": 965, "id": 2640179}, {"user_id": 26088, "stars": [], "topic_id": 48114, "date_created": 1322271599.7136619, "message": ":) uhm", "group_id": 965, "id": 2641302}, {"user_id": 19720, "stars": [], "topic_id": 48114, "date_created": 1322342876.3784521, "message": "@sergioaromo sabes quién está detrás del proyecto? se ve interesante. \nEl mayor reto va a estar en generar una estrategia para adquirir usuarios y negocios... Me pregunto como le pensarán hacer.", "group_id": 965, "id": 2646493}, {"user_id": 19720, "stars": [], "topic_id": 48114, "date_created": 1322343407.9498551, "message": "otra apuesta interesante es www.appetit.com.mx, pero ellos se enfocaron en restaurantes, y son un para bb, iphone.", "group_id": 965, "id": 2646570}, {"user_id": 29866, "stars": [], "topic_id": 48114, "date_created": 1322380512.423806, "message": "Se ve muy interesante, esperemos que le vaya muy bien, hay varios actualmente que están en el mercado mexicano, pero ninguno ha logrado convencer....", "group_id": 965, "id": 2650234}, {"user_id": 43017, "stars": [], "topic_id": 48114, "date_created": 1322426982.5586059, "message": "@ruycer si el otro día conocí a los fundadores. Te interesa conocerlos?", "group_id": 965, "id": 2653711}, {"user_id": 43017, "stars": [], "topic_id": 48114, "date_created": 1322427001.426666, "message": "@ruycer si el otro día conocí a los fundadores. Te interesa conocerlos?", "group_id": 965, "id": 2653714}, {"user_id": 30773, "stars": [{"date_created": 1322505516.8039119, "user_id": 26088}], "topic_id": 48114, "date_created": 1322498652.3313971, "message": "Se ve muy bien el sitio, se nota que le están echando ganas, muy bien por ellos... aunque, no quiero sonar pesimista pero es muy difícil tener éxito en el área de reviews (mas en México) y opiniones en internet y existen varios factores en ello. He realizado extensa investigación en esta área (mas orientado a minería de datos en reviews) y la verdad es que los reviews no reflejan la calidad de productos/servicios por su distribución bimodal, aunque el principal problema es que no hay un incentivo directo para el usuario en dar reviews, y el solo hecho de decirle que si da reviews a los productos/servicios le va a ayudar a encontrar (después de un tiempo, que mas usuarios den reviews) los mejores sitios de su localidad no es un buen alentador (o al menos el usuario no lo percibe)... como ven, es complicado.", "group_id": 965, "id": 2659232}, {"user_id": 19720, "stars": [], "topic_id": 48114, "date_created": 1322506028.9799881, "message": "@edgarRd entonces crees que los sitios que curan la información puden dar mejor resultado? O sea, según tu opinión, en México es mejor constriur un www.zagat.com que un www.yelp.com?", "group_id": 965, "id": 2659958}, {"user_id": 19720, "stars": [], "topic_id": 48114, "date_created": 1322506117.8686831, "message": "De cualquier manera creo que algo que le da valor al usuario Mexicano es tener un directorio de lugares locales. En mi experiencia como usuario de restaurantes, hay un directorio mas o menos completo. Ahora, que hacer de eso un negocio... quien sabe.", "group_id": 965, "id": 2659969}, {"user_id": 30773, "stars": [{"date_created": 1322841855.5427811, "user_id": 29866}], "topic_id": 48114, "date_created": 1322538389.886874, "message": "En cuanto a la limitante de que los usuarios no perciben el beneficio directo de dar un review, creo que es cuestión de que tan inmersa esta la tecnología en el uso diario de las personas (todas, no solo early adopters, o jovenes techies), solo basta con ver el numero de extensos reviews que dan los usuarios en Yelp en ciudades como San Francisco, NYC, Chicago, etc. Aún y con las limitantes espero que vaya muy bien yoin.mx, se ve que estan haciendo un trabajo muy bueno y sin duda un directorio de lugares locales ayuda ya bastante.", "group_id": 965, "id": 2663095}, {"user_id": 30773, "stars": [{"date_created": 1322600687.2400229, "user_id": 26088}], "topic_id": 48114, "date_created": 1322537966.3726349, "message": "@ruycer pues la verdad no se si de mejor resultado o no, pero lejos de representar la calidad de un producto/servicio (en México o en cualquier otro lado), los usuarios solo dan reviews si les fue muy bien o muy mal con algo, y para que puedas creer algo de un sitio de opiniones necesitas revisar varias entradas, la plataforma de reviews debe estar bien nutrida; no me sirve de mucho leer solo un review y ver que le ponen 5 estrellas o solo 1 cuando solo es la opinion de 1 o 3 personas (por decir un ejemplo obvio), de ahi el beneficio de la agregación de los datos cuando son muchos reviews, creo que en el área de reviews hay todavía mucho por innovar.", "group_id": 965, "id": 2663054}, {"user_id": 19720, "stars": [], "topic_id": 48114, "date_created": 1322545055.671432, "message": "@edgarrd eso me recuerda que una investigación académica (http://dl.acm.org/citation.cfm?id=1958877) dice que en China las comunidades virtuales no son realmente comunidades, sino mas bien la mayoría son lectores, y un grupo de escritores quienes tienen algún beneficio porque el sitio vaya bien. Posiblemente el hecho de que no tengamos un Yelp en México es porque no nos lo \"merezcamos\", de la misma manera que los pueblos tienen el gobierno que se merecen... just a thought.", "group_id": 965, "id": 2663725}]