[{"user_id": 38500, "stars": [], "topic_id": 44270, "date_created": 1313976311.3880069, "message": "In my novel, the IC takes the side of the MC in a council meeting (the MC is the head of the council). But the IC has put others up to posing the counter argument to the MC, while the IC pretends to agree with him. \n\nIn film, the fact that the IC is deceiving the MC can be communicated in countless ways. I'm wondering if there are any examples anyone can present of how this is communicated, or foreshadowed, in novels?", "group_id": 2515, "id": 1926001}, {"user_id": 38500, "stars": [], "topic_id": 44270, "date_created": 1313976750.655592, "message": "Don't understand why this topic got posted twice....", "group_id": 2515, "id": 1926078}, {"user_id": 7664, "stars": [], "topic_id": 44270, "date_created": 1313976800.560993, "message": "In a novel, can't the author just say it? \n\nI'm not sure I'm following you.", "group_id": 2515, "id": 1926083}, {"user_id": 36437, "stars": [], "topic_id": 44270, "date_created": 1313977734.744046, "message": "Do you mean a parting of the curtain, of sorts (for the reader)?", "group_id": 2515, "id": 1926244}, {"user_id": 39675, "stars": [], "topic_id": 44270, "date_created": 1313995291.7248499, "message": "What about Iago in Othello?", "group_id": 2515, "id": 1927945}, {"user_id": 39675, "stars": [], "topic_id": 44270, "date_created": 1313995478.82692, "message": "It is interesting that the audience enjoyment comes from Iago's revelations how he is deceiving Othello, as we progress through the play.", "group_id": 2515, "id": 1927952}, {"user_id": 39675, "stars": [], "topic_id": 44270, "date_created": 1313997169.6234119, "message": "In mysteries, there are hints of warnings from one person to another.  There could be a mini scene how the betraying IC treats an office worker, while smiling support to the MC in a regular drama novel.  The IC could have a reputation, but the MC trusts him because they are supposed to be friends.  The reputation could turn out to be true.  A character close to the MC could complain and/or be worried that the MC depends to much on the IC, leading to the audience feeling uneasy about the IC, as the story progresses.", "group_id": 2515, "id": 1928037}, {"user_id": 38500, "stars": [], "topic_id": 44270, "date_created": 1314010188.3961959, "message": "Lago is a good example, thanks.", "group_id": 2515, "id": 1928753}, {"user_id": 38500, "stars": [], "topic_id": 44270, "date_created": 1314055514.203202, "message": "I realize I wasn't clear in my original post -- no one knows that the IC has put the others up to taking up his argument, not even the reader. It comes out later, but I want to foreshadow that \"coming out\" effectively. I think Prish's ideas are good ones!", "group_id": 2515, "id": 1934952}]