[{"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311023801.5415421, "message": "Is there a question here?", "group_id": 2515, "id": 1666716}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311023858.989692, "message": "Yes there is!", "group_id": 2515, "id": 1666733}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311024103.268775, "message": "So I've been writing this road movie where the Main and Impact embark on a journey together. I'm not sure how to incorporate the overall story throughline since the story is mostly about the Main and Impact.", "group_id": 2515, "id": 1666762}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311025541.1361051, "message": "At the moment there aren't any OS characters. Only the Main and Impact and a couple of incidental characters who only serve to define the theme.", "group_id": 2515, "id": 1666921}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311023822.5751171, "message": "Hi everyone. I'm new here. Been stydying Dramatica for almost a year now and I'm completely in love with the theory. I've read the theory book four times from cover to cover and recently ordered Dramatica for Screenwriters by Armando Saldaña Mora.", "group_id": 2515, "id": 1666722}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311024195.9066491, "message": "At the moment, the Overall Story Throughline is Fixed Attitude. The Main Character throughline is Activity.", "group_id": 2515, "id": 1666766}, {"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311024850.633183, "message": "Are there any other characters involved?  What are they up to?  If you do not have an OS, you can create one and have it set as the background against which your MC and IC go on their road trip.  A Fixed Attitude OS deals with conflict arising from a clash of attitudes or beliefs -- WHAT people think (as opposed to how they think).", "group_id": 2515, "id": 1666832}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311027788.254066, "message": "Placing the OS in the backround is an option I've been thinking about, but I feel it makes the story seem incomplete if the SS gets too much screentime at the expense of the OS.", "group_id": 2515, "id": 1667147}, {"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311028711.795783, "message": "No, there are plenty of stories that emphasize throughlines other than the OS.  It will seem incomplete if you do not HAVE an OS.", "group_id": 2515, "id": 1667234}, {"user_id": 33839, "stars": [], "topic_id": 42234, "date_created": 1311028547.72001, "message": "I don't think too many road movies really are about the OS; it's just there as an excuse to get the characters all into a car, train, plane (or all three if you're talking Planes, Trains and Automobiles) and deal with personal issues.  \n\nLittle Miss Sunshine, for example, has an OS re: Olive's beauty pageant.  But really, how much time is devoted to it, save the final act perhaps?  Same with National Lampoon's Vacation.  Road movies are always about the journey, not the destination.", "group_id": 2515, "id": 1667226}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311028897.5224421, "message": "Isn't Little Miss Sunshine pretty much all about the OS? I mean, there's no Main or Impact characters. They are all OS characters, and Olive's beauty pageant is the reason for the journey.", "group_id": 2515, "id": 1667242}, {"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311029052.9220631, "message": "No, there are plenty of stories that emphasize throughlines other than the OS.  It will seem incomplete if you do not HAVE an OS.", "group_id": 2515, "id": 1667249}, {"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311029166.529979, "message": "I don't know why that repeated.  I did not type it again.  Sorry.", "group_id": 2515, "id": 1667260}, {"user_id": 10814, "stars": [], "topic_id": 42234, "date_created": 1311029217.232456, "message": "I do not recall Little Miss Sunshine very well, except the songs.  I haven't seen it since around 1970.", "group_id": 2515, "id": 1667265}, {"user_id": 33839, "stars": [], "topic_id": 42234, "date_created": 1311029997.177664, "message": "@Ville No, I would say each character has their own mini story - it may not be complete in a Dramatica sense, but each has their own goal separate from Olive's.  The Father to sell his book.  The son wants to be a fighter pilot.  The Uncle to be the #1 Proust scholar.  Grandpa just wants to get high.  They all experience failure, but in the end gain something greater - an appreciation for one another as a family and in a way, not quitting.  \n\nAll of their little foibles are dealt with through the course of the trip, but their individual throughlines culminate in the bonding they experience on stage - at least that's how I would (loosely) interpret how their (somewhat) SS lines connect with the OS.", "group_id": 2515, "id": 1667324}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311031876.547364, "message": "@Ville Why do they get in the car? I bet 9 to 1 that's your OS.", "group_id": 2515, "id": 1667498}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311103971.175415, "message": "@MikeDerk I don't see how the road trip could be the OS since it's only the Main and Impact who get in the car and it's really only between the two of them. But I see your point. It definitely could be the OS. In Finding Nemo, for example, the journey through the sea is the OS. But is that kind of setup possible when the OS is Fixed attitude? In my story, it's only the Main character who's actively involved in the journey, and he takes the Impact with him.", "group_id": 2515, "id": 1674728}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311112279.5065739, "message": "That's actually not what I was saying. What I was saying was: what motivates the people to get into the car? (Not actually what happens in the car.)", "group_id": 2515, "id": 1675971}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311112708.2978549, "message": "That said, I'm going to retract a bit. I think why the MC gets into the car could also be his/her throughline.\n\nIn \"The Sure Thing\" -- the OS (I'm guessing) involves getting a guy to california to get laid. \nIn \"Road Trip\" 4 friends hop in a car to get a sex tape accidentally mailed to a girlfriend. That's the OS. (I haven't seen the movie in forever, so maybe it's the MC's deal, but I don't think so.)\n\nSo, how could a Fixed Attitude be ... a bunch of [persecuted race/religion] wake up 2,000 miles inside a country that hates them, and they have to get out. Their problems are going to come from this Fixed Attitude -- \"how do we get gas from someone who is going to report us?\", etc.", "group_id": 2515, "id": 1676000}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311112794.159755, "message": "What is the Situation that your MC and IC come to conflict over? They're stuck in the car? They have only one eye between them that they have to share? (What, Gorgons don't deserve their own movies?) They have the same girlfriend they are going to woo?", "group_id": 2515, "id": 1676015}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311183422.5427101, "message": "@MikeDerk  You might be on to something. Now that I think about it, the motivation for them to get in the car has a lot to do with Fixed attitude.", "group_id": 2515, "id": 1682820}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311184827.455687, "message": "I'm not very far in building the Storyfrom, but what I do know for sure is that the MC is a Do-er and the Growth is most likely Start. I want the OS be either one of the internal domains since the theme has more to do with the internal workings of the human mind than external problems. No alien invaders or mustached villains to defeat. I chose Fixed attitude because Situation makes more sense as the SS than Activity. The Situation the MC and IC come to conflict over has something to do with their health.", "group_id": 2515, "id": 1683040}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311187196.0359371, "message": "Can you list the story threads in your story? It's how they start the podcasts, and a good way to get started on your own work.", "group_id": 2515, "id": 1683399}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311426923.0166619, "message": "@MikeDerk What are story threads? Never heard of them.", "group_id": 2515, "id": 1705621}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311437032.8786781, "message": "@Ville A story thread -- that's not a technical term, or dramatica term, btw -- is just one of the things that goes on in a story.\n\nIn Back to the Future, you could say that Marty \"accidentally goes to the past, and has to figure out how to get back to the present.\"\n\nHis mother goes from \"has a crush on  Marty to falls in love with McFly\"\n\nThe principal -- we see him bald in both time periods -- doesn't have a story thread.\n\nSo, in a road movie, it would be:\n1. Why are the on the road.\n2. What are each of the characters going through\netc...", "group_id": 2515, "id": 1706022}, {"user_id": 38285, "stars": [], "topic_id": 42234, "date_created": 1311864862.6138971, "message": "@MikeDerk Sry. I'm not comfortable with sharing details of the storytelling. Then again, I'm not very far in the story, so I wouldn't have a clear-cut answer to your question.", "group_id": 2515, "id": 1739700}, {"user_id": 7664, "stars": [], "topic_id": 42234, "date_created": 1311868133.2836399, "message": "Sorry, I didn't mean \"can you list them for us.\" I meant, can you actually do it for yourself? Because it's a good way to get clear on things.", "group_id": 2515, "id": 1740155}]