[{"user_id": 13453, "stars": [], "topic_id": 9685, "date_created": 1298980940.7384269, "message": "Líder: @accionsocialweb - @nicogalarza\nObjetivos: Movilizar a los colombianos para generar prosperidad social y avanzar en la reconciliación.\nActividades: Crowdsourcing de acciones puntuales de los colombianos para superar la pobreza extrema (accionsocial.ideascale.com y twitter).\nLanzamiento del Escuadrón con Diegos Molanos.\nEncuentro físico con participantes del escuadrón y sus líderes.\nInvitar a los brigadistas más movidos a ‘Cogestor por un día’ de la Red Juntos, para que conozcan de primera mano el trabajo de Acción Social.\nInvitar a brigadistas destacados del Escuadrón a publicar una nota en: \n    http://www.colombiaenaccion.gov.co \nEnlace MinTic - ViveDigital: Claudia Berbeo.", "group_id": 2696, "id": 233975}, {"user_id": 16645, "stars": [], "topic_id": 9685, "date_created": 1298984815.1070919, "message": "me gustria participar desde la prespectiva dle rpograma de transformacion productiva en el tema turismo de salud", "group_id": 2696, "id": 234228}, {"user_id": 18755, "stars": [], "topic_id": 9685, "date_created": 1299277256.495676, "message": "Hola! Mi nombre es Nicolás Martín, y hago parte de este escuadrón con @nicogalarza, @rosacris y @claudiaberbeo. Como cuenta @rosacris, queremos encontrar vías para que los ciudadanos contribuyamos a combatir la pobreza extrema.\nLa primera tarea es encontrar otras personas que tengan la misma pregunta para pensarla en conjunto, y articular acciones con la Agencia Presidencial para la Acción Social (http://www.accionsocial.gov.co). Una tarea sencilla para esto, además de dejar manifestar su interés aquí, es dejar las ideas que tengan en http://www.colombiaenaccion.gov.co/category/soluciona/.\nCon los más interesados, haremos una reunión presencial/virtual la semana entrante para empezar a pasar a la acción.", "group_id": 2696, "id": 273440}, {"user_id": 18755, "stars": [], "topic_id": 9685, "date_created": 1299278800.526819, "message": "El plan inicial: http://bit.ly/fumvhm", "group_id": 2696, "id": 273623}, {"user_id": 18920, "stars": [], "topic_id": 9685, "date_created": 1299327142.8575621, "message": "Para poner un granito de arena, estamos trabajando en la conformacion de voluntarios jovenes formandolos en Clown , en Equinoterapia, Hidroterapia y poder tener cobertura asistencial en mas regiones, los invito a participar.", "group_id": 2696, "id": 276132}, {"user_id": 18920, "stars": [], "topic_id": 9685, "date_created": 1299327006.6660399, "message": "Un saludo, soy Colombiana viví en Pompano Bech Fl. USA y regrese a Colombia hace 6 años, Terapeuta Física, interesada en cambiar un poco la Rehabilitación de personas con discapacidad funde Corpoalegria; organización sin animo de lucro que traba por la Rehabilitación Integral  de personas con discapacidad y poblacion vulnerable, comparto este linck,  http://www.youtube.com/watch?v=B29jTFjymaw estoy en Bgota para", "group_id": 2696, "id": 276125}, {"user_id": 18920, "stars": [], "topic_id": 9685, "date_created": 1299327532.1820359, "message": "Corpoalegria tiene un programa en Turismo accesible y salud http://turismocolombiabogota.blogspot.com/ donde Colombianos y extranjeros nos contactan para ayudarlos en conseguir contacto con médicos, cirugías,  rehabilitación, recorridos históricos, recreación  para personas con discapacidad , para personas que necesitan rehabilitación, adulto mayor y jóvenes que quieren venir a Colombia a  hacer voluntariado. Estamos para servir . contacto: corpoalegria@corpoalegria.org Jeannette Rosas R. Cel. 3102900412", "group_id": 2696, "id": 276139}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1299957715.7861891, "message": "Hola! Estuve conversando con varias personas, recogiendo ideas y bueno... la gran mayoría opina que  lo que se debe hacer es educar. Y también, hay ideas concretas , más especificas y por eso me gustaría saber de qué manera nosotros trabajaríamos con esto.", "group_id": 2696, "id": 335326}, {"user_id": 17223, "stars": [], "topic_id": 9685, "date_created": 1300157081.4207661, "message": "Hola chicos!! andaba desconectada de por acá por cuestiones académicas... les cuento pues que cuentan conmigo en este escuadron, tengo ya alguito de experiencia trabajando en este tema, ya que hago parte de una fundación que trabaja con personas que viven con el virus del VIH estando en fase SIDA o no que pertenecen a estratos 1,2 y 3 e incluso con algunos que no tienen absolutamente nada,  actualmente se está trabajando mucho con la niñez, hijos de personas con el virus o niños a los que les fue trasmitido verticalmente (Madre - hijo), adicionalmente trabajando y enfatizando mucho en la adherencia a su tratamiento, con estas personas es sumamente importante por su situación socio- económica, que el trabajo sea educativo, hacer algunas jornadas de capacitación puede ser en competencias, para que puedan llevar a cabo actividades que les generen ingresos posteriormente.", "group_id": 2696, "id": 352972}, {"user_id": 16229, "stars": [], "topic_id": 9685, "date_created": 1300157117.366082, "message": "@jrojasmayorga hola, de qué se trata el programa? Cuéntanos porfa un poco más!! Gracias.", "group_id": 2696, "id": 352977}, {"user_id": 17223, "stars": [], "topic_id": 9685, "date_created": 1300157152.1236441, "message": "En estos casos no es viable darles directamente la solución a su situacion de pobreza extrema porque el manejo luego es bastante complicado, ahi lo que hay que hacer es, educar, educar, educar..", "group_id": 2696, "id": 352978}, {"user_id": 13453, "stars": [], "topic_id": 9685, "date_created": 1300197452.4522309, "message": "Les recomiendo revisar: http://www.unidos.gov.co/que-es-el-foro-unidos.pdf y http://www.unidos.gov.co/plan-nacional-de-prosperidad.pdf - En especial en el primer documento la penúltima página donde están las dimensiones y los logros que se han identificado para el Plan Nacional de Prosperidad Social - PNPS", "group_id": 2696, "id": 356056}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1302107359.5778301, "message": "En que van con la info que nos pasarían  @accionsocialweb - @nicogalarza sobre contactos en Sincelejo?", "group_id": 2696, "id": 561234}, {"user_id": 13453, "stars": [], "topic_id": 9685, "date_created": 1302156321.560219, "message": "Orietta... está pendiente. Máximo al lunes ya tienen que estarse estableciendo contactos... estoy pendiente :)", "group_id": 2696, "id": 572245}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1302271880.5083909, "message": "Ok, graciass!! :)", "group_id": 2696, "id": 590276}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1302572884.9208059, "message": "Hola @Rosacris @nicogalarza.... cómo vamos con la info Sincelejo?", "group_id": 2696, "id": 634400}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1304822053.0285621, "message": "Hola chicos!! No son las  fotos más lindas que haya tomado, como podrían?  Pero, muestran la cruda realidad de  personas en  algunos barrios de Sincelejo y por las cuales me gustaría trabajar. Estas fotos fueron tomadas antes del inicio de la primera ola invernal y ya algunos barrios estaban  en medio de  aguas... no sé como estén ahora despues de tantas lluvias, me imagino que aún peor. En algunos sectores es casi imposible entrar :((   http://www.facebook.com/media/set/?set=a.1954205171426.114222.1131571640", "group_id": 2696, "id": 955767}, {"user_id": 26132, "stars": [], "topic_id": 9685, "date_created": 1304838873.213357, "message": "Hola les comparto a todos y a todas un video que hice titulado prosperidad para la educación, en el video describo la sinergia Universiad+Empresa+Gobierno. Les agradezco si lo pueden ver: http://www.youtube.com/watch?v=jFgh6LIOIyk", "group_id": 2696, "id": 956961}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1305165101.653851, "message": "Aunque aún no  ha sido posible el contacto con la persona de \"Unidos\" acá, les cuento que estoy adelantando un trabajo de sensibilización con la comunidad en general. Ya tengo muchísimas personas a las que les gustaría participar en  el piloto. Yo quiero q empecermos yaaaa :))", "group_id": 2696, "id": 1017274}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1306284102.21912, "message": "Hola!!! En qué vamos con este escuadrón? No  ha habido más reuniones ni información de nada :(", "group_id": 2696, "id": 1172319}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1306935647.5301411, "message": "Hola Buen Dia!! Al parecer sólo yo me comunico por acá :( @nicogalarza @rosacris .... en que vamos?", "group_id": 2696, "id": 1253138}, {"user_id": 37934, "stars": [], "topic_id": 9685, "date_created": 1310503197.4745481, "message": "Hola, un saludo para todos, listo y a la orden. Recibo comentarios.", "group_id": 2696, "id": 1622967}, {"user_id": 31085, "stars": [], "topic_id": 9685, "date_created": 1310584243.1345551, "message": "Pues yo estoy esperando algo desde hace 2 mese  :(", "group_id": 2696, "id": 1631017}, {"user_id": 18844, "stars": [], "topic_id": 9685, "date_created": 1313194930.3442349, "message": "toca reactivarlo!!!!", "group_id": 2696, "id": 1861118}, {"user_id": 18844, "stars": [{"date_created": 1315866204.2663491, "user_id": 18844}], "topic_id": 9685, "date_created": 1315866195.8266439, "message": "Hola! Les cuento q yo he avanzado con Sincelejo :) Ya tengo un listado considerable de voluntarios que están muy entusiasmados con la realización del piloto acá... Ya hice contacto con Zandra Muñoz de #Unidos y estuve visitando nuevamente unos barrios  de pobreza extrema y he tomado algunas fotos... Es increíble la necesidad de estas personas... Espero poder concretar en esta semana citas con la Academia y algunas instituciones así como con los comerciantes para hacer algo bien bonito. Les comparto estas fotos de la visita que hice con un grupo de #Unidos a Altos del Rosario, uno de los barrios seleccionados http://www.facebook.com/media/set/?set=a.2265173385437.128454.1131571640&type=1", "group_id": 2696, "id": 2112160}]