[{"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297288905.2345729, "message": "Actually looks like you guys are pretty well integrated with Facebook, so it might not be a bad option.", "group_id": 95, "id": 58448}, {"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297289039.2137311, "message": "@vicngtor I've bought some FB ads before, and believe it or not, people do click on them.", "group_id": 95, "id": 58543}, {"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297288880.108062, "message": "I bet Facebook will give you demographic targeting options that will suit your needs, but I'm not sure Facebook ads are necessarily the right platform for your product.", "group_id": 95, "id": 58434}, {"user_id": 1215, "stars": [], "topic_id": 2624, "date_created": 1297288701.7343941, "message": "I want to target mainly single females for this valentines. I thought about facebook and reddit but those are primarily geek subcultures. Where would you guys recommend? (Btw my site is adore.ly).", "group_id": 95, "id": 58340}, {"user_id": 1215, "stars": [], "topic_id": 2624, "date_created": 1297288994.1684549, "message": "yeah but seriously will you click on fb ads? I have *NEVER* ever seen anyone click on fb ads and I was wondering the effectiveness of that (even though it's pay per click).", "group_id": 95, "id": 58504}, {"user_id": 2111, "stars": [], "topic_id": 2624, "date_created": 1297289219.8162179, "message": "definitely reminds me of likealittle.com", "group_id": 95, "id": 58651}, {"user_id": 2111, "stars": [], "topic_id": 2624, "date_created": 1297289185.7153759, "message": "try spreading it to your college friends - i could see it catching on on campuses through word of mouth", "group_id": 95, "id": 58633}, {"user_id": 2111, "stars": [], "topic_id": 2624, "date_created": 1297292201.383553, "message": "at least for on campus i think theres overlap between groups. for example, people that live together in a dorm don't necessarily hangout with each other all the time. theres clubs and other organizations that they are a part of", "group_id": 95, "id": 59631}, {"user_id": 3122, "stars": [], "topic_id": 2624, "date_created": 1297290791.2895589, "message": "how are these things usually catch on on campus(es) anyways? - for ex like likealittle", "group_id": 95, "id": 59221}, {"user_id": 2449, "stars": [{"date_created": 1297290953.3307209, "user_id": 2449}], "topic_id": 2624, "date_created": 1297290943.197113, "message": "try http://hellbuzz.com ...ask people to \"like\" your site on FB", "group_id": 95, "id": 59274}, {"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297291035.180599, "message": "@johnnyk1988 I think it's because it's a group of people, all in close proximity, all loosely connected, etc.", "group_id": 95, "id": 59295}, {"user_id": 3122, "stars": [], "topic_id": 2624, "date_created": 1297291337.5359421, "message": "@ericflo i could have been unclear on the question, i meant how does these things usually catch on - even in colleges people are usually separated in groups. it seems like its quit hard to spread throughout a campus and maybe much harder outside their own campus? Do people usually get connections from other campuses to help out on the spread of word?", "group_id": 95, "id": 59377}, {"user_id": 3100, "stars": [{"date_created": 1297291154.584121, "user_id": 1}], "topic_id": 2624, "date_created": 1297291122.3977671, "message": "If you have a marketing budget I would look into a few advertising options on PlentyOfFish.com they have a fairly large community to market to dating wise.", "group_id": 95, "id": 59323}, {"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297291371.106703, "message": "@johnnyk1988 That's a good question, I'm not quite sure actually", "group_id": 95, "id": 59389}, {"user_id": 3353, "stars": [], "topic_id": 2624, "date_created": 1297293722.199913, "message": "@ericflo hey,  i been reading into CPC vs CPM. It seems like CPC is probably a better way. Do you have a recommandation on bid prices? Facebook seems to be recommending 0.75-1.12 USD for CPC, which seems crazy to me. I was thinking more of the 0.25/click range. You think that would greatly decrease the chance of the ad being shown comparing to other ads?", "group_id": 95, "id": 59986}, {"user_id": 1, "stars": [], "topic_id": 2624, "date_created": 1297294133.953985, "message": "@fjing28 It's been about a year since I did any advertising through FB, but it depended on the creative, sometimes .15 cpc was enough, but sometimes we had to go as high as .45.  Basically the tactic is lowball, and then creep it up until you get the volume you want.", "group_id": 95, "id": 60091}, {"user_id": 3367, "stars": [], "topic_id": 2624, "date_created": 1297295619.3692889, "message": "You try reddit ads yet?", "group_id": 95, "id": 60610}, {"user_id": 3800, "stars": [], "topic_id": 2624, "date_created": 1297298929.496594, "message": "@fjing28 No, start low, I've lowballed the \"estimate\" by quite some margin and always got impressions and clicks. You can increase it if you don't see a reaction. Also pick a striking image, I split tested about 10 and saw a HUGE difference in clickthrough changing only the picture.", "group_id": 95, "id": 61832}, {"user_id": 3800, "stars": [], "topic_id": 2624, "date_created": 1297299018.5753441, "message": "And try only targeting a very specific demographic (maybe only one university). The ads will often be a lot cheaper and you can tailor the copy to that audience, which will increase CTR.", "group_id": 95, "id": 61846}, {"user_id": 3353, "stars": [], "topic_id": 2624, "date_created": 1297303033.181191, "message": "@liamdon thank you. I will probably try that out.", "group_id": 95, "id": 62829}, {"user_id": 4580, "stars": [], "topic_id": 2624, "date_created": 1297312352.9615769, "message": "i've heard lots of anecdotal stories of affiliate marketers doing very well with facebook ads for dating sites", "group_id": 95, "id": 64725}]