[{"user_id": 2946, "stars": [], "topic_id": 16532, "date_created": 1301593868.0731499, "message": "Todo eso para decir que sí. Es jodidamente dificil.", "group_id": 965, "id": 494103}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301593852.8148501, "message": "Que una plataforma necesite de cursos para ser usada...creo que por ahí empezarón mal.", "group_id": 965, "id": 494102}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301592250.862252, "message": "Digo porque no se de una empresa que vaya en serio a competir con mercado libre, o conocen alguno que ya este creciendo?", "group_id": 965, "id": 493938}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301593284.8861711, "message": "Sabia que en MX salio un proyecto así? empezo en el DF y luego en Yucatán sacaron un clon bajo licencia .... pero no funciono, tenian mucho apoyo pero el sistema era complejo.", "group_id": 965, "id": 494060}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301593397.6542399, "message": "si ML tmb tiene subastas, yo creo eso especifico en parte es solo atención al cliente, que es nula en ML, o hacerlo automatizado pero eficientemente a mi parecer hay tantos clientes insatisfechos que ese mercado tan grande es extremadamente fragil tambien", "group_id": 965, "id": 494068}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301593606.2181599, "message": "@nekrox Es muy complicado registrarte. Supongo que también poner mis productos y venderlos. De ahí porque cite \"en 3 simples pasos\"", "group_id": 965, "id": 494082}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301592556.640094, "message": "@nekrox eso es lo que no hace mercado libre, no genera confianza y no cuida a sus clientes pero no hay otra cosa", "group_id": 965, "id": 493979}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301593027.725702, "message": "No creo que sea tan difícil(con esto me refiero a que tenemos el conociemiento y optencial) solo debemos pensar en como podemos hacer más fácil vender por internet. En US hay muchas tiendas en línea además de eBay y tienen éxito.", "group_id": 965, "id": 494030}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301593136.7950821, "message": "O enfocarse a algo especifico recuerden que ebay no es solo para vender igual es subasta.", "group_id": 965, "id": 494043}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301593252.5057161, "message": "y todos los productos meterlos en un directorio", "group_id": 965, "id": 494056}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301592313.2207029, "message": "A veces pienso caray mercado libre es una porqueria pero sigue creciendo, que seria muy facil hacerle competencia y pegarles en hacer bien todo lo que no hacen bien", "group_id": 965, "id": 493950}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301592466.3287899, "message": "@nekrox si eso si llevaria tiempo pero ojala alguien lo hiciera, siento es como un monopolio XD", "group_id": 965, "id": 493966}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301592931.3365331, "message": "Agree, lo que tambien no entiendo es porque ebay se molesta en mantener vivo ML tal como esta, no seria facil para ellos posicionarse en america latina tambien? seria muy bueno eso", "group_id": 965, "id": 494024}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301592419.9219041, "message": "Mercado libre es grande por que lleva muchos años. Imposible no es :) pero si creo que seria algo que llevara su tiempo.", "group_id": 965, "id": 493962}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301592482.6321061, "message": "No seria solo cuestión de hacer bien lo que mercado libre no hace si no posicionarte como marca sobre ellos, generar confianza a los clientes, etc.", "group_id": 965, "id": 493967}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301593492.417181, "message": "@nekrox a caray, cual es el clon? XD", "group_id": 965, "id": 494072}, {"user_id": 2946, "stars": [{"date_created": 1307594196.251524, "user_id": 12739}], "topic_id": 16532, "date_created": 1301593794.0934341, "message": "Pero no puede ser 10% o 20% mejor. Tiene que ser 200% mejor que lo que hay actualmente para que los usuarios hagan switch.", "group_id": 965, "id": 494099}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301593691.689188, "message": "Eip :P vendian eso de que era \"fácil\" pero no lo es, por eso fracaso. Apesar que el mismo gobierno les daba apoyos para que metieran gente comerciante local y les dieran cursos de como usar la plataforma.", "group_id": 965, "id": 494090}, {"user_id": 2946, "stars": [{"date_created": 1301618492.509315, "user_id": 10406}], "topic_id": 16532, "date_created": 1301593848.6924641, "message": "Y el modelo de marketplace es el mas dificil de todos, porque tienes que tener anunciantes y compradores. El Huevo y la Gallina.", "group_id": 965, "id": 494101}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301592516.2090981, "message": "Creo que ahí esta el punto dificil y no tanto por el lado tecnico/logistico.", "group_id": 965, "id": 493972}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301593236.795846, "message": "O porque no crear una manera para que los usuarios puedan tener su propie tienda en línea en 3 sencillos pasos?", "group_id": 965, "id": 494053}, {"user_id": 2946, "stars": [], "topic_id": 16532, "date_created": 1301593533.982543, "message": "De nuevo citando  a \"22 imutable laws of marketing\", el que llega primero a una categoría se queda ahí y es imposible ganarle. Lo que queda hacer en estos casos es crear una nueva categoría (como el iPhone creo una nueva categoría de telefonos) mejor y diferente que lo actual.", "group_id": 965, "id": 494077}, {"user_id": 10406, "stars": [], "topic_id": 16532, "date_created": 1301593281.0806179, "message": "Creo que esta es una buena razon: MercadoLibre reported consolidated net revenues for the three months ended December 31, 2010 of $62.3 million, representing 27.1% year-over-year growth. \nEn pocas palabras... es un monstruo que genera buenas ganancias.", "group_id": 965, "id": 494058}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301593528.136224, "message": "Mayamarket es el clon de redcomercial (practicamente lo mismo pero con otro dominio y solo para el sureste)", "group_id": 965, "id": 494075}, {"user_id": 2946, "stars": [], "topic_id": 16532, "date_created": 1301595622.5699589, "message": "@willygru Tienes razón, enfocarse a un segmento pequeño del mercado y servirlo muy bien es otra forma de crear una nueva categoría.", "group_id": 965, "id": 494449}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301595614.251781, "message": "@Krator Ah si? yo pienso en simplificar todo el proceso desde el mayorista o productor hasta el usuario final pasando por el distribuidor o vendedor :) pero se necesita de un cambio de hacer las cosas extremadamente grande y dificil que se adopte", "group_id": 965, "id": 494446}, {"user_id": 2946, "stars": [], "topic_id": 16532, "date_created": 1301595553.957078, "message": "@altuzar Si no mal recuerdo, olx es de uno de los cofundadores de ML. Y es otra cosa, son clasificados no subastas.", "group_id": 965, "id": 494430}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301594804.3931401, "message": "@keoz 2 clicks?", "group_id": 965, "id": 494295}, {"user_id": 3084, "stars": [], "topic_id": 16532, "date_created": 1301595394.2329841, "message": "@soska Le dió al clavo: imposible no, MUY difícil si. Agregaría que no se necesita ser 200% mejor en todo, simplemente escoger un nicho de mercado especialmente atractivo y robárselo. De hecho no sería recomendable enfrentarlos cara a cara en un principio, el que lo haga corre el riesgo de ser aplastado, recordemos Netscape vs MS.", "group_id": 965, "id": 494404}, {"user_id": 3665, "stars": [], "topic_id": 16532, "date_created": 1301595133.4113719, "message": "@keoz Estoy trabajando en una idea que salió el fin de semana pasado, parecida a lo que me comentas, es por eso que me llamo la atención", "group_id": 965, "id": 494351}, {"user_id": 6327, "stars": [], "topic_id": 16532, "date_created": 1301595308.052758, "message": "¿Y qué hay de olx.com ? Según entiendo, sigue creciendo mucho y ataca justo el target de ML.", "group_id": 965, "id": 494387}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301595466.6949241, "message": "@altuzar pero esa cosa es puro anuncito clasificado no? otro servicio que me molesta su existencia XD", "group_id": 965, "id": 494419}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301595676.419333, "message": "@willygru exacto", "group_id": 965, "id": 494460}, {"user_id": 10406, "stars": [], "topic_id": 16532, "date_created": 1301592804.775002, "message": "Ahi lo mas complicado creo que seria mover la cantidad de clientes que ya tiene y estan generando ganancias, a la nueva startup, no muchos abandonarian el barco por que si. Ademas de que ML cuenta con el apoyo de Ebay asi que los socios comerciales tambien son fuertes... por ultimo considerar la gigantesca cantidad de dinero que invierten en posicionamiento! \nLa solucion ganadora seria algo como una startup con mucha innovacion comercial, servicio que genere valor desde el primer dia, estrategias que rompan la barreras comerciales de ML y un magistral uso de Social media, por lo demas... es solo cuestion de tiempo.", "group_id": 965, "id": 494014}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301593318.233551, "message": "@krator http://www.redcomercial.com/ http://www.mayamarket.com/index.html", "group_id": 965, "id": 494064}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301594529.736156, "message": "Bueno luego les platico mi solución que es guajira pero algun dia empezare a hacerla y tratare de cambiar el mundo jojo en pocas palabras es que en 2 clics puedas vender lo que sea de cualquier mayorista en cualquier ecommerce, el problema tambien es que su sistema de achievements y reputacion es lo que genera la confianza para los compradores, creo tener los vendedores es más facil", "group_id": 965, "id": 494236}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1301594850.0534699, "message": "@Krator siii :D 1 para escoger el producto y otro para venderlo je (mas clics si quieren personalizarlo)", "group_id": 965, "id": 494311}, {"user_id": 12133, "stars": [], "topic_id": 16532, "date_created": 1301610171.298595, "message": "www.vendder.com www.shopify.com yo los veo en el mismo rubro que mercadolibre pero en otra categoria", "group_id": 965, "id": 497169}, {"user_id": 3084, "stars": [], "topic_id": 16532, "date_created": 1301618319.222008, "message": "Saben de algún servicio que le permita a los usuarios crear su mini Groupon?", "group_id": 965, "id": 497993}, {"user_id": 3084, "stars": [], "topic_id": 16532, "date_created": 1301618276.7217309, "message": "@zodman Interesante, no conocía www.vendder.com", "group_id": 965, "id": 497987}, {"user_id": 20521, "stars": [], "topic_id": 16532, "date_created": 1301618420.1266241, "message": "Hay scripts que venden para poner tu groupon btw creen que este pegando groupon , clickonero en mexico?", "group_id": 965, "id": 498010}, {"user_id": 3084, "stars": [], "topic_id": 16532, "date_created": 1301619073.831532, "message": "@nekrox He visto que Groupon y Grupalia están cerrando deals incluso en el sureste (Cancún), pero yo me refería a algo así como un ML para vendedores en esquema de compras sociales, o sea, que los usuarios/vendedores creen cada uno un mini Groupon.", "group_id": 965, "id": 498067}, {"user_id": 2946, "stars": [{"date_created": 1302549110.5699761, "user_id": 3084}], "topic_id": 16532, "date_created": 1301637839.1362081, "message": "@willygru suena como una buena idea. Hay un plugin para WP para sitios de descuento. Combínalo con WordPress multisite y tienes un MVP :)", "group_id": 965, "id": 499759}, {"user_id": 12133, "stars": [], "topic_id": 16532, "date_created": 1301674585.8132551, "message": "@willygru vender esta en el programa de startups chile.", "group_id": 965, "id": 503031}, {"user_id": 29963, "stars": [], "topic_id": 16532, "date_created": 1303056912.7967069, "message": "Desde Febrero lanzamos SIGLOTienda, esperamos que despegue muy bien, ya que ofrecemos como principio, seguridad, ya que el comprador pagará directo a la tienda, y el vendedor cobrará su dinero hasta que el comprador lo libere, parece dificil pero es muy sencillo", "group_id": 965, "id": 717352}, {"user_id": 29866, "stars": [], "topic_id": 16532, "date_created": 1303058177.2084219, "message": "Creo que una solución interesante es buscar los nichos, en Mercado Libre hay varios que pueden ser atacados con soluciones innovadoras, hay que recordar que Mercado Libre es un modelo de negocio \"peer to peer\". Para algunos nichos como el de las manualidades hay varios como: www.etsy.com, www.artesanum.com, www.uniccos.com para los videojuegos hay una nueva que me atrae mucho: www.gamestaq.com donde puedes vender tus juegos usados, nicho para los mercados como la comida orgánica y hecha en casa como: www.foodzie.com  e inclusive se puede pensar en modelos de intercambio como: www.swap.com yo creo que para todo mercado hay competencia. Sólo es cuestión de innovar, ahora con las redes sociales el mundo esta completamente conectado y los costos de publicidad han reducido, con un poco de networking es posible.", "group_id": 965, "id": 717515}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1303060307.777082, "message": "@siglotienda ese sistema de pago es igual que el viejo mercado pago de mercado libre, eso es precisamente uno de los graves problemas que hay en mercado libre que ya no es opcional, hay infinidad de vendedores muy enfadados con esa imposicion (incluyendome)", "group_id": 965, "id": 717631}, {"user_id": 29963, "stars": [], "topic_id": 16532, "date_created": 1303146960.1283569, "message": "@keoz a diferencia de Mercadopago, nuestro sistema funciona con Paypay y certificados de regalo, lo cual evita sorpresas (como estafas) al pagar directo al vendedor.", "group_id": 965, "id": 728399}, {"user_id": 26088, "stars": [], "topic_id": 16532, "date_created": 1303150936.8281319, "message": "@siglotienda como evitas las estafas usando paypal y certificados? como evitas que el comprador injustificadamente no libere el dinero?", "group_id": 965, "id": 728992}, {"user_id": 29963, "stars": [], "topic_id": 16532, "date_created": 1303155460.5447271, "message": "El recibirá el dinero una vez que el comprador confirme la entrega y satisfacción del producto comprado, nosotros administraremos los pagos y para evitar estafas se comunica al vendedor con el comprador. Te invitamos a publicar un producto y hacer la prueba de seguridad, porque así todo esto es solo teoría. Ten en cuenta que tenemos publicación gratuita, duración de 90 días y comisión de solo 5%", "group_id": 965, "id": 729786}, {"user_id": 26088, "stars": [{"date_created": 1303166954.0769501, "user_id": 29963}], "topic_id": 16532, "date_created": 1303156673.9114211, "message": "@siglotienda lo siento me suena igual que lo que hace mercado libre con mercado pago, igual tienen ellos el arbitraje y el dinero en la cuenta de mercado libre hasta que no se libere o se resuelva el conflicto o el comprador quede satisfecho, no hay ninguna garantia ni protección al vendedor, el sistema de reputacion de mercado libre es su mayor activo y no se usa en su maximo potencial, si ves los foros de mercado libre desde Argentina hasta México todos quieren administrar su dinero y con mucha razón", "group_id": 965, "id": 730068}, {"user_id": 35632, "stars": [], "topic_id": 16532, "date_created": 1307554212.4169109, "message": "respecto al tema de clickOnero y el modelo de compras en grupo, yo sé que si esta creciendo mucho en México, actualmente clickOnero domina el mercado con el 48% http://bit.ly/lBWD8T", "group_id": 965, "id": 1339520}, {"user_id": 3084, "stars": [], "topic_id": 16532, "date_created": 1307592680.602252, "message": "@jorcervan Shameless pitch (no offence) ;)", "group_id": 965, "id": 1346235}]