[{"user_id": 11626, "stars": [], "topic_id": 7417, "date_created": 1298088708.411556, "message": "http://www.youtube.com/watch?v=TrRN9UWgISE\r\n\r\nLast month we speculated how long it would take for the scenes on the streets of Cairo to be repeated in America. After all, Americans are facing similar levels of economic rape to those that prompted Egyptians to rise up and overthrow 30 year dictator Hosni Mubarak.\r\n\r\nNow Wisconsin Congressman Paul Ryan (R) is making similar comparisons after protesters massed in the hallways of the Wisconsin state Capitol this morning as part of what Matt Drudge dubbed a “day of rage”.\r\n\r\nThe demonstrators are rallying against a “momentous bill that would strip government workers, including school teachers, of nearly all collective bargaining rights,” reports the Associated Press.\r\n\r\nThe bill asks public sector workers to make a 5.8 percent pension contribution, roughly equal to the national average, along with a 12.6 percent health insurance contribution.\r\n\r\nRyan expressed his opposition to the demands of the protesters, but noted that the Wisconsin Governor Scott Walker was now facing, “Riots — it’s like Cairo has moved to Madison these days.”\r\n\r\nSimilarly, noting that the Governor has threatened to break the union protests by deploying the National Guard, writer Noam Chomsky told Democracy Now that what happened in Egypt was “the beginning of what we need here – democracy uprising.”\r\n\r\nAs part of the demonstration against the bill, students of Stoughton High School staged a walkout on Monday as a show of support for their teachers.\r\n\r\nWhether you’re in favor of making public sector workers pay more in contributions or not, the fact is that Americans in general now face the terrible consequences of a derivatives debt black hole that threatens to shut down the entire economy.\r\n\r\nNo budget cuts, public sector pension contributions, or any austerity measures whatsoever can redress the $1.4 Quadrillion dollar derivatives debt tsunami that Americans will now have to face as a result of the financial terrorists unleashing what promises to turn into an inflationary holocaust.\r\n\r\nAs the Economic Edge blog points out, “The global size of the derivatives bubble which was calculated last year at USD 190k per person-on-planet, has risen to USD 206k per person-on-planet. The ever rising commitment of governments for the repeated bailouts of financial institutions is partially linked to various flavours of derivatives exposure settlements and “black hole” losses emanating from off-balance-sheet vehicles.”\r\n\r\nIndeed, the entire GDP of every single country in the world only amounts to around $60 trillion. How can we ever hope to pay off $1,400 trillion dollars?\r\n\r\nWe can’t and we won’t. The only way that this $1.4 Quadrillion mountain of debt will disappear is a total and complete collapse of the global economy and its replacement with a new financial system.\r\n\r\nWhether that also simultaneously brings down the US dollar and the United States itself as a first world country remains to be seen, but anyone who believes that a few years of austerity can redress the balance is living in cloud cuckoo land.\r\n\r\nOnce the whole charade starts to unravel, the scenes we saw in Cairo over the last few weeks will look like a walk in the park in comparison to the turmoil that awaits as a result of the derivatives bubble.\r\n\r\nhttp://www.infowars.com/day-of-rage-americans-finally-reacting-to-economic-rape", "group_id": 3920, "id": 148833}]