[{"user_id": 11626, "stars": [], "topic_id": 40765, "date_created": 1309378709.487128, "message": "Marti Oakley\nActivist Post\nJune 29, 2011\n\nAlthough Smart Meters are promoted as energy efficiency components, the actual intent of these meters is to track your use of energy in real time across every 24hr. period, which will allow the provider to bill you for that period at the highest energy rate for the day.\n\nThey have another purpose: thanks to Smart Meters, every appliance in your home will be monitored.\n\nAs you will be rationed only so much energy for any 24 hr. period, opening and closing your refridgerator too many times during the daily billing cycle can cause your power to be disrupted. Your use of lights, appliances and even your time on the Net will be charged against your daily allowance of power.\n\nHave you seen the ads for the appliances that call for help when they need repairs? Like I need my stove sending out an SOS and having a “repair” man show up because the back burner made an appointment. I don’t want anything in my house that is sending and retrieving messages without my knowledge or consent. And what if the repair man shows up and you don’t want the appliance fixed at that time? Ummmm. No one seems to have the answer to this.\n\nSmart Meters are not about energy efficiency or any such nonsense. They are a real-time tracking device that monitors your household and what you do in it as part of the total surveillance system being put in place by the government. This is just another invasion of privacy. Your individual power supply can be disrupted at any time, as well as your whole neighborhood, community or state.\n\nWelcome to Smart Grid!\n\nFor more information on Smart Meters go to: www.W4AR.com \n\nhttp://www.activistpost.com/2011/06/smart-meters-we-can-monitor-everything.html\n\nhttp://www.youtube.com/watch?v=UsiTahuKoNI\n\n<iframe width=\"425\" height=\"349\" src=\"http://www.youtube.com/embed/UsiTahuKoNI\" frameborder=\"0\" allowfullscreen></iframe>\n\nJosh Hart, director of Stop Smart Meters! was arrested on June 21st 2011 for blocking the entrance to the PG&E payment center in Capitola, CA. PG&E has stated that they will force 'smart' meters onto Santa Cruz County against the laws adopted by local governments. The Public is expected to resist.\n", "group_id": 3920, "id": 1521376}]