[{"user_id": 30951, "stars": [], "topic_id": 21623, "date_created": 1303914750.252152, "message": "Something I've wondered for a while is using Dramatica with and without the supplied structure templates. I'm looking at short stories and novels, so know those templates best.\n\n(shift-enter gets a line break... yay!) It seems to me that the using say the novel template with a completed storyform gives me a basis for a solid structural story, but I am thinking now that is the wrong approach, and that the template should not have a bearing on this.\n\nIn other words, I now presume the template itself is not supposed to be the thing that is determining whether my story is 'complete', but the other aspects of Dramatica (plot progression, theme browser, reports).\n\nThere was supposed to be a question there somewhere.\n\nThis then leads me to wonder how I know which elements to select in 'This Scene Represents' when creating the scene list. I mean, if I determine this myself, isn't the avoidance of plot holes more down to me than Dramatica? I have my storyform, but how do I know I am using it correctly in my novel?\n\nI'm hoping the essence of my ramblings here will come through......", "group_id": 2515, "id": 826534}, {"user_id": 7645, "stars": [], "topic_id": 21623, "date_created": 1303924460.3143809, "message": "I never use the templates. You are correct in your comment that the template is not the thing, but rather the storyform. The templates, I think, are intended to be a bridge between previous understandings of structure and Dramatica's.", "group_id": 2515, "id": 828412}, {"user_id": 7664, "stars": [], "topic_id": 21623, "date_created": 1303927275.0564489, "message": "I've never really understood the purpose of the templates. (I've never even looked at them.) \n\nStoryweaving seems to be something that is completely dependent on the specifics of our story. Yes, things need to advance in generally the same way... but that's what the storyform is for.\n\nIMHO.", "group_id": 2515, "id": 829301}, {"user_id": 10814, "stars": [], "topic_id": 21623, "date_created": 1304006358.632395, "message": "The templates are there for those writers who have no clue how to create scenes or build and outline for a story.  In other words, writers who are new to writing for the most part.", "group_id": 2515, "id": 842781}, {"user_id": 30951, "stars": [], "topic_id": 21623, "date_created": 1304022245.5627689, "message": "Thanks! Now, had you stopped at 'Writers that have no clue\" then it could have been me!", "group_id": 2515, "id": 846781}, {"user_id": 13109, "stars": [], "topic_id": 21623, "date_created": 1306331664.2444601, "message": "Do you have a \"Save the Cat\" template by any chance... ;-)", "group_id": 2515, "id": 1178249}, {"user_id": 30951, "stars": [], "topic_id": 21623, "date_created": 1306332392.3246689, "message": "I guess you could make any template you wanted, just by adding the scenes to fit with the STC approach, then adding the relevant 'This scene represents' to match the divisions.", "group_id": 2515, "id": 1178436}, {"user_id": 30951, "stars": [], "topic_id": 21623, "date_created": 1306492555.4423571, "message": "Ah... I missed the wink.", "group_id": 2515, "id": 1203500}, {"user_id": 13109, "stars": [], "topic_id": 21623, "date_created": 1306492319.8539629, "message": "\"Do you have a \"Save the Cat\" template by any chance... ;-)\" - I need to say that was my dry attempt at humour - before I get banned from the group...", "group_id": 2515, "id": 1203466}]