[{"user_id": 11626, "stars": [], "topic_id": 9010, "date_created": 1298622285.8316021, "message": "(ICH) – It was not until Secretary of State Hillary Clinton walked to the George Washington University podium last week to enthusiastic applause that I decided I had to dissociate myself from the obsequious adulation of a person responsible for so much death, suffering and destruction.\r\n\r\nI was reminded of a spring day in Atlanta almost five years earlier when then-Defense Secretary Donald Rumsfeld strutted onto a similar stage to loud acclaim from another enraptured audience.\r\n\r\nIntroducing Rumsfeld on May 4, 2006, the president of the Southern Center for International Policy in Atlanta highlighted his “honesty.” I had just reviewed my notes for an address I was scheduled to give that evening in Atlanta and, alas, the notes demonstrated his dishonesty.\r\n\r\nI thought to myself, if there’s an opportunity for Q & A after his speech I might try to stand and ask a question, which is what happened. I engaged in a four-minute impromptu debate with Rumsfeld on Iraq War lies, an exchange that was carried on live TV.\r\n\r\nThat experience leaped to mind on Feb. 15, as Secretary Clinton strode onstage amid similar adulation.\r\n\r\nThe fulsome praise for Clinton from GWU’s president and the loud, sustained applause also brought to mind a phrase that – as a former Soviet analyst at CIA – I often read in Pravda. When reprinting the text of speeches by high Soviet officials, the Communist Party newspaper would regularly insert, in italicized parentheses:  “Burniye applaudismenti; vce stoyat” —  Stormy applause; all rise.\r\n\r\nWith the others at Clinton’s talk, I stood. I even clapped politely. But as the applause dragged on, I began to feel like a real phony. So, when the others finally sat down, I remained standing silently, motionless, with my eyes fixed narrowly on the rear of the auditorium and my back to the Secretary.\r\n\r\nI did not expect what followed: a violent assault in full view of Secretary Clinton by what in Soviet parlance were called the “organs of state security.”  The rest is history, as they say.  A short account of the incident can be found here.\r\n\r\nCallous Aplomb\r\n\r\nAs the video of the event shows, Secretary Clinton did not miss a beat in her speech as she called for authoritarian governments to show respect for dissent and to refrain from violence. She spoke with what seemed to be an especially chilly sang froid, as she ignored my silent witness and the violent assault that took place right in front of her.\r\n\r\nThe experience gave me personal confirmation of the impression that I had reluctantly drawn from watching her behavior and its consequences over the past decade. The incident was a kind of metaphor of the much worse violence that Secretary Clinton has coolly countenanced against others.\r\n\r\nAgain and again, Hillary Clinton – both as a U.S. senator and as Secretary of State – has demonstrated a nonchalant readiness to unleash the vast destructiveness of American military power. The charitable explanation, I suppose, is that she knows nothing of war from direct personal experience.\r\n\r\nAnd that is also true of her husband, her colleague Robert Gates at the Defense Department, President Barack Obama, and most of the White House functionaries blithely making decisions to squander the lives and limbs of young soldiers in foreign adventures — conflicts that even the top brass admit cannot be won with weapons.\r\n\r\nThe analogy to Vietnam is inescapable. As White House tapes from the 1960s show, President Lyndon Johnson knew that the Vietnam War could not be “won” in any meaningful way. Nonetheless, he kept throwing hundreds of thousands into the battle lest someone accuse him of being soft on communism.\r\n\r\nI had an inside seat watching Johnson do that. And I did nothing.\r\n\r\nNow, with an even more jittery president, a hawkish Secretary of State, General David they-injure-their-own-children-to-make-us-look-bad Petraeus, and various Republican presidential hopefuls – all jockeying for political position as the 2012 election draws near – the country is in even deeper trouble today.\r\n\r\nNo one on this political merry-go-round can afford to appear weak on terrorism. So, they all have covered their bets. And we all know who pays the price for these political calculations.\r\n\r\nThis time, I would NOT do nothing.\r\n\r\nMy colleagues in Veterans for Peace and I have known far too many comrades-in-arms and families whose lives have been shattered or ended as a result of such crass political maneuvering. Many of us know far more than we wish to know about war and killing. But — try as we may with letters and other appeals — we cannot get through to President Obama. And Secretary Clinton turns her own deaf ear to our entreaties and those of others who oppose unnecessary warfare. It is a pattern that she also followed in her days as a U.S. senator from New York.\r\n\r\nSee No Evil\r\n\r\nIn the summer of 2002, as the Senate was preparing to conduct hearings about alleged weapons of mass destruction (WMD) in Iraq and the possibility of war, former Chief Weapons Inspector in Iraq and U.S. Marine Major, Scott Ritter, came down to Washington from his home in upstate New York to share his first-hand knowledge with as many senators as possible.\r\n\r\nTo those that let him in the door, he showed that the “intelligence” adduced to support U.S. claims that Iraq still had WMD was fatally flawed. This was the same “intelligence” that Senate Intelligence Committee chair Jay Rockefeller later branded “unsubstantiated, contradicted, or even non-existent.”\r\n\r\nSen. Hillary Clinton would not let Ritter in her door. Despite his unique insights as a U.N. inspector and his status as a constituent, Sen. Clinton gave him the royal run-around. Her message was clear: “Don’t bother me with the facts.” She had already made up her mind. I had a direct line into her inner circle at the time, and was assured that several of my op-eds and other commentaries skeptical of George W. Bush’s planned invasion were given personally to Clinton, but no matter.\r\n\r\nSen. Clinton reportedly was not among the handful of legislators who took the trouble to read the National Intelligence Estimate on WMD in Iraq that was issued on Oct. 1, 2002, just ten days before the she voted to authorize war.\r\n\r\nIn short, she chose not to perform the due diligence required prior to making a decision having life-or-death consequences for thousands of Americans and hundreds of thousands of Iraqis. She knew whom she needed to cater to, and what she felt she had to do.\r\n\r\nBut, bright as she is, Hillary Clinton is prone to willful mistakes — political, as well as strategic. In dissing those of us who were trying to warn her that an attack on Iraq would have catastrophic consequences, she simply willed us to be wrong. Clearly, her calculation was that she had to appear super-strong on defense in order to win the Democratic nomination and then the presidency in 2008.\r\n\r\nJust as clearly, courting Israel and the Likud Lobby was also important to her political ambitions.\r\n\r\nTony Blair Admits Israeli Role\r\n\r\nAny lingering doubt that Israel played a major role in the U.S.- U.K. decision to attack Iraq was dispelled a year ago when former Prime Minister Tony Blair spoke publicly about the Israeli input into the all-important Bush-Blair deliberations on Iraq in Crawford, Texas, in April 2002.\r\n\r\nInexplicably, Blair forgot his usual discretion when it comes to disclosing important facts to the public and blurted out some truth at the Chilcot hearings in London regarding the origins of the Iraq War:\r\n\r\n“As I recall that [April 2002] discussion, it was less to do with specifics about what we were going to do on Iraq or, indeed, the Middle East, because the Israel issue was a big, big issue at the time. I think, in fact, I remember, actually, there may have been conversations that we had even with Israelis, the two of us [Bush and Blair], whilst we were there. So that was a major part of all this.”\r\n\r\nAccording to Philip Zelikow – a former member of the President’s Foreign Intelligence Advisory Board, the executive director of the 9/11 Commission, and later counselor to Secretary of State Condoleezza Rice – the “real threat” from Iraq was not to the United States.\r\n\r\nZelikow told an audience at the University of Virginia in September 2002, the “unstated threat” from Iraq was the “threat against Israel.” He added, “The American government doesn’t want to lean too hard on it rhetorically, because it is not a popular sell.”\r\n\r\nBut it wasn’t as though leading Israelis were disguising their hopes or an attack on Iraq. The current Israeli Prime Minister Binyamin Netanyahu published a pre-invasion piece titled “The case for Toppling Saddam” in the Wall Street Journal, in which he wrote:\r\n\r\n“Today nothing less than dismantling his regime will do … I believe I speak for the overwhelming majority of Israelis in supporting a pre-emptive strike against Saddam’s regime.”\r\n\r\nThe Israeli newspaper Ha’aretz reported in February 2003, “the military and political leadership yearns for war in Iraq.” And, as a retired Israeli general later put it, “Israeli intelligence was a full partner to the picture presented by American and British intelligence regarding Iraq’s non-conventional [WMD] capabilities.” In the United States, neoconservatives also pushed for war thinking that taking out Saddam Hussein would make Israel more secure.\r\n\r\nThose Israeli leaders and their neocon allies got their wish on March 19, 2003, with the U.S.-U.K. invasion.\r\n\r\nOf course, pressure from Israel and its Lobby was not the only factor behind the invasion of Iraq — think also oil, military bases, various political ambitions, revenge, etc. — but the Israeli factor was a central one.\r\n\r\nA Calculating Senator\r\n\r\nI’m afraid, though, that these calculations aimed at enhancing Israeli security may ultimately have the opposite effect. The Iraq War and the anti-Americanism that it has engendered across the Middle East seem sure to make Israel’s position in the region even more precarious.\r\n\r\nIf the Iraq War does end up making the region more dangerous for Israel, the fault will lie primarily with Israel’s hard-line leaders, as well as with those American officials (and media pundits) who so eagerly clambered onboard for the attack on Iraq.\r\n\r\nOne of those U.S. officials was the calculating senator from New York.\r\n\r\nIn a kind of poetic justice, Clinton’s politically motivated warmongering became a key factor in her losing the Democratic presidential nomination to Barack Obama, who as a young state senator in Illinois spoke out against the war.\r\n\r\nAlthough she bet wrong in 2002-03, Clinton keeps doubling down in her apparent belief that her greater political vulnerability comes from being perceived as “weak” against U.S. adversaries. So, she’s emerged as one of the Obama administration’s leading hawks on Afghanistan and Iran.\r\n\r\nI suspect she still has her eye on what she considers the crucial centers of financial, media and other power that could support a possible future run for president, whether in 2012 if the Obama administration unravels or in 2016.\r\n\r\nAnother explanation, I suppose, could be that the Secretary of State genuinely believes that the United States should fight wars favored by right-wing Israelis and their influential supporters in the U.S.\r\n\r\nWhichever interpretation you prefer, there’s no doubt that she has put herself in the forefront of American leaders threatening Iran over its alleged “nuclear weapons” program, a “weapons” program that Iran denies exists and for which the U.S. intelligence community has found little or no evidence.\r\n\r\nBête Noire Iran\r\n\r\nAs a former CIA analyst myself, it strikes me as odd that Clinton’s speeches never reflect the consistent, unanimous judgment of the 16 U.S. intelligence agencies, issued formally (and with “high confidence”) in November 2007 that Iran stopped working on a nuclear weapon in the fall of 2003 and had not yet decided whether to resume that work.\r\n\r\nLess than two weeks ago (on Feb. 10), in a formal appearance before the House Intelligence Committee, National Intelligence Director James Clapper testified:\r\n\r\n“We continue to assess Iran is keeping open the option to develop nuclear weapons in part by developing various nuclear capabilities that better position it to produce such weapons, should it choose to do so. We do not know, however, if Iran will eventually decide to build nuclear weapons….\r\n\r\n“We continue to judge Iran’s nuclear decision making is guided by a cost-benefit approach, which offers the international community opportunities to influence Tehran.”\r\n\r\nWho’s in Charge Here?\r\n\r\nYet, in her determination to come across as hard-line, Clinton has undercut promising initiatives that might have constrained Iran from having enough low-enriched uranium to be even tempted to build a nuclear arsenal.\r\n\r\nLast year, when – at the urging of President Obama – the leaders of Turkey and Brazil worked out an agreement with Iran, under which Iran agreed to ship about half of its low-enriched uranium (LEU) out of country, Clinton immediately rejected it in favor of more severe economic sanctions.\r\n\r\nTurkish Prime Minister Recep Tayyip Erdogan and Brazilian President Luiz Inácio Lula da Silva were left wondering who exactly was in charge in Washington — Hillary Clinton and her pro-Israel friends, or Obama.\r\n\r\nBrazil released a three-page letter that Obama had sent to Lula da Silva a month earlier in which Obama said the proposed uranium transfer “would build confidence and reduce regional tensions by substantially reducing Iran’s” stockpile of low-enriched uranium.\r\n\r\nThe contrast between Obama’s support for the initiative and the opposition from various hardliners (including Clinton) caused “some puzzlement,” one senior Brazilian official told the New York Times. After all, this official said, the supportive “letter came from the highest authority and was very clear.”\r\n\r\nIt was a particularly telling episode. Clinton basked in the applause of Israeli leaders and neocon pundits for blocking the uranium transfer and securing more restrictive UN sanctions on Iran – and since then Iran appears to have dug in its heals on additional negotiations over its nuclear program.\r\n\r\nSecretary Clinton is almost as assiduous as Netanyahu in never missing a chance to paint the Iranians in the darkest colors – even if that ends up painting the entire region into a more dangerous corner.\r\n\r\nMore Hypocrisy\r\n\r\nOn Feb. 15, Clinton continued giving hypocrisy a bad name, with her GWU speech regarding the importance of governments respecting peaceful dissent.\r\n\r\nFive short paragraphs after she watched me snatched out of the audience Blackwater-style, she said, “Iran is awful because it is a government that routinely violates the rights of its people.” It was like something straight out of Franz Kafka.\r\n\r\nToday, given the growing instability in the Middle East – and Netanyahu’s strident talk about Iran’s dangerous influence – it may take yet another Herculean effort by Joint Chiefs Chairman Mike Mullen to disabuse Netanyahu of the notion that Israel can somehow provoke the kind of confrontation with Iran that would automatically suck the U.S. into the conflict on Israel’s side.\r\n\r\nAt each such turning point, Secretary Clinton predictably sides with the hard-line Israeli position and shows remarkably little sympathy for the Palestinians or any other group that finds itself in Israel’s way.\r\n\r\nIt is now clear, not only from the WikiLeaks documents, but even more so from the “Palestine Papers” disclosed by Al Jazeera, that Washington has long been playing a thoroughly dishonest “honest-broker” role between Israel and the Palestinians.\r\n\r\nBut those documents don’t stand alone. Clinton also rejected the Goldstone Report’s criticism of Israel’s bloody attack on Gaza in 2008-09; she waffled on Israel’s fatal commando raid on a Turkish relief flotilla on its way to Gaza in 2010; and she rallied to the defense of Egyptian dictator Hosni Mubarak this month when Israeli leaders raised alarms about what kind of regime might follow him.\r\n\r\nJust last week, Clinton oversaw the casting of the U.S. veto to kill a U.N. Security Council resolution calling on Israel to stop colonizing territories it occupied in 1967. That vote was 14 to 1, marking the first such veto by the Obama administration. Netanyahu was quick to state that he “deeply appreciated” the U.S. stance.\r\n\r\nSilent Witness\r\n\r\nIn the face of such callous disregard for what the Founders called “a decent respect for the opinions of mankind,” words failed me — literally — on Feb. 15.\r\n\r\nThe op-eds, the speeches, and the interviews that others and I have done about needless war and feckless politicians may have done some good but, surely, they have not done enough. And America’s Fawning Corporate Media (FCM) is the embodiment of a Fourth Estate that is dead in the water.\r\n\r\nI counted about 20 TV cameras at the Clinton speech and reporters galore. Not one thought to come outside to watch what was happening to me, and zero reporting on the incident has found its way into the FCM, save a couple of brief and misleading accounts.\r\n\r\nA Fox News story claimed that “a heckler interrupted” Clinton’s speech and then “was escorted from the room.” Fox News added that I “was, perhaps, trying to hold up a sign.” CNN posted a brief clip with a similar insistence that I had “interrupted” Clinton’s speech, though the video shows me saying nothing until after I’m dragged away (or “escorted”) when I say, “So this is America.” There also was no sign.\r\n\r\nDisappointing, but not surprising. But I guess I really do believe that the good is worth doing because it is good. It shouldn’t matter that there is little or no guarantee of success — or even of a truthful recounting of what happened.\r\n\r\nJail\r\n\r\nOne of my friends, in a good-natured attempt to make light of my arrest and brief imprisonment, commented that I must be used to it by now.\r\n\r\nI thought of how anti-war activist Dan Berrigan responded to that kind of observation in his testimony at the Plowshares Eight trial 31 years ago. I feel blessed by his witness and fully identify with what he said about “the push of conscience”:\r\n\r\n“With every cowardly bone in my body, I wished I hadn’t had to do it. That has been true every time I have been arrested. My stomach turns over. I feel sick. I feel afraid. I hate jail. I don’t do well there physically.\r\n\r\n“But I have read that we must not kill. I have read that children, above all, are threatened by this. I have read that Christ our Lord underwent death rather than inflict it. And I’m supposed to be a disciple.\r\n\r\n“The push of conscience is a terrible thing.”\r\n\r\nAs Fr. Berrigan clearly understood, the suffering of the victims of war is so much worse than the shock and discomfort of arrest.\r\n\r\nFor her part, Sen. and/or Secretary Clinton seems never to have encountered a war that she didn’t immediately embrace on behalf of some geopolitical justification, apparently following Henry Kissinger’s dictum that soldiers are “just dumb stupid animals to be used as pawns in foreign policy.”\r\n\r\nFor us Veterans for Peace, we’ve been there, done that. And so, enough already!\r\n\r\nMoreover, beyond the human suffering of those caught up in war, there’s what’s in store for the rest of us. As recent rhetoric and disclosures of leaked documents have made clear, what lies ahead is a permanent warfare state, including occupation of foreign lands and new military bases around the globe — unless we have the courage to stand up this time.\r\n\r\nAlready well under way is creeping curtailment of our rights at home. “A state of war only serves as an excuse for domestic tyranny,” wrote Aleksandr Solzhenitsyn — one who knew.\r\n\r\nI think we need to bear in mind that we are part of a long line of those who have taken a stand on these issues. As for those of us who have served abroad to safeguard the rights of U.S. citizens — well, maybe we have a particular mandate now to keep doing what we can to keep protecting them.\r\n\r\nhttp://dprogram.net/2011/02/24/the-push-of-conscience-and-secretary-clinton-ray-mcgovern", "group_id": 3920, "id": 206583}]