[{"user_id": 36333, "stars": [], "topic_id": 40548, "date_created": 1309188265.1129551, "message": "DataCapture are a growing software company based in Okehampton Business Centre located on the edge of Dartmoor National Park with glorious views over the rolling Devon countryside. Our main business focus is the design and installation of nuclear waste tracking and management systems. We're passionate about web-based software development using open-source tools. \n\nWe're looking for a software developer to join our growing team and help us shake up our market area by being the first to introduce a high-performance, standards-based web solution. You will be involved in many aspects of system development: database design, user-interface construction, programming, quality testing, bug fixing and customer support. \n\nOur ideal candidate would be a Django master and Python guru with amazing Javascript skills, but as very few of these people seem to exist, we're willing to take gifted programmers with at least 3 years programming experience in a work environment with a modern object-oriented language (like Java, C# or C++) and train them in the arcane arts of Django and Python. Not a bad deal - earn a competitive salary while working with our passionate and motivated team in the heart of beautiful Devon countryside as you acquire skills in one of the hottest areas of programming! \n\nIf on the other hand you have no real-world programming experience, but you really, really want someone to pay you while you learn Django and Python to help bootstrap your career ... please don't apply. We want someone with a proven track record of producing commercial software, capable of hitting the ground running and quickly being productive to help us meet our tight deadlines. \n\nKnowledge of HTML, CSS, Javascript and jQuery would be a bonus. \n\nWe also use or plan to use Apache, nginx, Celery, RabbitMQ, Memcached, Redis and Android. Our change control is handled by Mercurial and we use Redmine for project management. \n\nPlease see our website at www.datacap.co.uk for contact detail and send us your cv (including references), your availability and if possible, links to projects you have been involved in. If we like what we see we will get back in touch quickly to arrange a chat.", "group_id": 10483, "id": 1496223}]