[{"user_id": 1736, "stars": [], "topic_id": 5804, "date_created": 1297724055.651233, "message": "We have been (happily) using ReviewBoard at work, but I know a lot of people that are fans of Gerrit. Anyone used both that can comment?", "group_id": 106, "id": 107187}, {"user_id": 5639, "stars": [], "topic_id": 5804, "date_created": 1297728996.626461, "message": "I've used both, in addition to Crucible/FishEye. There are downsides to any of them, but to be honest, there's very little about gerrit that doesn't make me want to vomit. Of the three (rb, gerrit, crucible), my first choice would be crucible, second reviewboard, and third.... write something else yourself.", "group_id": 106, "id": 108171}, {"user_id": 218, "stars": [], "topic_id": 5804, "date_created": 1297778878.055881, "message": "I'm also not a terribly big fan of reviewboard. I find their ajax code-load-in to be a bit slow.", "group_id": 106, "id": 111407}, {"user_id": 218, "stars": [], "topic_id": 5804, "date_created": 1297778916.553694, "message": "We made the choice. I think I would have chosen Gerrit, but the rest of my team preferred RB.", "group_id": 106, "id": 111418}, {"user_id": 218, "stars": [], "topic_id": 5804, "date_created": 1297778890.2691579, "message": "Another thing with Gerrit is that you can't really \"demo\" it. It *really* wants to be the arbiter of your repository and you get a bunch of trash reviews if it isn't.", "group_id": 106, "id": 111409}, {"user_id": 218, "stars": [], "topic_id": 5804, "date_created": 1297778827.394315, "message": "I've used both. Gerrit lacks some pretty critical, imo, features. Specifically the ability to see all diffs on the same page side by side.", "group_id": 106, "id": 111396}, {"user_id": 653, "stars": [], "topic_id": 5804, "date_created": 1297826269.1867361, "message": "How do you integrate any of these into your development process? Does something have to be reviewed before it can be merged? We are on the edge of needing something like this, but it's not clear to me where it should fit into the development process.", "group_id": 106, "id": 117481}, {"user_id": 1736, "stars": [], "topic_id": 5804, "date_created": 1297828629.497762, "message": "All devs work in feature branches and as a purely human-side requirement you need a positive code review before merging to tip", "group_id": 106, "id": 117585}, {"user_id": 1736, "stars": [], "topic_id": 5804, "date_created": 1297828717.410697, "message": "ReviewBoard emails the correct team list when a new review is published and usually people will just go look at it", "group_id": 106, "id": 117591}, {"user_id": 1736, "stars": [], "topic_id": 5804, "date_created": 1297828731.6309299, "message": "(sometimes for bigger reviews you need to walk around and bug them)", "group_id": 106, "id": 117592}, {"user_id": 5639, "stars": [], "topic_id": 5804, "date_created": 1297862931.5974491, "message": "As an example integration point, with gerrit we have Jenkins automatically run tests against code submitted to gerrit for review, and if it passes all of the tests, Jenkins +1's the review, which is required before a merge.", "group_id": 106, "id": 119650}, {"user_id": 653, "stars": [], "topic_id": 5804, "date_created": 1297879050.6261721, "message": "Thanks for the examples. We're small enough that something fairly simple should work. We're not to the point that we have a test suite that needs to be run.", "group_id": 106, "id": 121907}]