[{"user_id": 37168, "stars": [], "topic_id": 45940, "date_created": 1317330237.6942749, "message": "I'm still relatively new to Dramatica. I've used it to write treatments for two scripts, one of which I'm in the middle of drafting. In each instance, my approach to Dramatica and the writing process was slightly different. For the first script, which I'm currently writing, I used the Plot Sequence Report to outline every scene. For the second script, I've used the signposts to outline. I'm curious how everyone else works. I'd like this post to be a catalog of everyone's Dramatica process.", "group_id": 2515, "id": 2243981}, {"user_id": 37586, "stars": [], "topic_id": 45940, "date_created": 1317334327.802495, "message": "Of course the 12 questions are what I always start with as well.", "group_id": 2515, "id": 2244378}, {"user_id": 37586, "stars": [], "topic_id": 45940, "date_created": 1317334270.1288879, "message": "I started out thinking I knew what the problem was and started there.  That was a mess.  I could look at the problem from all four classes and rationalize how it worked and would rework the storyform over and over(unending) but I recently heard this question, \"Is the problem a PROCESS that needs to stop or a STATE that needs to change?\"  That really made sense to me.  What's going on in my overall story?  Is it a problem that is changing and needs to stop changing or is it stuck and needs to change? If it is a process then I know it is either in ACTIVITY or MANIPULATION(PSYCHOLOGY) and of course if it's a state than it's either Situation or Fixed Attitude.  I can ask that with all 4 through lines and that helps me nail down the classes faster.", "group_id": 2515, "id": 2244375}, {"user_id": 7664, "stars": [], "topic_id": 45940, "date_created": 1317335947.8492429, "message": "I don't have a process yet. I usually storyform the story without thinking too hard, and then throw that out and start again. After that, I just do what feels right. Still working it out.\n\n @sam_potter I like your question a lot.", "group_id": 2515, "id": 2244493}, {"user_id": 36437, "stars": [], "topic_id": 45940, "date_created": 1317336911.792413, "message": "I use the signposts to outline. I like to dabble with the PSR, but at this point in my Dram journey, there are times it still feels over my head.", "group_id": 2515, "id": 2244601}, {"user_id": 37586, "stars": [], "topic_id": 45940, "date_created": 1317337276.221333, "message": "@MikeDerk I heard Chris ask it (not word for word <g>) on the Collateral DUG podcast.", "group_id": 2515, "id": 2244634}, {"user_id": 36525, "stars": [], "topic_id": 45940, "date_created": 1317344993.461309, "message": "I prefer to look at every term with it's definition and ask myself, \"What in my story is most like this?  Which character(s) is this most relevant to?\" and write down the answer.  If I take all the answers and rearrange them in chronological order it's more or less a synopsis/outline.", "group_id": 2515, "id": 2245405}, {"user_id": 37168, "stars": [], "topic_id": 45940, "date_created": 1317352247.607187, "message": "@sunandshadow -- Can you give a few more details? How exactly do you go from the answers you've arrived at to arranging them in chronological order?", "group_id": 2515, "id": 2246089}, {"user_id": 36525, "stars": [], "topic_id": 45940, "date_created": 1317366978.1020529, "message": "minor correction, that should say \"scenes within the acts\" not \"scenes withing the chapters\"", "group_id": 2515, "id": 2247218}, {"user_id": 36525, "stars": [], "topic_id": 45940, "date_created": 1317366918.310575, "message": "Well, I try to divide them into acts first and not worry about order within the act.  Some are really obvious because they are about the initial incident or the climax.  It's not necessary to sort them all immediately - as I get them about 70% sorted that's enough to start making scenes withing the chapters.  When making the scenes this may cause me to realize I need one of those hard-to-sort ones in the scene.  Or making scenes may cause me to realize I need another character, and then another scene earlier to introduce that character, and two or three of my illustrated terms may go with that character.  So I just nibble away at it from whatever angle is easiest at the moment.  I'm also fond of the Instant Dramatica applet because you don't need a perfectly correct storyform to use it, you fill in the terms yourself so you can switch out any that feel wrong for something that seems more relevant, even a non-dramatica term if you want.", "group_id": 2515, "id": 2247211}]