[{"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302540482.3835599, "message": "I'm the founder of SpotSift, an LBS that helps professionals network at events using their mobile phone. I want to help make networking super-efficient by enabling users to search and discover the professional around them at events, publish business opportunities and connect in real-time.", "group_id": 95, "id": 626126}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302540505.2128921, "message": "We have an iPhone app (search for 'spotsift') and read more about us at www.spotsift.com.", "group_id": 95, "id": 626133}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302540528.5580871, "message": "Oh yeah, I'm building out a team so if you're interested in this space please contact me. :)", "group_id": 95, "id": 626141}, {"user_id": 4149, "stars": [], "topic_id": 18607, "date_created": 1302542611.2111859, "message": "I think this could be a great idea, i really don't see any other app in the space, also with that said, there is one thing that i think that could make this even better, integrate with linkedin, i mean linkedin looks like that the perfect part to make this a killer app", "group_id": 95, "id": 626639}, {"user_id": 4149, "stars": [], "topic_id": 18607, "date_created": 1302542735.968076, "message": "and also think about another name", "group_id": 95, "id": 626668}, {"user_id": 4149, "stars": [], "topic_id": 18607, "date_created": 1302545759.9332869, "message": "@thesteve I think the name could be improve didn't really make sense to me when I started playing with it", "group_id": 95, "id": 627431}, {"user_id": 12927, "stars": [], "topic_id": 18607, "date_created": 1302544244.7328191, "message": "what do you think is wrong with the name?", "group_id": 95, "id": 627074}, {"user_id": 2597, "stars": [], "topic_id": 18607, "date_created": 1302544303.200788, "message": "this would be useful only at a professional event right?", "group_id": 95, "id": 627090}, {"user_id": 12927, "stars": [], "topic_id": 18607, "date_created": 1302547052.4781971, "message": "@italiano40 i was just curious if you picked up on some negative connotation but you just don't think it accurately describes the service? fair enough", "group_id": 95, "id": 627717}, {"user_id": 719, "stars": [], "topic_id": 18607, "date_created": 1302546673.141681, "message": "@italiano40 There's another app in this space as far as I know... http://shhmooze.com. There's probably space for more than one app though. Best of luck @freshfunk.", "group_id": 95, "id": 627664}, {"user_id": 4149, "stars": [], "topic_id": 18607, "date_created": 1302550497.59547, "message": "@thesteve i think it could be catchy or something that really grabs attention @micrypt and i never seen that but i just did a quick google search but that one looks good", "group_id": 95, "id": 628376}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302563416.433516, "message": "@italiano40 It integrates with LinkedIn, at least during user creation. I plan on doing other LI integrations as is allowed by their terms and conditions.", "group_id": 95, "id": 631614}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302563482.0431719, "message": "@italiano40 Oh yeah and the name. It's not perfect but I must've gone through 1,000,000, all of which are taken. I'm not in the mood to pay through the nose for a domain name and I like having .com. My perfect name for the app would've been NetworkNow.", "group_id": 95, "id": 631626}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302563520.636385, "message": "@equinox Yeah, I'm aiming at the professional vertical instead of purely social or dating or photos etc.", "group_id": 95, "id": 631633}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302563978.710165, "message": "@italiano40 Yes, lol, there is probably space for 10 more apps. Meetup's mobile app allows check-ins but nothing much beyond that. Facebook is getting into checking into events, but they are obviously not professional. I haven't heard of shhmooze but thanks for pointing that out. There is a startup called unsocial that was on TechCrunch a while back but haven't heard anything about them since them.", "group_id": 95, "id": 631711}, {"user_id": 2597, "stars": [], "topic_id": 18607, "date_created": 1302567518.109216, "message": "@freshfunk you said you're building a team, I am assuming you want to start a startup? how many people are in the team now?", "group_id": 95, "id": 632885}, {"user_id": 4935, "stars": [], "topic_id": 18607, "date_created": 1302727050.6993239, "message": "piloting events like the one on April 6 sound like a great idea for a location service. perhaps schedule another one?", "group_id": 95, "id": 671384}, {"user_id": 22729, "stars": [], "topic_id": 18607, "date_created": 1302721633.8535061, "message": "@equinox Well, in my view, I've already started the startup. :) Currently, it is just me.", "group_id": 95, "id": 669884}]