[{"user_id": 35323, "stars": [], "topic_id": 38428, "date_created": 1307432826.8211601, "message": "Recently I've been thinknig about the manga called Nana. It's about a teenage girl who tries to find love while trying to build up her independent life in a large city. She's in and out of relationships, lots of friends, drama and stuff happens. It's a typical romantic series. As I see all the dramatica archetypal characters appear in the story in one form or another except from two: the Antagonist and the contagonist. This girl is pretty much surrounded by friends and the story focuses on her friendships and romantic relationships generally getting messed up by her. Now the question: Is it possible in this case that the Main Character has the characteristics of both the protagonist and the antagonist. As I see she is the only reason why her relationships get messed up. I'd say: \"Her biggest enemy is herself\". Similar stuff applies to Bridget Jones I guess. There is basically no outer force which would make her miserable - it's herself who makes things wrong all the time (even if temptation looks like an outer force in this story). So is it possible? Protagonist and Antagonist in the same character? What do you think?", "group_id": 2515, "id": 1317834}, {"user_id": 30951, "stars": [], "topic_id": 38428, "date_created": 1307434528.0047309, "message": "Couple of comments from me.\n\nYou said: \"Is it possible in this case that the Main Character has the characteristics of both the protagonist and the antagonist.\"\n\nThe protagonist is not part of the Main Character. The protagonist is a OS character. The Main Character is whichever player is the audience's viewpoint on the story. Choices re. protagonist / antagonist are nothing to do with Main Character.\n\nIn Bridget Jones, I'd have thought the character played by Hugh Grant was the antagonist, but I see what you mean. Or, if not, I still wouldn't say it was her but perhaps 'society'. \n\nIt sounds to me like your story is not a complete story in the Dramatica sense. But, if protagonist and antagonist were in one character, I'm not sure an audience could have sympathy for a character like that. A of the conflict would be internal, not played out to the audience. Also, could this be a collection of many stories?", "group_id": 2515, "id": 1317999}, {"user_id": 35323, "stars": [], "topic_id": 38428, "date_created": 1307435178.870723, "message": "I understand that Protagonist is not part of the Main Character - the point is that it can be part of him. On the other hand I realized that the examples I've mentioned probably lack Overall Story Throughline - but I would take extra care saying that as the OST can be extra hard to Identify when it comes to personal drama based stories (like American Beauty). Speaking of which - who is the Antagonist in American Beauty? I know there are really not archetype characters in that story so the question rephrased: Who has Antagonistic character traits in American Beauty? Who prevents Lester from reaching his goals? Society might be an answer - I'm just somehow not confortable with this answer...", "group_id": 2515, "id": 1318184}, {"user_id": 35158, "stars": [], "topic_id": 38428, "date_created": 1307435334.9035261, "message": "Novbert, when this teenage girl is messing up all of her relationships, this sounds pretty much like her Critical Flaw. And no, a player cannot be the Protagonist AND the Antagonist at the same time, since the Protagonist is FOR the goal and the Antagonist is AGAINST it.", "group_id": 2515, "id": 1318205}, {"user_id": 35139, "stars": [], "topic_id": 38428, "date_created": 1307453200.872927, "message": "Dramatica takes into account four pairings of archetype. In their pure forms, they will oppose each other—this is what they do. Protagonist fights with Antagonist, Sidekick dukes it out with Skeptic, Logic argues with Feeling, and Guardian stares coldly across at Contagonist.\n\nArchetypes are not parts of the characters. It's the characteristics which are assigned to the character which make (or break) the archetype-itude.\n\nOnce you get into the Build Characters screen and start reassigning characteristics, you do open up shining new opportunities for character conflict, and make the characters much more interesting. But you also shatter the archetypes. A character may have several Protagonist-like characteristics, and be best poised in your story to take on the Antagonist, but that character really can't be called the Protagonist.", "group_id": 2515, "id": 1320977}, {"user_id": 35323, "stars": [], "topic_id": 38428, "date_created": 1307455414.946945, "message": "Psycho is a great example. I guess the answer to my question is that it's possible but only in that very rare case when the player who conatins the Protagonist is a split personality", "group_id": 2515, "id": 1321702}, {"user_id": 33839, "stars": [], "topic_id": 38428, "date_created": 1307454765.4009781, "message": "I don't see why a protagonist and antagonist functions cannot occupy the same character - ever see Alejandro Jodorowsky's Santa Sangre?  Fenix's goal, at its highest level, is freedom.  His mother's goal, Goncha, is to enslave her son, using him to do her bidding in the most fantastical sense since she's armless.  It's not until the climax we realize they were one in the same, the movie being a wonderfully realized, surrealist descent into madness...", "group_id": 2515, "id": 1321551}, {"user_id": 33839, "stars": [], "topic_id": 38428, "date_created": 1307454980.317569, "message": "...but of course when you look at it from Dramatica's perspective, that's part of the OS and the two characters have their own complete functions as such (antagonist/protagonist).  It's not unlike Psycho, but a better example since I don't think Norman Bates and his mother's goals as opposing (I should say, I've yet to consider Psycho from the Dramatica perspective).", "group_id": 2515, "id": 1321608}, {"user_id": 33839, "stars": [], "topic_id": 38428, "date_created": 1307456141.1444621, "message": "Right, I've only seen it in cases where the story's problem is one of identity.  Even the movie Identity is a good example, and the stories themselves are types where the OS isn't really apparent until the problem is resolved because there's deliberate misdirection.", "group_id": 2515, "id": 1321819}, {"user_id": 30951, "stars": [], "topic_id": 38428, "date_created": 1307459023.0269561, "message": "Re. this it, \"in that very rare case when the player who conatins the Protagonist is a split personality\" \n\nIn a story sense that is two characters anyway.", "group_id": 2515, "id": 1322310}, {"user_id": 7664, "stars": [], "topic_id": 38428, "date_created": 1307461881.1951671, "message": "Any character can be their own worst enemy without also being the antagonist. \n\nTheir problem, their Critical flaw, their desire to DO instead of BE... all sorts of things can work against them.", "group_id": 2515, "id": 1322771}, {"user_id": 7664, "stars": [], "topic_id": 38428, "date_created": 1307462710.354641, "message": "A split personality can also be two players -- as in the son and the mom. \n\nI think the thing is that they cannot play both sides at the same time.", "group_id": 2515, "id": 1322949}, {"user_id": 33839, "stars": [], "topic_id": 38428, "date_created": 1307463855.4797981, "message": "I think the key distinction there is \"play\", as one side is usually dominate over the other, although in Santa Sangre, I would say the MC is both at the same time.  Don't know if we can post links here, but this scene would demonstrate:  http://www.youtube.com/watch?v=EcyXc70b23g.  While they're distinct individuals here, the truth is the mother is a puppet. So I guess I would say in the throughlines they cannot play both sides at the same time because we're dealing with a subjective viewpoint, in the OS, they can.  Does that sound reasonable?", "group_id": 2515, "id": 1323231}, {"user_id": 7645, "stars": [], "topic_id": 38428, "date_created": 1307467716.309073, "message": "I will say though that thinking of the OS of \"American Beauty\" in terms of Psychology/Conceptualizing is an extremely accurate interpretation. Stories of dysfunctional families are frequently located in this Domain, and more often than not in this particular Type. The matter of OS Outcome usually comes down to whether or not the family finds a way to overcome their dysfunction - either by finding a way to create a new concept of family (as in \"American Beauty\") or finding a way to simply be themselves (as in \"The Incredibles). The former ended in Failure, while the latter ended in Success.", "group_id": 2515, "id": 1324660}, {"user_id": 7645, "stars": [], "topic_id": 38428, "date_created": 1307467707.0756609, "message": "@Novbert When it comes to more complex stories like \"American Beauty\" you wouldn't really think of an Antagonist purposefully trying to prevent a Protagonist from reaching his or her goal. Taking just the Motivations of that Archetype, a character needs to show that he or she is driven by Avoid and Reconsider. Col. Fitts (Chris Cooper) certainly has something to hide (Avoid). Reconsider might be harder to find. It could be Buddy Kane (Peter Gallagher) trying to get Carolyn (Annette Bening) to Reconsider, though he feels more like a Contagonist-type character. Ricky could fit the bill as well, maybe even Lester. It could be too that it isn't represented at all, which is OK.", "group_id": 2515, "id": 1324656}, {"user_id": 7645, "stars": [], "topic_id": 38428, "date_created": 1307467772.22768, "message": "Separating the Main Character's personal issues from the Overall Story helps prevent the confusion that can come from labeling a film like \"American Beauty\" as a personal drama based story. The emphasis in the storytelling might be there, but the actual story itself--the storyform--is more encompassing.", "group_id": 2515, "id": 1324682}, {"user_id": 10814, "stars": [], "topic_id": 38428, "date_created": 1307487131.199172, "message": "It is easy to combine Dramatica characteristics from the protagonist and antagonist into a single complex character.\n\nFor example, you might have a pursue character that also represents Reconsider, or a Consider character that also represents Avoid/Prevent.  \n\nLess obvious, but no less compelling is to have a character behave one way in their motivation, but have another level, such as Methodology, be at odds with the expected archetypal pattern.  For example, you may have an apparent protagonist motivated by purse and consider, that uses the methodologies of Reaction (in lieu of Proaction), etc.", "group_id": 2515, "id": 1329951}]