[{"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308152343.0736821, "message": "@kyleashipley The thing about predicting bubbles is that if you don't put a timeframe on it, predictions don't mean much", "group_id": 10203, "id": 1401695}, {"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308152408.899024, "message": "like you said on twitter, as an investor or someone taking investment, the only options are to invest/take money or to sit it out", "group_id": 10203, "id": 1401704}, {"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308152662.8915761, "message": "and basically nobody is making decisions based on the market as a whole anyway. You always have a price to either buy or sell a specific company with specific terms. I'm a lot more open to the idea that LinkedIn is overvalued (not convinced) or that Groupon is overvalued (I'd agree)", "group_id": 10203, "id": 1401734}, {"user_id": 34450, "stars": [], "topic_id": 39456, "date_created": 1308170070.4739759, "message": "The only reason that overall market dynamics come into play is if you are on either side of the situation where an entrepreneur is trying to raise money and VCs have seized up in terror after investing way too much in unproven companies (possibly Color and Groupon).", "group_id": 10203, "id": 1404191}, {"user_id": 34450, "stars": [], "topic_id": 39456, "date_created": 1308169852.1363549, "message": "I think that's a fair point. I am not an expert, and I have no skin in the game. I realize that it's easy to make a generalization like \"We are in a bubble\" or \"We are not in a bubble\" without actually taking any action against it.", "group_id": 10203, "id": 1404167}, {"user_id": 34450, "stars": [], "topic_id": 39456, "date_created": 1308170136.41115, "message": "I think most people in a lean startup group have ambitions toward bootstrapping, so ideally it doesn't matter, but if you bootstrap a company in the social networking space today and the bubble pops a year from now while you're trying to raise a Series A, you might stagnate and die before the industry recovers.", "group_id": 10203, "id": 1404195}, {"user_id": 34450, "stars": [], "topic_id": 39456, "date_created": 1308171952.252017, "message": "I was actually just happy that Ben Horowitz had a solid counter-argument. All I had seen so far is rah-rah cheerleading from TechCrunch et al, which is only going to accelerate a bubble, IMO.", "group_id": 10203, "id": 1404549}, {"user_id": 34450, "stars": [], "topic_id": 39456, "date_created": 1308171879.4796829, "message": "In any case, I completely agree with the \"put a time frame on it or get out,\" so maybe I should get out. :)", "group_id": 10203, "id": 1404523}, {"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308175109.4916551, "message": "oh yeah. I wasn't saying you should \"get out\" of the prediction. You were sharing a counter-argument for the bubble so I was assuming you weren't convinced", "group_id": 10203, "id": 1404981}, {"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308175112.552753, "message": "and I wouldn't be super surprised to find out that the relationship between building a company that lasts and serves customers well and being lucky enough to start during a bubble is a murky relationship", "group_id": 10203, "id": 1404984}, {"user_id": 21129, "stars": [], "topic_id": 39456, "date_created": 1308175113.5065801, "message": "there's definitely an advantage for cashing out though", "group_id": 10203, "id": 1404986}]