[{"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1312367576.927707, "message": "Personally, I really prefer the combination of spaces and expose than mission control.", "group_id": 1295, "id": 1783477}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1312367947.1514311, "message": "And what I miss on mission control is the ability to move apps between the spaces(in focus and out of focus) and I really don't like the stack of windows of the same app, like the stack of safaris. Because if I have too many safaris open at a moment and let's suppose I'm trying to reach the last in the stack, I can't really see the content of the last window in that stack.", "group_id": 1295, "id": 1783490}, {"user_id": 12641, "stars": [], "topic_id": 43215, "date_created": 1312382279.0958769, "message": "You know Expose still exists, right? However, now it is limited to the windows of the active application. For example, if you have 5 Safari windows open, activating Expose highlights the individual windows of Safari for you. Give it a try.", "group_id": 1295, "id": 1784558}, {"user_id": 581, "stars": [], "topic_id": 43215, "date_created": 1312382491.2420011, "message": "I really like it. There's a lot of ways to switch applications, windows or desktops now and it all seems to work fairly well for me so far. As well as Mission Control, I still use apple-arrowkey to switch desktop as well as apple-tab to switch apps. I'm not really sure how I decide which one I'm going to use at any given point but it seems like there's always a way and it always gets me where I'm going.", "group_id": 1295, "id": 1784591}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1312543236.1535079, "message": "@FCGreg, I still use the Exposé, but I can't find a replacement for Exposé inside spaces. Let's say: I call spaces than I call exposé. Or am I wrong?", "group_id": 1295, "id": 1801199}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1312543363.53035, "message": "@Spencer what I miss is the ability to see all the windows under a given space, without having to alternate to an application than call exposé. It used to be much quicker when exposé worked for all the open windows.", "group_id": 1295, "id": 1801210}, {"user_id": 12641, "stars": [], "topic_id": 43215, "date_created": 1314166858.3312049, "message": "@masilva Sorry for the delayed reply. If I understand your point, Mission Control actually works this way already.  For example, create a second space/desktop, then switch to that desktop.  Now go back into Mission Control.  The applications shown in Mission Control will be the ones running on that desktop (hint: easiest way to see this is to launch a few separate applications on each desktop).  I hope that helps.", "group_id": 1295, "id": 1947254}, {"user_id": 19752, "stars": [], "topic_id": 43215, "date_created": 1315928507.355279, "message": "I like Mission Control but wish there were a few tweaks. For instance when you two finger swipe up to spread out the stacked apps it'll be nice to spead out a bit more even if it covers the other apps. Also a way to show minimized apps within mission control.", "group_id": 1295, "id": 2117373}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1316080240.1908431, "message": "@FCGreg what I would like to do is much simpler than this. I would like to be able to call mission control than call exposé inside this mode. It is that simple. My problem is that the app stack, usually, hides those windows that are in the very back of a given app stack.", "group_id": 1295, "id": 2132810}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1316079993.061801, "message": "@latca I think i got your point. Personally I'd like to be able to see those apps that are in the very back of an app stack. I don't really see anyway to do that other than select the app and call exposé.", "group_id": 1295, "id": 2132792}, {"user_id": 38255, "stars": [], "topic_id": 43215, "date_created": 1317284026.704263, "message": "You can also assign a \"Hot Corner\" to show one application's windows only, from the Mission Control/Expose Preference Pane, as in Snow Leopard.", "group_id": 1295, "id": 2239318}, {"user_id": 38255, "stars": [{"date_created": 1317330583.875433, "user_id": 12641}], "topic_id": 43215, "date_created": 1317283837.843648, "message": "Also, you can still move windows between spaces. There are two ways: 1) Drag a window to the edge of the screen (so that your cursor is at the edge)... wait... wait some more... finally, the window will move to the space that's on that side. 2) In Mission Control, drag a window from the bottom onto a space on the top row. It only works from bottom to top in this mode though, not vice versa, and not along the screen edge.", "group_id": 1295, "id": 2239294}, {"user_id": 38255, "stars": [{"date_created": 1317330503.3249099, "user_id": 12641}], "topic_id": 43215, "date_created": 1317283713.451751, "message": "@masilva, this \"hidden feature\" may help you: if you type Ctrl-<Exposé>, where <Exposé> is the key on your keyboard that triggers Exposé, that will show it only for the windows of the current application. So instead of going to Mission Control, you could pick an application with Cmd-Tab first, and then type Ctrl-<Exposé>.", "group_id": 1295, "id": 2239288}, {"user_id": 36547, "stars": [], "topic_id": 43215, "date_created": 1317391518.8643579, "message": "@levity tks. But one of my corners is set to mission control and another one to exposè. Even using these shortcuts, I still consider mission control much less efficient than spaces + exposè was.", "group_id": 1295, "id": 2248595}]