[{"user_id": 22259, "stars": [], "topic_id": 47500, "date_created": 1320444972.3966351, "message": "Startups como TeamBox: http://teambox.com/ \nDonde todo su código es open source y lo soportan de manera comercial.", "group_id": 965, "id": 2508372}, {"user_id": 22259, "stars": [], "topic_id": 47500, "date_created": 1320444995.9118249, "message": "O como Wordpress", "group_id": 965, "id": 2508377}, {"user_id": 10406, "stars": [], "topic_id": 47500, "date_created": 1320464624.502625, "message": "El modelo de negocio de una startup open source es solido si la tecnología es creada desde cero y si su rentabilidad no se basa en el uso de la herramienta sino en el engagement de la comunidad. Con un modelo como este, la mejor ventaja que obtiene la empresa es la creación de un circulo de usuarios que se involucran con la mejora de sus productos pero al mismo tiempo la detección de bugs y creación de nuevas features de manera colaborativa y acelerada. Sin embargo no todas las startups estan listas para usar el modelo y tampoco todas son aptas para hacerlo. Creo que ser open source como empresa es una decisión de negocios y no solo una tendencia en el desarrollo de software.", "group_id": 965, "id": 2509958}, {"user_id": 2946, "stars": [], "topic_id": 47500, "date_created": 1320473531.81774, "message": "No creo que una empresa que sea creada como \"open source\" tenga mucho sentido. Por el contrario, creo que un proyecto Open Source que se vuelve importante siempre puede encontrar un modelo negocio viable en algun momento. WordPress fue primero y Automattic fue mucho despues. Mismo caso ahora con el chico de nginx.", "group_id": 965, "id": 2510360}, {"user_id": 39911, "stars": [], "topic_id": 47500, "date_created": 1320502348.066391, "message": "Opino q es una gran desicion y no debe tomarse a la ligera. Puede fracasar o tener exito. Dependiendo de. Su estrategia publicitaria Ahi esta el caso de genuina Linux Vs microsoft. Es una gran idea existen varios modelos de negocio para empresas open source y Tambien algunas cuestiones legales a tener en cuenta. Aun con todo esto podemos ver el ejemplo de Red Hat q es open Source", "group_id": 965, "id": 2511682}, {"user_id": 37376, "stars": [], "topic_id": 47500, "date_created": 1320510789.284425, "message": "Mas ejemplos: OpenBravo, SugerCRM, vTiger, Elastix, dimdim, Trixbox, Asterisk, etc. cada uno con su respectiva estrategia lograron apalancarse de su código fuente y su comunidad para generar modelos de negocios interesantes.", "group_id": 965, "id": 2512334}, {"user_id": 25716, "stars": [], "topic_id": 47500, "date_created": 1324511692.7718959, "message": "Una idea economica acerca open source (para rentabilidad) es \"commoditize your complements\", una post acerca eso: http://www.joelonsoftware.com/articles/StrategyLetterV.html", "group_id": 965, "id": 2745506}]