[{"user_id": 10411, "stars": [], "topic_id": 12890, "date_created": 1300065084.091265, "message": "TiP BoF", "group_id": 3435, "id": 344482}, {"user_id": 10411, "stars": [], "topic_id": 12890, "date_created": 1300065124.1735511, "message": "Titus's Ridiculous talk", "group_id": 3435, "id": 344484}, {"user_id": 10411, "stars": [], "topic_id": 12890, "date_created": 1300065099.6591821, "message": "Beazley's Superbpoard talk", "group_id": 3435, "id": 344483}, {"user_id": 10411, "stars": [], "topic_id": 12890, "date_created": 1300250248.3195829, "message": "Some notes I typed up earlier:\n\nAs always, the conference itself was very informative and a lot of fun.   The conference was more or less run via convore, a new social media site that Peter has mentioned a couple of times here.  It is sort of like IRC / Yahoo Groups / Twitter.  All of the cool kids are doing it.  The group to watch out for is the \"PyCon 2011\" one (https://convore.com/pycon-2011/).  Basically, every talk has its own thread, so that you can go back and look at the commentary from the audience.\n\nThe talks are already up on blip.tv.  The ones that you *should* watch are as follows:\n\n    * Useful namespaces: Context Managers & Decorators (http://pycon.blip.tv/file/4881235/)  \n    * The QTile lightning talk (http://pycon.blip.tv/file/4884733/)\n    * Exhibition of Atrocity (http://pycon.blip.tv/file/4881168/)\n    * *** Handling Ridiculous Amounts of Data With Probabilistic Data Structures (http://pycon.blip.tv/file/4881076/) \n    * *** Using Python 3 to Build a Cloud Computing Service for My Superboard II (http://pycon.blip.tv/file/4878868/)\n    * *** Keynot: Hilary Mason (http://pycon.blip.tv/file/4878710/)\n\nOther talks were excellent as well, but these we my favorite picks.\n\nLike usual with PyCon, the open spaces (the unofficial shadow conference for those not versed in the lingua franca) were where great things happened again this year.\n\nThe most important one to us was a Scientific Computing \"Birds of a Feather\" (BoF).  From the excellent turnout (~40) and the feisty discussion, there definitely was a lot of interest.  Moreover, there was a directed interest at forming a larger community around scientific computing (in Python).  This is so people do not feel like there are constantly repeating the work of others or to pass down anecdotal knowledge.  \n\nFor instance, one question that kept coming up was \"I have this C/C++/Fortran library, how do I wrap it given the variety of options?\"  The answer we always came back with was \"Cython\".  But people, in the absence of knowing this upfront, have implemented some truly crazy solutions.  Worse, now they are too embedded in them to go back.\n\nNext in terms of importance, Peter ran a Data Visualization BoF.  I sadly could not attend, so maybe he will pipe up and tell you about it.  It seemed to go well and have similar attendance to the Scientific Computing BoF.\n\nLastly, the Testing in Python (TiP) BoF was a huge success again in its third year.  For a flavor of the TiP BoF, check out https://convore.com/pycon-2011/testing-in-python-bof-were-awesome-even-without-the-drinking/", "group_id": 3435, "id": 362605}, {"user_id": 10611, "stars": [], "topic_id": 12890, "date_created": 1300372562.43801, "message": "What was that sci-py (not to be mistaken with SciPy ;)) convore group that was mentioned?", "group_id": 3435, "id": 374400}, {"user_id": 10411, "stars": [], "topic_id": 12890, "date_created": 1300384730.9372671, "message": "@haz Oops!  Should be in the show notes... (https://convore.com/python-scientific-computing/)", "group_id": 3435, "id": 376000}, {"user_id": 20326, "stars": [], "topic_id": 12890, "date_created": 1300656710.7085481, "message": "At one point during the podcast, Geraldine brings up a misguided attendee of Jennifer Leech's diversity talk who asked in his talk whether having more women in programming would lead to better documentation and greater use of switch/case constructs. While I sympathize with his apparent attempt to acknowledge that greater diversity can mean broader skillsets and strengths, I think I speak for most of us when I say this guy was likely on crack.", "group_id": 3435, "id": 393910}, {"user_id": 20326, "stars": [], "topic_id": 12890, "date_created": 1300656711.5362511, "message": "And I really do think I speak for most of us. To expound some on the reaction to the questions, someone in line for questions uttered something to the effect of, \"What? WHAT? You've got to be kidding me!\" and stormed out. When Geraldine took a more proactive response and used her time at the questions mic to point out this guy's errors, the room erupted in applause.", "group_id": 3435, "id": 393911}, {"user_id": 20326, "stars": [{"date_created": 1300658297.255502, "user_id": 10411}], "topic_id": 12890, "date_created": 1300656715.9060559, "message": "Hopefully with the help of people like Geraldine the state of diversity and respect in Python, programming, and technology in general will improve. ", "group_id": 3435, "id": 393912}, {"user_id": 8649, "stars": [], "topic_id": 12890, "date_created": 1300896982.49105, "message": "@mikegraham The guy in question was, I believe, Gregg Lind (http://writeonly.wordpress.com/).  You will know him by his mutton chops!", "group_id": 3435, "id": 418509}]