[{"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299209576.733707, "message": "\"Data management with real and simulated semi-conductors\"", "group_id": 3435, "id": 266278}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299209574.6381631, "message": "Instrumentation?", "group_id": 3435, "id": 266276}, {"user_id": 11590, "stars": [], "topic_id": 10708, "date_created": 1299219328.6446781, "message": "I'm just looking at strengths of the group here: 1) Jes -  a chemist at UCSB; 2) Jason - Semiconductor circuit characterization based on SPICE; 3) Anthony - physicist and \"Mr Python\" 4) Me (Sean) - Computer Engineering major;", "group_id": 3435, "id": 267140}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299344354.2005799, "message": "@SeanKnudsen Well we all have some knowledge of semi-conductors is what ties this show together.", "group_id": 3435, "id": 276725}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299344412.251647, "message": "@SeanKnudsen Also I'd like it to have more of a 'real' world feel.  Jason and I can handle the software side of cirs.", "group_id": 3435, "id": 276727}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299478573.6545031, "message": "Thought I had today: On the software side, many programmers loose sight of the fact that what we code actually manipulates real physical processes.  Moreover, someone(s) had to design these processes.  I would like to talk about the implications for so many people to be so abstracted away from the physics / chemistry.\n\nIt is like we as humans have built this tool that not even the tool builders know how to build.  Has this ever happened before in human history?", "group_id": 3435, "id": 285888}, {"user_id": 19350, "stars": [], "topic_id": 10708, "date_created": 1299515449.6321521, "message": "@Scoptz Not only programmers, but chip designers, too.  I am surprised by how many digital logic designers forget that the underlying circuits are really analog.  I had one engineer ask why our \"measured\" (meaning SPICE) capacitance numbers for an input pin were different than his reference library. I explained that SPICE settings and measurement methodology all change the value. And he said, \"but SPICE is SPICE, which one is right? It's just a capacitor, right?\" Oh no...", "group_id": 3435, "id": 288695}, {"user_id": 19350, "stars": [], "topic_id": 10708, "date_created": 1299515524.055759, "message": "For recording on Tuesday, I am possibly available before 5pm but have a charity dinner thing to go to at 5pm. Any chance we could record earlier?", "group_id": 3435, "id": 288710}, {"user_id": 11590, "stars": [], "topic_id": 10708, "date_created": 1299523916.099529, "message": "I'm in California...It'd be nice if I could record after work. Earliest i could do would be 5PM PST.", "group_id": 3435, "id": 289666}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299526004.693372, "message": "@SeanKnudsen Which is 7pm my time.  This makes it seem like Wednesday may be better....", "group_id": 3435, "id": 289915}, {"user_id": 19509, "stars": [], "topic_id": 10708, "date_created": 1299559510.588089, "message": "I can't contribute much to discussing software aside from a few gripes here and there.  I'll probably just stick to talking about toys.  Characterization instruments?  Testing equipment?  Alternatively, how to build transistors/diodes from organic materials?  How to deal with the deluge of data that results from testing such devices?", "group_id": 3435, "id": 293692}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299601765.9173751, "message": "@CBC_psi \"How to deal with the deluge of data that results from testing such devices?\" is what I would like to focus on... Or at least hit.  I imagine that there will also be lots of talking about toys ;).", "group_id": 3435, "id": 297369}, {"user_id": 11590, "stars": [], "topic_id": 10708, "date_created": 1299625809.330507, "message": "I'm not sure what to say about too much testing data...i have a pretty straightforward feedback process at my work - test, fix, test fix. I generate lots of excel data sometimes, but there's always a way to cut down and get what you need graphed", "group_id": 3435, "id": 300382}, {"user_id": 10411, "stars": [], "topic_id": 10708, "date_created": 1299637692.657675, "message": "@SeanKnudsen Do you put your excel data under version control?", "group_id": 3435, "id": 301103}]