[{"user_id": 35646, "stars": [], "topic_id": 43940, "date_created": 1313578720.803436, "message": "Hello all.  At the last earth dreaming gathering I mentioned my involvement with Wildlaw.  I wanted to explain a little more of what this is all about, and also to invite you to a Wildlaw workshop weekend, from 23 - 25 September (which I know clashes with the Earth Rally event unfortunately).", "group_id": 11368, "id": 1891652}, {"user_id": 35646, "stars": [], "topic_id": 43940, "date_created": 1313578962.814265, "message": "hi all.  At the last earth dreaming event I mentioned my involvement with Wildlaw.  I wanted to explain a little more about what Wildlaw is about, and also to invite you to a Wildlaw workshop weekend happening over 23 - 25 September (unfortunately this clashes with the Mother Earth Rally).", "group_id": 11368, "id": 1891669}, {"user_id": 35646, "stars": [], "topic_id": 43940, "date_created": 1313581317.9837191, "message": "Wildlaw is based on the philosophy of Thomas Berry, in particular the book \"The Great Work\", which presents the culmination of his ideas.  In brief, his idea is that we stand at a defining moment in history and that humanity must move from being a disrupting force on Earth, to one of communion with all beings as a benign presence.   This transition is the Great Work.  The blurb at the back states \"Berry believes we stand at a defining moment in history, one in which the earth itself calls out to us to embark upon a resacralization of nature, a new ecological beginning.  Berry is our conscience, our prophet, our guide.  He speaks to what is best within us, in a voice that is inclusive, ecumenical, generous, and wise.  His Great Work should - and must - be ours.\" (Chet Raymo, \"Orion\").  Thomas Berry recently passed away.\n\nCormac Cullinan is an environmental lawyer practising in South Africa.  He was an advocate of Thomas Berry's philosophy and met with him on numerous occasions to discuss how Thomas Berry's ideas could be put into practical effect, through law and governance structures.  Through these discussions, they came up with the concept of \"Wildlaw\", a radically different understanding of the nature of law and governance.  It seeks to shift law from an anthropocentric governance system, one where humanity stands centre stage and nature is seen as a resource to be used (albeit these days we now look to using nature \"sustainably\" but without properly understanding what we meant by this), to one where nature herself has rights i.e. an earth-centred governance structure.  All these concepts are described in Cormac's book \"Wild Law: A Manifesto for Earth Justice\".\n\nCormac, along with Polly Higgins, has been one of the leading figures in the move to give rights to nature.  At the World's People's Summit in Cochobamba in April 2010, he helped set up the Global Alliance for the Rights of Nature.  The link below is a video of him speaking at that event. \nhttp://therightsofnature.org/cormac-cullinan-on-wild-law/\n\nThere has been a Wildlaw group in England for a number of years now, an educational group which was a sub-group of UKELA (United Kingdom Environmental Law Association).  Following the Cochobamba Earth Summit and the formation of the Global Alliance for the Rights of Nature, a number of WildLaw lawyers wanted to set up a campaigning arm of Wildlaw, to promote the concepts of Wildlaw and rights for Nature.  As Ukela is non-partisan, a separate unincorporated association was formed called \"Wild Law UK\", and I helped formulate the constitution and aims and principles of this group.  An embryonic website has now been launched, see the link:\n\nhttp://www.wildlawuk.org/\n\nWild Law UK has joined the Global Alliance for the Rights of Nature and, over the last few months, it has been formulating its strategy for a campaign, which will centre on a campaign for a Parliamentary Bill for the Rights for Nature, similar to what is and has been done in Bolivia.\n\nThe Wildlaw workshop weekend is wider than the Wildlaw UK campaign, and there will be a number of workshops and discussions around the theme of \"Earth, Society and Commons - law in a time of economic and ecological change\".  More info is at the link below.\n\nhttp://www.ukela.org/rte.asp?id=12&task=View&itemid=166\n\nThis is an invite and forum for those who are interested in:\n\n(1) attending the wild law weekend; and/or\n\n(2) discussing and exploring how the links between Wildlaw and Earthdreamers could be strengthened", "group_id": 11368, "id": 1891847}, {"user_id": 35646, "stars": [], "topic_id": 43940, "date_created": 1313684692.771152, "message": "test", "group_id": 11368, "id": 1902632}, {"user_id": 16107, "stars": [], "topic_id": 43940, "date_created": 1314367571.5655949, "message": "hi Mothiur, you have created a whole new group rather than a new topic on the earthdreamers network group - for others to see what you've posted you'll need to re-post within the group.", "group_id": 11368, "id": 1968458}, {"user_id": 35646, "stars": [], "topic_id": 43940, "date_created": 1324732989.725847, "message": "oh I see!  I am so computer illiterate.  Ok, will repost with some amendments now that 3 months have passed, thanks :)", "group_id": 11368, "id": 2746338}]