[{"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301615583.8097091, "message": "I'm finding myself down to one choice until I have a storyform, but have something of a stumbling block. I can choose several things to nail it down, but the ones that I feel like I know best are black and white, yet I don't know which to pick.\n\nFor example, I have to pick \"accurate\" or \"non-accurate\". The problem in the Subjective story is that Character A isn't what Character Z wants them to be. \n\nI could state this as a negative of \"accurate\": You are not within tolerances. \nOr, I could state this as a positive of \"non-accurate\": You are not within tolerances.", "group_id": 2515, "id": 497777}, {"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301615611.446713, "message": "I can go into the Symptom/Response (in this case Expectation/determination) and play the same game:", "group_id": 2515, "id": 497780}, {"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301615656.0293729, "message": "You are not what I expected, and I'm determined to make you better VS. I've determined that you're not what I want, so I'm going to make you meet my expectations.", "group_id": 2515, "id": 497786}, {"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301615658.9894979, "message": "Any advice?", "group_id": 2515, "id": 497787}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301617231.4971609, "message": "The negative of accurate is not equal to non-accurate. It is more akin to the lack of accuracy. Is it that Character Z lacks accuracy or that there is an overabundance of inaccuracy? The symptom/response direction is easy to swap because I believe it is more of an analog sliding scale, rather than the binary aspect of problem/solution. In other words, its easy to see it going from one to the other or vice versa.", "group_id": 2515, "id": 497911}, {"user_id": 13109, "stars": [], "topic_id": 16620, "date_created": 1301618774.747159, "message": "How would you tell if something lacks accuracy versus having an overabundance of inaccuracy? Wouldn't they manifest as the same thing when looking at the result.  How would you go about determining which is caused by which, if there is a distinction?", "group_id": 2515, "id": 498043}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301624701.9942911, "message": "But as far as Accurate/Non-accurate goes -- Let's say you were tasked with entering a village you knew contained suspected terrorists and your job was to apprehend them. Now if you had elements in your team that were operating with a lack of Accuracy you might find some of your team traversing from house to house grabbing whoever looked guilty, taking innocent bystanders along with some of the bad guys. Obviously a problem. If instead your team was operating with a problem of Non-Accurate, you may have been given bogus tips or fed the wrong information, maybe even the name of the town was wrong. Again, another Problem, but entirely different from the first.", "group_id": 2515, "id": 498628}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301624437.546056, "message": "Its easier to see this with the more familiar Motivation elements--the lack of Faith is not the same as Disbelief, the lack of the motivation to Pursue is not the same as Avoiding, the lack of Chaos doesn't mean Order, and so on.", "group_id": 2515, "id": 498614}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301624821.9931509, "message": "The difference between the two continues on into the Solution. For the first, a Solution of Non-Accurate would have you getting rid of the intolerable aspects of your team - those rogue individuals who were operating with a lack of Accuracy. With them gone there would no longer be a problem. The second scenario would have you simply replacing the Non-Accurate info with more Accurate up-to-date information. Again, a different solution for a different problem.", "group_id": 2515, "id": 498638}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301625005.5296049, "message": "In a story, I think it is less important that you are precise with these definitions and more important that whatever stance you take, whatever your interpretation of Accurate and Non-Accurate, within tolerances of course (!), remains consistent throughout the entire story. I don't think the elements are pinprick holes as much as they are general areas that describe an analog range of the chart of elements. There are borders, to be sure, Pursuit has its own little area, as does Avoid, but I don't think it is as important to obsess over which one is \"right\" and which one is \"wrong.\" Its probably better to just pick one and move on.", "group_id": 2515, "id": 498657}, {"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301636122.7641621, "message": "Except, of course, that I'd be picking at random.", "group_id": 2515, "id": 499697}, {"user_id": 7664, "stars": [], "topic_id": 16620, "date_created": 1301636201.0970261, "message": "I mean, I've written 60 pages of what would be a (22x60= ) 1,320 page script and don't want to be led along by a guess, because I probably have some leanings that I just haven't been able to notice yet.", "group_id": 2515, "id": 499699}, {"user_id": 7645, "stars": [], "topic_id": 16620, "date_created": 1301675356.9664409, "message": "Do you want me to take a look at it?", "group_id": 2515, "id": 503168}, {"user_id": 10814, "stars": [], "topic_id": 16620, "date_created": 1301685153.4975121, "message": "The trick is to keep everything, including a \"problem,\" in context.  \n\nSo, for the Subjective Story problem of Accurate, it might read:  The trouble with our relationship is that everything has to reside within acceptable bounds.  In order to make this relationship work we need to break out of our box (Solution of Non-Accurate).\n\nFor the Subjective Story problem of Non-Accurate:  The trouble with our relationship is that it is all happening outside of acceptable parameters.  In order to make this relationship work we need to bring it back within tolerances.\n\nNow, the troubles with their relationship can come from the inside OR the outside, so who sets the \"norm\" for what is tolerable or outside of tolerance (as opposed to intolerable), is up to you.  It could be one party, both, or someone outside the relationship (e.g. social or familial pressures) that determine the accuracy scale.\n\nNOTE:  Often when I think of accuracy, I think of the context (or scale) that determines accuracy.  Tolerable is usually at the positive side of the accuracy scale, and intolerable is at the negative side of the scale.  Non-accurate is outside the scale completely -- kind of like walking to the beat of a different drummer.", "group_id": 2515, "id": 504707}]