[{"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298138036.7680371, "message": "I have been on the Board of Directors for almost one year now, and I am interested to see what questions there are about the board, and the PSF in general there are. I am also interested in hearing your opinions.", "group_id": 292, "id": 150036}, {"user_id": 1736, "stars": [], "topic_id": 7498, "date_created": 1298138789.7525239, "message": "@jessenoller I think the biggest general question is probably \"What do you do?\" (other than eat all the bacons). Even speaking frequently with a fair number of board members I still feel like the PSF is a black box from which email and sprint funding appears.", "group_id": 292, "id": 150081}, {"user_id": 5388, "stars": [], "topic_id": 7498, "date_created": 1298139699.474874, "message": "Or would like to see more off?", "group_id": 292, "id": 150108}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139270.896276, "message": "@coderanger In short, we maintain the IP and trademarks of \"python the language\" while also accepting donations/sponsorship from people and companies which is then spent back into the community in the forms of PyCon, developer grants, and other community focused projects.", "group_id": 292, "id": 150093}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139355.060956, "message": "@coderanger For example, http://www.python.org/psf/records/board/resolutions/ lists all of the resolutions that the board has approved. We assist in funding conferences world-wide as well as individual developer projects. We also pay for the infrastructure that runs Python.org and all of the core \"development\" tools.", "group_id": 292, "id": 150096}, {"user_id": 6559, "stars": [], "topic_id": 7498, "date_created": 1298140534.9377871, "message": "How do you deal with trolls?", "group_id": 292, "id": 150120}, {"user_id": 1736, "stars": [], "topic_id": 7498, "date_created": 1298139595.975054, "message": "@jessenoller I mean on a more day-to-day level. I feel like the actions and meetings of the board really aren't publicized as well as they could be.", "group_id": 292, "id": 150103}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298140555.6889651, "message": "@mitsuhiko Quietly, in the dark of night.", "group_id": 292, "id": 150122}, {"user_id": 5388, "stars": [], "topic_id": 7498, "date_created": 1298139687.5194559, "message": "Is there anything that PSF needs from its own community?", "group_id": 292, "id": 150107}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139726.27842, "message": "@coderanger I completely agree, actually - they aren't publicized, marketed or spread out in the community as much as it could be. Doug Hellmann and his communications team have been working on the blog: http://pyfound.blogspot.com/ but we need to do more.", "group_id": 292, "id": 150109}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139833.16786, "message": "@coderanger quite/quiet.", "group_id": 292, "id": 150114}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139800.282692, "message": "@coderanger Day to day though, it's quite: We keep the books, discuss any applications or projects going on, etc. The biggest task that flies under the banner of the PSF is PyCon - which is funded and managed by the PSF. In the case of PyCon, the board acts as an oversight committee.", "group_id": 292, "id": 150112}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298139857.6784959, "message": "@Zolomon Interesting question. Let me think about this one for a bit.", "group_id": 292, "id": 150115}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298140667.8772669, "message": "@zolomon more money. =)", "group_id": 292, "id": 150124}, {"user_id": 831, "stars": [], "topic_id": 7498, "date_created": 1298140924.8338389, "message": "And more contributor agreements :)", "group_id": 292, "id": 150136}, {"user_id": 719, "stars": [], "topic_id": 7498, "date_created": 1298145561.4678841, "message": "@jessenoller A fairly random question (I'm just curious): Is there any actual connection with  the Monty Python crew (apart from the language name.)", "group_id": 292, "id": 150410}, {"user_id": 1152, "stars": [{"date_created": 1298145238.462558, "user_id": 1}], "topic_id": 7498, "date_created": 1298145230.330893, "message": "I have taken the liberty/editorial control of removing the mildly innapropriate links and discussion from this topic. I would appreciate it if we could keep it somewhat on topic, and not allow it to devolve.", "group_id": 292, "id": 150390}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298145337.7041781, "message": "@jessenoller I'll be happy to pitch in as necessary here, though you currently appear to be doing a fine job.", "group_id": 292, "id": 150396}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298146422.8237381, "message": "@micrypt None that I am aware of.", "group_id": 292, "id": 150434}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298146488.4429209, "message": "@Gulopine Not really, I know of several PSF/Python-Core related book projects, but AFAIK we do not get directly involved in the author community. I do think we should probably do more to promote Python books, but that requires an outlet or site wherein we could do so.", "group_id": 292, "id": 150439}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298148165.0136411, "message": "Does the PSF want more official members, or is the current distinction between PSF and the broader community working well?", "group_id": 292, "id": 150498}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298146009.703331, "message": "Does the PSF ever get involved in books that are published about Python? Recommending authors or publishers, providing sponsorship or marketing, anything like that?", "group_id": 292, "id": 150423}, {"user_id": 1152, "stars": [{"date_created": 1298147916.067235, "user_id": 8}, {"date_created": 1298165471.300127, "user_id": 5942}], "topic_id": 7498, "date_created": 1298147319.6201911, "message": "@zain Decisions are based on the merit of the project, the goals and the perceived value to the ecosystem and community. A good project adds value to the community as a whole, or moves forward a key project (such as python-core, Python 3, or say, twisted). As to how they get a slice: They type up a detailed proposal and submit it to the PSF for funding. An example proposal is Brett Cannon's https://docs.google.com/document/d/1xjlx82lG75R90yIAHCfVbZlI9Va12DvXqiUE_h7dU4Q/edit?hl=en", "group_id": 292, "id": 150461}, {"user_id": 8, "stars": [], "topic_id": 7498, "date_created": 1298146151.2448289, "message": "how does the PSF decide what projects are worth paying someone to code up? and how do developers get a slice of that sweet sweet PSF money?", "group_id": 292, "id": 150430}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298146826.6270609, "message": "Raymond Hettinger started a project called \"Python Swallowed Whole\" but it is moving very slowly, if at all.", "group_id": 292, "id": 150453}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298148622.0822029, "message": "@Gulopine We're constantly adding members. I'm working on a document which I hope better explains why the distinction matters/is relevant, but not as important as some might assume.", "group_id": 292, "id": 150515}, {"user_id": 1152, "stars": [{"date_created": 1298150917.476758, "user_id": 1}, {"date_created": 1298157439.499758, "user_id": 8391}, {"date_created": 1298630369.8270841, "user_id": 4889}], "topic_id": 7498, "date_created": 1298150796.537957, "message": "@Gulopine Actually, we do not accept applications/self nominations - all PSF Nominated members (PSF Members) are nominated from within the existing PSF membership, and then voted on. Only Sponsor members self-apply, and are then voted on.", "group_id": 292, "id": 150592}, {"user_id": 1152, "stars": [{"date_created": 1298152275.933398, "user_id": 1}, {"date_created": 1298155766.5695119, "user_id": 719}, {"date_created": 1298356698.1404419, "user_id": 5388}], "topic_id": 7498, "date_created": 1298152064.4574981, "message": "@Zolomon What I mean to say, by quoting this is that what the PSF needs from the community to to keep being a community. Keep doing what you're doing. Help promote Python, make Python Companies and Jobs, help your fellow programmer, writer, student or business.", "group_id": 292, "id": 150650}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298149921.4135439, "message": "I know it's technically by nomination, but do you guys ever actively approach anyone for PSF membership, or is it strictly people asking for a nomination?", "group_id": 292, "id": 150557}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298151096.7984359, "message": "@ericflo I hate to say it that way, because it makes it sound like an exclusive club: it's not, it's part legal requirement, part the way things have been done, and part \"do we want 3,000,000 members voting on board members\"? Essentially, people get nominated based on their contributions to the community and ecosystem - every time nominations come up, we always end up finding people in the community who deserve nomination, but everyone \"just assumed\" was already a member.", "group_id": 292, "id": 150607}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298151366.4317341, "message": "ah. i had read that, but i guess i assumed those nominations came from people talking to PSF members directly and asking for a nomination", "group_id": 292, "id": 150626}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298150817.0573969, "message": "@Gulopine See: http://www.python.org/psf/membership/", "group_id": 292, "id": 150595}, {"user_id": 1, "stars": [], "topic_id": 7498, "date_created": 1298150926.0800321, "message": "@jessenoller Wow, I did not know that at all.  Good info.", "group_id": 292, "id": 150600}, {"user_id": 1152, "stars": [{"date_created": 1298151221.662874, "user_id": 1}], "topic_id": 7498, "date_created": 1298151207.364397, "message": "@Gulopine @ericflo the important thing is to realize that PSF members are a legally recognized entity, with voting rights within the organization. Too many people, and it falls over. Too few, and it's non representative. It's a fine line to walk maintaining a healthy size while ensuring a diversity of opinion and person.", "group_id": 292, "id": 150612}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298151588.1764979, "message": "@Gulopine Yeah, I don't think I've seen people ask for nominations. Really, it's not a glam position :) - and yes, we always (every year) take on new members, in hopes it brings fresh opinions and ideas.", "group_id": 292, "id": 150633}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298151452.686172, "message": "yeah, that last bit was why i asked earlier if you guys actively want more members or not. i expect you'd always want fresh opinions, but there's a certain threshold after which it becomes unwieldy", "group_id": 292, "id": 150630}, {"user_id": 1152, "stars": [{"date_created": 1298356700.2186041, "user_id": 5388}], "topic_id": 7498, "date_created": 1298152151.183672, "message": "@Zolomon If, in the course of any of this - you can find time to help out on the Python website, python-core, or an announced PSF project, such as the sprints project and others, then by all means: we need more help. If, in your travels and work find a company or person willing to donate money, or become a sponsor member - that helps us too.", "group_id": 292, "id": 150653}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298151899.2837889, "message": "What @holdenweb said too, I've just never heard of anyone asking to be nominated, and never though to ask.", "group_id": 292, "id": 150642}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298151972.517324, "message": "@Zolomon I have an answer for you, from a piece I am working on about the PSF. To quote:", "group_id": 292, "id": 150644}, {"user_id": 3354, "stars": [{"date_created": 1298153672.8288319, "user_id": 1760}], "topic_id": 7498, "date_created": 1298151752.8143461, "message": "There is nothing to stop anyone from asking a PSF member they know to nominate them - there are no rules about how the nomination comes to be made. Ultimately, the members decide by voting on each nomination.", "group_id": 292, "id": 150637}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298151979.2454841, "message": "\"Each and every Python programmer, author, and individual talking about Python right now is performing the mission of the PSF. Every bit of work (from writing code and documentation, to answering a question) moves Python's ecosystem forward. Every person reading this post or commenting about Python moves it forward. Essentially - if the ecosystem is a codebase - all of you have the commit bit.\"", "group_id": 292, "id": 150645}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298152175.311734, "message": "@micrypt That's a very low traffic list, and is not utilized as much as it probably should be.", "group_id": 292, "id": 150656}, {"user_id": 719, "stars": [], "topic_id": 7498, "date_created": 1298151936.4382429, "message": "I'm looking through the PSF-volunteers mailing list archives (http://mail.python.org/pipermail/psf-volunteers/). It seems there hasn't been much activity on there lately. Was it migrated elsewhere?", "group_id": 292, "id": 150643}, {"user_id": 207, "stars": [], "topic_id": 7498, "date_created": 1298154020.9250071, "message": "yeah, i'm actually already subscribed to that", "group_id": 292, "id": 150727}, {"user_id": 1760, "stars": [], "topic_id": 7498, "date_created": 1298153776.775656, "message": "@Gulopine Check out http://mail.python.org/mailman/listinfo/python-authors if you're interested in talking to other authors or asking general questions of publishers/editors. Very low traffic list.", "group_id": 292, "id": 150718}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298213587.956218, "message": "@jessenoller - do you feel that, as a result of PSF affiliation, there are things you'd like to say, do, write, participate in, etc., that become politically unwise or otherwise problematic? Sometimes membership has its detriments (in my experience - not with the PSF).", "group_id": 292, "id": 153670}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298214242.8074639, "message": "@jonesy Ha. You don't know me very well. In essence - no, I don't think that the PSF or the PSF-Board reduces my ability to say anything. I was voted in as a member of both the PSF and the board because of who I am, and if I had to squelch that because of membership, I would happily resign.", "group_id": 292, "id": 153688}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298214295.6244581, "message": "@jonesy I will add though, I do frequently couch things I say as \"speaking as a member of the board\" - so that people understand that sometimes, I am speaking \"officially\".", "group_id": 292, "id": 153694}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298214519.9418349, "message": "@jonesy As an aside though; I do find that operating within the confines of the board and the membership sometimes leaves me... frustrated. It does not limit my ability to say things or participate in anything, though.", "group_id": 292, "id": 153713}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298215131.573561, "message": "@jessenoller I've discontinued participation in things for those exact reasons (squelching, along with a sort of addiction to committee-ism that led to a sort of 'formalized disorderly chaos\"). Embittered by those experiences I suppose, I'm much slower and more cautious about participation. Thanks a lot for your comments. A more brutally honest and transparent PSF is a better PSF imo :)", "group_id": 292, "id": 153764}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298219626.670567, "message": "@jonesy I despise bureaucracy, squelching and over committee-ism. I personally fear organizations like, say, the ASF which, from an outside observer standpoint look like the ultimate political/bureaucratic organization.", "group_id": 292, "id": 154089}, {"user_id": 3748, "stars": [], "topic_id": 7498, "date_created": 1298220231.9580059, "message": "Do PSF make decisions about keeping the python core with svn, mercurial, git or anything else?", "group_id": 292, "id": 154112}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298220496.9596579, "message": "The term \"BDFL\" indirectly implies that the language will likely outlive its author. Has the PSF defined a protocol for electing/appointing a next BDFL? Will there be a next BDFL? If not, what mechanism will be put in place to insure that things can continue to move forward? Just curious. Long live our BDFL!", "group_id": 292, "id": 154139}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298223873.4129679, "message": "I think Jesse's gone off-line for a while.", "group_id": 292, "id": 154246}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298224093.0971401, "message": "The relationship between the PSF and the developers is a sensitive one, and as PSF chairman I don't  believe I have the right to dictate tot hem. I do not think the PSF can legitimately appoint a BDFL - that role must come by popular acclaim. AS an aside, however, Barry Warsaw has been campaigning from the sidelines as FLUFL -- Friendly Language Uncle for Life. See PEP 401 - http://www.python.org/dev/peps/pep-0401/", "group_id": 292, "id": 154252}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298224533.819638, "message": "@jonesy Guido is already well aware of when he is a bottleneck in the decision process for things, so we have adjusted procedures as needed. For instance, we now have PEP dictators which get chosen who make the final call when Guido feel disinclined to make the call himself. And with the language as stable as it is his required involvement isn't that great. As for some successor plan for the next BDFL, there is not explicit one that Guido has told anyone.", "group_id": 292, "id": 154264}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298224902.234807, "message": "Yes, I will answer more questions later (haven't seen the family all weekend) - others can chime in obviously. (as Steve and Brett already have) if I have anything to add I will do so later.", "group_id": 292, "id": 154289}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298257013.7178569, "message": "Monitoring ...", "group_id": 292, "id": 155758}, {"user_id": 222, "stars": [], "topic_id": 7498, "date_created": 1298296176.3875289, "message": "@jessenoller I'd personally like to see more resources thrown at alternatives to CPython such as PyPy. Py3k on CPython is a dead end (for me, anyway). We're writing more and more code in languages other than Python for performance / concurrency reasons. If Py3k fixed that stuff, there would be hope.", "group_id": 292, "id": 158680}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298294961.6712661, "message": "Let me offer this question to anyone reading: As some of you are PSF members, and potential ones (community members) - what can we, as an organization and board do better? What can we do for YOU, we exist solely to improve the community and ecosystem.", "group_id": 292, "id": 158603}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298296600.3680611, "message": "@jessenoller  Well, that raises some other questions about the PSF's involvement in steering individual projects that have a drastic impact on the ecosystem :)", "group_id": 292, "id": 158713}, {"user_id": 5639, "stars": [{"date_created": 1298303111.022949, "user_id": 4156}, {"date_created": 1298322506.5676341, "user_id": 1736}, {"date_created": 1298333882.277276, "user_id": 1760}, {"date_created": 1298393521.739382, "user_id": 222}, {"date_created": 1298551832.7585001, "user_id": 12274}, {"date_created": 1298631029.9263639, "user_id": 4889}], "topic_id": 7498, "date_created": 1298296652.130415, "message": "@jessenoller I'd personally like to see PyPI completely dumped. Thrown out, and redone. I know that's drastic and unlikely, but that's honestly what I'd like to see.", "group_id": 292, "id": 158714}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298318226.353632, "message": "starting at my site basically because it's a really good test bed, and we need/want features.", "group_id": 292, "id": 165610}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298315175.46681, "message": "@jonesy It probably wouldn't be as hard as you think. If someone developed a mirror that managed to keep the same functionality (or damn close to it) and it had good traction with active developers, a switch could be considered. And this can be done with the XML-RPC interface today.", "group_id": 292, "id": 162890}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298315716.2931941, "message": "@brettcannon I started some work on an implementation of PyPI, but unfortunately finishing it will have to wait until after the book is done (June or so). It doesn't do XML-RPC, but there's no reason it couldn't. In fact it might be easier to implement an XML-RPC interface for 'legacy tool support' and leave HTTP clean to handle new tools. I honestly didn't think easy_install/pip supported xmlrpc. /me double checks", "group_id": 292, "id": 163382}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298315728.04247, "message": "said work: https://github.com/bkjones/MinistryOfPackages", "group_id": 292, "id": 163393}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298317576.6877389, "message": "@jonesy I actually meant *you* use the XML-RPC interface to pull from PyPI. That way you can at least start life as a snazzy mirror that people can gravitate towards using over PyPI directly.", "group_id": 292, "id": 165021}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298318184.7881811, "message": "@brettcannon whoops ;-P Glad I didn't miss a feature in easy_install. Yes, the plan was to create a mirror for my local site using MoP and slowly grow it from there. Once it has a useful feature set, set up a public mirror, and release the code.", "group_id": 292, "id": 165569}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298319244.528156, "message": "@bob Well, Py3k just enhanced performance a good amount, but I agree with you - but as for alternative implementations - PyPy is the only one with viable development resources behind it. I see Jython and IronPython as languishing, and Unladen Swallow as ... close to not breathing. Also, the PSF doesn't \"fund\" python-core directly - we've funded applications for grants for people working on Python core. PyPy and other projects *can* submit requests for funding.", "group_id": 292, "id": 166579}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298319429.4298379, "message": "@jonesy The PSF only funds the infrastructure PyPI runs on. If a viable alternative were blossom within the community, it could apply for funding/backing as well. As someone who has serious issues with PyPI as it exists today (which I have never hid) I encourage this work.", "group_id": 292, "id": 166759}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298319338.5038409, "message": "@bob Perhaps we need to communicate it more, I can say there is some news about this subject coming out of the PSF around Pycon, but again - we normally don't \"go looking\" for things to fund, instead letting the organization apply. PyPy has not. No one has requested funding for Unladen Swallow work. Etc, Etc.", "group_id": 292, "id": 166679}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298319507.983218, "message": "@bob Also note, if developer(s) wanted to work on CPython internals to do GIL removal, Unladen Swallow, etc, etc, - they could apply for funding too, hence not making CPython's interpreter a dead end. Essentially, no one has shown interest.", "group_id": 292, "id": 166828}, {"user_id": 1152, "stars": [{"date_created": 1298320527.22861, "user_id": 1}, {"date_created": 1298322556.715179, "user_id": 1736}, {"date_created": 1298333998.113513, "user_id": 1760}], "topic_id": 7498, "date_created": 1298320005.1692309, "message": "Let me add an unasked question - how does the PSF fund something? Normally, we do not go out looking for \"things to fund\" - instead, we let developers, projects and others come to us and ask for funding. The recent sprints project (http://pythonsprints.com/) is the most aggressively marketed \"LET US FUND YOU\" project I've seen from the PSF. That said, we do not market the fact we accept applications well, nor is it clear what are acceptable guidelines. Hence, it is a process few take advantage of outside of conferences.", "group_id": 292, "id": 167229}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298320037.1269829, "message": "I am working on explaining the above a lot better in the piece I am writing, which I hope becomes a part of the official PSF documentation on the site one day.", "group_id": 292, "id": 167258}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298345803.602849, "message": "@jonesy talk to @pydanny about django-packages. I can't see anything that wouldn't work in the broader context of Python generally, but I don't know *that* much about it.", "group_id": 292, "id": 176888}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1298345906.6171889, "message": "@jessenoller: I think your sprints initiative from the Board will (over time) help people realise that the Foundation does fund Python projects.", "group_id": 292, "id": 176891}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298375476.986316, "message": "@holdenweb Yup; but it's step 1 of many. Next is resurrecting the grants project, getting what funds we do have publicized, and so on.", "group_id": 292, "id": 178654}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298394283.6235621, "message": "@bob Of course, you mention Py3's memory usage, but in the same statement mention pypy :)", "group_id": 292, "id": 180429}, {"user_id": 222, "stars": [], "topic_id": 7498, "date_created": 1298394036.470324, "message": "@jessenoller maybe \"going looking\" for things to fund will help market the fact that the PSF does fund things. A few well known success stories should help reverse the \"deal flow\" :)", "group_id": 292, "id": 180342}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298394261.0776851, "message": "@bob Good, and valid points - I can't talk about it right now, but expect more news on this very front around PyCon. You've also given me an idea for a \"Make CPython faster\" PSF bounty.", "group_id": 292, "id": 180421}, {"user_id": 222, "stars": [], "topic_id": 7498, "date_created": 1298393885.82408, "message": "@jessenoller yeah, nobody capable wants to do hard work on the CPython VM because it's more practical to start from somewhere else without all of the baggage... hence PyPy, or something like that. By resources I don't just mean money… maybe, for example, the PSF could promote PyPy on python.org. Glad to hear Py3k performance is at least going somewhere, although the next big reason I don't want to use Py3k is RAM usage (unicode for everything with UCS2 or UCS4 backing = sad panda).", "group_id": 292, "id": 180303}, {"user_id": 1398, "stars": [{"date_created": 1298396961.5407121, "user_id": 5639}], "topic_id": 7498, "date_created": 1298394889.290689, "message": "@jonesy I'll be covering the nascent pythonpackages.com project during my case study at PyCon. http://us.pycon.org/2011/schedule/presentations/56/", "group_id": 292, "id": 180549}, {"user_id": 4219, "stars": [], "topic_id": 7498, "date_created": 1298405240.5286119, "message": "what is your relation with the python software foundation? (your about me page is empty!)", "group_id": 292, "id": 182122}, {"user_id": 222, "stars": [], "topic_id": 7498, "date_created": 1298405585.9513259, "message": "@jessenoller fair enough, we're not using PyPy either so I don't have any experience with its RAM hoggishness, but I have more hope (not based on anything first-hand) that I can write code that runs how we need it to in PyPy than in Py3k", "group_id": 292, "id": 182194}, {"user_id": 1736, "stars": [], "topic_id": 7498, "date_created": 1298405958.145689, "message": "@convy Jesse is a member, Steve (@holdenweb) is the chairman.", "group_id": 292, "id": 182277}, {"user_id": 3354, "stars": [{"date_created": 1298436731.377161, "user_id": 8391}], "topic_id": 7498, "date_created": 1298413603.807714, "message": "@coderanger: Jesse is a member not only of the PSF but also of it Board, as a Director", "group_id": 292, "id": 184375}, {"user_id": 1736, "stars": [], "topic_id": 7498, "date_created": 1298426535.207921, "message": "@jessenoller Also lead baconator", "group_id": 292, "id": 185492}, {"user_id": 14957, "stars": [], "topic_id": 7498, "date_created": 1298426616.131325, "message": "mmmm... bcon", "group_id": 292, "id": 185499}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298426258.7101059, "message": "@convy I am a member of the PSF, and one of the Board of Directors, and Python-core has not revoked my commit keys yet.", "group_id": 292, "id": 185475}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298426291.944957, "message": "@bob We'll see if that assertion holds true; and I do hope it does.", "group_id": 292, "id": 185477}, {"user_id": 12747, "stars": [{"date_created": 1298436750.039453, "user_id": 8391}, {"date_created": 1298738821.1925869, "user_id": 13912}], "topic_id": 7498, "date_created": 1298433256.251955, "message": "Does PSF have funds/abilities to have the functions in hashlib audited for security?", "group_id": 292, "id": 185677}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298448967.271374, "message": "@williamratcliff Depends on how much that is. =) Honestly it requires someone to propose a grant to do the work with an attached cost, at which point it will get reviewed and either approved or denied.", "group_id": 292, "id": 186212}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298473831.748805, "message": "@williamratcliff What @brettcannon said: We need someone with the skill and know how to present an application for funding.", "group_id": 292, "id": 187945}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298600441.4135771, "message": "Anyone have any other interesting questions?", "group_id": 292, "id": 205073}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1298604154.7019241, "message": "@jessenoller Does anyone actually work as a full-time employee of the PSF?", "group_id": 292, "id": 205389}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1298645894.905107, "message": "@jonesy Yes, the Secretary (Pat Cambell) - the Treasurer is paid part-time.", "group_id": 292, "id": 208299}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298678094.9326029, "message": "@bob Have you looked at http://python.org/dev/peps/pep-0393/ in terms of your string memory usage worry?", "group_id": 292, "id": 212157}, {"user_id": 222, "stars": [], "topic_id": 7498, "date_created": 1298738585.7868421, "message": "@brettcannon yeah, I think that is a good step, but doesn't do anything for me until it's accepted and implemented.", "group_id": 292, "id": 214770}, {"user_id": 2863, "stars": [], "topic_id": 7498, "date_created": 1298784165.801702, "message": "@bob I'm sure Martin would appreciate help =)", "group_id": 292, "id": 216556}, {"user_id": 7, "stars": [], "topic_id": 7498, "date_created": 1299114884.7326601, "message": "they also approved plans to allow individual sponsored members, $99/yr to be a non-voting member of the pSF", "group_id": 292, "id": 255293}, {"user_id": 5639, "stars": [], "topic_id": 7498, "date_created": 1299114825.8349791, "message": "Never thought of this question until @holdenweb just tweeted about doing more grants \"as the PSF gets more money\".... how *does* the PSF get money? What are its biggest sources of revenue? What avenues for new revenue are being explored? Is there a wiki page on this or something? (ping @jessenoller @holdenweb)", "group_id": 292, "id": 255281}, {"user_id": 7, "stars": [], "topic_id": 7498, "date_created": 1299114860.3653519, "message": "Corporate members/sponsors I'd imagine", "group_id": 292, "id": 255286}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1299119361.931232, "message": "@jonesy What alex said. See http://www.python.org/psf/sponsorship/ - other than that, it's donations (http://www.python.org/psf/donations/) and potentially the new project Alex mention (the 99$ non voting membership). Additionally, when PyCon makes a profit, that money goes to the PSF.", "group_id": 292, "id": 256256}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1299119397.9910669, "message": "As for what avenues are being explored: I listed them above. We're not actively looking for more avenues for funding, we're looking to expand our sponsors/benefactors.", "group_id": 292, "id": 256265}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1299206414.318644, "message": "Though it will be *really* good to be able to start taking sponsor member subscriptions. This program is taking forever to get off the ground, somewhat to my frustration.", "group_id": 292, "id": 266063}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1299206518.119355, "message": "PyCon is also often a net contributor to funds (though we are only just recovering from a recent loss). Jesse is right, though, we really need to diversify our donor base.", "group_id": 292, "id": 266076}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1299294934.3725491, "message": "@holdenweb And in order to diversify, we have to be able to make the argument as to *why* they should be supporting us :)", "group_id": 292, "id": 274841}, {"user_id": 15977, "stars": [], "topic_id": 7498, "date_created": 1299342830.3695071, "message": "that would seem to be an impediment on receiving donations...", "group_id": 292, "id": 276661}, {"user_id": 15977, "stars": [], "topic_id": 7498, "date_created": 1299342818.973968, "message": "Isn't http://www.python.org/psf/donations/ currently broken (and has been for a while)? :-(", "group_id": 292, "id": 276659}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1299343509.2910261, "message": "Yeah, @voidspace - it is. And I'm bringing that up to the board-level.", "group_id": 292, "id": 276691}, {"user_id": 15977, "stars": [], "topic_id": 7498, "date_created": 1299343771.5363269, "message": "Cool - thanks", "group_id": 292, "id": 276705}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1299446624.52527, "message": "The \"breakage\" was, as far as I know, deliberate when we experienced a rash of fraudulent credit card donations. Definitely time the breakage was reversed.", "group_id": 292, "id": 281875}, {"user_id": 1152, "stars": [], "topic_id": 7498, "date_created": 1299458303.0405109, "message": "@holdenweb Even intentional; the fact we're using a custom rolled CGI script in 2011 really isn't impressive still. But I think we've discussed this :)", "group_id": 292, "id": 282950}, {"user_id": 3354, "stars": [], "topic_id": 7498, "date_created": 1299463191.065964, "message": "Yes, I think you are fairly clear about my feelings on the subject, which seem to accord with yours fairly closely.", "group_id": 292, "id": 283404}, {"user_id": 1152, "stars": [{"date_created": 1303186138.287303, "user_id": 5942}], "topic_id": 7498, "date_created": 1303079208.835392, "message": "FYI, I've posted part one of my thoughts and explanation of the PSF here: http://jessenoller.com/2011/04/17/explaining-the-python-software-foundation-psf-part-1/", "group_id": 292, "id": 719148}]