[{"user_id": 11626, "stars": [], "topic_id": 21691, "date_created": 1303933790.9143209, "message": "http://www.meetup.com/socalmartiallawalerts/messages/boards/thread/10759048\r\n\r\nDear Team,\r\n\r\n\r\n\r\nSeems like very time we openly support Oath Keepers, we get an infiltrator/provocateur trying to stir up trouble...\r\n\r\n\r\n\r\nWhat's the old saying? When you're over the target, you get the flack.\r\n\r\n\r\n\r\nLong-time members of SCMLA already know what Oath Keepers is all about (since we've been supporting them ever since they were first formed), but it never hurts to refresh, so we're sending this out to clear up any misunderstandings.\r\n\r\n\r\n\r\nOath Keepers is non-partisan:\r\n\r\n\r\n\r\n    Oath Keepers is a non-partisan association of currently serving military, reserves, National Guard, veterans, Peace Officers, and Fire Fighters who will fulfill the Oath we swore, with the support of like minded citizens who take an Oath to stand with us, to support and defend the Constitution against all enemies, foreign and domestic, so help us God. Our Oath is to the Constitution\r\n\r\n\r\n\r\n    Our motto is \"Not on our watch!\"\r\n\r\n\r\n\r\n\r\n-- Kim M.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nMarch 3rd, 2009\r\n\r\nDeclaration Of Orders We Will Not Obey\r\n\r\n\r\n\r\n\r\n\r\nOrders We Will Not Obey\r\n&ldquo;The time is now near at hand which must probably determine, whether Americans are to be, Freemen, or Slaves; whether they are to have any property they can call their own; whether their Houses, and Farms, are to be pillaged and destroyed, and they consigned to a State of Wretchedness from which no human efforts will probably deliver them. The fate of unborn Millions will now depend, under God, on the Courage and Conduct of this army&rdquo; -- Gen. George Washington, to his troops before the battle of Long Island\r\n\r\n\r\n\r\nSuch a time is near at hand again. The fate of unborn millions will now depend, under God, on the Courage and Conduct of this Army -- and this Marine Corps, This Air Force, This Navy and the National Guard and police units of these sovereign states.\r\n\r\nOath Keepers is a non-partisan association of currently serving military, reserves, National Guard, peace officers, fire-fighters, and veterans who swore an oath to support and defend the Constitution against all enemies, foreign and domestic &hellip; and meant it. We won&rsquo;t &ldquo;just follow orders.&rdquo;\r\n\r\nBelow is our declaration of orders we will NOT obey because we will consider them unconstitutional (and thus unlawful) and immoral violations of the natural rights of the people. Such orders would be acts of war against the American people by their own government, and thus acts of treason. We will not make war against our own people. We will not commit treason. We will defend the Republic.\r\n\r\nDeclaration of Orders We Will NOT Obey\r\nRecognizing that we each swore an oath to support and defend the Constitution against all enemies, foreign and domestic, and affirming that we are guardians of the Republic, of the principles in our Declaration of Independence, and of the rights of our people, we affirm and declare the following:\r\n\r\n1. We will NOT obey any order to disarm the American people.\r\n\r\nThe attempt to disarm the people on April 19, 1775 was the spark of open conflict in the American Revolution. That vile attempt was an act of war, and the American people fought back in justified, righteous self-defense of their natural rights. Any such order today would also be an act of war against the American people, and thus an act of treason. We will not make war on our own people, and we will not commit treason by obeying any such treasonous order.\r\n\r\nNor will we assist, or support any such attempt to disarm the people by other government entities, either state or federal.\r\n\r\n\r\n\r\nIn addition, we affirm that the purpose of the Second Amendment is to preserve the military power of the people so that they will, in the last resort, have effective final recourse to arms and to the God of Hosts in the face of tyranny. Accordingly, we oppose any and all further infringements on the right of the people to keep and bear arms. In particular we oppose a renewal of the misnamed &ldquo;assault-weapons&rdquo; ban or the enactment of H.R. 45 (which would register and track gun owners like convicted pedophiles).\r\n\r\n2. We will NOT obey any order to conduct warrantless searches of the American people, their homes, vehicles, papers, or effects -- such as warrantless house-to house searches for weapons or persons.\r\n\r\nOne of the causes of the American Revolution was the use of &ldquo;writs of assistance,&rdquo; which were essentially warrantless searches because there was no requirement of a showing of probable cause to a judge, and the first fiery embers of American resistance were born in opposition to those infamous writs. The Founders considered all warrantless searches to be unreasonable and egregious. It was to prevent a repeat of such violations of the right of the people to be secure in their persons, houses, papers, and effects that the Fourth Amendment was written.\r\n\r\nWe expect that sweeping warrantless searches of homes and vehicles, under some pretext, will be the means used to attempt to disarm the people.\r\n\r\n3. We will NOT obey any order to detain American citizens as &ldquo;unlawful enemy combatants&rdquo; or to subject them to trial by military tribunal.\r\n\r\nOne of the causes of the American Revolution was the denial of the right to jury trial, the use of admiralty courts (military tribunals) instead, and the application of the laws of war to the colonists. After that experience, and being well aware of the infamous Star Chamber in English history, the Founders ensured that the international laws of war would apply only to foreign enemies, not to the American people. Thus, the Article III Treason Clause establishes the only constitutional form of trial for an American, not serving in the military, who is accused of making war on his own nation. Such a trial for treason must be before a civilian jury, not a tribunal.\r\n\r\nThe international laws of war do not trump our Bill of Rights. We reject as illegitimate any such claimed power, as did the Supreme Court in Ex Parte Milligan (1865). Any attempt to apply the laws of war to American civilians, under any pretext, such as against domestic &ldquo;militia&rdquo; groups the government brands &ldquo;domestic terrorists,&rdquo; is an act of war and an act of treason.\r\n\r\n4. We will NOT obey orders to impose martial law or a &ldquo;state of emergency&rdquo; on a state, or to enter with force into a state, without the express consent and invitation of that state&rsquo;s legislature and governor.\r\n\r\nOne of the causes of the American Revolution was the attempt &ldquo;to render the Military independent of and superior to the Civil Power&rdquo; by disbanding the Massachusetts legislature and appointing General Gage as &ldquo;military governor.&rdquo; The attempt to disarm the people of Massachusetts during that martial law sparked our Revolution. Accordingly, the power to impose martial law &ndash; the absolute rule over the people by a military officer with his will alone being law &ndash; is nowhere enumerated in our Constitution.\r\n\r\nFurther, it is the militia of a state and of the several states that the Constitution contemplates being used in any context, during any emergency within a state, not the standing army.\r\n\r\nThe imposition of martial law by the national government over a state and its people, treating them as an occupied enemy nation, is an act of war. Such an attempted suspension of the Constitution and Bill of Rights voids the compact with the states and with the people.\r\n\r\n5. We will NOT obey orders to invade and subjugate any state that asserts its sovereignty and declares the national government to be in violation of the compact by which that state entered the Union.\r\n\r\nIn response to the obscene growth of federal power and to the absurdly totalitarian claimed powers of the Executive, upwards of 20 states are considering, have considered, or have passed courageous resolutions affirming states rights and sovereignty.\r\n\r\nThose resolutions follow in the honored and revered footsteps of Jefferson and Madison in their Kentucky and Virginia Resolutions, and likewise seek to enforce the Constitution by affirming the very same principles of our Declaration, Constitution, and Bill of Rights that we Oath Keepers recognize and affirm.\r\n\r\nChief among those principles is that ours is a dual sovereignty system, with the people of each state retaining all powers not granted to the national government they created, and thus the people of each state reserved to themselves the right to judge when the national government they created has voided the compact between the states by asserting powers never granted.\r\n\r\nUpon the declaration by a state that such a breach has occurred, we will not obey orders to force that state to submit to the national government.\r\n\r\n6. We will NOT obey any order to blockade American cities, thus turning them into giant concentration camps.\r\n\r\nOne of the causes of the American Revolution was the blockade of Boston, and the occupying of that city by the British military, under martial law. Once hostilities began, the people of Boston were tricked into turning in their arms in exchange for safe passage, but were then forbidden to leave. That confinement of the residents of an entire city was an act of war.\r\n\r\nSuch tactics were repeated by the Nazis in the Warsaw Ghetto, and by the Imperial Japanese in Nanking, turning entire cities into death camps. Any such order to disarm and confine the people of an American city will be an act of war and thus an act of treason.\r\n\r\n7. We will NOT obey any order to force American citizens into any form of detention camps under any pretext.\r\n\r\nMass, forced internment into concentration camps was a hallmark of every fascist and communist dictatorship in the 20th Century. Such internment was unfortunately even used against American citizens of Japanese descent during World War II. Whenever a government interns its own people, it treats them like an occupied enemy population. Oppressive governments often use the internment of women and children to break the will of the men fighting for their liberty &ndash; as was done to the Boers, to the Jewish resisters in the Warsaw Ghetto, and to the Chechens, for example.\r\n\r\n\r\nSuch a vile order to forcibly intern Americans without charges or trial would be an act of war against the American people, and thus an act of treason, regardless of the pretext used. We will not commit treason, nor will we facilitate or support it.&rdquo;NOT on Our Watch!&rdquo;\r\n\r\n8. We will NOT obey orders to assist or support the use of any foreign troops on U.S. soil against the American people to &ldquo;keep the peace&rdquo; or to &ldquo;maintain control&rdquo; during any emergency, or under any other pretext. We will consider such use of foreign troops against our people to be an invasion and an act of war.\r\n\r\nDuring the American Revolution, the British government enlisted the aid of Hessian mercenaries in an attempt to subjugate the rebellious American people. Throughout history, repressive regimes have enlisted the aid of foreign troops and mercenaries who have no bonds with the people.\r\n\r\nAccordingly, as the militia of the several states are the only military force contemplated by the Constitution, in Article I, Section 8, for domestic keeping of the peace, and as the use of even our own standing army for such purposes is without such constitutional support, the use of foreign troops and mercenaries against the people is wildly unconstitutional, egregious, and an act of war.\r\n\r\nWe will oppose such troops as enemies of the people and we will treat all who request, invite, and aid those foreign troops as the traitors they are.\r\n\r\n9. We will NOT obey any orders to confiscate the property of the American people, including food and other essential supplies, under any emergency pretext whatsoever.\r\n\r\nOne of the causes of the American Revolution was the seizure and forfeiture of American ships, goods, and supplies, along with the seizure of American timber for the Royal Navy, all in violation of the people&rsquo;s natural right to their property and to the fruits of their labor. The final spark of the Revolution was the attempt by the government to seize powder and cannon stores at Concord.\r\n\r\nDeprivation of food has long been a weapon of war and oppression, with millions intentionally starved to death by fascist and communist governments in the 20th Century alone.\r\n\r\nAccordingly, we will not obey or facilitate orders to confiscate food and other essential supplies from the people, and we will consider all those who issue or carry out such orders to be the enemies of the people.\r\n\r\n10. We will NOT obey any orders which infringe on the right of the people to free speech, to peaceably assemble, and to petition their government for a redress of grievances.\r\n\r\nThere would have been no American Revolution without fiery speakers and writers such as James Otis, Patrick Henry, Thomas Paine, and Sam Adams &ldquo;setting brushfires of freedom in the minds of men.&rdquo;\r\n\r\n\r\n\r\nPatrick Henry: &ldquo;Give me Liberty, or Give me DEATH!&rdquo;\r\n\r\nTyrants know that the pen of a man such as Thomas Paine can cause them more damage than entire armies, and thus they always seek to suppress the natural rights of speech, association, and assembly. Without freedom of speech, the people will have no recourse but to arms. Without freedom of speech and conscience, there is no freedom.\r\nTherefore, we will not obey or support any orders to suppress or violate the right of the people to speak, associate, worship, assemble, communicate, or petition government for the redress of grievances.\r\n\r\n&mdash; And for the support of this Declaration, with a firm reliance on the protection of Divine Providence, we mutually affirm our oath and pledge to each other our Lives, our Fortunes, and our sacred Honor. Oath Keepers\r\n\r\nThe above list is not exhaustive but we do consider them to be clear tripwires &ndash; they form our &ldquo;line in the sand,&rdquo; and if we receive such orders, we will not obey them. Further, we will know that the time for another American Revolution is nigh. If you the people decide that you have no recourse, and such a revolution comes, at that time, not only will we NOT fire upon our fellow Americans who righteously resist such egregious violations of their God given rights, we will join them in fighting against those who dare attempt to enslave them.\r\n\r\nNOTE: please also read our Principles of Our Republic We Are Sworn to Defend\r\n\r\nMore About Oath Keepers\r\n\r\nOath Keepers is a non partisan association of currently serving military, peace officers, fire-fighters, and veterans who will fulfill our oath to support and defend the Constitution against all enemies, foreign and domestic, so help us God.\r\n\r\nOur oath is to the Constitution, not to the politicians, and not to any political party. In the long-standing tradition of the U.S. military, we are apolitical. We don&rsquo;t care if unlawful orders come from a Democrat or a Republican, or if the violation is bi-partisan. We will not obey unconstitutional (and thus unlawful) and immoral orders, such as orders to disarm the American people or to place them under martial law. We won&rsquo;t &ldquo;just follow orders.&rdquo; Our motto: &ldquo;Not on Our Watch!&rdquo; or to put it even more succinctly, in the words of 101st Airborne Commander General Anthony McAuliffe at the Battle of the Bulge, &ldquo;NUTS!&rdquo;\r\n\r\nThere is at this time a debate within the ranks of the military regarding their oath. Some mistakenly believe they must follow any order the President issues. But many others do understand that their loyalty is to the Constitution and to the people, and understand what that means.\r\n\r\nThe mission of Oath Keepers is to vastly increase their numbers.\r\n\r\nWe are in a battle for the hearts and minds of our own troops.\r\n\r\nHelp us win it.\r\n\r\nwww.oathkeepers.org\r\n\r\nPLEASE DONATE AND SUPPORT OUR EFFORTS\r\n\r\nOath Keepers is growing FAST, but like General Patton, we are outpacing our own supply lines. Your donations are &ldquo;fuel&rdquo; for our advance!\r\n\r\n\r\n\r\nOath Keepers Declaration of Orders We Will NOT Obey\r\n\r\n\r\nTo view Comments pre July 4th, 2009 please visit our old blog at http://oath-keepers.b...", "group_id": 3920, "id": 831524}]