[{"user_id": 11626, "stars": [], "topic_id": 7393, "date_created": 1298079606.492209, "message": "http://static.prisonplanet.com/p/images/february2011/180211top.jpg\r\n\r\nCoincidence or not, the fact that hundreds of National Guard troops are returning to Wisconsin today fresh from battling insurgents in Iraq is sure to alarm union protesters who labeled Governor Scott Walker’s move to put the Guard on alert last week a “threat” designed to intimidate demonstrators who are currently massed around the Capitol in Madison.\r\n\r\nIn case of a widespread walkout in response to his “budget repair bill,” Walker told reporters last week that he would use National Guard troops to be “prepared…for whatever the governor, their commander-in-chief, might call for. … I am fully prepared for whatever may happen.”\r\n\r\nOstensibly, Walker’s announcement was a signal that he is prepared to replace state workers with National Guard troops, deploying them for example as prison guards. However, protesters cried foul, claiming that Walker was invoking the Guard as an intimidation tactic to suppress dissent.\r\n\r\n“Hundreds of Wisconsin National Guard soldiers return to the state Friday,” reports the Wausau Daily Herald.\r\n\r\n“About 300 soldiers from the 724th Engineer Battalion will be back at Volk Field where they will be met by senior National Guard officials and family members. A brief ceremony will be held before the soldiers are taken to nearby Fort McCoy to begin about five days of demobilization before their release.”\r\n\r\nThe unit comprises roughly half of Wisconsin’s National Guard soldiers that are currently on active duty. They return fresh from Iraq after having been on missions to remove roadside bombs placed by insurgents.\r\n\r\nThey may now face a different type of insurgency, one led by state workers who are furious that their pension and health care contributions are set to double to fill a $3.6 billion budget deficit black hole, while two-thirds of corporations in the state pay no taxes whatsoever according to the Wisconsin Department of Revenue.\r\n\r\nThe sight of fully uniformed National Guard soldiers policing angry Americans could see a repeat of the scenes witnessed in Cairo over the last few weeks. Indeed, Wisconsin Congressman Paul Ryan (R) is already drawing similar comparisons.\r\n\r\nRyan expressed his opposition to the demands of the protesters, pointing out that even after Walker’s bill is passed, state sector workers would still pay far less in pension and health contributions that private sector workers, but noted that the level of fury surrounding the legislation meant that Walker was now facing, “Riots — it’s like Cairo has moved to Madison these days.”\r\n\r\nMaking reference to Walker’s threat to bring in the National Guard, liberal activist and author Noam Chomsky told Democracy Now that what happened in Egypt was “the beginning of what we need here – democracy uprising.”\r\n\r\nSome have even expressed fears that the Guard could be used to break the strikes at the point of a gun. Such a move would not be without historical precedent.\r\n\r\n“The last time Wisconsin called in the National Guard was in 1886. The Guard, then called the State Militia were brought in to break a rally of Milwaukee workers advocating an 8-hour work day. The militia fired into a crowd of unarmed picketers; it’s estimated that 5 to 7 workers were killed,” reports the Huffington Post.\r\n\r\n“Maybe the new governor doesn’t understand yet – but the National Guard is not his own personal intimidation force to be mobilized to quash political dissent,” said Robin Eckstein, a former Wisconsin National Guard member, Iraq War Veteran from Appleton, WI, and member of VoteVets.org. “The Guard is to be used in case of true emergencies and disasters, to help the people of Wisconsin, not to bully political opponents.”\r\n\r\nhttp://www.infowars.com/returning-national-guard-troops-set-to-smash-wisconsin-protest", "group_id": 3920, "id": 148201}]