[{"user_id": 9207, "stars": [], "topic_id": 10391, "date_created": 1299140372.149142, "message": "I'm actually working on something similar at the moment. Obviously there are big technology choices up front. I don't think it matters too much what language, framework, server, etc. you choose, as long as you can be productive and you have a road to scalability. NoSQL offers performance benefits (I'm a recent MongoDB convert, which I'm using over my beloved PostgreSQL).", "group_id": 95, "id": 259006}, {"user_id": 9207, "stars": [], "topic_id": 10391, "date_created": 1299140667.7865291, "message": "There is a certain obvious set of features that users have come to expect, such as voting, karma, and the rest. This leads to a fairly straightforward schema design. Where it gets interesting is in building the views, such as popular or recent. You'll need to denormalize scores or dates so you can do efficient queries and then do your manual join on the subset required for displaying the page.", "group_id": 95, "id": 259038}, {"user_id": 115, "stars": [], "topic_id": 10391, "date_created": 1299147558.1840639, "message": "all that's still quite likely not enough to get people away from reddit though", "group_id": 95, "id": 259401}, {"user_id": 115, "stars": [], "topic_id": 10391, "date_created": 1299147460.311197, "message": "one way to help solve that would be let creators of custom subreddits subscribe the subreddit to relevant RSS feeds (i.e., they would get auto-submitted)", "group_id": 95, "id": 259394}, {"user_id": 115, "stars": [], "topic_id": 10391, "date_created": 1299147486.2847869, "message": "more customization for subreddit creators, like CSS", "group_id": 95, "id": 259396}, {"user_id": 115, "stars": [], "topic_id": 10391, "date_created": 1299147515.5549951, "message": "live updating like quora", "group_id": 95, "id": 259399}, {"user_id": 15929, "stars": [], "topic_id": 10391, "date_created": 1299147007.954613, "message": "exactly the same way? the best part about reddit (and digg up to v3) is the users / contributors. so what's the issue to attack here?\n- technology? it's just entry and query data. doesn't really matter how you attack this if never reach the scale...\n- speed? don't think ppl go to reddit or digg for  breaking news, there's twitter / facebook for that. though you can build a service around breaking news, won't be reddit though.\n- sociology? this is it right? it's how you design the product so you can cultivate the community you'd like to have around and reward them for it.", "group_id": 95, "id": 259371}, {"user_id": 15929, "stars": [], "topic_id": 10391, "date_created": 1299147020.854768, "message": "just my 2cent...", "group_id": 95, "id": 259372}, {"user_id": 115, "stars": [], "topic_id": 10391, "date_created": 1299147415.287133, "message": "the biggest problem is solving the chicken+egg problem with new communities", "group_id": 95, "id": 259390}, {"user_id": 17469, "stars": [], "topic_id": 10391, "date_created": 1299198089.663666, "message": "seriously if it had to be up today I'd just install pligg and customize it to look like reddit. In fact, someone's probably done all the theming already.", "group_id": 95, "id": 265220}]