[{"user_id": 11626, "stars": [], "topic_id": 21506, "date_created": 1303859785.8488641, "message": "http://www.infowars.com/cops-use-mobile-scanner-to-steal-cellphone-data-from-innocent-americans\r\n\r\nCops Use Mobile Scanner To Steal Cellphone Data From Innocent Americans\r\n\r\n\r\n    *\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nPaul Joseph Watson\r\nInfowars.com\r\nApril 20, 2011\r\n\r\nIf there was a scintilla of doubt as to whether Americans are living in a predatory police state, then this story completely eviscerates it. Michigan state police have been using a handheld mobile forensics device to steal information from cell phones belonging to motorists stopped for minor traffic violations.\r\n\r\nThe high-tech device works with 3000 different phone models and can bypass passwords to process &ldquo;Complete extraction of existing, hidden, and deleted phone data, including call history, text messages, contacts, images, and geotags,&rdquo; according to CelleBrite, the company behind the device. &ldquo;The Physical Analyzer allows visualization of both existing and deleted locations on Google Earth. In addition, location information from GPS devices and image geotags can be mapped on Google Maps.&rdquo;\r\n\r\n&ldquo;A US Department of Justice test of the CelleBrite UFED used by Michigan police found the device could grab all of the photos and video off of an iPhone within one-and-a-half minutes,&rdquo; reports TheNewspaper.com.\r\n\r\nMichigan state police have been using the device to conduct 4th amendment-violating searches of motorists&rsquo; phones who have not even been suspected of any crime.\r\n\r\nTo add insult to injury, when the ACLU attempted to file a freedom of information act request to discover how police were using the devices, they were slapped with a demand for $544,680 from the Michigan state police.\r\n\r\n\r\n    * A d v e r t i s e m e n t\r\n    *\r\n\r\n\r\nThe fact that Americans are now considered guilty until proven innocent and treated like terrorists by cops who have been trained that their role is no longer to &ldquo;serve and protect&rdquo; but to harass and abuse is fast becoming a glib concept.\r\n\r\nThe question really boils down to whether anyone actually cares. Most Americans couldn&rsquo;t live without their smart phone and now give it more attention than their own children. We are being enslaved through our own overdependence on gadgets and technology.\r\n\r\nAs the ACLU points out, use of the devices is completely illegal as it clearly violates the 4th amendment.\r\n\r\n&ldquo;With certain exceptions that do not apply here, a search cannot occur without a warrant in which a judicial officer determines that there is probable cause to believe that the search will yield evidence of criminal activity,&rdquo; ACLU staff attorney Mark P. Fancher wrote. &ldquo;A device that allows immediate, surreptitious intrusion into private data creates enormous risks that troopers will ignore these requirements to the detriment of the constitutional rights of persons whose cell phones are searched.&rdquo;\r\n\r\nStock up with Fresh Food that lasts with eFoodsDirect (Ad)\r\n\r\nWith the ACLU currently embroiled in a lawsuit against the Department of Homeland Security in an effort to stop its warrantless searches of laptops belonging to anyone who enters the United States, another legal fight in the case of the mobile cellphone scanner device is also on the cards.", "group_id": 3920, "id": 819905}]