[{"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303175056.9877379, "message": "Alguien sabe de banco, institucion financiera, empresa, persona, changarro que de creditos a startups con caracteristicas especiales je, digamos que no le sirven de mucho las declaraciones anuales porque trabajan a distancia en otros paises y les pagan por PayPal? :)", "group_id": 965, "id": 734359}, {"user_id": 6541, "stars": [], "topic_id": 20257, "date_created": 1303177824.1890011, "message": "me parece que la secretaria de economia, no dice tal cual \"startups\" pero si para empresas", "group_id": 965, "id": 734690}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303178226.501847, "message": "Pues tienen prosoft y esas cosas pero es un relajo y tarda mucho, algo mas rapido? :) gracias", "group_id": 965, "id": 734717}, {"user_id": 3665, "stars": [], "topic_id": 20257, "date_created": 1303180653.6091809, "message": "@keoz Ojo, aún cuando trabajas para personas de otros países debes de declarar :P,pasa lo mismo si tu contratas terceros para un cliente acá en MX, ya que tu pagarías los impuestos(ISR-10%) del los terceros, en este caso te puedes librar de al menos el ISR de lo que te cobro el tercero.", "group_id": 965, "id": 735058}, {"user_id": 24160, "stars": [], "topic_id": 20257, "date_created": 1303180994.086848, "message": "Buen punto el de @Krator. Cómo empresa hay que recordar que nuestros estados financieros no sólamente le importan a hacienda, sino también a nuestros potenciales acreedores. Es común que tratemos de reportar la menor utilidad posible con la finalidad de librarnos de algunos impuestos, pero eso después juega en contra al momento de tratar de demostrar la liquidez del negocio.", "group_id": 965, "id": 735158}, {"user_id": 3665, "stars": [], "topic_id": 20257, "date_created": 1303183340.0072889, "message": "Puedes agendar una cita en el SAT para que asesoren, son muy amables.", "group_id": 965, "id": 735750}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303182392.9490471, "message": "Ah si? ups pues esque no he visto como es la contabilidad en esos casos, si se los explico asi me orientaran en el sat? no es que quiera evadir impuestos pero pense si no hago facturas de esos ingresos y todos mis gastos los facturo... pero lo voy a checar", "group_id": 965, "id": 735523}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303182418.2641461, "message": "shame on me", "group_id": 965, "id": 735528}, {"user_id": 12739, "stars": [], "topic_id": 20257, "date_created": 1303183915.435843, "message": "@keoz yo estoy en esa situación, si debes de pagar impuestos aunque solo tengas clientes extranjeros, principalmente porque es nuestro deber :) pero si nos ponemos roñosos hacienda puede revisar cuentas bancarias y pedirte cuentas en cualquier momento (aunque esto es raro a menos que tengas ingresos altos).", "group_id": 965, "id": 735912}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303184249.3447599, "message": "@pablasso ah ok pues yo no sabia de eso por eso no lo hacia aunque si lo hacia cuando no estaba en esa situación, pero espero no revise cuentas soy pobre XD", "group_id": 965, "id": 736022}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303183471.254317, "message": "@Krator si voy a hacerlo, ya lo he hecho aunque no todos son amables :S pero bueno es mejor saber gracias", "group_id": 965, "id": 735798}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303224757.4835219, "message": "@keoz Creo que se tarda un tiempo sensato. Recibir una cantidad considerable de dinero para un \"startup\" no debe ser diferente a conseguirlo para otro tipo de negocio. Y los préstamos para negocios son caros y no muy fáciles de obtener.", "group_id": 965, "id": 742506}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303224782.948633, "message": "(el hecho de que exista Prosoft ya es ganancia)", "group_id": 965, "id": 742512}, {"user_id": 29866, "stars": [], "topic_id": 20257, "date_created": 1303225370.0709651, "message": "Lo idea es comenzar a trabajar en tu \"business plan\" y tenerlo en Ingles, donde buscarlos?USA y España. En México puedes encontrar prestamos para empresas, pero sera necesario que le demuestres ingresos, estar constituido. Para explicarlo de forma sencilla en México quieren saber que es lo que tienes y en USA quieren saber que es lo que quieres. Estamos a años luz de distancia en mentalidad para hacer negocios. También puedes encontrar programas para créditos semilla en la Secretaria de Economía.", "group_id": 965, "id": 742612}, {"user_id": 26088, "stars": [], "topic_id": 20257, "date_created": 1303226391.0741799, "message": "@josuegio sip, esa es la cosa, y el capital semilla de la SE para empresas incubadas tarda lo que un bebe y es cada fin de año y la verdad no necesito mucho ahorita pero pues si creo deberia haber mecanismos mas accesibles en México como dices con el plan de negocios, @edmz si credito para startup = negocio no es que buscara algo especializado :)  Gracias", "group_id": 965, "id": 742836}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303229235.2569699, "message": "@josuegio \"Para explicarlo de forma sencilla en México quieren saber que es lo que tienes y en USA quieren saber que es lo que quieres.\"", "group_id": 965, "id": 743356}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303229239.893652, "message": "¿Quién en su sano juicio está dispuesto a invertir en una empresa de tecnología en base a lo que quieres y no en lo que tienes? Pues los VCs que le meten dinero a empresas de software.", "group_id": 965, "id": 743358}, {"user_id": 29866, "stars": [{"date_created": 1303239446.511687, "user_id": 26088}, {"date_created": 1303248518.1703589, "user_id": 2946}], "topic_id": 20257, "date_created": 1303229946.6673081, "message": "@edmz En México también hay mucho dinero, en mi ciudad veo que todos los días los empresarios ponen una gasolinera nueva, eso en USD son alrededor de unos 150,000 a 250,000 USD, mira en Techcruch y leerás todos los días que un \"Business Angel\" invierte esta cantidad en una empresa de tecnología, lo que falta en México no es dinero, es visión. \"La vista es lo que puedes ver con los ojos y la visión es lo que puedes ver con la mente\". La educación es un bien de lujo en México, lo mismo la educación en los negocios lo es para los empresarios mexicanos. Hay muchas Startups en USA que están apenas en fase \"Stealth mode\" o \"Early Stage\" y reciben dinero, sin apenas haber producido ni un dolar. Sino imagínate que pasaría con las empresas de biotecnología que actualmente están investigando para un nuevo medicamento, están \"investigando\" no están \"vendiendo\" y requieren de capital de riesgo. Esa cultura de negocios es muy escasa en México, pero no lo es el dinero.", "group_id": 965, "id": 743528}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303229251.493443, "message": "Estamos a años luz de distancia, pero por la razón de que en USA hay más con dinero que está dispuesta a apostarle a lo que se mueva.", "group_id": 965, "id": 743366}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303229243.9567571, "message": "Fuera de eso, la situación de los préstamos para empresas va a ser igual en USA que en México. Te van a pedir ventas, estados de cuenta, etc. Quien te presta necesita una garantía de que recibirá su dinero de regreso más un extra.", "group_id": 965, "id": 743360}, {"user_id": 24160, "stars": [{"date_created": 1303241242.6568, "user_id": 6541}], "topic_id": 20257, "date_created": 1303233813.5362079, "message": "Es por ello que el capital de riesgo es tan popular entre los startups. En este caso, lo que haces es *vender* una parte de tu empresa a alguien más a cambio de efectivo. Si el negocio funciona, el inversionista gana, si el negocio falla, el inversionista pierde. En este caso, el emprendedor y el inversionista se reparten el riesgo y por ende las ganancias.", "group_id": 965, "id": 744191}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303232130.852457, "message": "@josuegio ¿por qué crees que alguien la ve a meter dinero a una gasolinera en vez de metérselo a una idea audaz de un programador? El perfil de la mayoría de la gente que tiene dinero para invertir en México no conoce de tecnología. En EU el porcentaje debe ser mucho mayor que aquí. Sobretodo por los que ganaron mucho dinero en el mismo sector tecnológico.", "group_id": 965, "id": 743946}, {"user_id": 24160, "stars": [{"date_created": 1303239467.7523701, "user_id": 26088}, {"date_created": 1303289280.774864, "user_id": 29963}], "topic_id": 20257, "date_created": 1303233689.1222081, "message": "Esta discusión esta llena de verdadades. Lo que agregaría es que un crédito no es la mejor forma de apalancar a un startup. El riesgo de que el negocio no levante es muy grande y con un préstame encima, será muy difícil pagarlo. Nota relacionada: Los bancos no prestan dinero a startups porque no hay garantías. Usualmente los startups (sobre todo en software/web) no tenemos activos fijos que nos permitan acceder a este financiamiento. Por lo cual, los emprendedores se ven orillados a pedir el crédito a título personal, lo cual resulta en que la garantía sea el patrimonio del emprendedor. Ya de entrada es riesgoso construir una empresa, y ahora añadirle el riesgo de un crédito me parece intimidante.", "group_id": 965, "id": 744171}, {"user_id": 24160, "stars": [{"date_created": 1303239495.661217, "user_id": 26088}], "topic_id": 20257, "date_created": 1303234407.281837, "message": "El business plan no necesariamente es lo más importante, al menos no para algunos inversionistas. Lo que es un hecho es que tendrás que demostrar a través de acciones que el equipo, el mercado, el producto y el modelo tienen el potencial de generar un negocio muy grande. Ahí es dónde veo muchos problemas en México. La mayoría de los emprendedores piensa que \"vender en la colonia\" es suficiente. Pocos tienen la visión para pensar en negocios a gran escala.", "group_id": 965, "id": 744290}, {"user_id": 24160, "stars": [{"date_created": 1303239488.774255, "user_id": 26088}], "topic_id": 20257, "date_created": 1303234227.2613909, "message": "Fuentes de financiamiento hay muchas, siempre y cuando el startup tenga planes de generar grandes retornos. Dado que los inversionistas están corriendo mucho riesgo, usualmente hablan de esperar retornos de 10x, es decir, que si invierten $50,000 USD, esperan que el negocio les genere $500,000 en un plazo de 4 o 5 años. Esto puede dar una ligera idea de por qué sólo invierten en negocios potencialmente grandes.", "group_id": 965, "id": 744259}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303237940.182966, "message": "@cesarsalazar Gracias por tus comentarios. Estoy de acuerdo que eso de vender en la colonia puede sonar miope. Y desde el punto de vista de unos VCs definitivamente lo es. Pero, si por vender en la colonia logras obtener el doble de tu salario actual y ser independiente, pues ya ganaste. Quizá no es ambicioso, pero desde el punto de vista de negocio y personal sin duda sería un éxito. Aparte, habrías construido los cimientos para crecer tu negocio.", "group_id": 965, "id": 744780}, {"user_id": 19938, "stars": [{"date_created": 1303356009.388092, "user_id": 20022}], "topic_id": 20257, "date_created": 1303238045.6133671, "message": "Uno de los problemas de la discusión es que hay de startups a startups. Yo creo que muchos se verían beneficiados si inician un negocio por más pequeño que sea.", "group_id": 965, "id": 744789}, {"user_id": 24160, "stars": [], "topic_id": 20257, "date_created": 1303243521.9383609, "message": "No estoy en contra de los negocios pequeños como los que mencionas, sólo digo que es evidente que estos negocios no son del interés de los inversionistas porque les representaría una pérdida.", "group_id": 965, "id": 746159}, {"user_id": 24160, "stars": [{"date_created": 1303245726.4215529, "user_id": 26088}], "topic_id": 20257, "date_created": 1303243601.1655779, "message": "Lo que es un poco ingenuo es pensar que un inversionista va a meterle dinero a tu startup de dos personas que planea darles una buena calidad de vida a los fundadores. Es ahí donde el bootstrapping no sólo es recomendable sino indispensable.", "group_id": 965, "id": 746202}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303244658.74231, "message": "Algo que complica esta discusión es la generalización del alcance de un startup. Hay quienes piensan en el próximo facebook mientras otros piensan en el equivalente a un puesto de tacos.", "group_id": 965, "id": 746519}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303244490.6835699, "message": "@cesarsalazar Estoy de acuerdo contigo, un VC no invertiría a un startup de dos personas. Para esos casos hay otras formas de financiarse.", "group_id": 965, "id": 746463}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303245025.3983891, "message": "Un post en Convore sin algo de contexto no ayuda en nada para dimensionar el tamaño del startup/empresa que cada quien trae en su cabeza.", "group_id": 965, "id": 746627}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303244684.856159, "message": "Para mí ambos son importantes.", "group_id": 965, "id": 746529}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303245056.183285, "message": "Al menos para mí es confuso cuando alguien dice habla de su empresa/startup sin dar contexto alguno.", "group_id": 965, "id": 746636}, {"user_id": 2946, "stars": [{"date_created": 1303265390.2448249, "user_id": 19921}, {"date_created": 1303267254.41697, "user_id": 10227}], "topic_id": 20257, "date_created": 1303248620.1539891, "message": "\"mi otra startup es un puesto de tacos\"", "group_id": 965, "id": 747547}, {"user_id": 24160, "stars": [], "topic_id": 20257, "date_created": 1303251390.5708909, "message": "@soska Stickers ya!", "group_id": 965, "id": 747906}, {"user_id": 19938, "stars": [], "topic_id": 20257, "date_created": 1303254989.7006841, "message": "http://i.imgur.com/SolI4.jpg", "group_id": 965, "id": 748590}, {"user_id": 29866, "stars": [{"date_created": 1303270865.0426159, "user_id": 26088}], "topic_id": 20257, "date_created": 1303269677.0881269, "message": "Estoy de acuerdo con los últimos comentarios acerca de los contextos y para mi una startup es una empresa que tiene el potencial para crecer de forma rápida, que proviene de una idea original y que nace para innovar. Por otro lado veo que hablan mucho de los VC (Venture Capital) como si estos en verdad invirtieran en cualquier empresa, los VC's solo lo hacen con empresas que su \"modelo de negocio\" esta comprobado, porque lo que quieren es minimizar riesgos, empresas que están en una fase \"Early Stage\" son ideales para Business Angels que han conocido al equipo y que confina en las habilidades de los mismos. Es posible levantar capital en México, si es posible y por aquí anda personas que lo pueden asegurar, es fácil?, No, no lo creo... pero nada lo es, lo único fácil es conseguirse un empleo o seguir siendo freelancer (que tampoco lo es). La ventaja que tenemos los que estamos aquí es que si estamos interesados en estos temas es porque hemos decidido optar por otro camino. @cesarsalazar tal vez un VC no invierta en un equipo de 2 personas, pero hay otras como \"YCombinator\" que lo recomiendan : http://www.ycombinator.com/apply.html en el ultimo párrafo: The ideal company would have two or three founders. We'll consider those with four or five. We're reluctant to accept one-person companies, though we have funded a couple.", "group_id": 965, "id": 751018}, {"user_id": 2946, "stars": [{"date_created": 1303274502.772166, "user_id": 26088}], "topic_id": 20257, "date_created": 1303273888.3329871, "message": "Por otro lado tenemos a las startups enormes tipo Google o Facebook que van tras un problema muy, muy grande con una ventana de oportunidad muy, muy pequeña. Por lo que requieren de enormes cantidades de capital que les permitan ejecutar aceleradamente y crecer muy rápido. Los emprendedores detrás de estas hiper-startups y sus van tras una salida que les regrese 10x o 50x lo que le hayan metido. Las salidas pueden ser a) ser adquiridos por otra empresa o b) Convertirse en una empresa pública.", "group_id": 965, "id": 751835}, {"user_id": 2946, "stars": [], "topic_id": 20257, "date_created": 1303273295.4971039, "message": "@josuegio Te perdiste la segunda parte de la frase de @cesarsalazar \"a tu startup de dos personas que planea darles una buena calidad de vida a los fundadores\" es decir, un lifestyle business.", "group_id": 965, "id": 751746}, {"user_id": 2946, "stars": [], "topic_id": 20257, "date_created": 1303273962.376209, "message": "Obviamente hay casos especiales que no pueden ser fácilmente categorizadas en estos dos clusters, pero son las excepciones mas que la regla.", "group_id": 965, "id": 751846}, {"user_id": 2946, "stars": [{"date_created": 1303304484.405236, "user_id": 26084}, {"date_created": 1303337805.831871, "user_id": 24160}], "topic_id": 20257, "date_created": 1303274428.7326889, "message": "Aqui en startups-mx apoyamos y reconocemos a los emprendedores sea cual sea el camino que deseen emprender siempre y cuando estén dispuestos a aportar de regreso a la comunidad sus experiencias.", "group_id": 965, "id": 751938}, {"user_id": 2946, "stars": [], "topic_id": 20257, "date_created": 1303274431.2663691, "message": "He dicho.", "group_id": 965, "id": 751941}, {"user_id": 2946, "stars": [{"date_created": 1303274470.8595359, "user_id": 26088}], "topic_id": 20257, "date_created": 1303273587.813132, "message": "traduzco un poco porque parece que los conceptos se pierden y se genera mucho ruido.\n\nPodríamos dividir las startups en dos clases. Por un lado tenemos las que desde el principio son diseñadas para ser pequeñas o medianas y tienen como objetivo generar suficiente dinero para que sus fundadores tengan el estilo de vida que desean tener. Muchas veces estos negocios pasan desapercibidos y no son nada sexys (ejemplo clásico de Hacker News: Bingo Card Creator) y lo más seguro es jamás vayan a salir a bolsa ni a tener una saldia millonaria. Y eso está bien, porque es lo que hace feliz a sus fundadores.", "group_id": 965, "id": 751790}, {"user_id": 2946, "stars": [], "topic_id": 20257, "date_created": 1303274143.6433749, "message": "@edmz y --hasta cierto punto yo mismo-- somos partidiarios de la primera opción, sobre todo para emprendedores primerizos. Creo que es necesario que se sepa, al menos, que este camino de hacer un negocio \"pequeño\" existe. Y que el bootstrappign es una opción.", "group_id": 965, "id": 751890}, {"user_id": 2946, "stars": [], "topic_id": 20257, "date_created": 1303274303.7088859, "message": "Pero sería hipócrita de mi parte ignorar que hace falta lo otro, el camino que @cesarsalazar promueve, puesto que yo mismo trabajo en una empresa que se ha propuesto la titánica tarea de cambiar el mundo (editorial) y que para hacerlo necesitamos meterle el turbo que solo la inversión de riesgo otorga.", "group_id": 965, "id": 751907}, {"user_id": 29866, "stars": [], "topic_id": 20257, "date_created": 1303305891.3243001, "message": "@soska De acuerdo.", "group_id": 965, "id": 754636}, {"user_id": 10406, "stars": [{"date_created": 1303345161.0237279, "user_id": 2946}, {"date_created": 1303347338.722064, "user_id": 26088}], "topic_id": 20257, "date_created": 1303344762.7488401, "message": "jajaja, a veces nos ponemos muy idealistas, pero es verdad! El tamaño de la startup en México no deberia ser importante mientras se genera una densidad de exito. Se necesita mas startups que generen retorno y de ellas saldra el siguiente hit wonder, pero si todos intentan esto, nadie generara ganancias y verdaderos resultados. \"If everyone is thinking alike, then somebody isn't thinking\"", "group_id": 965, "id": 763207}]