[{"user_id": 23332, "stars": [], "topic_id": 34597, "date_created": 1305071190.209971, "message": "Hey guys my name is Victor I created this group so that it would be easier to communicate with everyone. You're more than welcome to say hi and introduce yourself.", "group_id": 9761, "id": 997965}, {"user_id": 34142, "stars": [], "topic_id": 34597, "date_created": 1306256122.1872549, "message": "Hello everyone, my name is Matt Londergan.  I went to Purdue for my BS in Agricultural Engineering and I am currently finishing up my MS in Engineering Entrepreneurship at Notre Dame.  Looking forward to meeting all of you!", "group_id": 9761, "id": 1167888}, {"user_id": 34170, "stars": [], "topic_id": 34597, "date_created": 1306271877.216445, "message": "Hi all, my name is Melissa Donohue. I just graduated from Binghamton University in upstate New York with my BS in Computer Science. I look forward to meeting all of you in July.", "group_id": 9761, "id": 1170788}, {"user_id": 33068, "stars": [], "topic_id": 34597, "date_created": 1306360908.521106, "message": "I'm Todd.  Graduated in December w/ my MS in Engineering Management at Florida Tech.  BS in Mechanical Engineering.  Considering the heat here in Florida, I'm ready for a climate change...I also imagine I'll eat those words.", "group_id": 9761, "id": 1184677}, {"user_id": 32989, "stars": [], "topic_id": 34597, "date_created": 1306875776.3875501, "message": "Hey everyone, my name is Matt Perkins. I graduated from the University of Central Florida in December of 2009 with my bachelors in mechanical engineering. I'm currently working for a small engineering firm in central florida. Can't wait to meet everybody.", "group_id": 9761, "id": 1241764}, {"user_id": 33100, "stars": [], "topic_id": 34597, "date_created": 1307201180.7426851, "message": "Hi everyone, I'm Vanessa! I'm a recent graduate of Lehigh University in Bethlehem, PA, with a BS in Mechanical Engineering and a minor in Creative Writing. I'm looking forward to meeting you all soon!", "group_id": 9761, "id": 1286665}, {"user_id": 35509, "stars": [], "topic_id": 34597, "date_created": 1307475557.1822541, "message": "Hi everybody , my name is Sean Whyard.  I graduated from Florida Institute of Technology with a Bachelors of Science Degree in Ocean Engineering.  Looking forward to meeting all of you!", "group_id": 9761, "id": 1326803}]