[{"user_id": 719, "stars": [], "topic_id": 7013, "date_created": 1297966850.5680599, "message": "By now, trying to pin down what \"cloud computing\" means is a futile endeavor.", "group_id": 95, "id": 133826}, {"user_id": 777, "stars": [], "topic_id": 7013, "date_created": 1297966033.1800599, "message": "What's the difference between Application Service Providing and Cloud Computing?", "group_id": 95, "id": 133724}, {"user_id": 777, "stars": [], "topic_id": 7013, "date_created": 1297966984.8142829, "message": "I think that Cloud Computing most often uses massively parallel computing whereas ASPs often deal with consistent loads so that it can handle it on a single server.", "group_id": 95, "id": 133847}, {"user_id": 777, "stars": [], "topic_id": 7013, "date_created": 1297966916.0476689, "message": "It's a question in an exam we had in university. I can not find any real answer to it. And I also think that everyone has a little different understanding what CC really is.", "group_id": 95, "id": 133835}, {"user_id": 777, "stars": [], "topic_id": 7013, "date_created": 1297968046.8820641, "message": "I think Cloud is a wider terminology for something in which ASP would be a part of. SaaS sounds a bit like ASP. So I think ASP is SaaS which is part of CC.", "group_id": 95, "id": 134034}, {"user_id": 4180, "stars": [], "topic_id": 7013, "date_created": 1297967598.4846449, "message": "While \"cloud\" tends to lead towards some amazingly scalable and distributed system, it's often just applied to any sort of hosting to make it sound cooler.", "group_id": 95, "id": 133973}, {"user_id": 1706, "stars": [], "topic_id": 7013, "date_created": 1297967920.2913449, "message": "If you use the \"application\" part of the name as a guidepost, the distinction would be that \"cloud computing\" is a vague description of a platform for hosting applications, where an \"application service provider\" is someone who offers a network-based service/application that they would (these days) claim resides in \"the cloud\"", "group_id": 95, "id": 134021}, {"user_id": 5993, "stars": [], "topic_id": 7013, "date_created": 1297973780.6058979, "message": "the term \"Cloud\" comes from the illustration of the internet in technical diagrams.  It is a catch all much like \"Agile\" that does not really have a strict definition.  Much like SOA.  It's a term to lead you to an idea - but nothing strict behind it.  In other words....bullshit.  Fad.  Buzzwords.  A way to sell books. :D", "group_id": 95, "id": 135393}, {"user_id": 12505, "stars": [], "topic_id": 7013, "date_created": 1297980028.844383, "message": "I would say that cloud computing is \"infrastructure as a service\", so an Application Service Provider can provide IaaS (although ASP is usually focused on Software as a Service). Basically: buzzwords and hype :)", "group_id": 95, "id": 136528}, {"user_id": 7806, "stars": [], "topic_id": 7013, "date_created": 1298202610.1637061, "message": "I would guess ASP would be \"platform as a service\", something like Microsoft Azure or Google/Amazon's collective offerings where you do not have to manage the boxes.  Cloud Computing would be \"infrastructure as a service\", something like Amazon EC2 or Rackspace cloud where you do not have to manage the hardware.  But I agree with the above, buzzwords and hype", "group_id": 95, "id": 153068}]