[{"user_id": 17610, "stars": [], "topic_id": 15527, "date_created": 1301181375.6841149, "message": "I am thinking of replacing my four year old MacBook with an iPad or iPad2.  But is it good for consistent content creation versus consumption?  Can I write long-form pieces, blog posts, and the like with ease?", "group_id": 1295, "id": 448405}, {"user_id": 24899, "stars": [], "topic_id": 15527, "date_created": 1301182140.6350989, "message": "I don't bother booting up my pc since i got my iPad :/ unless i need to work in photoshop. For everything else i use my ipad.", "group_id": 1295, "id": 448516}, {"user_id": 21061, "stars": [], "topic_id": 15527, "date_created": 1301182819.457077, "message": "I would choose the MacBook Air or wait for the iPad 3 and hope for a better camera. For me my iPhone 4 is used for content creation because of the excellent camera (for a phone) and apps like ReelDirector, AudioBoo, camera+ and HDRPro.", "group_id": 1295, "id": 448596}, {"user_id": 2726, "stars": [], "topic_id": 15527, "date_created": 1301183309.0873151, "message": "Sure. Just use a Bluetooth keyboard.", "group_id": 1295, "id": 448633}, {"user_id": 25674, "stars": [], "topic_id": 15527, "date_created": 1301185181.427948, "message": "Do u know about ios 4.3.1 jailbreak?", "group_id": 1295, "id": 448761}, {"user_id": 17610, "stars": [], "topic_id": 15527, "date_created": 1301190749.4871609, "message": "Thanks.  @brax4444 What about the keyboard dock? Is that still available?", "group_id": 1295, "id": 448985}, {"user_id": 24307, "stars": [], "topic_id": 15527, "date_created": 1301196747.6034999, "message": "@dustdaughter I would say so, based on your type of content creation, ie writing. If you connect the iPad/2 to a dock (or prop it up) keyboard, you could literally spend hours writing with ease - either directly to your blog platform, Evernote, or another document-type app. I would assume if you get comfortable typing on the iPad directly, you can go sans-bluetooth keyboard. (For me, I'll have to consider what type of work I'm planning to do on any given day at \"the office\" (aka Starbucks), whether to only bring my iPad 2 or my MacBook Pro (for video/audio work).", "group_id": 1295, "id": 449238}, {"user_id": 17610, "stars": [], "topic_id": 15527, "date_created": 1301197176.707304, "message": "@ShermanHu Thanks. I was thinking I'd be able to write and record podcasts with GarageBand.  But I've heard that the new version of GB is less podcaster-friendly than previous editions.  So I'm still on the fence about buying one.", "group_id": 1295, "id": 449252}, {"user_id": 24307, "stars": [], "topic_id": 15527, "date_created": 1301198913.747582, "message": "Haven't podcasted in ages, was using GB on my MacBook Pro back when. Wouldn't this mean connecting a good mic to the iPad? By default, I'd choose to use my Rode NT1-A mic connected to my MacBook Pro, or record to my Zoom H1. Maybe I would do that. Record to my Zoom, connect the SD card to the iPad via card reader, then publish after minor editing? But based on habit, I might return to MBP for audio work :-)", "group_id": 1295, "id": 449321}, {"user_id": 24852, "stars": [], "topic_id": 15527, "date_created": 1301222254.395498, "message": "Don't let Gruber hear this :) . My experience is that it is not still a direct substitute for a notebook. It is essentially a new thing which you must experience. If you are looking for ultra portable solution try Macbook Air.", "group_id": 1295, "id": 450564}, {"user_id": 24307, "stars": [], "topic_id": 15527, "date_created": 1301236366.4774749, "message": "@orionlogic I hear ya. Probably won't substitute an Air or MBP for media creation. Cheers!", "group_id": 1295, "id": 451188}, {"user_id": 25705, "stars": [], "topic_id": 15527, "date_created": 1301237640.365644, "message": "If you're primarily a writer, I would buy an iPad or a netbook and load up JoliCloud or Chrome OS.", "group_id": 1295, "id": 451276}, {"user_id": 2726, "stars": [], "topic_id": 15527, "date_created": 1301245367.14569, "message": "@dustdaughter I'm not sure about the dock but I hate that it limits screen orientation.", "group_id": 1295, "id": 452048}, {"user_id": 17610, "stars": [], "topic_id": 15527, "date_created": 1301255358.832988, "message": "@brax4444 Didn't know that. Thanks for the info.", "group_id": 1295, "id": 452512}]