[{"user_id": 7712, "stars": [], "topic_id": 39108, "date_created": 1307894191.360826, "message": "Overall I'm very pleased with Super 8. It seems to be the E.T. for the forthcoming generation. I think that the version I watched in the theater had one plot-hole, the relationship between the Deputy and the man he held responsible for the death of his wife, but perhaps I missed something or perhaps that can be figured out if it's discussed further.", "group_id": 2515, "id": 1374622}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1307906858.27967, "message": "Yeah, his actions at the beginning of the film during the funeral reception (hand-cuffing, putting him in the cruiser) ultimately didn't seem justified compared with what the resolution supposedly was \"It was an accident\".  How we got from the first point to the last left me scratching my head a bit.  I understand he may have had something to deal with/overcome, but the opening scene between the two characters just seemed force to provide a barrier between their children.", "group_id": 2515, "id": 1375253}, {"user_id": 35141, "stars": [], "topic_id": 39108, "date_created": 1307974876.2297151, "message": "The whole thing hinged on him being a drunk and getting in trouble with the law. He was supposed to have taken the shift that the cop's wife ended up taking. All of this was supposed to fill in the gap between the seeming extreme arrest at the home and the vapid conclusion when the fathers meet up with their respective kids towards the end.", "group_id": 2515, "id": 1380466}, {"user_id": 35141, "stars": [], "topic_id": 39108, "date_created": 1307975100.0861471, "message": "In these types of set ups I'd expect to see a sacrifice. Redemption. They missed that though they could have had the father(s) do that. Especially the girl's father for who he had been being as backstory and within the problems of the story. Big missing that ET and Goonies got right, contextually as it relates to parents and children.", "group_id": 2515, "id": 1380512}, {"user_id": 7712, "stars": [], "topic_id": 39108, "date_created": 1307981781.1545539, "message": "From the first viewing alone, I'm not entirely clear on who the main character is--the Deputy or his son. An Impact Character is also difficult for me to identify, because the only character that changed at the end was the Alien, and it was changed by the Deputy's son. \n\nThe Deputy's son's friend, the Movie Maker, was also changed by the Deputy's son because he let go or finally consented to the fact that the girl isn't attracted to him as anything other than a friend and admitted she's attracted to the Deputy's son. \n\nAt this time I feel the Antagonist is clearly the Military (or the fellow leading the operation against the Alien).", "group_id": 2515, "id": 1381591}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1307982493.684473, "message": "I'd say the MC is the son - that seems to be evident with the fact the movie is mixing adult and children themes.  As with most films taking this approach, it's almost always meant to be viewed threw the child's perspective.  I'm having a more difficult time deciding on protagonist, because I'm not sure who's driving the story.  Up until the crash, everything is pretty much exposition - even though it's handled well.  From there...?  I'd have to admit to needing to watch the movie again.  Do we have situations where somebody is driving something, or possibly preventing (which often is viewed as being passive without a goal, though it's not).", "group_id": 2515, "id": 1381725}, {"user_id": 35369, "stars": [], "topic_id": 39108, "date_created": 1307995127.443589, "message": "the MC is the son, and he's the protagonist too. he's pursuing the OS goal of finishing the Super 8 movie. IMO the antagonist would be part the alien (prevent) and the Deputy (reconsider), and the military would function as a contagonist, trying to sway Joe off course.", "group_id": 2515, "id": 1383601}, {"user_id": 35369, "stars": [], "topic_id": 39108, "date_created": 1307995270.851625, "message": "the Deputy/father is the Impact Character and changes at the end, Joe remains steadfast and post-credits we see that they were able to finish their movie.", "group_id": 2515, "id": 1383620}, {"user_id": 7712, "stars": [], "topic_id": 39108, "date_created": 1307996250.1616509, "message": "@krantz I'm not familiar with Prevent as a Dramatica term... can't find it in the dictionary (layman or original terms). But the Alien is not trying to stop anything from moving forward... it's simply hungry and wants to go home. It was taken hostage by the military, tortured/examined, escaped, and continued its quest to simply go home.", "group_id": 2515, "id": 1383751}, {"user_id": 35369, "stars": [], "topic_id": 39108, "date_created": 1307998541.2153831, "message": "prevent/avoid (in the theory book the archetypal antagonist's action characteristic is that it physically tries to prevent or avoid the successful achievement of the goal by the protagonist). you're right about the Alien's motivations but antagonist = objective character, it's seen in terms of its dramatic function re: the overall story. it's physically preventing Joe and his friends from being able to finish their movie", "group_id": 2515, "id": 1384229}, {"user_id": 35369, "stars": [], "topic_id": 39108, "date_created": 1307999424.1911061, "message": "maybe i am wrong, and the Father is the antagonist (he confiscates the film/camera) and the Military/Alien = both parts of the contagonist... hrmmm :)", "group_id": 2515, "id": 1384448}, {"user_id": 7712, "stars": [], "topic_id": 39108, "date_created": 1307999763.504693, "message": "That's a good point. The father, the deputy, is the only one who has stopped the kids from making the movie, in fact, they were making a shoot using the military guys in the background (the military was aware of the film-making). That brings to mind another plot-hole, because the military boss (whatever) found a Kodak Super 8 film box at the train wreck, but we never saw (at least that I recall) the military perform any search for film the kids may have taken.", "group_id": 2515, "id": 1384577}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1308001783.839062, "message": "The father early on also wants to send Joe off to some six week camp/course... can't remember, so that would fit the bill as well there.", "group_id": 2515, "id": 1384908}, {"user_id": 7645, "stars": [], "topic_id": 39108, "date_created": 1308013972.9695251, "message": "This movie made me sad.", "group_id": 2515, "id": 1386473}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1308016198.6566949, "message": "Oh c'mon Jim, you're not getting off that easy!  Was it nostalgia? Sad in the sense of what it could have been?", "group_id": 2515, "id": 1386635}, {"user_id": 7664, "stars": [], "topic_id": 39108, "date_created": 1308019102.9739971, "message": "This movie made me disappointed.", "group_id": 2515, "id": 1386800}, {"user_id": 7645, "stars": [], "topic_id": 39108, "date_created": 1308019235.1742649, "message": "Made me sad because the trailer promised something so much more than what was offered", "group_id": 2515, "id": 1386808}, {"user_id": 7664, "stars": [], "topic_id": 39108, "date_created": 1308042259.22948, "message": "Had a feeling", "group_id": 2515, "id": 1388936}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1308053705.1761429, "message": "Yeah, just went back and watched the trailer and thought to myself, well, if it were that easy to get out of the train cart, why did it wait for an accident to happen?  Right where the kids were filming?  Just think, this could have been someone else's movie had the train derailed in... Roswell, NM!  That would have been a fun story about an old man, long believed crazy, who finally gets vindication when everybody else sees the alien he's been describing or the last 30+ years!  Oh well, could have been fun...", "group_id": 2515, "id": 1390342}, {"user_id": 7712, "stars": [], "topic_id": 39108, "date_created": 1308068534.292474, "message": "@JBarker Right, and that's another thing... that tiny economy pick-up truck derailed how many train cars???", "group_id": 2515, "id": 1392165}, {"user_id": 7664, "stars": [], "topic_id": 39108, "date_created": 1308076717.42678, "message": "There is no way that filming the movie is the OS goal of this movie. It is, at most, a subplot, and to steal a term from Campbell, it's the messenger that announces to the kids that their adventure is about to begin.\n\nI think this movie is a mess, and I predict storyforming failure, but this is how I would begin my analysis: [major spoliers]\n\n1. Given that there seem to be two pairs of characters (Joe & Alice; the two dads) we have to at least consider that there are two storyforms present.\n2. Storylines:\n-- The Air Force conspiracy to hide the alien (includes: The alien trying to get away)\n-- Joe dealing with the loss of his mother/Joe and his dad figuring out how to connect\n-- Louis Dainard dealing with his drinking, skipping work that day\n-- Joe and Alice falling in love\n-- The dads reconciling\n-- Making the movie/young friends and what they get up to\nMore?\n\n3. \"Moments\"\nThere were a few moments that jumped out at me as \"Ah, the filmmakers want us to notice this.\"\n1. Joe leaves Charlie to tend to the kid with the broken leg. Charlie says, \"Will you be okay without me?\" and Joe says, \"Yes, I will be.\" \nI feel like this is part of Joe's storyline, but to what end, I have no idea. Did Joe rely on Charlie?\n2. Joe tells the Alien \"go home, not everyone is bad, you can move on\"\nClearly Joe has learned that he can move on. He doesn't need to hold onto the past, his mother, etc. But I didn't really see it happen.\nAh, now I understand #1 -- Alice tells Joe not to let Charlie blow up the model train; Joe wants to because they have been friends for so long... but now he can move on.\n3. The dad's in the car at the end, \"It was an accident.\" Came from nowhere, but wrapped up their story", "group_id": 2515, "id": 1392977}, {"user_id": 7645, "stars": [], "topic_id": 39108, "date_created": 1308077190.7329831, "message": "Yeah, I don't think you're going to find a single storyform - probably a bunch of half-baked ones with the same subject matter. It seems like they set out to write a Steadfast MC (Joe)/Change IC (Jackson) story, but then remembered that in E.T. Elliot changed, so they went back and warped the MC throughline to follow suit.", "group_id": 2515, "id": 1393022}, {"user_id": 7664, "stars": [], "topic_id": 39108, "date_created": 1308077022.3630469, "message": "Unfortunately, there are about a dozen weird holes:\n-- The military sees a yellow car driving away from the scene of the crime, and is worried about whether or not it got the license. \n-- The military finds the kodak boxes, but doesn't approach the filming kids, as noted before. (I find this kind of believable, since they are way to young to drive, but there wasn't even a nod to it?)\n-- The alien is being transported with the blocks that make up his ship. Wouldn't you keep those apart?\n-- The cube zipping through the wall leads to what exactly? \n-- The military didn't notice a cube was missing, despite boxing them up so neatly?\n-- The cubes are still in the city, even after we see them driven away\n-- I'm pretty sure the yellow car gets destroyed by the train, but I'd have to watch the movie again to be certain. Seems like an odd mistake given that this was most likely CGI.\n-- The town has no electricity. Except the school, so the kids can watch the movies and listen to the tapes\n-- The doctor is killed. Yes, he's being stubbornly quiet, but really, kill him? He still has information. Not exactly a hole, but false drama.\n\nThis is exhausting.", "group_id": 2515, "id": 1393008}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1308079616.410234, "message": "Dr. Richard Kimble would have died in this train crash, that's for sure.  At the very least, he would have turned into... the one-armed man.  But that's another story.  It's almost like they thought up some scenes for a trailer, came up with the throwback ending (with the pendent being released)... then tried to make a movie around it.  In that sense, it wasn't much different than a lot of half-baked action films built around chase scenes.", "group_id": 2515, "id": 1393277}, {"user_id": 35369, "stars": [], "topic_id": 39108, "date_created": 1308082148.704706, "message": "@MikeDerk why do you think finishing the movie isn't the OS goal?", "group_id": 2515, "id": 1393653}, {"user_id": 7664, "stars": [], "topic_id": 39108, "date_created": 1308083334.558568, "message": "The movie ends with four things:\nThe Alien leaves\nJoe holds hands with the girl\nThe kids come to peace with their parents\nJoe lets go of the necklace\nPlus, right before this, the parents come to peace with each other, and Joe gives the alien permission to leave (and not eat Alice).\n\nThese are the things that are coming together at the end of the movie. That's one reason.\n\nA second reason:\nThe kids all stop trying to make the movie. Charlie doesn't even get upset that he's not able to scoop up any 'production value' from the Air Force base where they are being held.\n\nThree:\nIt's possible that it's the OS (if I can use the term loosely) of a subplot.\n\nFour:\nAt the end of Super 8, the kids have failed to make the movie. Yet, we watch the movie during the credits. I think this indicates that it is mostly inconsequential to the message.\n\nFive: \nThe movie acts as messenger a) when it gets them out to the train station and b) when it reveals that something crawled out of the train (something, btw, that Joe witnessed -- at least he heard the banging and saw the door fly -- but he *never* brings this up to his friends??!!!)\nBasically, I think that making the movie gets pushed aside by the major story.", "group_id": 2515, "id": 1393827}, {"user_id": 33839, "stars": [], "topic_id": 39108, "date_created": 1308252226.2913361, "message": "Having watched this movie again last night, I noticed early on that Joe's \"surrogate family\", specifically the mother, says his father \"never had to be a father before\".  So right there is a need, but unfortunately, we never see what it takes for him to actually BECOME a father.  The closest thing we have is the other father relationship between Alice and her father - to which, at one point, Jackson tells Joe how badly he treats her.  It's too bad this wasn't examined in such a way for Jackson to realize how his treatment of Joe isn't all that much different.  Had Jackson seen the pain Alice's relationship with her father was causing her more directly and realized he was no different, I think it could have been a more emotionally involving film.", "group_id": 2515, "id": 1412968}]