[{"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306298287.2957771, "message": "@martin_sunset good perspective.", "group_id": 250, "id": 1174128}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306296771.387325, "message": "Just launched a startup 7 days ago.http://quitjuice.com . Need traffic of course, and serps. I've been approached by a related site http://quitsmokingsupport.com which is getting very targeted traffic  100k + uniques per month. Would you pay for that or stick with google ads etc..? If so how much?  Keep in mind I'm bootstrapped and completely self funded at this point.", "group_id": 250, "id": 1173962}, {"user_id": 9018, "stars": [], "topic_id": 36692, "date_created": 1306297140.650152, "message": "one of the things that i'm finding works really well for our startup www.LiveFanChat.com is ad swaps.\n\nEg i'll run 20,000 ads for your site on LiveFanChat and you run 20,000 ads for our sports chat sites on your site.\n\nAt the end of the 20k run we each look at the results and then decide to roll over and do it again or walk away.", "group_id": 250, "id": 1174000}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306297387.7275791, "message": "@deancollins interesting idea if I had some traffic to speak of. If i traded an ad with someone with comparable traffic i'd be right where i started but with an ugly ad on my site.", "group_id": 250, "id": 1174023}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306297605.2766809, "message": "@martin_sunset Wow nice. Affiliate stuff I think could work but for example, I looked at a couple of affiliate network sites. One of them didn't even want you to sign up unless you were making already 50k / year at least and had been online for more than a year.", "group_id": 250, "id": 1174037}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306297751.4369609, "message": "I'm at literally ground Zero. no traffic no sales. just launched. Its kinda like looking for a job and being told you don't have any experience kid, and you cant get experience without a job. Bloggers, affiliate marketers, news outlets, all want to see some numbers before getting involved.", "group_id": 250, "id": 1174076}, {"user_id": 26065, "stars": [], "topic_id": 36692, "date_created": 1306297413.9607, "message": "I would start thinking about setting up an affiliate program and talk to all the sites similar to the one you mentioned. You are in a niche, which makes identifying the target customers much easier. In a previous company of mine I picked leaders of ethnic groups as affiliate partners, which provided us with roughly 25K recurring customers within half a year. @deancollins good idea", "group_id": 250, "id": 1174026}, {"user_id": 26065, "stars": [{"date_created": 1306298236.1072869, "user_id": 19708}, {"date_created": 1306305260.3622561, "user_id": 13501}, {"date_created": 1311066906.3698771, "user_id": 13735}], "topic_id": 36692, "date_created": 1306298177.6416509, "message": "Back then (it was 2000) we had to do the whole affiliate stuff by ourselves, that means identifying and talking to the potential affiliates and setting up some admin site for that as well. I think cloudomatic.com has an affiliate program under one of it's subdomains, maybe that is easier to get into. In any case it often takes time to build a site, exponential growth is flat for a long time :P. Persistence is key in doing something like this. You have to talk to those people over and over again. In a lot of cases they will just write about you so that you shut up already (no kidding here). You should literally walk out of the door and talk to people in all those self help groups, all the people who run those places, and evangelize there.", "group_id": 250, "id": 1174117}, {"user_id": 26065, "stars": [], "topic_id": 36692, "date_created": 1306298393.951643, "message": "something else: This is a great one by the appsumo founder that you should read. http://blog.asmartbear.com/burn-out.html", "group_id": 250, "id": 1174139}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306299981.493017, "message": "Besides the hard work and hustle to get out there, has any one found value in paid adspace on related sites for your startup?", "group_id": 250, "id": 1174394}, {"user_id": 23304, "stars": [{"date_created": 1306481108.3228791, "user_id": 19708}], "topic_id": 36692, "date_created": 1306318696.742558, "message": "Advertising is an expensive and often wasteful way to get traffic, which is why people blog, tweet, etc. Any way to raise results from Organic search. And use email to friends:-)", "group_id": 250, "id": 1176329}, {"user_id": 14894, "stars": [{"date_created": 1306481106.179003, "user_id": 19708}], "topic_id": 36692, "date_created": 1306354082.3366029, "message": "If you've literally just launched, see how much you can get done with pure hustle.  Blog, tweet, hit up the self-help sites and comment.  Try looking for prominent self-help bloggers and comment on their posts linking back to (this is key) your blog posts which then draw them to your site.  You need to soft sell hard if that makes sense.", "group_id": 250, "id": 1183804}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1306480945.222261, "message": "@theGuywithaTie  @hardaway  Thanks. Thats what I needed to hear.", "group_id": 250, "id": 1201815}, {"user_id": 34657, "stars": [{"date_created": 1306850844.2532599, "user_id": 19708}], "topic_id": 36692, "date_created": 1306788540.1824939, "message": "Whether advertising is relevant depends on your product and/or service. At the end of the day if it allows you to reach your target audience and inform them with compelliing reasons for finding out more which can then lead to a purchase then go for it.  LinkedIn offers B2B businesses a way of getting to a very targetted audience.", "group_id": 250, "id": 1231187}, {"user_id": 31145, "stars": [], "topic_id": 36692, "date_created": 1306823008.9520719, "message": "yes i think so", "group_id": 250, "id": 1235064}, {"user_id": 34718, "stars": [], "topic_id": 36692, "date_created": 1306902703.346729, "message": "@deancollins Personally, I don't recommend paying for ads, especially of you're bootstrapped. Take a look at the book unmarketing; it completely changed the way I look at customers/sales/marketing. When you're rich then pay for ads :-)", "group_id": 250, "id": 1248367}, {"user_id": 9018, "stars": [], "topic_id": 36692, "date_created": 1309295730.7468541, "message": "@Barcelona, but i'm not reccomending payin....read my comments. I'm reccomending trading ads with websites.\n\neg other sports sites run ads for our www.LiveFanChat.com sites and we run theirs.\n\nI'll swap 20,000 ads for anyone who wants to run on http://www.LiveCourtChat.com  today which had 2144 unique visitors with 9 minute avarage visits.", "group_id": 250, "id": 1511336}, {"user_id": 37615, "stars": [], "topic_id": 36692, "date_created": 1309996139.1944511, "message": "I wouldn't recommend advertising for a day-one product, because in a relative sense advertising will be too expensive and your business model isn't necessarily nailed down. Advertising becomes more useful later, when your product is well-defined and you have a great idea of who your ideal customer is. Try scoring free advertising somehow instead.", "group_id": 250, "id": 1580816}, {"user_id": 19708, "stars": [], "topic_id": 36692, "date_created": 1310049489.7798929, "message": "@vnaylon Thanks for the feedback.", "group_id": 250, "id": 1584698}, {"user_id": 16477, "stars": [], "topic_id": 36692, "date_created": 1310321068.3627939, "message": "/play rimshot", "group_id": 250, "id": 1605642}, {"user_id": 13735, "stars": [], "topic_id": 36692, "date_created": 1311067332.2044711, "message": "If you are going to go with Google ads or any other ad network you better be prepared to lose money on it. For a startup with no idea of a customers lifetime value your focus for an ad campaign can only be on accelerating your feedback loop. Can you afford to pay for ads to get feedback?", "group_id": 250, "id": 1669990}, {"user_id": 13735, "stars": [], "topic_id": 36692, "date_created": 1311067735.533052, "message": "As an alternative I would suggest getting the product / service into the hands of users, give it away if you have to (If nobody will use it for free you have bigger problems anyway). If the product works for your early users they will be more than happy to go tell their friends about it. Spend the time and money you are considering putting into an ad campaign to make it easy for your happy customers to spread the word. Feel free to PM me your email if you want to discus details more specific to your startup.", "group_id": 250, "id": 1670023}]