[{"user_id": 7712, "stars": [], "topic_id": 7960, "date_created": 1298385189.4066, "message": "Hi. I use Dramatica as a starting point, and as a tool to look at my writing from multiple perspectives. Dramatica has a Scenes feature which allows scene descriptions (that may include dialogue) to be entered, but for actual re-writes I export the file to Screenwriter. Screenwriter opens the exported Dramatica scenes in its Navidoc menu, which allows easier navigation, ordering, and re-writing of those scenes.", "group_id": 2515, "id": 179211}, {"user_id": 13650, "stars": [], "topic_id": 7960, "date_created": 1298405388.167872, "message": "So if you are using it as a starting point are you going through the entire query sessions or just a few of them?", "group_id": 2515, "id": 182148}, {"user_id": 7664, "stars": [], "topic_id": 7960, "date_created": 1298407719.01724, "message": "I use it from the beginning, but I have found it to be a more powerful tool when I rewrite.", "group_id": 2515, "id": 182490}, {"user_id": 7712, "stars": [], "topic_id": 7960, "date_created": 1298423295.2709191, "message": "I may use Dramatica as a starting point, but when I do, I do not necessarily use the \"Start Here\" button and begin answering questions in that dreadfully intimidating sequential list (that can take a few days to complete). \n\nActually, it's really not the list that's intimidating but learning the vocabulary... but the more familiar I become with Dramatica concepts and vocabulary, the more questions in the Query System I can answer. \n\nThat being said, when I use Dramatica to start a new writing project, I jump around from the Plot Progression to Build Characters to Storyforming and Storyencoding. With Storyforming and Storyencoding, I do not necessarily start at the top of my list and work down, but rather I select the traits I know I want the Main Character and Impact Character to have and continue to fill in the blanks as the inspiration comes to me. I'll even open up the Story Points section and fill in what I know when I know it IF I know it. Once my initial storyform has been reduced to \"1\", then I like to open up the Theme Browser and let the elements guide me in illustrating the story. At least that's the way it's working so far, but it seems to be working well.", "group_id": 2515, "id": 185335}, {"user_id": 7645, "stars": [], "topic_id": 7960, "date_created": 1298441103.553417, "message": "Always from the beginning. Why waste time writing something that doesn't mean anything?", "group_id": 2515, "id": 186018}, {"user_id": 7664, "stars": [], "topic_id": 7960, "date_created": 1298443343.8866329, "message": "Because ideas develop as they gestate and marinate in brain sauce. If you lock them down too early, you can miss that. I always use the program to force myself to ask a bunch of questions at the beginning, but I never fill anything in because I don't want to lock it down. (If I could easily transfer text from one part of the query system to another, that would probably change.) Still, the number of ideas I have that are missing one or two throughlines is staggering... do I want to decide too early who should be the IC? Or do I want to let my head wander for just a bit more?", "group_id": 2515, "id": 186083}, {"user_id": 7664, "stars": [], "topic_id": 7960, "date_created": 1298443450.4511769, "message": "To put it differently, would M. Night have thought \"Oh man, he's dead!\" ten drafts in if he was hewing to a storyform?", "group_id": 2515, "id": 186086}, {"user_id": 13109, "stars": [], "topic_id": 7960, "date_created": 1298506697.3866739, "message": "I haven't had the opportunity to re-write with Dramatica yet.  Still got to try that out.  So - I guess the answer is from the beginning.", "group_id": 2515, "id": 193823}]