[{"user_id": 19064, "stars": [], "topic_id": 10664, "date_created": 1299393933.0234361, "message": "Domaining is the buying and selling of domain names. To make a profit of course.", "group_id": 4280, "id": 278853}, {"user_id": 19242, "stars": [], "topic_id": 10664, "date_created": 1299473954.7168739, "message": "A domain or domain name is the name that identifies a website. \nEach domain must be unique on the internet. For example, \"www.google.com\"is the domain name Masadelante's website. \nA single Web server can serve multiple web pages from multiple domains, but a domain can only point to a server.   lafg13", "group_id": 4280, "id": 285679}, {"user_id": 19385, "stars": [], "topic_id": 10664, "date_created": 1299524956.8508739, "message": "domaining is a kind of business of making money with internet domain names.It means selling the domain names for the clients for their webhosting.", "group_id": 4280, "id": 289799}, {"user_id": 19908, "stars": [], "topic_id": 10664, "date_created": 1299690885.981391, "message": "Profit based transactions (buying, selling) of web domains is called domaining. Bidding with domains are more profitable. For this one has to be a little cleaver. He has to select and register some nice domain names anticipating its demand, and can sell to someone who need that domain name.", "group_id": 4280, "id": 306831}, {"user_id": 20164, "stars": [], "topic_id": 10664, "date_created": 1299733575.856266, "message": "The business of buying, selling, and developing domain names. It is also used to describe the practice of monetizing domain name registrations", "group_id": 4280, "id": 311046}, {"user_id": 20388, "stars": [], "topic_id": 10664, "date_created": 1299786334.558286, "message": "Domain name speculation is the practice of identifying and registering or acquiring Internet domain names with the intent of selling them later for a profit.", "group_id": 4280, "id": 315759}, {"user_id": 21835, "stars": [], "topic_id": 10664, "date_created": 1300236004.498827, "message": "the business of buying and selling of web domain with the intent of selling it later for profit  is called domaining.", "group_id": 4280, "id": 361457}, {"user_id": 21879, "stars": [], "topic_id": 10664, "date_created": 1300246251.7689559, "message": "Domain name speculation is the practice of identifying and registering or acquiring Internet domain names with the intent of selling them later for a profit. The business of buying, selling, and developing domain names. It is also used to describe the practice of monetizing domain name registrations (eg through pay per click (PPC) or parking pages).", "group_id": 4280, "id": 362276}]