[{"user_id": 35272, "stars": [], "topic_id": 38202, "date_created": 1307300047.2454231, "message": "Please read user reviews http://www.ubun2.com/question/964/ubuntu_1104_review_please_share_your_install_upgrade_experience", "group_id": 97, "id": 1294739}, {"user_id": 3444, "stars": [], "topic_id": 38202, "date_created": 1307329632.1356809, "message": "I'm using 11.04 with unity almost exclusively at home and I have to say, it's not as fast / responsive as 10.10 was. I think they're on to something good here, but it needs quite a bit of work.", "group_id": 97, "id": 1299925}, {"user_id": 27155, "stars": [{"date_created": 1307355720.4765379, "user_id": 9108}], "topic_id": 38202, "date_created": 1307349137.286073, "message": "I think it all has to do with Unity. It was not ready at all but they decided to push it out. I check every Ubuntu, Suse, JoliOS and now MoonOS release to see what is the state of the Linux desktop.  From where i see it Unity damaged the image of Ubuntu with its users because it makes the OS unstable. That said if people just go and use 11.04 Classic Mode and like always add the missing graphic drivers they will then find that under that mode it is the best Ubuntu Canonical has shipped. The problem is that it is not out of the box. For other stupid decisions i still find atrocious the window controls being switched to the left as if it was OS X. From what i have read in Ubuntu articles most hate it. But then maybe in Canonical surveys and focus groups what they do works for them. Or at least one has to presume so.", "group_id": 97, "id": 1301404}, {"user_id": 9108, "stars": [], "topic_id": 38202, "date_created": 1307356046.7027371, "message": "I couldn't agree more with all of the points @AvatarX raised. I was actually excited to try Unity at first, but I found it to be a horrible experience. In theory it may have been fine, but it simply didn't run well. With Unity, just dragging a Terminal across the screen would make the graphics stutter and lag. If I switched to Gnome and did the same thing, there weren't any problems. I also disliked the decision to move the buttons to the left side of the windows. That, combined with putting the menu bars at the very top of the screen with Unity, makes me feel like they were simply trying too hard to emulate the OS X experience.\n\nMy big concern is that Ubuntu is throwing support into Unity, which runs poorly. Since it is so similar in design to Gnome 3, I had to question whether or not here would even continue to be Gnome support in future releases. Luckily, Fedora 15 released with Gnome 3 out of the box. It runs like a champ on all of my hardware, so I just jumped ship entirely.", "group_id": 97, "id": 1301830}, {"user_id": 34718, "stars": [], "topic_id": 38202, "date_created": 1307367167.2981429, "message": "Ubuntu 11.04 was a bummer. I tried installing it and everything stopped working. My USB wifi adapter wasn't even recognized, but it was supported out of the box on 10.10. I absolutely hate unity, as it \"wasn't supported by me graphics card\". I have a pretty high end card (gt210 1gb) so everything should have worked. The new way panels are managed is ugly too.", "group_id": 97, "id": 1303071}, {"user_id": 26353, "stars": [], "topic_id": 38202, "date_created": 1307391369.5697191, "message": "I've noticed some glitches here and there,  but I wouldn't say it's a bad experience.  It runs very well on my Nvidia card, which isn't new by any means (GeForce 8600M GT).  I actually think Unity brings some good changes to the desktop.   Canonical took some risks and while I agree it's a bit early (eg, lack of new indicator support in many apps),  I don't think it was a bad move.", "group_id": 97, "id": 1310799}, {"user_id": 22988, "stars": [], "topic_id": 38202, "date_created": 1307394706.4360609, "message": "it's kind of like Vista in Ubuntu world. Many concepts look interesting yet need more polishing, maybe next release.", "group_id": 97, "id": 1311654}, {"user_id": 34718, "stars": [], "topic_id": 38202, "date_created": 1307421888.791045, "message": "11.10 Oneiric Ocelot sounds like it will be better", "group_id": 97, "id": 1316953}, {"user_id": 12641, "stars": [], "topic_id": 38202, "date_created": 1307463437.0347509, "message": "My experiences with 11.04 have been very good overall... with one exception: Older hardware can have problems with Unity, especially depending on which display drivers they are using.  Aside from that, I am happy so far and it has much potential.  Case in point: I am using a fresh install on a new laptop and Unity is smooth, beautiful, and screaming fast.", "group_id": 97, "id": 1323117}, {"user_id": 20107, "stars": [], "topic_id": 38202, "date_created": 1307463661.076494, "message": "I'm glad we still have the gnome integration. I'm having trouble getting used to unity, but I'm sure by the time 11.10 is released everything will be polished and fluid.", "group_id": 97, "id": 1323174}, {"user_id": 2576, "stars": [{"date_created": 1307486458.914418, "user_id": 9108}], "topic_id": 38202, "date_created": 1307468092.2202799, "message": "So horrible... even with \"Ubuntu classic\" it's buggy as hell. And unity, well, is just unusable. I'm not sure what they were trying to go for here. It's equally confusing for brand new linux users and season veterans alike. I swear it took like 5 minutes just to figure out how to open a terminal.", "group_id": 97, "id": 1324820}, {"user_id": 9108, "stars": [], "topic_id": 38202, "date_created": 1307486558.6325691, "message": "@FCGreg What kind of video card is in your system? I have a year-old laptop with an Nvidia Geforce GT 130M. It isn't spectacular, but it should be more than enough to run a window manager without having lag just from dragging windows around. Unfortunately, that's exactly what I saw.", "group_id": 97, "id": 1329687}, {"user_id": 9108, "stars": [], "topic_id": 38202, "date_created": 1307486620.6393521, "message": "@swindsor I agree, and it concerns me whether or not \"Ubuntu classic\" will even be an option in the next iteration, given how similar Gnome 3 is to Unity (at least in appearance... it sure runs a lot better). I don't see them sticking around with an older version of Gnome.", "group_id": 97, "id": 1329710}, {"user_id": 2011, "stars": [], "topic_id": 38202, "date_created": 1307511714.4184141, "message": "Only problem I've experienced with natty is that Cassandra seems to crash almost instantly while it works beautifully under 10.10", "group_id": 97, "id": 1334137}, {"user_id": 12641, "stars": [], "topic_id": 38202, "date_created": 1307517290.410923, "message": "@JohnFail It's a generic Intel on-board display adapter using nvidia-based drivers.  Keep in mind, something I noticed with 11.04 is that the open source drivers for nvidia seem to be preferred over the proprietary ones.  The open source ones are not as good/fluid/etc.  Check to see which drivers your X install is using.  My desktop is sporting all the Unity look/feel with translucent windows where supported... no problems at all.", "group_id": 97, "id": 1334543}, {"user_id": 9108, "stars": [], "topic_id": 38202, "date_created": 1307528760.99861, "message": "@FCGreg Interesting, thanks for the information. I can't actually check now, though, since after a few weeks I gave up on Ubuntu 11.04 in favor of Fedora 15 which has been running like a champ. I highly prefer Gnome 3 to Unity.", "group_id": 97, "id": 1335475}, {"user_id": 34718, "stars": [], "topic_id": 38202, "date_created": 1307550960.3235469, "message": "Is Gnome 3 buggy? I'm thinking about installing it on my 10.10 build. Does it mess around with all my compiz settings?", "group_id": 97, "id": 1339071}, {"user_id": 17124, "stars": [], "topic_id": 38202, "date_created": 1307569342.4632981, "message": "Ubuntu w/ Gnome, that would be Linux Mint, I think.", "group_id": 97, "id": 1343018}, {"user_id": 2576, "stars": [], "topic_id": 38202, "date_created": 1307573740.1018, "message": "@JohnFail Oddly enough, gnome 3 doesn't look that bad... but I've yet to try it to compare.", "group_id": 97, "id": 1343541}, {"user_id": 2576, "stars": [], "topic_id": 38202, "date_created": 1307573880.346154, "message": "I think I've found some cause of my lagginess - I have a radeon 1300, which apparently doesn't work with the proprietary fglx drivers. As a result, with compiz enabled, it seems to drag everything down pretty bad w/o acceleration. =/", "group_id": 97, "id": 1343562}, {"user_id": 9108, "stars": [], "topic_id": 38202, "date_created": 1307581061.0285311, "message": "@swindsor I really like it so far. I've been running it for about 3 weeks on both of my computers. Even on an older laptop with some pretty low specs, everything is really smooth. I think it's definitely worth checking out if you're even a little interested.", "group_id": 97, "id": 1344529}, {"user_id": 10453, "stars": [], "topic_id": 38202, "date_created": 1307595867.152401, "message": "well, I just change to Xubuntu.. with XFCE .. I didnt like the unity or gnome 3.. too much problems =(", "group_id": 97, "id": 1346433}, {"user_id": 12641, "stars": [], "topic_id": 38202, "date_created": 1307758013.8625901, "message": "@Josesordo  On one of my old laptops with an nVidia graphics chipset I'm using Xubuntu 11.04 (with XFCE) and it's working great.  FYI...", "group_id": 97, "id": 1368164}, {"user_id": 34718, "stars": [], "topic_id": 38202, "date_created": 1307773385.5504711, "message": "anyone have any ideas on getting unity to work with my 1gb nvidia gt210 card? apparently my vendors tools aren't supported or something dumb like that", "group_id": 97, "id": 1368851}, {"user_id": 35272, "stars": [], "topic_id": 38202, "date_created": 1307847688.5432701, "message": "@barcelonaFC post this question on ubun2.com and someone will have an answer for you", "group_id": 97, "id": 1372893}, {"user_id": 34718, "stars": [], "topic_id": 38202, "date_created": 1307861475.9937971, "message": "@kringo thanks for the tip", "group_id": 97, "id": 1373317}, {"user_id": 10453, "stars": [], "topic_id": 38202, "date_created": 1308108636.67012, "message": "@FCGreg hehe.. cool, the XFCE is very light =)", "group_id": 97, "id": 1397345}]