[{"user_id": 27456, "stars": [], "topic_id": 33175, "date_created": 1304349589.1599779, "message": "Hey guys, I'm looking for some of your insights on a new side project I just put out at http://www.sparkmuse.com/foundry. The basic premise is a \"Kickstarter for social capital\" targeted at helping startups. List your ideas, see how many people commit to them, and build a prevalidated user-base for an entrepreneur along the way.", "group_id": 250, "id": 884502}, {"user_id": 5136, "stars": [], "topic_id": 33175, "date_created": 1304350830.235755, "message": "I think it is cool, but I'll not come back to it many times. Probably 'cause I'm not the target user and I don't need it...", "group_id": 250, "id": 884759}, {"user_id": 30602, "stars": [], "topic_id": 33175, "date_created": 1304424920.041502, "message": "I just applied. I love the idea. More room to make it better. So far from what I see, I think people need to do a better job of explaining their ideas. Then for example, the numbers I see for Commit To See or Commit To Try will be more credible to me. And maybe one would get more responses elicited. Now if you like the idea, and may want to discuss it more with the individual, or perhaps take it private for more in-depth discussions, can that be done?", "group_id": 250, "id": 896923}, {"user_id": 27456, "stars": [], "topic_id": 33175, "date_created": 1304432667.9064951, "message": "Thanks @johnny5alive. The only way to have a private discussion now is for entrepreneurs to contact people who have committed to a survey; otherwise, the discussion happens within the idea posting itself. I definitely agree that the ideas could use some better explanation. I've considered allowing them to be collaboratively edited by members so they can be improved organically.", "group_id": 250, "id": 898467}, {"user_id": 30602, "stars": [], "topic_id": 33175, "date_created": 1304542748.600302, "message": "Yea, I think one of the core goals you guys could consider working towards, is how to get others to feel 'ownership' into an idea they've perused and like. Right now, and that'll probably change with your collaboration tool, it feels like I read a bunch of ideas, think 'oh cool'!, maybe throw in a comment, and then that brief ounce of connection to the idea sorta ends there.", "group_id": 250, "id": 919743}]