[{"user_id": 16637, "stars": [], "topic_id": 9707, "date_created": 1298988250.9056621, "message": "I'm curious why you chose to use XHTML 1.0 instead of HTML5, especially since you're using a number of CSS3 techniques (e.g. -webkit-gradient: linear). You'd be able to get rid of a number of non-semantic divs in your code, have less code to deal with and end up heading towards a better mobile solution in the end. Just something to think about.", "group_id": 88, "id": 234755}, {"user_id": 1516, "stars": [], "topic_id": 9707, "date_created": 1298990288.1527231, "message": "well, they're sending every page with a text/html content type, so it's actually as much HTML as HTML5", "group_id": 88, "id": 235035}, {"user_id": 209, "stars": [{"date_created": 1299009686.330389, "user_id": 8391}], "topic_id": 9707, "date_created": 1298990833.5153069, "message": "If they're anything like me, it's because \"launch\" is more important than \"learn html5 difference, and then launch\"  even if it does only take a few afternoons.", "group_id": 88, "id": 235145}, {"user_id": 13249, "stars": [], "topic_id": 9707, "date_created": 1298994966.80791, "message": "IE fails pretty hard at html5 as well, unfortunately, some people are stuck with it, or don't know any better.", "group_id": 88, "id": 235870}, {"user_id": 779, "stars": [], "topic_id": 9707, "date_created": 1298994746.1595831, "message": "And you should consider that HTML5 is still a Draft - http://www.w3.org/TR/html5/", "group_id": 88, "id": 235831}, {"user_id": 4, "stars": [{"date_created": 1299000124.580353, "user_id": 224}], "topic_id": 9707, "date_created": 1298998133.091996, "message": "yes we def thought about it... But I guess the two main reasons were development speed and support. We wanted everyone to be able to use convore so we actual support ie7 and have some support for ie6 as well. We set some pretty aggressive deadlines for ourselves so it made a bit more sense to stick to what we know the best for this release. Don't worry though html5 will be apart of convore's future.", "group_id": 88, "id": 236230}]