[{"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308671189.7552021, "message": "My first question is: Will heroku do the job?", "group_id": 4606, "id": 1449525}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308671064.63392, "message": "Sigh, how can I paste this in without it getting all stupid formatty. Ah, whatever. It can word wrap. That's what I get for typing stuff out in notepad I guess.", "group_id": 4606, "id": 1449512}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308671000.2834401, "message": "I'd like to create a brand new server for hosting an RoR website. I'd also like the ability to push it up to the server (using capistrano + deprec or something). It would be nice to have it create a staging environment that could be deployed to separatley.\n\nEssentially what I want is something like this:\n- Install Ubuntu\n- Run some script against it that sets up the RoR stack + RVM (with staging + production) - chef receipe? puppet?\n\nFrom here I would have the ability to push to staging or production, with a maintenance page that would go up during the transition. The push would include bundle install.\n\n@fnichol did a presentation on chef and it looked like the way to go for deployment, but I'm not sure about the pushing up to the server.\n\nRemember, I'm a Windows fella, so I'd like to mess around with scripts and such as little as possible. Though I'm willing to do the work if needed.\n\nThis is a pretty broad topic, so maybe we could structure them like this:\n\nUbuntu(or other distro) Deployment:\nItem to use for deployment, link\n\nRoR File Deployment:\nSome deployment item, link\n\nI have looked over the notes (from the presentations) on yegrb's site, but I'm looking for more of a howto a -> z (which could be put on the wiki also). I also tried googling a bunch and can't find a -recent- guide which does the above.\n\nMaybe someone has a better solution than the steps above? Help is much appreciated!\n", "group_id": 4606, "id": 1449500}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308671989.702436, "message": "Good question. For the cost I'd rather stick to slicehost. Quite a bit of processing happens every 30 minutes and I wouldn't want to go over my processing limit. Couple other limitations that I dislike. So no, I'd like to stick to a fresh VPS.", "group_id": 4606, "id": 1449640}, {"user_id": 13919, "stars": [], "topic_id": 39994, "date_created": 1308675869.686697, "message": "I'd look at deployment and provisioning a server as separate activities. You'll likely only provision once, but will be deploying many changes over the lifetime of an app. I can't speak to whether you should use Puppet, Chef, or something else since I'm just learning them myself. Chef does seem like the new hotness, but Puppet has a bigger community and more docs. If you want to test out a server configuration then take a look at something like Vagrant (http://vagrantup.com/). It makes automatically building VM's a snap and will let you lock down your provisioning without wasting a slice.", "group_id": 4606, "id": 1449968}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308676721.6271651, "message": "They are separate activities. But for essentially anyone who wants to setup a configuration as above (which to me doesn't seem like it would be uncommon). I just want to be able to click \"go\" with some configuration for my server to be setup. Then from my project \"deploy!\" with some configuration.", "group_id": 4606, "id": 1450067}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308678091.621413, "message": "Regardless. I can find some guides on slicehost for setting up a ubuntu image, but it doesn't have a decent deployment setup.", "group_id": 4606, "id": 1450266}, {"user_id": 13919, "stars": [], "topic_id": 39994, "date_created": 1308676938.200238, "message": "Heroku is definitely the best way to go if you want something simple like what you're describing. Can you adjust the background processing to reduce the costs? Otherwise, Puppet and Chef both provide the automated workflow you're talking about but will require some learning before you can use them. Can any of our chefs / puppet masters recommend the best place to start?", "group_id": 4606, "id": 1450091}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308677423.3725259, "message": "So from what I can see with heroku, at the cheapest cost is 35$ for 1 web dyno and 1 worker dyno, and my database is over 5MB which makes it another 15$. Total is 50$. The slicehost that I need (384 meg one) is 25$. I realize that you pay more for heroku because it just \"works\", scalable etc., but I feel that for a simple app it's just way to much.", "group_id": 4606, "id": 1450174}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308678089.035223, "message": "In theory I could take a box that I have (with decent specs) add 25$ to my own shaw plan and get 50mbps down, and 3mbps up (website doesn't serve content) build the RoR box myself and host it myself.", "group_id": 4606, "id": 1450263}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308678091.3837979, "message": "Depending on traffic that would work for awhile (350ish kb/s up). And in fall they're rolling out even more bandwidth.", "group_id": 4606, "id": 1450265}, {"user_id": 13919, "stars": [], "topic_id": 39994, "date_created": 1308678286.549016, "message": "Most of what you're paying for is the workflow that Heroku gives you. As you say, you can get the actual infrastructure keeper elsewhere. I'm not saying I disagree with you as I use rackspace to host most of my apps these days and do the provisioning myself.\n\nI've been playing with Chef for one of my projects and didn't find getting a quick box setup with it was that tough, but it's got a lot of moving parts to learn if you want to do anything custom. I'm just about to try Puppet for another project I'm working on and am hoping to compare the experience then pick one to learn well. Watch for a blog post once I've done that.\n\nIn the main time I'd say you could probably modify the steps in this Gist to setup a new box quickly... https://gist.github.com/858425", "group_id": 4606, "id": 1450303}, {"user_id": 13919, "stars": [], "topic_id": 39994, "date_created": 1308678288.367687, "message": "Deploying is super easy if you use something like vlad or capistrano. Have you taken a look at either of those? It's say that they're about as smooth a process as deployment gets.", "group_id": 4606, "id": 1450306}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308683777.0069201, "message": "They seem to only run hourly jobs (for 3$ more). Can it be set to every 30 min?", "group_id": 4606, "id": 1451126}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308683437.9664471, "message": "No?", "group_id": 4606, "id": 1451056}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683474.6674261, "message": "I used to, but it was stupid. Now I just use rackspace", "group_id": 4606, "id": 1451065}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683481.99176, "message": "for things that heroku really doesn't work for", "group_id": 4606, "id": 1451067}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683590.129986, "message": "When you autoscale the workers, they turn on and off when needed, and they bill by the second. I assume it'll be less than $10 for your workers", "group_id": 4606, "id": 1451095}, {"user_id": 2633, "stars": [{"date_created": 1308744686.3870549, "user_id": 14826}], "topic_id": 39994, "date_created": 1308683430.303134, "message": "Don't ever host your own hardware", "group_id": 4606, "id": 1451054}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683460.6195071, "message": "Unless you have really specific requirements, it's just not worth it.", "group_id": 4606, "id": 1451059}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683506.5697391, "message": "You can autoscale your workers on heroku too (i wrote a blog post, and there are gems i think)", "group_id": 4606, "id": 1451077}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308683545.337635, "message": "At the absolute lowest settings it's still 50 a month though, no?", "group_id": 4606, "id": 1451086}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308683611.700907, "message": "hmmmmm", "group_id": 4606, "id": 1451097}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308683664.3412471, "message": "Plus you have to factor what your time is worth. Even if Heroku is $50 a month, that's less than 2 hours of your time. You WILL spend more than 2 hours a month dealing with devops crap.", "group_id": 4606, "id": 1451105}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308683881.633261, "message": "That's a need for me for sure. An hour is too long.", "group_id": 4606, "id": 1451137}, {"user_id": 2633, "stars": [], "topic_id": 39994, "date_created": 1308684536.364964, "message": "No, you can't config that. You could use the cedar stack and then you can do whatever WRT that stuff.", "group_id": 4606, "id": 1451220}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308686042.590162, "message": "http://www.randomhacks.net/articles/2011/06/03/heroku-celadon-cedar-review that was a pretty good read on the cedar stack. 71 for a process every minute, but if you only need it every 30 (like I do) it works out to roughly $2.40. Interesting", "group_id": 4606, "id": 1451487}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690329.6764519, "message": "I also treat provisioning and setting up a server differently than deploying an application into that environment. That way, the server-side platform might change over time, but my basic deployment /could/ stay the same (some deployment techniques like heroku's are sufficiently different they are still only concerned with deploying an app).\n\nI'm guessing it's no surprise to anyone that I've been using Chef on the server side for a bit now. I'm still learning, but it is a deep hole you can go down if your primary goal is developing web apps. I've also started playing with the opscode platform (hosted chef server) to see what this client/server stuff is about. It is pretty damn cool, but chef-solo (running recipes from a git repository locally on your server) is usually an easier way to get off the ground for single servers.\n\nFor deployment that isn't heroku, I'm still using Capistrano and mostly still love it. Some of the delivered recipes are starting to show their age but it was meant to be a deployment framework where you would customize the parts you wanted changed. It was also one of the first deployment solutions to impose an opionated directory hierarchy and symlink farm. And I like that consistency :)\n\nIf it's just one web application then it's totally worth ruling out some of the PAAS providers like heroku or cloudfoundry first. Often I end up having to cram several web apps or services together for a \"site\" so I often don't have much choice but to host myself (this includes internal work apps which get internal VMs).\n\nIn any case, wicked thread to read through. Will make for fun conversation tonight.", "group_id": 4606, "id": 1452219}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308690818.203542, "message": "hahahahahaa", "group_id": 4606, "id": 1452291}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690347.7304549, "message": "OMG, the same text wrapping happened to me!", "group_id": 4606, "id": 1452223}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690378.2713051, "message": "And I pasted from MacVim, how the heck does convore know that?", "group_id": 4606, "id": 1452228}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690815.3874769, "message": "Yep :)", "group_id": 4606, "id": 1452289}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308690422.7651019, "message": "LOL. I'm not sure how it would know. Notepad doesn't even put any special chars. Maybe it checks if it's a ctrl+v?", "group_id": 4606, "id": 1452235}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690729.9781489, "message": "Yeah, that would be stellar for code, and craptastic for prose", "group_id": 4606, "id": 1452284}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690810.896492, "message": "class Convore\n  def why_u_so_crazy?\n    \"That's the way I roll\"\n  end\nend\n\nconvore = Convore.new\nconvore.why_u_so_crazy?", "group_id": 4606, "id": 1452288}, {"user_id": 21844, "stars": [], "topic_id": 39994, "date_created": 1308690868.2956181, "message": "I need to remember to always keep this window up. More codez", "group_id": 4606, "id": 1452312}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1308757714.844429, "message": "You ended up ultra far away from me @fnichol :( We weren't able to discuss deployment. Nooooo.", "group_id": 4606, "id": 1458056}, {"user_id": 32688, "stars": [], "topic_id": 39994, "date_created": 1308761848.2894089, "message": "If you plan on going down the Chef route for provisioning, https://github.com/ns/chef might be a useful starting point. It includes a simple shell script to prep the server to be Chef Ready (TM). There's definitely a few rough edges, though, so you'll still need to have a good understanding of the Chef Solo workflow.", "group_id": 4606, "id": 1458572}, {"user_id": 14826, "stars": [], "topic_id": 39994, "date_created": 1311720499.603296, "message": "@RyanOnRails How did you make out with building your server?", "group_id": 4606, "id": 1726929}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1312926660.7121899, "message": "Sorry for the late reply mm53bar. We were planning to move off of slicehost so we made the jump over to linode. Linode has some sexy premade stack scripts: http://www.linode.com/stackscripts/ which you can just run while it builds your image. It allowed us to get the \"base\" stack up and going. We use capistrano to deploy to the sever.", "group_id": 4606, "id": 1834957}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1312926874.0885079, "message": "We did have some issues though (out of date ruby versions in the stack script), but overall it got us up and running much faster than if we didn't use the script. The speed increase from slicehost to linode (imho) is much faster (for the same cost!). This was the script we used: http://www.linode.com/stackscripts/view/?StackScriptID=2460 (note the ruby-1.9.2-p0 boourns).", "group_id": 4606, "id": 1835001}, {"user_id": 14826, "stars": [], "topic_id": 39994, "date_created": 1313118177.1546731, "message": "@RyanOnRails Cool...Linode was our gateway drug to automated server builds.  I ended up building a \"lemur\" script - linux, nginx, mysql, unicorn and rails.  Worked really well.  I'll take a look at your script and see if I can suggest anything based on what we did.", "group_id": 4606, "id": 1854009}, {"user_id": 14826, "stars": [], "topic_id": 39994, "date_created": 1313287316.2183831, "message": "@RyanOnRails By the way, you should bug @markbennett to take your StackScript and add it to the yegrb site somehow.  Always worthwhile to share the ability to build a box from scratch.  Since StackScripts are just bash with some extra parameters, they're totally portable for people to build servers outside of linode.", "group_id": 4606, "id": 1866982}, {"user_id": 22052, "stars": [], "topic_id": 39994, "date_created": 1313533749.83482, "message": "Or at the very least I guess I should publish it on the stack site. I'm not sure I made an exact script. I should update that one up there though.", "group_id": 4606, "id": 1887037}, {"user_id": 21842, "stars": [], "topic_id": 39994, "date_created": 1314218259.624016, "message": "As a slight disclaimer the performance increase we saw between slicehost and linode might also be related to the use of nginx on the new server vs. apache on the old server.  I seem to have noticed a noticeable performance improvement on a few other projects doing the same.", "group_id": 4606, "id": 1952564}]