[{"user_id": 3617, "stars": [], "topic_id": 9262, "date_created": 1298741078.4123459, "message": "So who wants to help this awesome project with their bugs to get a first release out the door? Every drupal user will love you for it. http://drupal.org/project/media (Of course I'd help if I could but my PHP is beyond rusty. *heart* Python)", "group_id": 1375, "id": 214972}, {"user_id": 3617, "stars": [], "topic_id": 9262, "date_created": 1298835690.3307531, "message": "@bennash And this is exactly why they need help. It seems pathetic for drupal to have awesome modules, awesome node-based content and yet we can't seem to create an image/file system that's worth aything. :|", "group_id": 1375, "id": 220066}, {"user_id": 3617, "stars": [], "topic_id": 9262, "date_created": 1298836250.435998, "message": "@bennash Great, I'm sure they'd love the help.", "group_id": 1375, "id": 220218}, {"user_id": 3859, "stars": [], "topic_id": 9262, "date_created": 1298834866.556608, "message": "I've been recently upgrading or rebuilding several of my clients simpler D6 sites to D7. I'd love to launch these sites with the Media module, but its requirement on Styles makes it impossible to use. The current implementation of Files Styles, Image Styles, Displays is sooooooo confusing and not yet complete (believe me, I've drush up'd 100 times this week). Makes me miss D6's imagecache simpler approach (which I know I can simply use without Media). The Media module itself is awesome in both function and current implementation, but its required Styles module is crippling.......", "group_id": 1375, "id": 219814}, {"user_id": 3859, "stars": [], "topic_id": 9262, "date_created": 1298836209.430748, "message": "I'll hope to take a harder look at Syyles this week. My php is decent, and I've love to tackle the UI.", "group_id": 1375, "id": 220208}, {"user_id": 3859, "stars": [], "topic_id": 9262, "date_created": 1298836270.6854179, "message": "overall I think the Media module will fill that void in the Drupal ecosystem pretty soon", "group_id": 1375, "id": 220222}, {"user_id": 3617, "stars": [], "topic_id": 9262, "date_created": 1299787828.499135, "message": "Some of the 'major' bugs have been fixed, still a few left to go. I'm now running it on my personal site though and it seems to basically work.", "group_id": 1375, "id": 315927}, {"user_id": 3617, "stars": [], "topic_id": 9262, "date_created": 1302573098.239753, "message": "Shame this still hasn't quite gotten the TLC it needs to really takeoff.", "group_id": 1375, "id": 634445}]