[{"user_id": 11626, "stars": [], "topic_id": 43069, "date_created": 1312161887.372196, "message": "Homeland Security surveillance detected on Christian website\r\nBlogger noted for opposing homosexual lifestyle choice\r\nWND\r\nJuly 30, 2011\r\n\r\nThe U.S. Department of Homeland Security has begun watching a blog posted by a Christian who was forced to flee Brazil because of the conflict between that nation's pro-homosexual \"hate crimes\" agenda and his advocacy for traditional marriage. \r\n\r\nExactly why the U.S. government, which several times has linked Christians and conservatives with terrorism, is watching Julio Severo's unabashedly Christian Last Days Watchman blog isn't clear. \r\n\r\nA WND request to the DHS for comment did not generate a response. \r\n\r\nThe website's records reveal the DHS visited the site yesterday. A different computer, also at the DHS, was on the site again today. \r\n\r\nGet the prescription for reclaiming America's heritage of liberty, justice and morality – Joseph Farah's \"Taking America Back,\" autographed only at the WND Superstore. \r\n\r\nWND reported in 2009, shortly after Obama took office, that a Department of Homeland Security report warned of the possibility of violence by unnamed \"right-wing extremists\" – people concerned about illegal immigration, increasing federal power, restrictions on firearms, abortion and the loss of U.S. sovereignty. The report pointed to returning war veterans as particular threats. \r\n\r\nThe visit yesterday was revealed in a website tracking report: \r\n\r\nThe visit today was documented in another report: \r\n\r\nSevero was profiled earlier on WND when as a prominent pro-family activist in Brazil, he was forced into exile because of the \"hate crimes\" laws in his land. \r\n\r\nSeveral prominent Christian leaders in America at the time warned that similar crackdowns could be coming in the U.S. because of the federal \"hate crimes\" bill signed by Obama shortly after he took office. \r\n\r\nThat law enhances penalties based on the thoughts of the person suspected of committing a crime. \r\n\r\nPastor Rick Scarborough of Vision America Action and Mathew Staver of Liberty Counsel voiced their opposition to the law at the time. While there has not yet been a large-scale crackdown on pastors who preach against homosexuality, there are indicators that such developments could be in the offing. \r\n\r\nObama's lifting of the ban on homosexuals in the military, for example, has raised questions about the status of  military chaplains who teach a biblical perspective of homosexuality. \r\n\r\nAt the time of his exile, Severo told WND that while Brazil does not criminalize Christianity, it regulates what biblical principles can and cannot be preached, and it bans biblical citations that disapprove of the homosexual lifestyle. \r\n\r\n\"Brazil grants freedom to preach Christianity, provided that the sermons avoid negative mentions of state-protected behaviors and cultural trends,\" Severo said at the time. \"The Brazilian government is establishing more and more categories of protected behaviors, banning negative mentions. So Brazilian preachers need to get updated on the latest political changes and preach a Gospel according to the state interests.\" \r\n\r\nHe cited an example of Brazil's restrictions. \r\n\r\n\"In Rio, a Pentecostal minister led a criminal to Jesus and convinced him to deliver himself to police. Rev. Isaías da Silva Andrade accompanied the former criminal to police and when they asked how his life had been changed, the minister answered that the former criminal lived under the influence of demons from Afro-Brazilian religions which inspired him to criminal conduct, but now he found salvation in Jesus. Because of this innocent account, Rev. Andrade is now being prosecuted for discrimination against the Afro-Brazilian 'culture'! If condemned, he will serve between two and five years in jail,\" Severo said. \r\n\r\nSevero said his friends warned him that authorities were trying to find him, and so he took matters into his own hands. \r\n\r\n\"I was forced to leave the country with my family: a wife in the advanced stages of pregnancy and two little children,\" he reported on his blog. \"We are now in a place that is completely foreign to us. What choice did we have?\" \r\n\r\nSevero today told WND through a relatively secure communications method that he remains in an undisclosed location because \"even though I am away from Brazil, the largest gay group is Brazil, ABGLT, is after me, even asking their other gay groups to help them to find me where I am.\" \r\n\r\nHe explained ABGLT, which had filed complaints of \"homophobia\" against him with the Brazilian government, recently was helped by U.S. Secretary of State Hillary Clinton to be accredited in the United Nations, extending its global influence. \r\n\r\nHe said he previously has found visits on his website from the federal police in Brazil. \r\n\r\n\"It is like the FBI in the U.S..,\" he told WND. \r\n\r\nHe said he monitors his websites periodically and then occasionally does a visitor-by-visitor review of who is reading his writings. \r\n\r\n\"A few times that I have examined [them] one by one, I was able to find federal law enforcement agencies as my visitors,\" he said. \r\n\r\nHe said it appears DHS was searching for some combination of \"Christian,\" \"U.S.\" and \"Brazil\" terms. \r\n\r\n\"I think all Christian leaders should be worried at a U.S. agency created in response to Islamic terror is after a Christian leader,\" he told WND. \"Why not Islamic leaders?\" \r\n\r\nHe said on his blog after he found the DHS visits, \"Obviously, LDW has no terrorist or Islamic connection. It is conservative Christian – which is reason enough to be labeled 'terrorist' by leftist and anti-Christian activists. And such is the Obama administration.\" \r\n\r\n\"I do not know how much time they spent in my blog, because this specific data was missing in the official record. Nevertheless, perhaps because of some security failure, relevant information was exposed, especially on where and who was 'visiting' my blog,\" he wrote. \"It seems that the U.S. Department of Homeland Security is searching for a Christian leader (from the United States? from Brazil?), who fled. But, searching for him in my blog?\" \r\n\r\nHe said the purpose of his site is to make English-speaking readers aware of what is happening in Brazil, \"particularly on the persecution on Christians.\" \r\n\r\n\"If they are keeping surveillance on Christian leaders, it’s time for us to watch and pray!\" he said. \r\n\r\nThe U.S. administration has made clear in a number of cases that it is concerned about conservatives as a potential danger and even has argued in court that it wants the authority to track American citizens in order to develop \"probable cause\" needed for search warrants. \r\n\r\nThat argument is being made before the U.S. Supreme Court in a dispute over whether police investigators and other authorities should be allowed to track American citizens who have not done anything that would ordinarily prompted a judge to issue a search warrant. \r\n\r\n\"The court of appeals' decision, which will require law enforcement officers to obtain a warrant before placing a GPS device on a vehicle if the device will be used for a 'prolonged' time period, has created uncertainty surrounding the use of an important law enforcement tool,\" said the government's brief in the case, U.S.A. v. Antoine Jones. \r\n\r\n\"Although in some investigations the government could establish probable cause and obtain a warrant before using a GPS device, federal law enforcement agencies frequently use tracking devices early in investigations, before suspicions have ripened into probable cause. The court of appeals' decision prevents law enforcement officers from using GPS devices in an effort to gather information to establish probable cause.\" \r\n\r\nIn the case, agents put a tracking device on Jones' vehicle, and he later was charged and convicted of drug offenses based on information obtained from the tracking device. His conviction was overturned, however, when an appeals court panel argued the information was obtained without a warrant. \r\n\r\nThe government asked the high court to review whether the warrantless use of a tracking device to monitor the vehicle's movements on public streets violated the Fourth Amendment. \r\n\r\nBut civil rights experts at the law firm of William J. Olson of Vienna, Va., and Gary Kreep of the United States Justice Foundation of Ramona, Calif., are arguing in a friend-of-the-court brief that while the Supreme Court needs to review the case, the goal should be to protect Americans' Bill of Rights-assured protections against unreasonable search and seizure, not expand government's ability to monitor its citizens. \r\n\r\nWhile the Obama administration is asking for a determination about the warrantless use of tracking units, the Supreme Court wants briefs that also address the issue of whether the government violates the Fourth Amendment even by installing such a unit. \r\n\r\nA poll released earlier showed the WND Freedom Index, an assessment of Americans' perspectives about their freedoms, took a plunge in the latest quarter, to 45.9 – its lowest mark in the two years the survey has been conducted. \r\n\r\nAmong the questions used to assemble the ranking – where 50 is a reflection of a neutral perspective about freedoms – was, \"Do you believe that government today is using technology, such as cameras, scanners, electronic health records, to become too intrusive into the private matters of Americans.\" \r\n\r\nSome 75 percent of the respondents said there is a problem. Nearly 38 percent of Americans said they perceive \"great intrusion\" and another 14.5 percent said there is \"substantial intrusion.\" Another 22.8 percent said there is \"some intrusion.\" \r\n\r\nThe federal government's determination that people innocent of crimes are worthy of being watched already is documented. \r\n\r\nThe 2009 DHS report, \"Right-wing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment,\" said \"threats from white supremacist and violent anti-government groups during 2009 have been largely rhetorical and have not indicated plans to carry out violent acts.\" \r\n\r\nBut it said worsening economic woes, potential new legislative restrictions on firearms and \"the return of military veterans facing significant challenges reintegrating into their communities could lead to the potential emergence of terrorist groups or lone wolf extremists capable of carrying out violent attacks.\" \r\n\r\nThe report from the DHS Office of Intelligence and Analysis defined right-wing extremism in the U.S. as \"divided into those groups, movements and adherents that are primarily hate-oriented (based on hatred of particular religious, racial or ethnic groups) and those that are mainly anti-government, rejecting federal authority in favor of state or local authority, or rejecting government authority entirely. It may include groups and individuals that are dedicated to a single issue, such as opposition to abortion or immigration.\" \r\n\r\nIt followed by only weeks a report from the Missouri Information Analysis Center that linked conservative groups to domestic terrorism. \r\n\r\nThe Missouri report warned law enforcement agencies to watch for suspicious individuals who may have bumper stickers for third-party political candidates such as Ron Paul, Bob Barr and Chuck Baldwin. It further warned law enforcement to watch out for individuals with \"radical\" ideologies based on Christian views, such as opposing illegal immigration, abortion and federal taxes.\r\n\r\nhttp://www.wnd.com/?pageId=327769", "group_id": 3920, "id": 1762163}]