[{"user_id": 11626, "stars": [], "topic_id": 7384, "date_created": 1298077174.73681, "message": "http://www.wsws.org/images/2011feb/f18-wisc-stai-300.jpg\r\n\r\nOn Thursday, tens of thousands of workers and students demonstrated in Madison, Wisconsin’s capital city, against a bill that forces pay cuts of 8 to 20 percent on state workers and strips them of fundamental workplace rights.\r\n\r\nThousands of teachers and graduate students walked off the job in what has become, in all but name, a strike wave. Walkouts among high school and college students also multiplied and spread across the state.\r\n\r\nWith both the legislature and governor’s mansion in Republican hands, the bill was expected to pass swiftly through the Senate, the Assembly, and the office of Governor Scott Walker and become law on Thursday. However, the 14-member Democratic Senate caucus did not return for the afternoon session, breaking the three-fifths quorum required to vote. Republicans issued a “call of the House,” setting off a police manhunt for the missing senators. It was later learned that they had fled the state to northern Illinois.\r\n\r\nThe aim of the Democrats’ maneuver is to defuse the mounting opposition in the working class, and make the bill subject to backroom negotiations through which an accommodation can be reached for the union bureaucracies. The senators feared that, had the Republicans speedily passed the bill, an explosion of anger in Madison would have resulted. As one of the senators stated from his hiding place in Illinois, the aim is “to slow this thing down.” Another told a radio station that the senators would return in a “day or two.”\r\n\r\nIn the interim, the Democrats will attempt to work out a rotten deal behind the scenes. Union officials have repeatedly stressed that they are willing to concede massive wage concessions—this is in fact the role unions are playing in Wisconsin and all over the country—so long as they are involved in their implementation. “This is not about protecting our pay and our benefits,” as Wisconsin Education Association Council President Mary Bell told a press conference. “It is about protecting our right to collectively bargain.”\r\n\r\nFor the second day in a row, the public school system in Madison, population 235,000, was entirely shut down due to thousands of teachers calling in sick in order to attend the demonstration. On Thursday most of the public schools in the vicinity of Madison were also closed by mass teacher absenteeism.\r\n\r\nThe school systems in La Crosse and Eau Claire, in the western part of the state, were similarly shut down, as were many small-town school districts. Several large school districts in the Milwaukee area, including Racine, were closed Thursday morning, but the Milwaukee school district remained open after Superintendent Gregory Thornton menaced teachers with “disciplinary action” if they fail to report to work. Still, about 425 Milwaukee teachers called in sick on Thursday.\r\n\r\nThe full extent of the school closures was not clear, but it likely affected tens of thousands of teachers and students. Teachers are prohibited by law from striking in Wisconsin. The “sick-in” movement exposes them to penalties, including being docked for pay.\r\n\r\nThousands of undergraduates and graduate students on Thursday walked out of the University of Wisconsin, Madison, partially shutting down one of the largest universities in the US. At one point, about 2,000 students marched from the campus to the capitol building.\r\n\r\nThere they converged with thousands of protesters already present, and untold thousands more that continued to arrive from throughout the state in hastily-organized convoys of buses, vans, and cars.\r\n\r\nHigh school student walkouts have hit schools in cities and towns across the state over the past two days, including Madison, Green Bay, Appleton, Eau Claire, La Crosse, Onalaska, Holmen, West Salem, Tomah, River Falls, Platteville, Fennimore, Iowa-Grant, Viroqua, Shullsburg and Dodgeville. These walkouts have involved, collectively, thousands of students. They have reportedly been organized via Facebook and other social media.\r\n\r\nIn addition to the walkout at the University of Wisconsin, Madison, hundreds of college students walked out at University of Wisconsin campuses at Eau Claire and Stout.\r\n\r\nAt the University of Wisconsin-Milwaukee, a crowd of well over 1,000 packed a central part of the campus on Thursday. “Everyone from the university was there,” one graduate student, told the World Socialist Web Site. “Undergraduates, graduates, professors, TAs, it was everyone. The entire plaza was full.”\r\n\r\nAt the University of Wisconsin-Superior, hundreds of professors, students, and university staff gathered to protest. “We all know that this is part of a broader assault on the ability of working people in this state and this country to have decent, humane lives,” history professor Joel Sipress told the crowd. “The same people who want to strip public workers of their rights—they’re the same people who want to say to all of us ‘it is a sink-or-swim society.’ We will not allow Wisconsin to become a state where the working people live off the scraps that are thrown to them by the economic elite.”\r\n\r\nThursday marked the fourth straight day of demonstrations at Madison, centered inside and surrounding the state capitol building. In fact the demonstration has been continuous—hundreds of protesters, inspired by the Egyptians who occupied Tahrir Square in Cairo, have camped out in the state House during the week.\r\n\r\nDemonstrations, walkouts, and school closures are expected to continue on Friday.\r\n\r\nhttp://www.wsws.org/articles/2011/feb2011/demo-f18.shtml", "group_id": 3920, "id": 147910}, {"user_id": 13805, "stars": [], "topic_id": 7384, "date_created": 1298094545.498575, "message": "How does this new venu for SCMLA work? Is there text to go with these photos?", "group_id": 3920, "id": 148924}, {"user_id": 11626, "stars": [], "topic_id": 7384, "date_created": 1298096458.5889361, "message": "It's definitely not as sophisticated as Facebook, where you can post photos & embed videos, etc. But it doesn't have the CIA's budget, either...", "group_id": 3920, "id": 148997}, {"user_id": 11626, "stars": [], "topic_id": 7384, "date_created": 1298096611.9586649, "message": "Good to see you, btw. I've been busy working like a dawg trying to get some content up on some of our sites... Whew!", "group_id": 3920, "id": 148998}, {"user_id": 11626, "stars": [], "topic_id": 7384, "date_created": 1298096307.3636999, "message": "The photos always show up below the text, even though I always post the links at the the top.", "group_id": 3920, "id": 148992}, {"user_id": 11626, "stars": [], "topic_id": 7384, "date_created": 1298096346.9126899, "message": "You have to scroll the field up & down to read everything. It's kind of like a chat room in a way.", "group_id": 3920, "id": 148996}]