[{"user_id": 11626, "stars": [], "topic_id": 6681, "date_created": 1297905616.44206, "message": "BAE Systems, Europe's largest defense company, is working on a camouflage system that could put an army of \"invisible\" tanks on the battlefield in the next five years.\r\n\r\nThe system, called e-camouflage, involves sensors mounted to the vehicle's hull that can film and project images of the surrounding landscape on the tank and thus make it invisible, London's The Daily Telegraph wrote Wednesday, citing scientists at BAE Systems.\r\n\r\nThe images would change as the tank moves, ensuring that it can dodge attacks even when moving from a barren into a vegetated environment, for example.\r\n\r\nThe technology was first reported on by the newspapers Daily Telegraph, Sun and Daily Mail in October 2007, when it was being tested by the British Defense Ministry.\r\n\r\n\"This technology is incredible,\" an unnamed soldier who was at the tests at the time was quoted by The Daily Mail. \"If I hadn't been present I wouldn't have believed it. I looked across the fields and just saw grass and trees -- but in reality I was staring down the barrel of a tank gun.\"\r\n\r\nE-camouflage was developed as part of Britain's Future Protected Vehicles program, aimed at equipping and introducing the latest in manned and unmanned military vehicles, The Daily Telegraph said. The program includes unmanned robots, scout vehicles, infantry carriers and attack vehicles. It comes after London last year published its Strategic Defense and Security Review, which proposed significant cuts to military personnel and defense equipment, including armored vehicles.\r\n\r\nRegarding armor -- BAE Systems is also researching a novel form of body protection.\r\n\r\nDubbed liquid armor by officials at BAE Systems, the material hardens when struck by a bullet, thus supporting existing energy absorbing properties of material structures like Kevlar, BAE Systems said in a statement. Especially in hot environments such as Afghanistan, current ceramic-based body armor wear down the soldier because it is relatively heavy. The liquid armor, due to its light weight, offers protection from bullet wounds while leaving the wearer mobile.\r\n\r\n\"The technology is best explained by the example of stirring water with a spoon,\" Stewart Penney, a senior innovation official at BAE Systems, was quoted as saying in a company statement issued last year. \"In water you feel little resistance to the spoon. Whereas with liquid armor, you would feel significant resistance as the elements in the fluid lock together. The faster you stir, the harder it gets, so when a projectile impacts the material at speed, it hardens very quickly and absorbs the impact energy.\"\r\n\r\nhttp://www.spacewar.com/reports/Invisible_tanks_liquid_armor_at_BAE_999.html", "group_id": 3920, "id": 127953}]