[{"user_id": 14970, "stars": [], "topic_id": 15556, "date_created": 1301246328.0549569, "message": "This is a good question, I am looking for a few individuals to join a startup in Toronto - would be good to learn of the mediums to look into.", "group_id": 250, "id": 452090}, {"user_id": 21360, "stars": [], "topic_id": 15556, "date_created": 1301274674.6898141, "message": "Startups are generally not the place to look for work.  To be honest, unless you can; work for peanuts, stay up late and work long hours, and deal with chaos on a daily basis, it is probably not for everyone.  The rewards can be great, but the risk is huge.  Founders generally look for thick skinned individuals through people they know.  It's usually not a  glamorous job.", "group_id": 250, "id": 453931}, {"user_id": 6688, "stars": [], "topic_id": 15556, "date_created": 1301280644.553139, "message": "I've been hired by two startups. The first was after answering an ad in the paper (10 years ago); the second I was headhunted by the owner.", "group_id": 250, "id": 454361}, {"user_id": 224, "stars": [], "topic_id": 15556, "date_created": 1301281224.2965381, "message": "I've worked for four start-ups: first I got hired through a temp agency, second and third was a family connection, fourth was through friends (Six Aaprt)", "group_id": 250, "id": 454408}, {"user_id": 24254, "stars": [], "topic_id": 15556, "date_created": 1301287722.4797101, "message": "My current job is with a high-tech startup that I got through my schools job website.", "group_id": 250, "id": 455132}, {"user_id": 1, "stars": [{"date_created": 1301454839.1044641, "user_id": 14070}], "topic_id": 15556, "date_created": 1301293804.6009281, "message": "I got my last job through open source work", "group_id": 250, "id": 455676}, {"user_id": 2060, "stars": [{"date_created": 1301293794.0260911, "user_id": 1}], "topic_id": 15556, "date_created": 1301293659.3823869, "message": "I've worked at multiple and they always recruited me based upon my previous work in similar areas", "group_id": 250, "id": 455667}, {"user_id": 24575, "stars": [], "topic_id": 15556, "date_created": 1305169480.711762, "message": "some well-connected-into-the-startup-scene person contacted me about an opportunity I could not miss on.", "group_id": 250, "id": 1018296}, {"user_id": 11971, "stars": [], "topic_id": 15556, "date_created": 1305296118.2614651, "message": "I was the first person hired at my current job other than the two founders. I knew one of the founders from a previous job and kept bugging him to hire me. Finally they did! :)", "group_id": 250, "id": 1041833}, {"user_id": 24837, "stars": [], "topic_id": 15556, "date_created": 1305357251.3718939, "message": "I had managed to get a low spot at Microsoft automating text cleanup when a high school friend asked me to lunch to see where I was at -- he really wanted a friend of mine that we both liked, but he wasn't ready to leave campus (It's been 15 years and he is still in there somewhere ....)  I kind if sensed that MS was shifting, lurching towards a different culture, that kind of thing, so I took Ralph's invitation to start working on anything that we could put together to sell.  It was a hell of an experience, with lots of time to play quake, then sleep in our cars for a few hours sleep.  And do on.  Ralph turned out to be an incredible manager, they best I have ever worked with, and we survived the struggles, the near death experience, the knight in shining armor rescue that just finished whatever was left.  Hurt, angry, sharpening our shovels and buying big bags at the feed store.  Normal things like that.   Anyway, at this point in the story, mony is owed, and blame ready to throw about.  Most of us worked it out and went to work with a local  person of high wealth.  Paychecks started clearing, expectations low, and many of the startup's survivers were able to catch up their earlier losses.  We also formed a new bad to make sure we had a time and place to drink and bitch about working on a hobby farm.", "group_id": 250, "id": 1050730}, {"user_id": 24837, "stars": [], "topic_id": 15556, "date_created": 1305357741.2770669, "message": "Cheers", "group_id": 250, "id": 1050744}, {"user_id": 24837, "stars": [], "topic_id": 15556, "date_created": 1305357738.603406, "message": "So.  Hired by a friend who know my character, quirks, and technical short comings.  FOr my money, a good way to go.  People have a clearer idea what the are getting into.  spent a dozen years with the same core group of people that could appear my door with a troubled look and shovel, saying he needs something to, needs help, and I would get my coat on and go.  Startup life can make that happen.  I can also freak people out if the recruiting isn't done carefully.  Anyway, that's my long rambling saw as the light dwindles and I dan't lift my gin and tonic one more time.  As for resumes, I haven't got on offer on a resume since 1995.  Lunches, chats on the ferry, shop talk over beer. . . .  I feel a change coming for really soon.\\", "group_id": 250, "id": 1050743}, {"user_id": 224, "stars": [], "topic_id": 15556, "date_created": 1305410781.101011, "message": "i've worked for four start-ups: first was through a temp agency, second and third through family connection, fourth through friends", "group_id": 250, "id": 1055457}]