[{"user_id": 11626, "stars": [], "topic_id": 43387, "date_created": 1312606433.5376239, "message": "UPDATE: Rawesome Foods raid victims stripped of First Amendment rights with court gag order\nNaturalNews\nAugust 05, 2011\n\nhttp://www.naturalnews.com/gallery/dir/concepts/Zipped-Mouth.jpg\n\nVictoria Bloch was released from jail in LA County last night, but only under the condition that she completely give up her First Amendment rights and refrain from talking to anyone about the case. NaturalNews has confirmed this gag order was placed on Victoria and is also going to be placed on James Stewart and Sharon Palmer as a condition of their release (they are reportedly making bail today and may be home by this evening).\n\nThis gag order is, of course, an effort by the California court system to try to quell the rising tidal wave of public outrage against the armed government raids against a raw dairy farm and private buyer's club -- a raid that many people who witnessed it described, in their own words, as \"government terrorism\" against the People.\n\nFirst, the government attempts to take away their right to engage in commerce and enter private contracts. Then, the government vandalizes this buying club, steals their cash, destroys their entire product inventory and steals the computers from the store. The owners (and conspiring farmers) are arrested at gunpoint and taken to jail without even being read their rights. And finally, to top it off, they are slapped with a gag order which prohibits them having their First Amendment rights so that they might tell their side of the story.\n\nThis is a total assault on freedom by the government.\n\nNaturalNews has learned that under this gag order, these raw milk advocates are prevented from:\n\n• Speaking to any member of the press.\n• Tweeting or blogging about the raid.\n• Posting anything on Facebook or websites.\n• Sending emails about the case.\n• Communicating in any way, verbally or non-verbally about the government raids conducted against them.\n\nJoin the online revolt against government-sponsored terrorism of American farmers\n\nMeanwhile, public outrage is rapidly spreading. A viral Tweet campaign has been launched that has people tweeting #rawesome and #farmageddon across the web (http://www.naturalnews.com/033243_raw_milk_social_media.html ), and a new video has just been posted by Sarah Brown that interviewed several people who witnessed the raid. Watch this video to see government terrorists stealing computers and business files from Rawesome Foods:\n\nhttp://naturalnews.tv/v.asp?v=C3E8939361903F2070B97B579F08F7F5\n\nor see it on YouTube at:\n\nhttp://www.youtube.com/watch?v=XzlrSCqTBBE\n\n\nhttp://www.naturalnews.com/033244_Rawesome_Foods_gag_order.html", "group_id": 3920, "id": 1808233}]