[{"user_id": 30287, "stars": [], "topic_id": 34878, "date_created": 1305167453.769897, "message": "Here's another dynamic pair with very cryptic definitions. Any simplification from you very helpful experts?  :)", "group_id": 2515, "id": 1017914}, {"user_id": 7645, "stars": [], "topic_id": 34878, "date_created": 1305169157.4496951, "message": "Production as a problem usually shows up when someone makes a big deal out of something, like the kind of person who makes a big production, etc.", "group_id": 2515, "id": 1018238}, {"user_id": 7664, "stars": [], "topic_id": 34878, "date_created": 1305171099.0639019, "message": "Reduction, I think, is making a molehill out of a mountain.", "group_id": 2515, "id": 1018872}, {"user_id": 7645, "stars": [], "topic_id": 34878, "date_created": 1305178625.6699691, "message": "Hah! That's great. Check out my review of Up in the Air, it has production and reduction in there ( reduction objectively with layoffs, reducing the work force, personally he has the issue of reducing your life to the bare essentials, empty out your backpack) http://storyfanatic.com/articles/story-analysis/up-in-the-air", "group_id": 2515, "id": 1020454}, {"user_id": 30287, "stars": [], "topic_id": 34878, "date_created": 1305198996.6995909, "message": "Those are all great, clear, workable definitions.  But I'm not seeing how the definitions in the book/software relate to them at all.  Reduction, for example, is defined as \"A method of thought that determines probability\".  It then gets even more cryptic when it tries to clarify with \"a process of thought that compares the likelihood of several incomplete lines of deduction\".  How does that relate to making molehills out of mountains, or to reducing a workforce?", "group_id": 2515, "id": 1023756}, {"user_id": 7645, "stars": [], "topic_id": 34878, "date_created": 1305206334.9956319, "message": "I always thought this was a great explanation: http://www.dramatica.com/theory/tip_of_month/tips/tip1107.html", "group_id": 2515, "id": 1024456}, {"user_id": 30287, "stars": [], "topic_id": 34878, "date_created": 1305208018.5328419, "message": "Yes, that's a little clearer. Thanks for that! But... going the other way now, is that the kind of \"reduction\" you see as the problem in \"Up in the Air\"?", "group_id": 2515, "id": 1024611}, {"user_id": 7664, "stars": [], "topic_id": 34878, "date_created": 1305217010.134099, "message": "I think of these, rightly or wrongly, as various kinds of educated guesses. I also hate seeing them in my storyform.", "group_id": 2515, "id": 1025971}, {"user_id": 7645, "stars": [], "topic_id": 34878, "date_created": 1305218141.424325, "message": "In all likelihood the economy will continue to decline as will our profit margin, so let's make cuts. In all likelihood the connections you have with others will weigh you down and create even more problems for you, so toss them out.", "group_id": 2515, "id": 1026173}, {"user_id": 30287, "stars": [], "topic_id": 34878, "date_created": 1305220530.9500301, "message": "So the \"reduction\" in that story is not the literal downsizing of companies, but the reduction in the probability of an issue occurring?  That fits the definition well enough that it's clarifying for me.  I will mull yet again...", "group_id": 2515, "id": 1026508}]