[{"user_id": 11626, "stars": [], "topic_id": 43134, "date_created": 1312262483.1665721, "message": "2011 The Church at Kaweah Training Schedule (see below for more details)\r\n\r\n\r\nAugust 21\r\nCERT: Community Evacuations\r\n\r\nSeptember 18\r\nCERT: Animal Evacuation & Care\r\n\r\nOctober 1 - 2\r\n16th Annual Old Paths Conference\r\n\r\nNovember 12 - 13\r\nChristian Man Camp (for Fathers & Sons)\r\n\r\nNovember 20\r\nCERT: Rescuer Response to a Terrorist Incident\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nCERT/Emergency Response Famlies Training at The church at Kaweah\r\n\r\nEvery 3rd Sunday of the month we offer free CERT training from a certified and experienced trainer\r\n\r\nWhat is CERT?\r\n\r\nFollowing a major disaster, first responders who provide fire and medical services will not be able to meet the demand for these services. Factors as number of victims, communication failures, and road blockages will prevent people from accessing emergency services they have come to expect at a moment's notice through 911. People will have to rely on each other for help in order to meet their immediate life saving and life sustaining needs.\r\n\r\nOne also expects that under these kinds of conditions, family members, fellow employees, and neighbors will spontaneously try to help each other. This was the case following the Mexico City earthquake where untrained, spontaneous volunteers saved 800 people. However, 100 people lost their lives while attempting to save others. This is a high price to pay and is preventable through training.\r\n\r\nIf we can predict that emergency services will not meet immediate needs following a major disaster, especially if there is no warning as in an earthquake, and people will spontaneously volunteer, what can government do to prepare citizens for this eventuality?\r\n\r\nFirst, present citizens the facts about what to expect following a major disaster in terms of immediate services. Second, give the message about their responsibility for mitigation and preparedness. Third, train them in needed life saving skills with emphasis on decision making skills, rescuer safety, and doing the greatest good for the greatest number. Fourth, organize teams so that they are an extension of first responder services offering immediate help to victims until professional services arrive.Since our ambulance was taken away it takes roughly 40 minutes for professional help to come.So CERT training is a must.\r\n\r\n\r\n\r\n\r\n\r\n2011 CERT Training Schedule:\r\n\r\nAugust 21\r\nCommunity Evacuations\r\n\r\nSeptember 18\r\nAnimal Evacuation and Care\r\n\r\nOctober\r\nPending\r\n\r\nNovember 20\r\nRescuer Response to a Terrorist Incident\r\n\r\nDecember\r\nNo Class.Merry Christmas\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nChristian Man Camp (for Fathers & Sons)\r\n\r\n\r\nNovember 12 - 13 (7:30 a.m. Saturday - 3:00 p.m. Sunday)\r\n\r\n\r\nArrive early Friday for fellowship & additional training!\r\n\r\n\r\nParticipants must be ready to fellowship, camp, hike, train with weapons & learn a few lost skills of Christian manhood. (This is not a walk in the park; you MUST dress for the outdoors.)\r\n\r\n\r\nCourse of instruction:\r\n\r\n\r\nBasic Pistol, Basic Rifle & Basic Shotgun use on the range with heavy focus on safety & choice of weapons for family defense. We will also introduce you to tactical combat shooting with airsoft training rifles. Survival Camping & Land Navigation. Night Time Camp Security & escape & evasion tactics in a hostile environment.\r\n\r\n\r\nCost: $100 (for Father & son(s) mailed in advance to secure your space; class size limited)\r\n\r\n\r\nRSVP (required): 559 346 8362, or dutch at dutchjoens dot info\r\n\r\n\r\nMinimum equipment required:\r\n\r\n\r\nFood for the weekend, a good ground cover poncho, compass, flashlight, canteen, water purification tablets, weapons & ammo if you have them & most of all a desire to learn & fellowship with other Christian men. We will be PRIMITIVE camping so do not pack the RV.\r\n\r\n\r\nYou will learn from military veterans & survivalists who have applied these skills in real world & some times deadly situations. Former Marine Steve Klein spoke at the TCAK 15th Annual Old Paths Conference & will be leading the classes this weekend with the help of assistant instructors from TCAK.\r\n\r\n\r\nContact Information:\r\n\r\nThe Church at Kaweah\r\nPost Office Box 75\r\n44069 North Fork Drive\r\nKaweah, California 93237\r\nPhone/FAX: 559-561-4860\r\nE-mail: lausdeo at cwo dot com", "group_id": 3920, "id": 1772781}]