[{"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312055033.1276231, "message": "Maybe it needs an exorcism...", "group_id": 2515, "id": 1755625}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312055247.571403, "message": "Jeez, this is possessed.  My comments finally posted 5 minutes later while I was retyping them.  I hope my laptop doesn't start shaking violently.  The power of Apple compels you!  The power of Apple compels you!  \n\nThere, I think that did the trick... Damn that Bill Gates.", "group_id": 2515, "id": 1755650}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312055098.7291911, "message": "I started watching this last night for the first time in a long time and felt like I had a whole new appreciation for it.  \n\nI noted, however, that on the Dramatica site, there are TWO different interpretations posted under storyforms, one with Chris MacNeil as the MC and the other with Father Damien Karras as the MC.  \n\nJust thought I'd see what the general consensus was here of who the MC was.  Since seeing it last, I'm more inclined to go with Father Damien Karras (though I need to finish watching it tonight).", "group_id": 2515, "id": 1755646}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312055017.8016601, "message": "Ok, convore is irking me...", "group_id": 2515, "id": 1755623}, {"user_id": 7664, "stars": [], "topic_id": 43014, "date_created": 1312056025.757627, "message": "FWIW, I disagree with both interpretations on the site. But I do think that who the MC is is right there in the title.", "group_id": 2515, "id": 1755702}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312056836.130408, "message": "Yeah, one would think considering it's the title, lol.  I'll finish watching it later tonight but I thought it was interesting that there were two storyforms posted, neither of which contained Father Merrin (though he's absent the bulk/middle of the film).  Hmmm...", "group_id": 2515, "id": 1755759}, {"user_id": 7664, "stars": [], "topic_id": 43014, "date_created": 1312064281.381753, "message": "Is he more present in the book?", "group_id": 2515, "id": 1756168}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312069124.282557, "message": "I never read the book.  I finished watching it a bit ago and, without really running it all through my head, I'd say Father Damien Karras is the MC.  He's the one who seems to have the problem (disbelief) to resolve, and Regan's possession is the means by which his loss, and eventual restoration, of faith occurs.  \n\nFather Merrin actually dies before the exorcism is complete and it's Damien who ultimately provides the resolution to the possession by becoming possessed himself.  It's tricky though because it's hard to tell if he threw himself out the window or was thrown out.", "group_id": 2515, "id": 1756501}, {"user_id": 7664, "stars": [], "topic_id": 43014, "date_created": 1312140398.1461439, "message": "My post didn't post either!", "group_id": 2515, "id": 1760047}, {"user_id": 7664, "stars": [], "topic_id": 43014, "date_created": 1312140453.0030689, "message": "I think it's Father Merrin who is the IC and his steadfastness is what allows Karras to change and regain his faith.", "group_id": 2515, "id": 1760060}, {"user_id": 33839, "stars": [], "topic_id": 43014, "date_created": 1312146533.683264, "message": "Yes, I agree, but also think the demon itself played a role in Karras changing.  His approach was purely psychological at first, having lost faith... but he ultimately became convinced it was a possession, or at least enough so, to bring in Merrin.  It's sort of like the philosophy that light can't exist unless there's darkness as well.", "group_id": 2515, "id": 1760548}]