[{"user_id": 11626, "stars": [], "topic_id": 9014, "date_created": 1298623224.727288, "message": "As part of Operation Fallen Hero-Operation Bombardier, Houston-area federal, state, and local law enforcement officials have joined forces in a series of coordinated strikes against Mexican drug cartels and their associates who operate across the United States. Operations in Central America, Colombia, and Brazil are also ongoing. Law enforcement counterparts have mobilized to increase pressure on these organizations at every level.\r\n\r\nThis series of operations illustrate the continued resolve and commitment to attack these brutal Mexican cartels and trafficking associates with a unified front. These efforts have proven successful as illustrated by seizures today in the Houston area of approximately $750,000 in U.S. currency, 322 pounds of marijuana, 13 kilograms of cocaine, 37 weapons, 10 vehicles, and the arrest of 33 individuals.\r\n\r\n“The valiant efforts of our combined law enforcement resources came to bear this morning not by accident, but by necessity. The DEA, and all of our law enforcement partners, will continue to aggressively disrupt and dismantle the ruthless drug trafficking organizations and their partners in crime who are operating on both sides of the Texas/Mexico border,” said Thomas Hinojosa, Acting Special Agent in Charge of the Houston Division, Drug Enforcement Administration.\r\n\r\nRecent tragedies reiterate the need for all of law enforcement to address the violent drug cartels in Mexico, their associates in the United States, and other criminal elements we face. As we move forward with a unified effort against the Mexican cartels, we do so with our law enforcement and international partners beside us. Challenging the status quo and holding the traffickers accountable has been a hallmark of President Calderon’s government. Our counterparts on the front line in Mexico have shared in these tragic sacrifices losing many dedicated officers in this fight.\r\n\r\nFederal, state, and local law enforcement throughout the Houston area are attacking these criminal organizations at every level, while also coordinating with our foreign counterparts to fully disrupt and dismantle the Mexican cartels and their domestic networks throughout the United States.\r\n\r\nThe recent murders of ICE Special Agent Jaime Zapata, in Mexico, and the wounding of ICE Special Agent Victor Avila, as well as the shooting of an HPD officer this morning, are graphic reminders of the violent nature of these criminal organizations.\r\n\r\n“This coordinated effort shows that ICE Special Agent Jaime Zapata will not be forgotten. While the murder is personal to ICE, we are arresting transnational gang members and drug traffickers who have links to Mexican cartels because of their criminal activity and not simply out of retaliation,” said Robert Rutt, Special Agent in charge of ICE-Homeland Security Investigations in Houston. “The priority here is fighting transnational gang violence and drug trafficking in the U.S. by Mexican led cartels who profit through violence and fear.”\r\n\r\n“On a daily basis, throughout the United States and around the world, the U.S. Marshals Service works with our federal, state, and local law enforcement colleagues to track down violent offenders. This operation is a glowing example of the success that can be achieved when all agencies stand together to combat those who deal in drugs, weapons and violence. Our thoughts and prayers go to the families of fallen law enforcement officers who have made the supreme sacrifice in this ongoing battle,” stated U.S. Marshal Elizabeth Saenz\r\n\r\nParticipating in these joint operations were: ATF, ICE-HSI, DEA, FBI, IRS, U.S Marshals Service, United States Attorney’s Office, Texas Department of Public Safety, Houston PD, Harris County SO, Pasadena PD, LaPorte PD, Ft. Bend SO, Montgomery County SO, Galveston City PD, Galveston County SO, Rosenburg PD, Texas National Guard, Brazoria County SO, League City PD, Freeport PD, Lake Jackson PD, TDCJ-OIG, Harris County Constables Jefferson County SO, and the Harris and Ft. Bend District Attorney’s Office.\r\n\r\nhttp://houston.fbi.gov/pressrel/pressrel11/ho022411.htm", "group_id": 3920, "id": 206604}]