[{"user_id": 11626, "stars": [], "topic_id": 6336, "date_created": 1297851171.5706389, "message": "WASHINGTON — The Obama administration's Justice Department has asserted that the FBI can obtain telephone records of international calls made from the U.S. without any formal legal process or court oversight, according to a document obtained by McClatchy.\r\n\r\nThat assertion was revealed — perhaps inadvertently — by the department in its response to a McClatchy request for a copy of a secret Justice Department memo.\r\n\r\nCritics say the legal position is flawed and creates a potential loophole that could lead to a repeat of FBI abuses that were supposed to have been stopped in 2006.\r\n\r\nThe controversy over the telephone records is a legacy of the Bush administration's war on terror. Critics say the Obama administration appears to be continuing many of the most controversial tactics of that strategy, including the assertion of sweeping executive powers.\r\n\r\nFor years after the Sept. 11 attacks, the FBI sought and obtained thousands of telephone records for international calls in an attempt to thwart potential terrorists.\r\n\r\nThe bureau devised an informal system of requesting the records from three telecommunications firms to create what one agent called a \"phone database on steroids\" that included names, addresses, length of service and billing information.\r\n\r\nA federal watchdog later said a \"casual\" environment developed in which FBI agents and employees of the telecom companies treated Americans' telephone records so cavalierly that one senior FBI counter-terrorism official said getting access to them was as easy as \"having an ATM in your living room.\"\r\n\r\nIn January 2010, McClatchy asked for a copy of the Office of Legal Counsel memo under open records laws after a reference to it appeared in a heavily excised section of a report on how the FBI abused its powers when seeking telephone records.\r\n\r\nIn the report, the Justice Department's inspector general said \"the OLC agreed with the FBI that under certain circumstances (word or words redacted) allows the FBI to ask for and obtain these records on a voluntary basis from the providers, without legal process or a qualifying emergency.\"\r\n\r\nIn its cover letter to McClatchy, however, the OLC disclosed more detail about its legal position, specifying a section of a 1978 federal wiretapping law that the Justice Department believes gives the FBI the authority. That section of the law appears to be what was redacted from the inspector general's report and reveals the type of records the FBI would be seeking, experts said.\r\n\r\n\"This is the answer to a mystery that has puzzled us for more than a year now,\" said Kevin Bankston, a senior staff attorney and expert on electronic surveillance and national security laws for the nonprofit Electronic Frontier Foundation.\r\n\r\n\"Now, 30 years later, the FBI has looked at this provision again and decided that it is an enormous loophole that allows them to ask for, and the phone companies to hand over, records related to international or foreign communications,\" he said. \"Apparently, they've decided that this provision means that your international communications are a privacy-free zone and that they can get records of those communications without any legal process.\"\r\n\r\nThat interpretation could be stretched to apply to e-mails as well, he said.\r\n\r\nHowever, Bankston said, even if the law allows the FBI to ask for the records — an assertion he disagrees with — it would prohibit the telecommunication companies from handing them over.\r\n\r\nMeanwhile, the refusal to provide to McClatchy a copy of the memo is noteworthy because the Obama administration — in particular the OLC — has sought to portray itself as more open than the Bush administration. The decision not to release the memo means the details of the Justice Department's legal arguments in support of the FBI's controversial and discredited efforts to obtain telephone records will be kept from the public.\r\n\r\nThe FBI and Justice Department have refused to comment on the matter.\r\n\r\nFor years, the Bush administration had refused to release the memos that provided the legal underpinning for harsh interrogations of overseas terror suspects, citing national security, attorney-client privilege and the need to protect the government's deliberative process.\r\n\r\nIn April 2009, the Obama administration released four of the Bush-era memos that detailed many of the controversial interrogation methods secretly authorized by the Bush administration — from waterboarding to confining prisoners in boxes with insects.\r\n\r\nExperts that track government spying and the Freedom of Information Act said the refusal to release the FBI memo to McClatchy appears to be improper and contrary to the intent of FOIA.\r\n\r\nSince the memo appears to be exclusively on the OLC's legal justification for getting the phone records, the Justice Department should be able to release at least portions of it, experts said.\r\n\r\n\"It's wrong that they're withholding a legal rationale that has to do with the authorities of the FBI to collect information that affects the rights of American citizens here and abroad,\" said Michael German, a former FBI agent of 16 years who now works for the American Civil Liberties Union. \"The law should never be secret. We should all understand what rules we're operating under and particularly when it comes to an agency that has a long history of abuse in its collection activities.\"\r\n\r\nSens. Richard Durbin, D-Ill., and Ron Wyden, D-Ore., demanded more than a year ago that Attorney General Eric Holder release a copy of the memo.\r\n\r\nThe Justice Department has responded, Wyden said this week, but he declined to elaborate on the exchange.\r\n\r\n\"I do think the level of secrecy that surrounds the executive branch's interpretation of important surveillance law is a serious problem,\" he told McClatchy, \"and I am continuing to press the executive branch to disclose more information to the public about what their government thinks the law means.\"\r\n\r\nWhen President Barack Obama authorized the release of the interrogation memos, he said at the time that he was compelled to release them in part because of an open records lawsuit by the ACLU.\r\n\r\n\"While I believe strongly in transparency and accountability, I also believe that in a dangerous world, the United States must sometimes carry out intelligence operations and protect information that is classified for purposes of national security,\" he said.\r\n\r\nObama said he'd concluded the documents could be released because they wouldn't jeopardize national security and because the interrogation techniques described in the memos had been widely reported. By then, the practices were no longer in use.\r\n\r\nThe FBI's activities discussed in the most recent and still secret OLC memo also have been widely publicized. An inspector general report that revealed the existence of the FBI memo was one in a series on the FBI's informal handling of telephone records and it concluded the bureau had committed egregious violations of the law.\r\n\r\nWhen revealing the existence of the OLC memo, the inspector general described it as having \"significant policy implications that need to be considered by the FBI, the Department, and the Congress.\"\r\n\r\nSince 2006, it appears the bureau has refrained from using the authority it continues to assert, according to another heavily redacted section of the inspector general's report.\r\n\r\n\"However, that could change, and we believe appropriate controls on such authority should be considered now, in light of the FBI's past practices and the OLC opinion,\" the inspector general warned.\r\n\r\nhttp://www.mcclatchydc.com/2011/02/11/108562/obama-assertion-fbi-can-get-phone.html", "group_id": 3920, "id": 118706}]