[{"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1319128324.4493849, "message": "saben de algun proyecto similar?", "group_id": 965, "id": 2392866}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1319128214.4185131, "message": "se me ocurre que podria usarse conectividad con las distintas entidades bancarias por medio de SPEI, estoy en la fase de investigacion para despues plasmarlo en un plan de negocio", "group_id": 965, "id": 2392857}, {"user_id": 2946, "stars": [], "topic_id": 46860, "date_created": 1319141502.387234, "message": "Me parece extremadamente necesario, pero indescriptiblemente complicado. Aun reduciendo el scope sólo a México, la barrera de entrada es altísima y los riesgos espeluznantes. \n\nSería enormemente felíz si alguien lograra hacerlo, pero yo no me metería a esa bronca en un millón de años.\n\n(Perdón por tanta hipérbole)", "group_id": 965, "id": 2394632}, {"user_id": 26084, "stars": [{"date_created": 1319178056.1417921, "user_id": 10406}, {"date_created": 1320459110.998147, "user_id": 34786}], "topic_id": 46860, "date_created": 1319166885.260989, "message": "@Cybertron estaria bueno que lo lograrás, hace mucha falta.", "group_id": 965, "id": 2397599}, {"user_id": 41528, "stars": [], "topic_id": 46860, "date_created": 1319210583.0374739, "message": "Creo que DineroMail su base esta en latinoamerica", "group_id": 965, "id": 2400923}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1319210121.947295, "message": "cuales creen que serian los riesgos implicados?", "group_id": 965, "id": 2400891}, {"user_id": 42144, "stars": [], "topic_id": 46860, "date_created": 1319214282.4178619, "message": "Correcto, ya está DineroMail que tienen el killer feature para Mexico: poder pagar en Oxxo.", "group_id": 965, "id": 2401353}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1319219829.3659849, "message": "he leido muchas experiencias negativas acerca de dineromail (no me dejo llevar x esos comentarios), ustedes saben de algun cliente satisfecho?", "group_id": 965, "id": 2401836}, {"user_id": 2946, "stars": [], "topic_id": 46860, "date_created": 1319263723.6012671, "message": "Deben de haber millones de clientes satisfechos, pero siempre la minoria inconforme es la que habla. Te recomiendo , por otra parte,  leer Founders at Work. En este libro el fundador de paypal detalla todos los obstaculos com que se encontraron, incluyendo lidiar con fraudes. Tambien tienen una entrevista en Mixergy. Y ojalá que te animes. :)", "group_id": 965, "id": 2405545}, {"user_id": 10406, "stars": [], "topic_id": 46860, "date_created": 1319268908.69537, "message": "Riesgos: obtener un socio bancario solido, aceptación del mercado, soportar los gastos iniciales mientras generas tracción y creo que el mas serio puede ser alcanzar masa critica, pero aun asi lo mas importante sera la network inicial para el proyecto. Sin duda seria un gran avance para el comercio electronico en Latam!", "group_id": 965, "id": 2405859}, {"user_id": 22259, "stars": [{"date_created": 1319515026.7201469, "user_id": 2946}, {"date_created": 1319524196.9156671, "user_id": 10406}, {"date_created": 1319558522.5691061, "user_id": 39911}], "topic_id": 46860, "date_created": 1319475793.288852, "message": "Definitivamente una idea con muchos riesgos, pero también con grandes retornos. Como comentan @soska y @fservin, la barrera de entrada es altísima ($) pero una idea así bien planteada podría ser bastante atractiva para inversionistas, o puedes meter el proyecto a PROSOFT o PROINNOVA y obtener tu funding de ahí sin que te pidan equity.", "group_id": 965, "id": 2421747}, {"user_id": 22259, "stars": [], "topic_id": 46860, "date_created": 1319480005.6775351, "message": "Aquí hay un startup que no tiene nada que ver con Paypal, pero si leen el blog puedes ver como tambien sufrieron con problemáticas similares y como las subsanaron https://banksimple.com/", "group_id": 965, "id": 2422341}, {"user_id": 43011, "stars": [], "topic_id": 46860, "date_created": 1320196534.109669, "message": "Existe también acá en México paycomer.com pero es nueva no se como les haya ido todavía.", "group_id": 965, "id": 2488279}, {"user_id": 43017, "stars": [], "topic_id": 46860, "date_created": 1320202443.4426639, "message": "Existe ya wew.pagofacil.net y vienen muy fuerte", "group_id": 965, "id": 2489012}, {"user_id": 43011, "stars": [], "topic_id": 46860, "date_created": 1320214626.0362861, "message": "Pago fácil Una cuota inicial de $2,ooo MXN y posteriormente cobramos es el 5% de la transacción, es decir, sólo cobramos cuando TU cobras.", "group_id": 965, "id": 2490210}, {"user_id": 43011, "stars": [], "topic_id": 46860, "date_created": 1320214663.716841, "message": "5% de cada transacción? ufa!", "group_id": 965, "id": 2490214}, {"user_id": 40054, "stars": [], "topic_id": 46860, "date_created": 1321836617.5759981, "message": "Con las recientes reformas para la apertura de cuentas bancarias tipo express o simplificadas, ademas de la puesta en marcha de la banca movil por BBVA Bancomer para pagos via SMS, yo creo que Paypal, tarjetas de credito y otros sistemas de pago tienen sus dias contados en Mexico, estas nuevas opciones solo cobran $1.00 por transaccion para el que paga y gratis para el que recibe el pago importar el monto, todavia mucho mas barato que  Dwolla.com un startup que funciona similar en EUA.", "group_id": 965, "id": 2610071}, {"user_id": 10406, "stars": [], "topic_id": 46860, "date_created": 1321864179.8716991, "message": "@bajaloreto Como funciona esta opcion que planteas o que empresa la propone?", "group_id": 965, "id": 2611747}, {"user_id": 40054, "stars": [], "topic_id": 46860, "date_created": 1321869428.0124741, "message": "Por medio de un teléfono celular vinculado a una cuenta bancaria y mensajes SMS puedes realizar consultas, transferencias y pagos por un máximo de 6 mil pesos tanto Banamex como Bancomer ya lo tie", "group_id": 965, "id": 2611917}, {"user_id": 40054, "stars": [], "topic_id": 46860, "date_created": 1321870044.009531, "message": "http://www.cnnexpansion.com/mi-dinero/2010/01/18/bbva-bancomer-laza-su-banca-movil", "group_id": 965, "id": 2611934}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1321891911.59498, "message": "Si bien es cierto q existen esos sistemas desde hace un par de años, tmb se añade otro eslabón a la cadena q es la disponibilidad de la red gsm y ni hablar de lo facil q es interceptar su señal, dicho lo anterior opino es mejor usar un solo canal de comunicación (internet)", "group_id": 965, "id": 2613310}, {"user_id": 10406, "stars": [], "topic_id": 46860, "date_created": 1321943656.421675, "message": "Nipper!!?? me siento chamaqueado... gracias por la info", "group_id": 965, "id": 2617249}, {"user_id": 2946, "stars": [], "topic_id": 46860, "date_created": 1322162640.7667389, "message": "@bajaloreto Pero dudo que ese sistema vaya a traer un API que cualquier pelagato (sin ofender a la respetable audiencia de este honorable Convore) pueda usar.", "group_id": 965, "id": 2631924}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1322176841.7351389, "message": "@soska @bajaloreto eh visto esos codigos y no son cosa del otro mundo.", "group_id": 965, "id": 2633453}, {"user_id": 40054, "stars": [{"date_created": 1322425151.7580731, "user_id": 10406}], "topic_id": 46860, "date_created": 1322371385.8820109, "message": "@Cybertron yo creo  que @soska se refiere a la siempre vision cerrada del corporativismo mexicano, y no tanto a la capacidad de comprender el API < y si, tal parece que ni siquiera pensaron en un API disponible, Bancomer y Banamex han tomado la delantera pero proponen soluciones sin valor agregado. Creo que podria haber una ventana a la posibilidad de obtener un API, ya que este nuevo sistema segun entiendo fue impuesto por el Banco de Mexico, una entidad del gobierno Federal, habria pues que buscar los canales adecuados para", "group_id": 965, "id": 2649555}, {"user_id": 40054, "stars": [], "topic_id": 46860, "date_created": 1322371458.342638, "message": ".....solicitar se desarrolle un API para este nuevo sistema de pagos", "group_id": 965, "id": 2649566}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1322500884.254925, "message": "Yo me referia a comunicación telcel y entidad receptora,  de acuerdo con buscar el API", "group_id": 965, "id": 2659519}, {"user_id": 19720, "stars": [], "topic_id": 46860, "date_created": 1322505875.426928, "message": "@bajaloreto cuál crees que sería el canal adecuado para que se desarrollara un API para estos sistemas? Ir con los diputados que pasaron la ley con una propuesta firmada? buscar conectes en el Banco de México para que esto pasara?", "group_id": 965, "id": 2659942}, {"user_id": 26088, "stars": [{"date_created": 1322642535.9257541, "user_id": 10406}], "topic_id": 46860, "date_created": 1322600603.108568, "message": "Y si alguien lo hace manual, un api que practicamente envie un registro solamente o algo y tener monkeys que hagan eso que debería hacer el api :) es decir \"simular\" algo que genere presión para que la banca se mueva? un MVP al extremo, es muy mala idea? o simplemente no es viable? siempre he tenido la curiosidad. Es tipo lo que se hace con las recargas desde celular, vas a un lugar te hacen la recarga de tiempo aire usando su cel con un servicio de telcel (si es asi?), q tal no existiera eso, habria recargas de cel a cel por 2 pesos más tal vez y lo adoptarían los carriers si se hace popular (chance)", "group_id": 965, "id": 2667078}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1323360167.8938799, "message": "Aun teniendo el api la inversión inicial para este proyecto sería elevada", "group_id": 965, "id": 2723512}, {"user_id": 29866, "stars": [], "topic_id": 46860, "date_created": 1323465976.0574989, "message": "¿Alguno de los que esta aquí se la esta pensando en serio en hacer algo de este tipo? o alguno ha comenzado ya en trabajar en ello?", "group_id": 965, "id": 2731470}, {"user_id": 29866, "stars": [], "topic_id": 46860, "date_created": 1323466113.130686, "message": "@ruycer si hay que presentarlo a los diputados, entonces solo hay que ver que gobiernos lo están haciendo, que tengan la ley lista, después copiarlo, enviarlo a nuestros diputados y ellos hacen el \"paste\" de la ley y listo! Así de fácil puede hacerse, muchas de las leyes que tenemos siguen ese proceso \"copy&paste\" es como cuando iban a la escuela y les pedían la investigación, \"Copy and paste Encarta\"...", "group_id": 965, "id": 2731486}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1323878285.7208829, "message": "@josuegio yo no descarto la idea de llevarlo a cabo tengo background  similar, aunque no he comenzado a desarrollar ni he visto nada del api necesario", "group_id": 965, "id": 2742358}, {"user_id": 39911, "stars": [], "topic_id": 46860, "date_created": 1323879244.5023489, "message": "Se necesita un ninja team desde el comienzo para q este proyecto tenga exito, que esten dispuestos a afrontar los enormes retos que supondra, alguno por aqui?", "group_id": 965, "id": 2742370}]