[{"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301310681.198988, "message": "I know that early on (and probably ongoing) is that there are some SVN bindings to make it possible to use Git in an SVN shop (git-svn)", "group_id": 591, "id": 456958}, {"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301310844.856693, "message": "For all I know, hg-git does this, but looking at the README(http://hg-git.github.com/) it looks like it's mainly for Mercurial users to interact with Git repos, not the other way around.", "group_id": 591, "id": 456966}, {"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301310738.754349, "message": "I am faced with a similar situation at work.  Mercurial and Git are very close in functionality, but they're different enough that I spend way too much time stumbling around HG's command set using Git commands, and vice-versa for Git with HG's", "group_id": 591, "id": 456959}, {"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301310778.8012819, "message": "Is there a way to use Git to manage HG projects?", "group_id": 591, "id": 456961}, {"user_id": 719, "stars": [], "topic_id": 15763, "date_created": 1301312148.313405, "message": "git-hg? https://github.com/offbytwo/git-hg", "group_id": 591, "id": 457062}, {"user_id": 8391, "stars": [], "topic_id": 15763, "date_created": 1301315267.690872, "message": "Definitely not the most elegant system, but it does work. It's how I contribute to projects on bitbucket.", "group_id": 591, "id": 457405}, {"user_id": 8391, "stars": [], "topic_id": 15763, "date_created": 1301315227.9438169, "message": "@klauern I agree, however you can actually use hg-git to achieve this. When using it from an hb library (try pushing to a git repo or something), hg-git gets activated, and your repo will have a `git` subfolder in it, which is a naked repo. You can clone that and interface with hg via git that way.", "group_id": 591, "id": 457402}, {"user_id": 8391, "stars": [], "topic_id": 15763, "date_created": 1301315280.38007, "message": "(that gives me a good idea for a project that utilizes it actually...)", "group_id": 591, "id": 457408}, {"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301394783.2444739, "message": "I'll have to take a look at git-hg to see if it works for what I'm doing.  I can't expect my needs to be too complicated, but it looks alpha for push support, which seems pretty basic.", "group_id": 591, "id": 468499}, {"user_id": 4221, "stars": [], "topic_id": 15763, "date_created": 1301394891.185503, "message": "@kennethreitz can you explain a bit more what your workflow looks like?  I'm having a hard time trying to figure out the steps to reproduce your workflow.  If I had a .hg repo somewhere on disk, what would I need to do", "group_id": 591, "id": 468507}]