[{"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300122624.737432, "message": "Clickable: http://holono.com/", "group_id": 95, "id": 349186}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300122801.4825511, "message": "I've made this after creating a few cool projects and realizing I had no decent way of showing them online.   For example, serial entrepreneurs can make pages to show off all of their previous startups, or EEs could show off their gadgets.\n\nI just debuted it to HackerNews here: http://news.ycombinator.com/item?id=2323215\nand I'm really curious what people think. It's been tough learning rails, building the site, and doing school at the same time.  But it's been rewarding.", "group_id": 95, "id": 349212}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300135960.735342, "message": "Last but not least, please implement a 'lost password' function, I've just registered 10 minutes ago and due to not saving my generated password (yes I am stupid :P) I have already lost it hehe..", "group_id": 95, "id": 350984}, {"user_id": 4077, "stars": [], "topic_id": 13037, "date_created": 1300134388.0550101, "message": "It looks nice!  I feel like it lacks a little polish, but it's a new project, and I'm sure that will come in time.  I signed up and added a project.", "group_id": 95, "id": 350658}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300135954.9930899, "message": "Just what I needed :) Nice product, easy and quick to use! The design could use some more work, but it's alright.", "group_id": 95, "id": 350982}, {"user_id": 18530, "stars": [], "topic_id": 13037, "date_created": 1300154648.0996389, "message": "suggestion - get hackerspaces set up with accounts. they always have cool projects, and their members are EXACTLY your target audience.", "group_id": 95, "id": 352833}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300166616.478472, "message": "@hlfshell I've recently started talking to people at Hackerspace.sg and we're going to implement a \"community\" feature soon where you can associate a project with a community, with a custom background and easily accessible search.  It definitely is a great audience for this.", "group_id": 95, "id": 353578}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300166699.6447451, "message": "@koopa58 We'll add that now.  I was hoping that most people would use facebook login, but that really hasn't been the case.  If we used Google or Twitter login would you want to use either of those instead?", "group_id": 95, "id": 353581}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300167028.5555971, "message": "@koopa58 and @bmelton  The design definitely is in progress.  From what I've heard the main complaints have come from the \"project edit\" buttons and such.  Are there any other main specific places where the design should be improved first?  Although it's kind of small, one thing we were considering was allowing users to upload or choose their own background image / color scheme.", "group_id": 95, "id": 353584}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300184943.2807429, "message": "@ogooen Yeah it would be nice to select some colors and a background image. Maybe even allow uploading or saving custom css-styles to allow maximum flexibility in styling. In general I'd like a more rounded web 2.0-ish kind of styling.", "group_id": 95, "id": 354479}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300184632.794759, "message": "@ogooen Very nice, thanks! I'm a bit hesitant on the Facebook and Twitter login's. But a Google Apps sign-in would be good, I'd use that.", "group_id": 95, "id": 354470}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300193316.795064, "message": "@koopa58 We'll add background-image-choosing and 2-5 color schemes.  I think I'll wait until more people ask for custom css-styles to add that, which will take a while longer to implement.", "group_id": 95, "id": 355358}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300193421.5863979, "message": "@koopa58 originally the site had all rounded edges, but we changed it temporarily because of browser capabilities.", "group_id": 95, "id": 355379}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300193472.9967339, "message": "One question though; is a nicer interface good enough to get you to use the site?  Or are there any other features or User Interface issues you feel are more important?", "group_id": 95, "id": 355391}, {"user_id": 4077, "stars": [], "topic_id": 13037, "date_created": 1300195564.0746651, "message": "I used the 'regular' registration, and it was fine.", "group_id": 95, "id": 355692}, {"user_id": 16440, "stars": [{"date_created": 1300212552.8554649, "user_id": 7380}], "topic_id": 13037, "date_created": 1300203715.840456, "message": "For me, the public profile page is the most important piece. I'd like to redirect to it and use it as a main page for new clients to go to and take a look at fe. :) Not sure if that is what you had in mind though, when building this service?", "group_id": 95, "id": 357492}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300204550.5885201, "message": "1) adding more boxes on the bottom for \"Email\" and other common websites/blogs besides facebook/linkedin/twitter", "group_id": 95, "id": 357702}, {"user_id": 16440, "stars": [{"date_created": 1300212550.415473, "user_id": 7380}], "topic_id": 13037, "date_created": 1300203582.7487929, "message": "@ogooen Nice, I think the option of color schemes is a nice and welcome addition. But I think the design in general is a bit plain at the moment. I'm no designer, but maybe you can look at Convore fe. and see how they use dropshadow's and gradients to spice everything up a little. If I were to pay for a service like this, I'd like to have a page that is looking good and kind of 'sells' itself as I lack design skills myself to make a nice looking portfolio :)", "group_id": 95, "id": 357450}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300204305.7407031, "message": "@koopa58 It kind of was.  I'm a college student, so I was thinking of it being a portfolio to use instead of your resume (and for friends & family & fans to kind of keep in touch with what you've worked on).  Then I was noticing that a lot of entrepreneurs have websites where they kind of show the companies they have created, but don't have great pages showing them", "group_id": 95, "id": 357648}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300204519.3585579, "message": "@koopa58 I'll work on redesigning the user page a bit and will update you with possible sketches.  Are there any features missing on the portfolio page, or is it just the design that needs work?  Some things we are considering doing are:", "group_id": 95, "id": 357698}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300204616.958544, "message": "and 2) Having your own categories of projects.  On the top of your list may be \"Stuff I'm doing now\", followed by those, then \"Companies 1995 - 2005\" or anything else you want", "group_id": 95, "id": 357719}, {"user_id": 18530, "stars": [], "topic_id": 13037, "date_created": 1300206031.9557469, "message": "@ogooen #hackerspaces - sounds great. I'm a member of one and look forward to throwing up some of our random projects on it.", "group_id": 95, "id": 357983}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300210484.4446909, "message": "@ogooen Okay, I like how you keep it open as to how the site can be used by multiple professions/hobbies. Besides the design, yes categories would be nice. Although you could make use of the tags as well. And maybe allow for a filter and/or search through the projects by tag etc.?", "group_id": 95, "id": 358861}, {"user_id": 16440, "stars": [{"date_created": 1300212556.5411921, "user_id": 7380}], "topic_id": 13037, "date_created": 1300210508.852428, "message": "Also a Github, Flickr and Youtube links/icons would be nice. Maybe it's an idea to allow integration with such sites, as part of the portfolio. Developers might use Github for example, and so there is already a title and a short-description of the project available there. For movies Youtube or Vimeo and for photographers Flickr.", "group_id": 95, "id": 358864}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212365.127255, "message": "but in the long term, I'm thinking about just allowing anyone to compete to create the best CSS templates to represent the portfolio page, and then selecting the best 5 or so and making them options for anyone", "group_id": 95, "id": 359071}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212575.4893651, "message": "other people seem to be better at design than I am, and that would allow us to spend more time adding features", "group_id": 95, "id": 359093}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300211391.888386, "message": "@koopa58 Right now you can search project by tag, although our search is quite slow.  If you go to the stage (in the header) you'll see a list of the common tags on the left.  If you go to search (also in the header) you'll see a list of the few most common tags in the top, and when you search, it searches tags & names", "group_id": 95, "id": 358972}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212322.6091239, "message": "@koopa58 I have been thinking about the thumbnails, but it will take a while to get right.  Right now my friends and I are college students (sadly) and are working our best with the time we have.  I'm really, really happy people (mainly you) are taking an interest now, because it kind of makes our previous work more worthwhile", "group_id": 95, "id": 359062}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300211515.8529871, "message": "@koopa58 It will be easy to add icons for Github / Flickr/ Youtube for convenient links to a user's pages.  (There are already icons for most social sites for links associated with the projects, minus Github I think).  I've been getting a few requests to pull content from Github, so will definitely be looking at that soon", "group_id": 95, "id": 358994}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300211893.95591, "message": "@koopa58 ok, we actually had that at first, but removed it to simplify the system.  Up until now I was the only user with more than 7 projects, so I wasn't sure if it would encourage anyone.  About the interface: would you want the different categories to be on the top of your project list or underneath your picture on the right sidebar?", "group_id": 95, "id": 359027}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300211266.851784, "message": "@hlfshell Sounds good.  Let me know if there's anything that you (or the other hackerspace members) would like.  One thing we are planning is for each project to be associated with a community (initial options: Hacks, Web Apps, Harvey Mudd College, Hackerspace.sg, you're group here).  While tags also works, this could allow the group to choose a custom background & color template for all their \"projects\", as well as facilitating some nice search between them.  Would that be useful to you?", "group_id": 95, "id": 358959}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300211902.6974411, "message": "Another suggestion: Besides the e-mail button, it might be nice to have a contact form for anti-spam. And for visitors that don't want to startup their mail client. And lastly, maybe allow for multiple way's to display items on the portfolio page. Like now it is a list page, but maybe a thumbnails representation, or a slide representation would be nice as well.", "group_id": 95, "id": 359028}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300211795.103271, "message": "@ogooen Cool nice to hear about the possible Github integration. About the search/filter, what I mean is such an option on the profile page :) So to easily browse trough profiles that might have a lot of items.", "group_id": 95, "id": 359020}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300212237.511291, "message": "@ogooen Okay great :)", "group_id": 95, "id": 359056}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212213.0461221, "message": "@koopa58 When I said \"email button\" what I really meant was \"message, and we'll redirect it to your email\".  We already have a way of doing that so it wouldn't be too difficult.", "group_id": 95, "id": 359055}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212639.5353391, "message": "anyway, I really need to go to bed.  I'm studying abroad in Singapore right now.  Thanks so much for your ideas; it really encourages me to work harder.", "group_id": 95, "id": 359096}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300212654.671612, "message": "I'll be back tomorrow, of course", "group_id": 95, "id": 359098}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300212671.4657879, "message": "@ogooen No problem, have a good night. I'll reply to some messages, and we'll speak again tomorrow :)", "group_id": 95, "id": 359104}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300212869.2832539, "message": "@ogooen About search, I understand you might want to hide this at first. I think that is a good idea. Maybe only show it when there are +10 items in the portfolio? On the interface; I think I would put a general search/filtering box above the list of items/projects. Where there is a list of tags to filter on, possible a category drop down and a search box. But I'd start with the tags, they give the least intimidation to new users, yet give flexibility for people browsing the portfolio.", "group_id": 95, "id": 359116}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300213248.3951011, "message": "About the thumbnails, I think I'd leave it as it is then for now. If I were to prioritize myself I'd check out a better overal design. And filterable list of projects (just tags), on the profile page. / Makes me wonder, isn't there a web service for this?", "group_id": 95, "id": 359145}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300295316.4722109, "message": "@koopa58 What do you mean, web service for \"this\".  Like, web service showing your projects?  Not that I'm aware of, surprisingly.  There's a lot of stuff for artists and photographers, but not for people to show off their websites / projects / etc.", "group_id": 95, "id": 367729}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300295989.47525, "message": "@ogooen I meant a web service for scaling/editing pictures :) And I think you can do that with Flickr. It might not be relevant, but I know thumbnailing and handling pictures in general can be a p.i.t.a. Perhaps something like Flickr might be to some help for you someday :)", "group_id": 95, "id": 367807}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300296591.185493, "message": "@ogooen Sorry, rereading my post now, from yesterday, I understand it is a bit confusing as to what I refer to when noting the web service :)", "group_id": 95, "id": 367850}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300295340.6498849, "message": "For all other convore members reading this, do you know of any other sites to show off your projects?", "group_id": 95, "id": 367732}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300527410.944314, "message": "@ogooen http://fresh.li/ seems to be in the same market.", "group_id": 95, "id": 387492}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300603628.639684, "message": "@koopa58 Oh, fresh.ly looks interesting.  It's different, but definitely more similar than most other web apps.  About Flickr; that's our current plan now.", "group_id": 95, "id": 390830}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300603754.822844, "message": "@koopa58 - By the way, what is your name on Holono?  We're working on password recovery, but it will take a while and for now we could just reset your account.", "group_id": 95, "id": 390840}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300644779.278461, "message": "@koopa58 - Never mind.  We have password recovery now!", "group_id": 95, "id": 393018}, {"user_id": 16440, "stars": [], "topic_id": 13037, "date_created": 1300656463.8110709, "message": "@ogooen Thanks alot, password reset worked great! Hope Flickr will be handy for your goals :) Haven't used their api myself yet, but it looks alright and not too hard.", "group_id": 95, "id": 393899}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300673838.4225421, "message": "it's based on a solid concept and works, kind of. having links to projects is pretty essential (maybe I'm supposed to use HTML or markdown?)", "group_id": 95, "id": 394820}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300673858.7038839, "message": "congrats on getting your first server-side app out the door!", "group_id": 95, "id": 394821}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300673906.731379, "message": "...or something like that...first rails app, first app that was your own project, etc.", "group_id": 95, "id": 394823}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300685088.2463181, "message": "@bat ; thanks!  (This was our first rails app, etc).", "group_id": 95, "id": 395530}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300685113.495882, "message": "@bat - about \"having links to projects\" do you mean some projects referencing other projects?", "group_id": 95, "id": 395532}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300691904.363157, "message": "no, I mean I just want a link to my main source of a project, like its website, or github, or a file, with tags", "group_id": 95, "id": 396265}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300691937.2604151, "message": "...already", "group_id": 95, "id": 396274}, {"user_id": 5073, "stars": [], "topic_id": 13037, "date_created": 1300691672.8358669, "message": "like the idea and believe it has potential. It's probably too late for me to join as my first project dates back to 1984. IMO, your H1 can be more personal focusing on what you do for me - e.g. 'Make a showroom for you work' - and leaving the 'how you do it?' answer for the H2. goodluck!", "group_id": 95, "id": 396210}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300691930.0354979, "message": "I don't want the homepage of the project to be something I create. I have tools for creating projects", "group_id": 95, "id": 396271}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300691952.166038, "message": "I just need a short description, and tags", "group_id": 95, "id": 396277}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300691987.0222349, "message": "your site shouldn't have a permalink for projects IMO", "group_id": 95, "id": 396290}, {"user_id": 3159, "stars": [], "topic_id": 13037, "date_created": 1300729240.0649321, "message": "I like this.  IMO it could really use a designer's eye, though", "group_id": 95, "id": 400532}, {"user_id": 3159, "stars": [], "topic_id": 13037, "date_created": 1300729247.12409, "message": "really promising site :)", "group_id": 95, "id": 400535}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300792534.5715761, "message": "@daonb Thanks for the H1 H2 Ideas, I'll try them shortly.  Also, don't worry about it being too late to post.  We expect that most of the content there will be projects that are finished (because there are more finished projects than active projects in the world).  If you think your friends or anyone else in the world may ever find it interesting, feel free to post.", "group_id": 95, "id": 406330}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300792736.7363911, "message": "@bat It's good to hear that you feel that way though, because that's a hunch I had and wasn't sure how others felt.  Would you prefer the links to show in full on the right side of the project summary, and have the projects not be clickable on request?", "group_id": 95, "id": 406340}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1300792614.032269, "message": "@bat We have spent some time adding links and will improve the feature more.  You'll see on my profile ( http://holono.com/users/2 ) that many of the projects have little icons on the right that are clickable, which are used to send the viewer to the relevant videos/blogs/ etc.", "group_id": 95, "id": 406333}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300860552.9578459, "message": "no, the projects should be clickable, but it should go to the user's link page", "group_id": 95, "id": 414725}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300860675.5687339, "message": "like HN and reddit have with being able to do a text post instead of a link", "group_id": 95, "id": 414743}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300860773.84934, "message": "oh yeah - carbonmade", "group_id": 95, "id": 414762}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300860635.273746, "message": "maybe it could be just a name, date(s), tags and either a more info page on holono or a link to an external project page", "group_id": 95, "id": 414739}, {"user_id": 4935, "stars": [], "topic_id": 13037, "date_created": 1300860757.1701369, "message": "having a separate project page is like Spencer Fry's company", "group_id": 95, "id": 414758}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302886131.196636, "message": "We've just added portal/groups functionality, so any group (a college, hackerspace, conference) could easily put together all of their stuff for elegant browsing.  I'm curious what you guys think and if you have ideas for groups that may find it useful.\nExample here: http://holono.com/groups/1", "group_id": 95, "id": 702452}, {"user_id": 28249, "stars": [], "topic_id": 13037, "date_created": 1302889691.4324591, "message": "If you're creating a product focussed on presentation", "group_id": 95, "id": 703136}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889674.673326, "message": "ok.  But both offer similar benefits from a user's perspective.  Show off what you've done.", "group_id": 95, "id": 703133}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889901.277925, "message": "Maybe it would help if the user could try a demo before having to sign up", "group_id": 95, "id": 703230}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889770.599396, "message": "Holono is more focussed on apps/projects that need to be displayed in a way", "group_id": 95, "id": 703162}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889561.2434969, "message": "I filled out a profile, but never used the site.  I kind of feel like this would be the same...", "group_id": 95, "id": 703104}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889785.5992489, "message": "\"Everything is searchable and sorted out, you can make lists & groups\"  that's kind of interesting...  but why would I want to look through a bunch of other people's projects?", "group_id": 95, "id": 703173}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889793.0801971, "message": "I've gotten a few requests before for that", "group_id": 95, "id": 703176}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889995.6515591, "message": "I'm trying to think about what most people coming to the site are gonna think.", "group_id": 95, "id": 703292}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889485.383481, "message": "It's easier, it's free, it", "group_id": 95, "id": 703091}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889537.0976241, "message": "Also, this reminds me of profile.io, which somebody posted to Hacker News a while ago", "group_id": 95, "id": 703099}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889916.750221, "message": "Personally, I've found that the things people have worked on are much more revealing about them than their interests or photograph, so that could be an advantage as well", "group_id": 95, "id": 703254}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889969.263299, "message": "heh, giving you my info isn't the problem.  Laziness is the problem.", "group_id": 95, "id": 703275}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889999.122112, "message": "We could also allow you to quickly write in the \"coolest thing you've done\" before having to sign up", "group_id": 95, "id": 703296}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890185.32038, "message": "if you don't want anything fancy", "group_id": 95, "id": 703375}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889375.9765911, "message": "Facebook login failed.  I think the projects on the front page look a bit too much like ads.  I didn't understand what I was looking at at first.  I don't think I'm really sold on the site.  What are the big advantages of using this over a personal site?", "group_id": 95, "id": 703072}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889553.8098559, "message": "You're right about the ads though.  It's kind of unfortunate, but the first result there now is from a Mudd alumni who made a company and showed it there.", "group_id": 95, "id": 703103}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889769.5554991, "message": "All I see on your profile.io link are two links of your web apps", "group_id": 95, "id": 703161}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889960.068531, "message": "would it help if we had a video to show someone making an account and creating a few projects?", "group_id": 95, "id": 703272}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889621.665684, "message": "this is about creating a database of projects & websites, more than having users create pretty personal pages", "group_id": 95, "id": 703120}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889823.735827, "message": "@ija maybe you want to see what's going on at the local hackerspace, maybe you want to see what people at the next conference you are attending have worked on", "group_id": 95, "id": 703189}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890619.4157779, "message": "sure", "group_id": 95, "id": 703518}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889516.20433, "message": "*it's connected.  Everything is searchable and sorted out, you can make lists & groups, all stuff that's really annoying / impossible to do with personal websites", "group_id": 95, "id": 703095}, {"user_id": 28249, "stars": [], "topic_id": 13037, "date_created": 1302889697.0501051, "message": "you might have wanted to hire a designer", "group_id": 95, "id": 703138}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889771.6973381, "message": "@dmerfield yes, in many ways", "group_id": 95, "id": 703164}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889946.334306, "message": "without facebook", "group_id": 95, "id": 703270}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889589.6580081, "message": "Hm... I've seen a bunch of profile apps, didn't notice profile.io on hackernews", "group_id": 95, "id": 703110}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890011.859093, "message": "yeah, video would be great", "group_id": 95, "id": 703304}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889615.6927831, "message": "http://profile.io/jessealdridge", "group_id": 95, "id": 703117}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889782.520123, "message": "I'm definitely considering it", "group_id": 95, "id": 703171}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889856.3402951, "message": "or maybe you want to find wearable computing research happening in LA.  Right now there's no organization or structure to any of that stuff", "group_id": 95, "id": 703199}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302889940.1037221, "message": "One thing some people have done is sign up under a fake name", "group_id": 95, "id": 703265}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302890086.816411, "message": "@jca I was reluctant for a while because we kept on changing the design, so I was afraid it would be outdated.  I think we'll add one now though (this week).", "group_id": 95, "id": 703332}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302889921.7254741, "message": "Like full functionality, but prompt to sign up before it will save", "group_id": 95, "id": 703256}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890177.4299071, "message": "really easy to use", "group_id": 95, "id": 703367}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302890093.7743931, "message": "shouldn't be too difficult", "group_id": 95, "id": 703334}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890142.02107, "message": "Cool.  I think even an outdated video would help a lot.", "group_id": 95, "id": 703354}, {"user_id": 842, "stars": [], "topic_id": 13037, "date_created": 1302890162.1435571, "message": "I used screenr for http://www.bottleneck.dotcloud.com", "group_id": 95, "id": 703361}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302890235.347055, "message": "nice.  I was looking for something before but had some difficulty finding simple software", "group_id": 95, "id": 703393}, {"user_id": 7380, "stars": [], "topic_id": 13037, "date_created": 1302890490.8735571, "message": "@jca I'll work on getting Facebook working, not sure what's up.  In the meantime, if you come up with any suggestions or wants from the site please let me know", "group_id": 95, "id": 703475}]