[{"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300116960.8828549, "message": "Contrary to opinion, I am not obsessed with Maltese Falcon.\n\nThat being said. It occurred to me that perhaps MF is a good exercise in how to utilize DP to fix and re-write a story. \n\nWe are all (most likely) familiar with the Bogart movie version. Several folks offer this as an example of a movie with problems. \n\nSo if WE (that's all of us) were writing the script  and we realized there were issues then perhaps we'd use DP to fix it. \n\nThat seems like a perfect educational opportunity. \n\nAll of us have access to the movie. \n\nSo it is YOUR “story” and you've been asked to “fix” it. So what are your first steps?\n\nPerhaps “we as a group” (led by the more advanced) could go through a step by step use of DP to fix the story and make it better?\n\nFrom my position of “abject ignorance” I'd think the place to start would be the Story Engine but what do I know? <g>\nAnyone want to join a group “pinata experiment” and whack away at MF using DP as a tool?", "group_id": 2515, "id": 348388}, {"user_id": 7664, "stars": [], "topic_id": 13016, "date_created": 1300126267.9188361, "message": "If I weren't busy doing this to my own script, I would love to join in. I doubt I'll have the time for the next couple of months.", "group_id": 2515, "id": 349634}, {"user_id": 10814, "stars": [], "topic_id": 13016, "date_created": 1300126383.6598499, "message": "The first thing to do would be to establish WHO the Impact Character is and what his or her relationship to the MC would be.  That would go a LONG way toward \"fixing\" the problem.  Once you have those, I'd use the MC and OS throughlines to guide me where the story was intended to go originally, and fill in the blanks where necessary.", "group_id": 2515, "id": 349644}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300148972.347254, "message": "So is it possible the IC is \"something\" larger than a person- sort of the \"Empire\" in Star Wars?", "group_id": 2515, "id": 352312}, {"user_id": 10814, "stars": [], "topic_id": 13016, "date_created": 1300163865.73873, "message": "It's possible, but probably not likely.", "group_id": 2515, "id": 353465}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300237366.5396521, "message": "So who do you (or anyone) consider the IC and is Spade the MC?", "group_id": 2515, "id": 361659}, {"user_id": 10814, "stars": [], "topic_id": 13016, "date_created": 1300902153.4663019, "message": "Well, there isn't an IC in Maltese Falcon, but I'd say his current love interest (the secretary?  Not sure since I haven't seen it in a while) is the likely candidate.  That said, anybody COULD be if more story were added to MAKE them an impact character.", "group_id": 2515, "id": 419122}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300978909.2466409, "message": "I think part of the \"problem\" is three movies and one story (Hammett's). BTW, I'm not sure I'd \"peg\" Effie Perine (secretary) as a love interest. In the book (and movie #1) she clearly rejects him. In the book he goes back to Miles Archer's widow at the end (last sentence in the book \"Well, send her in.\" And he even \"sleeps\" with Bridget/Miss Wonderly (book and movie #1.)", "group_id": 2515, "id": 427514}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300979832.287714, "message": "Now as to IC- since DT (Dramatica Theory) says that the IC forces the MC to face his personal problem  then perhaps that is the place to start- Does Spade have a personal problem that is revealed in the story and if so does that identify the IC? I will toss out the possibility that Spade's \"problem\" is his own code of ethics and that the Maltese Falcon (and its wake of problems and characters) then becomes (perhaps) the IC . We (the audience) examine what \"we\" might do in a similar situation. If we \"slept\" with Bridget would we \"throw her under the bus\"? If we had the \"falcon\" would we surrender it for \"pennies on the dollar? If we had an affair with our partner's wife would we toss her for Miss Wonderly and the falcon? Etc.", "group_id": 2515, "id": 427652}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1300980144.383224, "message": "I also don't see this as a \"cut and dried\" Grand Argument\" story which is probably one of the reasons that some shy away from discussing it to start with regardless of whether we are discussing the book or any of the movies. It's interesting to me that there were three movies from one story  and that seemingly the general audience has been drawn to them especially without (as some have suggested) a good story. Is there a lesson for writers and script folks in that?", "group_id": 2515, "id": 427707}, {"user_id": 10814, "stars": [], "topic_id": 13016, "date_created": 1300982780.6140931, "message": "I also think that if I were to \"enhance\" the Maltese Falcon by making it a GAS (grand argument story), I'd have Spade be a Steadfast MC to retain as much of the original story as possible, and make the IC -- whoever that may be -- a Change character.  As it is, there are not a whole lot of candidates for the change character without some significant story \"enhancement.\" <g>", "group_id": 2515, "id": 428174}, {"user_id": 7664, "stars": [], "topic_id": 13016, "date_created": 1302286873.887639, "message": "You might be interested in a blog called http://cockeyedcaravan.blogspot.com/, where the guy occasionally tries to fix movies by offering changes.", "group_id": 2515, "id": 593946}, {"user_id": 30951, "stars": [], "topic_id": 13016, "date_created": 1304202041.661571, "message": "Could O'Shaughnessy be the IC? At first Bogart seems to not be acting with morals, but at the end we see that he does, and O'Shaughnessy is a sort of baddy. Spade must be the MC as far as I'm concerned. If his not, I have serious problems! I would put Effie in a sidekick / guardian type role, but I don't think archetype characters work here. I don't really see a protagonist role here, but again if anyone I'd think it mus be Spade. But I can't work out what is driving him. He is trying to find the truth, but everything seems to happen too him.", "group_id": 2515, "id": 872743}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1304295667.8328869, "message": "The first issue is that you're looking at the Bogart/Huston version", "group_id": 2515, "id": 879108}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1304295702.7444, "message": "The first issue is that you're looking at the Bogart/Huston version (as many do) and it differs from Hammett's writing", "group_id": 2515, "id": 879111}, {"user_id": 30951, "stars": [], "topic_id": 13016, "date_created": 1304296246.136632, "message": "Ah ok. Sorry, confused. In the OP it says the film. That's all I've seen.", "group_id": 2515, "id": 879169}, {"user_id": 30951, "stars": [], "topic_id": 13016, "date_created": 1304351247.3064539, "message": "I understand now. Wouldn't it be best to focus on the Bogart film if this is what people are likely to know?\n\nOn that note, one potential story problem that struck me was why Sam Spade was confident he could get the falcon. We can assume he was lying to Cairo and Gutman, but there's no basis for his confidence, as he would not have known the ship's captain would bring the falcon to him. If that is seen as a plot hole, the important question is how would DP have fixed it?", "group_id": 2515, "id": 884816}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1304428390.463182, "message": "That is one approach. I'm interested in \"story\" more than \"screenplay\". I think Huston took what might be a \"good story\" and made it a vehicle for actors and his notion of a movie. Dram for me should be looking at story. We can't fix the Bogart version. We can examine the story (Hammett) and even the Pre-code movie version that sticks much closer to the story.", "group_id": 2515, "id": 897686}, {"user_id": 30951, "stars": [], "topic_id": 13016, "date_created": 1304441857.691952, "message": "Fair enough. Interesting though as I would have said that the Huston film could be looked at with Dramatica. Looking on Wiki, the general plot progression seems to be similar, although I haven't seen the pre-code film or read Hammett's original. Not sure where I can get hold of the pre-code film.", "group_id": 2515, "id": 900297}, {"user_id": 13650, "stars": [], "topic_id": 13016, "date_created": 1304523903.9785941, "message": "Occasionally I think it shows up on TCM- try a library or on-line service- try 1931 and Richard Cortez in your search. It is strongly suggested that Spade sleeps with the woman.", "group_id": 2515, "id": 914555}, {"user_id": 37586, "stars": [], "topic_id": 13016, "date_created": 1315163966.1667299, "message": "After reading this thread and reading Jim Hulls article \nhttp://storyfanatic.com/articles/story-analysis/the-maltese-falcon-analysis\nI have come up with a possible storyform for a fix if anyone is still interested?", "group_id": 2515, "id": 2044709}, {"user_id": 39675, "stars": [], "topic_id": 13016, "date_created": 1315190682.189568, "message": "@sam_potter  I would like to see a fix idea.", "group_id": 2515, "id": 2047868}, {"user_id": 37586, "stars": [], "topic_id": 13016, "date_created": 1315202385.525728, "message": "This fix is based on the 1941 movie.  You may be the only one who has read the book and I have not seen the 1931 version yet.  So you will be the moderator or the guy with the final fix it say.  Based on the DUG podcast and Jim Hull's article I am saying the story is about finding out who killed Spades partner, solving the mystery.\nNow this story form may be completely shit if solving the mystery doesn't fall under Activity and and solving the mystery is a concern of Understanding.  Jim's article says Spade is Steadfast, a start character, a Be-er, a linear thinker.  I went with an Action driven story since the story starts when Spades partner is killed.  Option lock because there are only so many suspects to go through.  The mystery is solved = Success but Spades personal issues are not = Bad.  Lets start the discussion there and I am certainly flexible.", "group_id": 2515, "id": 2049088}, {"user_id": 37586, "stars": [], "topic_id": 13016, "date_created": 1315235838.4355891, "message": "from \"Dramatica for Screenwriters\" by Armando Saldaña Mora\n\"\"Detective Stories.  The Main Character is a Professional Crime Solver.  The Impact starts as a mere Distraction and grows up to be a Severe Menace (like in \"The Maltese Falcon\").\"\"", "group_id": 2515, "id": 2050984}, {"user_id": 37586, "stars": [], "topic_id": 13016, "date_created": 1315235756.6849041, "message": "from \"Dramatica for Screenwriters\" by Armando Saldaña Mora\n\"\"Crime Movies.  These stories rely on a puzzling and surprising progression of events, so usually a Red Herring—a Distraction or False Clue that keeps the Characters and audience from finding the final truth—is used as one of the Major Characters.", "group_id": 2515, "id": 2050980}, {"user_id": 37586, "stars": [], "topic_id": 13016, "date_created": 1315236009.0991189, "message": "This would suggest that Brigid is the Impact Character.  What do you think?", "group_id": 2515, "id": 2050990}]