[{"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311898218.8107691, "message": "I know that there isn't too much TV analysis that goes on, but...\n\nIn a tv series with a full story per season, how closely do individual episodes hue to a storyform *of their own*?\n\nI know there is that ep of The X-Files that is a complete story, but those episodes tended to be removed from the overall story involving aliens and conspiracies.", "group_id": 2515, "id": 1743417}, {"user_id": 33839, "stars": [], "topic_id": 42909, "date_created": 1311899770.7910709, "message": "I would think they're somewhat incomplete.  For instance, if you look at Battlestar Galactica, the OS is always \"there\", but each episode is like a mini-story of its own which more or less threatens the outcome of the OS.  \n\nObviously pilots aren't going to - I see them as sort of being an introduction to the main conflict.  Subsequent episodes usually seem to weave different threads, often ending with cliffhangers which make the episode incomplete, yet satisfy some element initially brought up.  \n\nThe cliffhanger approach can grow a bit repetitive after a while, that's why I think as the episodes progress, different story lines are introduced to give a sense of there being some endpoints to each episode.", "group_id": 2515, "id": 1743498}, {"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311900315.35021, "message": "I guess I'm curious, though, if a cliffhanger could be treated as a Failure in some ministory.", "group_id": 2515, "id": 1743536}, {"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311902196.410357, "message": "In NYPD Blue, for example, there were season long arcs and episodic crimes. I wonder if the crimes followed some sort of quad pattern.", "group_id": 2515, "id": 1743679}, {"user_id": 33839, "stars": [], "topic_id": 42909, "date_created": 1311901665.687999, "message": "I think it's more of a marketing device than a story device because in the grand scheme of things, the story is (or should) be resolved.  Really, with TV, everything comes down to marketing/advertising dollars - even the story's length (I think a half hour episode runs 22 minutes vs. 44 or slightly more for an hour).  \n\nBut within the context of a single episode, it's a good question and why I would say they're incomplete unless the particular problem brought up within the episode is solved within the same one (I'm thinking this is more true for older TV shows like The Incredible Hulk... David Banner always walking down some lonely road, unfulfilled in his own quest but having resolved somebody else's).", "group_id": 2515, "id": 1743644}, {"user_id": 33839, "stars": [], "topic_id": 42909, "date_created": 1311906747.4137421, "message": "I have to admit, I haven't watched too much television over the last number of years - which is a shame as I hear that's where the best writing is occurring.  I've bought the BSG series, but tuned out at one point for some reason (I guess I lost interest) and never finished watching it.", "group_id": 2515, "id": 1744089}, {"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311906957.503407, "message": "I loved BSG, but never watched the last 13 eps. I'll explain why, if you want, but I don't want to accidently put spoilers in here.", "group_id": 2515, "id": 1744100}, {"user_id": 33839, "stars": [], "topic_id": 42909, "date_created": 1311941425.9753129, "message": "Go for it - could be the very same reason I stopped (I'm not even sure what season it was... around 4 or so, when they were on some planet and there was this big thing going on with Starbuck.  I can't explain why myself, but about a year after I stopped watching, I tried to get back into it watching a couple of episodes up to that point and found myself turning it off again).", "group_id": 2515, "id": 1746715}, {"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311964155.4305179, "message": "It was two things. One, I can't stand things that are based on prophecy. Once Starbuck started loooking like she had been chosen for something, I was like, \"then her motivations don't matter, just the prophecy.\"", "group_id": 2515, "id": 1749929}, {"user_id": 33839, "stars": [], "topic_id": 42909, "date_created": 1311964524.0352061, "message": "Sounds like you tapped out right about where I did.  I don't mind the prophecy bit - I used it in one of my scripts, but countered it with the character's actions trying to avoid it caused it to actually fulfill it unexpectedly.  \n\nI may plop the DVD in tonight and see where I left off and try to figure out why I tuned out.  I think it may have been what I eluded to earlier, that there were actually multiple storylines that were getting drawn out and taking several episodes and nothing felt like it was being resolved by the end of any.", "group_id": 2515, "id": 1749978}, {"user_id": 7664, "stars": [], "topic_id": 42909, "date_created": 1311964220.4949901, "message": "But the real thing was when the cylons and the humans wanted to make peace. It seemed contrary to the whole show.\n\nI wish the writers had remained steadfast -- the cylons want to exterminate the humans -- and not changed towards the end.", "group_id": 2515, "id": 1749942}, {"user_id": 35369, "stars": [], "topic_id": 42909, "date_created": 1311974093.6087041, "message": "i'd venture individual episodes are slices of a complete story, with the season itself being closer to a complete whole (or sometimes multiple stories, some complete/some incomplete)", "group_id": 2515, "id": 1751011}]