[{"user_id": 37364, "stars": [], "topic_id": 40952, "date_created": 1309534546.2835979, "message": "I am doing a rewrite using Dramatica and have spent 3 days staring at my plot sequences for Act 2 thinking, shit, can I crowbar what I already have here into fitting these requirements, or do I have to completely rethink my plot to find scenes and scenarios that play them out? And when does a tool that helps become a tool that hinders..?", "group_id": 2515, "id": 1542168}, {"user_id": 7645, "stars": [], "topic_id": 40952, "date_created": 1309539229.27314, "message": "If you're 100% sure your storyform is correct. then yes, if you want your story to make sense you'll have to change quite a bit. There is a chance the storyform you have isn't the story you're trying to tell though. You have to go through and first only make the choices you are ABSOLUTELY sure are correct (like if you know whether or not the Main Character changes, or whether or not the Overall Story Goal is met). Lock those into the story engine and then play around with the others until you get a storyform that *feels* right.", "group_id": 2515, "id": 1543084}, {"user_id": 37364, "stars": [], "topic_id": 40952, "date_created": 1309539687.972698, "message": "oh. had a nasty feeling you were going to say that. Off to buy eye drops...", "group_id": 2515, "id": 1543158}, {"user_id": 7645, "stars": [], "topic_id": 40952, "date_created": 1309539281.5774529, "message": "But if you like the storyform and your story doesn't match up - then your story isn't communicating the meaning you wish to impart.", "group_id": 2515, "id": 1543089}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309542106.305459, "message": "I just went through a rewrite, and what I found was that on each pass, the lines between the throughlines blurred. Scenes that were designed for the OS started to pick up crumbs from the MC throughline, etc.\n\nI'd say half the scenes stayed cleanly in their intended throughline, and half ended up with a blend.\n\nLet me clarify that I think this is good.", "group_id": 2515, "id": 1543468}, {"user_id": 7645, "stars": [], "topic_id": 40952, "date_created": 1309539750.981946, "message": "lol", "group_id": 2515, "id": 1543163}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309541989.157382, "message": "I'm going to take a contrarian view. Sort of.\n\nHave you read through the thread on Groundhog Day, or listened to the Podcast? It is one of the highest regarded movies out there, and it conforms to a storyform, but it is so hard to tease out that the whole effort left me irritated.\n\nIt certainly does not do anything like Armando's suggestion of using the PSR to design scenes. (Although, let's remember that Armando was talking about making an outline.)", "group_id": 2515, "id": 1543451}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309542610.8731861, "message": "All those other steps were like necessary steps which makes it easier to digest.  Yeah, it's confusing - but I've gone through some of my scripts that have done very well in contests or coverage and am surprised somehow I'm not all that far off.  But I'm wanting better.  To be better.  To be the best that I can.  So that's what sort of led me here, because I feel like learning this is only going to help me that much more.", "group_id": 2515, "id": 1543543}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309542871.366648, "message": "And I may be the only person who's ever walked out of Robert McKee's class, lol.  Once it became evident it was the same as the book... not to mention the seating - I can barely handle a trip cross country on a plane let alone two full days in a fixed auditorium chair with a prick who doesn't want to be interrupted.", "group_id": 2515, "id": 1543580}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309542942.3528881, "message": "LOL.", "group_id": 2515, "id": 1543609}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309542580.1809931, "message": "@JBarker The amazing thing about your list of books is that I've read a lot of books, but none of those. (Except Syd Fields.)", "group_id": 2515, "id": 1543533}, {"user_id": 7664, "stars": [{"date_created": 1309542199.7734239, "user_id": 7645}], "topic_id": 40952, "date_created": 1309542178.875293, "message": "Anyway, my point is that I think you need to know what material the storyform is suggesting you put into your story more than you actually need to carve out a specific scene to hold that information.", "group_id": 2515, "id": 1543478}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309542477.5637021, "message": "I think Dramatica is sort of like running a marathon or doing P90X.  Not that I have run any marathons and most surely never will, but before doing P90X, I worked myself into shape doing a number of other things, first.  Bowflex.  Abs Boot Camp.  You name it.  It's not to say when I finally got to P90X, that it was a breeze - it wasn't.  But it was much easier having braced myself for it.  \n\nI think my journey with writing has been much the same way.  I think the first thing I ever picked up was Lew Hunters' Screenwriting 101.  Then the Syd Fields, Linda Segars, Robert McKee, John Truby, etc.  By the time I got here, I knew more or less what I was doing... just not in Dramatica terms of writing a grand argument story.", "group_id": 2515, "id": 1543524}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309542721.402739, "message": "@MikeDerk I just kind of call it an \"evolution of learning\".  I graduated about 16 credits short of four degrees in five years - love to learn, always, always looking to improve, but definitely see it as an evolutionary process.  Gotta learn how to crawl before you can walk, walk before you run, etc.", "group_id": 2515, "id": 1543561}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309542515.3975699, "message": "I will admit that I did cram in one scene. There is no motivation for it. There is no action in it. And, it's basically a monologue. It is free of all things that generally make for good writing or good drama.\n\nBut, dramatica asked that I put it in AND my own storytelling sense told me that I needed a specific piece of backstory that I simply hadn't found a good place for. \n\nIn one of those weirdly magical dramatica moments, the two things lined up perfectly. So I put it in. I'll let you know if anyone comments on it, good or bad.", "group_id": 2515, "id": 1543525}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309543020.3415539, "message": "I don't think this counts, but I got a mimeograph of his book -- actually, a transcript of his talk -- wait, same thing -- many years before it was published. I was very excited.\n\nI flipped to the middle, read a paragraph, said, \"What is this $%##?\" and never looked at it again.", "group_id": 2515, "id": 1543634}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309543057.819783, "message": "But back to the OP - when I read that about going through your script and making THAT many changes, it made me think of my own learning process.  Not sure where you are with that Gavin, but I think I choked when I first looked at Dramatica about seven years ago.  Part of me wishes I would have picked it up sooner, but I think the other half of me knows I probably would have put it back down that much quicker.", "group_id": 2515, "id": 1543643}, {"user_id": 7645, "stars": [], "topic_id": 40952, "date_created": 1309543061.5260949, "message": "Ahhhh lol", "group_id": 2515, "id": 1543645}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309543188.2878349, "message": "Seriously, I didn't even bother to ask for a refund.  Left at lunch the first day.  I couldn't take it.  He was \"entertaining\" to listen to, but my goodness, I'm built like a linebacker at 6'4 near 250.  Those seats were KILLING me.  I was afraid of standing up and stretching and having him go off about interrupting him.", "group_id": 2515, "id": 1543686}, {"user_id": 33839, "stars": [], "topic_id": 40952, "date_created": 1309543636.6780641, "message": "@MikeDerk haha.  Actually, I did the pentathlon in high school - going to the state championships.  Hated the 1500m, though.  The guy who took first place  went on to start QB in the NFL .  I could jump big time, having played basketball - but long distance just wasn't my thing.  Tires me out now just thinking about it...", "group_id": 2515, "id": 1543765}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309543168.426523, "message": "And, OP, this also matters: Do you like your script? Is it a first draft, or a seventh draft? Would you be doing rewrites anyway?", "group_id": 2515, "id": 1543678}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309543322.408592, "message": "OS Activity: Taking a writing class\nMC Situation: 6'4\", 250, can't fit into the chairs.\nNo wonder you haven't run a marathon!\n\nAnyway, just pointing out that two throughlines can operate simultaneously, to support my earlier post.", "group_id": 2515, "id": 1543718}, {"user_id": 7664, "stars": [], "topic_id": 40952, "date_created": 1309543938.522558, "message": "Pentatholon = horse, saber, pistol, mile and swim? What HS does that?!?", "group_id": 2515, "id": 1543827}, {"user_id": 10814, "stars": [], "topic_id": 40952, "date_created": 1309544525.5161569, "message": "@gavinrmarshall   I liked your question so much that I posted my answer as this month's Dramatica Tip of the Month.  I titled it, \"How Do I Begin Using Dramatica?\"  Here's a link to my answer:\n\nhttp://dramatica.com/theory/tip_of_month/tips/tip0711.html", "group_id": 2515, "id": 1543926}, {"user_id": 37364, "stars": [], "topic_id": 40952, "date_created": 1309606987.012594, "message": "OK. here I am 24 hrs later...eye drops in, hangover black-coffeed, tears wiped and hair taped back onto head. My story is on its 3rd draft, though the first of those was really just  a mess on a page, a sort of story vomit to have a look and see what my imagination had been eating over the years the idea had digested. the second was written under dramatica's benign (still giving benefit of the doubt here - and hoping not to find I have allowed a false ally under my roof!) influence.  And....wait for it...actually, the material I have does pretty much fit in fact, if I take out a (not particularly interesting) MC plot twist, add an OS scene. I have a drawn a blank on IC - Impulsive - Fantasy, but you know what, I am going to leave it. If something occurs, now or later in the story that fits, great. If not, there's a wee hole in my story. Well sue me, guys - script ain't sold, profits are none - go ahead!. I am going to try to complete the rewrite this way and see how it comes out. If teh scenes feel twisted and weird and of kilter, then I'll know something's not working and I can try something different. Or shoot myself. See how I feel.", "group_id": 2515, "id": 1547669}, {"user_id": 37364, "stars": [], "topic_id": 40952, "date_created": 1309607198.2251849, "message": "Oh, I've read most of those books too over the past 20 yrs, though this is my first real attempt to actually write something and dare to admit I am doing so. Started with Field, which was a good place to start i think. The one that I think makes most intuitive sense and which I would recommend (not sure dramatica is the best to come to fresh, though undoubtedly the most comprehensive and interesting) is the TRUBY. I think he's very good. Thought his lecture good too, though perhaps (like Mc KEE) not much point going now the book is out there.", "group_id": 2515, "id": 1547683}, {"user_id": 37364, "stars": [], "topic_id": 40952, "date_created": 1309607219.6682551, "message": "And thank you for the thoughts and comments, all.", "group_id": 2515, "id": 1547687}]