[{"user_id": 36563, "stars": [], "topic_id": 39898, "date_created": 1308592607.6621161, "message": "Que tal, y como de que va tratar la reunión, expondremos nuestro trabajo, publicaciones etc. o solo cotorrear tranquilamente del asunto de internet y los estudios sociales, en fin que si necesitamos una agenda o puede ser muy informal?", "group_id": 10646, "id": 1440691}, {"user_id": 19729, "stars": [], "topic_id": 39898, "date_created": 1308596074.149214, "message": "Si es buena idea lo de la agenda. Supongo que primero presentarnos, y ponernos de acuerdo para ver cómo se podría estructurar esto, si como seminario, grupo de estudio, charla de café o qué. Si va a ser muy formal con apoyos institucionales o informal ... Algunos ya tenían unas propuestas así que escucharlas y/o proponer algo... nos puedes enseñar las bondades de UciNet :P", "group_id": 10646, "id": 1441341}, {"user_id": 36344, "stars": [], "topic_id": 39898, "date_created": 1308616117.714292, "message": "Quizá ese día podríamos definir qué, cómo, cuándo... acá le platiqué a María Elena y nos dijo que desde ella hay apoyo, por lo que el SUV apoya institucionalmente", "group_id": 10646, "id": 1443748}, {"user_id": 36344, "stars": [], "topic_id": 39898, "date_created": 1308616117.705601, "message": "Quizá ese día podríamos definir qué, cómo, cuándo... acá le platiqué a María Elena y nos dijo que desde ella hay apoyo, por lo que el SUV apoya institucionalmente", "group_id": 10646, "id": 1443747}, {"user_id": 36563, "stars": [], "topic_id": 39898, "date_created": 1308670356.9713261, "message": "Ok, va pues ahí lo vemos, y claro ahí les enseño a jugar con el uciNet...", "group_id": 10646, "id": 1449408}, {"user_id": 19729, "stars": [], "topic_id": 39898, "date_created": 1309069429.669812, "message": "Alejandra Rocha comenta y le gustaría poner en la agenda que tiene una propuesta para Establecer una red de pares académicos españoles y mexicanos que tenga por objetivo el estudio de la (e- in-)migración de mexicanos y mexicanas con base en las comunicaciones personales a través de Internet, específicamente del Facebook, y su posterior establecimiento, como pareja, en alguno de los dos países y las repercusiones educativolaborales de este hecho, en ambas comunidades.", "group_id": 10646, "id": 1487551}, {"user_id": 36348, "stars": [], "topic_id": 39898, "date_created": 1309188572.7824819, "message": "¡Suena genial! Ustedes me dicen en qué modalidad le entramos, y yo puesto... ¡Saludos!", "group_id": 10646, "id": 1496294}, {"user_id": 36348, "stars": [], "topic_id": 39898, "date_created": 1309188573.5153551, "message": "¡Suena genial! Ustedes me dicen en qué modalidad le entramos, y yo puesto... ¡Saludos!", "group_id": 10646, "id": 1496295}, {"user_id": 36334, "stars": [], "topic_id": 39898, "date_created": 1309467554.5865591, "message": "Pues al menos somos tres las interesadas en la comunicación de los y las migrantes a través de las TIC. Lo que plantea Alejandra Rocha suena interesante, al parecer ya tenemos una posible línea de reflexión y trabajo.", "group_id": 10646, "id": 1533126}, {"user_id": 36790, "stars": [], "topic_id": 39898, "date_created": 1311699029.3575561, "message": "Vi un mensaje de que nos iban a mandar la relatoría de lo sucedido en la reunión pasada, asi que quedo en espera para ponerme al dia. Saludos a todos y todas.", "group_id": 10646, "id": 1724265}, {"user_id": 36790, "stars": [], "topic_id": 39898, "date_created": 1311698984.4564259, "message": "Una disculpa mor mi desaparición, pero los últimos dias de trabajo fueron tremendos y después decidí desconectarme para descansar un poco. Ya estoy de nuevo en funciones asi que cuando quieran retomamos el trabajo,", "group_id": 10646, "id": 1724261}]