[{"user_id": 10411, "stars": [], "topic_id": 20592, "date_created": 1303334446.8132541, "message": "I wanted to kick off some ideas about licensing.\n\nGPL is great and all, but it basically makes it not usable in a corporate context.  It also prevents the code from being packaged by things like EPD.  Since we would ideally like a Nat'l Lab or corporate uptake, I am not sure this would be appropriate here.\n\nPersonally, I use WTFPL for a lot of my projects (because it is the most open one I have found).  However, this is probably also inappropriate.  (http://sam.zoy.org/wtfpl/)\n\nThe JSON license is a bit more restrictive than WTFPL but has its heart in the right place for nuclear codes (http://www.json.org/license.html).\n\nBut in all seriousness, I really think that we should be 2-clause BSD licensed.  It is a standard license that doesn't have the same baggage as GPLv3.  Are there any good arguments against this?", "group_id": 9127, "id": 761655}, {"user_id": 30471, "stars": [], "topic_id": 20592, "date_created": 1303335107.3196139, "message": "I agree with simplified BSD. It keeps it open but allows inclusion in real projects (unlike GNU which is incompatible with proprietary software), and it requires some level of attribution and preservation.", "group_id": 9127, "id": 761778}, {"user_id": 30469, "stars": [], "topic_id": 20592, "date_created": 1303346258.7734089, "message": "I'm on board with a permissive-style license. I'm not intimately familiar with the differences between BSD, MIT, and Apache licenses so I'll defer to one of you who may be more knowledgeable on the subject.", "group_id": 9127, "id": 763410}, {"user_id": 30469, "stars": [], "topic_id": 20592, "date_created": 1303346565.916923, "message": "It's worth noting that the wording of the \"we're not liable for anything you do\" clause in BSD is a bit different than what I've seen in most nuclear codes. For example, MCNP's is:\n\n\"[The authors do not make] any warranty, express or implied, or assume any legal responsibility for the accuracy, completeness, or usefulness of any information, apparatus, product, or process disclosed, or represent that its use would not infringe privately owned rights\"", "group_id": 9127, "id": 763475}, {"user_id": 10411, "stars": [], "topic_id": 20592, "date_created": 1303348256.491046, "message": "@paul_romano I think the two phrasings amount to the same thing.  I don't think that we want Apache, but I'll reread MIT...", "group_id": 9127, "id": 763822}]