[{"user_id": 20521, "stars": [], "topic_id": 42169, "date_created": 1310929679.8455629, "message": "Como compro?", "group_id": 965, "id": 1657899}, {"user_id": 12133, "stars": [], "topic_id": 42169, "date_created": 1310936462.931751, "message": "mmm controlar lo que vendes desde facebook", "group_id": 965, "id": 1658685}, {"user_id": 12133, "stars": [], "topic_id": 42169, "date_created": 1310936490.7662411, "message": "mmm en mi simple opinion la administracion distribuida ( por otras aplicaciones) siempre es dificil.", "group_id": 965, "id": 1658687}, {"user_id": 13545, "stars": [], "topic_id": 42169, "date_created": 1310993956.185324, "message": "A mi me costo trabajo encontrar los precios, y al igual que @nekrox, no encuentro como comprar :)", "group_id": 965, "id": 1662100}, {"user_id": 24160, "stars": [], "topic_id": 42169, "date_created": 1310996885.661351, "message": "Yo estoy igual, no encuentro cómo comprar. Nos podrías explicar un poco mejor?", "group_id": 965, "id": 1662556}, {"user_id": 29866, "stars": [], "topic_id": 42169, "date_created": 1311000529.533514, "message": "Falta un rediseño del sitio hacer la experiencia del usuario más amigable, en caso de que el usuario no pueda comprar, al menos que tenga la capacidad de poder ponerse en contacto con el usuario, nunca entendí como \"registrarme con FB\" para vender, hay varios \"referentes\" que están trabajando con los \"Clasificados en Facebook\" algunos ejemplos son: http://www.oodle.com/, otro ejemplo que esta usando Facebook es: http://www.paygr.com/ << ellos tienen algunas características como \"vender la idea de la confianza como vendedor usando tu cuenta de Facebook\"... Los clasificados es uno de esos campos que necesitan de mucha innovación en Latinoamerica en USA ya comenzaron a salir muchas propuestas... todo de la mano del Social Ecommerce. Hace unos pocos días leí un articulo interesante en SmashingMagazine: Following A Web Design Process, http://bit.ly/nfIwJz que podría servirte de ayuda.", "group_id": 965, "id": 1663078}, {"user_id": 20505, "stars": [], "topic_id": 42169, "date_created": 1311009272.592757, "message": "Gracias por los comments la verdad es mi primer proyecto sabia que tendría varias fallas, ahora a trabajar sobre ellas y espero me ayuden de nuevo ya que las solucione... Saludos....", "group_id": 965, "id": 1664539}, {"user_id": 20505, "stars": [], "topic_id": 42169, "date_created": 1311011215.3720729, "message": "La tematica es parecida a la que comento josuegio utilizar tu perfil para vender articulos, por eso no hay boton de comprar, dejas un comentario en el producto y el comentario le llega por email al correo del vendedor y tambien se le postea un comment en su muro con el comentario asi es la tematica... alguna sugerencia para que la tematica quede clara al entrar al site?...", "group_id": 965, "id": 1664695}, {"user_id": 2946, "stars": [], "topic_id": 42169, "date_created": 1311143313.6947379, "message": "Trata de explicarnos en un parrafo tu propuesta de valor. Puede ser en  el formato \"Ventags es una compañía que ayuda a [mercado objetivo] a [ vender, comprar, ahorrar, etc…] por medio de [tecnología, proceso, ventaja competitiva (ser mexicano no cuenta), etc.]", "group_id": 965, "id": 1679075}, {"user_id": 2946, "stars": [], "topic_id": 42169, "date_created": 1311143463.6687319, "message": "necesitas tener bien clara tu propuesta de valor y ser capaz de explicarla de forma muy sencilla. Por ejemplo \"Google es una compañía que ayuda a anunciantes a alcanzar a su mercado objetivo mediante el mejor buscador que existe\" o \"Groupon ayuda a pequeños negocios a conseguir nuevos clientes mediante un sistema de ofertas grupales\"", "group_id": 965, "id": 1679079}, {"user_id": 2946, "stars": [], "topic_id": 42169, "date_created": 1311143490.497081, "message": "Sabiendo eso, es más facil ayudarte XD", "group_id": 965, "id": 1679080}]