[{"user_id": 37168, "stars": [], "topic_id": 42657, "date_created": 1311628952.674372, "message": "If a character stops something, doesn't he or she, by definition, start doing something else, e.g. a young man stops acting childish and starts acting like an adult? Or am I simply justifying a weakness in my story?", "group_id": 2515, "id": 1718749}, {"user_id": 10814, "stars": [], "topic_id": 42657, "date_created": 1311631485.403935, "message": "If the glass is half-full of castor oil and you need to drink it to get better, your focus will be on what is there and the part that is not there is not even under consideration.  This describes a STOP story.\n\nIf the glass is half-full of gold and you need lots of $$$, your focus will be on what is NOT there, and the part that is there is not really under consideration.  This is a START story.", "group_id": 2515, "id": 1718958}, {"user_id": 7645, "stars": [], "topic_id": 42657, "date_created": 1311630400.5745089, "message": "Sure, but that would be another story. The growth is just the direction they need to go before they can stay Steadfast or Change. What happens afterword is an afterword.", "group_id": 2515, "id": 1718886}, {"user_id": 10814, "stars": [], "topic_id": 42657, "date_created": 1311631351.2054131, "message": "The analogy I often use is the \"Glass half-empty/glass half-full\" analogy.  Which seems to be the area of development needed:  Get rid of what is there, or fill in the part that is missing?", "group_id": 2515, "id": 1718951}, {"user_id": 35369, "stars": [], "topic_id": 42657, "date_created": 1311633226.9096179, "message": "jim's article here was useful for me in understanding this better: http://storyfanatic.com/articles/story-structure/development-of-character-arc", "group_id": 2515, "id": 1719062}, {"user_id": 38869, "stars": [], "topic_id": 42657, "date_created": 1311851869.126374, "message": "Yeah, you're thinking more in line with change or remaining steadfast. Stop and Start is more thematic in nature, imo, where there's this constant idea that the character needs to stop.\n\nAs Chris mentions, it's more on what your story focuses on. Say, in smallville, you can feel that Clark needs to stop struggling against his true self so he can start becoming superman.\n\nWe do see that he does start becoming superman, but this is only to prove that he really needed to stop (which is the core thing throughout the season).", "group_id": 2515, "id": 1738068}, {"user_id": 10814, "stars": [], "topic_id": 42657, "date_created": 1311874002.981847, "message": "@Kristoffer Yes.\n\nKeep in mind this is about character GROWTH that is need for the character to Change or remain Steadfast.", "group_id": 2515, "id": 1741003}]