[{"user_id": 2392, "stars": [], "topic_id": 8440, "date_created": 1298492865.595753, "message": "hey. I'm a ruby on rails developer, currently working as a PM in outsourcing and building a startup in Russia", "group_id": 4984, "id": 190722}, {"user_id": 3413, "stars": [], "topic_id": 8440, "date_created": 1298492253.3527889, "message": "Just briefly say hello, perhaps give your background/skills, and throw in a funny cat pic if you so choose.", "group_id": 4984, "id": 190625}, {"user_id": 719, "stars": [], "topic_id": 8440, "date_created": 1298493943.7066431, "message": "@benwmax It's got something even better > stars. :)", "group_id": 4984, "id": 190928}, {"user_id": 3413, "stars": [], "topic_id": 8440, "date_created": 1298492375.961307, "message": "I'm a founder with a background in web design (HTML, CSS, light Javascript/PHP, Ajax, etc.). Most adept at using the Adobe Suite and working a room. I owned a web design firm when I was 18 (who hasn't?), and now I'm working on other startups and with Tech Wildcatters in Dallas.", "group_id": 4984, "id": 190644}, {"user_id": 2392, "stars": [], "topic_id": 8440, "date_created": 1298493488.571861, "message": "feeding a bear in spare time http://bit.ly/gM3VVc", "group_id": 4984, "id": 190860}, {"user_id": 2392, "stars": [], "topic_id": 8440, "date_created": 1298494444.571022, "message": "@micrypt yup, however not sure how it works :)", "group_id": 4984, "id": 191025}, {"user_id": 3413, "stars": [{"date_created": 1298494647.153939, "user_id": 3413}], "topic_id": 8440, "date_created": 1298493566.2694011, "message": "@glebe I wish this site had a like button, cause ud be getting one sir", "group_id": 4984, "id": 190870}, {"user_id": 3413, "stars": [], "topic_id": 8440, "date_created": 1298494641.0425301, "message": "@micrypt oh cool, didnt even realize what those were for *durp*", "group_id": 4984, "id": 191075}, {"user_id": 2597, "stars": [], "topic_id": 8440, "date_created": 1298497388.7813339, "message": "hey I am a .NET developer working on an iPhone app for convore", "group_id": 4984, "id": 191486}, {"user_id": 14637, "stars": [], "topic_id": 8440, "date_created": 1298498449.757751, "message": "Hey, I'm the founder and MD of a software dev company with both enterprise and consumer solutions, background is as a founder and MD of an IT services company which I exited, still known get my hands dirty.  Been struggling with graphic designers recently (web) so interested in hooking up with people for a number of current projects...", "group_id": 4984, "id": 191673}, {"user_id": 4935, "stars": [], "topic_id": 8440, "date_created": 1298499271.770695, "message": "I'm a django/javascript/mysql/mssql developer", "group_id": 4984, "id": 191963}, {"user_id": 12775, "stars": [], "topic_id": 8440, "date_created": 1298500829.7486939, "message": "I sit somewhere between the frontend and the backend, which makes me very happy about all of the current developments in the JavaScript space (Backbone.js, node.js, etc).", "group_id": 4984, "id": 192315}, {"user_id": 8224, "stars": [], "topic_id": 8440, "date_created": 1298501428.5479021, "message": "My name is Ben and I'm a generalist.  I try to pick up a bit of everything but mostly doing ruby, js, and c these days.  Learning a bit of clojure but I have yet to have the lisp thing transform my mind.  Graduating from college soon and have not been able to nail down anything solid yet, so while I am unemployed I am working on a project that has something do with with mobile web.  I'll probably post a link to it in a few weeks once i have something that almost works without duct tape.", "group_id": 4984, "id": 192476}, {"user_id": 5711, "stars": [], "topic_id": 8440, "date_created": 1298503815.2067201, "message": "Hey all, good to see so many people here. I’m mainly in to web dev (front end + C# and Ruby) and Cocoa stuff myself. Been following and experimenting with Node recently and I love it.", "group_id": 4984, "id": 193243}, {"user_id": 13980, "stars": [], "topic_id": 8440, "date_created": 1298519320.37691, "message": "Hi! I am a graphic/web guy turned iOS developer. Love working on start-ups and meeting other young entrepreneurs trying to kill it!", "group_id": 4984, "id": 195055}, {"user_id": 11405, "stars": [], "topic_id": 8440, "date_created": 1298530908.6854801, "message": "/me is addicted to django. Settled from Germany to Singapore because Germany sucks for running startups, because Singapore has much better weather and allows me to play Basketball every day and because I can. Will go out and throw some balls now ;)", "group_id": 4984, "id": 195852}, {"user_id": 14637, "stars": [], "topic_id": 8440, "date_created": 1298537082.389818, "message": "@Joshua_Freem thanks always interested in good people, get him to drop me a line by DMing me on Twitter 'at timjoslyn'", "group_id": 4984, "id": 196106}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1298534651.4076409, "message": "Hi! I am a Malware Researcher/Security Consultant/Computer Tech/and a White Hat Ethical Hacker. I am interested in all types of code. I am working on creating a Malware Research Center with a secondary computer repair business that everyone from low income and up can afford.", "group_id": 4984, "id": 195988}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1298536837.1486149, "message": "@timjoslyn I have a friend that is working on a website for me. He is really good at graphics, he is a student at the private college I attend. Let me know if your interested.", "group_id": 4984, "id": 196093}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1298537231.1580451, "message": "@timjoslyn No problem, I will talk to him tomorrow. Its to late right now.", "group_id": 4984, "id": 196116}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1298537813.06042, "message": "Alright sent him an email and will call him in the morning", "group_id": 4984, "id": 196154}, {"user_id": 15255, "stars": [], "topic_id": 8440, "date_created": 1298564495.8106251, "message": "Hello, my name is Alessio and I work as Business Analyst. I am a lot into Python and a bit into R (statistics). I have experience with international pricing and I think that pricing is still too basic in ecommerce. I am here because I'd like to meet ruby and rails developers (which I'm trying to learn by the way), but also to discuss some ideas.", "group_id": 4984, "id": 198751}, {"user_id": 883, "stars": [], "topic_id": 8440, "date_created": 1298578194.559083, "message": "Would love to meet designers, no need to be in Sillicon Valley or LA :). If you rock or know someone that rocks, let's connect.", "group_id": 4984, "id": 201500}, {"user_id": 883, "stars": [], "topic_id": 8440, "date_created": 1298578146.5218949, "message": "Hi folks, I'm a technical founder of a LA startup that's developing a SaaS product in the collaboration space for companies. We're looking for a rockstar UI designer to work with us in designing a sick interface like Convore's.", "group_id": 4984, "id": 201483}, {"user_id": 6310, "stars": [], "topic_id": 8440, "date_created": 1298584725.456404, "message": "Hi! I'm a programmer working with Servers, Android and iOS, mostly multiplayer related things. My current primary programming languages include Python, Java, C++ and Bash. I'm currently working on a relaunch of androidsnippets.com and could use some design help!", "group_id": 4984, "id": 202641}, {"user_id": 14970, "stars": [], "topic_id": 8440, "date_created": 1298612313.9341459, "message": "My programming knowledge is very basic (VB, PHP, Java, Ruby). I left the programming scene awhile back to focus on other parts of my life (football, baseball, fitness) and the technology scene sort of just left me behind. I've done free-lance web development in the best (from crude CMSes to very unrefined e-commerce stores). \n\nI currently work in sales for a technology company and do well there, so my goal is to get prototypes developed and get a business off the ground and follow-through by finding intelligent engineers and 'hackers' (in the good sense) and putting together a dream team.", "group_id": 4984, "id": 206148}, {"user_id": 15148, "stars": [], "topic_id": 8440, "date_created": 1298792629.8971529, "message": "Hi, I've just started up a small web development company. My knowledge of webdesign and web development is very basic as I try to just keep enough knowledge about the technologies, so I can focus on the business-development. I have experience in management and sales, and I will hire technical expertise on project basis. Currently learning wireframing and getting certified in project management.", "group_id": 4984, "id": 216776}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1298872122.7829211, "message": "@tigerstyle I have a friend in web design if you want I give you the info to contact him", "group_id": 4984, "id": 223712}, {"user_id": 15148, "stars": [], "topic_id": 8440, "date_created": 1298970561.8842969, "message": "@Joshua_Freem Please do send me your friends details. I'd like to disucss the opportunities. Please use Twitter for DM my id is \"sukhsingh\". Thanks", "group_id": 4984, "id": 233353}, {"user_id": 14443, "stars": [], "topic_id": 8440, "date_created": 1299061207.3230391, "message": "Will do. I will call him tomorrow to let him know.", "group_id": 4984, "id": 246125}, {"user_id": 15156, "stars": [], "topic_id": 8440, "date_created": 1299704515.2471271, "message": "Hi all! Am a web-developer with 3+ years exp. Have been mostly involved with medium-large scale application developement using PHP/Drupal (custom module developmen),Python/Django and related technologies. Hit me up for any cool gigs ;-)\nskype id: aubede", "group_id": 4984, "id": 308311}, {"user_id": 2067, "stars": [], "topic_id": 8440, "date_created": 1299884268.845691, "message": "I'm a graphic designer/entrepreneur. I am relaunching my design studio with an interesting and unique value proposition to entrepreneurs that allow us to do small investments. If anyone is a talented developer needing help with design, look me up (twitter: @themadray)", "group_id": 4984, "id": 328429}]