[{"user_id": 11626, "stars": [], "topic_id": 42555, "date_created": 1311460420.832231, "message": "Former DEA and CIA Operatives: Los Zetas May Attempt to Overthrow Mexican Government in 2012 (Using U.S. Government Weapons)\r\n\r\nJuly 20, 2011\r\n\r\nLos Zetas use the Alliance Airport in Ft. Worth, Texas -the same airport where the DEA’s Air Operations Center is located- to fly weapons to Columbus, NM., El Paso, and Laredo, TX. to be later smuggled into Mexico. CIA analysts say the weapons, which are purchased from the U.S. Government according to captured Zeta leader Jesus Enrique Rejon Aguilar, aka. El Mamito, are being stockpiled throughout Mexico for a potential upcoming overthrow of the Mexican government in 2012.\r\n\r\n[img]http://deadlinelive.info/wp-content/uploads/2011/07/Los_Zetas_Arms_Smuggling-1024x861.jpg[/img]\r\n\r\nBy Carmen Álvarez\r\nexcelsior.com.mx\r\nTranslated by Mario Andrade\r\nDeadlineLive.info\r\n \r\nMEXICO CITY, July 15 .- Los Zetas use the border crossings of El Paso-Ciudad Juarez and Palomas-Columbus (both locations along the Texas-Chihuahua border) to supply and stockpile military type weapons, which would give them ability to disrupt the 2012 elections, according to the El Paso Times.\r\n\r\n“Many of the weapons have been stored in safe houses. I think Los Zetas are storing them for the upcoming elections of 2012,” said Robert Plumlee, a former CIA pilot who has testified before Congress on drugs and weapons trafficking research.\r\n\r\nThe report is corroborated with an interview with Phil Jordan, former director of the DEA in El Paso, who stated that the stockpiles, which include anti-aircraft missiles, are transported from a Dallas-Fort Worth Airport. The consultant added that the criminals set up (phony) companies to buy weapons directly through a State Department program.\r\n\r\nU.S. analysts warn of narco-attack in 2012\r\n\r\nThe Border Patrol personnel and U.S. intelligence services have recently learned that Los Zetas have been purchasing properties on both sides of the border to store thousands of high-power weapons that were discovered to be part of five or six shipments that left the same airport where the DEA has its air operations center.\r\n\r\nPhil Jordan, former central intelligence operative and director of the DEA office in El Paso, Texas, and a former CIA pilot, Robert Plumlee, said Los Zetas transported the high-power weapons to El Paso-Ciudad Juarez and the Columbus-Palomas border areas to reinforce their troops for battling other cartels and possibly disrupt the 2012 elections in Mexico, El Paso Times reported yesterday.\r\n\r\n“I believe Los Zetas are storing weapons for the election season (2012). They probably want to be included as part of the (new) government, “said Plumlee.\r\n\r\n“The agency responsible for investigating arms trafficking has just confirmed that Los Zetas have been smuggling weapons through this region, and Laredo, which was new to us,” said Diana Washington Valdez from El Paso Times.\r\n\r\nShe mentioned grenades, grenade launchers, antiaircraft missiles, body armor, radios, GPS devices, and night vision binoculars, among other items.\r\n\r\nWashington Valdez reported that Phil Jordan and Robert Plumlee, who has been called to testify in many U.S. congressional investigations, as well as other sources, reported that some of the weapons were purchased in Dallas, Texas, and being sent by plane from a nearby airport in Forth Worth to the Carrillo Fuentes (Juarez) cartel.\r\n\r\n“There is an airport over there is called Lions (Alliance –ed.), but the irony,” said Phil Jordan, “is that there is also a DEA aviation headquarters at the same airport. Who knows how long they have been doing this under the noses of the DEA, because the shipments and the aircraft used by Los Zetas left the same airport,” he added.\r\n\r\nWashington Valdez said Jordan, Plumlee and other sources were consulted for several months when the rumor of the weapons stockpile began, and compared these events to the time when the Revolutionary Armed Forces of Colombia (FARC) not only went to war against the cartels themselves, but also the very government of that country.\r\n\r\n“One of the weapons shipments was found in a warehouse in Juarez, which was later relocated to a ranch on the other side of town, and other weapons were moved to another ranch further deep into Chihuahua,” she said.\r\n\r\nWeapons purchased in the U.S.\r\n\r\nShe also stressed that Jordan and Plumlee, who participated in high-profile operations during the Cuban Revolution and the assassination of President John F. Kennedy, as well as other sources, reported that the stockpiles of weapons are not only held at real estate properties that Los Zetas have purchased on both sides of the border, but in other locations throughout Mexico because it was found that a private company is taking advantage of the Direct Commercial Sales program under the U.S. State Department, which allows businesses to purchase high-power weapons which the U.S. exports worldwide.\r\n\r\n“According to these reports, some Mexican businessmen who took advantage and authorized the use of that mechanism, arranged for these weapons to be delivered to the drug cartels,” she said.\r\n\r\nThe global arms report, Small Arms Survey of 2011, from the Institute for International and Development Studies in Switzerland, said that Mexico was the number one importer in the world of RPG’s, and “under-barrel” grenade launchers, with 1,429 units being imported, followed in second place by Latvia with 250.\r\n\r\nWorld imports of this type of grenade launchers rose to 1,912 units.\r\n\r\nDiana Washington announced that she’s also expecting new revelations from a U.S. federal investigation that took place in the Dallas area, which she will publish in a book.\r\n\r\n“I’m waiting to confirm the details related to this case of weapons trafficking because what is striking is that the weapons were stockpiled and not used in the current war between the drug gangs,” she said.\r\n\r\nRecent U.S. actions against Los Zetas\r\n\r\nBoth U.S. and Mexican authorities are on high alert and coordinating actions against Los Zetas in order to disable or damage their organizational structure.\r\n\r\nOn January 24, 2011, the U.S. embassy in Mexico reported that former Mexican military member Rogelio Lopez, who was trained in that country (Ft. Benning), was recruited by Los Zetas to assassinate former Deputy Attorney General Jose Luis Vasconcelos.\r\n\r\nOn July 3, 2011, the Texas Department of Public Safety (DPS), issued a warning to its citizens with the recommendation not to travel to Nuevo Laredo, Tamaulipas, particularly during that weekend, and especially on July 4, due to a potential threat from Los Zetas.\r\n\r\nOn 4 July, the Federal Police arrested Jesus Enrique Rejon Aguilar, third in the command in the criminal organization known as Los Zetas and allegedly involved in the killing of U.S. agent Jaime Zapata, last February.\r\n\r\nOn July 6, 2011, Jesus Enrique Rejon Aguilar, aka. El Mamito, said the weapons used by that criminal group (Los Zetas) to be used against their opponents are bought in that country (the U.S.) and are even sold to them by the U.S. authorities.\r\n\r\nOn July 11, the Bureau of Alcohol, Tobacco, Firearms and Explosives in the United States (BATFE) announced that firearms dealers will now have to disclose the names of customers who purchase semi-automatic weapons.\r\n\r\nhttp://deadlinelive.info/2011/07/20/former-dea-and-cia-operatives-los-zetas-may-attempt-to-overthrow-mexican-government-in-2012-with-stockpiles-of-u-s-government-supplied-weapons", "group_id": 3920, "id": 1707283}]