[{"user_id": 7479, "stars": [], "topic_id": 46031, "date_created": 1317620676.9292209, "message": "I agree, realMyst's does look good enough, and it's at least worth discussing using the original footage, as one gameplay option", "group_id": 11772, "id": 2265327}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317603099.29071, "message": "Has Cyan publicly acknowledged this project yet, and if so are they in support of it? Would they be open to providing some material from their archives?\n(I assume there will be a copyright issue either way, due to the use of music and other assets from the game, so presumably the rights will have to get cleared up anyway, and use of the videos could be part of that negotiation.)\nAssuming you had access to the source (blue-screen high resolution) videos, would there be technical challenges integrating it into the game?\nWould 59 Volts be prepared to replace their CG models with the original videos if the opportunity came up?\nI don't want to sound like a wide-eyed fanboy asking for way too much. But I think this particular feature would put a lot more credibility on Starry Expanse and make it feel a lot more like Riven was supposed to be. Thoughts?", "group_id": 11772, "id": 2263616}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317602730.877564, "message": "I'm really looking forward to this project, but the one thing I'm not too keen on is replacing the actors with CG models. I hope I don't offend the people who've been working on those models, because they do look pretty great, but I fear they just won't get the same performance as the original actors, which was kind of an important part of the whole game.", "group_id": 11772, "id": 2263589}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317602923.5492029, "message": "I'm wondering if there's any possibility that Starry Expanse could use the footage from the original game. Ideally, Cyan would still have the original blue-screen masters available in high resolution -- if they don't, then I suppose the videos from Riven would not fit the resolution of the new game. Still, I always hoped when they did realRiven that they would be able to use the original footage, and from a technical standpoint, integrating it into the 3D space shouldn't be too hard -- just about every part of the game that uses footage of actors takes place from the player in a fixed position, so you could just lock the camera to a particular spot on the ground during those scenes.\nSo a couple of questions:", "group_id": 11772, "id": 2263601}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317605045.1851449, "message": "Unfortunately, I don't think that there's really any way to integrate video into a realtime scenario and have it look very good. I just haven't seen an example of it being done well.", "group_id": 11772, "id": 2263764}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317605205.357831, "message": "Besides, I seriously doubt Cyan has the original videos in a high enough resolution for them to be very useable, and we don't have the resources to hire actors, get nice cameras, studio lighting, etc etc etc. It's just not feasible for us right now. :-\\", "group_id": 11772, "id": 2263785}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317605293.6340139, "message": "I found myself typing \"on the other hand\", and I don't remember what I was going to say <_< Sorry! I'll post it if I remember.", "group_id": 11772, "id": 2263800}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317606178.9903979, "message": "Would you say realMyst does it well or not? I thought that was pretty reasonable. Granted, all of the footage was either a) people inside a book panel (easy), or b) a guy sitting behind a table when viewed from a fixed position. While Riven actors do walk around a lot more, I do think that all of the important scenes are from a fixed perspective so the same technique would apply. The really dynamic movements are probably the jungle girl and the scribe who runs into the maglev -- those are minor enough roles that CG could be used there. But most of the important dialogue scenes take place with the player behind bars, funnily enough (Cho, Gehn, Catherine) which is probably constrained enough that it would look fine just having high-resolution video as a single billboard in 3D space.\n\nI didn't mean to imply you should film all the scenes again -- that's surely out of the question and it wouldn't be desirable anyway to replace all or most of the actors. All of this is predicated on having the original footage available.\n\nI'd like to think that Cyan would keep the original video masters -- surely you would! Although judging by realMyst it looks like perhaps they didn't since the Atrus footage is new and the Sirrus and Achenar footage is clearly the same video from the original game, not remastered from a higher quality master. But perhaps they had more money and experience when they were making Riven that they were able to keep the original masters. I'd love to find out ;)", "group_id": 11772, "id": 2263893}, {"user_id": 38225, "stars": [], "topic_id": 46031, "date_created": 1317623779.8854129, "message": "Using the original live actors instead of their cg counterparts drastically reduces the amount of freedom the player has over their movement. By using live actors, it means the camera must be perfectly still for long stretches of time while any and all characters are on screen. This means that even though we've been creating expansive real-time environments, the player will be forced to look at the world through the same slide-show format as the original for most of the pivotal scenes in the game. It just seems like a waste.", "group_id": 11772, "id": 2265591}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317625242.7339821, "message": "@Shimmey No no, not at all (although realMyst did so). Look at Myst IV: You do need to freeze the player at a particular point, but you can still give them full freedom of rotation. If the actors are painted on a rectangular billboard some distance from the player, any rotation the player makes in 3D space is accurately adjusted for perspective (with a minor inaccuracy that it assumes the eyeballs are in the centre of the space; in reality there is a small amount of parallax but this can be overlooked in a video game).\n\nImagine being able to turn around 360 degrees in two axes while Gehn is monologing. It would be awesome. Being able to pace around a 50cm-radius cell while he talks? I'd be more than happy to give that up in exchange for John Keston. The rotation is more important than the movement, and you still get that.\n\n(Again -- note that the three most pivotal conversations are Atrus in D'ni, which was good enough in realMyst, and Gehn and Catherine, both of which you can't move at all anyway.)", "group_id": 11772, "id": 2265676}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317625339.244972, "message": "Oh and the final scene by the fissure has no physical reason to constrain the player -- but then I don't know how you would make that work unless you fix the player's feet anyway. If the player wandered off during that scene it wouldn't really work.", "group_id": 11772, "id": 2265681}, {"user_id": 38225, "stars": [], "topic_id": 46031, "date_created": 1317626779.297735, "message": "I found RealMyst's live action Atrus to be a rather jarring break of the illusion, it didn't really fit in with the real time environment. However, considering that was 2000, it's a decent bet we can do a better job of it if we had the resources. This does mean we'd need high resolution versions of those recordings, which for 1997 is a tall order.", "group_id": 11772, "id": 2265771}, {"user_id": 38225, "stars": [], "topic_id": 46031, "date_created": 1317632187.60109, "message": "Another issue would be Gehns long speeches on 233, comprising of multiple separate videos as he walks back and forth. Cutting those clips together, and making sure they move about realistically in 3d space in accordance to the original with a player who can look in any direction is something that I don't think will ever look as smooth or as consistent with the rest of the game as a 3d character would.", "group_id": 11772, "id": 2266034}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317640218.6654401, "message": "Yeah that would be a challenge but it could work. There are other challenges like when Gehn picks up his pipe, or when Nelah places the book, so yes, it's not straightforward. I agree it won't look as smooth or consistent as a 3D character, but so much more emotion I definitely think it'd be worth it (well... depending on how it turns out. I suppose you would need access to the content first and then do a mock-up and see how it works). I'm just picturing Riven with Uru characters and the amount of detail they lost in the characters when they moved to 3D.\n\nI'm intrigued as to whether Cyan has given this project the go-ahead yet. If so, surely it would be possible to ask if they have those videos lying around somewhere. (If not, I'd be worried about what their legal department thinks.)", "group_id": 11772, "id": 2266407}, {"user_id": 38225, "stars": [], "topic_id": 46031, "date_created": 1317640817.378438, "message": "I understand your worry regarding 3d characters and the overall loss of realism and quality when the Myst series went real time. The good news is that we've got a good team, with character artists and animators who are doing their very best to capture the original actors performances as closely as possible.", "group_id": 11772, "id": 2266426}, {"user_id": 41720, "stars": [], "topic_id": 46031, "date_created": 1317650490.258857, "message": "I think I prefer CG models. No matter how good SE looks, we are still going to be able to tell it's a video game, and although using actors will make the characters looks more real, it will also make them seem out-of-place in the CG world. Take away Myst 5's face mapping, and I'll love the CG characters more than the actors.", "group_id": 11772, "id": 2267240}, {"user_id": 41723, "stars": [], "topic_id": 46031, "date_created": 1317652222.1861379, "message": "It'd be interesting to find out whether the high-res footage actually exists. Until it is made certain to exist, there is no real point to the disscussion.", "group_id": 11772, "id": 2267378}, {"user_id": 41816, "stars": [{"date_created": 1317729441.750104, "user_id": 38225}], "topic_id": 46031, "date_created": 1317727407.2334411, "message": "I think it'd be the epitome of badassery in itself if you got actors that looked just like the original actors.", "group_id": 11772, "id": 2274803}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317701706.5919039, "message": "Maybe CG models would be less out-of-place in the CG world. But you are recreating Riven, aren't you? Not making a new game. Riven doesn't have CG models, it has actors. If there are technical limitations on why you can't use actors (and I understand that there may well be), then that's fair enough. But if both choices were fully open (you had infinite resources, full cooperation of Cyan, and they had high-quality archives), surely it would be actors, no question.\n\nBut as @Marein said, there is no point in debating unless the originals exist. Has anybody on this project contacted Cyan at all? I would imagine there are other resources they could supply (if they are willing) that would be valuable, such as high-quality unmixed music and audio, so that you can do a 3D audio mix. (There is a soundtrack, but it is missing some music that exists only pre-mixed with the audio in the game, notably the music during the intro monologue.)", "group_id": 11772, "id": 2273193}, {"user_id": 38225, "stars": [], "topic_id": 46031, "date_created": 1317711703.585506, "message": "The original Riven doesn't have real-time 3d either. Remember we're not creating a duplicate of the 1997 game, we're recreating it with new technology and with that new technology comes new opportunities and challenges. In my mind, the key issue is consistency. In a real-time game world the cg characters fit. It doesn't matter how realistic the actors look, if they are not consistent with the environment around them it only serves to remind the player that they are playing a game - which for a Myst game is something we really want to avoid.\n\nRegarding your other question, while we don't have any new information regarding Cyan and its opinion of the project, we're all still hopeful that we'll be able to share development with them sometime in the future.", "group_id": 11772, "id": 2274048}, {"user_id": 41851, "stars": [], "topic_id": 46031, "date_created": 1317760900.143362, "message": "I dunno, I saw the moiety rebel model that they made and, assuming the animation is on par with the model and all of the character models look as good, then go ahead with the cg models. That would be one thing that would make it unique versus the original game and I think it would be cool.", "group_id": 11772, "id": 2279310}, {"user_id": 41709, "stars": [], "topic_id": 46031, "date_created": 1317764331.985996, "message": "I agree. Real actors in a CG environment would just look out or place.", "group_id": 11772, "id": 2279681}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317771898.1677949, "message": "Ideally, we'd be able to offer the choice between actors and CG, but without those high-quality videos, it's just not feasible.", "group_id": 11772, "id": 2280397}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317775055.041393, "message": "@deep_thought I think the moiety rebel model is a bad example. Yes it looks cool, but it has no face. The faces are the important thing that it's nearly impossible for a CG model to get right. A more important test will be the Atrus, Catherine and Gehn models. See Atrus: http://www.starryexpanse.com/wp-content/uploads/2011/03/atrus.png\nEven there, he is wearing goggles so we can't really tell what his face would look like, but I doubt it will look as much like Rand Miller as Rand Miller.\n\n@Shimmey I don't see why actors don't fit into a real-time CG game, but they do fit into a pre-rendered CG game. If you fix the player's position, then a real-time game is the same as a pre-rendered game from a visual perspective, isn't it?", "group_id": 11772, "id": 2280719}, {"user_id": 41720, "stars": [], "topic_id": 46031, "date_created": 1317778171.8616531, "message": "@mgiuca I think that the real actors look out-of-place in the Myst games, even in Myst 4.", "group_id": 11772, "id": 2281093}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317780246.0979691, "message": "@mgiuca Also keep in mind that almost everything we post on the site is a work-in-progress, including that Atrus model. We have some really great artists and animators, and we're willing to put in the time and effort required to make these models look right.", "group_id": 11772, "id": 2281352}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317780362.9370379, "message": "Yep, I apologise if I implied that that was supposed to be finished work. I'm skeptical that _any_ modeler/animator can make a CG face look as realistic as an actual human, especially a human that we already know well from the other games. But I'm still excited to see what the finished product looks like.", "group_id": 11772, "id": 2281375}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317780385.7336631, "message": "Admittedly, CG models will probably never look as good as video can, but I can pretty much guarantee that Cyan doesn't have the original un-edited video in high enough quality for us to make use of it. Beyond that, it's very different going from pre-rendered with video integrated to realtime with video integrated, because of interaction between the actors and in-game objects (levers, books, etc). How do you transition smoothly between the prop in the video and the realtime object? It's unlikely that it will look very good.", "group_id": 11772, "id": 2281379}, {"user_id": 7523, "stars": [], "topic_id": 46031, "date_created": 1317848797.192302, "message": "This is also very true.", "group_id": 11772, "id": 2287106}, {"user_id": 41710, "stars": [{"date_created": 1317883910.4327569, "user_id": 41763}], "topic_id": 46031, "date_created": 1317848673.8490529, "message": "There's also the overlooked fact that integrating prerendered video (including live action) with a changing day/night and weather cycle would be *very nearly* impossible.", "group_id": 11772, "id": 2287088}, {"user_id": 41763, "stars": [], "topic_id": 46031, "date_created": 1317883931.8246369, "message": "Good point.", "group_id": 11772, "id": 2290390}, {"user_id": 7479, "stars": [], "topic_id": 46031, "date_created": 1317889457.344413, "message": "It's raining. \"The portal combination's in my journal. Good luck.\" *Catherine whips out umbrella*", "group_id": 11772, "id": 2290592}, {"user_id": 41709, "stars": [], "topic_id": 46031, "date_created": 1317942986.665899, "message": "By the way, be sure it doesn't look like the rain in going through people. :)", "group_id": 11772, "id": 2295469}, {"user_id": 41709, "stars": [], "topic_id": 46031, "date_created": 1317942961.3250239, "message": "Why? Catherine's a rugged rivenese! She doesn't need an umbrella.", "group_id": 11772, "id": 2295465}]