[{"user_id": 29444, "stars": [], "topic_id": 19324, "date_created": 1302743939.3619151, "message": "Personally, I would have to go with iPhone, seeing I own an iPhone 4!", "group_id": 142, "id": 675202}, {"user_id": 18745, "stars": [{"date_created": 1303009300.7339339, "user_id": 9108}], "topic_id": 19324, "date_created": 1302793707.0551119, "message": "It all depends on your needs for a phone.  My wife has an iPhone 4 and it is a great mobile entertainment system for the kids.  I own a BlackBerry Torch and while I have videos and games on it, it's primarly a business tool for me.  I've played with Android's but have not owned one yet.  I still prefer my BlackBerry over the iPhone for communication purposes and the BlackBerry has an awesome notification alert system.  Anyone can pickup and iPhone and use it.  I don't feel that BlackBerry's and Android's are as simple to use as an iPhone.", "group_id": 142, "id": 686144}, {"user_id": 11588, "stars": [], "topic_id": 19324, "date_created": 1302809446.9805901, "message": "...there's also the WP7 phone, which is pretty nice. I think the UI is better than Android, by far, and feels more modern than iPhone.", "group_id": 142, "id": 689223}, {"user_id": 25528, "stars": [], "topic_id": 19324, "date_created": 1302888691.6870999, "message": "have iPhone, got Galaxy S from a friend for 1 week => dumping iOS for a galaxy s2 in may. in my opinion: iOS for normals, android for geeks. WP7 it's coming fast, and it will own next year when nokia will start making windows phones.", "group_id": 142, "id": 703009}, {"user_id": 26196, "stars": [], "topic_id": 19324, "date_created": 1302965936.6009829, "message": "I prefer working with an iPhone, however it really depends on personal preference. My wife has the new HTC Thunderbolt and that's a pretty decent phone, but she runs into more errors, spam, and battery drain. iOS is a closed system, so less prone to any of that, however, you also lose flexibility. Go check out both in a store to get a feel on what you like.", "group_id": 142, "id": 711067}, {"user_id": 9108, "stars": [], "topic_id": 19324, "date_created": 1303009380.483428, "message": "I'm on a BlackBerry and I've been a long-time BB user. Last November I jumped ship and moved to Android with the Evo 4G. After owning it for a few months I decided to go back to BlackBerry. While Android is a great OS and the Evo is a powerhouse, I mainly use my phone for messaging. The awesome BB notifications and the top-notch physical keyboard make a world of difference to me (plus I just suck at typing on a touchscreen.) I've had a lot of interest in Windows Phone 7, though.", "group_id": 142, "id": 715174}, {"user_id": 28907, "stars": [], "topic_id": 19324, "date_created": 1303103234.5978401, "message": "ios  and   android ，just like  ,no why .   btw,my english is poor.", "group_id": 142, "id": 722310}, {"user_id": 4218, "stars": [], "topic_id": 19324, "date_created": 1304860195.5189271, "message": "former blackberry user for years who made the switch to android for the last 2 years...android's flexibility and web experience just too good to leave. wife is a iphone user after trying android/BB. She didnt quite get comfortable with her Android/ or BB but instantly took to the iphone..So it really comes down to personal taste.", "group_id": 142, "id": 957596}, {"user_id": 20319, "stars": [], "topic_id": 19324, "date_created": 1304907276.41715, "message": "If you count out Apps, android and Blackberry are better choices than iPhone. However, iPhone has such an emphasis on apps that they play a larger role and are of higher quality. I'm not sure I'd ever go beyond iOS at this point for that reason.", "group_id": 142, "id": 964440}, {"user_id": 32999, "stars": [], "topic_id": 19324, "date_created": 1305166144.0490849, "message": "@tikishark yeah，iPhone is great. Android is not strong enough", "group_id": 142, "id": 1017457}, {"user_id": 33613, "stars": [], "topic_id": 19324, "date_created": 1305718327.2792931, "message": "Personally tried blackberry and i am loving it because of the bbm but hating the fact that the battery can't support it's complexity.At the same time I bought a nokia n900 im still loving the openness of it but hated nokia for dumping its support into it but I'm keeping it no matter what. Now I acquired an iPhone 4 which I am juggling in between blackberry since I have not established my iPhone friends yet :)", "group_id": 142, "id": 1096168}, {"user_id": 31527, "stars": [], "topic_id": 19324, "date_created": 1305814239.3787899, "message": "Android since i can sync it with all my data on Google and IOS for its usability", "group_id": 142, "id": 1111485}, {"user_id": 28684, "stars": [], "topic_id": 19324, "date_created": 1305813953.7924631, "message": "Android has a real GPSa and Iphone or BB doesn't", "group_id": 142, "id": 1111438}, {"user_id": 9108, "stars": [], "topic_id": 19324, "date_created": 1305946340.971894, "message": "@iamU1 If you are disappointed by battery life in a BlackBerry, then I caution you to stay away from Android for awhile. I moved from BB to Android, and then back again because my HTC Evo's battery life was just terrible. My phone was running on fumes by lunchtime on a daily basis. That being said, while jumps in processor, GPU, etc. for phones is great, someone really needs to improve batteries. That whole area has simply lagged behind.", "group_id": 142, "id": 1131976}, {"user_id": 31527, "stars": [{"date_created": 1307656955.795485, "user_id": 35837}, {"date_created": 1307952072.2013421, "user_id": 35563}], "topic_id": 19324, "date_created": 1305981457.3035669, "message": "@JohnFail I am pretty satisfied with my HTC Wildfire and his battery life", "group_id": 142, "id": 1133693}, {"user_id": 9108, "stars": [], "topic_id": 19324, "date_created": 1305991368.108155, "message": "@dadica How long can you usually go on a charge? It's also important to note that the specs on it are pretty low (3.2\" screen, 528 Mhz processor), so it isn't likely to be pulling at the battery quite so hard. GSM devices tend to be a little more battery-friendly as well.", "group_id": 142, "id": 1134502}, {"user_id": 31527, "stars": [], "topic_id": 19324, "date_created": 1306050997.725287, "message": "@JohnFail It is usually day and a half at most usage with WiFi and couple always running apps. I agree that specs are now awesome, but it fits my requirements. I'm not asking for pro camera with bunch of mpxs and huge screen.", "group_id": 142, "id": 1140421}, {"user_id": 9108, "stars": [], "topic_id": 19324, "date_created": 1306071171.970089, "message": "@dadica That's pretty awesome. I think that like the OS, the model of phone is all about what you need. If you don't need the huge specs, there is no reason to get a really high-end phone that will die on you in a few hours.", "group_id": 142, "id": 1141829}, {"user_id": 35826, "stars": [], "topic_id": 19324, "date_created": 1307649419.244885, "message": "I like the blackberry for some reason anybody else", "group_id": 142, "id": 1353076}, {"user_id": 9108, "stars": [], "topic_id": 19324, "date_created": 1307659061.338263, "message": "@XxAustinxX I'm with you. It does a lot of things wrong, but the keyboard is what gets me. I have yet to find a phone with a physical QWERTY that can compare. I'm tempted to look into the HTC Arrive since I've heard pretty good things about it.", "group_id": 142, "id": 1355139}, {"user_id": 38290, "stars": [], "topic_id": 19324, "date_created": 1311034839.015605, "message": "I love my iPhone but seriously..This phone would be nothing without this application..http:/smartmouthmobile.com", "group_id": 142, "id": 1667712}, {"user_id": 36133, "stars": [], "topic_id": 19324, "date_created": 1311423864.1007309, "message": "I have an iPhone4 and a wp7 and I keep finding reasons not to use the iPhone. It feels far less advanced and messaging is so much better on wp7", "group_id": 142, "id": 1705465}, {"user_id": 42726, "stars": [], "topic_id": 19324, "date_created": 1319573079.539844, "message": "I'm on an iPod touch right now, but I'd much rather have an Android.", "group_id": 142, "id": 2432035}]