[{"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317314789.2795529, "message": "The end of the Dinner Game analysis turned into a discussion of which genres can get away with being less than a GAS. I want to flip that on its head, and ask, \"Which horrors are complete stories?\"\n\nHorror is a broad genre. We don't need to exclude anything because it might not be a horror.", "group_id": 2515, "id": 2242021}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317314840.841928, "message": "Oh, and, of course, we can't know if anything is or isn't a GAS at this point -- this is a thread for educated guesses.", "group_id": 2515, "id": 2242029}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317314816.86818, "message": "Here is a gimme: Silence of the Lambs.", "group_id": 2515, "id": 2242024}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317325278.519541, "message": "I've got to think about this one - I've seen way too many so it's more a process of going through the roller deck in my brain.  The Exorcist.  I don't know if The Fly qualifies (the 1986 version) - it's been a while since I've seen it, but it seems any of those types of \"science gone awry\" could potentially be used.   The Sixth Sense.  \n\nAnd let us not forget perhaps the greatest horror movie title of all times:  Children Shouldn't Play With Dead Things.  Ok, ok, maybe not really an argument there, but great title.  Hard to believe Bob Clark went on to make Black Christmas, Porky's, AND A Christmas Story.", "group_id": 2515, "id": 2243482}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317336054.6868761, "message": "@JBarker Holy crap that's a great title.", "group_id": 2515, "id": 2244502}, {"user_id": 37586, "stars": [], "topic_id": 45932, "date_created": 1317335088.9840519, "message": "The Wolfman (2010)   @MikeDerk  Funny I was going to put this to you today.  This movie is NOT a GAS.  I would love to hear others thoughts on this.  Nothing is resolved in the personal story that is satisfying.  The relationship story left me flat.  I did like Sir Anthony Hopkins as the (my opinion) the impact character.  The love story was dialed way down.  All they were left with were some ok affects and overall story with some action.  I would have gone Coppola on this story and made it as sexy as Bram Stoker's DRACULA (1992) Has anyone else tried to do a story form on this horror movie?", "group_id": 2515, "id": 2244435}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317336038.972074, "message": "I've never seen it. It never appealed to me, and now it does even less!", "group_id": 2515, "id": 2244501}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317338951.9882319, "message": "Cheesy horror film, though.  I remember watching it when I was little (I think it was made in 1972) and it freaked me out.  About 10 years ago, it came out on VHS (clamshell box!) and I was like, huh?  The scariest thing might be the clothing they're wearing.  It's totally bizzaro, but I particularly remember the last 10 minutes or so when the dead came out of their graves.  Here's the trailer (don't say I didn't warn you): http://www.youtube.com/watch?v=i5UQigacQ3o", "group_id": 2515, "id": 2244812}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317340411.969949, "message": "Fritz Lang's \"M\", considered to be the granddaddy of serial killer movies, might qualify as a GAS.", "group_id": 2515, "id": 2244949}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317348770.0464101, "message": "I'll add that to my queue.", "group_id": 2515, "id": 2245767}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317349850.3991089, "message": "\"M\" is more psychological thriller, but the context of the story, child murders, puts it into the realm of horror.  First talkie movie, too, but very well done and still holds up after all these years.", "group_id": 2515, "id": 2245870}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317403241.2953849, "message": "My brain is struggling.  Perhaps because I tend to think of movies with having storyforms as being generally critically successful.  When thinking of Horror, there's a fairly short list of movies that really fit that bill (allmovie.com used to have a good list, but they've changed their format/name and it's no longer available).  \n\nI'm wondering if Rosemary's Baby would have an argument in it.  Clearly the main character changes at the end; it's her baby and she's going to raise it (and hell if necessary!).", "group_id": 2515, "id": 2249610}, {"user_id": 7645, "stars": [], "topic_id": 45932, "date_created": 1317409993.105516, "message": "It is one of the example files.", "group_id": 2515, "id": 2250273}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317415375.392231, "message": "Ah, see! Need to get the software.", "group_id": 2515, "id": 2250707}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317423267.7028961, "message": "I tend to think that GAS = Success, too, but Halloween? No way. The Thing? Doubtful.", "group_id": 2515, "id": 2251316}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317425240.073256, "message": "Night of the Living Dead crossed my mind a few minutes ago:  the cellar is safer!  No it's not!  Up here we have a fighting chance!  I remember my mother watching that a long time ago, then when the guy gets shot in the end, she muttered \"stupid\".  \n\nShe still doesn't get irony.", "group_id": 2515, "id": 2251478}, {"user_id": 7645, "stars": [], "topic_id": 45932, "date_created": 1317436115.6224079, "message": "All example files are online. But yeah, you need to get the software!", "group_id": 2515, "id": 2252519}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317440809.0113871, "message": "There was a time when I thought every horror script should have the scene where they go into the cellar, metaphorically. The worst place has to seem like the right choice.", "group_id": 2515, "id": 2252802}, {"user_id": 37586, "stars": [], "topic_id": 45932, "date_created": 1317483915.0832291, "message": "Could all stories have at least a Lajos Egri argument? ie. \"Foolishness leads to death.\"", "group_id": 2515, "id": 2254975}, {"user_id": 37586, "stars": [], "topic_id": 45932, "date_created": 1317486446.7762799, "message": "@JBarker sounds interesting do u recommend it?", "group_id": 2515, "id": 2255167}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317485996.5088389, "message": "@sam_potter I think that would qualify for a lot of the cheesy horror from the 80's.  Movies where characters do stupid things to advance the plot only (you know, where the audience yells \"don't go in there!\" and there's no compelling reason for the character to do so other than to get to the next scare or whatever (unless you mean something completely different by foolishness).  \n\nOn a different note, I think a movie like The Innocents (Turn of the Screw) would be hard to nail down because it's open ended - is it a ghost story where the ghosts are impacting the children?  Or is the nanny the antagonist, forcing her beliefs onto the children?   The story never makes an argument for one or the other: it's up to the audience to decide.", "group_id": 2515, "id": 2255119}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317488656.397306, "message": "The Innocents?  Absolutely.  It's just more gothic/classic feeling and atmospheric.  The Jack Clayton adaptation from 1961 is excellent and very highly regarded by critics (here's the link from allrovi.com:  http://www.allrovi.com/movies/movie/the-innocents-v96596).  Truman Capote was one of the screenwriters.  Here's the rottentomatoes.com link, too:  http://www.rottentomatoes.com/m/1099622-innocents/", "group_id": 2515, "id": 2255340}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317501985.4159911, "message": "@sam_potter I guess. \n\nWhen you put it that way, you are creating a weird hierarchy of \"story solidness,\" I think.\n\nAt the top, the hardest bar to get over would be a GAS. \n\nAt the bottom would be a senseless fairy tale (Jorinda & Joringel, anyone?). \n\nIn the middle would be something that puts forward a Premise, but doesn't argue the why or the counterargument?\n\nMaybe I'm reading into what you are saying?\n\nI'll go to the classic horror story of \"Little Red Riding Hood.\" Little girl goes into a dark place, announces to the forces of evil that she is going to be out of earshot in a bit (grandma's house) and then gets seduced by something trying to kill her, and is saved (deus ex machina) by the woodsman. Does this have an Egri Premise?\n\nTrust leads to flirting with death, maybe?", "group_id": 2515, "id": 2256417}, {"user_id": 37586, "stars": [], "topic_id": 45932, "date_created": 1317514671.320148, "message": "@MikeDerk or \"listen to your mother\" Egri version could be \"innocence leads to vulnerability\" but I agree with your hierarchy. DP takes it so much further and specific. I am playing with idea of taking a tale like little red riding hood or jack and the bean stalk and putting a random storyform on it and see if you could still tell the overall story..", "group_id": 2515, "id": 2257461}, {"user_id": 33839, "stars": [], "topic_id": 45932, "date_created": 1317559887.266319, "message": "I have to say, I've seen The Innocents a number of times (have it on DVD) and decided to watch it again last night because I brought it up here.  I'm used to watching it on a 50\" tv, but last night, I watched it on my laptop in the bedroom... in the dark... with ear buds.  \n\nWhat a HUGE difference.  That has to be one of the best sounding films in terms of sound design (perhaps because it IS horror); there were so many things I was picking up I had never heard before via television.  It really added a whole new level of appreciation for the film and I felt like I was rediscovering it all over again for the first time.", "group_id": 2515, "id": 2260139}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317563019.96403, "message": "His thoughts on Premise I like, but the first thing I noticed when reading the DP book was that they took the Hamlet premise and skewered it... which sold me.", "group_id": 2515, "id": 2260288}, {"user_id": 7664, "stars": [], "topic_id": 45932, "date_created": 1317562948.057651, "message": "@sam_potter I have to admit that Egri's book frustrated me a lot. I think it's good and all, but take the chapter on \"necessary scenes\". He says everything is necessary. Uh, thanks Lajos. That makes it all easier.", "group_id": 2515, "id": 2260283}]