[{"user_id": 38285, "stars": [], "topic_id": 45823, "date_created": 1317144846.8969369, "message": "Four Throughlines Themes-report says: \"In fact, the MC's lack of Self Aware is what gets him into trouble. In addition, this imbalance causes trouble for everyone else as well.\"", "group_id": 2515, "id": 2226359}, {"user_id": 38285, "stars": [], "topic_id": 45823, "date_created": 1317144998.6041329, "message": "This is a Steadfast story, so the OS Problem is not the same as the MC Problem. So what exactly is all this talk about MC Problem causing trouble for everyone? Isn't the OS Problem supposed to be the source of OS Problems?", "group_id": 2515, "id": 2226370}, {"user_id": 38285, "stars": [], "topic_id": 45823, "date_created": 1317145090.583468, "message": "I only recently started looking into the reports so I'm a bit bewildered about the stuff they say.", "group_id": 2515, "id": 2226378}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317163417.354182, "message": "Maybe it's saying that the imbalance in the world of your story shows up as Self-Aware for the MC and differently for the others. It's the same imbalance, but it's \"unnamed\".\n\nI believe Melanie pointed out once that \"The Tao you can talk about is not the true Tao.\"", "group_id": 2515, "id": 2228165}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317163421.006948, "message": "??", "group_id": 2515, "id": 2228167}, {"user_id": 38285, "stars": [], "topic_id": 45823, "date_created": 1317212522.6341901, "message": "Not sure what you mean. Can you elaborate a bit?", "group_id": 2515, "id": 2231970}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317227163.7248321, "message": "I mean, maybe the imbalance the paragraph is referencing isn't \"self-aware\" but a deeper one that expresses as \"self aware\" in the MC Throughline. In a GAS there is only one element out if whack, but the storyform shows at least two different Problems. Why? Because that problem is an expression of the deeper, unnamed, invisible inequity.", "group_id": 2515, "id": 2233430}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317227190.254508, "message": "I'm not sure that is anywhere near correct, btw.", "group_id": 2515, "id": 2233436}, {"user_id": 7645, "stars": [], "topic_id": 45823, "date_created": 1317229306.2050321, "message": "The problem with the reports is that they're trying to take a one-size fits all approach to something that can't be always accurately described within one context. I think you'll understand your story more by investing your time in the Usage/Context/Theory buttons in the DQS, the Theory Book, asking questions here etc. rather than trying to follow the reports explicitly. You are correct that the OS Problem is supposed to be the source of the OS Problems. I guess I'm saying I wouldn't worry so much about following the reports. The only one I ever use is the Story Engine Settings.", "group_id": 2515, "id": 2233732}, {"user_id": 7645, "stars": [], "topic_id": 45823, "date_created": 1317234882.9015279, "message": "Truthfully I hadn't read it yet...now that I have, I still wouldn't know how to comment. My point was just that the reports are basically fill in the blanks templates - they just grab the info and plop them into sentences. I'm pretty sure there aren't complicated algorithms behind the construction of the reports themselves - in other words, they aren't adjusting depending on whether the storyform is a Change or Steadfast MC. That's always been my impression.", "group_id": 2515, "id": 2234572}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317234608.9875281, "message": "@jimhull Are you saying I'm contorting myself too much to make sense of the report for Ville?", "group_id": 2515, "id": 2234546}, {"user_id": 37586, "stars": [], "topic_id": 45823, "date_created": 1317265990.2301979, "message": "@MikeDerk  I'd say your problem is morality. <g>  (and what does <g> mean anyway?)", "group_id": 2515, "id": 2238059}, {"user_id": 7664, "stars": [], "topic_id": 45823, "date_created": 1317273569.800024, "message": "That I'm trying to help others too much, and I'm really just screwing things up? Sounds about right.", "group_id": 2515, "id": 2238604}, {"user_id": 36525, "stars": [], "topic_id": 45823, "date_created": 1317346241.7485509, "message": "Here is the equivalent information from an IC report, for comparison: \"In summary, Crazy Villain (IC)'s primary Concern is a situation or environment regarding The Present.  More specifically, he impacts the balance between Repulsion and Attraction.  His primary influence is focused on Repulsion As a result, issues regarding Attraction arise.  As Crazy Villain (IC)'s impact grows, it tips the balance between Repulsion and Attraction in the eyes of the other characters.  Affecting his impact are his drive regarding Reaction and his satisfaction with Proaction.\"  Note the part about 'in the eyes of the other characters'.", "group_id": 2515, "id": 2245523}, {"user_id": 36525, "stars": [], "topic_id": 45823, "date_created": 1317345734.334156, "message": "I looked at a couple of reports I have sitting around from previous projects and every MC report contains this phrase.  So my interpretation is that the MC's problems cause problems for everyone, period.  Problems are contagious like that, and it would violate some principle of unity if the MC's problems were separate from the rest of the characters.", "group_id": 2515, "id": 2245475}, {"user_id": 38285, "stars": [], "topic_id": 45823, "date_created": 1317833323.5393441, "message": "The reports do adjust depending on other dynamics, so I'm a bit puzzled why they wouldn't adjust depending on the Resolve. However, I'm not ready to discard the reports yet. I like the thematic discrepancies in the Plot Sequence report.", "group_id": 2515, "id": 2285552}]