[{"user_id": 22946, "stars": [], "topic_id": 46941, "date_created": 1319373994.392807, "message": "Welcome Healthy Herbies! I hope you enjoy this forum as a way to meet others, motivate and find support! We're all cheering for you!", "group_id": 11977, "id": 2412781}, {"user_id": 42617, "stars": [], "topic_id": 46941, "date_created": 1319377935.150974, "message": "Look forward to this group. Love your book, have told friends and family about it, more and more are coming on board to a plant based diet. This morning I made the African Potato and Kale soup, and the Red Lentil Dal. Have your tofu scramble already in the fridge. I'm ready for a delicious week! Thanks again!!", "group_id": 11977, "id": 2413092}, {"user_id": 42622, "stars": [], "topic_id": 46941, "date_created": 1319380785.3405161, "message": "Just ordered my book and went shopping for this weeks adventure. I'm super", "group_id": 11977, "id": 2413327}, {"user_id": 42622, "stars": [], "topic_id": 46941, "date_created": 1319380822.0193231, "message": "excited to meet all of you and stay motivated.", "group_id": 11977, "id": 2413328}, {"user_id": 22946, "stars": [], "topic_id": 46941, "date_created": 1319382612.2559879, "message": "@lorriek496 thanks so much!! enjoy your delicious week!", "group_id": 11977, "id": 2413429}, {"user_id": 42630, "stars": [], "topic_id": 46941, "date_created": 1319391953.931495, "message": "So excited to be here!  Thanks Lindsay for all that you do, you are amazing!", "group_id": 11977, "id": 2414265}, {"user_id": 22946, "stars": [], "topic_id": 46941, "date_created": 1319407784.542628, "message": "glad you're all enjoying and excited about the plan!", "group_id": 11977, "id": 2415824}, {"user_id": 42635, "stars": [], "topic_id": 46941, "date_created": 1319398279.0874331, "message": "I am so excited for this plan.  I made the banana split smoothie for breakfast and the Hummus Wrap with Sweet Potato soup for lunch...so freaking good!  I love the fact that I don't have to worry about a ton a leftovers because I cook for myself only, so it makes my life so much easier :)", "group_id": 11977, "id": 2414803}, {"user_id": 42639, "stars": [], "topic_id": 46941, "date_created": 1319401464.4322829, "message": "I'm really really excited too ^^ I'll officially start tomorrow morning with a nice anti-influenza smoothie : fruits, carots, ginger and goji !! i gotta get some spinach too to make the green goddess !!!", "group_id": 11977, "id": 2415147}, {"user_id": 42791, "stars": [], "topic_id": 46941, "date_created": 1319638395.3644509, "message": "I've purchased your first book.  I look forward to the second, and I have downloaded the first three weeks of meal plans.  I have to admit that I am more of a reader than a doer at this point.  I am reading lots of books right now.  I tend to read cookbooks like literature and then I throw things together based on things I remember about what I have read.  But I will definitely try some of your recipes all the way through just as you have written them.  I really like the idea of being able to cook for one because my husband isn't entirely onboard with plant based eating yet.  I went to Whole Foods yesterday and before I left I told my husband I was going to bring home something special.  I had soy yogurt in mind, but he asked, \"Will it be meat?\"  He's been pretty patient so I made him a pork chop last night.  But I am trying really hard to find things that are plant based that he will enjoy.  Keep up the good work, and I look forward to learning from everyone here on the site.", "group_id": 11977, "id": 2438208}, {"user_id": 42844, "stars": [], "topic_id": 46941, "date_created": 1319736994.1643, "message": "I bought Happy Herbivore a couple months ago & was just so overwhelmed w/ the possibilities that I hadn't tried anything. I am excited about your meal plans because they make trying so much easier!", "group_id": 11977, "id": 2447341}, {"user_id": 42630, "stars": [], "topic_id": 46941, "date_created": 1320194143.60551, "message": "those meal plans are awesome.", "group_id": 11977, "id": 2487962}, {"user_id": 43054, "stars": [], "topic_id": 46941, "date_created": 1320288527.9841969, "message": "I'm loving the meal plans!", "group_id": 11977, "id": 2496525}, {"user_id": 42617, "stars": [], "topic_id": 46941, "date_created": 1320503859.9961309, "message": "What about food for our pets? I originally became vegan 3years ago d/t animal compassion with the horrors of factory farms. But my dog food and cat food is full of animal products.  Anyone have any comments?", "group_id": 11977, "id": 2511796}, {"user_id": 43342, "stars": [], "topic_id": 46941, "date_created": 1320934596.4195089, "message": "Hello  I am new here.  I tried to go vegan last year Aug after reading the book reversing diabetes by Dr. Neil Bernard.  I had lost weight and was seeing a difference in my blood sugar levels, but gave it up as it was hard to find recipes, they made too much food for one and then I would not like it.  My family at that time was supportive and said they would eat what I made.  That lasted 2 weeks.  (I live with my mom, son, and husband)  My mom and son decided no way!  they wanted meat!  My husband bless his heart will eat whatever I cook.  Plus he is good about looking up recipe ideas to try.  Needless to say I gave up.  Now my blood sugar is out of control again, my A1C test keeps going up and I just need to decide to make this work!  I ran across the Happy Herbivore cookbook through amazon.  Sounded like a good one to try as it does not have all the ingredients I don't have access too unless I want to drive an hour and a half.  I am in hopes this meal plan will work because the portions are smaller, and I don't have to hunt and search and try to figure out two meals to prepare. (one for me and one for them)  So here it is to starting over and really hoping this time to succeed!", "group_id": 11977, "id": 2546124}, {"user_id": 43418, "stars": [], "topic_id": 46941, "date_created": 1321076773.6413729, "message": "@lorriek496  Check out the Simple Little Vegan Dog Book.  ;)", "group_id": 11977, "id": 2557610}, {"user_id": 42617, "stars": [], "topic_id": 46941, "date_created": 1321102679.4411991, "message": "@funniestmama I will do that, thanks so much!", "group_id": 11977, "id": 2558799}]