[{"user_id": 33502, "stars": [{"date_created": 1305770390.083873, "user_id": 19715}], "topic_id": 35603, "date_created": 1305609889.8517361, "message": "Guys I am building a site and its nearly complete. The problem is should I have a sign up / login system, or just facebook connect, or both??\n\nI want to keep people from trolling the comments, the site is a video site similar to youtube, we use their api. \n\nYouTube problem is that there is way too much crap on the comments section. If i use Facebook connect I can keep the bad comments away. \n\nThe other thing is I am thinking of adding Facebook comments, the system already has comments but i was going to replace this with facebook comments. So there would be facebook connect + comments. The problem is then tieing notifications when people post on facebook comments to the internal notification system. hmmmmm", "group_id": 250, "id": 1079176}, {"user_id": 15929, "stars": [], "topic_id": 35603, "date_created": 1305612879.1176729, "message": "if you're using YouTube API, why not just use google's oauth?", "group_id": 250, "id": 1079398}, {"user_id": 31125, "stars": [], "topic_id": 35603, "date_created": 1305619963.8709149, "message": "you can implement both :) and add twitter to the lot...", "group_id": 250, "id": 1080081}, {"user_id": 30354, "stars": [], "topic_id": 35603, "date_created": 1305634114.600543, "message": "I'd use Facebook if you're worried about there being too much crap. People don't like to be a**holes when other people can see who they are!", "group_id": 250, "id": 1081698}, {"user_id": 14894, "stars": [{"date_created": 1323792991.769978, "user_id": 2732}], "topic_id": 35603, "date_created": 1305737860.5877941, "message": "I don't know what your business model is but it seems to me like you're giving away some valuable data about your users if you use Facebook comments.  I agree with the Facebook connect thing, as I'm building something that users will have to login using a social site handle but when they want premium services they'll need to create an actual account on the site with an email address.", "group_id": 250, "id": 1100201}, {"user_id": 16152, "stars": [], "topic_id": 35603, "date_created": 1305869991.4845891, "message": "You can go for both. :)", "group_id": 250, "id": 1120956}, {"user_id": 14475, "stars": [{"date_created": 1306410337.9492199, "user_id": 34351}], "topic_id": 35603, "date_created": 1306308226.082525, "message": "Im using a signup form and it working well so far http://www.createabusiness.net/winningsauce.html can anyone tell me the benefits of added facebook connect?\\", "group_id": 250, "id": 1175395}, {"user_id": 14475, "stars": [], "topic_id": 35603, "date_created": 1306309810.6458571, "message": "anyone know of good auto responder service to use for opt in email sign ups?", "group_id": 250, "id": 1175529}, {"user_id": 14475, "stars": [], "topic_id": 35603, "date_created": 1306307325.8339441, "message": "hey guys I would love for your feedback about my site http://bit.ly/winningsauce", "group_id": 250, "id": 1175297}, {"user_id": 14894, "stars": [], "topic_id": 35603, "date_created": 1306418439.3270149, "message": "Use Mail Chimp", "group_id": 250, "id": 1191963}, {"user_id": 20138, "stars": [{"date_created": 1309726881.9739611, "user_id": 25063}], "topic_id": 35603, "date_created": 1309586488.7923059, "message": "I hate it when I am forced to use a third party authetication method such as facebook connect. Have all you developers who refuse to code a signup mechanism gone mad in accepting the reality of M Zuckerberg? Are you simply lazy?  Heck no am I goibg to authenticate into your service via a side road.", "group_id": 250, "id": 1547100}, {"user_id": 12461, "stars": [{"date_created": 1311072326.9432111, "user_id": 13735}], "topic_id": 35603, "date_created": 1309853049.264631, "message": "The main benefit of using Facebook Connect is having access to the user's information. That's why Google is using FB Connect on one of it's new sites: http://prizes.org", "group_id": 250, "id": 1565589}, {"user_id": 13735, "stars": [], "topic_id": 35603, "date_created": 1311072292.1330509, "message": "FB connect is not just for lazy devs! In many cases, using connect helps ensure authentic user profiles and provides real value for users. There are also other market specific alternatives and I think we will see in the near future a greater number of connect service providers. For instance, if I had a service for web designers a sign up with Dribbble connect could be of huge value to my service and its users. Social equity I believe is the term. There are other big benefits like increased virility but of course the downside is always going to be FB controls your users data. Does the added value of FB connect out weigh the downside for your service?", "group_id": 250, "id": 1670268}, {"user_id": 40466, "stars": [], "topic_id": 35603, "date_created": 1314768527.962332, "message": "HahaHhahsh", "group_id": 250, "id": 2009037}, {"user_id": 42952, "stars": [], "topic_id": 35603, "date_created": 1320018754.1960249, "message": "no one is here.....\nBummer", "group_id": 250, "id": 2472365}, {"user_id": 23174, "stars": [], "topic_id": 35603, "date_created": 1321596356.6737909, "message": "@theGuywithaTie I totally agree, not having them create an account would be missing a great opportunity. On the other hand it is annoying to do those and sometimes i don't if it takes longer than 15 seconds. I like to hear your fix for this. I've got a website up too. But I'm just white knuckling it. Anyone know a good visual HTML creator or maybe tutorial for website making?", "group_id": 250, "id": 2593609}, {"user_id": 42139, "stars": [], "topic_id": 35603, "date_created": 1321660303.7355471, "message": "i luv fb", "group_id": 250, "id": 2597554}]