[{"user_id": 19921, "stars": [], "topic_id": 12086, "date_created": 1299784445.5145299, "message": "A ver @zodman, no te vayas con la finta mi hermano. El concepto de dar un porcentaje de nuestros Startups a colaboradores y empleados no es algo que todavia no se adopta tanto en Mexico. \n\nLa mayoria de los empleados quieren efectivo y lo quieren a tiempo. No se que tipo de esquema de pago tengas, pero si a los empleados solo les estas dando equity, deberias de ser mas generoso. \n\nPiensalo: ¿que tan motivado y comprometido va a estar un individuo al exito de tu empresa si tienen mayor porcentaje de propiedad? Mucho mas. Claro, tambien hay que tomar en cuenta el valor que estan trayendo a la mesa, pero dependiendo el capital que tengas en tu Startup, es posible que el dar muy poco porcentaje a empleados sea contra producente.", "group_id": 965, "id": 315632}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299783861.8833389, "message": "como saben algunos ando en un startup somos un equipo de 3 personas yo de desarrollo, 1 marketing, 1 finanzas. En realidad A mi se me ocurrio la idea yo la implemente, y los otros 2 compañeros los invite a participar. Al parecer quieren divir las ganancias en 3 partes iguales. Pero si aun no hacen nada :P Segun yo se divide las ganancias segun como trabajes ... ustedes como divirian las ganancias en un equipo de startups?", "group_id": 965, "id": 315576}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299783905.214807, "message": "la dision que tengo es 70%dev,10%mkt,10%fin, 10% se va al capital.", "group_id": 965, "id": 315583}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299784511.1737151, "message": "@albrtk ok ok buena reflexion", "group_id": 965, "id": 315634}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299784637.8581369, "message": "/me repensando las cosas", "group_id": 965, "id": 315647}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299786606.6668141, "message": "@krator la neta es que si, eh tenido pleito por eso con el de mrkt", "group_id": 965, "id": 315780}, {"user_id": 19938, "stars": [], "topic_id": 12086, "date_created": 1299785853.3122661, "message": "@zodman creo que es un buen momento para que pongas las cosas en su lugar. Si es tu idea y es tu trabajo, debe ser capaz de decirlo tal cual ante tus empleados o colaboradores. Pon las reglas de tu negocio desde ahorita. Tengan una junta exclusivamente para eso. \n\nA veces pensamos que por poner una empresa digital las cosas son distintas.\n\nPiensa que estás poniendo una tienda de zapatos. Cada quien entra aportando algo. Ese algo, una vez que se ejecute, lo puedes transformar en algo de valor. La mera presencia en una compañía no te debe ganar nada.\n\nAl final de cuentas todos van a aportar tiempo o dinero. Debes ser capaz de cuantificar eso a precios de mercado y en base a eso dividir la empresa. Esto es tomando en cuenta lo tangible. Ahora, también hay que tomar en cuenta cosas intangibles como las ideas, las relaciones personales (en caso de que aplique), la experiencia, etc\n\nEn resumen, es tan complejo como quieras y no hay reglas escritas para esto.", "group_id": 965, "id": 315716}, {"user_id": 12133, "stars": [], "topic_id": 12086, "date_created": 1299787572.6148429, "message": "-1 en dicsion y gramatica :S", "group_id": 965, "id": 315900}, {"user_id": 3665, "stars": [], "topic_id": 12086, "date_created": 1299786559.710731, "message": "@zodman concuerdo con @albrtk. Y tener desde un principio ya un equipo con tareas asignadas es genail, aunque la idea y el desarrollo es tuyo, son necesarias las otras áreas.  Creo que te/les ayudaría crear \"escenarios\", ejemplo: qué pasa si el primer cheque es de 1,000 pesos? 10,000? 20,000? etc...", "group_id": 965, "id": 315773}, {"user_id": 3665, "stars": [], "topic_id": 12086, "date_created": 1299786578.7990341, "message": "@zodman BTW, un diseñador no te cairía nada mal :P", "group_id": 965, "id": 315775}, {"user_id": 19921, "stars": [], "topic_id": 12086, "date_created": 1299787839.7855749, "message": "Whoops, quise decir @Krator +1 Excelente adicion.", "group_id": 965, "id": 315928}, {"user_id": 2946, "stars": [], "topic_id": 12086, "date_created": 1299794449.908922, "message": "@zodman Creo que finanzas y mercadotecnia es demasiado. Un \"business guy\" que pueda hacer ambos debería bastar. Además fijate que el que sepa de mercadotecnia offline, no significa que vaya a entender de marketing online.", "group_id": 965, "id": 316933}, {"user_id": 2946, "stars": [], "topic_id": 12086, "date_created": 1299794465.8569419, "message": "y +1 por lo de que te hace falta un gran diseñador web", "group_id": 965, "id": 316939}]