[{"user_id": 27835, "stars": [{"date_created": 1302313090.2868209, "user_id": 1}, {"date_created": 1302335347.2352171, "user_id": 28046}], "topic_id": 18179, "date_created": 1302313050.9415381, "message": "Continue with what were doing and try to get a beta version soon. Start to sing up for users and customers. If opportunity arise we will try again next session or other incubators.", "group_id": 8529, "id": 598926}, {"user_id": 23797, "stars": [{"date_created": 1302315280.0648129, "user_id": 1}, {"date_created": 1302317817.3942909, "user_id": 7912}, {"date_created": 1302335342.014328, "user_id": 28046}], "topic_id": 18179, "date_created": 1302314616.2255671, "message": "Take a short break, no need to rush and get ready for a demo for the interview. Then launch the app, try and get early adopters, iterate. For us the money was never the point, so we keep self funding and bootstrap.", "group_id": 8529, "id": 599137}, {"user_id": 24097, "stars": [], "topic_id": 18179, "date_created": 1302362183.615051, "message": "Create a super product, dominate the world and email them back that they were wrong! Lol. But really just keep coding, get a real product out, get feedback,iterate! Rinse, wash and repeat.", "group_id": 8529, "id": 602594}, {"user_id": 27992, "stars": [], "topic_id": 18179, "date_created": 1302382621.9292021, "message": "I need a seed round... soon to have 30k municipal users. I'm looking for pitching opportunities and talking to local angels.  Joining every grant program I know for clean tech plus a local accelerator.  Wouldn't expect @paulg and friends to understand much greater addressable market outside of the Valley, but local angels will.", "group_id": 8529, "id": 605455}, {"user_id": 27987, "stars": [], "topic_id": 18179, "date_created": 1302419733.453912, "message": "launch! )", "group_id": 8529, "id": 608340}, {"user_id": 24848, "stars": [], "topic_id": 18179, "date_created": 1302429139.2461879, "message": "Build, get beta users, rebuild, launch, get more users, get revenue, go back and ask for $$ at a much better valuation. {after x years} dominate.", "group_id": 8529, "id": 608632}, {"user_id": 8885, "stars": [], "topic_id": 18179, "date_created": 1302436151.8921621, "message": "I applied to YC many times  (4 times). All 3 ideas died after i got rejected. My present project is going to happen. That's good. I did not want to apply to YC, but my co-partner asked me. He did not nervous at all, but i did a lot as we were in 50 lost email list. So if your project was not for YC only, np..continue to do what you do. Other wise come back to be rejected next round!!!  Best regards to losers and winners! )))", "group_id": 8529, "id": 609154}, {"user_id": 28695, "stars": [], "topic_id": 18179, "date_created": 1302505831.1861501, "message": "I'm going to apply to some other incubators.  Anyone applying to AngelPad or 500 startups?", "group_id": 8529, "id": 620956}]