[{"user_id": 30469, "stars": [{"date_created": 1303961442.3058519, "user_id": 30471}], "topic_id": 21751, "date_created": 1303960868.8600149, "message": "So our inability to come to agreement on a name/namespace has inspired me to bring up the topic of decision making. I'm new to open-source projects (as a contributor) and I don't know if there's an established norm for how large groups of people come to important decisions on open source software projects, but in my mind it seems there ought to be some established decision-making process or committee that charts the proper course for a project. I know that in many situations, such collaborations are de-facto meritocracies, and I agree that those who contribute the most should have a proportionate say in the decision-making. However, having some sort of defined structure complimentary to that can go a long way in effective project management. Thoughts?", "group_id": 9127, "id": 835912}, {"user_id": 30469, "stars": [], "topic_id": 21751, "date_created": 1303960972.4531851, "message": "I'm also thinking in terms of us reaching out for support from, say, RPD or other organizations, having a defined organizational structure will help us... or said another way, lack of a structure can hurt us.", "group_id": 9127, "id": 835927}, {"user_id": 30471, "stars": [{"date_created": 1303969337.225167, "user_id": 10411}], "topic_id": 21751, "date_created": 1303962410.721714, "message": "Whoever holds the conch is the leader. O:-)  </obscure high school literature reference>", "group_id": 9127, "id": 836105}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303971587.579838, "message": "Another option that crops up a lot is when there a couple of very knowledgeable (main/initial/primary) developers, who because of their unrivaled experience still manage the project.  However they spend most of their time doing other things, and have more or less passed-the-torch.  However, there is a legion of well versed developers that have the depth and the latitude to make major changes with or without the folks up a level.  NumPy, MatPlotLib, and IPython are all examples of this.  (eg NumPy is not Travis Oliphant's project in the same way that Linux is Linus Torvalds').", "group_id": 9127, "id": 837429}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303971155.2046909, "message": "Other projects, have no use for the dictator and are managed by a peerage (lieutenants) who all trust one another.  Gentoo and SciPy are pretty good examples of this.", "group_id": 9127, "id": 837370}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303970966.837254, "message": "@paul_romano So really, open source projects tend to adopt whatever management scheme is most useful to the community around it at the time.  Some, like Linux and CPython, are run by the community but have (possibly benevolent) dictators that step in when there are ambiguities/disputes.  Such dictators tend to have a battalion of trusted lieutenants who run most of the day-to-day stuff.", "group_id": 9127, "id": 837331}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303971854.243866, "message": "Here, we are likely going for Option 2: Cabal of Top Devs.  However, the problem *right* now is that we don't really have that network of trust yet.  Except for Katy and myself and possibly Milad and Josh) none of us have really done any work together.  I, personally, am anxious to get to the code such that we can establish this network.", "group_id": 9127, "id": 837453}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303972063.3553829, "message": "Specifically, the naming issue is just one of those things that if done right no one notices and if done wrong people curse your bones for decades to come.", "group_id": 9127, "id": 837481}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303972287.271184, "message": "I think a lot of our short term project management issues go away once we come to a consensus on the name.  With relative ease, we seemed to have worked out a lot of the other kinks:  git, github, sphinx, put what you want into a staging branch, master requires a blessing from someone else and tests.  I have seen other established projects fight about any one of these for months!", "group_id": 9127, "id": 837513}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303972296.490144, "message": "I hope this was helpful.", "group_id": 9127, "id": 837514}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1303972955.390852, "message": "Also, we figured out licensing really easily too!", "group_id": 9127, "id": 837600}, {"user_id": 30471, "stars": [], "topic_id": 21751, "date_created": 1304049607.683269, "message": "I have a bad feeling that the namespace is just the tip of the iceberg... we could make the same \"curse your bones\" argument about a lot of the infrastructure, too. One misstep in your nuclide library...", "group_id": 9127, "id": 851396}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1304050577.985574, "message": "@sethrj I don't share your fears because almost everything else we'll do will be technical and therefore have technical pros/cons, rather than strict intuition.  And in the face of evidence, everyone working on a scientific computing project should be able to adapt their opinions.  Also, changing code and infrastructure is easy; it's just bytes.  Changing names is hard.", "group_id": 9127, "id": 851554}, {"user_id": 10411, "stars": [], "topic_id": 21751, "date_created": 1304053454.012918, "message": "@sethrj I *am* interested to hear your thoughts on how you think we should organize things.", "group_id": 9127, "id": 851983}, {"user_id": 30471, "stars": [], "topic_id": 21751, "date_created": 1304088868.2535601, "message": "@scopatz I hope it didn't sound like I meant I would disagree with everything. :) I meant, for example, that the arguments used in constructing a cartesian mesh will have to be decided upon (and we won't want to ever change it, lest someone's 20x30 mesh accidentally turn into a 30x20 mesh). Or if we want to specify a format for reading nuclides from a text file.", "group_id": 9127, "id": 857513}, {"user_id": 30469, "stars": [], "topic_id": 21751, "date_created": 1304185451.946146, "message": "@scopatz Thanks for your insights on this topic. I agree that the \"Cabal of Top Devs\" structure will make sense for what we're doing. What I'm suggesting is that we codify that structure and have an established way for someone to become a \"top dev\" (whether that be agreement of the majority of top devs or something else).", "group_id": 9127, "id": 870207}]