[{"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302208899.246289, "message": "@ericflo I've read on blogs few months ago but there were a lot of people with problems", "group_id": 95, "id": 580331}, {"user_id": 25087, "stars": [], "topic_id": 17920, "date_created": 1302210318.2474999, "message": "So my problem is that I can usually wake up OK, but I end up going back to sleep fairly quickly. It also doesn't matter how many alarms I set, or where in the room/house I place them, I will aggressively turn them off and go back to sleep. \n\nIt has definitely helped me try to find the optimal amount of sleep I need *if* I can wake up at the right time. They've got a nice analytics page that shows you the different phases of sleep you were in during the night and also tries to generate a score for you. I haven't been using it long enough to know what effect different states I go to sleep in (drunk, really drunk) change that, though. \n\nIt is nice to not be woken up out of a deep sleep, and I think that helps, but other (cheaper) alternatives (EasyWakeup on the iPhone) have worked as well for that, they just haven't given me the comprehensive breakdown on my sleep stats.\n\nThey are adding some snooze functionality soon, so maybe that will help. It's also frustrating that the battery only lasts for 2-3 days and I almost always forget to recharge it.", "group_id": 95, "id": 580631}, {"user_id": 1, "stars": [], "topic_id": 17920, "date_created": 1302208921.668632, "message": "@ccarnino Yeah I read that too, but it's been a while now and I'm sure they've been working hard on fixing those problems", "group_id": 95, "id": 580338}, {"user_id": 344, "stars": [], "topic_id": 17920, "date_created": 1302209883.5924661, "message": "I've had one for several months. The truth is, I don't use it that much. I found it was often just firing the alarm at the end of the window, and I didn't notice a difference having it wake me up.", "group_id": 95, "id": 580531}, {"user_id": 1, "stars": [], "topic_id": 17920, "date_created": 1302208814.3079209, "message": "I haven't gotten a chance to try it yet", "group_id": 95, "id": 580309}, {"user_id": 1, "stars": [], "topic_id": 17920, "date_created": 1302208844.0554421, "message": "I've heard good things though", "group_id": 95, "id": 580322}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302208854.4003551, "message": "If you have tried it, can you give me your opinion?", "group_id": 95, "id": 580323}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302208833.0711579, "message": "I would love to have WakeMate http://wakemate.com/ but I know that in the early phase of launch there were battery problem (battery die in few hours) and it prevented the product to work", "group_id": 95, "id": 580317}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302209013.4021139, "message": "@ericflo I think that too... They were a YC alumni, so I presume that they were determined to create a great product", "group_id": 95, "id": 580354}, {"user_id": 344, "stars": [], "topic_id": 17920, "date_created": 1302209975.8634491, "message": "Still, some people really seem to like it. The sleep data is interesting, probably worth the price of admission if you're interested in being quantitative about your body.", "group_id": 95, "id": 580550}, {"user_id": 5369, "stars": [], "topic_id": 17920, "date_created": 1302210651.807627, "message": "Oh, and don't forget: EXERCISE!", "group_id": 95, "id": 580726}, {"user_id": 5369, "stars": [], "topic_id": 17920, "date_created": 1302210585.331686, "message": "WakeMate is cool and everything, but honestly there are simpler ways to get out of bed. For example, some things that help: Don't use a bright screen for an hour before you go to bed (or at least normalize the color temperature (eg: use Flux)); Drink a whole glass of water as soon as you're woken by the alarm (and I do mean the WHOLE glass); Start a routine where every morning at a specific time you do something (like make coffee, feed the cat, or catch the beginning of a morning tv show). Your body will work out the rest, you just need some willpower to get into the swing.", "group_id": 95, "id": 580712}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302214804.2851701, "message": "Tnx guys! This is the kind of informations I've always read on blogs. People like it but not enough, and most of them just the the stats about the sleep.", "group_id": 95, "id": 581622}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302214843.3663421, "message": "It clears the mind faster", "group_id": 95, "id": 581634}, {"user_id": 5136, "stars": [], "topic_id": 17920, "date_created": 1302214827.39679, "message": "The drink a glass of water when wakeup is a good start", "group_id": 95, "id": 581631}, {"user_id": 9233, "stars": [], "topic_id": 17920, "date_created": 1302240741.068495, "message": "Wakemate is not a great alarm clock for me, but the analytics are second to none. It's a great way to track what affects and how it affects your sleep… :)", "group_id": 95, "id": 586948}, {"user_id": 19798, "stars": [], "topic_id": 17920, "date_created": 1302251075.6332819, "message": "There's also myzeo and Fitbit to consider and compare it to. Has anyone?", "group_id": 95, "id": 587732}]