[{"user_id": 8635, "stars": [], "topic_id": 11362, "date_created": 1299532253.1272831, "message": "For me, among other things: the fact that you have a minimal install from which you build on; rolling distro; pacman is very simple to use; the wiki is incredible; K.I.S.S. approach.", "group_id": 3024, "id": 291240}, {"user_id": 8635, "stars": [], "topic_id": 11362, "date_created": 1299531975.7231331, "message": "I'm interested to know why you chose Arch as your distro.", "group_id": 3024, "id": 291179}, {"user_id": 18608, "stars": [], "topic_id": 11362, "date_created": 1299538590.9038219, "message": "For me, this is how Linux should be.", "group_id": 3024, "id": 292262}, {"user_id": 18608, "stars": [], "topic_id": 11362, "date_created": 1299538567.5710411, "message": "Sounds like you did a good job listing the merits of Arch :) I ran Gentoo on my boxen for about 10 years, but once I tried Arch on someone's suggestion, I fell right in love with it. It seems even simpler and pacman seems even faster vs Gentoo/portage, and I seem to have far fewer issues with it as well. The fact that I can build ONLY what, just how I want, and AUR has all the extra packages I ever seem to need is huge for me.", "group_id": 3024, "id": 292260}, {"user_id": 37241, "stars": [], "topic_id": 11362, "date_created": 1309401220.4333341, "message": "I can't add much that hasn't already been said, but the three biggest things for me are rolling release, pacman, and the AUR.", "group_id": 3024, "id": 1524695}, {"user_id": 8635, "stars": [], "topic_id": 11362, "date_created": 1309573841.8952041, "message": "Which AUR wrapper are you using (if any)? I've been using \"yaourt\" for a while on my older machine. It craps out once in a while (I never really investigated it since it doesn't happen too often and a reinstall seems to fix it) but it does the job 99% of the time. I recently installed \"packer\" on my newer machine but haven't used it enough to provide meaningful comments.", "group_id": 3024, "id": 1546675}, {"user_id": 37241, "stars": [], "topic_id": 11362, "date_created": 1309616848.221961, "message": "I've used yaourt a bit, but I normally just do AUR installs manually which in and of itself is quite faster than building everything yourself.  =)", "group_id": 3024, "id": 1548015}]