[{"user_id": 16271, "stars": [], "topic_id": 10613, "date_created": 1299197027.710814, "message": "Not reading any ML stuff right now but I have been trying to go through the Stanford course on iTunes U.  Haven't found the time to get past the first couple of lectures but so far it seems high value.", "group_id": 12, "id": 265142}, {"user_id": 17469, "stars": [{"date_created": 1300428573.7001071, "user_id": 7924}], "topic_id": 10613, "date_created": 1299197953.5034699, "message": "@mridley Cool, at least you're trying. IMHO, you better brush up hardcore on Linear Algebra and learn Probability (what's typically taught is too little and too fast).", "group_id": 12, "id": 265206}, {"user_id": 16271, "stars": [], "topic_id": 10613, "date_created": 1299201026.5547531, "message": "@megatron Yeah I do have some background with linear algebra and probability but I've definitely been brushing up in these past months.", "group_id": 12, "id": 265368}, {"user_id": 10890, "stars": [], "topic_id": 10613, "date_created": 1299216850.5126491, "message": "currently reading documentation from ML open source projects... I have posted some pointers here: https://convore.com/learn/ for discussion.", "group_id": 12, "id": 266929}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299268194.2736509, "message": "- NLP: POS taggers, chunkers, blahblah is IMHO (and trust me on this), a bunch of pre-processing bullshit that will get you nowhere. The really successful stuff like Google Translate is all unsupervised statistical learning. To \"grok\" this stuff you will have to at least understand EM and then Graphical Models. In my book, that is \"advanced\", not the best way to get into stuff.", "group_id": 12, "id": 272203}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299267377.4321351, "message": "@revp thanks for the link, taking a look at it right now..", "group_id": 12, "id": 272122}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299268082.5851009, "message": "More advice:\n- forget about OpenCyc, KR or any ontolgies. It is dead on so many levels and has probably destroyed many a promising career. The fundamental assumptions are deeply flawed. Our brains do not go through propositional calculus to infer, especially not on solving everyday common problems such as making a meal, navigating, recognizing, associating, etc.", "group_id": 12, "id": 272191}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299268365.723006, "message": "Textbooks: I have found most of them to be almost like tests if I finally learned stuff elsewhere. If I am able to read them, then I know I have learned. I've never successfully used advanced texts such as Duda & Hart, Bishop, Friedman (ESL) or any other to really master an ML technique but rather read the papers by people who invented the techniques. Mitchell's text is useful, easy to read, but old with some new stuff missing and some outdated stuff in there.", "group_id": 12, "id": 272221}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299267533.2444041, "message": "@mridley. My make-or-break test for you in Linear Algebra is to score 80% or above on Strang's exams on the MIT Linear Algebra course (introductory) , course 18.06 on OCW. If you can do that, you're ready for ML, at least as far as Linear Algebra goes.", "group_id": 12, "id": 272133}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299268464.4795711, "message": "Reinforcement Learning (RL) is now marginal compared to what really \"works\"(TM). RL has its successes but in a very narrow spectrum of applications.", "group_id": 12, "id": 272241}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299268528.5238309, "message": "Gaussian Processes are cool, but yet another very advanced concept and if you're just getting into stuff you will bang your head against the wall and give up unless you are really the bees knees in multivariate probability AND advanced linear algebras (I think Rasmussen's book has Schur's complements in Chapter 1.. ouch!).", "group_id": 12, "id": 272258}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299267922.754889, "message": "@rsvp, that's a really really hard way to get into it, because you won't be able to see the forest from the trees. The largest ML research departments sometimes rely on paid software engineers to convert their MATLAB into efficient code. The implementation can sometimes get so mathematically optimized (using very advanced linear algebra and all sorts of approximations) that you literally cannot recognize the algorithms in the code.", "group_id": 12, "id": 272162}, {"user_id": 719, "stars": [{"date_created": 1299366119.577843, "user_id": 16271}], "topic_id": 10613, "date_created": 1299269937.011061, "message": "@megatron Do you have a blog/similar?", "group_id": 12, "id": 272462}, {"user_id": 16271, "stars": [], "topic_id": 10613, "date_created": 1299366160.411088, "message": "@micrypt I was just thinking the same thing.  @megatron you apparently have a lot of domain knowledge in ML - would be great if you could post some of this introductory/overview/approach thinking to a web site somewhere.", "group_id": 12, "id": 277898}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299383850.1879661, "message": "@micrypt,@mridley thanks for your suggestions, you really made me think hard about it. I haven't made up my mind. Blogs are a big commitment.\n\nBeing somewhat familiar with the ML community, I'd venture to say that it is a very tight knit crowd with a LOT of the leading researchers typically NOT coming from the Computer Science background, instead you see Physics, Mathematics and Statistics degrees, especially at the graduate level. They publish on a handful of very elite conferences.\n\nTheir discourse is friendly, but the culture is definitely different than that of the Software Engineering community. There is much less of \"Hey this is actually easy, I can explain it in a simple way, look!\" and much more of, \"I hope you took as many math courses as possible before coming to my lecture.\" At least I think that's how it looks like to someone who became a programmer first and then everything else, even though I find the crowd to be generally very friendly to each other.", "group_id": 12, "id": 278509}, {"user_id": 16271, "stars": [], "topic_id": 10613, "date_created": 1299385465.087738, "message": "@megatron A blog is a commitment but you can just make a web site without the expectation that it would be updated regularly.  Just a place to disseminate information.  Whether you use a blogging platform, a CMS, or hand coded HTML I don't think matters.", "group_id": 12, "id": 278540}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299386359.216433, "message": "@zellyn definitely interested. that looks like a comprehensive and tough class, but covering a lot of hot topics.", "group_id": 12, "id": 278558}, {"user_id": 2274, "stars": [], "topic_id": 10613, "date_created": 1299385541.6493111, "message": "I am working my way through the Stanford class - just finished watching all the lectures, now working my way through the probem sets, and watching Strang's Linear Algebra lectures on the side. I'm going through it very slowly: when the homework says, \"you can use these formulas as given, but should derive them yourself,\" I'm deriving them myself.", "group_id": 12, "id": 278542}, {"user_id": 2274, "stars": [], "topic_id": 10613, "date_created": 1299385565.518265, "message": "I'd be interested in starting a group devoted to CS 229 discussion if anyone else is interested.", "group_id": 12, "id": 278543}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299386565.6800439, "message": "@zellyn i'd rate CS 229 about 5 times harder than Strang's course. The prerequisites look like a piece of cake, but there's multivariate probability and matrix calculus in there right on Lecture 2. Ng seems to rely on variational calculus a lot to drive his point across, but I think the intuition gets lost in all the algebra. Still, very interested in discussing the course topics.", "group_id": 12, "id": 278559}, {"user_id": 719, "stars": [], "topic_id": 10613, "date_created": 1299407237.5108039, "message": "@zellyn I'd also be interested.", "group_id": 12, "id": 279314}, {"user_id": 2274, "stars": [], "topic_id": 10613, "date_created": 1299434606.8193491, "message": "It's definitely tricky, but I'm taking the approach of just wading through it slowly, taking copious notes (on paper - yes, I'm old school), deriving anything unclear to me, etc.", "group_id": 12, "id": 281210}, {"user_id": 2274, "stars": [], "topic_id": 10613, "date_created": 1299434707.63907, "message": "I found it difficult to sustain an interest in the Linear Algebra course the first time I tried it, especially since part of me was annoyed that I needed to study it again, having taken Linear Algebra ten years ago as an undergrad. But I find after wrestling with the linear algebra aspect of the Machine Learning course, I'm much more interested in Strang's class! :-)", "group_id": 12, "id": 281216}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299439150.8145859, "message": "@zellyn and same here, until I forced myself to take notes on paper and solve the problems before I see the prof do the solution, I didn't get very far in any of the video lectures.", "group_id": 12, "id": 281485}, {"user_id": 17469, "stars": [], "topic_id": 10613, "date_created": 1299439065.4351611, "message": "@zellyn LOL :) I had the same reaction for the same reasons. Strang is way more interesting when you crank him up to 1.5x (pitch-corrected of course). Here's a blog post by someone on how to do it:\n\nhttp://saravananthirumuruganathan.wordpress.com/2011/02/03/how-to-speed-up-videos-in-linux/", "group_id": 12, "id": 281482}, {"user_id": 2274, "stars": [], "topic_id": 10613, "date_created": 1299523457.8669319, "message": "Just created https://convore.com/stanford-cs229-study-group/ if anyone is interested. I'm not convinced this is the best discussion medium (at least one more level of hierarchy would be useful for keeping things organized), but it's worth a try.", "group_id": 12, "id": 289594}]