[{"user_id": 5195, "stars": [], "topic_id": 7676, "date_created": 1298223790.724148, "message": "While we have not unsed Fein or Django CMS for anything  substaintial so far. But Fein definitely feels closer to django than Django CMS. On the other hand if your CMS needs are simple enough rolling one specific to the app at hand is better option IMHO. More control and maintainability.", "group_id": 81, "id": 154244}, {"user_id": 5980, "stars": [], "topic_id": 7676, "date_created": 1298222976.6921501, "message": "A lot of the main CMS projects feel like they're built *on top of* Django, rather than being built *with* Django. At the moment I'm leaning towards FeinCMS, because it feels a bit more lightweight and unobtrusive. Any thoughts?", "group_id": 81, "id": 154210}, {"user_id": 4077, "stars": [], "topic_id": 7676, "date_created": 1298223101.8130939, "message": "Never used Fein, but I believe the popular answer to this is Pinax.  If you're not going to need to modify much, I'd say it's a good answer, but in my humble opinion, customizing a Pinax installation is more trouble than rolling my own from scratch, generally.", "group_id": 81, "id": 154218}, {"user_id": 14024, "stars": [{"date_created": 1298231341.280236, "user_id": 4581}], "topic_id": 7676, "date_created": 1298225939.91956, "message": "Not that into CMS yet, but find https://github.com/stephenmcd/mezzanine looks interesting and nicely implemented. Maybe it's worth a try.", "group_id": 81, "id": 154329}, {"user_id": 4581, "stars": [], "topic_id": 7676, "date_created": 1298231334.0473149, "message": "I'd second mezzanine, though I'm mostly using it as a blogging platform. There's a lot more to it, though, and development has been moving really quickly. It's definitely worth a look.", "group_id": 81, "id": 154554}, {"user_id": 209, "stars": [], "topic_id": 7676, "date_created": 1298244870.4540851, "message": "I've never been able to nail down which features people want/mean when they say \"Django CMS\"  What's important to you?", "group_id": 81, "id": 155125}, {"user_id": 14022, "stars": [], "topic_id": 7676, "date_created": 1298272643.164618, "message": "@craigds Yeah, creating and editing pages in the Django admin interface is a pain. You don't use the front-end editing feature?", "group_id": 81, "id": 157031}, {"user_id": 6894, "stars": [], "topic_id": 7676, "date_created": 1298272046.605823, "message": "I've only used django-cms. It's very feature packed but we found it needed a lot of hacking to get to the point where it was even vaguely user friendly. No idea about the others.", "group_id": 81, "id": 157003}, {"user_id": 6894, "stars": [], "topic_id": 7676, "date_created": 1298272415.1905999, "message": "more on django cms: the main problem is that when you create a new page, you then have to select a page template, add a plugin, and select a text plugin before you can even start typing your page's content. We added some javascript and template hacks to do all that automatically", "group_id": 81, "id": 157021}, {"user_id": 6894, "stars": [], "topic_id": 7676, "date_created": 1298272537.230474, "message": "(our changes: http://bit.ly/gkDyUv .) I did try to raise these as usability issues to the django cms team but they didnt seem interested unfortunately :(", "group_id": 81, "id": 157028}, {"user_id": 6894, "stars": [], "topic_id": 7676, "date_created": 1298273485.334625, "message": "Looks like that's new in 2.1. I just upgraded ours from 2.0; I'll have to investigate front-end editing. Big improvement?", "group_id": 81, "id": 157076}, {"user_id": 14022, "stars": [], "topic_id": 7676, "date_created": 1298273819.414186, "message": "Yes, I like it a lot. It's a lot more user friendly and you get to see all of the changes as you go. They have a demo up on their site.", "group_id": 81, "id": 157085}, {"user_id": 6894, "stars": [], "topic_id": 7676, "date_created": 1298275068.8490109, "message": "The demo doesn't seem to be working right now :/ I'll try again tomorrow", "group_id": 81, "id": 157136}, {"user_id": 5582, "stars": [], "topic_id": 7676, "date_created": 1298276021.039104, "message": "@craigds The mezzanine demo works though: http://mezzanine.jupo.org/admin/?mezzanine_login_interface=site&next=/blog/ (login demo/demo). Looks very nice.", "group_id": 81, "id": 157163}, {"user_id": 719, "stars": [], "topic_id": 7676, "date_created": 1298281193.0562, "message": "@bmelton I'm guessing you're referring to Pinax's cms_project base. Considering that there'll be significant modifications for the 0.9 final release I'd be concerned about using it. The real options if one wants a \"CMS\" would be a choice between Django CMS (for a fairly decent set of plugins/extensions) or Mezzanine.", "group_id": 81, "id": 157438}, {"user_id": 2588, "stars": [], "topic_id": 7676, "date_created": 1298304092.6925199, "message": "We've built (in progress) a large project on Django CMS. We're only using Pages to provide the main navigation structure, but as others have alluded to it might not map well to a number of use cases. For everything else we're just using standard Django views, leveraging the front-end editing and using the plugins/placeholders for a lot of stuff; which we found to be the real sweet spot of Django CMS.", "group_id": 81, "id": 159515}, {"user_id": 2588, "stars": [], "topic_id": 7676, "date_created": 1298304137.7861331, "message": "We've also been getting some patches upstream recently to let the filer plugin utilize a cloud storage backend.", "group_id": 81, "id": 159524}, {"user_id": 927, "stars": [{"date_created": 1298319582.5248029, "user_id": 1}, {"date_created": 1298360204.9534221, "user_id": 214}, {"date_created": 1298655065.9044721, "user_id": 15180}], "topic_id": 7676, "date_created": 1298319555.6463549, "message": "FeinCMS is a good option if you want to maximize configurability - between the template block mechanism and the enhanced ApplicationContent type you can fit most pre-existing apps into the CMS structure. The downside is that you're definitely going to need to think a little bit about integration for apps which weren't designed for embedding.", "group_id": 81, "id": 166873}, {"user_id": 11405, "stars": [], "topic_id": 7676, "date_created": 1298614828.7301421, "message": "using django-cms for 2 years now, build 20+ sites with it. love it. it is rapidly evolving and has a very active and smart community. Whenever I get struck I consult the mailing list / IRC channel and get a good answer within 24 hours.", "group_id": 81, "id": 206340}, {"user_id": 6396, "stars": [], "topic_id": 7676, "date_created": 1298638518.238173, "message": "+1 for feinCMS here. It does exactly what it says in the Readme and doesn't get in your way; very nice caching; you can attach the CMS stuff to your already existing models or use built in Page class. Very nice.", "group_id": 81, "id": 207610}]