[{"user_id": 11626, "stars": [], "topic_id": 7619, "date_created": 1298197905.8598249, "message": "http://www.rawstory.com/rs//wp-content/uploads/2011/02/internet-afp.jpg\r\n\r\nThese days, with Facebook and Twitter and social media galore, it can be increasingly hard to tell who your \"friends\" are.\r\n\r\nBut after this, Internet users would be well advised to ask another question entirely: Are my \"friends\" even real people?\r\n\r\nIn the continuing saga of data security firm HBGary, a new caveat has come to light: not only did they plot to help destroy secrets outlet WikiLeaks and discredit progressive bloggers, they also crafted detailed proposals for software that manages online \"personas,\" allowing a single human to assume the identities of as many fake people as they'd like.\r\n\r\nThe revelation was among those contained in the company's emails, which were dumped onto bittorrent networks after hackers with cyber protest group \"Anonymous\" broke into their systems.\r\n\r\nIn another document unearthed by \"Anonymous,\" one of HBGary's employees also mentioned gaming geolocation services to make it appear as though selected fake persons were at actual events.\r\n\r\n\"There are a variety of social media tricks we can use to add a level of realness to all fictitious personas,\" it said.\r\n\r\nGovernment involvement\r\n\r\nEerie as that may be, more perplexing, however, is a federal contract from the 6th Contracting Squadron at MacDill Air Force Base, located south of Tampa, Florida, that solicits providers of \"persona management software.\"\r\n\r\nWhile there are certainly legitimate applications for such software, such as managing multiple \"official\" social media accounts from a single input, the more nefarious potential is clear.\r\n\r\nUnfortunately, the Air Force's contract description doesn't help dispel suspicions. As the text explains, the software would require licenses for 50 users with 10 personas each, for a total of 500. These personas would have to be \"replete with background , history, supporting details, and cyber presences that are technically, culturally and geographacilly consistent.\"\r\n\r\nIt continues, noting the need for secure virtual private networks that randomize the operator's Internet protocol (IP) address, making it impossible to detect that it's a single person orchestrating all these posts. Another entry calls for static IP address management for each persona, making it appear as though each fake person was consistently accessing from the same computer each time.\r\n\r\nThe contract also sought methods to anonymously establish virtual private servers with private hosting firms in specific geographic locations. This would allow that server's \"geosite\" to be integrated with their social media profiles, effectively gaming geolocation services.\r\n\r\nThe Air Force added that the \"place of performance\" for the contract would be at MacDill Air Force Base, along with Kabul, Afghanistan and Baghdad. The contract was offered on June 22, 2010.\r\n\r\nIt was not clear exactly what the Air Force was doing with this software, or even if it had been procured.\r\n\r\nManufacturing consent\r\n\r\nThough many questions remain about how the military would apply such technology, the reasonable fear should be perfectly clear. \"Persona management software\" can be used to manipulate public opinion on key information, such as news reports. An unlimited number of virtual \"people\" could be marshaled by only a few real individuals, empowering them to create the illusion of consensus.\r\n\r\nYou could call it a virtual flash mob, or a digital \"Brooks Brothers Riot,\" so to speak: compelling, but not nearly as spontaneous as it appears.\r\n\r\nThat's precisely what got DailyKos blogger Happy Rockefeller in a snit: the potential for military-run armies of fake people manipulating and, in some cases, even manufacturing the appearance of public opinion.\r\n\r\n\"I don't know about you, but it matters to me what fellow progressives think,\" the blogger wrote. \"I consider all views. And if there appears to be a consensus that some reporter isn't credible, for example, or some candidate for congress in another state can't be trusted, I won't base my entire judgment on it, but it carries some weight.\r\n\r\n\"That's me. I believe there are many people though who will base their judgment on rumors and mob attacks. And for those people, a fake mob can be really effective.\"\r\n\r\nIt was Rockefeller who was first to highlight the Air Force's \"persona\" contract, which was available on a public website.\r\n\r\nA call to MacDill Air Force Base, requesting an explanation of the contract and what this software might be used for, was answered by a public affairs officer who promised a call-back. No reply was received at time of this story's publication.\r\n\r\nOther e-mails circulated by HBGary's CEO illuminate highly personal data about critics of the US Chamber of Commerce, including detailed information about their spouses and children, as well as their locations and professional links. The firm, it was revealed, was just one part of a group called \"Team Themis,\" tasked by the Chamber to come up with strategies for responding to progressive bloggers and others.\r\n\r\n\"Team Themis\" also included a proposal to use malware hacks against progressive organizations, and the submission of fake documents in an effort to discredit established groups.\r\n\r\nHBGary was also behind a plot by Bank of America to destroy WikiLeaks' technology platform, other emails revealed. The company was humiliated by members of \"Anonymous\" after CEO Aaron Barr bragged that he'd \"infiltrated\" the group.\r\n\r\nA request for comment emailed to HBGary did not receive a reply.\r\n\r\nUpdate: HBGary Federal among bidders\r\n\r\nA list of interested vendors responding to the Air Force contract for \"persona management software\" included HBGary subsideary HBGary Federal, further analysis of a government website has revealed.\r\n\r\nOther companies that offered their services included Global Business Solutions and Associates LLC, Uk Plus Logistics, Ltd., NevinTelecom, Bunker Communications and Planmatrix LLC.\r\n\r\nhttp://www.rawstory.com/rs/2011/02/18/revealed-air-force-ordered-software-to-manage-army-of-fake-virtual-people", "group_id": 3920, "id": 152978}]