[{"user_id": 2937, "stars": [], "topic_id": 14876, "date_created": 1300934873.7706399, "message": "What are people's takes on \"there is a bubble\" vs \"there isn't a bubble\"? Color just raised $41M pre-launch. Is there a way to look at that as a rational, unbubbly investment?", "group_id": 95, "id": 423377}, {"user_id": 2937, "stars": [], "topic_id": 14876, "date_created": 1300934966.1391399, "message": "Note that I'm genuinely interested in both perspectives. On its face, making an investment that means you're unhappy unless they exit for at least $1B based solely on the team, prototype, and idea seems crazy, but can it be a rational thing to do?", "group_id": 95, "id": 423395}, {"user_id": 24833, "stars": [], "topic_id": 14876, "date_created": 1301007743.7340829, "message": "In particular: public relations, advertising, consumer research, etc.", "group_id": 95, "id": 432391}, {"user_id": 24833, "stars": [{"date_created": 1301075484.2569971, "user_id": 7862}], "topic_id": 14876, "date_created": 1301007725.450978, "message": "I think the thinking with such investments is that customer behavior is about to change rapidly, and hence, so are the major industries surrounding it.", "group_id": 95, "id": 432389}, {"user_id": 14674, "stars": [], "topic_id": 14876, "date_created": 1301014214.477145, "message": "Theres no question that we are in a bubble, but at this point I dont think theres anything to worry about. Problems will arise when companies such as Facebook finally go public - and they will be first to fall.", "group_id": 95, "id": 433495}, {"user_id": 4077, "stars": [], "topic_id": 14876, "date_created": 1301021386.3587739, "message": "Sequoia's generally pretty conservative.  So either they're dead wrong, and there's merit to the argument, or they're dead right, and there isn't.  Even if they bust, I don't know that one bad investment marks a bubble pop, but what might be more worrying is that the traditionally conservative VCs are trying to get into the deals they might ordinarily miss by being so conservative.", "group_id": 95, "id": 434419}, {"user_id": 21427, "stars": [], "topic_id": 14876, "date_created": 1301026055.726897, "message": "@craigrood that's probably why we haven't seen companies with the billion dollar evaluations IPO yet. If they tried to do so now, there's a big chance the bubble will pop. It seems like we're in a bubble now and the giant tech companies are trying to build up a solid foundation so it can withstand the bust. The companies that can survive past this bubble will go far. Just look at how far companies such as Amazon and Ebay have gotten... they are among the few survivors of the dot com bubble.", "group_id": 95, "id": 435303}, {"user_id": 25067, "stars": [], "topic_id": 14876, "date_created": 1301026603.4481609, "message": "In case you haven't read it yet, here's a good quantitative post by Ben Horowitz: http://bhorowitz.com/2011/03/24/bubble-trouble-i-don%E2%80%99t-think-so/", "group_id": 95, "id": 435414}]