[{"user_id": 11626, "stars": [], "topic_id": 6649, "date_created": 1297902522.533375, "message": "As legislators in DC contemplate expanding government copyright enforcement powers, there's new reason to worry that government agents are misusing the Internet policing powers they already have -- with disastrous consequences for thousands of innocent bystanders. Torrentfreak is reporting that the Department of Homeland Security's ICE agents temporarily shut down 84,000 websites, possibly by accident, in the name of shutting down just ten websites that allegedly contained child pornography.\r\n\r\nWe're still getting a handle on the details, but it appears that the government took down all sites associated with a dynamic DNS service called afraid.org, in particular subdomains beneath mooo.com. One or more of the subdomains may have been hosting child porn, but instead of seizing that subdomain alone, the takedown targeted mooo.com. What is worse, it also appears that the perfectly legal sites were temporarily plastered with a notice suggesting they trafficked in child porn.\r\n\r\nWe'll keep watching this one -- we'd really like to see the actual seizure order -- but what we've heard so far raises serious free speech problems. Simply put, an order taking down a legal website is a prior restraint on speech, and we don't generally allow such an order unless the restraint is narrowly tailored to a specific and lawful objective. This takedown appears to have been anything but \"narrowly tailored.\"\r\n\r\nTo be clear, this government action involved allegations of child porn rather than copyright infringement, but we have certainly seen the same kind of overreaching from ICE agents in recent copyright takedowns as well. Legislators considering the future of online copyright enforcement (including effective website censorship powers) should take heed: given the collateral damage to free speech rights that can occur with existing enforcement methods, this is no time to give government agents new ways to interfere with the Internet's domain name system.\r\n\r\nhttps://www.eff.org/deeplinks/2011/02/ice-seizures-raising-new-speech-concerns", "group_id": 3920, "id": 127299}]