[{"user_id": 11626, "stars": [], "topic_id": 40888, "date_created": 1309478704.123986, "message": "From a Filipino news agency...\r\n\r\nAnd it's interesting, because the U.S. is tied militarily to the Philipines & it's amazing, when you read the article, how SIMILAR our 2 governments operate...\r\n\r\nCan anyone say: \"Continuity of agenda\"?\r\n\r\n-- Kim M.\r\n\r\n__________________________________________________\r\n\r\n\r\n'Philipine cybersecurity not a gov't priority' -CICT chair\r\nGMA News\r\n06/30/2011\r\n\r\nThe government is practically helpless against the recent spate of cyber attacks on several of its websites, given the low budget priority allotted to cybersecurity, an official of the now-defunct Commission on Information and Communications Technology (CICT) said on Thursday.\r\n\r\nThe CICT, , the primary government agency tasked with developing ICT policy for the country, was dissolved by virtue of an Executive Order from President Aquino last June 23.\r\n\r\nDuring the Cyberpress forum on cybersecurity on Thursday morning, former CICT chairman Ivan Uy said that the reason government websites are being targeted recently is because they are the easiest sites to hack.\r\n\r\n\"The government operates on a budget, and cybersecurity is way below in the list of budget priorities,\" Uy pointed out.\r\n\r\n\"It could be really good if the government could raise the priority of securing these IT infrastructure and assets by putting the money where their mouth is. Unfortunately, somebody else holds the money.\"\r\n\r\nUy, however, pointed out that the concerned law enforcement units have already been trained and equipped to handle such incidents.\r\n\r\n\"This is a law enforcement issue, and we do have people who are mandated and trained to do that, but whether they are doing [their job] is a completely different matter,\" he stressed.\r\n\r\nCongress pushes cyber policies\r\n\r\nBut in terms of policy-making, one of the commission's primary mandates, Uy said that Congress is making strides in pushing for important technology-related bills.\r\n\r\nThe Cybercrime Bill, for one, has already gone through committee-level deliberations in the House of Representatives, and is on its way to be passed for first reading.\r\n\r\nUy said that in terms of the provisions stipulated in the House and Senate versions of the bill, there seems to be very little difference, so there is a slim chance that some provisions would be watered down when the two chambers call for a bicameral conference.\r\n\r\nIt was only in 2010 when the House passed its version of the cybercrime bill, but the Senate failed to pass its own before the Congress adjourned in time for the 2010 Presidential elections.\r\n\r\n\"In our case, from a policy perspective, we have been trying to create more awareness about the issue. We have partnered with several groups to create more awareness and more training in order to address this,\" Uy said.\r\n\r\n\"We cannot do something like a Big-Brother type wherein we're the security [gateway] for everybody, but the best thing we can do is create awareness in the IT community,\" he added.\r\n\r\nUy added that the commission can only do so much on its own given its limited resources. — TJD, GMA News\r\n\r\nhttp://www.gmanews.tv/story/224904/technology/phl-cybersecurity-not-a-govt-priority-cict-chair", "group_id": 3920, "id": 1535583}]