[{"user_id": 11626, "stars": [], "topic_id": 21542, "date_created": 1303870407.3341949, "message": "http://www.infowars.com/are-you-scared-yet-big-sis-to-beam-terror-warnings-to-your-iphone\r\n\r\nhttp://www.infowars.com/are-you-scared-yet-big-sis-to-beam-terror-warnings-to-your-iphone\r\n\r\n\r\nAre You Scared Yet? Big Sis To Beam Terror Warnings To Your iPhone\r\nGovernment will tell you when to stay indoors\r\nSteve Watson\r\nInfowars\r\nApril 21, 2011\r\n\r\nThe Department of Homeland Security is beefing up it’s terror alert warning system in a move that will see terror alerts, whether real or phony, issued via the mainstream media and directly to your phone or computer over social networking sites, and even via Emergency Alert broadcasts.\r\n\r\nThe government’s much ridiculed colour coded chart is being scrapped, primarily because it is always set at “elevated” and is roundly ignored by almost everyone in America. The DHS assures us that the new system will be virtually impossible to avoid.\r\n\r\nHomeland Security Secretary Janet Napolitano, who has been dubbed ‘Big Sis’ in reference to George Orwell’s dystopian novel 1984, told reporters this week that The primary-color alerts have “faded in utility, except for late-night comics.”\r\n\r\n“Homeland Security officials will disseminate the new alerts through the press and social media sites.” reports the LA Times.\r\n\r\n“The bulletins will ask local police and the public to be on the lookout for vehicles or behavior that may be part of a terrorist plot that the government is tracking. Alerts could be directed at airports or subways, or may urge people in a specific city to take shelter in their homes for a short time.” the report continues.\r\n\r\n\r\n\r\nThat’s correct, the government intends to routinely beam into your home and offices and tell you when it thinks you need to be scared and act compliant.\r\n\r\nWe have previously documented how such terror alerts have been routinely hyped purely for political purposes.\r\n\r\nNever forget that the media and the government have been totally discredited over and over again by their complicity in issuing phony terror alerts designed to manipulate elections and frighten the public into slavish acquiescence.\r\n\r\nJust as former Homeland Security chief Tom Ridge admitted that DHS would issue fake terror alerts shortly before elections in a bid to influence the outcome during the Bush era, the Obama administration is mimicking the same tactic.\r\n\r\nRidge said he “was pushed to raise the security alert on the eve of President Bush’s re-election, something he saw as politically motivated and worth resigning over.”\r\n\r\nFast forward six years and you find exactly the same tactics being employed. Warnings of a supposed al-Qaeda attack on targets in Europe were exaggerated for political purposes, Pakistani diplomat Shamsul Hasan said in October last year. “I will not deny the fact that there may be internal political dynamics, including the forthcoming midterm American elections. If the Americans have definite information about terrorists and al-Qaida people, we should be provided [with] that and we could go after them ourselves,” Hasan said.\r\n\r\nNo terror event occurred. “It was nothing specific, nothing very new,” said Swedish Justice Minister Beatrice Ask after the official warning. “We agree that there is no indication of concrete targets, concrete dates and concrete terror groups,” added German Interior Minister Thomas de Maiziere.\r\n\r\n(ARTICLE CONTINUES BELOW)\r\n\r\n\r\n\r\nStock up with Fresh Food that lasts with eFoodsDirect (AD)\r\n\r\nThese and countless other over hyped and completely manufactured threats have led directly to programs such as the “See Something, Say Something” campaign – a literal citizen spy operation overseen by the DHS, that is creating more paranoia and hysteria, if anything serving to make any real terror threat more likely to go undiscovered.\r\n\r\nIn addition to the invasion of traditional and new social media, The Federal Communications Commission announced recently that it has approved a presidential alert system.\r\n\r\nCommissioners voted in February to require television and radio stations, cable systems and satellite TV providers to participate in a test that would have them receive and transmit a live code that includes an alert message issued by the president. No date has been set for the test, according to the Washington Post, which described it as being like something out of Orwell’s 1984.\r\n\r\nSoon enough the creepy and invasive broadcasts that are already being played on giant telescreens in Walmarts across the nation will be in your front room.\r\n\r\nThe DHS is slowly creeping into the lives of every American to the point where it can no longer be sidestepped. Fattened federal agencies are using the over hyped threat of terrorism as an excuse to normalize the notion that the people are servants of the government, rather than the government acting as servant to the people.\r\n\r\nAct now, lobby your multimedia providers to resist government efforts to make it mandatory for them to hand over unfettered access to their communications networks.", "group_id": 3920, "id": 820888}]