[{"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300138902.162914, "message": "See the HN post for more details and my story: http://news.ycombinator.com/item?id=2321382", "group_id": 95, "id": 351334}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300138903.4807439, "message": "Thanks!", "group_id": 95, "id": 351335}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300138719.1048441, "message": "Nothing crazy: it's not an awesome Node.js color picker, and it's not going to revolutionize communication. It's a student grade tracking tool. I noticed that there was a market for personal grade tracking, and went for it. I'm mostly curious as to how to get more users. Should I introduce some social functionality into the app? How can I make money off it?", "group_id": 95, "id": 351320}, {"user_id": 18129, "stars": [], "topic_id": 13081, "date_created": 1300214279.5439799, "message": "Clickable: http://www.getachiever.com", "group_id": 95, "id": 359276}, {"user_id": 18129, "stars": [], "topic_id": 13081, "date_created": 1300214370.6624429, "message": "You should definitely introduce social functionality.  At least the ability to log in with Facebook.", "group_id": 95, "id": 359287}, {"user_id": 18129, "stars": [], "topic_id": 13081, "date_created": 1300214567.3266549, "message": "Gain traction among students, then build another product for teachers.  Charge schools for that.  If you can create some social mechanism that improves students' grades, then it will be easier to convince schools to pay up.  Alternatively, once you know everyone's grades, create a market place for tutoring services that connects the top students with the bottom students.", "group_id": 95, "id": 359310}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300225065.383007, "message": "@pcardune: I'm considering every single one of the ideas you mentioned already. I really like them. After building this product I realized that there's an even bigger market of teachers who want tools that don't suck ass.", "group_id": 95, "id": 360311}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300225183.4795401, "message": "@pcardune: Also, thanks! The only thing I'm scared of is being Zynga. I don't know anything more depressing than asking people to share every two actions, no matter how good of a strategy that is.", "group_id": 95, "id": 360327}, {"user_id": 22043, "stars": [], "topic_id": 13081, "date_created": 1300326430.9586029, "message": "I think you should definitely link up with facebook. You could even validate that they're using an .edu email which would provide more demographics. Social aspects I'd incorporate is which of your friends took the class before, an anonymous average of your friends' scores in the class. It would add a lot to the product that something like excel never could.", "group_id": 95, "id": 370787}, {"user_id": 21634, "stars": [], "topic_id": 13081, "date_created": 1300326795.457283, "message": "@pcardune thanks for putting a link to the site. Can't believe OP didn't do that.", "group_id": 95, "id": 370824}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300328235.7137101, "message": "@danelabonte: Got used to HN not allowing hyperlinks!", "group_id": 95, "id": 370918}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300328282.9395051, "message": "@mttwrnr: That's good, but the latter stuff requires a large user base it seems. Facebook linkup is my top priority now.", "group_id": 95, "id": 370922}, {"user_id": 3531, "stars": [], "topic_id": 13081, "date_created": 1300342712.6154771, "message": "@pcardune I like the idea of FB connect, but aside from that, what did you mean by \"social functionality?\"", "group_id": 95, "id": 371906}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300344650.3931861, "message": "@michaelschade: Allowing users to post grades to FB, for example, would help create virality.", "group_id": 95, "id": 372000}, {"user_id": 17523, "stars": [], "topic_id": 13081, "date_created": 1300344681.392966, "message": "@michaelschade: I'm guessing that's part of what he means. That's what it means to me.", "group_id": 95, "id": 372002}]