[{"user_id": 11626, "stars": [], "topic_id": 7623, "date_created": 1298198836.7464409, "message": "http://www.rawstory.com/rs//wp-content/uploads/2011/02/internet1.jpg\r\n\r\nWASHINGTON – A bipartisan trio of senators has introduced a new cybersecurity bill that eliminates the president's authority to switch off the Internet.\r\n\r\nThe \"kill switch,\" as it's known, exists in the 1934 Telecommunications Act, which was amended in 1996. It gives the president powers to shut off all regulated telecommunications if he or she deems it vital to national security interests.\r\n\r\nBut that's not going to fly any more, say Sens. Joe Lieberman (I-CT), Tom Carper (D-DE) and Susan Collins (R-ME).\r\n\r\nThe three senators on Thursday introduced The Cybersecurity Freedom Act of 2011, which would take away the president's power to shut off the Internet.\r\n\r\nThe measure states that \"neither the president, the director of the National Center for Cybersecurity and Communications, nor any other officer or employee of the federal government should have the authority to shut down the Internet.\"\r\n\r\nLieberman said part of the purpose was to clear up controversy surrounding cybersecurity legislation he introduced last year, which was mistakenly thought to have created a kill switch but merely limited the president's ability to use the feature.\r\n\r\n\"We want to clear the air once and for all,\" said Lieberman, the chairman of the Homeland Security committee. \"...There is no so-called 'kill switch' in our legislation because the very notion is antithetical to our goal of providing precise and targeted authorities to the president.\"\r\n\r\n\"This legislation applies to the most critical infrastructures that Americans rely on in their daily lives -- energy transmission, water supply, financial services, for example - to ensure that those assets are protected in case of a potentially crippling cyber attack.\"\r\n\r\nCollins added that the legislation contains \"explicit language prohibiting\" a US president from doing what Egyptian President Hosni Mubarak did.\r\n\r\n\"Our bill contains protections to prevent the president from denying Americans access to the Internet,\" she said.\r\n\r\nNextGov reports that the bill would also \"allow judges to review the government's designations of so-called covered critical infrastructure, or systems that could cause catastrophes if disrupted.\"\r\n\r\nhttp://www.rawstory.com/rs/2011/02/18/new-bill-strips-presidents-power-to-shut-off-internet", "group_id": 3920, "id": 153005}]