[{"user_id": 4375, "stars": [], "topic_id": 7622, "date_created": 1298386218.763783, "message": "I'm not sure what AOL's policies are, but unless they violate human rights somehow, I suspect I'll do what I do with any blog - read if the content's good.  I don't just go to TC from their front page.  I find articles that people have shared or end up on sites like HN.", "group_id": 142, "id": 179392}, {"user_id": 7064, "stars": [], "topic_id": 7622, "date_created": 1298472823.338578, "message": "Yes, what are the special AOL policies that will make people like Arrington suddenly lose their minds or stop speaking them? Link please?", "group_id": 142, "id": 187887}, {"user_id": 14492, "stars": [], "topic_id": 7622, "date_created": 1298479730.2642, "message": "I stopped reading it some 2 years ago and I haven't missed it one single day...", "group_id": 142, "id": 188632}, {"user_id": 14970, "stars": [], "topic_id": 7622, "date_created": 1298480737.586591, "message": "I'm not too familiar with AOL's policies, please inform us. I doubt AOL's policies will hinder any of their acquisitions as they are moving very heavily towards becoming a multimedia, content origination company. With that said, I am not an avid follower of TechCrunch but do land on their site due to links and anything that catches my eye in Google Reader.", "group_id": 142, "id": 188777}, {"user_id": 20138, "stars": [], "topic_id": 7622, "date_created": 1299992347.4943841, "message": "What policies? Ha. I will never stop reading Tech Crunch.", "group_id": 142, "id": 338976}, {"user_id": 13786, "stars": [], "topic_id": 7622, "date_created": 1300370739.241679, "message": "Does anyone else find it odd that TC publishes AOL internal memo's...!!! Would \"any\" employee be allowed to publish publicly their employers internal memos?  Is seem to me they are free to do whatever they want and don't have to follow any policies...", "group_id": 142, "id": 374094}, {"user_id": 22652, "stars": [], "topic_id": 7622, "date_created": 1300447566.4719219, "message": "I guess my attitude would be that any aggravating or irritating  internal memo will get leaked. Management is clueless if they do not think so.  But then managers do not always think about consequences. I read TC and even get it on the Kindle.", "group_id": 142, "id": 381277}]