[{"user_id": 11626, "stars": [], "topic_id": 42553, "date_created": 1311458631.0634229, "message": "Welcome to the \"False-Flag Friday\" edition of SCMLA's News Digest!\r\n\r\n\r\nCorporate Media Runs False CIA Story Stating Muslim Group Claimed Responsibility For Oslo Bombings\r\nAlexander Higgins\r\nJuly 22, 2011\r\n\r\nThe CIA falsely claims a Muslim “terrorist” organization has claimed responsibility for the Oslo, Norway bombings and the corporate media is printing their lies. All major news outlets ran a report from a CIA analyst claiming a Muslim terrorist group took credit for the Oslo Norway bombings, which the corporate media is trying so desperately to blame on Al-Qaeda . Even though it would make no sense for Muslims to attack Norway, who is their ally. Regardless of the absurdity of the claim, the CIA has falsely stated that a Muslim Jihad group  has accepted responsibility for the attacks Norway bombings and now the corporate media is running their lies.\r\nhttp://blog.alexanderhiggins.com/2011/07/22/corporate-media-runs-false-cia-story-stating-muslim-group-claimed-responsibility-olso-bombings-40311\r\n\r\nOslo Police Conducted Bombing Exercise Days Before Terrorist Blast\r\nPrison Planet.com\r\nJuly 22, 2011\r\n\r\nIn yet another example of how almost every major terror event is accompanied by a security drill focused around the same scenario, Oslo police were conducting a bombing exercise at a location near the Oslo Opera House just 48 hours before a terrorist blast hit a government building in the Norwegian capital. According to the translated version of an Aftenposten report, “Anti-terror police fired explosive charges at a training center in Oslo, two hundred meters from the Opera, but forgot to notify the public.” The exercise occurred on Wednesday and revolved around anti-terror units attacking a disused building at the edge of Bjørvika pier with bombs and firearms. “The men lowered themselves down from the roof and in through the window that had just been blown out, while they fired hand their weapons,” states the report, noting that the exercise was “dramatic,” produced “violent bangs,” and was watched by spectators at the nearby Opera House. A video of the drill that accompanies the story shows police scaling the side of a building with an explosion going off below them before they enter the window and start firing. Police had to publicly apologize today for not informing the public about the exercise. Although it’s too early to judge the nature of this exercise, the fallback of a drill, which gives the state an excuse should any evidence of complicity in the real attack emerge, has been evident in previous major terror events, including both 7/7 and 9/11.\r\nhttp://www.infowars.com/oslo-police-conducted-bombing-exercise-days-before-terrorist-blast\r\n\r\nWhite al-Qaeda Narrative Emerging in Norway Terror Attack\r\nInfowars.com\r\nJuly 22, 2011\r\n\r\nUpdate: Police in Norway say the man accused of killing more than 20 people at a youth camp is connected to the bombing of government buildings. Security experts are speculating that the attacks in Norway are the work of both Islamists and right-wing extremists. “Security experts say suspicion is likely to fall on both Islamists and right-wing extremists following a deadly bombing and a shooting at a political gathering in tranquil Norway,” reports Reuters. “It was not clear if the attacks were linked, but the possibility of a complex, hybrid assault made it difficult to make an early call as to the likely political orientation of the assailants, security experts said.\" Following the bombing of Norway’s main government building in the capital Oslo, there was a shooting incident at Utoeya, an island south of Oslo where Prime Minister Jens Stoltenberg’s Labor party youth section’s yearly gathering was taking place. The assailant was reportedly dressed as a policeman. He appeared to be Norwegian with blonde hair, thus fueling the right-wing element suggested by security experts.\r\nhttp://www.infowars.com/white-al-qaeda-narrative-emerging-in-norway-terror-attack\r\n\r\nOslo Bombing: Why Would “Terrorists” Attack Near-Empty Office Building on Public Holiday?\r\nInfowars.com\r\nJuly 22, 2011\r\n\r\nDaily Mail reports: Fortunately, it is a public holiday in Norway and the offices are less busy than a normal weekday. Why would “terrorists,” who presumably want to kill as many people as possible, choose to bomb the building on a day when they know it will be almost empty? Comment from a reader: I’m from Norway and here are some little reported facts: 1) Fact: A person dressed as a cop has shot and killed at least 5 members of the youth organization of the governing labour party in their convention at Utøya. He is now captured. Comment: False cops? These are professionals. The shootings happened at the same time as the explosion, but far, far away from each other (several houres + you have to take a boat to get to the island). 2) Fact: The explosion took place downtown in the height of the holiday, with all the surrounding buildings (many important press, union and governmental buildings, including the labour party) being almost empty. At a normal day thousands would have been killed and wounded. Today, only a handful dead and wounded. Comment: Why would terrorists choose a timing with less impact? Now, if this is a black-operation in order to influence opinion, it makes sense. 3) Fact: My friend’s father is a dynamiter blaster expert by profession. He has worked with explosions for 35 years. He noticed that the ground was raised so that the armouring which had been below the ground now lay above the ground. For this to happen the explosion have had to happen UNDER the ground, like if a gas tube had exploded (there was road/sewer work in the exact area for several days prior to this). When the ground is raised like this, as was apparent on the news, it can not have been a car bomb like the media speculates. People have been smelling sulphur all over downtown. Comment: Who had the resources to get access underground? Not the fundamentalist simpleton, to be sure. 4) Fact: After less than one hour the police concluded that it was a “bomb”. Comment: How can they have determined this so quickly? There has been complete chaos, people are evacuated and even corpses was not removed within an hour. How could they determine this so quickly? How could they rule out an accident in the gas pipes? This smells fishy. I will continue to update here from Oslo if anything else suspicious pops up.\r\nhttp://www.infowars.com/oslo-bombing-why-would-terrorists-attack-near-empty-office-building-on-public-holiday\r\n\r\nOslo Bombing: Is CIA Contact Krekar to Blame?\r\nInfowars.com\r\nJuly 22, 2011\r\n\r\nIt is too early to say who is responsible for the bombing of government buildings in Oslo, Norway, that killed at least two people and injured several others. The media is instinctively blaming al-Qaeda, but there is another possible culprit – Mullah Krekar and his Kurdish Islamist group Ansar al-Islam. On July 12, it was reported that a Norwegian prosecutor filed terror charges against the Iraqi-born cleric Krekar after he allegedly threatened Norwegian politicians with death if he’s deported from the country. Krekar went to Norway in 1991 as a refugee from northern Iraq. Authorities from the Kurdistan regional government have repeatedly asked Norway to extradite Krekar for his role in terrorist attacks carried out by the group he founded, Ansar al-Islam. Members of the group are veterans of the CIA-ISI collaborative war against the Soviets in Afghanistan. The group killed an Australian journalist and is believed to involved in the attempted bombing of a DoD office in Arbil, Iraq, in 2003. Krekar has an interesting background. As I wrote in 2005, he was approached by the CIA to work with them. In 2003, he told the al-Hayat newspaper he had “a meeting with a CIA representative and someone from the American army in the town of Sulaymaniya (Iraqi Kurdistan) at the end of 2000. They asked us to collaborate with them,” an offer Krekar said he refused. Krekar threatened to expose his link to the CIA after the U.S. accused Ansar al-Islam of teaming up with al-Qaeda. “I have in my possession irrefutable evidence against the Americans and I am prepared to supply it … if (the United States) tries to implicate me in an affair linked to terrorism,” he told the newspaper.\r\nhttp://www.infowars.com/oslo-bombing-is-cia-contact-krekar-to-blame\r\n\r\nGiant blast hits government buildings in Oslo, Norway\r\nCNN\r\nJuly 22, 2011\r\n\r\nA giant explosion rocked government buildings in Oslo, Norway, on Friday, state TV broadcaster NRK said, with at least two people confirmed dead. Windows in several buildings had been blown out, and people were in the street bleeding, NRK said on its website. The cause of the blast remains unknown. There are conflicting reports about whether a second blast followed the first, which occurred mid-afternoon in the center of the Norwegian capital.\r\nhttp://www.infowars.com/giant-blast-hits-government-buildings-in-oslo-norway\r\n\r\nFeds Profiling Whites, Middle Class Americans As Terrorists\r\nOnly when conservatives realize they are as big a target of the “war on terror” as Muslims will we see the police state dismantled.\r\nInfowars.com\r\nJuly 22, 2011\r\n\r\nA shocking Department of Homeland Security video that caused outrage yesterday after it depicted white Americans as the most likely terrorists only confirms that the federal government is now profiling middle class America as the main terror threat, something that becomes made abundantly clear when one studies the history of training manuals and other literature put out by the feds that identifies politically active US citizens as domestic extremists. On the day that Janet Napolitano repeated rhetoric about “domestic terror” being the primary security threat, a newly released DHS video caused outrage by depicting white Americans as the most likely terrorists. The footage illustrated a number of scenarios encouraging people to report suspicious activity, and in almost every case the evildoer was a white American and in not one case was the terrorist a Muslim or an Arab. Far from representing some superficial nod to political correctness, this is in fact a deliberate effort by the feds to characterize white, middle class, politically engaged Americans as domestic extremists. It’s all part of the agenda to frame dissent against big government as dangerous radicalism. Contrary to claims by the DHS that it does not profile, the bulk of literature and other training tools issued by the federal government over the last decade clearly go to great lengths to demonize informed, middle class, and predominately white Americans as the most likely terrorists, despite the fact that the 126 people who were indicted on terrorist-related charges in the United States over the last two years were all Muslim.\r\nhttp://www.infowars.com/feds-profiling-whites-middle-class-americans-as-terrorists\r\n\r\nDHS Denies “Racial Overtones” In ‘White Middle Class Terrorists’ Video\r\nInfowars.com\r\nJuly 22, 2011\r\n\r\nFollowing widespread outrage yesterday, the Department of Homeland Security has ludicrously denied that a video it released encouraging Americans to report suspicious activity contains “racial overtones,” despite the fact that the overwhelming majority of people depicted as terrorists in the clip are white middle class Americans. The story, first featured on Infowars.com, went viral yesterday, appearing on the Drudge Report, Fox News, Breitbart.tv, the Daily Mail as well as featuring highly amongst the most read articles on the entire Internet during that 24 hour period. The Fox Nation version of the story received well over 2000 comments. The Department of Homeland Security was forced to issue a terse response to the controversy. The DHS confirm “the video is theirs but adamantly deny there are any racial or politically correct overtones to it.” Really? Then why out of all the scenarios shown in the video that depict terrorists are no less than 12 of them white people and only three are minorities? In addition, of the people depicted as patriotic Americans for reporting the terrorists, only one of them is white seven are from minorities. Furthermore, at the start of the clip, the majority of citizens depicted as proud Americans and potential victims of terror are from minorities. Examples of terrorists who have been arrested in recent years are shown later in the clip – four are white Americans and only one is a foreign Muslim.\r\nhttp://www.infowars.com/dhs-denies-racial-overtones-in-white-middle-class-terrorists-video\r\n\r\nBeware of a Possible False Flag Event, Media & Feds Pushing Fear for 10th Anniversary of 9/11 (video)\r\nFederal Jack\r\nJuly 21, 2011\r\n\r\nhttp://youtu.be/nzqgPF6nHfk\r\n\r\nGrassley Sees DOJ Cover Up in ‘Fast and Furious’ Investigation\r\nCNS News\r\nJuly 21, 2011\r\n\r\nA senior Senate Republican has accused the Justice Department of a “cover-up” by limiting information to Congress about a botched gun running program along the southwest border. “I think they’re trying to cover up now by not giving us all the information that we want,” Sen. Charles Grassley (R-Iowa), the ranking member of the Senate Judiciary Committee, told CNSNews.com. “In regard to criminality, this is quite obvious there is criminal activity when our own government suggests our own laws ought to be broken,” he said. “Isn’t it just as criminal if we do that, as [it would be] if Chuck Grassley did it as a private citizen?” Grassley is investigating a gun running operation led by the Phoenix division of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), and also involving the Drug Enforcement Administration and FBI.\r\nhttp://www.cnsnews.com/news/article/grassley-sees-doj-cover-fast-and-furious\r\n\r\nBig Sis Spy Story Goes Viral\r\nPrison Planet.com\r\nJuly 21, 2011\r\n\r\nOur earlier story about Homeland Security brainwashing minorities to report white people as domestic terrorists has gone viral – after being linked on the Drudge Report, the story is now the number six most read article on the entire Internet, according to the Alexa ranking system.\r\nhttp://www.infowars.com/big-sis-spy-story-goes-viral\r\n\r\nLatest DHS Fear-mongering: al-Qaeda Plans to Take Out Nuke Plant\r\nInfowars.com\r\nJuly 21, 2011\r\n\r\nThe Department of Homeland Security has issued a report warning that “insiders” are likely to conduct a terror attack on a major utility facility, including a chemical or oil refinery. The warning was sent out on Tuesday. “Based on the reliable reporting of previous incidents, we have high confidence in our judgment that insiders and their actions pose a significant threat to the infrastructure and information systems of U.S. facilities,” the bulletin states. “Past events and reporting also provide high confidence in our judgment that insider information on sites, infrastructure, networks, and personnel is valuable to our adversaries and may increase the impact of any attack on the utilities infrastructure.” The feds cite a supposed intelligence trove discovered at a house in Pakistan where Osama bin Laden was allegedly killed by Navy SEALS. The government has yet to provide conclusive evidence of the assassination and changed important details of its narrative numerous times. Neighbors in Abbottabad said they never saw the six foot five terrorist at the compound where he was allegedly killed and describe the much lauded assassination as a hoax. Information supposedly gleaned from this unsubstantiated trove is at the heart of the latest DHS effort to frighten Americans into accepting the ongoing conversion of America into a Gestapo police state.\r\nhttp://www.infowars.com/latest-dhs-fear-mongering-al-qaeda-plans-to-take-out-nuke-plant\r\n\r\nDHS Video Characterizes White Americans as Most Likely Terrorists\r\nInfowars.com\r\nJuly 21, 2011\r\n\r\nA new promotional video released by the Department of Homeland Security characterizes white middle class Americans as the most likely terrorists, as Big Sis continues its relentless drive to cement the myth that mad bombers are hiding around every corner, when in reality Americans are just as likely to be killed by lightning strikes or peanut allergies. The video is part of Homeland Security’s $10 million dollar “See Something, Say Something” program that encourages Americans to report “suspicious activity,” which in every case throughout history has been a trait of oppressive, dictatorial regimes. In the course of the 10 minute clip, a myriad of different behaviors are characterized as terrorism, including opposing surveillance, using a video camera, talking to police officers, wearing hoodies, driving vans, writing on a piece of paper, and using a cell phone recording application. Despite encouraging viewers not to pay attention to a person’s race in determining whether or not they may be a terrorist, almost all of the scenarios in the clip proceed to portray white people as the most likely terrorists. Bizarrely, nearly every single one of the “patriotic” Americans who reports on their fellow citizen is either black, Asian or Arab. Imagine if the video had portrayed every terrorist as an Arab and every patriotic snoop as white, there’d be an outcry and rightly so, but this strange reversal must have been deliberate on the part of the DHS, but why? Is this merely political correctness taken to the extreme or is something deeper at work?\r\nhttp://www.infowars.com/dhs-video-characterizes-white-americans-as-most-likely-terrorists\r\n\r\nBig Sis Tries to Turn Minorities Against Whites by Labeling Them Terrorists\r\nInfowars.com\r\nJuly 21, 2011\r\n\r\nSee something say something TV ads sell the false idea that white terrorists are hiding under every rock and only Big Brother can keep minorities safe from white killers. For 9 years this has been taught to police behind closed doors, now they are rolling it out in public. The propagandists sell good old boys on the police state to “keep us safe from Al-CIA-DA” then they turn it around on the whole public. Some whites are racist against minorities so the Federal takeover is sold in the name of getting the “evil” brown people. Then the social engineers flip it and tell the racists that happen to have dark skin it is the whites to look out for. Total divide and conquer is the outcome. Every one is bad but the real terrorists that actually stage the attacks, our loving protectors the FEDS.\r\nhttp://www.infowars.com/big-sis-tries-to-turn-minorities-against-whites-by-labeling-them-terrorists\r\n\r\nAP Interview: Planes still top of terror wish list\r\nAssociated Press\r\nJuly 21, 2011\r\n\r\nWASHINGTON – Ten years after al-Qaida used hijacked airliners as missiles to attack the United States, terrorists continue to target aviation more than any other potential U.S. vulnerability, Homeland Security chief Janet Napolitano said Thursday. As the country prepares to commemorate the anniversary of the attacks of Sept. 11, 2001, Napolitano expects questions about whether the U.S. is safer than it was 10 years ago, after all of the security enhancements and the targeted killing of terror leader Osama bin Laden. \"The answer is yes, but there are no guarantees in a world of ever-evolving threats,\" she told The Associated Press in an interview. The Sept. 11 attacks prompted the largest government reorganization in decades, drastically changed U.S. security policies and led to billions in spending to strengthen U.S. terrorism defenses. Many of the changes, such as the linkages of federal intelligence databases and deployment of nuclear detection technology at ports, are not obvious to the American public. But a trip through one of the country's 457 airports is an instant reminder of how much has changed.\r\nhttp://old.news.yahoo.com/s/ap/20110721/ap_on_go_ca_st_pe/us_napolitano_interview\r\n\r\nEven Dead, Osama Has a Winning Strategy (Hint: It’s Muhammad Ali’s)\r\nDanger Room (Wired.com)\r\nJuly 20, 2011\r\n\r\nOsama bin Laden is dead. And the Obama administration that killed him is smelling the successful conclusion to the war on terrorism. “There will come a time when they simply can no longer replenish their ranks,” White House counterterrorism chief John Brennan declared. “We’re within reach of strategically defeating al-Qaida,” Defense Secretary Leon Panetta echoed. Nonsense, says Daveed Gartenstein-Ross, a counterterrorism analyst at the conservative Foundation for the Defense of Democracies. Sure, bin Laden’s dead. But he already prompted the U.S. to spend itself into the economic abyss on endless wars, a bloated surveillance and intelligence apparat, and homeland security measures that are better at showing your asscheeks than catching terrorists. Osama even told us he was going to do that on one of his mixtapes — it’s called his “Bleed to Bankruptcy” strategy. In death, he’s winning.\r\nhttp://www.wired.com/dangerroom/2011/07/even-dead-osama-has-a-winning-strategy-hint-its-muhammad-alis\r\n\r\nAl-Qaida plans cartoon recruiting film for kids \r\nAssociated Press\r\nJuly 20, 2011\r\n\r\nLONDON (AP) -- An al-Qaida affiliate says it plans to roll out what some have called a Disney-like animated cartoon aimed at recruiting children to the terror network. Scenes from the proposed short film show young boys dressed in battle fatigues and participating in raids, killings and terror plots. It is the latest attempt by the terror organization to use multimedia to draw in potential recruits. Recently, a Yemen-based extremist group released an online women's magazine with makeup and chastity tips. News of the animated film was announced by a group called Abu al-Laith al-Yemen on the Arabic-language al-Shamouk jihadist website, the London-based Quilliam Foundation reported Wednesday. Quilliam, which was formed by former jihadists and now aims to stamp out extremism, said it appears the group is affiliated with al-Qaida in the Arabian Peninsula. \"It's a Disney-like film aimed at kids that tells stories of the Prophet, stories of holy wars and anti-Western propaganda,\" said Noman Benotman, a former jihadist with links to al-Qaida who is now an analyst at Quilliam. \"But I think it could backfire. Families will be angry that al-Qaida is directing this at their children.\"\r\nhttp://ap.stripes.com/dynamic/stories/E/EU_BRITAIN_AL_QAIDA_CARTOON?SITE=DCSAS&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2011-07-20-21-01-07\r\n\r\nNew Terror Report Warns of Insider Threat to Utilities\r\nABC News\r\nJuly 20, 2011\r\n\r\nSabotage by an insider at a major utility facility, including a chemical or oil refinery, could provide al Qaeda with its best opportunity for the kind of massive Sept. 11 anniversary attack Osama bin Laden was planning, according to U.S. officials. A new intelligence report from the Department of Homeland Security issued Tuesday, titled Insider Threat to Utilities, warns \"violent extremists have, in fact, obtained insider positions,\" and that \"outsiders have attempted to solicit utility-sector employees\" for damaging physical and cyber attacks. \"Based on the reliable reporting of previous incidents, we have high confidence in our judgment that insiders and their actions pose a significant threat to the infrastructure and information systems of U.S. facilities,\" the bulletin reads in part. \"Past events and reporting also provide high confidence in our judgment that insider information on sites, infrastructure, networks, and personnel is valuable to our adversaries and may increase the impact of any attack on the utilities infrastructure.\"\r\nhttp://abcnews.go.com/Blotter/terror-alert-warns-insider-threat-infrastructure/story?id=14118119\r\n\r\nAnthrax Attacks: Justice Dept. Destroys FBI Case Then Does A 180 Reversal Days Later\r\nInfowars.com\r\nJuly 20, 2011\r\n\r\nIn a remarkable turn of events that has been relatively buried in the headlines this week, the Justice Department called into serious question a key pillar of the criminal case against the FBI’s prime suspect in the 2001 anthrax attacks, before completely reversing it’s own conclusion just days later... In the filing dated July 15, Justice Department lawyers noted that the Army’s biodefense center at Fort Detrick, Md., “did not have the specialized equipment in a containment laboratory that would be required to prepare the dried spore preparations that were used in the letters.” In other words, Ivins’ lab, often referred to as the “hot suite”, did not contain the equipment needed to turn liquid anthrax into the refined powder that ended up being mailed to members of the Senate and reporters in the fall of 2001.... Ivins, who was found dead in 2008 from an apparent suicide at the same time the government was about to indict him, was identified by the FBI’s “Amerithrax Task Force” as the lone perpetrator of the attacks that killed five people and infected 17 others in the weeks immediately following 9/11. The FBI based it’s entire case against Ivins on the fact that the microbiologist had access to the necessary equipment in the government lab at the U.S. Army Medical Research Institute of Infectious Diseases where he worked. When the Justice Department realized that the latest court filing cast serious doubt on these claims about the anthrax attack, it did a 180 flip flop and sent the court a “list of corrections”. What the filing should have said, the department wrote, was that while the Army lab did not have a lyophilizer, a freeze-drying machine, in the space where Dr. Ivins usually worked, there was a lyophilizer and other equipment in the building that he could have used to dry the anthrax into powder. Even if this was the case, which is still highly questionable, it still significantly weakens the case against Ivins as the lone assailant, because it means he would have had to have access different areas of the building and use the equipment in those areas for some time without being noticed. It also means that the fact that others who worked in the lab were not sickened becomes even more of a key indicator that Ivins did not prepare the anthrax spores as the FBI and the government has claimed he did.\r\nhttp://www.infowars.com/anthrax-attacks-justice-dept-destroys-fbi-case-then-does-a-180-reversal-days-later\r\n\r\nReport: NZ quake exposes possible Israeli spy ring\r\nNewspaper: One victim may have been agent, and police computers may have been target\r\nmsnbc.com\r\nJuly 20, 2011\r\n\r\nOne of the victims of the February earthquake in Christchurch, New Zealand, may have been an Israeli spy, according to a report in The Southland Times. The man, Ofer Benyamin Mizrahi, was carrying five passports with him at the time of his death, according to the Times. The newspaper's reports centered around a possible breach of New Zealand's national police computers... Misrahi and 3 other people were in a van that was crushed by a falling pillar. Misrahi was killed, but the others were able to extricate themselves, the Times said. Mizrahi's 3 companions, 1 man and 1 women, photographed the crushed van and rendezvoused at a city square that Israeli officials had designated an \"emergency meeting point,\" then were able to travel back to Israel within 12 hours, The Southland Times said. New Zealand authorities later confronted an \"unaccredited Israeli search and rescue squad\" and removed it from the sealed-off area in the city, the Times said. This squad was one of two private search parties brought from Israel to New Zealand, without prior coordination with local authorities in New Zealand, Haaretz reported.... Adding to the intrigue is a comment posted on the website of Pravda, a Russian newspaper. The comment said the earthquake disrupted an Israeli spy base in Christchurch.\r\nhttp://www.msnbc.msn.com/id/43817498/ns/world_news-asia_pacific\r\n\r\nMass Murder Merger: Petraeus Moves to CIA\r\nInfowars.com\r\nJuly 19, 2011\r\n\r\nThe elite have once gain shuffled the deck. This time the consummate bureaucrat and insider Leon Panetta moves to the Defense Department and Gen. David Petraeus sets sail for the CIA. But the move is more than a game of musical chairs. Petraeus will manage the next phase of the so-called war on terror. As Jack D. Douglas notes for LewRockwell.com, Petraeus “has become the official head of the CIA to consolidate the Murder Black Ops of the CIA with those of the military forces. The Murder Drone Ops are being very rapidly expanded into a worldwide Murder and Invasion Special Ops Force.” In addition to killing civilians designated al-Qaeda terrorists in Pakistan’s unruly tribal area, the Drone Ops are moving into Yemen and Somalia. The corporate media, reading their Pentagon scripts closely, have described this as Obama’s bold new anti-terror policy following the unsubstantiated but widely accepted (by the corporate media) assassination of the dialysis patient Osama bin Laden. “The Obama administration’s increased focus on Somalia comes as the White House has unveiled a new strategy to battle al-Qaida in the post-Osama bin Laden era, and as some U.S. military and intelligence officials view al-Qaida affiliates in Yemen and Somalia as a greater threat to the United States than the group of operatives in Pakistan who have been barraged with hundreds of drone strikes directed by the CIA in recent years,” the Grand Master of establishment propaganda, the New York Times, reported last week. Al-Qaeda in Yemen is allegedly run by American citizen and Pentagon dinner guest, Anwar Awlaki. He has successfully managed a number of remarkably incompetent patsies and drooling idiots who are portrayed as al-Qaeda’s ominous shock troops. Yemen represents an important landmark in the evolving war on cave dwellers and other largely mythical enemies of the empire.\r\nhttp://www.infowars.com/mass-murder-merger-petraeus-moves-to-cia\r\n\r\nTerrified phone-hacking whistleblower feared for his life before he was found dead\r\nUK Daily Mail\r\nJuly 19, 2011\r\n\r\nThe man who launched the entire phone hacking scandal had become a paranoid recluse who believed someone was out to get him, a friend has revealed. Sean Hoare, who was found dead at his flat in Watford, Hertfordshire, yesterday, had spent much of the last weeks of his life ‘hiding’ in his flat with the curtains drawn. Last night a friend and neighbour claimed Mr Hoare, 47, had become increasingly reclusive and paranoid in recent weeks. ‘He would talk about someone from the Government coming to get him,’ he said. ‘He’d say to me, “If anyone comes by, don’t say I’m in”. ‘He was physically going downhill. He was yellow in colour and wasn’t looking well for the last month. ‘He had a constant struggle with alcohol and talked to me about how much he had put his wife through. ‘He did say something about phone hacking and I think that was his main worry. He had definite concerns with the media. He did mention he was paranoid and would mention conspiracy stuff.’ Former News of the World journalist Mr Hoare had accused former Tory media chief Andy Coulson of lying about his role in the affair.\r\nhttp://www.dailymail.co.uk/news/article-2016132/Sean-Hoare-dead-No-involved-phone-hacking-whistleblowers-death.html\r\n\r\nPost-9/11, biggest terror threat is underground\r\nAssociated Press\r\nJuly 18, 2011\r\n\r\nNEW YORK – It's the morning rush in the Times Square subway station, a routine convergence of humanity and mass transit that makes New York City hum. Mixing seamlessly with subway riders are New York Police Department officers with heavy body armor and high-powered rifles, commanders in blue NYPD polo shirts carrying smart phone-size radiation detectors and a panting police dog named Sabu. \"This is the new normal,\" Inspector Scott Shanley of the NYPD's Counterterrorism Division says. \"The only people who sometimes get raised up are tourists.\" Since terrorists brought down the twin towers on Sept. 11, 2001, subways have been bombed in terror attacks across the world, including in Madrid, London and this spring in Minsk, Belarus. The possibility that New York's sprawling, porous and famously gritty subway system could be next has become a constant worry — leading to a new normal of suspicious package alerts, bomb-sniffing dogs, cameras trained on commuters and passengers listening to the missive, \"if you see something, say something.\" The campaigns encouraging residents to report suspicious activity strike Manhattan writer Anne Nelson, 57, as Orwellian. \"New York is about expression and life and vibrancy,\" she said, walking through Times Square. \"It's not about living in an atmosphere of fear.\" But authorities here believe a serious attack on the 24-hour subway system with more than 400 stations, would potentially cripple the city in ways worse than the Sept. 11 attack — a concern shared by U.S. cities and countries reliant on mass transit and viewed as enemies by terrorists.\r\nhttp://old.news.yahoo.com/s/ap/20110718/ap_on_re_us/us_sept11_subways\r\n\r\nWas TWA 800 Shot Down By a Military Missile?\r\nWhat Really Happened\r\nJuly 18, 2011\r\n\r\nIn 1996 TWA Flight 800 was shot down south of Long Island. The government of the United States, despite the embarrassment of having been caught in court rigging lab tests and lying in its reports, still officially attributes the disaster to a spark in the center fuel tank, while government spokespeople insist that the witnesses who saw a missile hit the jumbo jet are all drunks. On the evening of July 17th, 1996, shortly after the sun had set, but while the sky was still light, a Boeing 747-131 jetliner, TWA's flight 800, was taking off from JFK airport on its way to Paris, France. On board were 230 people. Approximately 11 minutes into the flight, the 747 was flying at an altitude of 13,700 MSL, or 13,700 feet above sea level. Normally higher at 11 minutes, flight 800 had delayed climbing to make room for another jetliner descending into Rhode Island. The plane was over the Atlantic ocean south of Long Island, New York. Just as flight 800 received clearance to initiate a climb to cruise altitude, the plane exploded without any warning. Thousands of pounds of kerosene, dumped from the center and wing tanks, vaporized and ignited, creating a fireball seen all along the coastline of Long Island. Under the orange glow of the fireball, sections of the 747 tumbled into the ocean. So completely had the plane broken up that weather radar confused the expanding bubble of debris for a cloud....\r\nhttp://whatreallyhappened.com/RANCHO/CRASH/TWA/twa.php\r\n\r\nExperts Warn of al-Qaeda Attack If Debt Ceiling Not Raised\r\nInfowars.com\r\nJuly 17, 2011\r\n\r\nIt’s not enough to frighten Americans with personal financial disaster if the massive debt scam is not perpetuated. In order to send the message, the government has decided to stoke up the al-Qaeda threat.\r\nphotoLet the bankers crank up the debt even more or this cave dweller and his operatives will get you. According to counterterrorism experts polled by Homeland Security Today, a possible downgrading of the U.S. credit rating by Moody’s – and the mayhem in financial markets that would result – may inspire al-Qaeda to attack. “So you can understand why Al Qaeda, or any other terrorist organization motivated by the jihadist ideology, would see that America is highly vulnerable right now – perhaps more than it’s ever been — to an attack or attacks the impact or direct effect [of which] would be further depression of the US’s economy,” a counterterrorism official told the homeland security affairs website. The credit ratings company Moody’s has renewed its warning that if the United States defaults on its “debt obligations” after the deadline set by the Treasury, it may downgrade its AAA bond rating. The debt is well over $100 trillion, although the government tells us it is a paltry $14 trillion. Obama, the Federal Reserve, and the bankers want to raise the debt limit from $14.3 to $14.5 trillion so Congress can borrow and spend even more money. Most of the budget is spent on killing people in foreign lands. Obama threatened the most vulnerable last week. He said the government will stop sending Social Security payments to seniors if Congress does not agree to raise the debt ceiling. He didn’t say missing the deadline would shut down the wars in Libya, Afghanistan, Pakistan, and Iraq. Gary Sasse, director of the Institute for Public Leadership at Bryant University in Rhode Island, told Fox News a downgrade by Moody’s would reach “down to every family in America.” Fox said the ripple effect from a downgrade would be widespread and potentially severe, impacting everything from local municipalities and the neighborhood bank to home mortgages and student loans. But this threat is apparently not enough to scare Americans. Now the government is dragging a threadbare al-Qaeda out of the closet and waving it in our faces.\r\nhttp://www.infowars.com/experts-warn-of-al-qaeda-attack-if-debt-ceiling-not-raised\r\n\r\nGun-smuggling cartel figures possibly were paid FBI informants\r\nLA Times\r\nJuly 17, 2011\r\n\r\nCongressional investigators probing the controversial “Fast and Furious” anti-gun-trafficking operation on the border with Mexico believe at least six Mexican drug cartel figures involved in gun smuggling also were paid FBI informants, officials said Saturday. The investigators have asked the FBI and the Drug Enforcement Administration for details about the alleged informants, as well as why agents at the Bureau of Alcohol, Tobacco, Firearms and Explosives, which ran the Fast and Furious operation, were not told about them. The development raises further doubts about the now-shuttered program, which was created in November 2009 in an effort to track guns across the border and unravel the cartels’ gun smuggling networks. The gun tracing largely failed, however, and hundreds of weapons purchased in U.S. shops later were found at crime scenes in Mexico. The scandal has angered Mexican officials and some members of Congress. Investigators say nearly 2,500 guns were allowed to flow illegally into Mexico under the ATF program, fueling the drug violence ravaging that country and leading to the shooting death of a U.S. border agent.\r\nhttp://www.latimes.com/news/nationworld/nation/la-na-cartel-guns-20110717,0,6972222.story\r\n\r\nMumbai blasts detainee reportedly dies of torture\r\nXinhuanet\r\nJuly 17, 2011\r\n\r\nNEW DELHI, July 17 (Xinhua) -- A man, involved in the July 13 Mumbai blasts, reportedly died of police torture during interrogation, according to media reports on Sunday. Faiz Usmani died following a brain hemorrhage early Sunday, reported Indo-Asian News Service, quoting hospital sources. The report quoted a medical officer as saying that Faiz Usmani was picked up as a suspect in the triple blasts, which left 19 people dead and 129 others injured, but late Saturday evening he suddenly took ill and was rushed to Sion Hospital in Mumbai. He died there around 1:20 a.m. Sunday. The officer said when Faiz was brought to hospital, his blood pressure was in excess of 220 points and there was a large amount of blood in his brain, said the report. Faiz was the brother of Afzal Usmani, one of the prime accused in blasts in Ahmedabad and Surat in Gujarat in 2008, and both were suspected members of the Indian Mujahiddeen. The family members of Faiz said he was tortured by police.\r\nhttp://news.xinhuanet.com/english2010/world/2011-07/17/c_13990516.htm\r\n\r\nSan Rafael man arrested for making death threats to Sen. Boxer\r\nBay City News Service\r\nJuly 16, 2011\r\n\r\nSAN RAFAEL -- A San Rafael man was arrested this morning for allegedly making death threats to U.S. Sen. Barbara Boxer. A series of threatening messages were left on the voice mail of the senator's office voice mail after business hours during the week of July 10, 2011, according to San Rafael police. Police were contacted earlier this week, and an investigation identified the caller as Kevin Joseph O'Connell. O'Connell, 47, was arrested near his home on East Francisco Boulevard and booked into Marin County Jail on one count of making criminal threats. Bail is set at $500,000 and he is scheduled to make his first court appearance on Tuesday, July 19th at 9 a.m.\r\nhttp://www.mercurynews.com/breaking-news/ci_18492688?nclick_check=1\r\n\r\nIran lawmaker: US behind Iraq unrest\r\nPressTV\r\nJul 16, 2011\r\n\r\nA senior Iranian lawmaker says Tehran believes the US is responsible for the acts of terrorism carried out in Shia or Sunni-populated regions of Iraq. “Iran considers the invaders of Iraq responsible for terrorist activities in the Shia- and Sunni-populated areas [of Iraq],” Fars News Agency quoted Deputy head of Iran's Majlis (Parliament) National Security and Foreign Policy Committee Hossein Ebrahimi as saying on Saturday. “[Iran] asks all the Muslims of Iraq to dash the hopes of the US through maintaining their solidarity,” he added. The Iranian lawmaker made the remarks after three explosions targeted Muslims pilgrims near the holy city of Karbala in central Iraq, killing nine people and wounding 70 others. The blasts came as visitors are overwhelming the city to attend the celebrations marking the birth anniversary of the 12th Shia Imam, Mahdi (PBUH). Ebrahimi described the terrorist attacks as US measures to widen the religious rifts in the violence-hit country. “The Americans, through bombings in Karbala and [carrying out] acts of terrorism in Shia-populated areas, seek to frame Sunni brothers of acting against the Shia but the vigilance of the Shias will thwart this US conspiracy,” the official said.\r\nhttp://www.presstv.ir/detail/189376.html\r\n\r\nKarzai Hitman Worked for CIA and U.S. Special Forces\r\nInfowars.com\r\nJuly 16, 2011\r\n\r\nA British newspaper reports today that the man who assassinated Ahmed Wali Karzai, the brother of Afghan president Hamid Karzai, worked for the CIA and U.S. Special Forces. In 2009, we reported that Karzai was the suspected kingpin of the country’s booming opium trade. At that time, he was on the CIA payroll for eight years, according to the New York Times. “Officials quoted by The Times described Karzai as a Mafia-like figure who expanded his influence over the drug trade with the aid of U.S. efforts to eliminate his competitors,” Paul Joseph Watson wrote on October 28, 2009. Sardar Mohammad, the bodyguard who gunned down Karzai, held regular meetings with British officials and had two brothers-in-law serving in a CIA-run paramilitary unit, the Kandahar Strike Force, the Washington Post reported yesterday. On July 12, following the assassination, the media reported that the Taliban had put out a hit on the half brother of Afghanistan’s U.S.-installed president, a former employee of Unocal. “The Taliban asserted responsibility for Karzai’s killing, and a U.S. official confirmed that the insurgent group may have influenced Mohammad, who had commanded checkpoints in the Karzai family’s ancestral village,” the Washington Post reported. The Post admits, however, that the Taliban may not have killed Karzai. As Kandahar provincial council chief, Ahmed Wali Karzai was a symbol of the venality of Afghanistan’s new U.S.-installed ruling elite. It is said he had a long list of enemies from “his business and political dealings.” The Post minimizes his role as overlord of the country’s thriving opium trade. Predictably, the Post follows its Pentagon script closely and states the assassination “underscores the continued vulnerability of Afghan officials as the United States prepares to reduce its military presence, and likely will complicate U.S. efforts to bolster security in southern Afghanistan.” \r\nhttp://www.infowars.com/karzai-hitman-worked-for-cia-and-u-s-special-forces\r\n\r\nClinton Announces al-Qaeda as Legitimate Government of Libya\r\nInfowars.com\r\nJuly 16, 2011\r\n\r\nOn Friday, the U.S. Secretary of State, Hillary Clinton, and members of more than 30 other nations meet in Istanbul, Turkey, and announced they have granted al-Qaeda and the so-called rebels in Libya full diplomatic recognition. “I am announcing today that, until an interim authority is in place, the United States will recognize the TNC as the legitimate governing authority for Libya,’’ said Clinton. The TNC, or Transitional National Council, is dominated by the the Haribi tribe of northeastern Libya. Both Abdel Mustafa Jalil and Abdel Fatah Younis – routinely paraded around by the corporate media as Libya’s new leaders – are from the Haribi tribe. A 2007 West Point study concluded that the tribe is rife with al-Qaeda and actively killed U.S. troops in Iraq. See Webster Tarpley on this, here. Peter Dale Scott has also written about the rebels, specifically the Libyan Islamic Fighting Group (LIFG) and its connection to the CIA and its war against the Soviets in Afghanistan. The LIFG was created by British and U.S. intelligence to assassinate Gaddafi. According to Yoichi Shimatsu, writing for New American Media, the LIFG is “the most radical element in the Al Qaeda network.” Naturally, you hear nothing about al-Qaeda and the rebels from the New York Times or the crown jewel of Operation Mockingbird, the Washington Post. Instead, the corporate media insists Gaddafi and al-Qaeda will wage a holy war against the United States. Clinton announced yesterday that the United States has recognized as the legitimate government of Libya a CIA created terrorist group it has waged a fake war against for almost a decade.\r\nhttp://www.infowars.com/clinton-announces-al-qaeda-as-legitimate-government-of-libya/\r\n\r\nTony Farrell: British Whistle Blower Fired for Exposing 9/11 as “State Sponsored Terror”\r\nThe Alex Jones Channel\r\nJuly 14, 2011\r\n\r\nA British police intelligence analyst who was asked to create a strategic assessment concerning terror threats was fired when he told his superiors that the threat of an “internal tyranny” was far greater than that of Islamic terrorism, after discovering that both 7/7 and 9/11 were false flag attacks.\r\nhttp://www.infowars.com/tony-farrell-british-whistle-blower-fired-for-exposing-911-as-state-sponsored-terror\r\n\r\nFBI opens inquiry after report that News Corp. tried to hack phones of 9/11 victims\r\nWashington Post\r\nJuly 14, 2011\r\n\r\nThe FBI has opened a preliminary inquiry into allegations that News Corp. employees sought to hack into the phones of victims of the Sept. 11 terrorist attacks and tried to bribe law enforcement officers for information, U.S. officials said Thursday. FBI agents are reviewing information on the phone-hacking scandal engulfing Rupert Murdoch’s British media operations and trying to determine if U.S. laws were broken, the officials said. Murdoch is chairman and chief executive of News Corp., which is based in New York and has extensive U.S. operations. While it is unclear if the review will expand into a full investigation, the FBI’s involvement heightens the scrutiny faced by the media giant, which is under intense fire in Britain over allegations that its journalists hacked into the phones of thousands of people.\r\nhttp://www.washingtonpost.com/politics/fbi-examining-alleged-news-corp-phone-hacking/2011/07/14/gIQA807ZEI_story.html\r\n\r\nPolice Intelligence Analyst Fired For Blowing Whistle On False Flag Terror\r\nInfowars.com\r\nWednesday, July 13, 2011\r\n\r\nA British police intelligence analyst who was asked to create a strategic assessment concerning terror threats was fired when he told his superiors that the threat of an “internal tyranny” was far greater than that of Islamic terrorism, after discovering that both 7/7 and 9/11 were false flag attacks. Tony Farrell, who has a university degree in statistics, was employed for 12 years as a ‘Police Intelligence Analyst’ with South Yorkshire Police. His job was to provide a yearly ‘Strategic Threat Assessment Matrix’ to enable police to prioritize resources and activities. Fully expecting Farrell to regurgitate the contention that Muslim extremists posed the biggest threat, his bosses were stunned when Farrell instead reported that the 2005 London bombings were staged by British intelligence and that the official story was a “monstrous lie”. During an hour-long interview with Richard D. Hall which was broadcast nationwide on UK television last week, Farrell revealed how one week before the 5th anniversary of 7/7 in 2010, he began researching information suggesting that the official story behind 9/11 was a total fabrication. Farrell cites the Alex Jones Show as being instrumental in his awakening to this knowledge. After sharing his concerns with the resident police church minister, it was suggested to Farrell that he also investigate the July 2005 London bombings. “Something he had not suspected ‘in his wildest dreams’ then started to unfold,” writes Nick Kollerstrom. “After reading much of the available but publicly-unreported witness statements and other evidence relating to 7/7, Tony found that he could only conclude that the official 7/7 narrative was ‘a monstrous lie.’ Instead of the official ‘suicide bombers’ narrative, which he and all of his colleagues had believed without question, he realized that the weight of evidence strongly points far more towards 7/7 being an event stage-managed by British intelligence than anything else.” With the deadline fast approaching for Farrell to present his report to the Intelligence Strategic Management Board, he struggled with his conscience, well aware that if he divulged his contention that internal tyranny and not domestic or Islamic terrorism was the primary threat, he could easily lose his job and with it a 12-year career.\r\nhttp://www.infowars.com/police-intelligence-analyst-fired-for-blowing-whistle-on-false-flag-terror\r\n\r\nBombshell: Saudi and U.S. Governments Protected Hijackers\r\nInfowars.com\r\nJuly 12, 2011\r\n\r\nAppearing on MSNBC, former senator and Florida governor Bob Graham said at least two of the purported 9/11 hijackers had assistance from Saudi Arabia. Graham’s recently released novel, Keys to the Kingdom, implicates the Saudis. He told MSNBC to novel is based on factual information. Graham said there are a lot of unanswered questions surrounding the role played by Saudi Arabia. He also asked why the government prevented Congress from obtaining information on the September 11, 2011, attack and its relationship to Saudi Arabia. In 2009, the Bush administration refused to release a congressional report alleging possible links between Saudi Arabian officials and the hijackers. Bush said he could not comply with a request by the Saudi foreign minister for a chance to clear the Arab kingdom’s name because publication of the report could hurt U.S. intelligence operations, according to news reports. Sources revealed that a redacted section of the report describes a money trail between Saudi Arabia and supporters of al-Qaeda. \r\nhttp://www.infowars.com/bombshell-saudi-and-u-s-governments-protected-hijackers\r\n\r\nMexican Outlaws Get Guns Via ATF\r\nInfowars.com\r\nJuly 12, 2011\r\n\r\nLegal guns originating in the United States are the illegal guns that are being used to slaughter citizens in Mexico. And in a nation where gun ownership is illegal, it could not be more apparent that when guns are outlawed, the only ones with guns are the outlaws. But just how the outlaws get the guns is shocking. Members of both the U.S. Congress and the Mexican government are calling for prosecution of the Bureau of Alcohol Tobacco and Firearms (ATF). Congressional testimony has recently turned the ATF on its head after whistleblowers gave testimony revealing that the ATF played a part in the release of guns into Mexico. For at least a decade now, covert operation specialist Celerino “Cele” Castillo III has been telling the world that the U.S. has been shipping guns south of the border on a regular basis as a sidebar to revelations of drug running from South America into North America. And now in the summer of 2011, the BATF is under fire for observing the sale and distribution of machine guns into Mexico. Congressional testimony in recent months is revealing a calculated plan called Operation Fast and Furious. Amazingly, thousands of guns have been observed to be purchased illegally and then tracked to an exit point outside of the USA. Testimony also reveals that the U.S. Border Patrol has been implicated in the plot. The ultimate end of the plan is to make possession of guns the ultimate evil. It’s a devious plan that includes what amounts to deliberate distribution of armament to a nation that has been taught to hate the USA.\r\nhttp://www.infowars.com/mexican-outlaws-get-guns-via-atf\r\n\r\nWikileaks’ Assange to Address 9/11 Conspiracy?\r\nPrison Planet Live\r\nJuly 12, 2011\r\n\r\nJulian Assange may be about to address concerns over his comments last year that 9/11 truth was a “false conspiracy” which he found “annoying”. Assange made the statement despite Wikileaks’ 2009 release of half a million pager messages on the day of 9/11 from New York City officials, many of which contradicted the official story. The Wikileaks founder is currently in London embroiled in an extradition appeal relating to allegations of rape, which many suspect are unfounded and part of a smear campaign against Assange. An increasing number of activists are questioning Assange’s motives, including some of his former colleagues like Cryptome’s John Young. However, we have noted that Anonymous, the hacking collective that has vigorously defended Assange, is doing excellent work in exposing the power elite head on, particularly with their intention to shine a light on the secretive gathering of globalists at this week’s Bohemian Grove confab. We hope that Assange can take a moment to address these concerns and reassure supporters that he is fully committed to exposing sinister secrets, whatever they may reveal, and particularly if they relate to 9/11, which was the foundation of the wars in Afghanistan and Iraq which Assange so vehemently opposes.\r\nhttp://www.infowars.com/wikileaks-assange-to-address-911-conspiracy\r\n\r\nAfghan CIA Drug Kingpin Shot Dead by Own Bodyguard\r\nInfowars.com\r\nJuly 12, 2011\r\n\r\nAhmad Wali Karzai, the half brother of Afghan president Hamid Karzai, was assassinated by one of his own bodyguards Tuesday morning. Friend and trusted head of security Sardar Mohammed shot him in the head and chest. Mohammed was in turn shot and killed by fellow bodyguards. The Taliban claimed responsibility for the assassination. In 2009 it was reported that Karzai was a major player in the Afghan opium trade. According to reports, other members of the Karzai family are involved “head-to-heels” in the drug business. Ahmad Wali Karzai also worked for the CIA. “The CIA has been complicit in the global drug trade for years,” a former intelligence official told Newsmax in 2002. “The CIA did almost the identical thing during the Vietnam War, which had catastrophic consequences – the increase in the heroin trade in the USA beginning in the 1970s is directly attributable to the CIA.” According to a report in Presscore, the former Unocal employee Hamid Karzai and his family are heavily involved in the CIA’s drug business. “85 per cent of all drugs produced in Afghanistan is being shipped aboard US aircraft. Foreign diplomats have stated that the United States military buy drugs from local Afghan drug lords who deal with field commanders overseeing eradication of drug production,” states the report. The CIA provides protection for the enterprise.\r\nhttp://www.infowars.com/afghan-cia-drug-kingpin-shot-dead-by-own-bodyguards", "group_id": 3920, "id": 1707163}]