[{"user_id": 8540, "stars": [], "topic_id": 4885, "date_created": 1297609415.7728679, "message": "What would you recommend for a programmer to improve his design skills? I have to admit that most of the time I work alone on projects, and I find it depressing that I can't get anything visually appealing.", "group_id": 629, "id": 91368}, {"user_id": 1148, "stars": [], "topic_id": 4885, "date_created": 1297613551.5712891, "message": "First, you can learn the rules by reading good design references (http://www.ulrich-eppinger.net/).  There were a few on a reading list from Google's UX designer. http://bagcheck.com/bag/5571-favorite-design-books. Also, working alone may be the issue. Try to collaborate with a trustworthy designer. The very process of bouncing ideas off of another person can bring up your game.  I think this is because you get immediate feedback on whether a design idea is good or not.", "group_id": 629, "id": 91610}, {"user_id": 6713, "stars": [], "topic_id": 4885, "date_created": 1297659910.326169, "message": "You could check out this post I wrote a while back: http://www.attackofdesign.com/improving-a-design-step-by-step-part-1/", "group_id": 629, "id": 96350}, {"user_id": 10759, "stars": [], "topic_id": 4885, "date_created": 1297711627.118382, "message": "http://uxmyths.com/ might be of help if you're interested enough to read the thorough essays. Also, it has little to do with web design, but wouldn't hurt to skim through Apple's human interface guidelines: http://developer.apple.com/library/mac/#documentation/UserExperience/Conceptual/AppleHIGuidelines/XHIGIntro/XHIGIntro.html", "group_id": 629, "id": 103660}, {"user_id": 5958, "stars": [], "topic_id": 4885, "date_created": 1298517965.7199299, "message": "ThinkVitamin has pretty good intro videos about elements of design. http://thinkvitamin.com", "group_id": 629, "id": 195009}, {"user_id": 10759, "stars": [], "topic_id": 4885, "date_created": 1298550164.536243, "message": "I'd say. The header bar is just like convore's", "group_id": 629, "id": 197131}, {"user_id": 12525, "stars": [], "topic_id": 4885, "date_created": 1298576275.1641209, "message": "Candellar - I would suggest research, and lots of it... then if you need help with design, hop on over to www.conceptfeedback.com and ask the community there to help you out. I'm on the other side, I am a designer, learning the ins and out of code....", "group_id": 629, "id": 201045}, {"user_id": 1797, "stars": [], "topic_id": 4885, "date_created": 1299709313.33113, "message": "And regarding color: go to flickr or Google Images and find some photos that evoke the feeling that you're going for in your design. Then, open one up in photoshop and go crazy with the eyedropper tool. You'll be surprised that that orange is really brown and a red apple has shades of purple lurking in the shadows. The best color combinations can be found in photography – whether from nature, cityscapes, or anywhere else. The fact that any given photo uses a single light source makes the composition more attractive. \n\nI guess the bottom line is that you'll never see #ff0000 or #ff00ff in a photo … at least a photo taken on earth … so don't use them in your design.", "group_id": 629, "id": 309005}, {"user_id": 1797, "stars": [], "topic_id": 4885, "date_created": 1299709116.1675, "message": "@candeller: Some practical places to start: Try to replicate the feel of some of the best sites on the web. Open up firebug and copy somebody else's CSS box-shadow values. Take screen shots of cool icons, then zoom in and try to figure out *how they did that* in photoshop. Copying other people's work is a bad idea if you're going to pass it off as your own, but it's a great way to teach yourself techniques that will be applicable in real projects.", "group_id": 629, "id": 308977}, {"user_id": 2841, "stars": [], "topic_id": 4885, "date_created": 1299714994.128897, "message": "@justinlilly I'm a fan of #151515", "group_id": 629, "id": 309426}, {"user_id": 218, "stars": [], "topic_id": 4885, "date_created": 1299713805.683831, "message": "#111 is the new black.", "group_id": 629, "id": 309336}, {"user_id": 2694, "stars": [], "topic_id": 4885, "date_created": 1303158722.663532, "message": "Learn to think like a normal everyday person, and always remember that you are not your user. What's obvious to you can often be confusing to someone who's never encountered a design pattern or metaphor before.", "group_id": 629, "id": 730698}, {"user_id": 26917, "stars": [], "topic_id": 4885, "date_created": 1303223984.3354101, "message": "@candeller    I'm an illustrator and computer nerd who's been hired for a graphic design position, so i know your pain. Though I already understand good aesthetics and problem solving for commercial art, design was still pretty foreign to me. I suggest getting involved/excited with things like typography or design blogs (not just web design), and see what interests you. After a while, you'll start to draw parallels of what good design entails. This is, of course, supposed to be followed with all the research everyone else is talking about. haha", "group_id": 629, "id": 742343}, {"user_id": 30894, "stars": [], "topic_id": 4885, "date_created": 1303611676.395503, "message": "Its a right brain & left brain thing imho. Some can bridge both very well buts its rare. I would focus on ease of use, usability and leave the aesthetics to the pros. These days you could find freelance designers relatively easily. Work with them, you may gleam some of their techniques but realistically its hard to have two different persona's. Stick to your strengths :-)", "group_id": 629, "id": 792629}]