[{"user_id": 11626, "stars": [], "topic_id": 6758, "date_created": 1297920247.0763969, "message": "Faced with aggressive public outreach by China, the United States must ramp up its own efforts and do a better job fighting Internet censorship, a Senate committee report says.\r\n\r\nThe Senate Foreign Relations Committee report, which is to be released on Tuesday, said the United States was languishing behind as China increasingly molds public opinion through its cultural institutes and state-run media.\r\n\r\nThe report, a copy of which was obtained by AFP, calls for more US students to be sent to China, a US bid to host the 2020 World Expo, an expansion of the number of American Centers in China and other \"public diplomacy\" measures.\r\n\r\nThe report, which was requested by Senator Richard Lugar of Indiana, the top Republican on the Senate Foreign Relations Committee, was also sharply critical of the State Department for not doing more to counter China's so-called \"Great Firewall,\" in which authorities filter sensitive topics off the Internet.\r\n\r\n\"There seems little question that the next 50 years will witness a competition between our two countries in much the same way the United States and the Soviet Union vied for allies and global influence during the last 50,\" the report said.\r\n\r\n\"The great unknown is whether this competition will shift from the economic sphere to a more military-oriented direction,\" it said.\r\n\r\n\"What is known is that our nation is not doing all it can to prepare for the increased prominence China will continue to play in our economy and foreign policy,\" it said.\r\n\r\nOn the education front, the report said China is sending nearly 130,000 students to the United States each year -- roughly 10 times the number of American students going to China.\r\n\r\nThe report welcomed the Obama administration's call to increase that number to 25,000 a year over four years but said the program, reliant only on private sector support, is \"woefully under-resourced.\"\r\n\r\n\"Increasing the number of Americans studying in China is in our nation's vital interest if we are to have the needed commercial, academic and policy experts to address the challenges a rising China will pose,\" it said.\r\n\r\nChina also has some 70 Confucius Institutes in the United States to teach Chinese language and culture, but the United States has only five establishments in China that offer open libraries, the report said.\r\n\r\nThe report rejected China's contention that Confucius Institutes were non-governmental, pointing to supervision by the education ministry.\r\n\r\nDespite a January 2010 speech by Secretary of State Hillary Clinton championing Internet freedom, the State Department has appropriated less than $20 million of the $50 million allocated by Congress to break the firewall in China and other countries, the report said.\r\n\r\nIt suggested that the State Department was treading cautiously because the premier system to circumvent the firewall is designed by US companies founded by members of Falungong, the spiritual movement strictly banned by China.\r\n\r\nThe report called for Congress to shift Internet censorship circumvention efforts from the State Department to the Broadcasting Board of Governors, the US agency that oversees Radio Free Asia and the Voice of America.\r\n\r\n\"The State Department is poorly placed to handle this issue due to its reliance on daily bilateral interaction with these very same governments, particularly China,\" the report said.\r\n\r\nWhile Beijing routinely jammed the two US-funded networks, Chinese state media were rapidly expanding in the United States, with Xinhua news agency opening a prominent office in New York's Times Square, the report said.\r\n\r\n\"We are being overtaken in this area of foreign policy by China, which is able to take advantage of America's open system to spread its message in many different ways, while using its fundamentally closed system to stymie US efforts,\" Lugar said in a letter accompanying the report.\r\n\r\nThe report also faulted the United States for underfunding public diplomacy.\r\n\r\nIt regretted the quality of the US pavilion at last year's World Expo in Shanghai, which was cobbled together at the last minute using private funds and featured simple films about the United States.\r\n\r\nEven if many Americans no longer care about global expositions, the report said, some 70 million people -- most of them Chinese -- visited the Shanghai Expo and seven million went to the US pavilion.\r\n\r\nConsidering that fewer than one million Chinese visit the United States each year, \"the Expo was a squandered opportunity to have maximum impact on our bilateral relationship,\" the report said.\r\n\r\nThe report called for the United States to consider changing the law to allow government support for exposition efforts, including for the US pavilion at the 2012 Expo in South Korea, and to make a bid for the 2020 World Expo.\r\n\r\nhttp://www.spacewar.com/reports/US_committee_Counter_China_information_drive_999.html", "group_id": 3920, "id": 129459}]