[{"user_id": 14944, "stars": [{"date_created": 1304361901.314435, "user_id": 26150}], "topic_id": 14859, "date_created": 1300929330.6451149, "message": "http://www-bd.lip6.fr/ens/grbd2011/extra/SIGMOD10_pregel.pdf", "group_id": 12, "id": 422375}, {"user_id": 8622, "stars": [], "topic_id": 14859, "date_created": 1301057628.181031, "message": "@soulofpeace Please always include the abstract when posting new papers.", "group_id": 12, "id": 438044}, {"user_id": 8622, "stars": [], "topic_id": 14859, "date_created": 1301057584.6062911, "message": "Abstract: Many practical computing problems concern large graphs. Standard examples include the Web graph and various social networks. The scale of these graphs|in some cases billions of vertices, trillions of edges|poses challenges to their e\u000ecient processing. In this paper we present a computational model suitable for this task. Programs are expressed as a sequence of iterations, in each of which a vertex can receive messages sent in the previous iteration, send messages to other vertices, and modify its own state and that of its outgoing edges or mutate graph topology. This vertex-centric approach is \nexible enough to express a broad set of algorithms. The model has been designed for e\u000ecient, scalable and fault-tolerant implementation on clusters of thousands of commodity computers, and its implied synchronicity makes reasoning about programs easier. Distribution-related details are hidden behind an abstract API. The result is a framework for processing large graphs that is expressive and easy to program.", "group_id": 12, "id": 438039}, {"user_id": 4935, "stars": [], "topic_id": 14859, "date_created": 1301122280.6419671, "message": "what if @soulofpeace had time to post it but not to post the abstract. should he just not post it?", "group_id": 12, "id": 445370}, {"user_id": 4935, "stars": [], "topic_id": 14859, "date_created": 1301122296.299932, "message": "I don't think so...it's an interesting paper.", "group_id": 12, "id": 445371}, {"user_id": 8622, "stars": [], "topic_id": 14859, "date_created": 1301320279.057147, "message": "I'm not complaining about the quality of the paper.  It's just nice to have the abstract available in order to figure out whether a paper is interesting to me.", "group_id": 12, "id": 457891}, {"user_id": 528, "stars": [{"date_created": 1310492848.9467199, "user_id": 32163}], "topic_id": 14859, "date_created": 1301577158.6090879, "message": "+1 @nominolo", "group_id": 12, "id": 491506}, {"user_id": 34208, "stars": [], "topic_id": 14859, "date_created": 1306290279.151768, "message": "@liveink", "group_id": 12, "id": 1173078}]