[{"user_id": 32737, "stars": [], "topic_id": 34838, "date_created": 1305149859.6774759, "message": "So this topic is about making \"load\" work correctly. When you load a file, it needs to change the current directory, and then when it's done eval'ing the file, it needs to restore the previous current directory. The w/cd macro I mentioned earlier does that.", "group_id": 9739, "id": 1014844}, {"user_id": 25438, "stars": [], "topic_id": 34838, "date_created": 1305150832.174298, "message": "by the way, I also have some code for changing the current directory: https://github.com/awwx/lib/blob/master/cwd0.arc", "group_id": 9739, "id": 1015150}, {"user_id": 32737, "stars": [], "topic_id": 34838, "date_created": 1305151172.170645, "message": "Yeah, that's really similar to my definition for \"cd\". The problem isn't so much defining the utilities, since they're short and pretty easy to do. The problem is integrating it cleanly in an Arc-y way. I went with the \"just use the Unix names\" route, but I figured there's probably a better way of thinking about directories.", "group_id": 9739, "id": 1015239}, {"user_id": 32737, "stars": [], "topic_id": 34838, "date_created": 1305149682.2719281, "message": "Alright, let me describe the situation. You have two files: \"lib/foo.arc\" and \"lib/bar.arc\" Within foo.arc, it calls (load \"bar.arc\"). If you call (load \"lib/foo.arc\") you expect it to load \"lib/bar.arc\" but instead, it tries to load \"bar.arc\"", "group_id": 9739, "id": 1014802}, {"user_id": 32737, "stars": [], "topic_id": 34838, "date_created": 1305149762.0686059, "message": "In my fork, I created some helper functions like cd, dirname, basename, and a w/cd macro. I got it working well enough, but then scrapped it because it was kinda messy and I wasn't sure about the names I used (which are the ones used by Unix utilities).", "group_id": 9739, "id": 1014820}, {"user_id": 32737, "stars": [], "topic_id": 34838, "date_created": 1305151496.651665, "message": "Oh, yours is substantially smaller than mine, though, because it uses defvar, whereas I hand-wrote the w/cd macro.", "group_id": 9739, "id": 1015315}]