[{"user_id": 11626, "stars": [], "topic_id": 45199, "date_created": 1315875847.051795, "message": "MARTIAL LAW MONDAY 9/12/11\r\n\r\nWelcome to the \"Martial Law Monday\" edition of SCMLA's News Digest!\r\n\r\n\r\nFacebook Commissar Warns Infowars Reporter About Political Posts\r\nInfowars.com\r\nSeptember 12, 2011\r\n\r\nInfowars.com reporter Darrin McBreen was instructed by the “Facebook Team” to not voice his political opinion on the popular social networking site. “Be careful making about making political statements on facebook,” McBreen was told in an email, “facebook is about building relationships not a platform for your political viewpoint. Don’t antagonize your base. Be careful and congnizat (sic) of what you are preaching.” Facebook sent the message in relation to a comments posted about “Is living off the Grid now a crime?,” an article about “nuisance abatement teams” intimidating people who have decided to disconnect from the power grid in California. The message provides further evidence that Facebook is not only monitoring discussions, but also feels compelled to warn users about the supposed inappropriateness of their political viewpoints, especially if they deviate from prepackaged left-vs-right political viewpoints propagated by the establishment. The misspelling contained in the comment indicates it is probably not a boiler-plated message but was written specifically in response to the discussion. The Facebook is message received by McBreen is intimidation, pure and simple. Thousands of Facebook users utilize the site to push political agendas.\r\nhttp://www.infowars.com/facebook-commissar-warns-infowars-reporter-about-political-posts\r\n\r\nResidents of Texas Fire Area Must Register with Police\r\nInfowars.com\r\nSeptember 12, 2011\r\n\r\nOn Sunday, KVUE.com reported without explanation that residents of Bastrop, Texas, must register with the Bastrop County Sheriff’s Office before they will be allowed to re-enter their homes. These Bastrop residents don’t need the cops to protect their property. “Before Bastrop residents can re-enter, they must register and receive credentials to authorize their entrance to the residential area,” the ABC affiliate reported today. Residents “will need a photo ID to verify residency.” The article does not report what will happen to residents who do not produce ID or who enter the area without gaining permission from the state. The wildfires that raced through Texas destroyed 1,554 homes, officials said Sunday. The figure is expected to increase. On Saturday, residents confronted authorities after they were not allowed to re-enter their homes to assess damage and claim belongings. Bastrop County Judge Ronnie McDonald told the media officials are trying to get residents back into their homes as soon as possible, but he didn’t know how long that would take. The registration program was announced late Sunday. On Friday, Obama issued a major disaster declaration for Texas. “Federal assistance can include grants for temporary housing and home repairs, low-cost loans to cover uninsured or underinsured property losses, and other programs to help individuals and business owners recover from the effects of the disaster,” YNN in Austin reported on Saturday. Residents were asked to register last week so authorities could estimate a “headcount.” Now they must register to return to their private property. On Tuesday, September 6, Infowars.com reported that federal officials arrived at the scene in Bastrop and Smithville and assumed command of the operation. Alex Jones was contacted on by firefighters who confirmed that FEMA blocked volunteer assistance and frustrated local attempts through the U.S. Forest Service and its maze of bureaucratic red tape. The firefighters and other volunteers report that the Forest Service did not respond to their efforts to clear federal hurdles put in the way of a response to the worst fire in Texas history.\r\nhttp://www.infowars.com/residents-of-texas-fire-area-must-register-with-police\r\n\r\n[WE'LL START SEEING THIS IN AMERICA UNDER MARTIAL LAW]\r\nAl-Jazeera Egypt shut down for ‘sowing dissent’\r\nAFP\r\nMonday, September 12, 2011\r\n\r\nCAIRO — The satellite channel Al-Jazeera Egypt said on Sunday the authorities had prevented it from broadcasting, after entering its offices and confiscating transmission equipment. Ahmed Zain, the channel’s chief in Cairo, told AFP that police, officers from the culture ministry and representatives of Egypt’s public broadcaster had also seized materials and that one technician was arrested. He said they cited the lack of an official licence to broadcast and a complaint from the neighbourhood. He said a lawyer also presented a complaint accusing the channel of “sowing dissent” and “calling for demonstrations.” Zain said Al-Jazeera Egypt had on March 20 requested official authorisation, and that it had been assured it could continue broadcasting in the interim.\r\nhttp://www.rawstory.com/rs/2011/09/11/al-jazeera-egypt-shut-down-for-sowing-dissent\r\n\r\nNever going back: Air travel changed for worse, forever after 9/11\r\nNatural News\r\nSeptember 11, 2011\r\n\r\nAs the ten-year anniversary of the September 11, 2001 terrorist attacks quickly approaches, a recent USA Today piece reflects on the drastic, and likely permanent, changes that have taken place in US airport security. What was once a relatively simple and painless walk through the metal detector has mutated into a nightmarish circus of screaming TSA agents, invasive pat-downs, naked body scans, strip searches, and other unconstitutional violations of personal and civil liberties — and conditions will most likely never return to what they once were before 9/11. Many NaturalNews readers will remember pre-9/11 flying conditions when friends and relatives could freely walk to departure gates to see off their loved ones. Or when spending a few minutes in a short security line, with no convoluted restrictions on liquids or wearing shoes, was all it took to board a flight. These were the days when Americans were treated more like innocent travelers than guilty terrorists, and when airport security was not run by the heavy hand of a bloated federal government. But everything changed, of course, after the 9/11 tragedy took place. Americans willingly sacrificed their freedom in the name of security and protection against terrorists. And as well-intentioned as many people likely were in bowing down to the federal overlords that were all-too-quick to unlawfully search them and seize their property, this capitulation to tyranny has made air travel feel more like lining up for roll call at a Nazi concentration camp than simply embarking on a peaceful and more rapid form of transportation than bus or car.\r\nhttp://www.naturalnews.com/033543_air_travel_9-11.html\r\n\r\nIn the Wake of 9/11: 33 of 50 States Are Actively Spying on Americans\r\nActivist Post\r\nSeptember 11, 2011\r\n\r\nThe weekend of the 10th Anniversary of 9/11, has caused many to reflect on the event itself, as well as the decade that we have experienced since. There have indeed been many casualties to recall. One of the saddest casualties is the First Amendment to the nation’s founding document; it is effectively dead in 33 states according to a ACLU compilation of incident reports across America. A targeted program of surveillance and harassment has become fully centered on the population itself. This was first made evident in the 2009 MIAC report, which cited supporters of prominent political candidates like Ron Paul, as well as an assortment of other activists who support peace, freedom and liberty, as potential threats. Law enforcement has been directed to treat such “dangers” with suspicion and extreme caution. The ACLU has compiled an interactive map of those states which have logged incidents of police harassment and surveillance of Americans engaging in other apparently un-American activities, namely: peaceful protest, photographing public servants while on duty, questioning American leadership and policy, recording one’s surroundings while in public, and having certain religious or political affiliations that could apparently be tied to extremism. Here are just a few examples among dozens of incident reports cited by the ACLU that show the range of First Amendment violations.\r\n﻿http://www.activistpost.com/2011/09/in-wake-of-911-33-of-50-states-are.html﻿\r\n\r\nNYPD’s 1000 “Anti-Terror Cops” Have Tanks, Weapons, Navy\r\nCBS News\r\nSeptember 10, 2011\r\n\r\nKelly has his own army — 1,000 anti-terror cops with tanks and weapons, carved out of the NYPD after 9/11.\r\nhttp://newyork.cbslocal.com/2011/09/08/exclusive-elaborate-new-york-city-post-911-security\r\n\r\n9/11 Anniversary: Reminding Americans They Now Live In A Police State\r\nInfowars.com\r\nSeptember 9, 2011\r\n\r\nThe anniversary of 9/11 offers an ideal opportunity to remind Americans, especially New Yorkers, that they live in a police state. Bloomberg tells New Yorkers they are terror suspects. From NBC New York on Thursday: \"New Yorkers can expect to see extra subway bag checks, vehicle checkpoints and more police officers throughout the city as U.S. intelligence officials have picked up threat information about possible terror attacks to coincide with the 10th anniversary of 9/11.\" The “threat information” is of the usual caliber – uncorroborated and unsubstantiated. “But we live in a world where we must take these threats seriously, and we will,” promised New York mayor Michael Bloomberg. “We know the terrorists regard the anniversary as an opportunity to strike again.” He was flanked by Police Commissioner Ray Kelly and Janice K. Fedarcyk, the director of the FBI in New York. According to “intelligence” allegedly gleaned from Osama bin Laden’s hidey-hole in Pakistan (where he didn’t live), al-Qaeda is fixated on anniversaries.\r\nhttp://www.infowars.com/911-anniversary-reminding-americans-they-now-live-in-a-police-state\r\n\r\nLawmakers Pushed To Approve High-Tech Guard Tower For “Crowd Control”\r\nBullet-proof mobile surveillance unit readied for potential civil unrest in United States\r\nInfowars.com\r\nSeptember 9, 2011\r\n\r\nUS lawmakers yesterday witnessed a special demonstration of the Mobile Utility Surveillance Tower (MUST), an elevated monitoring tower that is set to be used by law enforcement in the United States as part of an emergency response to civil unrest. The device, manufactured by Terrahawk, LLC, is basically a high-tech prison guard tower fitted with surveillance and communications capabilities. It was demonstrated yesterday to “Members of the U.S. House of Representatives and the Senate along with their staffs; with MUST, law enforcement agencies can quickly set up a mobile surveillance tower for emergency response, crowd control, or general surveillance,” reports Homeland Security Newswire. The fact that Congress members and Senators were given a special demonstration of the unit suggests that its makers are pushing for the device to be approved for widespread use by law enforcement domestically, and not just on the border with Mexico. Indeed, the tower is already being used inside the United States on a limited scale. In December, members of the South New Jersey Tyranny Response Team spotted one of the units with blacked-out windows situated next to a city park in a low crime area where it remained for several days.\r\nhttp://www.infowars.com/lawmakers-pushed-to-approve-high-tech-guard-tower-for-crowd-control\r\n\r\nDo You Now Understand Why You Need To Prepare For Emergencies?\r\nThis Has Been The Worst Year For Natural Disasters In U.S. History\r\nThe Economic Collapse\r\nSeptember 9, 2011\r\n\r\nThere has been a natural disaster that has caused at least a billion dollars of damage inside the United States every single month so far this year.  According to the National Oceanic and Atmospheric Administration, there have been10 major disasters in the United States this year.  On average, usually there are only about 3 major disasters a year.  At this point, disasters are happening inside the United States so frequently that there seems to be no gap between them.  We just seem to go from one major disaster to the next.  Last year, FEMA declared an all-time record of 81 disasters inside the United States.  This year, we are on pace for well over 100.  We just got done dealing with Hurricane Irene, and now we are dealing with historic wildfires in Texas and unprecedented flooding up in the northeast part of the country.  This has been the worst year for natural disasters in U.S. history, and we still have nearly four months left to go.\r\nhttp://theeconomiccollapseblog.com/archives/do-you-now-understand-why-you-need-to-prepare-for-emergencies-this-has-been-the-worst-year-for-natural-disasters-in-u-s-history\r\n\r\nLife in Prison for Recording Police: Michael Allison Speaks (video)\r\nInfowars.com\r\nSeptember 8, 2011\r\n\r\nAlex talks with Michael Allison, a 41-year-old backyard mechanic from southeastern Illinois, who faces up to 75 years in prison for the crime of recording the police. Allison ran afoul of officialdom in Robinson, Illinois, after filing a lawsuit against the city in 2007 in response to a demand he pay the state to license unused cars on his property.\r\nhttp://www.infowars.com/life-in-prison-for-filming-police-michael-allison-speaks\r\n\r\nRon Paul: Border Fence Could Be Used To “Keep Us In”\r\nCongressman warns militarized border policies could be turned inwards during economic turmoil\r\nInfowars.com\r\nSeptember 8, 2011\r\n\r\nHaving made similar comments to the Alex Jones Show last week, Presidential candidate Ron Paul warned last night during the Republican debate in California that constructing a border fence could be used to keep Americans in rather than illegal aliens out in times of economic turmoil. While Paul vehemently expressed his opposition to welfare and free health care for illegal immigrants, the Texas Congressman cautioned that erecting barbed wire fences and patrolling them with armed troops could eventually be used not to keep illegals out, but to keep Americans in during a period of civil unrest. Saying he didn’t believe “that’s what America’s all about,” Paul warned that such measures could be used against U.S. citizens. “Every time you think about this toughness on the border and ID cards and REAL IDs, think it’s a penalty against the American people too. I think this fence business is designed and may well be used against us and keep us in,” said Paul, adding, “In economic turmoil, the people want to leave with their capital and there’s capital controls and there’s people controls. Every time you think about the fence, think about the fences being used against us, keeping us in.”\r\nhttp://www.infowars.com/ron-paul-border-fence-could-be-used-to-keep-us-in\r\n\r\nGibson Guitars proves the environmental police state that wants your wood products and guns\r\nNatural News\r\nSeptember 8, 2011\r\n\r\nThe recent US government raid of Gibson Guitars’ Tennessee manufacturing facility is now receiving widespread media coverage, thanks to a flood of reports that have appeared across the web in recent weeks, including here at NaturalNews. But beyond simply the raid itself is the reality of the new environmental police state that appears to be taking over, where personal wood products of all kinds — whether they be furniture, hand tools, or even guns made with rare wood stocks — are now threatened with arbitrary confiscation. As we mentioned previously, the US Fish and Wildlife Service’s (FWS) use of the US Department of Agriculture’s (USDA) Lacey Act of 2008 to invoke the Gibson raid sets a chilling precedent for the environmental police to go after others, including ordinary individuals, who may possess wood products deemed unacceptable, even if such wood products were obtained legally. You see, Gibson’s import of rosewood and ebony from India was not illegal under either US or Indian law. FWS merely decided to interpret Indian law in its own illogical way, and invoke the Lacey Act as justification for its illegal raid. And if the agency gets away with doing this to Gibson, they will surely do it again to others.\r\nhttp://www.infowars.com/gibson-guitars-proves-the-environmental-police-state-that-wants-your-wood-products-and-guns\r\n\r\nRon Paul: TSA ‘abusive,’ involved in ‘all kind of sexual activities’\r\nPolitico\r\nSeptember 8, 2011\r\n\r\nPut Ron Paul in the anti-pat-down column. The Texas congressman accused the Transportation Security Administration of taking an “abusive” attitude towards passengers, disputing the view that government regulation helps airline security. Paul said of the TSA: “They’re accused of all kind of sexual activities” To the notion that his libertarian approach to security could threaten passenger safety, Paul said that exactly the reverse was true. It was government policy, he said, that helped make 9/11 possible. “They told the pilots they couldn’t have guns,” Paul said. “They set up the stage for this.”\r\nhttp://www.politico.com/news/stories/0911/62934.html\r\n\r\nUBS: Euro Collapse Could Lead To Martial Law, Civil War\r\nInfowars.com\r\nSeptember 7, 2011\r\n\r\nIn a similar vein to how Hank Paulson threatened martial law on the streets of America if the bailout failed to pass, top banks like UBS are now warning of “authoritarian or military government” and “civil war” in a bid to frighten away member states from leaving the euro. It’s a transparent ploy designed to create the pretext for empowering the EU to enforce a common economic policy across all member states, something that British Prime Minister David Cameron is now openly backing. In a UBS Investment Research release, the Swiss bank warns that should member states begin to desert the euro, precipitating a collapse of the single currency, “some form of authoritarian or military government, or civil war,” would likely ensue. The tone of UBS’ advisory sounds very sobering and authoritative, but we’ve seen this type of financial fearmongering before, during the 2008 bailout debate, which was eventually rammed through on the back of bellicose threats about martial law and economic armageddon.\r\nhttp://www.infowars.com/ubs-euro-collapse-could-lead-to-martial-law-civil-war\r\n\r\nChaos On The Streets Of America\r\nThe American Dream\r\nSeptember 6, 2011\r\n\r\nShould we just expect mass chaos on the streets of America every time a major holiday rolls around?  At least 42 people were hit by gunfire in New York City over the Labor Day weekend.  The violence got so bad that even the mayor felt compelled to publicly address it.  In Chicago, at least 6 people(including a man in a wheelchair) were killed over the Labor Day weekend. Sadly, this is just a continuation of a trend that we have seen build over the past few years.  At the beginning of the summer, there was terrible violence all over America during the Memorial Day weekend.  We also saw violence break out during 4th of July celebrations.  It appears that wherever large groups of young people gather in America today, there is going to be a very good chance that chaos is going to erupt. Almost wherever you look, you can see the frustration of the American people starting to boil over.  Very few public places seem to be immune.\r\nhttp://endoftheamericandream.com/archives/chaos-on-the-streets-of-america\r\n\r\nParents of seven told: Your children are too fat, so you will never see them again\r\nDaily Mail\r\nSeptember 4, 2011\r\n\r\nFour obese children are on the brink of being permanently removed from their family by social workers after their parents failed to bring their weight under control. In the first case of its kind, their mother and father now face what they call the ‘unbearable’ likelihood of never seeing them again. Their three daughters, aged 11, seven and one, and five-year-old son, will either be ‘fostered without contact’ or adopted. Either way, the family’s only hope of being reunited will be if the children attempt to track down their parents when they become adults. The couple, who have been married for nearly 20 years and are not being named to protect their children’s identities, were given a ‘draconian’ ultimatum three years ago – as reported at the time by The Mail on Sunday. Warned that the children must slim or be placed in care, the family spent two years living in a council-funded ‘Big Brother’ house in which they were constantly supervised and the food they ate monitored.\r\nhttp://www.dailymail.co.uk/news/article-2033486/Your-children-fat-again.html\r\n\r\nPolice Severely Beat Man For Riding Bicycle Without a Light\r\nKRIS-TV.com\r\nSeptember 3, 2011\r\n\r\nARANSAS PASS, Texas – It’s news no one wants to hear; a family member is in the hospital on life support unable to speak and even worse there are few answers about how it all happened. That’s exactly what one Aransas Pass family says they are going through. Martin Garcia Ortiz is in critical condition after an incident allegedly involving Aransas Pass police back on August 10th. The family and their attorneys say they believe a rogue police officer may be to blame for Ortiz’s severe injuries.\r\nhttp://www.kristv.com/news/attorneys-say-local-police-officer-severely-beat-unarmed-man/#!prettyPhoto/1\r\n\r\nFeds Charge Man As Enemy Combatant Supporting Terrorism For Uploading Youtube Video\r\nAlexander Higgins Blog\r\nSeptember 3, 2011\r\n\r\nTake freedom of speech and other personal liberties — including protections against cruel and unusual punishment, right to face your accuser, and right to trial by jury — and throw them right out the window. All for the crime of uploading a YouTube. That is what a 24 year old Virginia man, Jubair Ahmad, faces as the feds charge him with providing support for terrorism for allegedly uploading a propaganda video. The crime comes with the dubious distinction that the accused are treated as if they are actually terrorists or as the U.S. government labels them “enemies combatants”. With the declaration of being an enemy combatant the rights and protections engraved into the Constitution with the full force of our founding father’s very own flesh and blood are instantly nullified. That’s right. The Department of Justice of the great United States of America has charged a Jubair Ahmad, a 24 year old Woodbridge, Virginia man, of providing support for terrorism because he allegedly uploaded a propaganda video to YouTube. The accusation alone instantly classifies the man as an ‘enemy combatant’  and ‘clear and present danger’. Such persons who are a ‘threat to national security’ have absolutely no rights. To make matters worse, businesses and nations aren’t allowed to do business with such so-called ‘terrorists’ or they will be declared a terrorist themselves. That means a lawyer who takes up his case can be charge with providing support for terrorism. That is  if the United States government  even decides to honor habeas corpus and give the man a trial in the first place. Our beloved supreme court has ruled that ‘enemy combatants’ can be abducted, tortured,assassinated, and even detained for ever without a trial because the constitution does not apply to them. Even worse, the lucky few who are released after being declared innocent have no right to legal recourse because revealing the details of their detention and torture is also a threat to national security. This is what the ‘war on terror’ has escalated to, which we have been brainwashed by our government is necessary to protect our liberties from our enemies.\r\nhttp://blog.alexanderhiggins.com/2011/09/02/feds-charge-man-enemy-combatant-supporting-terrorism-uploading-youtube-videos-67721\r\n\r\nThe counterfeit culture – useful observations for understanding why collapse is inevitable\r\nNatural News\r\nSeptember 2, 2011\r\n\r\nThrough a devolving web of greed, self-serving power and a departure from fundamental ethics, Western culture has, over the last hundred years, become the counterfeit culture. Nothing is real anymore — not the food, not the money, and certainly not the evening news.... And yet, things that are REAL are called fake A man who recently stamped his own gold coins — out of real gold — was raided and arrested by the U.S. Treasury Department which announced that his GOLD coins were “counterfeit!”... After the drug companies stole thelovastatinmolecule from red yeast rice to create their own statin drugs, the FDA tried to ban all red yeast rice as a dietary supplement, claiming it contained “counterfeit statin drugs.”... When the alternative media like NaturalNews and Infowars publishes real news that nobody else will publish, it’s called “fake” by the corrupt, openly bought-and-paid-for mainstream media (the OLD media). Real is fake, fake is real. That’s how the world works today, folks: Things that are REAL — herbal medicine, gold coins, truthful journalism — are all called FAKE. Meanwhile, things that are FAKE — the money supply, pharmaceutical medicine, myths of U.S. history and justification for war — are all called REAL.\r\nhttp://www.naturalnews.com/033491_counterfeit_culture.html\r\n\r\nLawsuit accuses security guard of handcuffing first-graders for talking in class\r\nChicago Tribune\r\nSeptember 2, 2011\r\n\r\nThe attorney for a family suing Chicago Public Schools over the alleged handcuffing of a first-grader in 2010 said Tuesday that the boy was among several 6- and 7-year-olds who were detained and handcuffed for hours for talking in class. In an email to the Tribune, attorney Michael Carin said school officials at Carver Primary School on the Far South Side authorized the on-campus security guard in March 2010 to discipline some first-graders who were being disruptive. Giving details not disclosed in the lawsuit filed Monday in Cook County Circuit Court, Carin said the school’s security officer removed the students from class and held them in another office on campus where there were no other adults present. Carin said the students were handcuffed for hours and told that “they were going to prison and would never see their parents again.” “There appears to be no reason for an officer to isolate 6- and 7-year-old children, place them in handcuffs and threaten them for hours during a school day, or any other day,” Carin wrote.\r\nhttp://www.chicagotribune.com/news/education/ct-met-first-grader-handcuffed-0831-20110831,0,3999803.story\r\n\r\nAppeals Court Rules It Is Not Illegal To Film Police\r\n﻿Americans still being arrested for recording cops as a consequence of mass hoax﻿\r\nPrison Planet.com\r\nSeptember 1, 2011\r\n\r\nDespite the mass hoax still being promulgated by both the mainstream media and local authorities across America, the First Circuit Court of Appeals has ruled that it is not illegal for citizens to videotape police officers when they are on public duty. “The filming of government officials while on duty is protected by the First Amendment, said the Court,” reports Daily Tech. “The filming of government officials engaged in their duties in a public place, including police officers performing their responsibilities, fits comfortably within these principles [of protected First Amendment activity].,” said the Court. “Gathering information about government officials in a form that can readily be disseminated to others serves a cardinal First Amendment interest in protecting and promoting the free discussion of governmental affairs,” stated the ruling, adding that this has been the case all along, and that the right to film police officers is not just restricted to the press.\r\nhttp://www.infowars.com/appeals-court-rules-it-is-not-illegal-to-film-police\r\n\r\nIn America The Rule Of Law Is Vacated\r\nBank fraudsters, torturers, and war criminals running free…\r\nInfowars.com\r\nSeptember 1, 2011\r\n\r\nWith bank fraudsters, torturers, and war criminals running free, the US Department of Justice (sic) has nothing better to do than to harass the famous Tennessee guitar manufacturer, Gibson, arrest organic food producers in California and send 12 abusive FBI agents armed with assault rifles to bust down yet another wrong door of yet another innocent family, leaving parents, children, and grandmother traumatized.\r\nhttp://www.infowars.com/in-america-the-rule-of-law-is-vacated\r\n\r\nPentagon Beta Tests Tighter Military Control of Disaster Response\r\nInfowars.com\r\nAugust 29, 2011\r\n\r\nThe Pentagon is exploiting Hurricane Irene in an effort further militarize disaster response. Fox News reported today that the Pentagon is using the overstated hurricane to minimize civilian participation in emergency situations. Troops on the streets: Military convoy in New York in the aftermath of Irene. Over the weekend, the Pentagon appointed “dual-status commanders” to direct both active-duty troops and guardsmen assisting civilian officials in New Hampshire, New York, North Carolina and Rhode Island. In the past, the chain of command was split between federal and state authorities. Under the cover of fixing supposed delays, duplications and gaps after Katrina hit the Gulf Coast in August 2005, the Pentagon has further crippled Posse Comitatus – restricting military involvement in domestic law enforcement – and limited the participation of the state in disaster and emergency response. This is the first time so-called dual-status commanders have been used for a natural disaster. In the past, they were used at international summits, but not for domestic response to a hurricane. The AP basically reports that the Pentagon used the storm as a beta test for the roll-out of the next phase of the police state – tight integration of emergency response and law enforcement on the state and local level under the military command and control of the Pentagon and the federal government.\r\nhttp://www.infowars.com/pentagon-beta-tests-tighter-military-control-of-disaster-response\r\n\r\nMayor Orders Cops To Remove Citizen At Council Meeting For Stating His Name\r\nEpidemic of power abuse amongst local authorities as America sinks deeper into police state\r\nInfowars.com\r\nAugust 26, 2011\r\n\r\nRon Paul supporter and anti-drug war activist Ronnie Reeferseed was hauled away from an Austin City Council meeting and banned for a year for stating his name in a mildly satirical manner, in yet another example of how local officials are increasingly engaging in petty power trips to oppress the free speech rights of American citizens. The video shows Ronnie introducing himself before Mayor Lee Leffingwell snarls, “you will stop there, step back, your time is up,” and gestures for police officers to come and remove him from the podium. Ronnie stated his satirical pseudonym in a, God forbid, mildly satirical manner, but the reaction of Leffingwell and the goons who removed him from the podium was a despicable and thuggish overreaction. When other citizens present at the council meeting start to vocally complain about Ronnie’s treatment, Mayor Leffingwell calls for order and then threatens them, “sit down, be quiet, or you’ll be next.”\r\nhttp://www.infowars.com/mayor-orders-cops-to-remove-citizen-at-council-meeting-for-stating-his-name\r\n\r\nRon Paul: People Will Go in the Street in Response to Inflation Tax\r\nInfowars.com\r\nAugust 26, 2011\r\n\r\nRon Paul told Lou Dobbs yesterday that the inflation tax – printing more money and expanding the monetary base – will result in people going in the street. Paul made his comment following large demonstrations and riots in Europe in response to the engineered global economic implosion. In France, on May Day, more than three million people attended 300 rallies against President Nicolas Sarkozy’s economic recovery plan. The demonstrations followed Sarkozy’s announcement that the French government plans to implement austerity measures, including spending cuts and tax increases. “There’s going to be an inflation tax to hit us and I am just afraid there will be people in the streets when they don’t get what they want,” Paul told the Fox Business Network.\r\nhttp://www.infowars.com/ron-paul-people-will-go-in-the-street-in-response-to-inflation-tax\r\n\r\nObama Issues Preemptive Emergency Declaration For North Carolina, NYC Transit To Shut Down Saturday\r\nBusiness Insider\r\nAugust 26, 2011\r\n\r\nThe eye of hurricane Irene remains near the Bahamas, but already President Barack Obama has signed an emergency disaster declaration for North Carolina. The North Carolina’s Outer Banks are expected to take the brunt of the storm at its strongest point on Saturday — with latest predictions placing the center of the storm passing over New York City as a Category 1 hurricane late Sunday. The declaration authorizes the Federal Emergency Management Agency to assist in evacuation and response as it deems necessary. “Specifically, FEMA is authorized to identify, mobilize, and provide at its discretion, equipment and resources necessary to alleviate the impacts of the emergency. Emergency protective measures, including direct federal assistance, will be provided at 75 percent federal funding.” The New York City transit system is expected to shut down bus, train and subway service once winds reach 39 miles per hour — which may occur as soon as Saturday. Additionally, bridges across the tri-state New York area may be closed if high winds make them too dangerous to pass. If the storm continues on its present track, Obama will likely issue similar preemptive declarations in the next day or two.\r\nhttp://www.businessinsider.com/obama-preemptively-issues-emergency-declaration-for-north-carolina-2011-8\r\n\r\nFDA wages secret war on raw milk farmers using KGB-style spying and infiltration techniques\r\nInfowars.com\r\nAugust 25, 2011\r\n\r\nAfter weeks of investigation, NaturalNews can now reveal that the U.S. Food and Drug Administration is waging a clandestine war on raw milk dairy farmers through a network of government spies who are coached on infiltration and social engineering techniques. Resembling the Stasi East German police or KGB of the former Soviet Union, these undercover FDA agents meet each month for a “spying roundtable” phone conference called the Raw Milk Call during which techniques of infiltration are openly discussed and encouraged. NaturalNews can now reveal that the majority of these undercover FDA agents are women, who are more easily able to infiltrate the raw dairy community with techniques of social engineering (see below). The existence of this elaborate spying operation has been confirmed by NaturalNews through three different sources, all of which demanded anonymity as they fear being targeted by the FDA with armed raids, false arrest and destruction of their property, as we recently witnessed with the Rawesome Foods raid. One source told NaturalNews they feared the FDA would stage a Waco-style siege of their farm and invent some justification to assault their farmhouse and shoot them and their family. Yes, this is how much freedom has been lost in America today, where farmers are afraid to speak out for fear they might be killed. And yet, it’s not paranoia: They have legitimate reason to fear their own government is targeting them for termination.\r\nhttp://www.infowars.com/fda-wages-secret-war-on-raw-milk-farmers-using-kgb-style-spying-and-infiltration-techniques\r\n\r\nBig Sis Gives Green Light For Drone That Tazes Suspects From Above\r\nMini chopper can also carry shotguns and grenade launchers\r\nInfowars.com\r\nAugust 24, 2011\r\n\r\nThe Department of Homeland Security has given the green light for police departments in the United States to deploy a drone helicopter that has the ability to taze suspects from above as well as carrying 12-gauge shotguns and grenade launchers.\r\nhttp://www.infowars.com/big-sis-gives-green-light-for-drone-that-tazes-suspects-from-above\r\n\r\n5 Reasons Why American Riots Will Be The Worst In The World\r\nDont-tread-on.me\r\nAugust 10, 2011\r\n\r\nI wrote an article called 5 Places NOT To Be When The Dollar Collapses. In it I wrote that societies that benefited the most from the dollar would be the worst places to be when it fell apart. While the dollar has not even collapsed yet, the strain in these areas is becoming more apparent. England is number 3 on the list has had 4 days of violent riots as people start to lose it. Israel is number 1 on that list has had massive protests. There is revolution in the air all over the world except in the US. America is still in deep denial which is still the first stage of the Awakening. This denial will be wiped away when the dollar collapses. For now the economy is still functioning with food and fuel available. Americans still have the illusion of wealth and normalcy. They still are stuck in the false left right paradigm and think some other sock puppet will turn things around. When the dollar collapses, all American illusions will collapse with it. Deep denial will turn into deep anger. The violence I expect in the other 3 areas on the list and all urban areas in the US, will make all other global riots pale in comparison. America is deeply infused with arrogance, denial, narcissism, drugs and violence. There is no other society that I know of that has the degree of intensity and combination of these factors.\r\nhttp://dont-tread-on.me/5-reasons-why-american-riots-will-be-the-worst-in-the-world", "group_id": 3920, "id": 2113153}]