[{"user_id": 37168, "stars": [], "topic_id": 44077, "date_created": 1313733617.815896, "message": "I'm having difficulty encoding the overall story since most of the overall story characters only pop up once along the road. That said, it seems like my main and impact characters are creeping into the overall story quite a bit. Am I approaching this the wrong way?", "group_id": 2515, "id": 1908138}, {"user_id": 7645, "stars": [], "topic_id": 44077, "date_created": 1313738349.232404, "message": "The main and impact characters also have roles in the overall story so this sounds par for the course.", "group_id": 2515, "id": 1908464}, {"user_id": 37586, "stars": [], "topic_id": 44077, "date_created": 1313759774.916477, "message": "@travelingleonards Couldn't you just have different character portraying the elements you need at each stop along the way? The old hand off.", "group_id": 2515, "id": 1909545}, {"user_id": 10814, "stars": [], "topic_id": 44077, "date_created": 1313768968.9356971, "message": "Hand-offs are the way to go.  Have a series of characters do the duty of one, such as a serial guardian, a different guardian per act.", "group_id": 2515, "id": 1910712}, {"user_id": 38285, "stars": [], "topic_id": 44077, "date_created": 1313776617.410692, "message": "@travelingleonards LOL... That is the exact same problem I presented a couple of weeks ago. Only worded better.", "group_id": 2515, "id": 1911604}, {"user_id": 37586, "stars": [], "topic_id": 44077, "date_created": 1313781673.7008381, "message": "@MikeDerk great example Mike. I learn a lot from the way you illustrate.", "group_id": 2515, "id": 1912256}, {"user_id": 7664, "stars": [], "topic_id": 44077, "date_created": 1313780930.08673, "message": "@travelingleonards I found keeping the storylines clear to be one of the hardest hurdles of Dramatica, even though it seems so simple from the other side.\n\nI found that really focussing on the Problem -- usually not the Element, but how you are actually expressing it -- to be the fix. \n\nOnce it all settled in, I began to see the throughlines as much less discrete. It wasn't \"This is an MC scene\" and \"This is an OS scene.\" They can really blend.\n\nImagine a shy detective trying to interview a witness. He's got the the OS Problem of Avoid (the criminal doesn't want to be caught) and the MC Problem of Avoid (he'd be more comfortable not speaking to this person).\n\nThe Drama in the scene is enhanced by having both the OS and MC throughlines in play -- he must stay, he doesn't want to stay. Which drive will win?\n\nSo, if your characters are creeping in where you never expected them, it's probably the story smoothing itself out. Just keep an eye on the Problems.", "group_id": 2515, "id": 1912163}, {"user_id": 7664, "stars": [], "topic_id": 44077, "date_created": 1313784142.906441, "message": "Thanks.", "group_id": 2515, "id": 1912494}, {"user_id": 39675, "stars": [], "topic_id": 44077, "date_created": 1313807062.3243721, "message": "Aha!  That is why I always feel the best stories seem to have the same story, repeating.  It is the story problem instinct of the writer and/or director and/or the actors.", "group_id": 2515, "id": 1914725}, {"user_id": 7664, "stars": [], "topic_id": 44077, "date_created": 1313816923.707536, "message": "@prish What?", "group_id": 2515, "id": 1915588}, {"user_id": 39675, "stars": [], "topic_id": 44077, "date_created": 1313908928.0915129, "message": "Throughout the years, while reading stories and/or watching them, I found the ones that were the most satisfying had repeating, stories within stories.  They were different things happening, but they seemed tied together, somehow.  I never could figure out why and why it worked.  Your discussion and my realizing that the story problem was, most likely, in play triggered my aha.  I'll think this through over the next few days/weeks, and maybe come up with some solid examples.", "group_id": 2515, "id": 1921248}]