[{"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1311630483.4375391, "message": "The $150 is just a guess, if it only takes $75 or $250 is necessary please note, and I'm not expecting the bluetooth shield in that.  I bought some few dollar bluetooth USB radios to equip my non-bluetooth devices at home, and I thought I might be able to glom into an arduino solution.", "group_id": 8728, "id": 1718893}, {"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1311630308.939604, "message": "I've purchased enough stuff (Mindstorms, Roomba, basic electronics bench supplies--no regrets) that collected more dust than ideas that when it came to spending $100-$200 on Arduino I decided to wait until I have an idea, and I've had just enough idea (not novel, bluetooth remote, and building off of Roomba and media device notions) that it's about time to buy an  Arduino starter kit and some staple accessories.    There is a *lot* of different Arduinos, suppliers, and nifty accessories, which is why I'm here to ask:  What would you buy to start learning and tinkering with Arduino on a $150 budget?  (and where?)", "group_id": 8728, "id": 1718875}, {"user_id": 29165, "stars": [], "topic_id": 42658, "date_created": 1311686266.9428909, "message": "I'd start with an Arduino Uno and a Danger Shield. The Danger Shield will give you plenty of things to play with as you ramp up. To make your idea happen you'll want a ProtoShield or a ProtoScrewShield. This would run you right about $75 from SparkFun, who I highly recommend (fast and well stocked and very informative stuff on their blogs). Also search Sparkfun for \"Shield\" to see the variety of plug on boards available. You'll end up with many more ideas. I have lot of components (and even a bare DangerShield PCB) so let me know if you need something. Happy to help a fellow maker!", "group_id": 8728, "id": 1722823}, {"user_id": 29165, "stars": [], "topic_id": 42658, "date_created": 1315481216.84568, "message": "Here is another Arduino starter option. http://www.adafruit.com/products/170", "group_id": 8728, "id": 2074895}, {"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1315586960.5596361, "message": "I saw this mini arduino for deploying projects on Make's blog a few days ago and glad to see they make their Kickstarter deadline! http://www.kickstarter.com/projects/988159748/extracore-arduino-compatible", "group_id": 8728, "id": 2085634}, {"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1315586750.0279379, "message": "The Experiment's guide in this kit looks great, glad to see they also made it free online.", "group_id": 8728, "id": 2085606}, {"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1317616978.561687, "message": "Success!! https://plus.google.com/108981606325646116891/posts/1C5mRFs7Npr", "group_id": 8728, "id": 2265020}, {"user_id": 1924, "stars": [], "topic_id": 42658, "date_created": 1317664658.257108, "message": "Google+ Fail: Picasa videos only viewable when you're logged in with your Google account.  Uploaded via YouTube: http://t.co/PyC8h0VK", "group_id": 8728, "id": 2268732}]