[{"user_id": 11626, "stars": [], "topic_id": 40723, "date_created": 1309363081.246954, "message": "Fukushima in Nebraska? Raging Flood Waters Threaten Nuclear Catastrophe\nInfowars \nJune 28, 2011\n\nOnce again, the corporate media is ignoring a potentially deadly nuclear situation, this time right here in the United States. The Fort Calhoun Nuclear Power Plant in Nebraska is now inundated with flood water from the Missouri River. A berm protecting the plant collapsed on Sunday. Prior to the failure of the berm, there was a fire at the facility. The official story was that the fire was contained in an electrical switchgear room. Corporate media ignoring dangerous potential of Fort Calhoun Nuclear Power Plant....\nhttp://www.infowars.com/fukushima-in-nebraska-raging-flood-waters-threaten-nuclear-catastrophe\n\nComing to a Store Near You: Radioactive Fish?\nWashington’s Blog \nJune 28, 2011\n\nAs I pointed out in April, the FDA is refusing to test fish for radioactivity, even though water currents will eventually bring debris from Fukushima: The debris mass, which appears as an island from the air, contains cars, trucks, tractors, boats and entire houses floating in the current heading toward the U.S. and Canada, according to ABC News. The bulk of the debris will likely not be radioactive, as it was presumably washed out to sea during the initial tsunami – before much radioactivity had leaked. But this shows the power of the currents from Japan to the West Coast. Of course, fish don’t necessarily stay still, either. For example, the Telegraph notes that scientists tagged a bluefin tuna and found that it crossed between Japan and the West Coast three times in 600 days....\nhttp://www.washingtonsblog.com/2011/06/radioactive-fish.html\n\nWhat The Fukushima Is Going On In Omaha?\nLocal Talk News \nJune 28, 2011\n\nFort Calhoun nuclear facility.... The government is telling us not to panic. All is under control, just like in Japan. But here are a few troubling inconsistencies. One, the Red Cross shelter next to the Fort Calhoun plant has been closed. They claim it was due to “decreased need.” During a flood? Now there is a no-fly zone around the plant. Then there is the disturbing news that the spent fuel rod pool was so full that they store the surplus fuel rods in a dry storage area outside the safety of the pool. How long will that area stay dry and what happens if it gets wet? One reporter claims the dry storage bunker is now half-submerged. One of the intake structures is prone to flooding that could affect the water pumps. Non-functional water pumps? Does that sound familiar?\nhttp://localtalknews.com/home-page-columnists/marvin-wolf/923-what-the-fukushima-is-going-on-in-omaha\n\nElderly volunteers to help Fukushima nuclear cleanup\nJapan Times \nJune 28, 2011\n\nElderly volunteers to help Fukushima nuclear cleanup --Almost four months since crisis started, 3,514 workers involved in cleanup have been exposed to radiation 29 Jun 2011 Yasuteru Yamada, 72, a former antinuclear activist, will lead a group of retirees to the Fukushima No. 1 plant in early July to help clean up the site of Japan's worst atomic disaster since World War II. Yamada, a retired Sumitomo Metal Industries Ltd. plant engineer, is waiting for Tokyo Electric Power Co. to allow his volunteer Skilled Veterans Corps to carry out on-site preliminary inspections, a move the government welcomes.\nhttp://search.japantimes.co.jp/cgi-bin/nn20110629n2.html\n\nGov't urges 3 more prefectures to examine radiation levels in food\nMDN News \nJune 28, 2011\n\nGov't urges 3 more prefectures to examine radiation levels in food 28 Jun 2011 A government task force on the nuclear emergency said Monday it has decided to call on three more prefectures to examine radioactive materials in food, while adding tea, wheat and fishery products as individual items to be monitored. A rule on radiation in food the panel set in early April has so far targeted four prefectures including Fukushima, where the government has banned shipments of farm products after the accident at the Fukushima Daiichi nuclear power plant, and the surrounding seven prefectures.\nhttp://mdn.mainichi.jp/mdnnews/news/20110628p2g00m0dm007000c.html\n\nBerm Protecting Fort Calhoun Nuclear Plant Breaks … Plant Flooded, on Emergency Diesel Generators\nWashington’s Blog \nJune 27, 2011\n\nI reported Thursday: Here are photos of the Aqua Dam installed outside the Fort Calhoun plant courtesy of the official OPPD Flood and Outage blog.... Unfortunately, the berm at Fort Calhoun has now broken. As the New York Times notes: Fort Calhoun, took two steps backward on Sunday. In the pre-dawn hours, a piece of heavy equipment nicked a temporary rubber berm, 8 feet high and 2,000 feet long, and it deflated. And water there began to approach the switchyard, where grid power enters the complex, so operators started up their diesel generators....\nhttp://www.washingtonsblog.com/2011/06/fort-calhoun-nuclear-plant-flooded.html\n\nSecondary Flood Berm Collapses at Neb. Nuclear Plant\nNuclear Street \nJune 27, 2011\n\nSecondary Flood Berm Collapses at Neb. Nuclear Plant --Emergency Status -- 'Unusual Event Declaration' -- Unchanged 27 Jun 2011 A water-filled berm at the Fort Calhoun nuclear plant deflated Sunday, the Omaha Public Power District reported. Apparently punctured by heavy equipment operating nearby, the berm was among several barriers protecting plant buildings from extreme flood conditions on the adjacent Missouri River. River levels at Fort Calhoun recently stood at 1,006 feet above sea level and are not expected to exceed 1,008 feet above sea level - six feet below the maximum flood level anticipated in the plant's design.\nhttp://nuclearstreet.com/nuclear_power_industry_news/b/nuclear_power_news/archive/2011/06/27/emergency-status-unchanged-as-secondary-flood-berm-collapses-at-nebraska-nuclear-plant-062701.aspx\n\nAdded flood protection at Nebraska nuclear plant fails\nIowa Independent \nJune 27, 2011\n\nAdded flood protection at Nebraska nuclear plant fails --If floodwaters reach 1,009 feet, plant would likely switch from lowest level of emergency status to second of four emergency levels 27 Jun 2011 A concerning situation near Omaha, Neb. took a new twist early Sunday when a temporary levee protecting the Fort Calhoun Nuclear Station failed, forcing the facility to turn briefly to emergency generated power. Two Nebraska nuclear stations -- Cooper near Brownville and Calhoun near Blair (19 miles north of Omaha) -- are coping with ongoing Missouri River flooding. Although Cooper was built above the flood plain, Calhoun was not.\nhttp://iowaindependent.com/57788/added-flood-protection-at-nebraska-nuclear-plant-fails\n\nNRC Website Defines Media Blackout Over Nebraska Nuclear Plant Flooding\nSalem-News.com \nJune 27, 2011\n\nAmericans are getting more information about the drowning nuclear plant from civilians on YouTube than government agencies or media.\nFlooding. As the U.S. populace idles along in relative ignorance over the looming nuclear disaster in Nebraska, we turn our attention, quite naturally, to the agency in this nation that monitors and regulates these deadly energy sources, the Nuclear Regulatory Commission, or NRC. Of course we count on agencies like this to ensure that people are safe and aware of potential developments, like the Fort Calhoun Nuclear Power Facility that has for some time now, been surrounded by the waters of the overflowing Missouri River. The river is significantly above safe levels and has been for some time now. The nuclear plant was closed in April. The agency has talked about it, and in fact the NRC’s director was at the plant today and NRC crews have been on the scene since yesterday. The facility was built in a location known as the Missouri River flood plane [sic] ....\nhttp://www.salem-news.com/articles/june262011/nrc-nebraska.php\n\nFukushima starts internal radiation checks\nYomiuri \nJune 27, 2011\n\nFukushima starts internal radiation checks 28 Jun 2011 Fukushima Prefecture began checking the internal radiation dose levels of selected residents Monday, the first step in its plan to examine the health of its 2 million residents amid the crisis at the Fukushima No. 1 nuclear power plant. About 28,000 residents of Namiemachi, Iitatemura and the Yamakiya district of Kawamatacho were to receive the initial checks. All of Namiemachi was designated as part of the no-entry zone within a 20-kilometer radius of the plant, while Iitatemura and the Yamakiya district of Kawamatacho were designated as planned evacuation areas.\nhttp://www.yomiuri.co.jp/dy/national/T110627005040.htm\n\n15 Fukushima residents' urine contaminated with radiation \nDaily India \nJune 27, 2011\n\n15 Fukushima residents' urine contaminated with radiation --Radioactive cesium found both times in each resident 27 Jun 2011 Over three millisieverts of radiation has been measured in the urine of 15 residents living near the Fukushima Daiichi Nuclear Power Plant, especially in the village of Litate and the town of Kawamata. Both the places are about 30 to 40 kilometres away from the Fukushima No. 1 power plant, which has been releasing radioactive material into the environment... Nanao Kamada, professor emeritus of radiation biology at Hiroshima University, said that people need to stop eating contaminated vegetables or other products to avoid being affected by it.\nhttp://www.dailyindia.com/show/447618.php", "group_id": 3920, "id": 1517930}]