[{"user_id": 13109, "stars": [], "topic_id": 36724, "date_created": 1306326341.20439, "message": "I was just reading the posts in \"Communicating Dramatic to laypersons\" and read an interesting part from JBarker\n\n\"Well put. I had one person try to tell me the bookends to Titanic weren't needed, that the story was \"whole\" if it were merely set in the past. Now there's somebody who missed the author's intent; even when I pointed out one of the major themes happened to be, get this, the theme song to the movie, they still argued. I think you'll remember the e-mail I sent you a few weeks ago (this is Jim by the way), but these people were calling the inciting incident of the movie being when Titanic hit the iceberg, two hours in! Huh?!! I tried my best to illustrate the meaning found in the audience KNOWING (and not just assuming) Rose went on to live a fulfilling life, how it was necessary so Jack's death would not be for naught - but ultimately they wanted to analyze the movie as how they thought it should be, totally disregarding the fact that everything was there for a reason and had meaning.\"", "group_id": 2515, "id": 1177118}, {"user_id": 13109, "stars": [], "topic_id": 36724, "date_created": 1306326586.8615589, "message": "Talking of book ends.  I have recently watched Water for Elephants and it has a similar structure as Titanic in regard to bookending of the film with the old person reminiscing past events, narrating into the story.  I was amazed at how clunky it was compared to Titanic and how in WfE I don't think the bookending was needed at all.  \n\nThere wasn't anything in the bookending that seemed to help with the story - or give meaning to the film in the way that Titanic did.  With Titanic, the bookending seemed to be integrated more with the story and add to it.\n\nTo bring it back to Dramatica - has anyone seen both movies and wanted to comment on how bookending of a film would best be done through the use of dramatica?  Should the M/C concern be shown in the bookends to assist in drawing the story together", "group_id": 2515, "id": 1177142}, {"user_id": 33839, "stars": [], "topic_id": 36724, "date_created": 1306332770.0125511, "message": "I haven't seen it yet, been meaning to myself.  Interestingly enough re: my original post, the person I was discussing this with back and forth kept bringing up Vogler's theories and how he discussed it in depth in his book.  Well, last night at the bookstore, I decided to check it out and had to laugh to myself: Vogler goes into some details about the purpose of the bookends, many which reflect exactly what I was saying making me wonder if the person using him as a reference actually read the thing.", "group_id": 2515, "id": 1178537}, {"user_id": 33839, "stars": [], "topic_id": 36724, "date_created": 1306333544.2532301, "message": "With regards to my own personal work, I can say in a recent rewrite I added a V.O. to the script because some weren't understanding who the main character was vs. the protagonist.  I believe it helped immensely because there are bookends involving the same scene (but in the end there's an additional bit revealed) and it helps hammer home what the main character struggling with - the illusion of innocence and how perceptions can change over time with new information.  At the beginning, the bookend portrayed is before she's born so it's objectively shown, but her V.O. is somewhat subjective, based only on what she's been told or knows to a certain point.  In the ending scenes when it's repeated, it's totally subjective - not because she was there, but because it's how she chooses to see it.  She still doesn't know the truth as it pertains to the opening, but what she believes exonerates her of wrongdoing with the dilemma posed at the story's conclusion - a reflection of a major theme that's just played out with innocence being an illusion and the stories we tell ourselves/choose to believe so we don't view ourselves as being guilty of something.  I couldn't have gotten to that point if I didn't clearly separate the main character from the protagonist who also serves as an impact character.  She essentially has a level of self-awareness at the end that the protagonist didn't  have (it's a father/daughter).", "group_id": 2515, "id": 1178772}, {"user_id": 30951, "stars": [], "topic_id": 36724, "date_created": 1306333513.356734, "message": "I would have thought that bookends are not part of Dramatica, because that is for the audience only (not the authors view of the entire story).", "group_id": 2515, "id": 1178766}, {"user_id": 7669, "stars": [{"date_created": 1306346587.884295, "user_id": 7645}], "topic_id": 36724, "date_created": 1306344145.0046749, "message": "Getting back to Titanic, years ago we did a group analysis of it, and from a Dramatica standpoint it seemed pretty clear that the past-story and the present-day story each had their own storyform -- one where Rose was the MC and Jack the IC, and the other where Old Rose is the IC and Bill Pullman (or was that Paxton?--can't keep them straight) the MC.  So yes, the 1912 story was definitely complete unto itself.  The present-day (bookend) story was not AS complete, but still had its own dynamics including Change/Steadfast.  The juxtaposition of the two was not NECESSARY story-wise, but greatly enhanced the audience's experience given the recent (at the time) re-discovery of the ship's remains.  So at that level the discussion of the movie's meaning goes beyond Storyforming and gets thick into Story Encoding and Audience Reception.", "group_id": 2515, "id": 1181152}, {"user_id": 7669, "stars": [], "topic_id": 36724, "date_created": 1306344388.521764, "message": "I haven't seen Water for Elephants, so I can't comment on it.  But in another film where we see a present-day character tell a past-story, \"Stand By Me\", in that case you cannot attribute a storyform to the present-day bookends that is separate from the main story.", "group_id": 2515, "id": 1181205}, {"user_id": 7669, "stars": [], "topic_id": 36724, "date_created": 1306345124.6164851, "message": "So to get back to Brendon's question of:  \"...how bookending of a film would best be done through the use of dramatica? Should the M/C concern be shown in the bookends to assist in drawing the story together\" -- You have to consider each case independently.  A bookend can help complete the storyform of the main story (or at least put a punctuation on it) the way it does in \"Stand By Me\", or it can have its own storyform and serve to enhance the experience but not necessarily the main story like in \"Titanic\" (although you're likely to have a much longer film that way!).  Author's choice!", "group_id": 2515, "id": 1181372}, {"user_id": 33839, "stars": [], "topic_id": 36724, "date_created": 1306346833.556726, "message": "With regards to Titanic, I do believe there are two sets of stories going on, each with their own inciting incidents, etc., however, if we view the story set in the past as being complete in and of itself, I would say it would feel awfully unsatisfying and unfulfilled.  In the discussion I had with someone else, they felt as though the story should have ended with Rose adopting Jack's surname, that Rose had demonstrated growth/change throughout the story.  The thing is, she did that WITH Jack.  We know the moment she decides to blow the whistle that she's decided to live, but at this point, it's merely in the same context as she existed before meeting Jack (meaning, she's a living, breathing, person).  As a result, if we simply cut away at this endpoint, her taking his surname in NYC and discovering she has the Heart of the Ocean (I do believe she found it in her pocket?), it would be unfulfilling in the sense that we'd be left to assume, whereas within the context of having the bookend, we see she's lived a long, adventurous life, that Jack's impact on her lasted beyond their voyage.  The movie's strongest themes are also found within the bookends, something that can't be gleamed from the core story set in the past - those being a woman's heart is a deep ocean of secrets, and that life, love, and the love of life goes on after such a tragedy.   Not having them would be sort of like having Shawshank Redemption simply end with Andy Dufrense driving along the coast of Mexico with his top down, because he's not who the story is really about.  We, the audience, want/need to know Rose went on to live an fulfilling life, that Jack's death/sacrifice wasn't in vain - just as we want/need to know there's hope for Red, that he gets out and finds out what's in that box buried under the volcanic obsidian rock.", "group_id": 2515, "id": 1181717}, {"user_id": 7669, "stars": [], "topic_id": 36724, "date_created": 1306396124.793401, "message": "Yes, I agree, one story illuminates the other -- otherwise why make the movie that way?  Also consider the final scene, Rose (Kate Winslet) meeting Jack in the afterlife -- which storyform does that scene belong to?  Probably both, but a little more the 1912 story than the 1990's story, and that would provide the final punctuation you're looking for in that storyform, JBarker, without the absolute necessity of the other.  Again, the present-day scenario is not NECESSARY to complete the past-day storyform, but it certainly helps make it richer and more fulfilling.", "group_id": 2515, "id": 1189741}, {"user_id": 7669, "stars": [], "topic_id": 36724, "date_created": 1306397274.3509941, "message": "You also have to consider that if Cameron had chosen to tell the 1912 story ONLY, it would have come out a bit differently.", "group_id": 2515, "id": 1189933}, {"user_id": 33839, "stars": [], "topic_id": 36724, "date_created": 1306421698.246362, "message": "I'd say in Titanic's case, it did both (put the story into a context and showed the outcome).  Seeing the outcome of the ship, or more specifically, the computer generated animation as to how it sank, gave the audience a sense of suspense: they now knew exactly what was going to happen, but not how it would impact each character and their decision making.  I often think about how I turned to my friend 1/2 way through the movie and said \"man, the ship hasn't even been struck yet!\".", "group_id": 2515, "id": 1192655}, {"user_id": 10814, "stars": [{"date_created": 1306427076.20082, "user_id": 7645}], "topic_id": 36724, "date_created": 1306421284.4928191, "message": "Bookends are often storytelling devices that allow the author to put the story in context.  Other times, bookends are storyweaving devices that show a bit of the end of the story at the beginning of the work, and then finish the end of the story at the end of the work.  The latter feel more integrated.\n\nAnother form of bookending involves having an establishing scene at the beginning that shows how things stand (with the MC and/or the OS), and then have a parallel scene at the end of the work that shows hows the MC or OS has changed (or not).", "group_id": 2515, "id": 1192587}]