[{"user_id": 14022, "stars": [], "topic_id": 8022, "date_created": 1298367924.1472261, "message": "I played WC3 DotA quite a bit, though. I probably would have paid $10-15 for it.", "group_id": 49, "id": 178127}, {"user_id": 14022, "stars": [], "topic_id": 8022, "date_created": 1298367780.0481839, "message": "The SC2 editor is sooo much fun. I have a feeling that not many people will be willing to pay for these mods since they have all been free up until now.", "group_id": 49, "id": 178120}, {"user_id": 9328, "stars": [], "topic_id": 8022, "date_created": 1298392237.1610479, "message": "I definitely would. The map editor is so powerful and with the ability to make cut-scenes, I really hope that we start to see user-made campaigns and games take shape. I'd for sure be willing to put some money down to expand upon the SC2 universe.", "group_id": 49, "id": 180100}, {"user_id": 8981, "stars": [], "topic_id": 8022, "date_created": 1298419848.8486171, "message": "That 'World of Starcraft' map looked pretty sweet.", "group_id": 49, "id": 185207}, {"user_id": 3584, "stars": [], "topic_id": 8022, "date_created": 1298437977.6742091, "message": "I played in the editor for about 5 minutes, could not FOR THE LIFE OF ME work out how the hell it operates... I'd love to get in and just redesign the UI for normal games", "group_id": 49, "id": 185863}, {"user_id": 8981, "stars": [], "topic_id": 8022, "date_created": 1298438057.844018, "message": "It is pretty complicated. There are plenty of [video]tutorials on youtube. sc2mapster.com has quite afew resources as well", "group_id": 49, "id": 185866}, {"user_id": 26, "stars": [], "topic_id": 8022, "date_created": 1299639944.2299659, "message": "I guess I must be out of the loop on this.  Is this something they've actually proposed/announced?", "group_id": 49, "id": 301276}, {"user_id": 19649, "stars": [], "topic_id": 8022, "date_created": 1299638801.623637, "message": "I'd pay if they were less than $5, I don't play custom games enough for it to be worth more", "group_id": 49, "id": 301221}, {"user_id": 19755, "stars": [{"date_created": 1299639977.6374481, "user_id": 26}], "topic_id": 8022, "date_created": 1299639879.4503119, "message": "I would personally not pay for custom games. I haven't really found a custom game that really appealed to me the way that the actual game does.", "group_id": 49, "id": 301271}, {"user_id": 19774, "stars": [], "topic_id": 8022, "date_created": 1299651057.3800769, "message": "They announced this ages ago, I believe at Blizzcon 08? Recently they've released information stating that this is going to be much more difficult to implement than they had originally thought and it may even be scrapped at this point.\n     That being said, if the feature is released, I'll buy maps if they're good. I wouldn't pay a dime for most of the maps currently out but with some of the new custom map features that will be implemented in 1.0.3 I hope the best maps will really rise to the top.\n     What it really boils down to is if developers can make money from maps, they'll make better maps. People whine about paying more money but I'd pay quite a bit to play another DotA quality mod.", "group_id": 49, "id": 302269}, {"user_id": 52, "stars": [], "topic_id": 8022, "date_created": 1299654190.1740301, "message": "I wouldn't, but only because I don't have time much time to play SC, so I devote the little time I do have exclusively to ranking up in the 1v1 ladder.", "group_id": 49, "id": 302404}]