[{"user_id": 15255, "stars": [], "topic_id": 9051, "date_created": 1298638849.041389, "message": "Hello guys, lately I have been thinking a lot about a possible start up. However, having an economics degree, I am not the best web developer or designer around. What would you do in this situation? Where would you go? Have you ever had this problem?", "group_id": 4984, "id": 207642}, {"user_id": 11589, "stars": [], "topic_id": 9051, "date_created": 1298665929.6520619, "message": "I'm doing just enough to build a wire frame prototype. and do some pre-alpha testing.Good developers think along the lines of... \"I could build this better with...\" & \"I could do this better by...\". My hope is that I can sell them on the vision of the what the idea can become.", "group_id": 4984, "id": 211113}, {"user_id": 11589, "stars": [], "topic_id": 9051, "date_created": 1298665757.32179, "message": "I'm pretty much in the same boat.  read a tweet recently \"In startups you are either a seller or a builder, if not GTFO.\" With business/econ degrees is our job to sell others on the promise of a better future for your industry and vision of what the company can be with their help.", "group_id": 4984, "id": 211103}, {"user_id": 3413, "stars": [], "topic_id": 9051, "date_created": 1298667548.323782, "message": "I'm interested in finding better outlets to discover partners as well. I vetted dozens of programmer teams before I started my project and STILL ended up with duds.", "group_id": 4984, "id": 211240}, {"user_id": 11589, "stars": [{"date_created": 1298667739.2000289, "user_id": 3413}], "topic_id": 9051, "date_created": 1298667702.0324111, "message": "I'm sensing an opportunity here.", "group_id": 4984, "id": 211251}, {"user_id": 15255, "stars": [], "topic_id": 9051, "date_created": 1298715077.794811, "message": "The problem is how to share your idea. I mean, the moment you do it with a programmer, you may be too dependent from him. What do you think about this? And at what degree would you share your business idea in a place like convore?", "group_id": 4984, "id": 213607}, {"user_id": 8224, "stars": [], "topic_id": 9051, "date_created": 1298734294.1560509, "message": "You are not looking for a programmer, geek, or tech guy.   You are looking for a partner.  Judge them on their honesty and passion, the rest isn't as important as you think it is.", "group_id": 4984, "id": 214437}, {"user_id": 8224, "stars": [], "topic_id": 9051, "date_created": 1298734546.79895, "message": "@viandante I wouldn't post it directly in here, but never be one of those guys that won't pitch the idea to a new partner.  If they can run with it then you obviously provide no real value.   I wish you the best of luck finding a partner, it is a extremely frustrating task even on both sides of the fence.", "group_id": 4984, "id": 214442}, {"user_id": 15255, "stars": [], "topic_id": 9051, "date_created": 1298840134.402148, "message": "I am really open to share my idea(s). But there has to be some degree of trust. At an abstract level, you can say what you are thinking of, but sharing the details is a commitment. The details are not just ideas, they are your work.", "group_id": 4984, "id": 220656}, {"user_id": 11589, "stars": [], "topic_id": 9051, "date_created": 1298941929.47223, "message": "At some point you got to dive in and take that risk. The trust will be glorious.", "group_id": 4984, "id": 230663}]