[{"user_id": 11626, "stars": [], "topic_id": 6755, "date_created": 1297919380.237561, "message": "BAE Systems has presented the fruits of its Future Protected Vehicle program (FPV) to the U.K. Ministry of Defence, and it's an intiguing glimpse of the what we can expect to see in tomorrow's high-tech battlefield. With input from over 35 organizations, the FPV study is aimed at identifying \"innovative technologies and concepts for short, medium and long term exploitation into future lightweight land platforms.\" Hundreds of new technologies were canvassed in the study and seven platform concept vehicles have been floated to showcase the most significant of these, including the use of electronic ink camouflage systems, microwave weapons, floating electro-magnetic armor and a type of mechanical \"sweat\" that reduces thermal signature.\r\n\r\n    * WRAITH\r\n    * RAIDER\r\n    * POINTER\r\n    * POINTER\r\n    * View all\r\n\r\nHere's an outline of the seven concepts:\r\n\r\nPOINTER UGV: a go-anywhere quadruped robot with tracked legs which would perform as a forward observer and support ground troops.\r\n\r\nWRAITH: a low signature tank-like scout vehicle designed to infiltrate behind enemy lines which would utilize \"Holistic Signature Management\" – which includes a high efficiency central cooling system – and a High Powered Microwave emitter for disruption of electronic equipment at long ranges and a \"less than lethal but disabling\" effect for scenarios like riot control. This type of vehicle would also pack integrated biometrics which could be used to automate surveillance and, for example, pick out particular faces or behaviors in a crowded situation.\r\n\r\nBEARER: a highly-adaptable payload vehicle which could support logistics and supply as well as ambulance or command and control roles.\r\n\r\nCHARGER: described as a \"highly specialized lethal effects vehicle\", the CHARGER is a cross between a tank and a bulldozer. Apart from it's ability to punch through walls, the 30 tonne vehicle could be equipped with vertical launched missiles, mortars and/or cannon depending on the target. It would also employ actuated spaced armor options designed to create space between the vehicle and it's shield. This could include using electro-magnetic magnets that could be deployed to \"float\" above a vehicle in a threatening situation.\r\n\r\nRAIDER: an two tonne unmanned vehicle designed for scouting and skirmishes that could operate via remote control or autonomously in applications like perimeter patrol.\r\n\r\nSAFEGUARD: this utility vehicle is envisioned as the backbone of an armored infantry unit. It would integrate armored protection with advanced Command and Control systems and have space for eight fully equipped soldiers or the transport of UGVs like the POINTER.\r\n\r\nATLAS: the ATLAS is a convoy vehicle concept which would use drive-by-wire, intelligent driver aids or tele-operation to keep humans completely out of the firing line when moving equipment form place to place.\r\n\r\nThese vehicles would make use of a raft of new technologies outlined by BAE systems. Some of those not mentioned above include systems that extract water from air (around 7 litres per hour is possible according to BAE), intelligent power management and \"Power in Structure\" systems that would store and transmit power through the internal structure of the vehicle, nano-scale fuel additives to increase efficiency and soft vertical launch missiles which could engage targets through 360 degrees without moving the turret or vehicle.\r\n\r\nThe most fascinating of the bunch are the electronic ink based camouflage which could be dynamically altered to suit surroundings and the \"sweating\" vehicle concept, which would emit water from the propulsion system through \"pores\" in the vehicles armor to reduce thermal signature.\r\n\r\nAlthough the vehicles are still very much at concept stage, 47 of the technologies have been highlighted as being suitable for immediate pursuit and the BAE systems team will bid for the next phase virtual prototyping work.\r\n\r\nhttp://www.gizmag.com/bae-systems-future-vehicle-concepts/17361", "group_id": 3920, "id": 129445}]