[{"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305393286.641942, "message": "I ignored this when I first heard about it. Mainly because I don't care when what happens really. It seems though that this is gaining steam again though http://en.wikipedia.org/wiki/Harold_Camping", "group_id": 9787, "id": 1053554}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305393296.91204, "message": "How many times does a guy need to be shown to be a false prophet? Maybe that's why they need stoned back in the day so that people could not be duped twice :)", "group_id": 9787, "id": 1053558}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305393303.5917749, "message": "What other crazy/fringe things are happening out there?", "group_id": 9787, "id": 1053559}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305393700.445682, "message": "Here's a link to his latest prediction if you want to check it out http://www.ebiblefellowship.com/outreach/tracts/may21/", "group_id": 9787, "id": 1053586}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305394032.768724, "message": "Lol", "group_id": 9787, "id": 1053621}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305444549.8674419, "message": "From your wacko link above: \"Since this Bible calendar is given by God in His Word, it can be trusted wholeheartedly\"..... I hate Baptists! :D", "group_id": 9787, "id": 1058287}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305444631.3961301, "message": "Also...someone should tell him the Hebrew calendar was different to our...", "group_id": 9787, "id": 1058295}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305444479.9804809, "message": "Ever heard of the 12th century Saint who apparently accurately predicted all the future Popes? According to the story the current Pope is the second to last and will lead the church through the years of tribulation. http://www.bibleprobe.com/last10popes.htm", "group_id": 9787, "id": 1058284}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305545545.744879, "message": "how about those literal 6000 year old earth people... CRAZY", "group_id": 9787, "id": 1069644}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305743361.8212731, "message": "I wonder if there are any super sold out Christians to Camping's prediction? Wonder what goes through your mind if nothing happens? Wonder if they just shake it off or if they're super shaken up? Possibly believing they were left behind?", "group_id": 9787, "id": 1101083}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305743362.872344, "message": "Would be cool to get a before and after interview?", "group_id": 9787, "id": 1101087}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305748416.052134, "message": "@penkin look at the people hurt and disillusioned by rhema... And they aren't wild extreme crazies. Just people that buy the talk and get confused by the apparent hypocrisy...", "group_id": 9787, "id": 1102470}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305803818.5893631, "message": "Just in case, remember http://eternal-earthbound-pets.com/ Saw @EdwinGarden tweet this today. Seen it before. Can never be too prepared :)", "group_id": 9787, "id": 1110353}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305804059.1412909, "message": "@penkin I like how they've increased their rates to cash in on the rapture prophecies....even though they don't believe it's going to happen......weird model......the most open scam system I've ever seen. We don't believe you'll be raptured but we don't mind suckering you out of money anyway :)", "group_id": 9787, "id": 1110376}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305805659.503299, "message": "Has anyone seen how Camping defends against Matthew \"Tell us, when will these things happen, and what will be the sign of Your coming, and of the end of the age?\" To which Jesus later replies, \"But of that day and hour no one knows, not even the angels of heaven, nor the Son, but the Father alone.\"", "group_id": 9787, "id": 1110522}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305813646.435564, "message": "@LintonCaldecott Ok so he encoded it and then opens that encoding before the happening? What about it coming like a thief in the night?", "group_id": 9787, "id": 1111393}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305813198.831825, "message": "The father encoded it in the bible, which is his word... easy peasy defense", "group_id": 9787, "id": 1111319}, {"user_id": 32891, "stars": [], "topic_id": 35293, "date_created": 1305876670.9176099, "message": "@penkin @pevans_om The genius of the thing is that from a Christian perspective the Rapture-pet-care thing isn't a scam at all. There's a lot of interesting issues in the concept. In the faq they say that all employee's are athiests & have blasphemed against the Holy Spirit as per Mark. Can an atheist even do that? Should Christians be advocating that  people forego their salvation just to look after their pets?", "group_id": 9787, "id": 1121994}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305877544.5442851, "message": "@EdwinGarden I'd be surprised if there was a Christian paying for that. Also, as far as I understand the blasphemy against the Holy Spirit is saying that the work of the Holy Spirit is actually the work of the devil? Considering they don't believe in either I'm not sure how they could commit it?", "group_id": 9787, "id": 1122211}, {"user_id": 32891, "stars": [], "topic_id": 35293, "date_created": 1305877850.3635099, "message": "We were talking about it in the office here & another aspect of it's evil genius is that pets are a such soft target.. People make emotional decisions & that's always a sure-fire way of parting mug & cash.  Re the Holy Spirit, I remember a discussion at John Evans' Bible Study, but I can't remember details. I think it was similar to your point though..", "group_id": 9787, "id": 1122269}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305878278.2467899, "message": "Blaspheming the Holy Spirit.....yes....another one of Paul's ideas that have us all guessing......If there's one Biblical Author I'd like to punch it'd be Paul :)", "group_id": 9787, "id": 1122302}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305878790.9527969, "message": "@pevans_om Paul? Is it not what Jesus says in Mark? Or does Paul make it muddier?", "group_id": 9787, "id": 1122408}, {"user_id": 32891, "stars": [], "topic_id": 35293, "date_created": 1305879085.0170071, "message": "I think there might be a queue..", "group_id": 9787, "id": 1122461}, {"user_id": 32891, "stars": [], "topic_id": 35293, "date_created": 1305878405.1101999, "message": "You're right there! What do you think he'd be like to hang around with?", "group_id": 9787, "id": 1122318}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305879044.854203, "message": "@penkin haha, whoops...of course, you are correct, my bad :) Jesus said that one. It's in Luke. That should teach me not to check my sources! I'd still like to punch Paul tho!", "group_id": 9787, "id": 1122453}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305879307.521723, "message": "@EdwinGarden I think Paul was pretty obnoxious, especially in his younger days, but maybe that's just my impression :)", "group_id": 9787, "id": 1122516}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305897655.1224239, "message": "If scripture is only really opened up to us by the Holy Spirit, I recon it's there that you should direct your violent tendencies... although it's not recommended.", "group_id": 9787, "id": 1125419}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1305897799.9336021, "message": "Pre tribulation Rapture would cause one heck of a lot of dying for those not spirited away... I think a few of those pet minders might bight the big one, and going back to work at a pet minding place for people that caused all the death in the first place would likely be the last thing on the survivors minds. Besides, Dogs and Cats are meat, and possibly the only meat available while the world recovers from the disappearance of so many millions (billions?). unless Mr. Camping is right, then probably only his believers are going up, and that would result in like... what? a busload missing?", "group_id": 9787, "id": 1125442}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305898186.7475531, "message": "@LintonCaldecott Interesting point. When Jesus talks about the tares and the wheat He talks about the tares being gathered first and tossed into the fire and then the wheat. When the disciples ask what He means He says that the the reapers are angels, the furnace is the place where there will be weeping and gnashing of teeth. For me that seems to be against the Pre-Trib?", "group_id": 9787, "id": 1125496}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305898242.92205, "message": "@LintonCaldecott Matthew 13:24-30 for the parable and Matthew 13:36-43 for the explanation.", "group_id": 9787, "id": 1125504}, {"user_id": 13817, "stars": [], "topic_id": 35293, "date_created": 1305910777.139327, "message": "The one thing with all this Harold Camping stuff I've noticed is people seem to come out even more defiant? Like they can't wait to laugh in the face of any silly believers. Happy to be called damned? Like it's fun to see these silly magic people with their crazy beliefs. Maybe this is what Noah had to put up with? http://shirthack.com/products/rapture", "group_id": 9787, "id": 1127884}, {"user_id": 32891, "stars": [], "topic_id": 35293, "date_created": 1305965300.5654731, "message": "See you guys on the other side.. ;)", "group_id": 9787, "id": 1133253}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1305970451.821753, "message": "@penkin The problem is that it IS crazy and rather laughable and sadly it paints Christianity in a poor light because non-believers don't always separate the crazees from the truth. :(", "group_id": 9787, "id": 1133355}, {"user_id": 32888, "stars": [], "topic_id": 35293, "date_created": 1306869552.2475691, "message": "What about the more mainline guys, not crazy but with questionable understandings of doctrine, and what the Christian witness should be? I'll use Joel Osteen as an example. Best life now, his preaching to benefit even non christians because of its apparent inherently valuable content with regard to living life to the best that you can? Benny hinn also... The biggest churches in the world seem slightly... Off?", "group_id": 9787, "id": 1240402}, {"user_id": 32900, "stars": [], "topic_id": 35293, "date_created": 1306871285.7070179, "message": "@LintonCaldecott Many see the shift to the post-modern church as requiring a shift in our doctrinal values. These will be a huge challenge to us who are deeply seated in the modern church. I'm certain that some will be totally off the wall, but that doesn't mean all should be excluded. It becomes more and more important to understand what is the core of our faith so that the core is not compromised, but we are still left to explore alternate expressions of our faith. Make any sense?", "group_id": 9787, "id": 1240693}]