[{"user_id": 6439, "stars": [{"date_created": 1297610329.0489781, "user_id": 209}], "topic_id": 4379, "date_created": 1297455622.6115739, "message": "Having a ton of web experience already (mostly mod_perl), I got up to speed enough to build simple apps in about a week.  Probably took about 6 months before I felt I was building things at the same speed as before, i.e. not having to constantly reference the docs.", "group_id": 81, "id": 82940}, {"user_id": 1736, "stars": [], "topic_id": 4379, "date_created": 1297455855.773499, "message": "Python? Maybe a year or two coming from a background of C and Perl, before I felt comfortable with stuff like metaclass and how the object model works. Maybe another year after that before I felt comfortable with the internals of CPython, enough to go codediving for answers anyway. Django took me maybe a month to learn the external stuff, still wouldn't call myself proficient in the guts though (the ORM code still confuses me).", "group_id": 81, "id": 82965}, {"user_id": 1, "stars": [{"date_created": 1297456451.552283, "user_id": 6439}, {"date_created": 1297460092.0554941, "user_id": 521}, {"date_created": 1297460456.454423, "user_id": 177}], "topic_id": 4379, "date_created": 1297456182.943151, "message": "I learned Python by learning Django, and I'd say it took a few months before I felt comfortable, but I was still learning a lot for the next year and a half.  I still learn new things about Python/Django that I didn't know, and have more to learn still.", "group_id": 81, "id": 83027}, {"user_id": 4219, "stars": [], "topic_id": 4379, "date_created": 1297456716.452842, "message": "Yeah I know that, I meant proficient no need to be humble about it lol", "group_id": 81, "id": 83135}, {"user_id": 6439, "stars": [], "topic_id": 4379, "date_created": 1297456447.779067, "message": "@ericflo Absolutely, I learn something new every week or so about both.", "group_id": 81, "id": 83094}, {"user_id": 2588, "stars": [{"date_created": 1297459416.762862, "user_id": 6439}], "topic_id": 4379, "date_created": 1297459151.2143929, "message": "I think it depends on what your goals are as well. Most people can be productive within days or weeks depending on prior experience with web frameworks and OOP-like languages. Becoming proficient at developing low volume sites with a handful of features will take a few months. For larger, more complex sites I'd say being proficient demands a lot more expertise which is only going to come with putting in the time and learning from mistakes. I don't know if you'd call that \"expert\" but FWIW I know that if I tried to run with code I was writing back when I first would have considered myself proficient on the projects I work on now there would be disasters.", "group_id": 81, "id": 83557}, {"user_id": 4219, "stars": [], "topic_id": 4379, "date_created": 1297460236.8542891, "message": "ofcourse", "group_id": 81, "id": 83853}, {"user_id": 4219, "stars": [], "topic_id": 4379, "date_created": 1297459229.1643341, "message": "true, well said.", "group_id": 81, "id": 83574}, {"user_id": 1736, "stars": [{"date_created": 1297459417.8410349, "user_id": 1}], "topic_id": 4379, "date_created": 1297459359.1370699, "message": "We had a few devs here come up to speed on Django (all were experienced in C) in about 3 weeks to the point that they could write new apps from scratch and not make a total mess of it.", "group_id": 81, "id": 83601}, {"user_id": 4219, "stars": [], "topic_id": 4379, "date_created": 1297459988.8011069, "message": "@coderanger is a tight framework, and good ones prevent TOTAL messups hehe.", "group_id": 81, "id": 83774}, {"user_id": 1736, "stars": [], "topic_id": 4379, "date_created": 1297460140.455147, "message": "@convy Code is code, Python gives you plenty of space to write bad code. I've seen more than one C-style for loop in programmer tests submitted here. Writing good, idiomatic Python takes a little bit of time at least.", "group_id": 81, "id": 83827}]