[{"user_id": 31852, "stars": [], "topic_id": 37527, "date_created": 1306848488.257776, "message": "Edge has been available on Zinio since the beginning of the year, but as of the latest issue it's also available for iPhone. Zinio's design makes reading a magazine on your phone relatively painless (I subscribe to a couple of publications now) and I can only imagine how great it'd be on an iPad. Quite cheap, too: I paid R270 for a 13-issue subscription.\n\nHere's the link for anyone who's interested:\n\nhttp://za.zinio.com/browse/publications/index.jsp?prnt=cat1960026&productId=500608921&categoryId=cat1960060", "group_id": 9493, "id": 1237368}, {"user_id": 31852, "stars": [], "topic_id": 37527, "date_created": 1306848667.385339, "message": "More importantly, you can get Huisgenoot on it as well. But, alas, there's no iPhone version for that :(", "group_id": 9493, "id": 1237389}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1306850822.8650501, "message": "I just gave up my deadtree Edge subscription at the start of this year…\n\nStupid question (since I've never used Zinio and I'm too lazy to read a FAQ):  Once you've downloaded a particular edition of a magazine, do you get to keep it, or is it time-limited in some way?", "group_id": 9493, "id": 1237636}, {"user_id": 31852, "stars": [], "topic_id": 37527, "date_created": 1306857961.1700621, "message": "As far as I can tell, you get to keep it -- you can definitely download it again after having deleted it.", "group_id": 9493, "id": 1238481}, {"user_id": 31753, "stars": [], "topic_id": 37527, "date_created": 1306866294.1685469, "message": "Excellent, I think I've found my next bit of distraction for my train commute!", "group_id": 9493, "id": 1239814}, {"user_id": 31753, "stars": [], "topic_id": 37527, "date_created": 1306939534.3387401, "message": "I bought the Edge subscription, and got the iPad app. I must say, it's pretty slick. You have the scanned pages, but each article also has a text option, which allows you to read just the text of the article.", "group_id": 9493, "id": 1253810}, {"user_id": 33191, "stars": [], "topic_id": 37527, "date_created": 1306949869.1769509, "message": "More importantly. Subcribe to Wired and New Scientist Magazine. ;-)", "group_id": 9493, "id": 1255802}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1307000860.5105979, "message": "If I had an iPad, Zinio might make more sense…", "group_id": 9493, "id": 1264184}, {"user_id": 31852, "stars": [], "topic_id": 37527, "date_created": 1307020907.2904999, "message": "Yup, I've been playing with Comixology for a while now, and it works really well.", "group_id": 9493, "id": 1266550}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1307018011.469353, "message": "Oh, and I don't know if any of you are comic book fans , but the comiXology reader on the iPhone is an *excellent* interface for reading comics.  It's so much fun to use, that I actually read a few comics on it despite not really being into them.\n\nThey also make standalone apps for individual comic publishers (Marvel, DC, …) but you can also access all of those comics from within their main app:\n\nhttp://itunes.apple.com/app/comics/id303491945?mt=8", "group_id": 9493, "id": 1265891}, {"user_id": 31753, "stars": [], "topic_id": 37527, "date_created": 1307035018.9353991, "message": "I was a bit miffed that there was no Dark Horse comics on Comixology, but at least DH now released their own app, although it's not quite as slick as Comixology.", "group_id": 9493, "id": 1268822}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1307437304.538022, "message": "I can see Dark Horse comics in my comiXology.  And I thought the standalone Dark Horse app was just a reskinned comiXology, like the DC and Marvel (etc.) apps?", "group_id": 9493, "id": 1318462}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1307437530.3933761, "message": "Anyway, back to Zinio:  Two reasons I'm not buying a year's subscription just yet:\n\nFirstly, we're just weeks away from Apple actually enforcing their new rules on subscriptions.  We'll have to wait and see how content providers like Zinio handle this.  Some may just pack their bags and leave the App Store (as the Financial Times just did).\n\nSecondly, with Newsstand there'll now be a competitor for Zinio available from the platform vendor.  Again, we'll have to wait and see how that pans out in the long run…", "group_id": 9493, "id": 1318493}, {"user_id": 31753, "stars": [], "topic_id": 37527, "date_created": 1307440438.7931111, "message": "On the Zinio topic though, they might pull the app, but I can't see them stop providing the content for the users that already have the app installed. And unless they radically change the way the application parses the pages, it should still work with new magazine releases.", "group_id": 9493, "id": 1318926}, {"user_id": 31753, "stars": [], "topic_id": 37527, "date_created": 1307440346.8815041, "message": "@Mr_V The Dark Horse comics on Comixology were extremely limited, I think there was only two comics. And the Dark Horse app seems to be completely different from the Comixology app actually, I suspect they built their own.", "group_id": 9493, "id": 1318912}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1307628910.7204981, "message": "Huh.  Well THERE's a thing you don't see every day:  Apple changing course…\n\nhttp://www.macrumors.com/2011/06/09/apple-reverses-course-on-in-app-subscriptions/", "group_id": 9493, "id": 1350398}, {"user_id": 32282, "stars": [], "topic_id": 37527, "date_created": 1307687817.6852779, "message": "Their review of Infamous 2 is a travesty! They refer to the 'vastly superior Prototype';. Are they smoking crack?", "group_id": 9493, "id": 1357773}, {"user_id": 31852, "stars": [], "topic_id": 37527, "date_created": 1308037175.0422399, "message": "It doesn't seem like it -- on my emailed invoice, the \"Total charged\" amount is the same as the list price. But I see in the same email it lists an EU VAT registration number for international customers, so I'd guess they're adding VAT to EU shoppers' orders.", "group_id": 9493, "id": 1388639}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1308036273.4376299, "message": "Hey, Mark, did Zinio slap on any VAT for you?\n\nThey sent me a $8 loyalty voucher (LOYALTY?  I only just signed up!), so I decided to make use of the 27€ offer on Edge… only by the time they'd added EU VAT, it more than negated my voucher.", "group_id": 9493, "id": 1388572}, {"user_id": 31927, "stars": [], "topic_id": 37527, "date_created": 1309680922.9857471, "message": "I'll say this:  Rarely has a legitimate company spammed me as much as Zinio has.  I registered on their site, and then DIDN'T sign up for any magazines.  And since, they've been sending me multiple emails DAILY trying to to tempt me into subscribing to any number of things I have zero interest in.", "group_id": 9493, "id": 1551252}]