[{"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303655055.1127579, "message": "So anyone here got some hands on clutch on the cloud server services, or work on company this before?", "group_id": 286, "id": 794964}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303655112.6693871, "message": "We (as a startup groups) have those why it's so called magic 'skill', to got our hands dirty on building an cloud server host service provider", "group_id": 286, "id": 794969}, {"user_id": 16403, "stars": [], "topic_id": 21095, "date_created": 1303661053.520592, "message": "Yes, I've had the pleasure of doing this twice from the ground up.", "group_id": 286, "id": 795513}, {"user_id": 2382, "stars": [], "topic_id": 21095, "date_created": 1303666949.884315, "message": "Likewise, and currently starting it for the 3rd time at the current $employers", "group_id": 286, "id": 795750}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303710301.1353769, "message": "Nice, @check and @ben_h, would like your advice, i'm at the very beginning to build this infrastructure, and currently we have some thought that \"yes we can do this with lean and smalles budgest we had\", are you guyz agreed with that?", "group_id": 286, "id": 800025}, {"user_id": 1993, "stars": [], "topic_id": 21095, "date_created": 1303714497.2230501, "message": "hi guys, i'm interested on this topic too, would appreciate if anyone can share of initial step to build cloud computing infrastructure and sofware. Thank you in advance.", "group_id": 286, "id": 800597}, {"user_id": 2382, "stars": [], "topic_id": 21095, "date_created": 1303725755.4152949, "message": "You can easily build a cheap infrastructure, but you need to ask yourself what is it going to be used for and how long will it need to last. Security people usually end up having kittens about multiple hardware platforms and unknown components. It can also make vendor hardware support a royal pain", "group_id": 286, "id": 802154}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303741888.307869, "message": "We feel confidence with what we're working at, as not just as an cloud host server, but more to be like 'provider and ecosystem of startups' in our country, this is gonna be great story and major useful tools for us (at least in our state right now, asia pacific) for the stake of our country startup ecosystems, More-over we're not exactly aftering for the monetizing, but more to be useful tools", "group_id": 286, "id": 803773}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303753733.4965949, "message": "We've begun our startup are right now... need support from the master, so any kind of advice or question would be much appreaciated...", "group_id": 286, "id": 805461}, {"user_id": 2382, "stars": [], "topic_id": 21095, "date_created": 1303765804.4744971, "message": "I'm sure there's bound to be a dedicated group for startups that would provide more meaningful discussion, but when I worked and ran startups the most critical thing was cashflow", "group_id": 286, "id": 807368}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303828996.4401391, "message": "@ben__h  I'm hardly noted your point, thank you. Could you point us of this 'cheap infrastructure' for let's say 20 client with normal utilisation and requirement, what would or how much would it take the most lower cost for it could be? just for us to get the picture and confidence for us of it, thankyou", "group_id": 286, "id": 815137}, {"user_id": 2382, "stars": [], "topic_id": 21095, "date_created": 1303887376.511081, "message": "Welcome to the wonderful world of being an architect", "group_id": 286, "id": 822717}, {"user_id": 2382, "stars": [], "topic_id": 21095, "date_created": 1303887358.714205, "message": "Well define normal utilisation, whats going to be your service offering - standard LAMP or Java app servers? What cloud infrastructure are you going to use, Eucalyptus, OpenStack, VSphere? Are you going to need separate storage? Separate Database servers? Why do you want to use a cloud infrastructure and why will people buy from you and not Amazon or Rackspace?", "group_id": 286, "id": 822714}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303897990.674701, "message": "Yupz, i'm planning on using OpenStack. So the different compared with amazon is more like, we're a group of an startup communities, and we're planning (at the first stage) to made the service availability, open, and even free for the startups, despite of the services, we're focusing on building the right composition of ecosystem behind it. as i mentioned it before, money isn't everything for us. the power and the ecosystem are", "group_id": 286, "id": 823972}, {"user_id": 29253, "stars": [], "topic_id": 21095, "date_created": 1303898210.0821919, "message": "So at this stage, i need to accomodate seriously well on this services (even with as lowest budget as possible). I'm imagined the users will using the lamp with average utilization lower than averagely 10%, think we haven't need the separate storage/database. By today we've completing the openstack installation, time's for configuration and optimization, paralelly we're building the strategic plan and probably the long term business model.", "group_id": 286, "id": 823980}]