[{"user_id": 2937, "stars": [], "topic_id": 12245, "date_created": 1299816711.6510839, "message": "I wrote this analysis of Pascal's Wager. It's definitely not perfect, and I was quite willing to just accept Pascal's assumptions when it was convenient for proving my point when I probably should have questioned them. Anyway, thoughts? [PDF] http://dl.dropbox.com/u/963230/pascals-wager.pdf", "group_id": 175, "id": 319251}, {"user_id": 1661, "stars": [], "topic_id": 12245, "date_created": 1299832934.2230539, "message": "4b with the example of the wager with the trillionaire was interesting.", "group_id": 175, "id": 320603}, {"user_id": 545, "stars": [], "topic_id": 12245, "date_created": 1300381999.4254889, "message": "That's a pretty good analysis of Pascal's Wager. I wrote a similar analysis back in one of my Religious Studies classes in college, but your trillionaire example trumps the example I used (I compared it to Russian Roulette). Now, I want to go back and find that essay.\n\nMy only note of difference was that I would assert that the choice comes down to \"Belief in a deity or deities\" (Theism) and \"Disbelief in a deity\" (Atheism), where it is mostly reasonable to assume that if an individual has \"Belief in a deity or deities\" then whatever actual religion results in the payoff will likely be amenable to the idea of an indeterminate belief structure (a.k.a. \"hedging your bets\").\n\nOtherwise, as Shepherd Book once said, \"I don't care what you believe. Just believe.\"", "group_id": 175, "id": 375574}, {"user_id": 10087, "stars": [], "topic_id": 12245, "date_created": 1300393831.379138, "message": "Regarding 2b:\n\nThe probability function P is defined mathematically as measure, http://en.wikipedia.org/wiki/Probability_measure. Now, I would actually say that the event \"Christian doctrine is true\" might be zero-measurable, that is, just a point in the probability space, since there is an infinite number of slightly different belief systems, isn't there? With Pascal's Wager, we aren't talking just about the probability of God existing, we are talking about the probability of The Bible being essentially true. Every strictly defined belief system could be assigned a single real value from 0 to infinity. Now the question comes down to whether Christianity is a range or a single point. I would say a point, because if we first assume it's some range, we can come up with any number of arbitrary systems that we can assume to take at least a range as big as christianity, and thus reducing the range to a point.\n\nAnother thing concerning probabilities and belief: It is possible to believe in a range of different systems with given certainties. Many people don't actively believe in God, but still will pray when in panic. It's possible to believe that some kind of God, like in christianity, might exist and at the same time that e.g. buddhist teachings might be true. I'm just wondering, what is adequetely strong, accurate and well-defined belief for christianity? Even priests say it's ok to have doubt and they even have doubt themselves, sometimes more and sometimes less. My conclusion is that agnosticism is the best bet.", "group_id": 175, "id": 377396}, {"user_id": 10087, "stars": [], "topic_id": 12245, "date_created": 1300394994.7962141, "message": "Remember that it isn't just about believing in God, it's believing in God and that Jesus is his son and died to free people of their sins, and then was resurrected and so on. Or that's what I've heard. Now, in an infinite universe, there are arguably an infinite number of possible candidates for a God's son, not to even mention other kinds of possible mechanics than the god's son -thing. That would arguably make christianity just a point in probability space, meaning that its measure, that is probability, is equal to zero.", "group_id": 175, "id": 377550}, {"user_id": 10087, "stars": [], "topic_id": 12245, "date_created": 1300403225.1749871, "message": "Sorry, When I said from 0 to infinity, I meant something like from 0 to 1. (But it doesn't matter what the values are, as long as the interval is of finite length, and closed.)\n\nAnyway, my points were that 1) there is absolutely no reason to assume that the probability is higher than zero and 2) the probability space is not well defined, so the probability P is just undefined, and the most logical way of trying to construct the space will just lead to the probability being 0, like above.", "group_id": 175, "id": 378462}]