[{"user_id": 11626, "stars": [], "topic_id": 7725, "date_created": 1298247031.5186081, "message": "A group of about 150 decidedly angry demonstrators roved downtown Seattle Friday night in protest of King County Prosecutor Dan Satterberg's decision that there will be no criminal charges filed against Seattle police Officer Ian Birk in the fatal shooting of First Nations woodcarver John T. Williams last August.\r\n\r\nProtesters speak out over the shooting death of woodcarver John T. Williams and Prosecutor Dan Satterberg's decision not to charge Officer Ian Birk.\r\n\r\nProtesters speak out over the shooting death of woodcarver John T. Williams and Prosecutor Dan Satterberg's decision not to charge Officer Ian Birk.\r\n\r\nA flag with an anarchist symbol waves at Westlake Park Friday night as demonstrators sit in the intersection of Fourth Avenue and Pine Street. Anti-police protesters were on Seattle streets for a second night.\r\n\r\nA flag with an anarchist symbol waves at Westlake Park Friday night as demonstrators sit in the intersection of Fourth Avenue and Pine Street. Anti-police protesters were on Seattle streets for a second night.\r\n\r\nA group of about 150 decidedly angry demonstrators roved downtown Seattle Friday night in protest of King County Prosecutor Dan Satterberg's decision that there will be no criminal charges filed against Seattle police Officer Ian Birk in the fatal shooting of First Nations woodcarver John T. Williams.\r\n\r\nAt one point, the back window of a police cruiser was broken out, and some in the crowd threw rocks and bottles. There was some shoving back and forth, and police used pepper spray on a group of about 15 people attempting to skirt a line set up to prevent protesters from going north from Cherry Street on First Avenue.\r\n\r\nThe demonstrators, most of whom appeared to be in their teens or early 20s, were chanting anti-police slogans: \"No justice, no peace! No racist police!\" and \"Cops are flammable\" were two.\r\n\r\nSeveral protesters carried anti-police placards, and many wore black bandannas over their noses and mouths, purportedly a defense against pepper spray or other chemical agents.\r\n\r\nShortly after 9 p.m., the crowd left downtown Seattle and headed up Pine Street to Capitol Hill, encouraging bar patrons to join them in the street as them moved along. Police on bicycles and horseback stayed with the crowd.\r\n\r\nThe protest moved toward the Police Department's East Precinct on 12th Avenue, but police kept people from getting close to the building. The crowd retreated and spent some time moving up Broadway before returning to the police precinct, where police, again, kept the crowd away from the building.\r\n\r\nBy about 10:30 p.m., the protest appeared to be petering out.\r\n\r\nAs the demonstration was breaking up, leaders with megaphones promised they would organize another protest in the near future.\r\n\r\nSatterberg announced on Wednesday that he would not charge Birk in the Aug. 30 slaying of Williams on a street corner in downtown Seattle. He called the shooting a \"good-faith mistake, however tragic,\" and said he believed Birk acted without malice. Under state law, he said, Birk could not be successfully prosecuted.\r\n\r\nHowever, Birk's actions were roundly criticized by Police Chief John Diaz and by Seattle Mayor Mike McGinn. Later that day, Birk announced his resignation from the force.\r\n\r\nThere were protests both at Seattle City Hall and in the streets after Satterberg's announcement, but Friday night's protest seemed angrier.\r\n\r\nhttp://seattletimes.nwsource.com/html/localnews/2014271817_protests19m.html", "group_id": 3920, "id": 155190}]