[{"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305556439.6464169, "message": "@LintonCaldecott scrubs isnt even on anymore...pfff", "group_id": 9787, "id": 1071421}, {"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305555931.6782811, "message": "@LintonCaldecott start your own non-secular entertainment industry...or are christians, not to be entertained?", "group_id": 9787, "id": 1071326}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305555258.5744121, "message": "Philippians 4:8 Finally, brothers, whatever is true, whatever is honorable, whatever is just, whatever is pure, whatever is lovely, whatever is commendable, if there is any excellence, if there is anything worthy of praise, think about these things.", "group_id": 9787, "id": 1071159}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305556250.8637359, "message": "The other ridiculous thing is, it makes me super lazy. \"Maybe I should read some more Bible. See if I can...\" \"What, you read like 3 chapters already.\"", "group_id": 9787, "id": 1071386}, {"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305556392.5125749, "message": "@pevans_om Book of Eli", "group_id": 9787, "id": 1071406}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305555515.8395979, "message": "We are all totally products of our culture.", "group_id": 9787, "id": 1071211}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305555825.8945489, "message": "@LintonCaldecott It is so super hard to give those things up. Movies and what not. When I consider even just cutting down my mind starts to question it's own sanity. \"What are you thinking?\" \"What will you do?\" \"You know the couch is relax time right?\"", "group_id": 9787, "id": 1071301}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305556022.2109489, "message": "@jonobarton lol, they have one. I have a few movies but I hate to say that FireFly for the 6th time seems like more fun than a Christian movie. The money wins with it's editing, music score and caliber of actors :)", "group_id": 9787, "id": 1071340}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305556022.885674, "message": "I am totally in that trap", "group_id": 9787, "id": 1071341}, {"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305555479.6330199, "message": "depends on the individual i guess", "group_id": 9787, "id": 1071203}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305556627.883924, "message": "@penkin in 3D! :D", "group_id": 9787, "id": 1071468}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305555416.2722981, "message": "How does secular entertainment help us to do this? I think if anything, it makes it ridiculously hard to do it... Hollywood and Bollywood and Disney are like the Goebbels of propaganda driving our understanding of what love and romance are (for example)", "group_id": 9787, "id": 1071185}, {"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305555982.8400421, "message": "baywatch...in habits.", "group_id": 9787, "id": 1071337}, {"user_id": 33006, "stars": [], "topic_id": 35497, "date_created": 1305556398.6948791, "message": "for example", "group_id": 9787, "id": 1071411}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305556832.421159, "message": "Example: This passed week I watched 'Water for Elephants' with some friends. Missionary friends - so there was a huge debate about whether we should watch a movie about adultery....Hello? Do you READ the story of David and Bath....sheba? Just cause the story contains something morally questionable doesn't mean it doesn't have value. As it is we watched the movie and it was pretty good. There is a lot you could discuss from it. The state of abusive marriages and how we should handle it for one thing. There is value there, but it depends on our attitude. If you're just going to be entertained......I don't know...what's the point then?", "group_id": 9787, "id": 1071513}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305555949.0878699, "message": "sure, I'm not going to go so far as to say secular entertainment is sin. That would be a stretch I think (even in the definition) but I can gaurantee that if you listen to more depressed or angry music even if you don't seem angry or down... those lyrics just cycle constantly in your head... But if replaced by worship music... wouldnt that be better?", "group_id": 9787, "id": 1071330}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305556356.149816, "message": "What Nicole and I have started doing is having supper at the table. No more in front of the TV. We eat, chat and then when we're done we have \"Bible Time\" now. We're going through material and reading together. That has cut our TV time a lot and it's been awesome I must admit.", "group_id": 9787, "id": 1071401}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305556004.282548, "message": "@jonobarton when \"to be entertained\" is the driving force in 95% of people's lives, then i would say that's a pretty poor show.", "group_id": 9787, "id": 1071339}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305556353.4487901, "message": "Consider the OT stories. Many of them rival modern entertainment when it comes to violence, deception and sex amongst other things. Yet they hold value in what we can learn from them. About God, about ourselves and about the world. I think we should approach so called 'secular' entertainment in a similar fashion. That's not to say there shouldn't be a moral line (I'm not advocating watching porn here guys, sorry!) - We are what we think - and those thoughts can and do get molded by what we see and hear.", "group_id": 9787, "id": 1071399}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305555954.8599999, "message": "There is no such thing really as secular entertainment. That's a flaw in recent church thing, separating spiritual and secular. All things relate in some way to our whole being, mind, body and soul.", "group_id": 9787, "id": 1071334}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305556398.3203599, "message": "the extension is that as christians we demand feeding... if we don't get it on sunday, we leave the church cause we need to be fed. it's almost militant! we HAVE to be fed! it's SO IMPORTANT, AND THIS CHURCH DOESNT FULFIL THAT ESSENTIAL NEED... but during the week it's all scrubs and whatever else is on.", "group_id": 9787, "id": 1071410}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305556848.6842501, "message": "@pevans_om o yes. 3D as well, so you can feel like you're in it. It's gonna have to be better than the 3D we have now. I think it sucks!", "group_id": 9787, "id": 1071520}, {"user_id": 13817, "stars": [], "topic_id": 35497, "date_created": 1305556433.8415551, "message": "@pevans_om I remember Andrea had a dream to enter into directing. She still does but not sure how that's gone. Her idea was also to create epic Biblical movies.", "group_id": 9787, "id": 1071418}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305556435.4616821, "message": "if it's such a desperate thing that you are willing to community hop, why not fulfil that with even half of the entertainment time alotment", "group_id": 9787, "id": 1071419}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305567301.974962, "message": "you 3d haters are wierd. it rocks! \n\n@pevans_om you are saying that a movie has value because some biblical story has value... that's shakey ground I think...", "group_id": 9787, "id": 1072919}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305573964.8675301, "message": "@LintonCaldecott No. I'm saying that stories have value if viewed with the right attitude.", "group_id": 9787, "id": 1073808}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305574953.9170201, "message": "there is an argument for being aware of the current popular worldview expressed through entertainment, and being able to speak about it from a biblical perspective, or rather, challenge it...", "group_id": 9787, "id": 1073992}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305574966.6590669, "message": "but mostly we just watch it to be entertained.", "group_id": 9787, "id": 1073993}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305575131.5729771, "message": "if we watched a channel that just broadcast starving people in africa, and they sold advertising on that, and starving kids paraphernalia, like they do for so many other sports we could shift the billions that go into sport every year and pour it into something that makes a difference directly :)", "group_id": 9787, "id": 1074013}, {"user_id": 32891, "stars": [], "topic_id": 35497, "date_created": 1305615942.7619841, "message": "3D is from the same place as avocado..", "group_id": 9787, "id": 1079585}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305616274.538795, "message": "you people are all freaking insane. 3D is great! i think the ones that don't appreciate it must have something wrong with their eyes, i mean medically. Because it looks fantastic to me, all 3d and monsters in your face. It's wonderful! WONDERFUL!", "group_id": 9787, "id": 1079651}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305616708.5361331, "message": "What would you propose? Amish lifestyle? Is that better?", "group_id": 9787, "id": 1079768}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305616301.5641091, "message": "plus, it's lightyears ahead of that red green eyestrain-o-vision that it used to be!", "group_id": 9787, "id": 1079657}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305616681.1510069, "message": "I read an interesting article from one of the to film visual effects and camera people talking about how bad 3D movies are because they're having to trick your brain. Seems some people can't handle it. #offtopic", "group_id": 9787, "id": 1079760}, {"user_id": 32891, "stars": [], "topic_id": 35497, "date_created": 1305616741.670799, "message": "Nope.. Evil. For one thing it's the glasses on glasses thing. Also it makes the movie so dark. Lastly, I think it makes directors lazy.. er.. all #offtopic sorry..", "group_id": 9787, "id": 1079776}, {"user_id": 32891, "stars": [], "topic_id": 35497, "date_created": 1305616951.4059491, "message": "Amish lifestyle is actually quite appealing to me, but I think 2 or 3 weeks without access to pc games will cure that.", "group_id": 9787, "id": 1079830}, {"user_id": 32888, "stars": [], "topic_id": 35497, "date_created": 1305621791.440695, "message": "Maybe. But when most christians can repeat the intricacies of 2 or 3 sports rules or know every relational quirk of their favourite television series, yet remain largely ignorant to the contents of the bible... isn't that a problem? That isn't even the worst part of it all really. The profession is that we Love God most of all, but relational time (however you define that, bible reading, prayer, meditation... ) with God is a tiny TINY fraction of the time we give to be entertained that's got to affect our lives negatively, surely! If you want to link destructive things to actions in our lives, perhaps there would be less angst and depression if the main thrust of our time wasn't spent drinking in the secular... drowning in the secular.\n\nEveryone jokes about the model of the world, the model that hollywood has set up for romance etc, and it seems like bees against the glass \"maybe this time, this time, this time, THIS time ... it will be different\"", "group_id": 9787, "id": 1080277}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305645784.2051611, "message": "@LintonCaldecott We certainly have a culture of personal entertainment that's not healthy. I don't own a tv for this very reason, although I make up for it in pc games :)\nWe could definitely use more interpersonal connections. I don't think everyone needs to know the bible backwards, but for me it's the lack of community that is the worst effect.", "group_id": 9787, "id": 1084244}, {"user_id": 32900, "stars": [], "topic_id": 35497, "date_created": 1305645883.800143, "message": "What are the direct results of personal entertainment in your life?", "group_id": 9787, "id": 1084264}]