[{"user_id": 11626, "stars": [], "topic_id": 7365, "date_created": 1298072263.350347, "message": "http://www.mwcradio.com/site_media/photologue/photos/cache/Education%202_article_detail_lead.jpg\r\n\r\nMADISON, Wis. (WTAQ) - Schools in Madison are closed for a second straight day, as teachers continue to protest the Republican effort to end most of their collective bargaining rights.\r\n\r\nAnd at least a dozen other school districts around Wisconsin’s capital decide to close, after the head of the state’s largest teachers’ union called on all 98,000 members to drive to Madison Thursday for protest rallies.\r\n\r\nAt a news conference Wednesday night, Mary Bell said, “This is not about protecting our pay and our benefits – It is about protecting our right to collectively bargain.” But later, Bell stopped short of endorsing a coordinated teacher walkout. She asked teachers who could be at rally to do so.\r\n\r\nIn Milwaukee, Superintendent Greg Thornton said teachers are expected to be at work Thursday and Friday. And they’ll be disciplined if they don’t have valid excuses.\r\n\r\nGovernor Scott Walker said he was “disappointed” with the Madison teachers for being out Wednesday. He said he respects the workers’ right to demonstrate but he’s, “not intimidated into think that they’re the only voices out there.”\r\n\r\nThe Education Action Group condemned the Madison walkout, saying the teachers’ union cares more about politics than students. State officials said 10,000 people attended Wednesday’s protest rally, which also called on Walker to resign.\r\n\r\nMadison Police gave a crowd estimate of 20,000. Students in parts of the state also continued their own walkouts. About 600 students at Madison West High School marched from a west side shopping center to the Capitol.\r\n\r\nhttp://whbl.com/news/articles/2011/feb/17/madison-schools-closed-2nd-straight-day-protest", "group_id": 3920, "id": 147521}]