[{"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301531713.648807, "message": "So we’re more of a wiki-style attempt at the convore/campfire arena and was written in about 5 days initially and we’re 2 weeks old now.", "group_id": 95, "id": 486135}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301531764.813735, "message": "The focus is on ultra-lightweight disposable conversations, that are created by their very mention.", "group_id": 95, "id": 486142}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301531766.891624, "message": "Again 2 weeks work so no miracles :-) http://hashbo.com", "group_id": 95, "id": 486143}, {"user_id": 831, "stars": [], "topic_id": 16372, "date_created": 1301532193.8121259, "message": "So I love the concept of  a micro-forum, but intensely dislike the 140 char limit.  That's enough to put me off even trying, sorry.", "group_id": 95, "id": 486177}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301532413.2485421, "message": "@uche - all feedback is valuable - especially the reasons why you wouldn’t use something!", "group_id": 95, "id": 486199}, {"user_id": 17546, "stars": [], "topic_id": 16372, "date_created": 1301549108.262958, "message": "Interesting concept, any plans to pull content/topics from twitter?", "group_id": 95, "id": 488563}, {"user_id": 15929, "stars": [], "topic_id": 16372, "date_created": 1301549231.165426, "message": "not lurker friendly... i lurk before i join...", "group_id": 95, "id": 488589}, {"user_id": 17546, "stars": [], "topic_id": 16372, "date_created": 1301549950.4660561, "message": "@unwrangle this was my first thought as well. If you click the \"Log in with Twitter\" button without having a twitter account it still takes you to the content. Not sure if this is a bug? But it let me see the site.", "group_id": 95, "id": 488753}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301572140.668983, "message": "@unwrangle That’s a good point, and there is no need for you to actually log in to read public boards, so I will make it ‘lurker-friendly’ now :-)", "group_id": 95, "id": 490830}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301572074.90361, "message": "@matwill so we display the top trending Twitter topics to encourage board creation arround them. But not quite sure what the best way to pull from Twitter is, maybe we can look for #tags in subscribers tweets and post them back to HashBo ... WDYT?", "group_id": 95, "id": 490829}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301588711.302788, "message": "@matwill thanks again for the ideas, I’ll take a look at implementing the board creation on hashtag usage ... see how it works, it’s certainly a quick way to load HashBo up with initial content :-)", "group_id": 95, "id": 493323}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301572205.5406201, "message": "@matwill Not a bug, Twitter a/c not actually needed to read comments - I will change from sign in on Twitter to actually linking to one of our boards. Thanks @unwrangle and @matwill for feedback - v.helpful.", "group_id": 95, "id": 490831}, {"user_id": 17546, "stars": [], "topic_id": 16372, "date_created": 1301577721.4485569, "message": "Also I noticed you changed the main page. The \"Give it a try!\" is a lot more click friendly. ; D", "group_id": 95, "id": 491581}, {"user_id": 17546, "stars": [], "topic_id": 16372, "date_created": 1301630116.9777009, "message": "@hashbo np, and good luck, it'd be great if you post back here with your progress.", "group_id": 95, "id": 499196}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301675673.764879, "message": "@matwill - first attempt added today, needs some code to deal with newly added users, but the idea is in there.", "group_id": 95, "id": 503223}, {"user_id": 5145, "stars": [], "topic_id": 16372, "date_created": 1301729475.650764, "message": "@hashbo - I don't like how you need twitter to post - what was your reasoning behind this, seeing that the concept doesn't require twitter? Thanks!", "group_id": 95, "id": 507754}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1301761097.7866499, "message": "Hi suraj it was because it was written and live in 5 days :-) it was convenient to use Twitter for log in and it guarantees me that you have a Twitter account so I can do some other TwitterFu later. However point taken, I’ll see if I can remove that restriction sooner rather than later. Thanks a huge amount for telling me - as I’m sure you know feedback is the most valuable thing a startup can receive (even more than funding!).", "group_id": 95, "id": 509206}, {"user_id": 26244, "stars": [], "topic_id": 16372, "date_created": 1302446183.6501479, "message": "We now support personal and private boards, so you can have mini-blogs or one to one and group chat full details in our blog entry http://hashbo.posterous.com/great-new-features or just try it out at http://hashbo.com", "group_id": 95, "id": 609776}, {"user_id": 17546, "stars": [], "topic_id": 16372, "date_created": 1301577304.6820569, "message": "@hashbo Your suggested way pretty much echos how I'd do it. Maybe an option on user profiles to automatically pull their tweets if they meet certain criteria, ie: If a hashbo user tweets with a #tag that's already a board on hashbo, then grab it. Plus maybe several hashbo users tweet with the same #tag in the same time-frame (Like a mini trend among people signed up) , automatically add a board for it and start grabbing the tweets.", "group_id": 95, "id": 491523}]