[{"user_id": 11626, "stars": [], "topic_id": 6774, "date_created": 1297923487.8512199, "message": "Below the radar of public opinion, Mexico has started to assemble the type of biometric national identity database that could be used to document names for a North American Trusted Traveler border pass card, a plan already being developed by the U.S. Department of Homeland Security for Mexican citizens.\r\n\r\nIt apparently would be similar to the program that has become commonplace in the European Union to allow free transit for EU citizens to move, live and work wherever they choose within the EU, disregarding nation-of-origin and national border restrictions.\r\n\r\nOn Jan. 19, 2011, Mexico's President Felipe Calderon signed an executive order requiring within the next five years all Mexicans 17 years old and younger have a biometric national identity card that would include a facial photograph, all 10 fingerprints, and an iris scan.\r\n\r\nDiscover the shocking truth about why the U.S. government doesn't really want to protect our Mexican and Canadian borders, in Jerome Corsi's \"The Late Great USA.\"\r\n\r\nTo carry out the presidential executive order, the Mexican Directorate General of the National Population Register plans to go to all elementary schools in Mexico schools in Mexico to record the required biometric information and issue individual identity cards.\r\n\r\nThe Mexican National Institute of Geography and Statistics estimates that in 2005, there were 10.5 million Mexicans between 5 and 9 years old, 11 million between 10 and 14 years old, and 10 million between 15 and 19 years old.\r\n\r\nReasonable estimates are that by the end of 2012, Mexico plans to issue more than 25.7 million biometric identity cards to the nation's children 18 years old and younger.\r\n\r\nWhile promoted as a way to prevent crimes such as identity theft, Mexico has decided to begin with the nation's school children to create the type of biometric national identity database that will allow Mexican children as they grow up to already possess the biometric information they will need to obtain North American Trusted Traveler border pass cards the U.S. Department of Homeland Security is preparing to issue to Mexican citizens.\r\n\r\nOnce the nation's children are recorded in this biometric national identity database, the plan is to add a second phase that will extend the biometric identification cards to Mexican adults, with a third phase designed to establish a national registry for all foreigners residing in Mexico.\r\n\r\nThe website of the Mexican Directorate General of the National Population Register, or RENAPO, Registro Nacional de Población e Identificatión Personal, displays a photo of a family holding an enlarged version of the new Personal Identity Card issued to the daughter:\r\n\r\nAlso available on the website of the Mexican Directorate General of the National Population Register is a second photo that shows two smiling children holding an enlarged version of the Personal Identity Card created for the girl in the photo:\r\n\r\nThe new Mexican Personal Identity Card includes a security hologram to prevent duplication or the creation of fraudulent cards; iris scan information embedded in a bar code on the reverse of the card; various biometric information included invisibly in the card, including all 10 digits in fingerprints.\r\n\r\nEach card bears a unique personal ID number and a face photo designed to make sure that only the person to whom the card was issued can use the card.\r\n\r\nNext to the eagle symbol of Mexico at the top of the card, the card reads \"United States of Mexico.\"\r\n\r\nCritics in Mexico have charged that the Mexican effort to enroll school children in a national biometric personal identity database involves the early implementation of an incremental \"new world order\" plan designed to fit into initiatives designed under the Security and Prosperity Partnership to evolve the North American Free Trade Agreement into a continental or regional North American Union governmental structure.\r\n\r\nTrusted Travelers of North America\r\n\r\nWND previously reported that on Nov. 30, 2010, DHS Secretary Napolitano and Mexican Ministry of the Interior Secretary José Francisco Blake Mora signed an agreement expressing their intent to develop a Global Entry international trusted traveler pilot program between the United States and Mexico that Mexico estimated would allow 84 million Mexicans to apply for Trusted Traveler of North America biometric border pass cards for rapid entry into the United States.\r\n\r\nFour years ago, on Sept. 27, 2006, WND reported that the Department of Transportation acting through a Security and Prosperity Partnership \"working group\" was preparing to issue North American biometric border passes to Mexican, Canadian and U.S. \"trusted travelers,\" according to documents released to WND under a Freedom of Information Act request.\r\n\r\nThe agreement Napolitano signed with Mexico on Nov. 30 appears to bring the SPP working group \"trusted traveler\" commitment closer to fruition.\r\n\r\nAs described on the U.S. Customs and Border Protection website, the Trusted Traveler Program allows applicants to receive a biometric border pass to facilitate cross-border travel, after undergoing a thorough background check against criminal, law enforcement, customs, immigration and terrorist files, including biometric fingerprint checks and a personal interview with a CBP officer.\r\n\r\nThe \"Trusted Traveler Network\" is more completely described on the \"Global Entry website maintained by U.S. Customs and Border Patrol.\r\n\r\n\"Global Entry is a U.S. Customs and Border Protection (CBP) program that allows expedited clearance for pre-approved, low risk travelers upon arrival in the United States,\" the CBP website proclaims. \"Though intended for frequent international travelers, there is no minimum number of trips necessary to qualify for the program. Participants may enter the United States by using automated kiosks located at select airports.\"\r\n\r\nAs described on GlobalEntry.gov, the Global Entry kiosks look much like ATM machines placed to assist Trusted Travelers passing through U.S. ports of entry including airports:\r\n\r\nGlobal Entry kiosks under the Trusted Traveler program have been installed at the following 20 airports, according to the CBP website.\r\n\r\n    * Boston-Logan International Airport (BOS)\r\n    * Chicago O’Hare International Airport (ORD)\r\n    * Dallas/Ft. Worth International Airport (DFW)\r\n    * Detroit Metropolitan Airport (DTW)\r\n    * Ft. Lauderdale/Hollywood International Airport (FLL)\r\n    * George Bush Intercontinental Airport, Houston (IAH)\r\n    * Hartsfield-Jackson Atlanta International Airport (ATL)\r\n    * Honolulu International Airport (HNL)\r\n    * John F. Kennedy International Airport, New York (JFK)\r\n    * Los Angeles International Airport (LAX)\r\n    * McCarran International Airport, Las Vegas (LAS)\r\n    * Miami International Airport (MIA)\r\n    * Newark Liberty International Airport (EWR)\r\n    * Orlando International Airport (MC))\r\n    * Orlando-Sanford International Airport (SFB)\r\n    * Philadelphia International Airport (PHL)\r\n    * San Francisco International Airport (SFO)\r\n    * San Juan-Luis Muñoz Marin International Airport (SJU)\r\n    * Seattle-Tacoma International Airport-SeaTac (SEA)\r\n    * Washington-Dulles International Airport (IAD)\r\n\r\nNorth American continental logo\r\n\r\nWND also has reported that the Trusted Traveler of North America cards the U.S. Customs and Border Patrol, or CBP, is in the process of issuing are being branded, not with a map of the United States, but with a logo that depicts North America as a continent, with the borders between the U.S. and Canada and between the U.S. and Mexico conspicuously absent.\r\n\r\nIn a file on the CBP website that instructs applicants how to obtain a Trusted Traveler of North America biometric card, a generic sample of the Trusted Traveler card is presented, complete with the logo of North America in the upper right hand corner:\r\n\r\nThe CBP website defines NEXUS cards being issued by CBP as being \"WHTI-compliant [Western Hemisphere Travel Initiative] for land and sea travel, as well as air travel from airports using the NEXUS program\" designed to \"provide expedited travel via land, air or sea to approved members between the U.S. and Canada border.\"\r\n\r\nSearching the Canadian website for the Canada Border Services Agency, an adaptation of the generic Trusted Traveler card can be found for the NEXUS program:\r\n\r\nThe CBP website identifies the FAST Driver card as being a WHTI-compliant document \"for entry into the United States by land or sea\" that can afford \"expedited release to approved commercial truck drivers making fully-qualified FAST trips between the U.S. and Canada and the U.S. and Mexico.\"\r\n\r\nSearching the Canadian website for the Canada Border Services Agency, an adaptation of the generic Trusted Traveler card can be found for the FAST program:\r\n\r\nFAST, an acronym for \"Free and Secure Trade,\" is identified on the CBP website with a logo that includes the three flags of the North American countries – the United States, Canada and Mexico.\r\n\r\nhttp://www.wnd.com/index.php?fa=PAGE.view&pageId=263797", "group_id": 3920, "id": 129642}]