[{"user_id": 2946, "stars": [], "topic_id": 2716, "date_created": 1297291969.122191, "message": "Yo ya no hago trabajo para clientes, pero creo que no tendría problema para hacerlo, aunque hay que aclarar que HTML5 puede ser dos cosas distintas: por un lado es una especificación, la mas reciente versión de HTML, por otro lado es un término marketinero que además engloba  CSS3 y JavaScript. La primera acepción la recomiendo sin problemas (odio XHTML) y la segunda dependiendo del caso.", "group_id": 971, "id": 59572}, {"user_id": 3017, "stars": [], "topic_id": 2716, "date_created": 1297319601.7481239, "message": "Recomiendo largamente el ultimo libro de Andy Clarke. En el se recomienda largamente utilizar HTML5 (la especificacion) y CSS3.", "group_id": 971, "id": 66394}, {"user_id": 5957, "stars": [], "topic_id": 2716, "date_created": 1297358330.6224599, "message": "nosotros logramos que un cliente importante se enganche con la idea de armar una aplicación con HTML5 y CSS3. El proyecto está en proceso!", "group_id": 971, "id": 71606}, {"user_id": 14243, "stars": [], "topic_id": 2716, "date_created": 1298258566.088758, "message": "Obviamente que hay que recomendar, sino nunca vamos a llegar a que sea standard. ¿Porque tenerle miedo? que razones hay para no usarlo?", "group_id": 971, "id": 155853}, {"user_id": 3665, "stars": [], "topic_id": 2716, "date_created": 1298396859.0303819, "message": "Cuanto tiempo calculan para que html5 y css3 sean bien aceptados?", "group_id": 971, "id": 180767}, {"user_id": 2946, "stars": [], "topic_id": 2716, "date_created": 1298401331.1098571, "message": "@Krator Con lo payasos que se están poniendo los de Apple, yo creo que HTML5 será LA opción para apps mobiles en muy poco tiempo.", "group_id": 971, "id": 181377}, {"user_id": 3017, "stars": [], "topic_id": 2716, "date_created": 1298478577.3098991, "message": "Estoy de acuerdo con soska, pronto va a ser HTML5 o nada para mobiles.", "group_id": 971, "id": 188425}, {"user_id": 14243, "stars": [], "topic_id": 2716, "date_created": 1298482407.2763481, "message": "html5 ya es la solucion para web mobile. Apps como la de flickr para iphone estan hechas en html5 hecho y derecho", "group_id": 971, "id": 188978}]