[{"user_id": 7801, "stars": [], "topic_id": 15593, "date_created": 1301216782.684104, "message": "Die App ist am besten eine mobile Web-App, um moeglichst viele Geraete zu unterstuetzen und schnell handlungsfaehig zu sein, was Updates etc. angeht.", "group_id": 7894, "id": 450176}, {"user_id": 7801, "stars": [], "topic_id": 15593, "date_created": 1301216716.1078019, "message": "Es gibt eine grosse Anzahl von Fahrgaesten mit Smartphones in der U/S-Bahn. Die könnte man sicher einspannen um aktuelle Stoerungsinformationen zu erhalten. Da GPS etc. im Tunnel nicht funktionieren wird, muessten sie die Linie/Station eingeben auf der sie gerade Probleme haben. In einer Liste sieht man dann wo es ueberall gerade stockt. Wenn man seine \"Lieblingsstrecke\" eingibt, erhaelt man Benachrichtigungen von Problemen speziell auf dieser Strecke. Man könnte das Ganze \"Gamifizieren\", d.h. es gibt z.B. ein Punktesystem und Bestenlisten mit den Nutzern die am Meiste zum Erfolg der Andwendung beitragen.", "group_id": 7894, "id": 450171}, {"user_id": 7801, "stars": [], "topic_id": 15593, "date_created": 1301218381.0219591, "message": "Twittern kann sie ja trotzdem. D.h. man koennte ja z.B. einstellen wie du Benachrichtigt werden will wenn auf deiner Lieblingsstrecke was los ist (Twitter, SMS, Email, ...). Man kann sich auch ein Interface vorstellen bei dem man Stoerungen z.B. via Twitter melden kann. Das sollte dann aber alles von einer WebApp gesammelt werden, so das man im Büro auch am Rechner auf eine schöne Website schauen kann und sieht ob es irgendwo Stress gibt.", "group_id": 7894, "id": 450254}, {"user_id": 25732, "stars": [], "topic_id": 15593, "date_created": 1301217815.143153, "message": "Wenn sie twittert und du @Aus_der_Bahn und co. begeistern kannst, ist das bestimmt sehr erfolgreich. Viele Leser, wenig Schreiber, bzw. gute Möglichkeit, die Nutzergruppe aufzubauen (Starthürde).", "group_id": 7894, "id": 450217}, {"user_id": 25732, "stars": [], "topic_id": 15593, "date_created": 1301218028.713881, "message": "Der Punkt ist ja, dass man sie nicht extra aufmachen möchte, wenn man was wissen will. Aber Tweets ließt man ggf. eh.", "group_id": 7894, "id": 450225}, {"user_id": 25739, "stars": [], "topic_id": 15593, "date_created": 1301220808.091346, "message": "Kann man die bekannten Fahrplanabweichungen http://geofox.hvv.de/jsf/showScheduleVariances2.seam vielleicht direkt mit reinpumpen?", "group_id": 7894, "id": 450438}]