[{"user_id": 31927, "stars": [], "topic_id": 40918, "date_created": 1309506793.451067, "message": "Eurogamer has a preview up:  http://www.eurogamer.net/articles/2011-06-30-from-dust-preview", "group_id": 9493, "id": 1538269}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1310105825.8130319, "message": "Yay! It's releasing on PC on the same date as XBLA, that is, July 27th for $15, on Steam no less.", "group_id": 9493, "id": 1590712}, {"user_id": 31927, "stars": [], "topic_id": 40918, "date_created": 1310106285.075455, "message": "I'm still not convinced I actually want to play this… much as I'll admit that Eric Chahi was responsible for one of the single most transcendent moments in (my) gaming.", "group_id": 9493, "id": 1590763}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1310106725.260947, "message": "I have to play this, even if only to muck around. I imagine Chahi must be aware of the inherent datedness of the god game genre, so I'm sure he'll make it interesting.", "group_id": 9493, "id": 1590777}, {"user_id": 31927, "stars": [], "topic_id": 40918, "date_created": 1310106765.984853, "message": "That's what I'm hoping.", "group_id": 9493, "id": 1590778}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1311666002.165081, "message": "PC version delayed a month, one day before release. Good job, Ubisoft.", "group_id": 9493, "id": 1721512}, {"user_id": 36043, "stars": [], "topic_id": 40918, "date_created": 1311675811.49417, "message": "@Mr_V What was the single gaming moment?", "group_id": 9493, "id": 1722097}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1311700933.254456, "message": "Eurogamer review (9/10): http://www.eurogamer.net/articles/2011-07-26-from-dust-review", "group_id": 9493, "id": 1724399}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1311702400.3714099, "message": "A couple of reviews are criticizing the lack of fine controls. Definitely one to wait for on PC, it seems.", "group_id": 9493, "id": 1724616}, {"user_id": 38634, "stars": [], "topic_id": 40918, "date_created": 1311780433.5376079, "message": "I didn't really have any issue with the controls. What I did - and continue to - have an issue with is the two missing Memory thingies. I have turned the entire world upsidebloodydown, and can't find them. :<", "group_id": 9493, "id": 1731930}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1313650941.9642141, "message": "Oooooh, are they hidden? :<\n\nI didn't see any on Map 3 so I moved on, now I think I should have spent more time looking. :(", "group_id": 9493, "id": 1900040}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1313651212.3070099, "message": "A word on the PC port: It is fucking *horrendous*.\n\nThe mouse controls are a poor facsimile of dual analogs, rather than behaving how any god's eye view mouse game should. There's no in-game Vsync support (the game has some awful tearing) - but thankfully you can resolve that via your Nvidia or ATI control panel, there's no AA support (can't get that one to work via the control panel, although I believe others have - this is always a massive pet peeve) and for some ungodly reason, the FPS is locked at 30.\n\nSo really, the only reason to play this on PC rather than 360 is the resolution upgrade - I plugged in my 360 controller after ten minutes. That said, the game's gorgeous. The underlying simulation mechanics are wonderful.", "group_id": 9493, "id": 1900056}, {"user_id": 35617, "stars": [], "topic_id": 40918, "date_created": 1313742847.3278379, "message": "Seems like the politics surrounding this game are getting nasty:\n\nhttp://www.rockpapershotgun.com/2011/08/18/from-dust-does-need-online-badly-ported/", "group_id": 9493, "id": 1908682}, {"user_id": 25703, "stars": [], "topic_id": 40918, "date_created": 1313746514.854687, "message": "I'd heard a tip about disabling the \"Mouse Scroll\" option if you're attempting to play with the mouse and amazingly the game suddenly becomes playable. With it enabled (the default) the screen starts scrolling as soon as the mouse is slightly off centre, it's horrifying.\n\nI still wish there was a traditional sort of cursor control, that was as responsive as any 3D RTS. The current system is a little sluggish for no apparent reason, but it suffices. I might actually start using the Mouse/Keyboard now rather than my controller.\n\nI also got AA/AF/Vsync to work via the Nvidia control panel, by upgrading my drivers, so now the game looks gorgeous. Haven't had any bugs, glitches or crashes, or any problems with the DRM - so now that the game's more or less functioning like I expect a PC game too (even if I had to do all the leg work) I'm happy recommending it.", "group_id": 9493, "id": 1908838}]