[{"user_id": 26068, "stars": [], "topic_id": 39828, "date_created": 1308532831.2282779, "message": "My company is going to do a rewrite and we are trying to determine the right front end framework for our app. What are the pros and cons between these three!", "group_id": 160, "id": 1434656}, {"user_id": 23244, "stars": [], "topic_id": 39828, "date_created": 1308584658.5123889, "message": "Depending on application complexity, you might want to take a look at backbone.js + jquery. Its not as complete a solution as the mentioned frameworks, but very flexible.", "group_id": 160, "id": 1439569}, {"user_id": 12901, "stars": [], "topic_id": 39828, "date_created": 1308656775.0736179, "message": "ExtJS 4 is very widget-complete, so customizing the widgets is your core problem. Sometimes, that will mean having to do breaking-the-upgrades changes that override sections of code marked \"private\". ExtJS 4 is better in this case than ExtJS 3. If your application can be said to \"look like Outlook\", then this may be for you.", "group_id": 160, "id": 1447364}, {"user_id": 22218, "stars": [], "topic_id": 39828, "date_created": 1308662459.1706581, "message": "I hate to get emotional but Ext has left a bad taste in my mouth for years. Ext2 overrode many functions defined by Prototype on basic elements such as functions. We had paid support with them; when we had issues upgrading prototype to 1.6 their answer was to \"...not use flaky libraries like Prototype...\". Now I don't necessarily have love for prototype but it is rather well established and shouldn't be written off wholesale like that by the engineers at Sencha. I guess my main beef with Ext is that there is a reason they offer paid support (perhaps their attitude has changed in more recent products)", "group_id": 160, "id": 1448180}, {"user_id": 12901, "stars": [], "topic_id": 39828, "date_created": 1308781075.8273611, "message": "@jacksontomlinson ExtJS has gotten better over the years, better practices. I am not using Ext at the moment, but I hope they don't lose the widget focus. A neat, extensible datagrid is hard to find.", "group_id": 160, "id": 1460792}, {"user_id": 38254, "stars": [], "topic_id": 39828, "date_created": 1310964285.3962381, "message": "Anyone recommend using Selenium for testing ExtJS ui?", "group_id": 160, "id": 1660577}, {"user_id": 26068, "stars": [], "topic_id": 39828, "date_created": 1311000650.170855, "message": "I've never done that, but doesn't ExtJS4 have a new visual testing suite?  Is it not out yet?", "group_id": 160, "id": 1663095}, {"user_id": 41115, "stars": [], "topic_id": 39828, "date_created": 1316277273.8622849, "message": "isn't this widget libraries versus full stack app framework", "group_id": 160, "id": 2150487}, {"user_id": 14552, "stars": [], "topic_id": 39828, "date_created": 1320255838.283124, "message": "YUI3 would serve you best as an app framework if you want that, the others are better as script libraries if you don't want to actually do much dev work yourself", "group_id": 160, "id": 2492771}]