[{"user_id": 24160, "stars": [{"date_created": 1303925413.0544651, "user_id": 26088}, {"date_created": 1303947003.2163939, "user_id": 12739}, {"date_created": 1304296201.0320611, "user_id": 10406}], "topic_id": 21653, "date_created": 1303921858.8702569, "message": "Aquí está el documento que preparó Noah Kagan para obtener los primeros 80,000 usuarios de Mint.com: http://www.scribd.com/fullscreen/52600820", "group_id": 965, "id": 828001}, {"user_id": 24160, "stars": [], "topic_id": 21653, "date_created": 1303921917.430614, "message": "En mi opinión, es una gran lección de cómo la combinación y seguimiento de acciones básicas pero contundentes pueden definir el destino de un producto. Nótese que la mayoría de las acciones son de \"bajo presupuesto\"", "group_id": 965, "id": 828009}, {"user_id": 26089, "stars": [], "topic_id": 21653, "date_created": 1303933752.892704, "message": "Muy interesante, gracias por compartir! un detalle que llama mi atención es que varias de las acciones de su plan dependían de varios \"contactos\" que ya tenían.", "group_id": 965, "id": 831516}, {"user_id": 24160, "stars": [], "topic_id": 21653, "date_created": 1303936688.6806991, "message": "@geeksterhipster Por lo cual, es importante siempre estar desarrollando tu red de contactos", "group_id": 965, "id": 832238}, {"user_id": 24172, "stars": [], "topic_id": 21653, "date_created": 1303973999.6143661, "message": "@geeksterhipster @cesarsalazar A mi parecer los contactos no eran importantes. Creo que lo más importante es saber que el producto que estás construyendo ayudará a muchas personas si ejecutas bien tu plan de Marketing. Lo primero que noto, es que Noah tiene bien claro cuál es su nicho y de qué manera puede atacarlo, ya sea buscando personas famosas, blogs de personas que cree que pueden utilizar el producto, y con altas posibilidades de ser early adopters dado que están activamente buscando una solución al problema que Mint resuelve. Los contactos son consecuencia, no la razón de su éxito. Por otro lado, pensemos en esto, si WSJ y TC son sitio que buscan notas interesantes, claramente si tienes un producto que resuelva un gran dolor entonces ellos podrán sin problemas escribir sobre tu startup. Aquí hay una excelente guía para hacer que TC publique una nota sobre tu producto: http://bit.ly/iJ19Q7.", "group_id": 965, "id": 837755}, {"user_id": 29866, "stars": [{"date_created": 1304037946.8498671, "user_id": 26088}], "topic_id": 21653, "date_created": 1304015779.880687, "message": "A mi me gusta mucho la lección de DropBox y como llegaron a Millón de usuarios en 7 meses: http://www.slideshare.net/gueste94e4c/dropbox-startup-lessons-learned-3836587", "group_id": 965, "id": 845031}, {"user_id": 26638, "stars": [{"date_created": 1304114904.9250031, "user_id": 24172}], "topic_id": 21653, "date_created": 1304091683.3949161, "message": "La lección de DropBox se resume en: El MKT y los contactos son secundarios, lo que importa es un producto realmente MUY bueno (quote: Fortunately, we spent almost all our effort on making an elegant, simple product that \"just works\")", "group_id": 965, "id": 858514}, {"user_id": 26638, "stars": [{"date_created": 1304114914.4640059, "user_id": 24172}], "topic_id": 21653, "date_created": 1304091982.567539, "message": "Y en el caso de MINT un \"muy buen producto\" incluía el memorable diseño visual que por si sólo ganó muchos early adopters en la comunidad de diseñadores", "group_id": 965, "id": 858610}, {"user_id": 29866, "stars": [], "topic_id": 21653, "date_created": 1304093521.939774, "message": "Si, hace un par de días leí también otras estrategias que se pueden usar para obtener Advertising Low Cost: http://onstartups.com/tabid/3339/bid/43774/The-5-Minute-Guide-To-Cheap-Startup-Advertising.aspx", "group_id": 965, "id": 859072}, {"user_id": 27909, "stars": [{"date_created": 1304092866.114187, "user_id": 12133}, {"date_created": 1304114925.762521, "user_id": 24172}], "topic_id": 21653, "date_created": 1304092656.490315, "message": "Dropbox es muy interesante tanto por como definieron el producto (i.e. less features = better - http://www.quora.com/Dropbox/Why-is-Dropbox-more-popular-than-other-programs-with-similar-functionality) y se enfocaron en resolver UN problema muy bien aunque tambien probaron sistemáticamente diferentes modelos de distribución - en un inicio hicieron varios experimentos con AdWords hasta que se dieron cuenta de que les costaba $300+ USD obtener un usuario y en base a esto probaron la distribución viral a traves de los mismos usuarios (regalando 250 Mb por cada nuevo usuario, que aun así acabo siendo mucho mas barato que las alternativas) (http://blog.hubspot.com/blog/tabid/6307/bid/5956/5-Viral-Marketing-Lessons-From-Dropbox.aspx)", "group_id": 965, "id": 858856}, {"user_id": 25716, "stars": [], "topic_id": 21653, "date_created": 1304095364.3369739, "message": "Asi, que experiencias gentes aqui tienar? Quiero escuchar historias de exito de aqui. Todos los links es muy interesante, y yo quiero leer todos ahorita, gracias!! Pero en verdad yo pienso el mejor es que hablar con gentes que tiene exito con esto. Porque cada persona tiene una otra perspectiva, y traves discussion acerca la experiencia es posible entender muy bueno la idea. Asi, quien tienar bueno experiencia en esto?", "group_id": 965, "id": 859569}, {"user_id": 12739, "stars": [], "topic_id": 21653, "date_created": 1304109956.786092, "message": "Es el problema del huevo y la gallina, pero yo soy fiel creyente de que aunque es lo más importante, el tener un buen producto no basta, se necesitan contactos. Seguro que hay por ahí muchos productos que han sido buenos y no han \"pegado\" por falta de exposición.\n\nEn los videojuegos y las películas eso se ve muy claro, con tantos que se han convertido en productos de culto, pero en su momento nadie los conocía y fueron un fracaso comercial.", "group_id": 965, "id": 863498}, {"user_id": 25716, "stars": [], "topic_id": 21653, "date_created": 1304115419.792408, "message": "@nRikeDiaz agree", "group_id": 965, "id": 864633}, {"user_id": 24172, "stars": [{"date_created": 1304115412.0723619, "user_id": 25716}], "topic_id": 21653, "date_created": 1304115225.6469159, "message": "@pablasso The point is, since you have the beliefs that you need contacts, still you dont have the experience of launch a product and try if contacts are a key part. That's why  @dsch asks for experiences, not beliefs.", "group_id": 965, "id": 864627}, {"user_id": 26638, "stars": [{"date_created": 1304246869.4089451, "user_id": 24172}], "topic_id": 21653, "date_created": 1304135163.112618, "message": "Yo tengo un blog con 8 millones de hits al mes, y aunque no es igual que lanzar un app, si creo que es: 60% trabajo, 30% mkt, 10% contactos", "group_id": 965, "id": 866275}, {"user_id": 25716, "stars": [], "topic_id": 21653, "date_created": 1304214209.6091461, "message": "@jorge_ocampo pero un blog es muy diferente de uno servicio (que la mayoria de los startups es).  Es interesante, pero algunas personas aqui que tiene experiencia de uno startup?", "group_id": 965, "id": 873459}]