[{"user_id": 31902, "stars": [], "topic_id": 34220, "date_created": 1304826541.597877, "message": "I found a couple of models, one for YASim and one for JSBSim.  The latter has a 3D model accompanying it.  I've also made more progress deciphering how it works, so I'm using that one for now.  Next I'll try hooking up a basic autopilot.", "group_id": 9523, "id": 956229}, {"user_id": 31902, "stars": [], "topic_id": 34220, "date_created": 1304826837.0530779, "message": "One concern I have regards a potential limitation of FlightGear affecting this project.  I haven't yet noticed how to get arbitrary sensor data about the simulation.  Flight data (attitude, velocity, etc) is available easily, but I don't know about things like proximity detection, sonar, or simulated wireless communication.  Even if these impressions prove accurate, this should still be a useful tool for testing stabilization and (GPS) navigation routines, anything strictly to do with flying.", "group_id": 9523, "id": 956275}, {"user_id": 31902, "stars": [], "topic_id": 34220, "date_created": 1305068752.4813819, "message": "Anyone else have interest in pursuing this or other aspects of control?", "group_id": 9523, "id": 997320}, {"user_id": 31902, "stars": [], "topic_id": 34220, "date_created": 1305068507.256635, "message": "I have a working quadcopter simulation platform in Flight Gear based off of UAV Playground.  The quadcopter controler runs in a Java application separate from Flight Gear, and the two communicate over sockets.  I'm using an FDM by Ron Jensen (http://www.gitorious.org/ron-s-hanger/quadracopter) with minor modifications.", "group_id": 9523, "id": 997283}, {"user_id": 31902, "stars": [], "topic_id": 34220, "date_created": 1305068659.2250741, "message": "Now it's time to add a stabilization controller.  I'm thinking of using PIDs at first, though I have no experience tuning them.  I'll probably also look at arducopter (http://code.google.com/p/arducopter/) and see how they do it.", "group_id": 9523, "id": 997307}, {"user_id": 31506, "stars": [], "topic_id": 34220, "date_created": 1308677785.1811881, "message": "This link calculates thrust based on propeller and motor characteristics http://www.badcock.net/cgi-bin/powertrain/propconst.cgi", "group_id": 9523, "id": 1450229}]