[{"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1299862413.281584, "message": "I've heard Fusemail hasn't been as reliable since it was bought out and wonder if FastMail will suffer a similar fate as they have were recently acquired by Opera.", "group_id": 97, "id": 324293}, {"user_id": 14896, "stars": [], "topic_id": 12375, "date_created": 1299863183.0388441, "message": "I happen to work for an email service provider, so I know a bit about this sort of stuff. What kinds of email are you looking to send? Just internal corporate stuff or email marketing or transactional emails or...?", "group_id": 97, "id": 324604}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1299862078.6569049, "message": "I'm doing a little research on different email providers for small businesses such as FastMail, Fusemail, Google, and Rackspace and would like to gauge public opinion.", "group_id": 97, "id": 324194}, {"user_id": 20661, "stars": [], "topic_id": 12375, "date_created": 1299865497.4386699, "message": "@scottrieger Hi Scott, all I can say is based on my experience with Google Apps and I must say I never expected any problem with my accounts and the ones from my clients, that's the reason why I continue recommending the use of Google as email provider as long with the fact that it's the same interface users are used to see with Gmail so it's easier to learn the the stuff is and how to work with the webmail. And about FastMail, Opera is well known for doing things right, I don't see the acquisition as a problem.", "group_id": 97, "id": 325096}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1299869462.068208, "message": "Though paid email service seems to be limited market i.e. to smaller companies without the time, money and desire to manage it in-house.", "group_id": 97, "id": 325579}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1299869288.600414, "message": "thnx @Xyborg! Google Apps for Businesses seems to be the obvious choice for paid service - reliable and familiar.  I assume they offer an SLA for the paid service, n'est pas?  I'm actually one of the four Opera fanboys in the world and would love to see a company like FastMail take off with Opera's influence behind it.", "group_id": 97, "id": 325558}, {"user_id": 9018, "stars": [], "topic_id": 12375, "date_created": 1299870278.5683689, "message": "We use MailChimp and love it, no issues in the first 12 months we've been using it.\n- http://www.LiveBaseballChat.com", "group_id": 97, "id": 325668}, {"user_id": 4689, "stars": [], "topic_id": 12375, "date_created": 1299873201.7700281, "message": "The company I work for took the plunge into Google apps away from Microsoft exchange 3 years ago. Its been great. We have 14 employees.", "group_id": 97, "id": 326210}, {"user_id": 20661, "stars": [], "topic_id": 12375, "date_created": 1299873885.656738, "message": "@scottrieger remember that there is a free version and smaller version http://www.google.com/apps/intl/en/group/index.html that in some cases can feet with small companies without the time/money, but obviously it's not the *right* thing to use for them..:P", "group_id": 97, "id": 326292}, {"user_id": 20661, "stars": [], "topic_id": 12375, "date_created": 1299873600.8636651, "message": "@scottrieger lol! I'm an Opera fan boy too xD Nice to met you user #3, greetings from #4 :P (sorry for the OT)", "group_id": 97, "id": 326256}, {"user_id": 21746, "stars": [], "topic_id": 12375, "date_created": 1300208609.845763, "message": "Hands down Google Apps. Use the free version to start and scale with your company's needs. Very reasonable pricing for a very reliable service.", "group_id": 97, "id": 358618}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1300209577.250675, "message": "Thanks!  One thing about the free email for Google Apps is the lack of a service guarantee.  I believe the SLA does not come into play until the paid tiers - $50/user annually.  Though it is Google.", "group_id": 97, "id": 358761}, {"user_id": 19160, "stars": [], "topic_id": 12375, "date_created": 1300215574.1777191, "message": "I'm looking forward to the time when I use convore instead of e-mail.", "group_id": 97, "id": 359454}, {"user_id": 21746, "stars": [], "topic_id": 12375, "date_created": 1300214314.4309349, "message": "@scottrieger True, the paid tiers are the only ones that have the 99.9% guarantee. The reliability on Apps free is the same as Gmail though which is pretty tried and tested to begin with (aside for a few small cases of downtime over the past couple years). If you're really interested in getting the best reliability I'd recommend self-hosting. It's good practice and you can multitask your box as a server as well.", "group_id": 97, "id": 359281}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1300215573.7322519, "message": "Though I'm not sure if these concerns are warranted or not, I do not have much experience in maintaining such a service.", "group_id": 97, "id": 359453}, {"user_id": 1176, "stars": [], "topic_id": 12375, "date_created": 1300215399.64221, "message": "@MartinM Yeah, I've looked into running Atmail on a Media Temple (dv).  I'm not totally opposed to the idea but unwanted risk and responsibility would be placed on my dev teams (not enough sys admins to support hosting email internally).  Atmail seems pretty simple and straight forward but internally hosting email seems like a whole lot of unwanted maintenance.", "group_id": 97, "id": 359435}, {"user_id": 15434, "stars": [{"date_created": 1300446052.0483339, "user_id": 15929}, {"date_created": 1300506224.1176181, "user_id": 9108}], "topic_id": 12375, "date_created": 1300439037.0000911, "message": "I used hosted Exchange but switched because I hated all the local file storage and how my Outlook slowed down. Now I use Gmail Apps For Domain. Only issue is that sporadically my account locks and I have to call Google which is a pain. Gmail is as zero maintenance as you can get aside from that minor experience. Also don't forget the mobile aspect. Users will want mobile access on iPhone, BlackBerry, Android. Gmail handles all that with little or no setup on your end. Spam filter is amazing.", "group_id": 97, "id": 380767}, {"user_id": 9108, "stars": [], "topic_id": 12375, "date_created": 1300506319.6800959, "message": "@Mas90guru I really dislike how Outlook stores so much locally in Cached Exchange Mode (though obviously running without a cache when your mailbox is a few gigs isn't much of an option, either.) That said, the latest version of OWA is actually pretty slick if you like that kind of mail layout.", "group_id": 97, "id": 386975}, {"user_id": 23272, "stars": [], "topic_id": 12375, "date_created": 1300732342.645493, "message": "I would give my vote to Google Apps. I've setup a few domains with it and have never had a problem. My company uses Exchange and in comparison I think Google Apps is way better. I also think the OWA is horrid. GMail interface is way better.", "group_id": 97, "id": 400987}, {"user_id": 23355, "stars": [], "topic_id": 12375, "date_created": 1300745706.3205881, "message": "isn't it too hard to get a \"normal\" username in front of gmail.com?", "group_id": 97, "id": 403158}, {"user_id": 22835, "stars": [], "topic_id": 12375, "date_created": 1300746220.926651, "message": "@michaelkohler I recommend buying your own domain name and setting it up to use Google Apps. That way you have the exact same service as gmail but you have name@yourname.com", "group_id": 97, "id": 403214}, {"user_id": 22835, "stars": [], "topic_id": 12375, "date_created": 1300745349.662641, "message": "Another vote for Google Apps. I've setup many small businesses with it, and had almost no problems. I've mostly used the free version and it's great. I have clients using IMAP on their computers, mobile sync on their phones, and the web app and everything stays in sync.", "group_id": 97, "id": 403094}, {"user_id": 23355, "stars": [], "topic_id": 12375, "date_created": 1300748419.9745729, "message": "that sounds awesome. will have a look, thanks", "group_id": 97, "id": 403412}, {"user_id": 15434, "stars": [], "topic_id": 12375, "date_created": 1300784667.262543, "message": "Worth noting you can use a custom domain on the free version of Google Apps.", "group_id": 97, "id": 405851}, {"user_id": 20661, "stars": [], "topic_id": 12375, "date_created": 1300821976.1468301, "message": "@Mas90guru yep, you can :)", "group_id": 97, "id": 410842}]