[{"user_id": 36639, "stars": [], "topic_id": 40003, "date_created": 1308677963.395596, "message": "In my application using django-social-auth, if I register a new user with built-in auth using a gmail email address, and then sign in as same user using social-auth with google provider, it associates the second login with the first user. How I prevent this situation? At the same time, I do want to enable multiple associations for the same provider and user, because my application can be accessed under multiple domain names, and hence multiple associations per provider. Thanks.", "group_id": 5196, "id": 1450247}, {"user_id": 20656, "stars": [], "topic_id": 40003, "date_created": 1308680959.9239471, "message": "For the first issue, you can defined the setting SOCIAL_AUTH_ASSOCIATE_BY_MAIL = False, that will stop the automatic association. It's not clear the second situation, you want the same user using the same gmail account, to register to the same site that's shown on different domains? (shared db, right?)", "group_id": 5196, "id": 1450709}, {"user_id": 36639, "stars": [], "topic_id": 40003, "date_created": 1308747904.6236701, "message": "Are all scenarios supported today? Thanks!", "group_id": 5196, "id": 1456841}, {"user_id": 36639, "stars": [], "topic_id": 40003, "date_created": 1308747891.178304, "message": "It seems like there are four separate scenarios that need to be managed separately:\n1) Ability to create a new user from social auth\n2) Username set to email address\n3) Ability to add new associations on existing user on same provider only (i.e., same site on different domains). For the purpose of enabling this feature, \"provider\" would also include native authentication, such that a native-auth user can not simply switch to social-auth, without the app's permission.\n4) Ability to add new associations on existing user on different providers.\n\nIn my application, I need #'s 1-3 to work automatically, and # 4 to only work in the narrow case where my app is reseting the user's authentication profile.", "group_id": 5196, "id": 1456838}, {"user_id": 36143, "stars": [], "topic_id": 40003, "date_created": 1308757382.4238701, "message": "I think what's being asked is something along the lines of:\n - User not logged in, clicks on a provider to authenticate against\n - Get back auth ticket from provider, realize that there's not an existing account for user\n - Prompt user: Make new account?  Associate with existing account?\n - Existing account could be django-auth account made through different setting\n - If new account, provide a form view to get additional information on the user that is saved along with the auth association\n", "group_id": 5196, "id": 1458029}, {"user_id": 36639, "stars": [], "topic_id": 40003, "date_created": 1308763218.6870639, "message": "1) More granular rules of how to associate (e.g., same provider, or different provider only if decided by app at runtime).\n2) I want my app to make these decisions, not the user.", "group_id": 5196, "id": 1458701}, {"user_id": 36639, "stars": [], "topic_id": 40003, "date_created": 1308763148.921855, "message": "Not exactly. The two main differences are:", "group_id": 5196, "id": 1458699}]