[{"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300846639.6722879, "message": "Hey folks, just wanted to make you aware of Startupwindow.com.  It's a service recently launched at SxSWi and it seems to be getting good traction.  The service currently allows you to post job opportunities for free.  The interesting part is that it allows for a wide range roles and job types.  For example you can look for co-founders or an office temp.  Looks like the only requirement is that the poster be from or starting, hehe, a startup.", "group_id": 95, "id": 413539}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300853116.790278, "message": "@KrakensDen Did you happen to check the blog ?  The editorial / job services work together to create a unique value prop.  The truth is that few have cracked this nut and we're focused on the needs of startups exclusively.", "group_id": 95, "id": 414086}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300853779.77565, "message": "Better still, our goal is to get the best candidates to young startups.  The job board is just the most tangible aspect of that mission and it's free.  We want to work hard to be the first place people think of when listing opportunities.  That has nothing to do with technology and everything to do with community.  We have to do the hard work and hit the pavement.", "group_id": 95, "id": 414154}, {"user_id": 1992, "stars": [], "topic_id": 14593, "date_created": 1300852532.355195, "message": "not to be a negative nellie, but there are about 10,000 tiny little job boards in the world. Other than having 'startup' in the title, is yours special? What are you doing to make sure you have enough possible employees checking it? What are you doing to attract companies (Craigslist is also free, and reaches more people)?", "group_id": 95, "id": 414020}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300853404.8146591, "message": "@KrakensDen We realized that content is critical to attracting entrepreneurs and early stage startups, not just the listing service.  Craigslist is not the ideal listing service people think of and for real jobs it's not free either,  it's $25.  Craigslist is not the place to attract top tier passive candidates.   It's a little bit of a chicken and egg problem.  Hence we give startups a vehicles for press coverage as well.", "group_id": 95, "id": 414120}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300854241.5646501, "message": "Here's a question: Why do page.ly and wpengine offer wordpress hosting when every web host offers a one click install, wordpress.com offers it for free, and for pay?  Startupwindow.com is about positioning in market where the need is clear and pain points still exists.", "group_id": 95, "id": 414213}, {"user_id": 1992, "stars": [], "topic_id": 14593, "date_created": 1300862076.8817091, "message": "Finally, page.ly and wpengine need to build a better product to beat wordpress.com and make sales. It's not clear to me that the problem with the 10,000 different developer job boards has anything to do with the product.", "group_id": 95, "id": 414861}, {"user_id": 1992, "stars": [], "topic_id": 14593, "date_created": 1300861787.2311699, "message": "I don't see how you're attracting passive candidates, there's no mechanism that I can see for finding developers, and you don't mention it anywhere", "group_id": 95, "id": 414839}, {"user_id": 1992, "stars": [], "topic_id": 14593, "date_created": 1300862263.884016, "message": "Thanks for responding to yet-another-random-internetter though. Just so I leak something that isn't stop energy, the design is beautiful, the search works, and I love the idea of the 'radius' selector, even if I can't really test it yet :)", "group_id": 95, "id": 414884}, {"user_id": 1992, "stars": [], "topic_id": 14593, "date_created": 1300861968.5271571, "message": "Also, I don't think your blog is going to drive the traffic you think it will. It's 2011, what you have is fairly pro forma.", "group_id": 95, "id": 414851}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300910113.000185, "message": "@KrakensDen Thanks, there is a lot more coming on the content front.", "group_id": 95, "id": 420172}, {"user_id": 1661, "stars": [], "topic_id": 14593, "date_created": 1300928116.044997, "message": "@travell Free staffing or press services: Choose one.", "group_id": 95, "id": 422223}, {"user_id": 23765, "stars": [], "topic_id": 14593, "date_created": 1300999602.1021459, "message": "@barce How do you attract passive applicants to otherwise boring job listings.  My solution is to cover the company that probably doesn't have a feature of Techcrunch/RWW yet.  Or cover the old startup that is making tons of money for the founder, but is otherwise boring in mainstream tech news.  Basically share the type of information that would be interesting to someone working at the company, but not to the average news junkie.  So it's a 3 legged stool with: listings, content, and community.  The last leg being the Sw's job.  Foster a community that promotes startups using boots on the ground and technology. Thoughts?", "group_id": 95, "id": 430948}, {"user_id": 1661, "stars": [], "topic_id": 14593, "date_created": 1301083973.6437709, "message": "@travell The trend right now is that it's strategically better to buy a company to get their talent rather than recruiting. Framing things as boring and something you have to push isn't the best way to go. I see the synergy that you are trying with free staffing & press services, but at that point the focus is really some sort of platform. Just my 2 cents.", "group_id": 95, "id": 442172}, {"user_id": 23765, "stars": [{"date_created": 1301267453.306149, "user_id": 1661}], "topic_id": 14593, "date_created": 1301090392.4819491, "message": "@barce I don't think the majority of startups out there have the money to pay a premium for talent acquisitions.  That's just bubble talk ;)  I do agree that the press side needs to be automated and I'm working on that.  Even boring companies need talent and even boring companies can be great work environments.", "group_id": 95, "id": 442856}]