[{"user_id": 29620, "stars": [], "topic_id": 42506, "date_created": 1311365007.351928, "message": "Me gustaría saber cuál es la compañía con la que han estado más satisfechos y por qué. Actualmente utilizo XpressHosting para hosting virtual. De una puntuación de 1 a 10 le daría un 7. La calificación es por que generalmente mi ejecutivo de cuenta tarda en responderme y a aveces no se encuentra en su horario de oficina, se supone que soy cliente preferente. Otra cosa que no me agrada es que la versión de MySQL que ofrecen es la 5.0 Hasta ahorita mi servidor siempre ha estado disponible.", "group_id": 965, "id": 1701247}, {"user_id": 26084, "stars": [{"date_created": 1311390810.9980559, "user_id": 18131}], "topic_id": 42506, "date_created": 1311365822.936981, "message": "Yo uso VPS en Linode y en general no eh tenido ningún problema, de hecho lo recomiendo.\n\n*Pros*: Tu lo administras\n*Cons*: Tu lo administras", "group_id": 965, "id": 1701366}, {"user_id": 22259, "stars": [], "topic_id": 42506, "date_created": 1311368472.606853, "message": "¿Haz considerado usar platform-as-a-service?", "group_id": 965, "id": 1701622}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311390444.3744831, "message": "mochahost.com con vps baratos y me han funcionado bien.", "group_id": 965, "id": 1703185}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311390471.2140801, "message": "Ahora si quires alguien especializado y mexicano esta www.sandinonetworks.com con la garantia del mejor linuxero de mexico.", "group_id": 965, "id": 1703189}, {"user_id": 29620, "stars": [], "topic_id": 42506, "date_created": 1311393952.1103899, "message": "Gracias por sus respuestas.", "group_id": 965, "id": 1703527}, {"user_id": 29620, "stars": [], "topic_id": 42506, "date_created": 1311394097.1159871, "message": "¿Considerarían que en general el Hosting en México es más caro?", "group_id": 965, "id": 1703539}, {"user_id": 37571, "stars": [], "topic_id": 42506, "date_created": 1311431698.722707, "message": "Yo utilizo Windows azure pero desarrollo en .net, es bueno el servicio pero hacer losdeploys comparado. Vs otros hosting es lento, ventajas que fácilmente puedes cambiar el numero de servidores o la capacidad con en un archivo de configuración", "group_id": 965, "id": 1705836}, {"user_id": 6227, "stars": [], "topic_id": 42506, "date_created": 1311465553.645514, "message": "\"el mejor linuxero de méxico\" ;)", "group_id": 965, "id": 1707578}, {"user_id": 19736, "stars": [], "topic_id": 42506, "date_created": 1311463548.6021509, "message": "Yo he trabajado muchos años con mediatemple y siempre me he sentido respaldado, por su puesto, siempre que he tenido problemas, dudas etc no me han fallado. Tiene poco que actualizó su Dedicado Virtual (el cual yo uso) y mejoró increíblemente en su versión 4.0.", "group_id": 965, "id": 1707466}, {"user_id": 6227, "stars": [], "topic_id": 42506, "date_created": 1311466176.4044371, "message": "la otra tendencia reciente, si no necesitas un vps con root es usar olvidarte por completo del rol de sysadmin con algo como dotcloud (se ve muy interesante), heroku (solo ruby), ep.io (solo python)", "group_id": 965, "id": 1707615}, {"user_id": 6227, "stars": [], "topic_id": 42506, "date_created": 1311465577.6895931, "message": "\"No entiendo porqué utilizar hosting en méxico al menos de tener algún requisito legal o burocrático que lo exija. yo igual recomiendo linode, otro bueno es slicehost y para algo más grande donde necesitas poder crear y destruir instancias dinámicamente creo lo más recomendado es AWS.", "group_id": 965, "id": 1707579}, {"user_id": 26088, "stars": [], "topic_id": 42506, "date_created": 1311472930.372849, "message": "Yo también Azure", "group_id": 965, "id": 1708160}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311563911.080343, "message": "@ivanyv yes es caro nunca dije que fuera barato ... che @sandino", "group_id": 965, "id": 1713124}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311484039.0441079, "message": "@mariorz yesss :)", "group_id": 965, "id": 1708706}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311484013.4661379, "message": "el data center mexico es muy muy malo!!! eso si. ahora el sysadmin mexicano es bueno", "group_id": 965, "id": 1708703}, {"user_id": 12133, "stars": [], "topic_id": 42506, "date_created": 1311484018.9664969, "message": "alemnos eso me han tocado.", "group_id": 965, "id": 1708704}, {"user_id": 6227, "stars": [], "topic_id": 42506, "date_created": 1311486225.0517869, "message": "si alguién busca colocation en méxico, no los he probado pero puedo decir que el data center de http://kionetworks.com está de primera", "group_id": 965, "id": 1708847}, {"user_id": 13545, "stars": [{"date_created": 1311538387.0745151, "user_id": 36952}, {"date_created": 1311555864.2713909, "user_id": 34039}], "topic_id": 42506, "date_created": 1311514747.093945, "message": "Yo use varios años SliceHost, pero se estancaron desde que los compro Rackspace. De hecho la historia esta interesante: http://37signals.com/founderstories/slicehost -- Ahora uso Linode y también los recomiendo mucho. El precio esta muy bien, y ellos si siguen mejorando. Para hosting virtual llevo casi 10 años con DreamHost, y su servicio es fenomenal... una vez hasta me ayudaron a resolver un problema de desempeño con un script de PHP!", "group_id": 965, "id": 1709791}, {"user_id": 13545, "stars": [], "topic_id": 42506, "date_created": 1311515131.9869781, "message": "@zodman por un momento hiciste que me emocionara, hosting del mejor linuxero mexicano?! me apunto! a mi si me gustaria usar hosting mexicano, pero por $1200 tengo más que su plan más caro, y hasta un VPS me sale mas barato... lastima :(", "group_id": 965, "id": 1709821}, {"user_id": 26638, "stars": [], "topic_id": 42506, "date_created": 1311528239.2577209, "message": "Para VS o shared, casi todos son iguales, pero cuando ya tienes demanda importante y requieres dedicados o incluso balance de carga, es cuando empiezan las diferencias, ahí Rackspace destaca en estabilidad, y Codero en servicio al cliente... Por cierto, yo le diseñe el sitio a KIO cuando se lanzó hace varios años, pero lo han cambiado varias veces, la nueva versión no me gusta nada. Decir también que el negocio central de KIO es outsourcing para empresas grandes, no creo que a nivel startup tenga ventajas contra otras opciones, eso si, su datacenter es de primer nivel, está en SantaFe, me dieron un tour cuando apenas estaba en construcción", "group_id": 965, "id": 1710509}, {"user_id": 2946, "stars": [], "topic_id": 42506, "date_created": 1311573754.232965, "message": "Amazon o Rackspace Cloud, definitivamente", "group_id": 965, "id": 1713872}, {"user_id": 13545, "stars": [], "topic_id": 42506, "date_created": 1311607199.250644, "message": "je, me acabo de dar cuenta, quise decir \"shared hosting\" no hosting virtual (o es lo mesmo?)... y para que no sea un comentario en vano: http://journal.uggedal.com/vps-performance-comparison/ -- En lo personal no veo la ventaja de usar EC2 et al. Aparte del desempeño, en el caso de Linode ofrece planes de hasta 20GB de RAM, lo cual es muchísimo para la mayoria de aplicaciones... y si tengo un \"Twitter\", preferiria co-location o hosting dedicado en Peer1 o similar... si se lo que ofrece la \"nube\", pero igual soy muy bruto para encontrarle el uso (bueno, lo que si usaria es S3: http://don.blogs.smugmug.com/2006/11/10/amazon-s3-show-me-the-money/)", "group_id": 965, "id": 1715922}, {"user_id": 35000, "stars": [], "topic_id": 42506, "date_created": 1311611060.4947951, "message": "estoy deacuerdo con @jorge_campo KIO trabaja como Outsourcing de IS (infrastructure systems) para corporativos, en cuanto al servicio son excelentes y tienen infraestructura y personal de primera, pero no son la opcion ni para startup o pymes, banca y grandes empresas retail son los clientes de KIO", "group_id": 965, "id": 1716347}, {"user_id": 26117, "stars": [], "topic_id": 42506, "date_created": 1311714532.051739, "message": "Alguien tiene alguna experiencia con el servicio de www.Neubox.net, en particular para proyectos con Python?", "group_id": 965, "id": 1726313}, {"user_id": 6541, "stars": [], "topic_id": 42506, "date_created": 1311723337.0090971, "message": "@tonymx con ese isp no, pero si he configurado uwsgi para django, flask, webpy, web2py y django-cms", "group_id": 965, "id": 1727211}, {"user_id": 37376, "stars": [], "topic_id": 42506, "date_created": 1311769355.3363039, "message": "¿Alguien puede dar feedback de AWS de Amazon?", "group_id": 965, "id": 1730510}, {"user_id": 22259, "stars": [], "topic_id": 42506, "date_created": 1311800714.5891709, "message": "@urysarabia Es paravirtualización, lo cual hace que el performace sea menor a la virtualización o a los servidores bare-metal. Pero, como plataforma es excelente si en lo que te quieres enfocar es en desarrollo y \"despreocuparte\" de la infraestructura que lo soporta. Con cosas como S3, Amazon RDS, etc. te facilita muchisimo el deployment y crecer tu infraestructura conforme a la demanda.", "group_id": 965, "id": 1734391}, {"user_id": 26117, "stars": [], "topic_id": 42506, "date_created": 1311802015.3859351, "message": "Hola @jyr Gracias por el dato, cuales proveedores has usado para desarrollo con Django-python?", "group_id": 965, "id": 1734547}, {"user_id": 22259, "stars": [], "topic_id": 42506, "date_created": 1311806005.446734, "message": "@tonymx http://djangozoom.com/, http://ep.io/, http://gondor.io/, http://stable.io/, etc... Hay muchos startups parandose en ese nicho. Creo que ninguno esta abierto todavía, solamente son por invitación.", "group_id": 965, "id": 1734871}, {"user_id": 6541, "stars": [], "topic_id": 42506, "date_created": 1311830405.4836259, "message": "@tonymx quijost.com pero ahi fue sobre un apache y solo configure la parte de la aplicacion el isp se encargo de activar wsgi en apache, pero he puesto uwsgi sobre nginx y son pequeños los cambios que se tienen que hacer por cada aplicacion (django, flask, webpy, etc) en http://bit.ly/n7zZWJ y http://bit.ly/nS7Phh puedes ver ejemplos de configuracion en dado caso que tengas que hacerlo por tu cuenta creo que es lo mejor.", "group_id": 965, "id": 1736759}, {"user_id": 37376, "stars": [], "topic_id": 42506, "date_created": 1311864798.6259179, "message": "@luiscosio Gracias por el feedback. Si, se de los pros y contras. Pero busco feedback pq ciertamente me llama la atención que startups como Dropbox lo utilizan o utilizaron (escuché que estaban por migrarse a otro lado) y les permitió crecer como la espuma. Eso suena muy bonito, pero sería interesante saber pq optaron por migrar a otro lado ya en una etapa muy madura. Yo hubiera pensado que lo harían antes.", "group_id": 965, "id": 1739696}, {"user_id": 26096, "stars": [], "topic_id": 42506, "date_created": 1311880706.9499459, "message": "Les recomiendo mucho que prueben internetworks! Gran servicio al cliente. *ducks*", "group_id": 965, "id": 1741907}, {"user_id": 22259, "stars": [], "topic_id": 42506, "date_created": 1311972999.9375911, "message": "@urysarabia Yo creo que va por donde te comentaba. Como yo lo veo, y simplificandolo bastante, hay tres caminos... Irte por PaaS, con algo como Heroku, PHPFog, Stable.IO, etc. donde no necesitas tener sysadmins, solo enfocarte en desarrollo, y la plataforma te va dando los recursos que necesitas, con la desventaja que tiene es que los costos son mayores (la operación y la ganancia de la plataforma) y no tienes nada de flexibilidad, pasarte a algo como Amazon EC2 donde aunque te dan muchas herramientas aun así necesitas personal que administre todo, con toda la flexibilidad que necesites, pero aun así un costo mayor, a pasarte a bare-metal, donde tienes que tener un equipo especializado que administre todo, pero con precios mucho mas competitivos.", "group_id": 965, "id": 1750934}, {"user_id": 26096, "stars": [{"date_created": 1311986915.0125811, "user_id": 26088}], "topic_id": 42506, "date_created": 1311981830.653502, "message": "LOL era sarcasmo. Internetworks es el gran ejemplo de lo que esta mal con el hosting en México. Otro dia les compartiré mi historia de terror. En lo personal uso dotcloud en un proyecto y linode en otro. Soy fan.", "group_id": 965, "id": 1751694}, {"user_id": 26088, "stars": [], "topic_id": 42506, "date_created": 1311986899.383004, "message": "Ah ya sabia XD #not", "group_id": 965, "id": 1751991}, {"user_id": 20521, "stars": [], "topic_id": 42506, "date_created": 1312242915.2801621, "message": "Yo tengo cosas el ep.io y un vps en @ideaslabs con cherokee y uwsgi", "group_id": 965, "id": 1770838}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312316971.5730679, "message": "A mi me encanta preocuparme por la inflaestructura que soportan mis aplicaciones.\n\nEn cuanto a servidores web, me encanta la versatilidad que ofrece nginx y cherokee sin embargo en ninguno de ellos he encontrado un IDS tan eficiente como el mod_security de apache sobre todo por que lo puedes ocupar tmb por cuestiones de SEO al generar estadísticas muy confiables de visitas que NO dependen de nuestra aplicación.\n\nActualmente ando buscando proveedor VPS, encontré uno muy tentador en cuanto el precio y las características que nos ofrecen:\n\nhttps://www.hostfolks.com/hosting/vps/\n\nTengo intensión de adquirir un paquete premium pero desconozco el servicio y tal ves a corto plazo sea mejor tener una prueba con un paquete Mini.\n\n¿Alguien que lo conozca?, algún feedback, gracias.", "group_id": 965, "id": 1779064}, {"user_id": 6327, "stars": [], "topic_id": 42506, "date_created": 1312321559.16535, "message": "Yo uso WebFaction. No tengo quejas. #rulztillnow", "group_id": 965, "id": 1779540}, {"user_id": 13545, "stars": [], "topic_id": 42506, "date_created": 1312337334.0953431, "message": "@fitorec una compañia de hosting con un certificado SSL vencido me da mala espina", "group_id": 965, "id": 1781427}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312356590.9344101, "message": "@ivanyv cierto, no se se me hizo bastante interesante el precio conveniencia, creo que seguire buscando vps, ¿algun servicio que recomiendes?", "group_id": 965, "id": 1782742}, {"user_id": 20521, "stars": [], "topic_id": 42506, "date_created": 1312382095.446806, "message": "@fitorec tienes ejemplos o algo de como usas el mod_security así?", "group_id": 965, "id": 1784526}, {"user_id": 13545, "stars": [], "topic_id": 42506, "date_created": 1312384208.1558261, "message": "@fitorec yo te recomiendo Linode. No es tan barato como HostFolks, pero lo he usado mucho tiempo y nunca he tenido problemas", "group_id": 965, "id": 1784788}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312390313.875777, "message": "@ivanyv Sí Linode es garantia y es un servicio que tenia en mente en un principio sin embargo no le llego al $ al menos que busque necesitare financiamiento y es lo que no quiero, por eso ando buscando alternativas.", "group_id": 965, "id": 1785555}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312391460.3769989, "message": "@nekrox tango como algún ejemplo elaborado no, pero hay varios en la nube que han subido usuarios, oficialmente mod_security ofrece una doc. muy buena y hay libros completos sobre este modulo de apache.\n\nLas configuraciones las haces con la una sintaxis es muy similar al modRewrite p.e. se me ocurre cachar las referencias de los visitantes en nuestra aplicación:", "group_id": 965, "id": 1785679}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312392533.1308801, "message": "@soska mas que interesado ¿acceso fullroot?", "group_id": 965, "id": 1785767}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312391523.6897681, "message": "<ifmodule mod_security.c>\n    # Activamos el filtrado para URL con codificacion unicode\n    SecFilterEngine On\n    SecFilterCheckURLEncoding On\n    SecFilterCheckUnicodeEncoding Off\n    # vamos a chacar las referencias y denegar el acceso para algunos\n    SecFilterSelective \"HTTP_REFERER\" \"(casino|porn|algun-otro)\" deny,nolog,status:500\n</ifmodule>", "group_id": 965, "id": 1785683}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312392983.160115, "message": "@soska Cool ¿donde contrato y donde puedo ver información detallada del servicio?, gracias", "group_id": 965, "id": 1785815}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312391615.871012, "message": "Esto lo podemos agregar en nuestro archivo apache2.conf o en nuestro .htaccess, reiniciamos el servidor apache(en caso de aver alterado apache2.conf) y probamos:", "group_id": 965, "id": 1785689}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312391632.738414, "message": "wget -d http://localhost/ --referer=http://www.porn.com\n\nwget -d http://localhost/ --referer=http://www.google.com\n", "group_id": 965, "id": 1785691}, {"user_id": 2946, "stars": [], "topic_id": 42506, "date_created": 1312392387.7136641, "message": "@fitorec Yo pago entre 10 y 15 dolares al mes por una instancia pequeña en Amazon. A ti eso no te sirve? Fake it 'til you make it ;)", "group_id": 965, "id": 1785756}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312392456.020472, "message": "Quizas nos interese dar acceso a todos y guardar en una bitacola para esto podemos establecer el parametro  y definimos la regla en:\n\nsecDefaultActivation 'log'\nsecFilterSelective 'HTTP_REFERER'  '*'\n\nNo recuerdo en donde por defecto guarda las bitacolas pero las puedes buscar en /usr/local/apache/ o también puedes establecer algun archivo en especifico con la regla secAditLog '/path/.../file.log';\n\nPor otra parte quizas nos interese denegar el acceso a determinada IP(o guardarla en un bitacola, que se yo), podríamos hacer algo como:\n\nsecFilterSelective 'REMOTE_ADDR' '[alguna IP ó rango]'\n\npuedes definir reglas para casi cualquier comportamiento en tu aplicacion web, y es aqui donde se recomienda insertar en el apache2.conf una inserccion masiva de reglas:\ninclude '/usr/local/apache/conf/security_rules/*.conf'", "group_id": 965, "id": 1785762}, {"user_id": 2946, "stars": [], "topic_id": 42506, "date_created": 1312392625.1681869, "message": "@fitorec yep. Escoges el tamaño de tu instancia el sistema operativo que quieras y la crea, full root y todo", "group_id": 965, "id": 1785780}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312392806.4182241, "message": "Esos mensajes del mod_security y todo este rollo iban respondiendo la pregunta de @nekrox, mejor comparto mas tarde un .diff de alguna configuración completa y/o algunos ejemplos mas específicos en caso que alguien a si lo quiera(¿les interesa un hilo?), para no llenar este hilo con este tema.", "group_id": 965, "id": 1785804}, {"user_id": 2946, "stars": [], "topic_id": 42506, "date_created": 1312395167.2338979, "message": "http://aws.amazon.com/ec2/", "group_id": 965, "id": 1786335}, {"user_id": 20146, "stars": [], "topic_id": 42506, "date_created": 1312496991.234478, "message": "gracias acabe de adquirir el servicio de 'hostfolks.com', por el precio creo que vale la pena probar el servicio, lo tendré a prueba un mes como servidor de producción, después les comento como me fue :¬),", "group_id": 965, "id": 1797626}, {"user_id": 27648, "stars": [], "topic_id": 42506, "date_created": 1318314230.086751, "message": "linode y Rackspace", "group_id": 965, "id": 2323219}]