[{"user_id": 13650, "stars": [], "topic_id": 33161, "date_created": 1304344222.096622, "message": "Reading through posts and topics for a while I sense there are a couple of perspectives that are (to some degree) common:\r\n\r\nTheory- Of course there is a perspective where we look at a “story” from the perspective of Dramatica Theory. This can go in several different directions. Creating a story FROM theory and looking at a story/story idea “reflecting” it against Theory.\r\n\r\nI will suggest that Armando in his book (Chapter 4) “Dramatica in Thirty Seconds” and the next chapter might give a good example of “from the perspective of Dramatica”. He illustrates with a very sketchy idea, takes it through Dramatica and makes it a story. The throry to some degree precedes the story.\r\n\r\nIt is possible to take this approach to a story using the program but it sure doesn't happen in thirty seconds if you faithfully utilize the query system <g>.\r\n\r\nThe other perspective seems to be taking a story idea, working on it and then passing it through a sieve of Dramatica. Some members seem to follow this process as they “re-write” (or consider rewrite) a story.\r\n\r\nI don't think any approach is wrong nor right. It is of course what works best for the author.", "group_id": 2515, "id": 883080}, {"user_id": 13650, "stars": [], "topic_id": 33161, "date_created": 1304344356.7427471, "message": "I've wondered if their is interest in learning more about \"theory\"?", "group_id": 2515, "id": 883117}, {"user_id": 13650, "stars": [], "topic_id": 33161, "date_created": 1304344258.771404, "message": "Since we all are more “comfortable” with the approach we've adopted (I'm reminded of “mother duck”) some of us find difficulty following the other methods. \r\n\r\nMY approach (which hasn't alleviated all brick walls that I'm beating my head on) is to attempt to REALLY UNDERSTAND the theory and method that Chris and Melanie developed. I sense their “method” has merit but haven't been able to make it my mindset. I still have to refer to the book. In addition, I've got Armando's book. \r\n\r\nIn addition, I'm using it to “fix” my current story. That means I seem to be continually uncovering rocks.", "group_id": 2515, "id": 883088}, {"user_id": 30951, "stars": [], "topic_id": 33161, "date_created": 1304345088.0830779, "message": "Interesting topic. I'm interested in learning more about the theory, mainly because I believe it is necessary to get the most from the software. \n\nOne thing I don't see myself doing, is writing a first draft before Dramatica. I know this has been suggested a few times a possible good approach. For me, knowing the structure / understanding of the story are good first is important. So I tend to put together a very basic (synopsis) view of the story, use that to storyform, and then add my ideas of the story as story points. \n\nHowever, the problem I encounter is exactly how I should approach Dramatica using this method. As I normally have a clear idea of the story and an extensive synopsis, I usually feel that I am doubling my work by filling in the story points as well. The reason for my topic about Plot Progression was to see if I could get a better link between developing a story idea, creating a synopsis, then with Dramatica creating a storyform, and then using Dramatica to ensure the plot / structure are ok before the first draft.\n\nI am experimenting taking a synopsis and dividing it up into the appropriate areas of the plot progression (having broken the synopsis down into 7 parts), having already created the storyform, and then adjusting the various plot progression signposts and journeys to better match the suggested focus given by Dramatica.", "group_id": 2515, "id": 883294}, {"user_id": 7664, "stars": [], "topic_id": 33161, "date_created": 1304444012.8252251, "message": "@mp131 My personal belief is that story must be more important than theory. But I'm not sure how this works in practice. If I need a nuclear bomb, the bomb is more important than the physics... but I'm not going to get very far if I don't understand the physics.\n\nEither way, I don't think I understand the theory at all. Understanding the theory (to me) would mean understanding how one appreciation (female mental sex) affects another (swap it, spin it, carry it, leave it, etc.) Have Chris and Melanie even released that information?\n\nSo, what I do, is focus on the building blocks they provide. What does a Benchmark mean? How is it used? If that's what you mean by studying the theory more, I'm all in.", "group_id": 2515, "id": 900640}, {"user_id": 7664, "stars": [], "topic_id": 33161, "date_created": 1304444061.6348231, "message": "@Mikeaja I find that I have to double my work a lot too, but I found that to be true even before Dram. I would have an outline, a bunch of cards, some scritchy scratch, and then I'd have to get it all organized...", "group_id": 2515, "id": 900644}, {"user_id": 13650, "stars": [], "topic_id": 33161, "date_created": 1304523693.1393521, "message": "Benchmark- \"the indicator of the depth of the throughline's difficulties- THe Benchmark is the measuring stick which is used to judge progress in whichever throughline it is operating in- Dramatica, A new Theory of Story p. 282", "group_id": 2515, "id": 914494}, {"user_id": 7664, "stars": [], "topic_id": 33161, "date_created": 1304527650.366812, "message": "That was an example.", "group_id": 2515, "id": 915536}, {"user_id": 30951, "stars": [], "topic_id": 33161, "date_created": 1304541054.6535189, "message": "An interesting example though because I think it shows there is a gap between understanding what the theory says, and seeing that in definitive terms with a story. Using the Benchmark example, the theory seems clear enough. But when in the context of a particular story, it could be difficult to see it or see how it is used.", "group_id": 2515, "id": 919441}, {"user_id": 7645, "stars": [], "topic_id": 33161, "date_created": 1304541369.296752, "message": "Cool Chris note on the Benchmark - http://storyfanatic.com/notes/clarification-on-the-benchmark-of-a-throughline", "group_id": 2515, "id": 919487}, {"user_id": 7664, "stars": [], "topic_id": 33161, "date_created": 1304544987.8227, "message": "Where is that note from?", "group_id": 2515, "id": 920336}, {"user_id": 7645, "stars": [], "topic_id": 33161, "date_created": 1304547600.799916, "message": "Click on the title on the note page -- it'll take you to the screenplay forums.", "group_id": 2515, "id": 920764}, {"user_id": 13109, "stars": [], "topic_id": 33161, "date_created": 1306331533.16255, "message": "I am finding that trying to understand the theory is a fantastic way to procrastinate on actually writing the story.  In my case, Theory definitely comes before No Story.", "group_id": 2515, "id": 1178216}]