[{"user_id": 16858, "stars": [], "topic_id": 42377, "date_created": 1311197432.404639, "message": "okay, probably more the plain old python now that I think of it but the django crowd is so responsive -- anyway:  on mac, is anyone seeing segfault issue with iPython and tab completion?  It works for me for a few command but eventually just aborts in an ugly manner and drops me back to my command prompt...anyone?  its killing me because I love the tab completion of iPython on my django models, etc", "group_id": 81, "id": 1685022}, {"user_id": 2010, "stars": [], "topic_id": 42377, "date_created": 1311200151.8721941, "message": "i solved this issue by reinstalling readline and python packages. if you are using homebrew, don't forget to check missing dependencies with `brew missing` command.", "group_id": 81, "id": 1685304}, {"user_id": 1398, "stars": [], "topic_id": 42377, "date_created": 1311225812.252049, "message": "bpython over ipython anyday. Runs better and doesn't glitch at all on the mac the way ipython seems to do.", "group_id": 81, "id": 1687390}, {"user_id": 26888, "stars": [], "topic_id": 42377, "date_created": 1311227537.8439181, "message": "got tab issues with python on both linux and osx. I'll give python a try, thanks pydanny for the suggestion", "group_id": 81, "id": 1687497}, {"user_id": 15988, "stars": [], "topic_id": 42377, "date_created": 1311302720.2742839, "message": "But I have to do it for every virtualenv because I like --no-site-packages", "group_id": 81, "id": 1694490}, {"user_id": 15988, "stars": [], "topic_id": 42377, "date_created": 1311302709.7688129, "message": "I had this exact issue using stock Python on Snow Leopard, with virtualenv --no-site-packages and pip. What's interesting is that if you try to \"pip install readline\" it doesn't find the right package to install so IPython still uses the libedit. Doing \"easy_install readline\" within the virtualenv fixed it for me.", "group_id": 81, "id": 1694488}, {"user_id": 1822, "stars": [], "topic_id": 42377, "date_created": 1311354760.728106, "message": "thanks @pydanny for the bpython tip, seems to be more of what I've been looking for out of iPython. For those that are happy to have bpython in global site packages, this line (to be aliased) works for firing up bpython within a virtualenv: \n\nPYTHONPATH=`which bpython` `which python` -m bpython.cli", "group_id": 81, "id": 1699946}, {"user_id": 16858, "stars": [], "topic_id": 42377, "date_created": 1311378814.2907181, "message": "Awesome replies guys.  Have some options now :)", "group_id": 81, "id": 1702305}]