[{"user_id": 5136, "stars": [], "topic_id": 15621, "date_created": 1301237519.1591451, "message": "Hi! \nI am the creator of Challengein \"the board game of the modern age\", an iPhone app.\n\nWe've create the modern version of the board games, but where the user choose the Topic to play with. For example users can choose Technology as topic, but also Lady Gaga, NBA, Twilight, etc.\n\nWe're trying to create other Topics and we want absolutely to create the XXX pack.\nWe're looking for partners who are expert in this Topic, who will create the questions for that game.\nThe user will get the public paternity, or a revenue share if agree to sell it.\n\nIf you want to try the app http://challengein.com and use \"HINIIB\" as invitation code (during the sign up process).\n\nIf you're interested to become partner or if you have any questions get in touch with me at info@challengein.com !\n\nThanks,\nClaudio", "group_id": 7294, "id": 451269}, {"user_id": 25063, "stars": [{"date_created": 1301257456.4209571, "user_id": 5136}], "topic_id": 15621, "date_created": 1301248114.5652139, "message": "Meaning I'd love to be a part of this creation if you want. Email me at murakov.the.great@gmail.com if you're interested!", "group_id": 7294, "id": 452232}, {"user_id": 25063, "stars": [], "topic_id": 15621, "date_created": 1301248022.7328069, "message": "Hey! I can't say I'm the kind of expert that's read all the expanded universe books or anything like that, but I've spent probably a few days worth of hours reading lore, etc. on Wookiepedia and I spent over 3 years playing a Star Wars DnD game, giving me a wide breadth of knowledge of the universe. Also I've seen the movies and most of the miniseries more times than I can count.", "group_id": 7294, "id": 452227}, {"user_id": 5136, "stars": [], "topic_id": 15621, "date_created": 1301257494.382622, "message": "Cool, we can talk about it. Tomorrow I'll mail you", "group_id": 7294, "id": 452646}, {"user_id": 5136, "stars": [], "topic_id": 15621, "date_created": 1301343748.1368711, "message": "Hy Murakov, I've sent you the email with the proposal. I'm waiting your news", "group_id": 7294, "id": 461834}]