[{"user_id": 5066, "stars": [], "topic_id": 3586, "date_created": 1297348264.470042, "message": "If my topic's title is a single Hebrew word, it works fine (ex: \"בדיקה\"). But if my title has more than one word, meaning it contains a space, then I get a \"page not found\" error page (ex: \"נושא חדש\").", "group_id": 88, "id": 69714}, {"user_id": 5066, "stars": [], "topic_id": 3586, "date_created": 1297348603.264359, "message": "@zerok Well if you're right, it sucks :) I want my group member to be able to communicate in Hebrew only.", "group_id": 88, "id": 69814}, {"user_id": 4893, "stars": [{"date_created": 1297363935.585505, "user_id": 224}], "topic_id": 3586, "date_created": 1297348471.5152841, "message": "Could this perhaps have something to do with the slugify-implementation of the title? For instance if I create a topic with the German umlauts \"äß\" it would get slugified as \"a\". So there seems to be no replacement for \"ß\" and I can only imagine there are simply no replacements yet for a lot of other characters :-)", "group_id": 88, "id": 69775}, {"user_id": 224, "stars": [], "topic_id": 3586, "date_created": 1297363983.494647, "message": "oh man, I used to QA Movable Type, and I remember so many bugs that happened with non-english characters and creating permalinks... it was a total snakepit", "group_id": 88, "id": 72597}, {"user_id": 1516, "stars": [], "topic_id": 3586, "date_created": 1297363911.585849, "message": "there was a bug with a topic with only \"1\" too, so I assume that's related", "group_id": 88, "id": 72590}, {"user_id": 4941, "stars": [], "topic_id": 3586, "date_created": 1297618428.4691429, "message": "From own painful experice on a project, I can definitely recommend dealing with transliteration of non-ascii characters asap. I don't know about python, but for ruby there's a port of the perl unidecode library that handles transliterations from every charater set very well.", "group_id": 88, "id": 92279}]