[{"user_id": 7664, "stars": [], "topic_id": 40361, "date_created": 1308961439.0830281, "message": "@Chris_Huntley, I've always assumed that the world at the end of a story (specifically a Good/Success story) looked like the theme browser -- all at rest -- while any other outcome was still out of whack. \n\nAnd, that Failure/Bad stories were more out of whack. (Is there some measure of degree? Can things be more or less messed up?)\n\nI'm not sure it has a practical application to how I work, but is my assumption right?", "group_id": 2515, "id": 1481690}, {"user_id": 10814, "stars": [], "topic_id": 40361, "date_created": 1309016005.0038021, "message": "Even Failure/Bad stories can have a balance of sort.  They tend not to be stable, but they can have a balanced inequity.  To use the teeter-totter example again, the teeter-totter need not be completely even to be in balance.  Balance just puts it in a position what is stable rather than shifting back and forth.", "group_id": 2515, "id": 1484471}, {"user_id": 10814, "stars": [], "topic_id": 40361, "date_created": 1309015884.8577399, "message": "The \"world\" at the end of a story is in BALANCE (Success/Good), but not at rest.  There is always inequity when you have multiple viewpoints because each perspective sees privileged information, as well as blind spots in which information is not accessible.  That said, it can be in balance, just as a teeter-totter can find equilibrium.  Equilibrium, however, is not unity.", "group_id": 2515, "id": 1484465}, {"user_id": 10814, "stars": [], "topic_id": 40361, "date_created": 1309016094.4995191, "message": "Oops.  Balance just puts it in a position THAT is stable rather than shifting back and forth.", "group_id": 2515, "id": 1484473}, {"user_id": 7664, "stars": [], "topic_id": 40361, "date_created": 1309025310.290524, "message": "To put an example here: \n\nTwo countries that hate each other go to war over something petty, which forces both sides to develop new armaments up to the point where a sustained war would assure mutual destruction. The war ends because of this (the invading country has failed), the hatred still exists (everyone feels bad) but the balance has been restored.", "group_id": 2515, "id": 1485023}, {"user_id": 10814, "stars": [], "topic_id": 40361, "date_created": 1309062417.2499149, "message": "Works for me.", "group_id": 2515, "id": 1487235}, {"user_id": 30951, "stars": [], "topic_id": 40361, "date_created": 1309065881.697932, "message": "So we are not saying that we see the storyform as everything resolved and only the values left at the end of the story, but values representing the whole story, knowing how it began and knowing how it ends? Could that be another way of describing it?", "group_id": 2515, "id": 1487350}, {"user_id": 10814, "stars": [], "topic_id": 40361, "date_created": 1309095109.0928249, "message": "Yes.", "group_id": 2515, "id": 1488824}]