[{"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301612372.7144401, "message": "Yo quiero saber cual startups o similares, que trabajes en. Cuentanos tus ideas, experiencia, etc!", "group_id": 965, "id": 497409}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301614507.6196611, "message": "www.norecordlabel.net quiero que se convierta en startup. Pero por ahora sigue siendo un proyecto.", "group_id": 965, "id": 497658}, {"user_id": 26084, "stars": [{"date_created": 1301684007.223258, "user_id": 24160}], "topic_id": 16612, "date_created": 1301621914.197078, "message": "http://babker.com es un agendador inteligente, tu creas tu listado de personas con las que posiblemente quieras reunirte, les envias una invitacion y el sistema se encarga del resto (ver quien si puede, avisarte, avisarle los detalles, etc...) si no puede uno, automaticamente se va al que sigue y demas.", "group_id": 965, "id": 498372}, {"user_id": 26088, "stars": [{"date_created": 1301684010.0468681, "user_id": 24160}], "topic_id": 16612, "date_created": 1301624234.3093359, "message": "we are working in www.bizspread.com we want it to be THE business directory, is currently in spanish but will be global, we want to achieve volume first in order to achieve revenue, sorry for my english", "group_id": 965, "id": 498596}, {"user_id": 25716, "stars": [{"date_created": 1301684011.431747, "user_id": 24160}], "topic_id": 16612, "date_created": 1301630814.5925989, "message": "Muy bien, bueno calidad aqui :)\n@zodman es como iTunes? Que es la diferencia?\n@reymundolopez interesante, como es tu business model? Si quieres compartir :D\n@keoz looks cool, but I really hate silverlight jajaja\n\nUno startup de mi: Live Chat http://csupport.dk/", "group_id": 965, "id": 499316}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301637720.0713921, "message": "@reymundolopez está en el mismo espacio que https://www.appointmentreminder.org/ ? Si sí, he escuchado que es un buen negocio. (btw, como hiciste un salto de linea en tu anterior post?)", "group_id": 965, "id": 499757}, {"user_id": 26084, "stars": [], "topic_id": 16612, "date_created": 1301636213.9599619, "message": "@dsch right now we are still on closed beta, but we are thinking to use a subscription model including more functionality, personalize how many notifications via SMS you want, etc...\n\nChat Support looks good, integration with the most popular CMS and e-commerce systems, you are focused mostly on english costumers right?", "group_id": 965, "id": 499700}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301638371.712503, "message": "@dsch wow. csupport.dk is awesome.", "group_id": 965, "id": 499771}, {"user_id": 26084, "stars": [], "topic_id": 16612, "date_created": 1301662426.6953709, "message": "@soska alt + enter\n\nEs parecido, pero AppReminder solo te manda recordatorios de una cita, nosotros manejamos las citas, un ejemplo sencillo:\n\nSi quieres una niñera para el día viernes por la tarde, normalmente tienes (o en su defecto las madres) una lista de posibles niñeras para ir a cuidar al pequeno, en lugar de estar buscando número por número, hablarles y ver la disponibilidad de cada una, Babker se encarga de ello, tu solo crearás un listado con las posibles niñeras, los ordenaras de acuerdo a tu criterio y babker se encargará de contactarlas, preguntarles si pueden asistir y notificarte a tí quien puede o si nadie te contesto.", "group_id": 965, "id": 501033}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301674275.9119699, "message": "como itunes mmm pues algo parecido no queremos ser itunes simplemente vender musica independiente. La diferencia con itunes es que no necesitas tarjeta de credito para comprar. Tampoco hay planes de solamente ser una tienda la primera face es ser una tienda y darle dinero a las bandas por su musica.", "group_id": 965, "id": 502975}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301674295.0215089, "message": "Ahhh y nosotros si de decimos quien te compro!", "group_id": 965, "id": 502978}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301674324.8974011, "message": "para que puedas hacer tu mail-list de groopy's", "group_id": 965, "id": 502981}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301674415.3228581, "message": "@dsch sobre tu chat echale una revisada a http://www.igniterealtime.org/index.jsp a sus productos.", "group_id": 965, "id": 503000}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301675136.310647, "message": "a ver si les puedo mostrar un demo ... de la aplicacion esta en django.", "group_id": 965, "id": 503113}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301675115.842649, "message": "@soska Esa es una de tantas ideas tengo ando estancado tratando de resolver el payment gateway q es dinero mail, Para ya liberar la aplicacion, ya tenemos amarradas 20 bandas de guadalajara. Pero si! esa idea ya esta cocinando de echo las tarjetas de pago ya estan lista http://toditocash.com/ es un servicio de pago por medio de tarjetas, y esas las vamos a regalar. Y tambien a implementar.", "group_id": 965, "id": 503109}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301675593.6834431, "message": "@soska gracias :)", "group_id": 965, "id": 503202}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301675586.04338, "message": "@reymundolopez Ah, actually I was thinking more the economical aspect, how you will profit on it. Actually we focus very little on english speaking customers on cSupport. We push into latin america, especially brazil at the moment. I just need the spanish translation done and Mexico will get to see cSupport also :D", "group_id": 965, "id": 503201}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301674744.1277299, "message": "@zodman #idea: tarjetas de regalo o prepago que valgan por una canción o EP. La banda las ordena en tu sitio y se las mandas con su logo y números de serie. Ellos pueden venderlas/regalarlas en los toquines (en lugar de cds físicos) y cuando el fan cambia la tarjeta, entra a un mailing-list lo cual es súper valioso para la banda. Me gusta tanto esta idea que si no la haces tú la hago yo :P (Solía tocar en una banda y hubiera amado tener ésto)", "group_id": 965, "id": 503051}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1301676144.6678669, "message": "@dsch ok ok", "group_id": 965, "id": 503304}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301676009.7999289, "message": "@zodman interesante, buena suerte :) gracias por tu link! ...Pero nos no queramos usar XMPP ahora, en el futuro tal vez! Tenemos un muy estricto paradigma de desarrollo en la actualidad, para ofrecer un live chat eficiente.", "group_id": 965, "id": 503298}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301680531.2442901, "message": "El uso de Silverlight es un gran NO-NO. si tu producto no puede funcionar en dispositivos moviles(sin plugins) es inutil", "group_id": 965, "id": 503915}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301681415.12169, "message": "@levhita si, yo prefiero jquery y HTML5. Flash, Silverlight, etc, etc es muy antiguo por ahora :)", "group_id": 965, "id": 504018}, {"user_id": 26203, "stars": [], "topic_id": 16612, "date_created": 1301683510.882911, "message": "Definitivamente, ahora Flash/Flex, Silverlight han quedado en la orilla en cuanto desarrollo en móviles se refiere, incluso hasta en aplicaciones para web, solo en casos muy particulares estos tendrían alguna ventaja sobre HTML5 y JS y miren que lo digo como amante de Flex/Flash.", "group_id": 965, "id": 504324}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301684318.1503439, "message": "@soska Uste no se preocupe, para eso estamos los trolls.", "group_id": 965, "id": 504487}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301683952.7884171, "message": "La mejor ayuda como comunidad que podemos aportar es probar la pasión del emprendedor por su producto, si tiene pasión, encontrará formas alternativas de solucionar los problemas, mirara el problema delante de el con otros ojos y posiblemente encuentre modelos de negocios y soluciones técnicas más viables.\n\nEn cambio si no soporta la crítica, posiblemente no iba a llegar muy lejos en primer lugar.", "group_id": 965, "id": 504382}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301684094.7380321, "message": "@levhita Estoy de acuerdo contigo. Pero da sabe qué lastimar los sentimientos de la gente.", "group_id": 965, "id": 504420}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301683812.998275, "message": "Me parece esencial ser despiadados con las ideas, el lamebotismo no ayuda en nada para que los productos mejoren, es mejor encontrar todos los inconvenientes posibles antes de iniciar un proyecto.Y no por ser OGTs si no para mejorar, realmente para www.bizspread.com era necesario Silverlight? valió la pena el mercado que perdió? vs las ganancias en poder de procesamiento?", "group_id": 965, "id": 504368}, {"user_id": 6541, "stars": [], "topic_id": 16612, "date_created": 1301688065.599261, "message": "@dsch si no quieres usar XMPP usa MEPP - https://github.com/jyr/MEPP :)", "group_id": 965, "id": 505145}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301688352.3724949, "message": "@jyr MEPP es un evironmente no? XMPP es un protocol standard jeje, y soy contento con MAMP :)", "group_id": 965, "id": 505198}, {"user_id": 6541, "stars": [], "topic_id": 16612, "date_created": 1301688483.334811, "message": "@dsch claro, me guie solo por las abreviaturas y no he dormido del todo ademas de eso.", "group_id": 965, "id": 505226}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301688726.9205539, "message": "@jyr Te confundiste con XAMP :P, XMPP es basicamente Jabber :P (creo)", "group_id": 965, "id": 505269}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301702459.4664459, "message": "@reymundolopez en verdad, yo tengo http://csupport.com.mx ahora jaja, yo promover en pocos semanas cuando yo tengo la pagina en espanol :)", "group_id": 965, "id": 506849}, {"user_id": 26088, "stars": [], "topic_id": 16612, "date_created": 1301708789.982475, "message": "Lo siento lo puse de corrido como lo pensaba tienes razón.", "group_id": 965, "id": 507166}, {"user_id": 26088, "stars": [], "topic_id": 16612, "date_created": 1301708086.018146, "message": "Ah hablaron de bizspread XD, bueno yo pienso Silverlight/Flash, HTML5 y JS :) al final todas son tecnologias que se puede aprovechar sus ventajas, nosotros le apostamos a esto porque? pues por que no, queremos hacerlo de una forma distinta a lo que se viene haciendo, hacerlo en web tradicional caeriamos en un olx.com, o un directorio de \"tuxminicipio.com\" o como dijo una vez andres barreto en SG Emprende un directorio de taquerias (a esa vez dolio pero no nos fuimos para abajo), bueno queremos hacer mucho mas, entonces en teoria se puede hacer más con RIAs en cuestion de presentación y experiencia de usuario, si lo que hicimos en bizspread se pudiera hacer en HTML 5 con gusto (y supieramos como) :) queremos cambiar radicalmente a los \"yellow pages\" pero no queremos ser un simple yellow pages, queremos que todo mundo lo use y le sea más util que eso, ahora bizspread no es solo la aplicación, tenemos muchos planes para usar los datos de distinta forma, usando el API por ejemplo otros podran hacer sus implementaciones en lo que se les pegue la gana, y pues sabemos mas Silverlight que html y js asi que si nos esperamos a aprender y a ver como le hacemos pues que flojera pero tambien no esta descartado tal vez una version alterna, se que perdemos mercado pero confiamos mucho en este proyecto y bueno ya hay gente registrada que le interesa y sabemos que sera mas dificil pero no importa vamos a echarle ganas, ahora hacerlo en moviles bueno consumo un servicio y te pongo una lista con un texto de busqueda listo :) lo vamos hacer tambien y buscar abstraer la experiencia a moviles tanto como se pueda dificil pero no imposible, por lo pronto queremos ir ganando volumen y entre mas registros mejor, ahi vamos y por supuesto que son bienvenidas todas las criticas y sugerencias no nos espantan y sirven para mejorar y se los agradecemos mientras sigan siendo objetivas y serias", "group_id": 965, "id": 507151}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301708643.6321261, "message": "Oye, mira mira mira si presionas shift + enter \npone un salto de linea. \nY otra vez, mira mira.\n\nHasta puedes poner 2 de corrido para que se forme un párrafo.\nw\no\nw\n.\n\nLa expresión clara es esencial para las comunicaciones humanas.", "group_id": 965, "id": 507162}, {"user_id": 25609, "stars": [], "topic_id": 16612, "date_created": 1301708774.8558209, "message": "Por cierto alguien sabe que es lo que dispara el trigger para el <pre>?", "group_id": 965, "id": 507165}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1301710563.9753029, "message": "@levhita copy-paste creo", "group_id": 965, "id": 507272}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1301723856.9612131, "message": "@keoz LOL tu eras el chavo del directorio de taquerías? Todavía me acuerdo de esa pedrada. :P\n\nNo es mala onda lo que decimos de silverlight, pero la distribución es una cosa muy importante para tu startup y requerir Silverlight es una barrera de entrada quizá innecesaria. Pero no nos creas a nosotros, lo que tienes que hacer es probar tus suposiciones con un producto minimo viable (MVP) antes de que inviertas muchas, muchas horas creando un producto visualmente increible, tecnológicamente super avanzado pero que quizá nadie quiere/necesita.\n\nTe recomiendo ver este video de Eric Ries http://ecorner.stanford.edu/authorMaterialInfo.html?mid=2273 donde platica la historia de IMVU y como un equipo de estrellas crearon un producto tecnológicamente muy avanzado pero que nadie quería. De ahí surgió la filosofía de Lean Startups.\n\nSaludos!\n\n(Gracias Levhita por el tip del salto de línea)", "group_id": 965, "id": 507644}, {"user_id": 26088, "stars": [], "topic_id": 16612, "date_created": 1301729167.917088, "message": "@soska je creo el no hablaba de nosotros (espero!) je pero si fue auch y si tienes toda la razon aunque lo que aqui hicimos es realmente un MVP y estamos viendo como funciona analizando los analytics y como llegan a bizspread los que se han inscrito y que podemos aprender para mejorar. \nNo le metimos mucho precisamente por eso ni base de datos usa aun :S je pero pues tenemos que intentarlo y ver como evoluciona salu2", "group_id": 965, "id": 507738}, {"user_id": 20521, "stars": [], "topic_id": 16612, "date_created": 1302043965.0010469, "message": "No tienes que registrarte en el SAT para eso?", "group_id": 965, "id": 549454}, {"user_id": 27178, "stars": [], "topic_id": 16612, "date_created": 1302042581.4138801, "message": "@khreez y va ser proveedor autorizado por el SAT o esta en tramite", "group_id": 965, "id": 549092}, {"user_id": 18131, "stars": [], "topic_id": 16612, "date_created": 1302042318.7240789, "message": "En un par de semanas vamos a lanzar el beta de http://indvalid.com, la idea es tener una herramienta que facilite la validación de facturas electrónicas, se agradece cualquier retroalimentación", "group_id": 965, "id": 549049}, {"user_id": 18131, "stars": [], "topic_id": 16612, "date_created": 1302043912.669004, "message": "no pensamos ser proveedores (PAC), ya que sólo vamos a validar facturas y notificar el reporte de la validación, somos una alternativa al validador del SAT y una herramienta maquina-maquina (API) para validar volúmenes de facturas", "group_id": 965, "id": 549437}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302112701.9006729, "message": "Y como experiencia, ha sido todo un reto utilizar tecnologías nuevas como nosql (mongodb y redis), processing queues con beanstalkd, Amazon EC2, etc.", "group_id": 965, "id": 562230}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1302113281.023509, "message": "@luiscosio @khreez cool, buena suerte, y por favor diganos mas, cuando ambos ha ganado market share :D", "group_id": 965, "id": 562364}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302112632.412689, "message": "En una semana lanzamos al público nuestro startup, y estamos ahorita estrenando sitio nuevo: http://www.madeinsocial.com/.", "group_id": 965, "id": 562214}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302115023.2983401, "message": "bien ahi!", "group_id": 965, "id": 562760}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1302131924.605911, "message": "@luiscosio tengo una pregunta; por que ustedes utilizar noSQL?", "group_id": 965, "id": 566145}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302132975.0915501, "message": "@dsch Por que la estructura de la información que almacenamos no esta definida, cambia mucho y es muy dificil saber como va a cambiar. Lo que un día tiene dos o tres campos, puede que mañana tenga 15... Y es muy dificil en bases de datos como MySQL lograr cambios de una estructura de tabla tan rigida.", "group_id": 965, "id": 566228}, {"user_id": 10227, "stars": [], "topic_id": 16612, "date_created": 1302142918.9278619, "message": "@luiscosio y que tal el performance, es mejor q el de MySQL ? y q problemas tuvieron al optar por MongoDB ???", "group_id": 965, "id": 568443}, {"user_id": 6541, "stars": [], "topic_id": 16612, "date_created": 1302143079.768038, "message": "otra opcion a mysql es percona.com de entrada ofrece XtraBackup como GPL es la alternativa a InnoDB Hot Backup", "group_id": 965, "id": 568513}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302150473.4715569, "message": "@mishudark Si necesitas ayuda en algo, enviame un correo a luis@madeinsocial.com", "group_id": 965, "id": 571132}, {"user_id": 10227, "stars": [], "topic_id": 16612, "date_created": 1302150237.5998919, "message": "@luiscosio disculpa la pregunta, pero q son shards ?", "group_id": 965, "id": 571101}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1302151071.4013021, "message": "@luiscosio Cual cambios? Yo no entiendo, creo un ejemplo seria aclarar este :)", "group_id": 965, "id": 571301}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302150396.8439591, "message": "@mishudark http://www.mongodb.org/display/DOCS/Sharding+Introduction - Mejor explicado no se puede :)", "group_id": 965, "id": 571123}, {"user_id": 22259, "stars": [], "topic_id": 16612, "date_created": 1302149574.734216, "message": "@mishudark El performance es excelente, y me gusta mucho el crecimiento en horizontal con los shards. El problema mayor que tuvimos es el cambio de paradigma y tecnología.", "group_id": 965, "id": 571026}, {"user_id": 10227, "stars": [], "topic_id": 16612, "date_created": 1302150428.6451709, "message": "@luiscosio gracias, esto me servirá para un desarrollo q quiero hacer", "group_id": 965, "id": 571126}, {"user_id": 10227, "stars": [], "topic_id": 16612, "date_created": 1302150779.9320581, "message": "@luiscosio muchas gracias, seguro me podras sacar de algunas dudas", "group_id": 965, "id": 571188}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302154830.1012101, "message": "cambios por campos ?", "group_id": 965, "id": 572132}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302154843.953788, "message": "en django tenemos south que es una herramienta de migracion de datos", "group_id": 965, "id": 572134}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302154859.6945119, "message": "RoR tambien tiene su implementación para migracion de datos.", "group_id": 965, "id": 572136}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302154832.394223, "message": "@soska yo hice algo del tipo, un experimento, imprimimos tarjetas y todo, con una banda, y la respuesta fue ..... cero descargas ....", "group_id": 965, "id": 572133}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302155458.0221779, "message": "@soska si, tal vez la muestra fue demasiado chica, solo 100 tarjetas. Nos costó 4 pesos imprimir cada una, las bandas con las que platicamos no querían pagar por ellas así que se las regalamos. Vamos a hacer más experimentos, la verdad yo lo sigo viendo como experimento, mi app está en appengine checa el ejemplo http://bavamusic.appspot.com/banda?key=agliYXZhbXVzaWNyCwsSBUJhbmRhGAEM", "group_id": 965, "id": 572184}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1302155246.259577, "message": "@kakler En serio? Mhmm que raro, la gente ama las cosas grátis. A lo mejor hay que reducir la fricción?", "group_id": 965, "id": 572167}, {"user_id": 6541, "stars": [], "topic_id": 16612, "date_created": 1302155529.7638769, "message": "@kakler estas en el mismo proyecto que @zodman?", "group_id": 965, "id": 572190}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302155995.8710699, "message": "@jyr nop, tenemos la misma idea al mismo tiempo ....", "group_id": 965, "id": 572224}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302709104.664712, "message": "Parece que nuestra idea está evolucionando hacia una plataforma de promoción para todo tipo de creadores no solo bandas e incluye una solución más completa que solamente las tarjetas de descarga, también widgets y elementos sociales.", "group_id": 965, "id": 666405}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302790891.3279669, "message": "@kakler topspinmedia.com :S", "group_id": 965, "id": 685298}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302837466.9304299, "message": "está muy bueno el video explicativo jaja", "group_id": 965, "id": 694831}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302837289.379427, "message": "@zodman buena fuente de inspiración, gracias por el link", "group_id": 965, "id": 694799}, {"user_id": 26085, "stars": [], "topic_id": 16612, "date_created": 1302879139.097635, "message": "convert fans into customers... suena bien feo", "group_id": 965, "id": 700955}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302881857.6156039, "message": "@kakler como era la idea osea: creaste un sitio para descargas de musica por medio de tarjetas ?¿ o como ?", "group_id": 965, "id": 701636}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302883638.170666, "message": "GLOOP. http://www.gloop.mx Es el sitio donde tus Local Shops favoritas publican catálogos de los productos que tienen en venta ;) ...estoy en la etapa de su promoción. El lanzamiento oficial será el 27 de abril.", "group_id": 965, "id": 701906}, {"user_id": 3665, "stars": [], "topic_id": 16612, "date_created": 1302884722.3020041, "message": "@emmanuelcantu son necesarios todos los datos que pides para registrarte?", "group_id": 965, "id": 702136}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302897596.9608819, "message": "@emmanuelcantu Por qué pides un registro antes de dejarnos conocer el valor de tu producto? El registro es algo que puedes dejar para después; una vez que el usuario ya encontró valor y quiere ejecutar una acción cuyo cumplimento requiere sus datos. Te sugiero ampliamente que hagas una modificación en este sentido.", "group_id": 965, "id": 704710}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302903363.014369, "message": "@cesarsalazar Agradezco tu retroalimentación. El lanzamiento oficial de GLOOP es el 27 de abril. Si gustas puedes esperar hasta ese día para ver el valor que GLOOP te puede ofrecer. El registro es para las personas que están interesadas en recibir un Pre-view. Requerimos la edad porque los menores no pueden participar en el sorteo. Y la ciudad porque sí, GLOOP es algo al estilo de Groupon, Yipit, etc.", "group_id": 965, "id": 705645}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302900792.2229609, "message": "@emmanuelcantu define local shop ...", "group_id": 965, "id": 705235}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302900863.3584659, "message": "q no entendi :S", "group_id": 965, "id": 705260}, {"user_id": 6541, "stars": [{"date_created": 1302906401.6199369, "user_id": 24160}, {"date_created": 1303166827.4771559, "user_id": 20146}], "topic_id": 16612, "date_created": 1302904203.815295, "message": "@emmanuelcantu no caigas en el modo \"iwiks\", la intencion de los topicos en convore es ayudar para no tener fallas el dia del lanzamiento de \"x\" producto para evitar se hable de eso despues y no del valor de GLOOP. Ahora, el sorteo no te garantiza para nada que una vez que los gane regrese al sitio.", "group_id": 965, "id": 705707}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302904630.508652, "message": "Fui dirigido aquí por http://mexican.vc Creo que terminé en el lugar equivocado.", "group_id": 965, "id": 705724}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302902713.375169, "message": "@Krator Sí, es necesario que proporciones los 5 datos que te pedimos.", "group_id": 965, "id": 705502}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302902944.9403279, "message": "@emmanuelcantu Nombre, apellido y edad? Podrías explicarnos por qué? Tal vez nos estamos perdiendo de algo pero pareciera que lo que requieres, si es que lo requieres, es el correo electrónico y el estado/ciudad (al estilo de Groupon)", "group_id": 965, "id": 705592}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302903087.4054899, "message": "@zodman Local Shop significa tienda local", "group_id": 965, "id": 705618}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302903385.472069, "message": ":o", "group_id": 965, "id": 705646}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302903729.3069539, "message": "Sin embargo solo pueden participar en el sorteo las personas que tengan domicilio en Altamira, Tampico o Cd. Madero.", "group_id": 965, "id": 705676}, {"user_id": 3665, "stars": [{"date_created": 1302906397.8074491, "user_id": 24160}, {"date_created": 1303253391.3054681, "user_id": 3107}], "topic_id": 16612, "date_created": 1302904644.233027, "message": "@emmanuelcantu creo que se perdió el sentido de startup con lo de una rifa. ¿qué sería mejor, ser recordado como los que regalan cosas o por los que presentan una nueva solución?", "group_id": 965, "id": 705725}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302905829.850831, "message": "local shop .... esta ahi arriba!", "group_id": 965, "id": 705911}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302906131.8984029, "message": "Ah! entonces no le falta información, sino que es posible que no todas las personas la entiendan. Está bien porque va dirigido a un nicho de mercado.", "group_id": 965, "id": 705953}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302904996.909977, "message": "lee \"¿ Que es ?\"", "group_id": 965, "id": 705771}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302904483.2663691, "message": "@cesarsalazar El motivo por el que compartí mi Startup no fue para promocionarla en este foro. Antes de registrarte debes de leer la condiciones del sorteo como está marcado y en la condicones del sorteo menciona que debes de tener domicilio en alguna de estas tres ciudades.", "group_id": 965, "id": 705722}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302903619.304368, "message": "@cesarsalazar Me faltó mencionar que pedimos el Nombre y los Apellidos también por motivo del sorteo y el email porque será el dato que se introducirá a nuestro programa que escogerá al ganador.", "group_id": 965, "id": 705671}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302904783.63732, "message": "a mi me gusto la idea de la rifa. Aunque la vdd no lei los TyC :S aun asi ... Creo que mas info es necesaria. Por ejemplo www.norecordlabel.net puse todo lo necesario para que se entendiera que es ....", "group_id": 965, "id": 705734}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1302906499.570364, "message": "Needs more english!", "group_id": 965, "id": 706020}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302903835.689115, "message": "OK, creo que voy entendiendo. Estás haciendo un sorteo para que la gente te de su correo y con ello adquirir usuarios. No crees que puede ser un poco infructífero el hecho de que la gente te de sus datos *sólo* por eso? (Si es que esta es la razón, claro)", "group_id": 965, "id": 705686}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302904932.7983439, "message": "@zodman ¿Qué es lo que no se entiende?", "group_id": 965, "id": 705760}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302905693.9720891, "message": "@cesarsalazar You're too authoritarian to be a mentor.", "group_id": 965, "id": 705888}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302903894.1843569, "message": "Por qué lo de Tampico no está específicado. Si te hubiera dado mi correo y luego me entero que nunca tuve oportunidad de ganar, estaría muy enojado", "group_id": 965, "id": 705689}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302904513.109066, "message": "@jyr pensé que este grupo era para hackers y no para crackers.", "group_id": 965, "id": 705723}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302905086.777669, "message": "@zodman En mi sitio menciono qué es GLOOP. ¿Qué es lo que no entendiste?", "group_id": 965, "id": 705789}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302905888.5543621, "message": "abrá q esperar el 27 de abril a ver que pasa", "group_id": 965, "id": 705928}, {"user_id": 24160, "stars": [{"date_created": 1302906529.74982, "user_id": 3665}, {"date_created": 1302908294.001879, "user_id": 12739}, {"date_created": 1302910437.5622909, "user_id": 26088}, {"date_created": 1302970928.864219, "user_id": 3084}, {"date_created": 1303253450.3033791, "user_id": 3107}, {"date_created": 1303512790.8003671, "user_id": 12343}], "topic_id": 16612, "date_created": 1302906514.2425539, "message": "@emmanuelcantu Si viniste a presumirnos lo que haces y estás cerrado a recibir feedback, creo que estás en el grupo incorrecto. Nadie te está diciendo qué hacer. Todos te hemos hecho sugerencias en base a nuestra experiencia. Si nos tomamos el tiempo de responderte es porque nos interesa que tu proyecto sea exitoso", "group_id": 965, "id": 706025}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1302907097.7571781, "message": "Poner las típicas condiciones en la página principal no lo hace nadie. Publicar en la página principal una condición que claramente es distinta a lo esperado lo debe hacer alguien que no desea confundir a sus clientes potenciales.", "group_id": 965, "id": 706131}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302906858.4675801, "message": "Pero ese es justo el punto, no debería de necesitar leer los términos para saber lo que haces. Piensa en el usuario final, es crucial.", "group_id": 965, "id": 706066}, {"user_id": 3665, "stars": [], "topic_id": 16612, "date_created": 1302907082.0970991, "message": "¿No sería genial que uses la IP del usuario para saber dónde está? y ahorrarle un click al usuario", "group_id": 965, "id": 706129}, {"user_id": 12133, "stars": [], "topic_id": 16612, "date_created": 1302907068.7705221, "message": "Ni yo las lei :S KISS", "group_id": 965, "id": 706124}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302906766.2765479, "message": "@cesarsalazar Yo no vine aquí a presumir ni a provocar, pero si van a hacer una crítica constructiva sugiero que lean bien antes de comentar. Por ejemplo, tú no leíste las condiciones del sorteo.", "group_id": 965, "id": 706059}, {"user_id": 3665, "stars": [], "topic_id": 16612, "date_created": 1302906983.6570089, "message": "Keep it simple :D", "group_id": 965, "id": 706110}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302906927.806927, "message": "Nadie pone las condiciones de uso de un sitio en su página principal. Nadie.", "group_id": 965, "id": 706089}, {"user_id": 24160, "stars": [], "topic_id": 16612, "date_created": 1302906905.8728709, "message": "En eso consiste el feedback, en que la gente te dice cómo interpreta lo que estás haciendo sin ser tú mismo. De otra forma, no ganarías nada.", "group_id": 965, "id": 706079}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1302906946.8885081, "message": "@emmanuelcantu César no las leyó. Normalmente la gente no lee las condiciones de nada. Tienes la opción de dejar el requisito de vivir en X ciudad detrás de un link que pocos le darán click. O puedes ponerlo al frente, en el formulario. Tú decidiste dejarlo en un segundo plano, entonces tienes que lidiar con la gente que se queja de que no lo vio.", "group_id": 965, "id": 706097}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302907181.5975959, "message": "Vuelvo a repetir, yo no vine aquí a promocionar mi sitio. Me pareció un sitio interesante para conocer a programadores. Ústedes no son mis clientes potenciales, yo estoy promocionando el sitio a un mercado específico.", "group_id": 965, "id": 706153}, {"user_id": 29620, "stars": [{"date_created": 1302971133.072922, "user_id": 3084}], "topic_id": 16612, "date_created": 1302907317.3812749, "message": "En ese caso pongo el ejemplo de http://mexican.vc ¿Para qué dan la información en Inglés, si ni siquiera permiten que personas que viven fuera de México entren a su programa?", "group_id": 965, "id": 706207}, {"user_id": 25609, "stars": [{"date_created": 1302908714.558722, "user_id": 3665}, {"date_created": 1302908717.5792201, "user_id": 6541}, {"date_created": 1302910646.6678209, "user_id": 26088}], "topic_id": 16612, "date_created": 1302908557.9526491, "message": "Utz... se nos enojó el niño... @emmanuelcantu reacciona, este lugar es para recibir criticas.... antes de que lances, ya que lances será demasiado tarde.\n\nSiempre es mejor que te hagan cachitos tu idea aquí, los que saben, a que te esperes a que el publico de su juicio (irrevocable por cierto), y tu idea termine enterrada en la mala prensa.\n\nEn este caso tu mayor problema es que tu pagina no transmite las ideas correctamente, el usuario promedio no lee, tienes 2 segundos para captar su atención y entonces pasa a la siguiente página.\n\nAcusarnos de no haber leido todo es ingenuo... si alguien con interés en ayudarte no llego a leer todo, mucho menos el usuario promedio.\n\nReacciona y no seas nena.", "group_id": 965, "id": 706692}, {"user_id": 29620, "stars": [], "topic_id": 16612, "date_created": 1302907618.8477199, "message": "Y ese dato no estaba en su página principal, tuve que leer las FAQ.", "group_id": 965, "id": 706341}, {"user_id": 19938, "stars": [{"date_created": 1302910433.7872519, "user_id": 25609}, {"date_created": 1302910708.310123, "user_id": 12739}, {"date_created": 1302978290.7162859, "user_id": 2946}, {"date_created": 1303167060.3771169, "user_id": 20146}], "topic_id": 16612, "date_created": 1302908260.081892, "message": "http://images3.wikia.nocookie.net/__cb20060402034522/muppet/images/f/f9/Book.icandoitmyself.jpg", "group_id": 965, "id": 706612}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1302907920.236326, "message": "¿Ya ven porque no hay que dar opiniones si no se las piden?", "group_id": 965, "id": 706464}, {"user_id": 12739, "stars": [{"date_created": 1302908712.5416639, "user_id": 3665}], "topic_id": 16612, "date_created": 1302908630.2403159, "message": "@emmanuelcantu si te pones a la defensiva con cualquier cosa que no sea un alago, vas mal chavo. Así vas a terminar haciendo más ruido por los berrinches que por la startup.", "group_id": 965, "id": 706712}, {"user_id": 25609, "stars": [{"date_created": 1302908863.1039131, "user_id": 3665}], "topic_id": 16612, "date_created": 1302908841.974128, "message": "@pablasso de hecho yo opino que si sigue con el berriche compremos el dominio berrinches.com y la redireccionemos a gloop... y para todo usemos ese dominio XD.", "group_id": 965, "id": 706761}, {"user_id": 3665, "stars": [{"date_created": 1302909168.3782711, "user_id": 25609}], "topic_id": 16612, "date_created": 1302908878.458807, "message": "@levhita LOL", "group_id": 965, "id": 706767}, {"user_id": 26089, "stars": [], "topic_id": 16612, "date_created": 1302912614.920877, "message": "exacto", "group_id": 965, "id": 707136}, {"user_id": 26089, "stars": [], "topic_id": 16612, "date_created": 1302911860.892086, "message": "#crowdsourcing Estoy haciendo mi market research como el evangelio del customer development manda ¿me ayudan resolviendo el cuestionario y rolándolo? http://goo.gl/oC9ky", "group_id": 965, "id": 707084}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1302912590.7071819, "message": "@geeksterhipster \"te has certificado?\" a qué te refiers con certificado? cualquier cosa que se llame certificado como un diplomado de algunas horas?", "group_id": 965, "id": 707131}, {"user_id": 26089, "stars": [], "topic_id": 16612, "date_created": 1302912648.5154181, "message": "exacto: cualquier cosa, mientras sea un curso y tengas un documento", "group_id": 965, "id": 707142}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302970607.9884281, "message": "@zodman si, las bandas suben su musica, imprimimos las tarjetas y los fans las pueden bajar", "group_id": 965, "id": 711873}, {"user_id": 9432, "stars": [], "topic_id": 16612, "date_created": 1302970694.4484351, "message": "@emmanuelcantu por que Shop y no Tienda?", "group_id": 965, "id": 711882}, {"user_id": 3084, "stars": [{"date_created": 1302975605.992553, "user_id": 26089}], "topic_id": 16612, "date_created": 1302971662.032409, "message": "Tache para todos los que se acaban peleando, ese es uno de nuestras grandes limitantes culturales para ser competitivos como país en muchos ámbitos. No nos metamos el pie unos a otrosHAY QUE HACER EQUIPO!", "group_id": 965, "id": 712039}, {"user_id": 3084, "stars": [], "topic_id": 16612, "date_created": 1302971755.168915, "message": "Por lo demás es válida la crítica y la discusión abierta", "group_id": 965, "id": 712055}, {"user_id": 25716, "stars": [{"date_created": 1303109524.787895, "user_id": 24172}], "topic_id": 16612, "date_created": 1302975004.205904, "message": "Menos discusión, mas startups! :) Otro startup: http://paywast.af (no mucho information, y solo posible usar si tu vivir en afghanistan). Es para ayudar construir la infrastructura en Afghanistan. Muy breve explicacion: Es para crear grupas sociales de SMS. Ahora este es mas grande que facebook en afghanistan, asi este servicio es muy popular. Esto tipo de proyectos es el tipo que yo me gusto y tengo passion por. Me gustaria poder mostrar mas funcionalidad, que es la interesante parte para los desarrolladores aqui :(", "group_id": 965, "id": 712448}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1302978077.5700569, "message": "@willygru jajaja", "group_id": 965, "id": 712860}, {"user_id": 26089, "stars": [], "topic_id": 16612, "date_created": 1302978195.3584311, "message": "Like!", "group_id": 965, "id": 712863}, {"user_id": 2946, "stars": [{"date_created": 1303166855.3311541, "user_id": 29963}], "topic_id": 16612, "date_created": 1302977755.804292, "message": "le puse un warning a al topic, para que nadie diga que no sabía", "group_id": 965, "id": 712811}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1302977534.7847371, "message": "@willygru No creo que nadie le haya metido el pie a nadie. El feedback que dimos fue para ayudar, para mejorar, queríamos que aumentara sus conversiones.", "group_id": 965, "id": 712784}, {"user_id": 3084, "stars": [], "topic_id": 16612, "date_created": 1302977955.5975349, "message": "@soska [cuidado: feedback inminente]: LOL", "group_id": 965, "id": 712850}, {"user_id": 3084, "stars": [], "topic_id": 16612, "date_created": 1302978220.844089, "message": "@soska Yo si creo que almenos dos comentarios fueron en ese sentido (y no estoy diciendo que fueron tuyos). Anyway tu warning creo que resuelve gran parte del problema :D", "group_id": 965, "id": 712865}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1303156763.7539959, "message": "hay un problema de encoding en los slugs de las categorias \"Celulares-y-Telefon%C3%ADa\"", "group_id": 965, "id": 730087}, {"user_id": 2946, "stars": [{"date_created": 1303166865.8414719, "user_id": 29963}], "topic_id": 16612, "date_created": 1303157385.36567, "message": "@siglotienda me gusta la idea, suena como algo que peude ser muy útil. Pero hay algunas cosas que no me gustan nada y que personalmente me evitarían que los tomara en serio y usara. \n\n1. ODIO su diseño. Sobre todo el logotipo con compression artifacts. Si no tienen mucho dinero para un diseño, al menos prueben con 99designs.com,e stoy seguro que agarran algo bonito y muy barato.\n2. Envía SMS grátis? Distracción enorme de tu core business. Y ni siquiera funciona.\n3. A que se debe el nombre? No me gusta mucho, sobre todo aunado al color verde me parece algo político. Como tienda del ISSTE o algo así.  Pero puede que sea solo mi percepción.\n\nA fin de cuentas, va a ser la oferta de productos lo que haga la diferencia. Como tienen pensado resolver el problema del huevo y de la gallina? Ahorita el listado está súper vacío. Yo recomendaría enfocarse a un nicho pequeñito primero y acercarse a los top vendedores de esos nichos en Mercado Libre y convencerlos de que se anuncien.\n\nEspero que no les moleste mi feedback (está la advertencia allá arriba), pero la idea es interesante solo que puede ser ejecutada mucho mejor.", "group_id": 965, "id": 730273}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303156662.156405, "message": "Hola, desde Febrero creamos SIGLOTienda, un servicio para vender y comprar \"de todo\" con el siguiente funcionamiento: El vendedor publica sin registrarse, el comprador puede comprar sin registrarse, no hay sistema de calificaciones ya que toda compra deberá ser pagada a la tienda diréctamente y no al vendedor, donde arriesgas tu dinero, la duración de una publicación es gratuita y dura 90 dias puedes pagar con Pypal o Certificados de Regalo. Hay más información en siglopedia(.)com o pueden dejarnos sus comentarios aqui para que nos ayuden a ganar \"Mercado\"", "group_id": 965, "id": 730063}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303159270.7128601, "message": "@soska otra cosa, no se entendió lo de el color verde, te refieres a el favicon? no tiene nada que ver con política XD solo queremos dar un servicio eficiente y que sea útil", "group_id": 965, "id": 730826}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303157961.5501759, "message": "Ningún problema, por eso estamos escribiendo, de lo contrario solo haríamos banner y no tendríamos formas de contacto para no recibir críticas. A tus comentarios: 1.- Si, lo admitimos es muy simple el logotipo, sin embargo se ve muy bien en la versión móvil de la tienda. 2.- Si funcionan los SMS Gratis, solo que depende de activarlo/desactivarlo manualmente. 3.- La idea del nombre vine básicamente de nuestro sitio principal de información \"siglopedia\" - Solo estamos esperando encontrar vendedores, estamos contactando a muchas personas vía twitter, facebook, y a través de las formas de contacto de las páginas de vendedores, buscamos además que tengan cuenta en Paypal, saludos", "group_id": 965, "id": 730471}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303158877.8730271, "message": "@soska de este lado se ve bien, .../Celulares-y-Telefonía/ pero gracias por tu aporte veremos en otras computadoras y navegadores, cualquier otro comentario en bienvenido", "group_id": 965, "id": 730733}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1303159278.782021, "message": "http://en.wikipedia.org/wiki/Compression_artifact", "group_id": 965, "id": 730827}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303165448.513375, "message": "ok a lo del logo ya habiamos visto ese detalle, si el logo es muy simple y mejorará con el tiempo, ahorita solo estamos buscando vendedores. Sobre el listado, ahorita sabemos que solo hay 2 productos a la venta, un consejo que damos a los vendedores será el promocionar sus productos en las redes sociales, en la tienda se promueven, además de RSS, también vía twitter y la página en facebook, criticas y comentarios son bien recibidos", "group_id": 965, "id": 732486}, {"user_id": 20146, "stars": [], "topic_id": 16612, "date_created": 1303177423.0397649, "message": "@emmanuelcantu Solo pide insertar 1 vez el campo email en el formulario(has tus validaciones sintácticas del lado del browser por usabilidad y del lado del server por seguiridad), concluye el registro y confirma autenticidad del email al enviarle por a ese email una URL hash(caducable).\n\nEste el proceso típico de registro y/o cambio de contraseña donde el email es un campo crucial para la autenticación de un usuario. De otra forma realmente NO validadas el email asi pongas al usuario hacer una plana de su correo.", "group_id": 965, "id": 734658}, {"user_id": 29963, "stars": [], "topic_id": 16612, "date_created": 1303181685.584481, "message": "Al parecer lo de \"Celulares-y-Telefon%C3%ADa\" solo se ve así en Internet Explorer, hemos hecho pruebas en Firefox y Chrome y se normal con el acento, también notamos que las \"comas\" hacen que la dirección se vea de esa manera, esto solo en Chrome e Internet explorer, cualquier otro comentario no duden en escribirlo. De nuevo les invitamos a publicar sus productos, esperamos que sea mejor que otros sitios, pero solo con tu apoyo saldrá adelante.", "group_id": 965, "id": 735316}, {"user_id": 20146, "stars": [], "topic_id": 16612, "date_created": 1303179603.127666, "message": "Al leer las instrucciones del registro: http://www.gloop.mx/raffleconditions.php personalmente da desconfianza la velocidad de dicho sorteo, por cosas como digan que sera aleatorio por una App diseñada especialmente para el sorteo.\n\nSi intentas \"enganchar\" a los usuarios con el sorteo creo que sera mas fácil que caiga si no lee las instrucciones.\n\nSi busco ayuda en: http://www.gloop.mx/support.php un pequeño formulario con el titulo del problema y contenido me ayudaría mucho.", "group_id": 965, "id": 734873}, {"user_id": 29866, "stars": [], "topic_id": 16612, "date_created": 1303320898.6174099, "message": "Mi Startup: www.ofercity.mx [esperando el feedback inminente]\nNosotros iniciamos operaciones en Junio del año pasado, cuando aun no había llegado Groupon y varios competidores, desafortunadamente para nosotros el bootstrapping no fue suficiente y por la falta de un equipo fisico en la Ciudad de México, no hemos continuado, ahora estamos de regreso en \"Stealth mode\". Les he dejado una \"oferta demo\" para que visualicen por completo el sitio, estamos actualmente en proceso de hacer más grande la base de datos y haciendo un poco de networking para continuar con este empredimiento.\nCreamos hasta un vídeo: http://www.youtube.com/watch?v=CzsGcY-RjsY\nHemos hecho Social media: Twitter y Facebook\nPero nos falta capital para empujar más la triste realidad de muchas empresas en México... pero estamos con mucho animo de continuar y ver las oportunidades que se nos presenten. Por ahora Ofercity nos ha dejado mucho conocimiento y como siempre digo la educación en México es un bien de lujo y nosotros hemos invertido en ello.", "group_id": 965, "id": 757917}, {"user_id": 30503, "stars": [], "topic_id": 16612, "date_created": 1303356091.7929931, "message": "@josuegio me parece buen proyecto, porque dices que el bootstrapping no fue suficiente? en que parte se detuvieron? y porque necesitas tener presencia en la Ciudad de Mexico?", "group_id": 965, "id": 765107}, {"user_id": 2946, "stars": [], "topic_id": 16612, "date_created": 1303360476.0728331, "message": "@josuegio Desafortunadamente la barrera de entrada para estos negocios parece tan poca que muchísima gente se volcó a hacer lo mismo (por poco y hasta yo ponía mi sitio de descuentos :P). Han pensado en pivotear, me parece que el negocio de los bundles que funciona en el mundo del software (appsumo, mac bundle) podría explotarse con pequeños negocios del mundo real (tm)", "group_id": 965, "id": 765892}, {"user_id": 19938, "stars": [], "topic_id": 16612, "date_created": 1303397766.5632, "message": "@soska esa suena, de buenas a primeras, como una buena idea.", "group_id": 965, "id": 770930}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1304583517.92679, "message": "Ahora en español! Que tu pienses? http://csupport.com.mx/ Queremos promover en America Latina (baso en Mexico), asi que si tienes algunas ideas / recomendaciones buenas para lo atrear usuarios a esto tipo de servicio en America Latina, por favor dime :) Gracias. Also any feedback would be awesome!", "group_id": 965, "id": 926335}, {"user_id": 12739, "stars": [], "topic_id": 16612, "date_created": 1304585910.961566, "message": "La traducción no es muy buena, tal como está ahora no inspira confianza en que tenga soporte decente en nuestro idioma. Te vendría bien conseguir a alguien que te traduzca las cosas no literalmente, sino en oraciones que sean de uso común en español.", "group_id": 965, "id": 926586}, {"user_id": 25716, "stars": [], "topic_id": 16612, "date_created": 1304586511.2602191, "message": "@pablasso gracias, si, es verdad. Tuve algunas mexicanos que lo revisen, aunque, pero, con tu comentario, no fue suficiente", "group_id": 965, "id": 926705}]