[{"user_id": 19452, "stars": [], "topic_id": 17241, "date_created": 1301941734.033294, "message": "Just getting into rendering maps of my servers (using Minecraft Overviewer for now) and wondering: is it safe/reasonable to be running these programs on the world folder while the server is running? Or is this asking for disaster? How are people dealing with this for always-on servers?", "group_id": 1103, "id": 526586}, {"user_id": 11421, "stars": [], "topic_id": 17241, "date_created": 1301948030.3538611, "message": "As long as they only read from the world folder and don't write to it, that should be perfectly safe. And I can't imagine a reason why any of them would write there. Of course you should still automate backups as there's both griefers and bugs :)", "group_id": 1103, "id": 528352}, {"user_id": 19452, "stars": [], "topic_id": 17241, "date_created": 1301950880.607543, "message": "Alright, thanks! That was my assumption, just wanted to sanity check it. :)", "group_id": 1103, "id": 529093}, {"user_id": 5254, "stars": [], "topic_id": 17241, "date_created": 1301995333.0704131, "message": "I've always run Overviewer on the active save file. Make sure to set it up using the biome data as it looks so much better.", "group_id": 1103, "id": 539381}, {"user_id": 15369, "stars": [], "topic_id": 17241, "date_created": 1301994155.997972, "message": "Personally, I use PigMap but the process might be useful for anyone doing automated mapping.\n\nBefore I rendered the first map I took a complete copy of the world, saved to the /map folder and ran Pigmap on that data\n\nThen, every 4 hours, I do an rsync which takes only the differences between the server and the last copy. This minimises reads from the live server and, obviously, minimises lag.", "group_id": 1103, "id": 539306}, {"user_id": 15369, "stars": [], "topic_id": 17241, "date_created": 1302092763.2341659, "message": "Pigmap allows you to add your own textures to the render... this is my current map... highlights include a massive golden buddha and a pirate ship... http://91.215.157.175/map.html", "group_id": 1103, "id": 558265}, {"user_id": 15369, "stars": [], "topic_id": 17241, "date_created": 1302092734.5650899, "message": "I've never used Overviewer, sounds like it's popular though.", "group_id": 1103, "id": 558260}, {"user_id": 19452, "stars": [], "topic_id": 17241, "date_created": 1302109673.4937501, "message": "Nice Domes, ifyaknowwhatimean. ;)", "group_id": 1103, "id": 561571}, {"user_id": 19452, "stars": [], "topic_id": 17241, "date_created": 1302109718.7235489, "message": "Does Pigmap render lighting, and/or elevation? I'm not hugely impressed with Overviewer, it was just the first one I tried, and it 'worked.'", "group_id": 1103, "id": 561576}, {"user_id": 15369, "stars": [], "topic_id": 17241, "date_created": 1302187583.1109121, "message": "Pigmap is the best looking one I've found. Not sure about lighting though. Google will know :)", "group_id": 1103, "id": 575856}]