[{"user_id": 6661, "stars": [], "topic_id": 10956, "date_created": 1299313023.805321, "message": "I have already asked this in the Hacker News group but realised this might be a better place to ask it", "group_id": 292, "id": 275428}, {"user_id": 6661, "stars": [], "topic_id": 10956, "date_created": 1299313049.4182169, "message": "http://news.ycombinator.com/item?id=2291064", "group_id": 292, "id": 275430}, {"user_id": 6661, "stars": [], "topic_id": 10956, "date_created": 1299313058.374454, "message": "Please answer if you can", "group_id": 292, "id": 275432}, {"user_id": 12817, "stars": [], "topic_id": 10956, "date_created": 1299325287.6245289, "message": "I dived straight into Django (coming from a PHP background), but if you want to start with something you can hit the ground running with on a small app maybe try Flask?", "group_id": 292, "id": 276043}, {"user_id": 7364, "stars": [], "topic_id": 10956, "date_created": 1299444316.4323289, "message": "tuhin: it depends a lot on the project, as different frameworks have different strengths.", "group_id": 292, "id": 281757}, {"user_id": 19235, "stars": [{"date_created": 1299471423.242234, "user_id": 1}, {"date_created": 1299508258.5492909, "user_id": 7179}], "topic_id": 10956, "date_created": 1299471327.9219229, "message": "I think it's better to have a good understanding of the language before diving into frameworks. You can begin with \"Dive Into Python\" by Mark Pilgrim - http://diveintopython.org/toc/index.html", "group_id": 292, "id": 285045}, {"user_id": 18539, "stars": [], "topic_id": 10956, "date_created": 1299497808.2432749, "message": "Although I mostly agree you should probably learn the language before kicking off with frameworks, the feedback I have seen from newbies in #python (the IRC channel) makes me actively dislike DIP, and I am nowhere near alone in that. There's basically Learn Python the Hard Way, Think Python, and the official tutorial. They all cater to different levels of existing knowledge (everyone, non-programming geeks, non-Python programmers respectively).", "group_id": 292, "id": 286988}, {"user_id": 2313, "stars": [], "topic_id": 10956, "date_created": 1299504454.3283391, "message": "DIP is totally outdated and doesn't follow PEP 8. It does not introduce with statements and if expressions; the XML/HTML processing chapters are best ignored entirely and these are just the problems obvious at first glance. The functional programming stuff is a joke at best and almost everything related to import and sys.modules... well lets just forget that ever happened.", "group_id": 292, "id": 287456}, {"user_id": 6661, "stars": [], "topic_id": 10956, "date_created": 1299561377.990731, "message": "FWIW, I am familiar with the very basic stuff mentioned in \"How to think like a Computer Scientist\" and the 6.0 of MIT OCW. Dive into Python will be the secondary reading but I want to also start understanding things like threads, error handling, URL templating, user sessions and how to implement all that in Python. Not sure if the book ever goes into that.", "group_id": 292, "id": 294188}, {"user_id": 6415, "stars": [], "topic_id": 10956, "date_created": 1299582202.523035, "message": "@tuhin Once you are confortable with the language, you should read about modules you are interested in (like threading) in \"Python Module of the Week\" http://www.doughellmann.com/PyMOTW/contents.html @doughellmann has plans to turn this into a book too.", "group_id": 292, "id": 295453}, {"user_id": 1760, "stars": [{"date_created": 1299616624.8474791, "user_id": 6415}], "topic_id": 10956, "date_created": 1299588464.8190751, "message": "The book is nearly done and available for preorder now. http://www.doughellmann.com/books/byexample/index.html", "group_id": 292, "id": 295731}]