[{"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774287.2416911, "message": "Hola estimados amigos de la #Brigadadigital, que rico que entre todos construyamos las temáticas a trabajar en la sección de Redes Sociales del programa de TV #ViveDigital.", "group_id": 2696, "id": 216219}, {"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774688.089206, "message": "3. Conocer herramientas prácticas para la gestión de comunidades sociales e implementación de estrategias digitales.", "group_id": 2696, "id": 216241}, {"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774552.0026369, "message": "Los objetivos de la sección son varios:", "group_id": 2696, "id": 216231}, {"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774561.3702011, "message": "1. Apoyar a la alfabetización, apropiación personal y apropiación profesional de las redes sociales en la sociedad colombiana.", "group_id": 2696, "id": 216234}, {"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774573.4433839, "message": "2. Visualizar y analizar las buenas prácticas y lecciones aprendidas del manejo de redes sociales.", "group_id": 2696, "id": 216235}, {"user_id": 16229, "stars": [], "topic_id": 9300, "date_created": 1298774849.1622751, "message": "4. Propiciar la generación de ideas y dinámicas innovadoras que impacten el mundo 1.0.", "group_id": 2696, "id": 216245}, {"user_id": 15260, "stars": [], "topic_id": 9300, "date_created": 1298911355.8284941, "message": "Este programa como se va a hacer? cada cuanto se hara, y si manejamos alguna de la informacion aca solicitada, como la compartimos?", "group_id": 2696, "id": 227079}, {"user_id": 16485, "stars": [], "topic_id": 9300, "date_created": 1298911500.342423, "message": "QUE BUENOS OBJETIVOS", "group_id": 2696, "id": 227103}, {"user_id": 13447, "stars": [], "topic_id": 9300, "date_created": 1298911675.3719709, "message": "Es una buena idea mirar como las redes sociales han impactado en otros países de la región y mirar que cosas positivas se pueden tomar.", "group_id": 2696, "id": 227137}, {"user_id": 17517, "stars": [], "topic_id": 9300, "date_created": 1304682913.079474, "message": "Con @tuiterosboyaca también se capacita a comunicadores y periodistas en el tema de comunicación digital y herramientas 2.0 para medios de comunicación, capacitaciones se dictarán en auditorio cámara de comercio de Tunja", "group_id": 2696, "id": 940963}, {"user_id": 17517, "stars": [], "topic_id": 9300, "date_created": 1304682808.0446019, "message": "@tuiterosboyaca esta realizando jornadas de inclusión digital a personas 1.0 en varias partes del departamento de boyaca, en Sogamoso el secretario de Educación de la ciudad nos ofreció logística y sitio para poder ofrecer la jornada de alfabetización.", "group_id": 2696, "id": 940919}, {"user_id": 17517, "stars": [], "topic_id": 9300, "date_created": 1304683219.829284, "message": "@tuiterosboyaca también esta colaborando con el tema de reportes de situaciones anormales en el departamento de Boyacá, accidentes de tránsito, estado de carreteras, noticias importantes, vía www.crowdmap.boyaca.com solo registrarse y participar, además, con waze.com estamos trabajando en la creación y actualización de cartografía para Boyacá", "group_id": 2696, "id": 941020}, {"user_id": 26153, "stars": [], "topic_id": 9300, "date_created": 1304782744.468435, "message": "Como estan usando waze ? ... que  mapa actualizan ?", "group_id": 2696, "id": 951268}, {"user_id": 17517, "stars": [], "topic_id": 9300, "date_created": 1304992901.23265, "message": "Waze permite crear nuevos reportes, vías, carreteras sin pavimentar, calles ciegas, reportes de velocidad, avenidas nuevas, corregir mapas, reportar vías incorrectas, accidentes a través de dispositivos como blackberry con gps, ipod, ipad android con gps. después de hacer el reporte de nueva vía usted entra a waze.com con su usuario y clave y confirma el reporte o los reportes que haya hecho y ellos verifican la situación y actualizan el mapa. Para el caso ya hemos creado en el mapa cartografía de Floresta, Arcabuco, Sta Rosa de Viterbo, Paipa, Corrales, Tuta gracias a waze y al reporte de los usuarios.", "group_id": 2696, "id": 981991}, {"user_id": 26153, "stars": [], "topic_id": 9300, "date_created": 1305985460.9007139, "message": "@javiersneider por favor comparte esa información que recojes a través de una cuenta de Open Street Map. eso nos ayudaría a completar el mapa. Si necesitas colaboración para hacerlo contactame por skype [ arttesano ]", "group_id": 2696, "id": 1133932}]