[{"user_id": 11626, "stars": [], "topic_id": 7444, "date_created": 1298103443.9975619, "message": "http://www.longislandlawyerblog.com/wp-content/themes/prophoto3/images/blank.gif\r\n\r\nThis case is a frightening example of what can happen when a photographer encounters ignorant bullies with badges. According to the complaint filed in Federal Court, Nancy Genovese, a mother of three, was driving home on County Road 31 past Gabreski Airport in Suffolk County. Gabreski Airport displays a decorative helicopter shell by the roadway to the public, which is visible to all who pass by.\r\n\r\nNancy Genovese stopped her car on the side of the road across the street from the airport in an area that is open and accessible to the public, and crossed over the road to the airport entryway that is also open and accessible to the public to take a picture of the helicopter display. While still in her car, she took a picture of the decorative helicopter shell with the intention of posting it on her personal “Support Our Troops” web page.\r\n\r\nAs Nancy Genovese was preparing to drive away, she was stopped and approached by Robert Iberger, a lieutenant with the Southampton Town Police. Lieutenant Iberger demanded to know why she was taking photographs. Nancy showed the lieutenant her camera, but Lieutenant Iberger grabbed her camera and handled it “without care”. In an attempt to prevent the lieutenant from damaging the camera, Nancy removed her memory card, which Lieutenant Iberger confiscated. To date, Nancy’s memory card still has not been returned to her.\r\n\r\nLieutenant Iberger demanded that Nancy remain where she is, and he refused to allow her to leave. At this time, Lieutenant Iberger notified the Suffolk County Sheriff’s Office and the authorities at Gabreski Airport of Nancy’s presence outside the airport, and falsely and wrongfully informed them that she posed a terrorist threat.\r\n\r\nSuffolk County Deputy Sheriff Robert Carlock responded to the scene, along with various members of the Suffolk County Sheriff’s Office. When Deputy Carlock arrived, he placed cameras on the roof of his vehicle, aimed at Nancy Genovese and her 18 and 20 year old sons who had come to the scene at this point to help their mother. Deputy Carlock ordered all three of them to stand directly in front of the cameras, and not to move.\r\n\r\nOfficials from the airport, as well as other local and federal law enforcement agencies also responded, including, without limitation, the Southampton Police Department, the Westhampton Police Department, the FBI, and the Department of Homeland Security. Nancy was questioned on the side of the road for approximately five to six hours, from about 6pm until midnight, denied food or water, and denied the opportunity to use a restroom, all without having received any warnings as to her rights.\r\n\r\nNancy Genovese also had a left lower leg injury just above her ankle that she had received earlier in the day and which, exacerbated by the stress and length of her roadside detention, was causing her to limp. When the officers saw this, they ordered her to expose her wound, which was bleeding, for no legitimate purpose, and with no regard for Nancy’s health or well-being.  Members of the Suffolk County Sheriff’s Office used Nancy’s leg wound as another object to taunt her with, telling her that they were going to arrest her for an unreported knife wound.\r\n\r\nHere’s where the story takes an interesting twist, and why I believe Nancy’s situation hasn’t received more press coverage. Before arriving at the airport to take a picture, earlier that day Nancy had been to the local shooting range with her rifle practicing her hobby, target shooting. During the first hour of questioning, Lieutenant Iberger searched Nancy’s vehicle, without her consent, and came across her unloaded rifle, which Nancy was legally carrying, in a locked case. Now some people throw up their arms (no pun intended) at this point, and say, “what does she want, she brought a rifle to the airport!”, but I would like to remind everyone that it is perfectly legal to drive around with an unloaded rifle in your car. Yes. Really. And Nancy did not enter the airport, she was parked alongside a public roadway. It is important to remember that no matter how you feel about firearms, nothing that Nancy did violated any laws.\r\n\r\nUsing force, Lieutenant Iberger pushed Nancy Genovese when she objected to the seizure of her rifle. Deputy Carlock taunted Nancy, asking in a disparaging tone, “You’re a real right winger, aren’t you?”, and stating in words or substance that she was never going to see her rifle again.\r\n\r\nDuring the remainder of the six hours that Nancy Genovese was forcibly detained on the side of the road, she was taunted, verbally harangued, threatened, belittled, abused, humiliated and harassed by members of the Suffolk County Sheriff’s Office. For example, Deputy Carlock repeatedly referred to Nancy as “a right winger” and “tea bagger”, and threatened that they were going to arrest her for terrorism to make an example of her to other “tea baggers” and “right wingers”.\r\n\r\nAround midnight, officials from the airport and federal law enforcement agencies determined that Nancy posed no terrorist or other security threat. Once most of the other law enforcement officials left the scene, Deputy Carlock ordered Nancy Genovese to be handcuffed by another member of the Suffolk County Sheriff’s Office. Before placed in handcuffs, Nancy attempted to give her purse containing her wallet and cell phone to her sons. Her wallet contained approximately $13,000 in cash, money she was holding to pay tuition that day for her son’s college and her daughter’s Catholic school tuition. Deputy Carlock refused to allow her sons to take her bag, and ordered her to leave it on the front seat of her unlocked vehicle, even after being informed of the value of its contents. When Nancy’s sons objected, Deputy Carlock threatened to arrest them if they touched it, and ordered them to leave the scene. Not knowing what to do, they left.\r\n\r\nWhen Nancy’s sons responded to a call from the Suffolk County Sheriff’s Office in the early morning hours to pick up their mother’s vehicle from the roadside, they found $5,300 of the $13,000 missing. The money was never returned. In addition, the contents of the glove compartment box was missing, and there was damage to the body of the car, particularly around the trunk.\r\n\r\nAround midnight, after her sons were ordered to leave upon threat of arrest, Nancy was transported, in handcuffs, to the Suffolk County Jail. While in a holding cell, Deputy Carlock continued to verbally harass Nancy, telling her “you will pay”, and admitting that they had nothing to charge her with, but that he would “find something in order to teach all right wingers and tea baggers a lesson.”\r\n\r\nWhile in her holding cell, Nancy Genovese was interrogated by Suffolk County Undersheriff Caracappa without receiving any warnings as to her rights. Her requests to speak to a lawyer were ignored. Following her “interrogation”, Undersheriff Caracappa informed her that she was being arrested and charged with “terrorism.”\r\n\r\nAt this point, Nancy requested medial treatment for her bleeding and painful left leg. After several requests, and several hours later, she was taken to the Peconic Bay Medical Center by male members of the Suffolk County Sheriff’s Office, and handcuffed to a bed. A sonogram was performed on Nancy’s left leg from her ankle to her inner groin, requiring her to disrobe. Despite her and the doctor’s request for them to turn away, the two male Suffolk Deputies insisted on staring at Nancy while she disrobed, further humiliating her. She was prescribed antibiotics, and discharged back to the Suffolk County Jail, with instructions on proper care for her leg wound.\r\n\r\nOnce back at the jail, the Suffolk County Sheriffs denied her access to her antibiotics, and denied her proper care of her leg wound. This caused a serious and painful staph infection to develop.\r\n\r\nThe following morning, Nancy Genovese was briefly questioned at the Suffolk County Jail by two FBI agents. No federal complaints or charges were ever brought against Nancy. That same day, Nancy was transported in handcuffs and ankle shackles, with no regard for her ankle wound, to the Southampton Justice Town Court. The driver drove fast and recklessly, intentionally making abrupt turns and laughing. This caused Nancy, who was not secured by a seatbelt, but was instead restrained with her hands cuffed behind her and her ankles cuffed together, to roll about in the back of the vehicle, further exacerbating her leg injury. When she requested that the Deputy Sheriffs secure her with a seatbelt, they laughed at her, and the driver continued to recklessly swerve the vehicle.\r\n\r\nNancy Genovese was brought into the courthouse in handcuffs and leg restraints, and was violently pushed through the door by the Deputy Sheriffs. This added to Nancy’s humiliation, particularly since Nancy knew some of the courthouse employees and other people who were present. Both before and after arriving at the courthouse, Nancy repeatedly requested to speak with an attorney. All of her requests were ignored.\r\n\r\nDespite never stepping foot onto airport property, Nancy Genovese was arraigned on a single misdemeanor charge of Criminal Trespass in the Third Degree. She was assigned a Legal Aid Attorney by the Judge. Undersheriff Caracappa and Deputy Carlock intentionally lied to the Judge about the circumstances surrounding Nancy’s arrest, including that she was a terrorist and had surveillance equipment in her car, and the judge set bail in the amount of $50,000.\r\n\r\nDue to the excessive amount of bail, Nancy’s children needed more time to come up with the money, so Nancy was returned to the jail. The Legal Aid Attorney assigned to Nancy spoke with the Deputy and Undersheriff, and due to the conversation, directly afterwards informed Nancy that he was no longer her attorney, and that he was going to ask the court to place her on suicide watch.\r\n\r\nOnce back at the jail, Nancy Genovese was processed, including being issued prison “greens” to wear, and was photographed, fingerprinted, and eye scanned. Members of the Suffolk County Sheriff’s Department continuously verbally harassed Nancy. A woman in civilian clothes then interviewed Nancy. The woman told Nancy she was going to be placed in “general population.” During the interview, two men wearing “Suffolk County Emergency Response Team” jackets entered the room. One of them removed Nancy from the room and held her in the hallway outside of the interview room. From there, Nancy heard the woman who had interviewed her arguing with the other man, saying that “She is not suicidal.”\r\n\r\nDespite the woman’s protests, Nancy was physically moved by the two men wearing “Suffolk County Emergency Response Team” jackets to another room. There, another woman who identified herself as a nurse administered, without Nancy’s consent, two injections into Nancy’s arm. One of the men held Nancy’s head so that she could not see what was being done, while the other man held Nancy’s arm down. Despite her demands to know what they were doing, no one answered her. Nancy experienced bruising and swelling in her neck and arm long after she was released from custody.\r\n\r\nNancy was then escorted by the two men into a cell area, where she was forced to disrobe and put on a “suicide gown”, consisting of a heavy, jacket-type blanket that fastens around the body with Velcro. Nancy was not permitted to wear undergarments under the blanket. Nancy was required to wear this same “suicide gown” for the next several days. After three days, Nancy was evaluated by a psychiatrist who determined her to be of sound and stable mind, and immediately removed her from suicide watch.\r\n\r\nLater that day, bail was posted, and Nancy was able to go home. Subsequently, all charges against Nancy were dismissed.\r\n\r\nUpon Nancy’s release, Undersheriff Caracappa issued a press release in response to media inquiries, titled “Armed Woman Arrested for Trespassing at Suffolk County Gabreski Airport”, which falsely stated that Nancy had been taking pictures of the airport and surrounding security”, and that she became hysterical, and began “screaming and flailing around” when confronted. Undersheriff Caracappa also falsely reported that Nancy had surveillance equipment, 500 rounds of ammunition, and “scary weapons” in her car, and that she was a right-wing extremist and terrorist, and that she had been at the airport trespassing several times and had been warned to stay away. Upon further inquiry, it turns out that Nancy had never trespassed at the airport before, had never been warned by anyone to “stay away” before, had no “surveillance equipment” of any kind other than her point and shoot camera, and certainly was not a terrorist. Undersheriff Caracappa has refused to issue a retraction or correction.\r\n\r\nNancy has filed a Federal Lawsuit seeking up to 70 million dollars from the Town of Southampton, the County of Suffolk, Lieutenant Iberger, Undersheriff Caracappa, Deputy Carlock, Lieutenant Leuete, and various other employees of the Suffolk County Sheriff’s Department. The lawsuit is still ongoing.\r\n\r\nEDITOR’S NOTES:\r\n\r\n    * All of the alleged facts discussed in this article have been taken directly from the court documents filed in this case.\r\n    * Nancy Genovese was on public property the entire time.  At no time did she trespass onto airport property, which is why the trespassing charge (the only charge against her) was dismissed.\r\n    * Here is the google maps view of the airport entrance, and the helicopter on display.\r\n    * Although Undersheriff Caracappa released a statement saying that Nancy was previously spotted around the airport in the past and had previously been warned not to return, not a single person can verify his claim. Nancy claims that she was never warned to “stay away” from a public area outside a tourist attraction.\r\n    * Yes, to some, Nancy’s claims seem far fetched and outrageous. But let’s look at the facts that both sides can agree on. Not a single crime was actually committed by Nancy. Yet, she was held against her will, in an isolated cell, in essentially a straight jacket, with no medical attention, for several days.\r\n\r\nhttp://www.longislandlawyerblog.com/mother-of-3-arrested-for-taking-pictures-of-tourist-attraction-at-airport", "group_id": 3920, "id": 149072}]