[{"user_id": 11626, "stars": [], "topic_id": 6323, "date_created": 1297848912.257731, "message": "Egyptian protesters are still out on the streets as the new military rulers insist they will stay in power for six months or until elections.\r\n\r\nThe developments come two days after Mubarak handed over power to Egypt's Supreme Council of the Armed Forces, which is headed by Defense Minister Gen. Mohammed Tantawi.\r\n\r\nMeanwhile, protesters want all their demands met, including the transition of power from the military to a civilian, democratic government.\r\n\r\nClashes have erupted between the army and the protesters as troops tried to disperse thousands of demonstrators out in Cairo's Liberation Square, a Press TV correspondent reported.\r\n\r\nThe wave of demonstrations in and around the square is showing no signs of stopping. Hundreds of thousands of protesters continue to rally in Liberation Square.\r\n\r\nMeanwhile, the military has announced that it has dissolved the parliament and suspended the country's constitution. It also said a committee would be formed to draft a new constitution.\r\n\r\nAlso, Egyptian Prime Minister Ahmed Shafiq has said all government ministeries are up and running. He added that restoring security to the country is a top priority.\r\n\r\nShafiq became premier after Mubarak sacked the cabinet amid massive rallies against his regime. Protesters have dismissed the new designation and any new prospects of military rule.\r\n\r\nIn separate developments, Egyptian bankers and the police have staged walkouts and protests to demand pay rises and better conditions.\r\n\r\nBank employees have gone on strike to protest their working conditions.\r\n\r\nThey are demanding the removal of corrupt managers and better pay. The bank employees also want an official probe into the former ruling National Democratic Party's alleged involvement in financial bribery.\r\n\r\nThousands of Egyptian police have also held a demonstration outside the interior ministry in Cairo. The police force is demanding better pay and healthcare benefits.\r\n\r\nhttp://www.presstv.ir/detail/165074.html", "group_id": 3920, "id": 118542}, {"user_id": 11626, "stars": [], "topic_id": 6323, "date_created": 1297848949.8713961, "message": "What, you mean the Egyptians don't like MARTIAL LAW?????", "group_id": 3920, "id": 118543}]