[{"user_id": 11098, "stars": [], "topic_id": 15004, "date_created": 1300990399.615824, "message": "Ah! I know what you mean there. We have an e-learning product where the primary client talks in terms of curricula/modules/lessons, but our secondary client has companies/products/guides. I expect we'll stick with the primary naming, because changing it seems like a huge amount of effort, but it's already getting confusing. Let me know if you solve this!", "group_id": 4205, "id": 429268}, {"user_id": 24649, "stars": [], "topic_id": 15004, "date_created": 1300989967.3398631, "message": "It seems like I am always fighting this issue where a feature is renamed, but the packages and classes reference the old name. This becomes a communication issue with a team, and an issue with remembering what classes you want while developing. Does anyone have a strategy for handling this (other than just mass renaming)?", "group_id": 4205, "id": 429218}, {"user_id": 11097, "stars": [], "topic_id": 15004, "date_created": 1301051581.319772, "message": "Do you feel there was too much coupling (the old name is all over the place)?  Or, is it a central concept that is core to the application (which would bring back the question of giving sufficient thought to core concepts)?", "group_id": 4205, "id": 437610}, {"user_id": 11097, "stars": [], "topic_id": 15004, "date_created": 1301051444.3858459, "message": "But, I guess determining the source of the problem (to hopefully prevent it in the future), doesn't help you today!", "group_id": 4205, "id": 437604}, {"user_id": 11097, "stars": [], "topic_id": 15004, "date_created": 1301051345.3326721, "message": "I see that a lot, too.  I guess my question in this case is, why was the feature renamed?  Was the original name inaccurate?  Did the goals/business change?  Was it just someone's personal preference?  The answer might give some insight into the source of the problem.  Perhaps the team charged ahead before thinking it through.  Perhaps the business charged ahead with fuzzy goals or ideas about the market.  Perhaps there was not enough communication.  Perhaps someone was not being a team player.", "group_id": 4205, "id": 437594}, {"user_id": 13306, "stars": [], "topic_id": 15004, "date_created": 1301072187.1087689, "message": "But, in Mockingbird (http://playmockingbird.com/), what we originally called \"behaviors\" (and still call behaviors in the code, because I think it's a more accurate name), we call \"actions\" in the user interface because we think it's got better UX appeal.", "group_id": 4205, "id": 440098}, {"user_id": 24649, "stars": [], "topic_id": 15004, "date_created": 1301070091.651469, "message": "Glen, as an example we used to call the main page the dashboard, but recently changed it to home. In this case it really was not tied to a real functionality change, but we now have two packages, one named dashboard, and one named home. We are working towards the refactor/rename route, but it would be nice to avoid this in the future.", "group_id": 4205, "id": 439830}, {"user_id": 13306, "stars": [], "topic_id": 15004, "date_created": 1301072121.716516, "message": "In some cases, I rename, particularly if the new name vs. old name is confusing.", "group_id": 4205, "id": 440089}, {"user_id": 24649, "stars": [], "topic_id": 15004, "date_created": 1301070329.8416021, "message": "My only idea so far is to do a better job of naming things by their functional concept rather than the \"common\" or business name. Maybe step one is to avoid using the business name in the first place. So if I am asked to build a 'Home Page' I should name it 'LandingPage'. Not sure.", "group_id": 4205, "id": 439853}]