[{"user_id": 5108, "stars": [], "topic_id": 12859, "date_created": 1300044757.8697071, "message": "Anyone else having problems creating apps at ep.io at the moment? A few hours ago I tried to deploy a Django project and it did not show up at the app's URL – http://chezmartina.ep.io/ («ep.io: Unknown app. It seems the URL you've used points to our servers, but we don't have a matching app to serve. We're terribly sorry about that.») . Now it seems that someone else's app («lessfuss») is running under my hostname. Then I tried the simple WSGI app example from the docs – uploading seems to work fine, but it won't show up at http://pbsimple.ep.io/ – instead «App not found» again. Anyone else experiencing similar problems?", "group_id": 2873, "id": 342873}, {"user_id": 5108, "stars": [], "topic_id": 12859, "date_created": 1300046971.020901, "message": "Hm. Seems to be resolved now.", "group_id": 2873, "id": 343319}, {"user_id": 8740, "stars": [], "topic_id": 12859, "date_created": 1300068731.650167, "message": "On a related note, we may move away from using haproxy alone for loadbalancing, but that's a whole part of a talk :)", "group_id": 2873, "id": 344571}, {"user_id": 8740, "stars": [], "topic_id": 12859, "date_created": 1300068714.113395, "message": "Yes, this was related to our loadbalancer problems where haproxy wasn't reading the whole config file. We think we've fixed it now, but shout if something happens again.", "group_id": 2873, "id": 344570}, {"user_id": 8740, "stars": [], "topic_id": 12859, "date_created": 1300142574.8739359, "message": "@jdaguilera It's both their problem and hours; the config file is getting very long, and so it wasn't reloading fast enough. Don't worry - it's not critical (we've increased the reload delay), and we have a fix in the pipeline.", "group_id": 2873, "id": 351738}, {"user_id": 3748, "stars": [], "topic_id": 12859, "date_created": 1300141575.2239599, "message": "What are the reasons?  Is not functioning well? What are going to use instead??", "group_id": 2873, "id": 351608}, {"user_id": 3748, "stars": [], "topic_id": 12859, "date_created": 1300147640.685782, "message": "I am not worried.  Just curious about the reasons and the new approach.  Tks for the answer.", "group_id": 2873, "id": 352188}, {"user_id": 8740, "stars": [], "topic_id": 12859, "date_created": 1300201156.1877429, "message": "No problem. Hopefully we can get a post up about how the new infrastructure works once it's in place.", "group_id": 2873, "id": 356935}, {"user_id": 3748, "stars": [], "topic_id": 12859, "date_created": 1300283497.2639539, "message": "That would be great.  Keep up the good work!", "group_id": 2873, "id": 365800}]