[{"user_id": 18393, "stars": [], "topic_id": 11143, "date_created": 1299441116.921859, "message": "I'm starting to have the same opinion on Apple as Leo is having. They seem to be losing touch with reality.", "group_id": 5074, "id": 281514}, {"user_id": 18393, "stars": [], "topic_id": 11143, "date_created": 1299441808.097429, "message": "Yeah. G4 is awful.", "group_id": 5074, "id": 281547}, {"user_id": 18095, "stars": [], "topic_id": 11143, "date_created": 1299443315.941447, "message": "Whose reality, the technorati or the average Apple consumer?  Apple is slow to add features, so slow that it doesn't make sense for a consumer to replace their gadget every year.  I just hope that the iPad 3 isn't just smoke and the product rev date is changed to early fall so they can redeem this lame duck iPad 2.", "group_id": 5074, "id": 281646}, {"user_id": 19071, "stars": [], "topic_id": 11143, "date_created": 1299510162.4025941, "message": "I've tried to download the new TTG shows since Leo's return from vacation, but they aren't updating the video feed on Google Reader. The last shows available for download are with Scott Williamson hosting.  All other TWiT shows are made available for download via the website. I don't understand why they arent' providing a direct link from the TTG page?", "group_id": 5074, "id": 288108}, {"user_id": 17991, "stars": [], "topic_id": 11143, "date_created": 1299531752.070369, "message": "@rmiller I was able to subscribe and download episodes last night.  Maybe unsubscribe and resubscribe (ie turn it off and back on again ;) )", "group_id": 5074, "id": 291134}, {"user_id": 17991, "stars": [], "topic_id": 11143, "date_created": 1299531846.6775129, "message": "If Leo is swamped I wonder if he is considering only doing 1 day of Tech Guy?  Most syndicated stations only take 1 day anyway...", "group_id": 5074, "id": 291159}, {"user_id": 17932, "stars": [], "topic_id": 11143, "date_created": 1299875645.578182, "message": "I think I heard Leo say at one time that his contract his ending soon, so there may or not be changes in store for TTG", "group_id": 5074, "id": 326731}, {"user_id": 21550, "stars": [], "topic_id": 11143, "date_created": 1300129375.696811, "message": "penis", "group_id": 5074, "id": 349887}, {"user_id": 17097, "stars": [], "topic_id": 11143, "date_created": 1300277972.4873919, "message": "Leo also (used to anyway) call his Tech Guy show his \"day job\", his \"bread and butter\", how he pays the bills. Radio is also his performance roots and, next to J and the kids, the love of his life. I'd be real surprised if Leo dropped off the radio dial, even for this. Not this year, at least.", "group_id": 5074, "id": 364720}, {"user_id": 17912, "stars": [], "topic_id": 11143, "date_created": 1300318543.406955, "message": "I believe he tried to resign from the radio show a few years ago, and they tempted him back by increasing the syndication and number of stations. (And probably a raise, but who knows). I don't think he'd still be doing a show for So. California only, as it started.", "group_id": 5074, "id": 370049}]