[{"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1305884287.5838799, "message": "Last chance for Microsoft & Sony to justify the existence of Kinect & Move to gamers?", "group_id": 9493, "id": 1123689}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1305885046.57586, "message": "Eurogamer reckons Microsoft has 10 hardcore Kinect games lined up for the show, but I guess some of them must be things we know about (like the lame Star Wars game) and others must be arcade games. But Kinect has been selling well, unlike Move. I think we'll see another  big Kinect push at the end of the year just before Microsoft annoucnes the next-gen console in 2012", "group_id": 9493, "id": 1123789}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1305885575.620918, "message": "Kinect HAS been selling well.  But based on what I see here locally, though, I do strongly get the impression that its sales have been very regional.\n\nIt's never been low on stock since launch, it's been discounted off and on, and right now it's easily possible to pick it up for around 90€ — over a ⅓ off.  It seems retailers are still trying to get rid of their Xmas stock.\n\nPlus, of course, we know that Kinect sold about three units total in Japan.\n\nSo though there seems to be some anecdotal evidence that the Kinect has recreated the Wii's original fashionability, I just don't \"feel\" it.", "group_id": 9493, "id": 1123841}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1305962296.1729269, "message": "There are a couple of Kinect titles I'm interested in -- Twisted Pixel's Gunstringer, for one, and it seems that Crytek game announced last year at MS's conference is for Kinect too -- but frankly I'm hoping that MS has some *non*Kinect things to show this year. Which, unfortunately, doesn't seem all that likely :/", "group_id": 9493, "id": 1133173}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306261196.6729729, "message": "CD Projekt announcing a new Witcher game at E3, and \"console gamers might be interested in it\". I'm hoping that it's a console port of Witcher 2, but some other sites are reporting that it's not.\n\nhttp://www.eurogamer.net/articles/2011-05-24-new-witcher-game-to-be-announced-at-e3", "group_id": 9493, "id": 1168940}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306261480.9979119, "message": "Microsoft's E3 conference passes possibly hinting at some kind of Portal announcement/news/presence at their show: http://www.eurogamer.net/articles/2011-05-24-new-witcher-game-to-be-announced-at-e3\n\nhttp://static.arstechnica.com/Gaming/msbadge1.jpg", "group_id": 9493, "id": 1169009}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1306273009.282855, "message": "So Microsoft will be big on the (timed) exclusive DLC again, huh? (Portal, Batman, Tomb Raider).", "group_id": 9493, "id": 1170977}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306297865.1178811, "message": "Rumour has it that Rebecca Black will be performing at the Sony show. Best show ever, confirmed?", "group_id": 9493, "id": 1174089}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1306299531.485007, "message": "Chumbawumba might be more appropriate.", "group_id": 9493, "id": 1174338}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306303491.022954, "message": "Nah. Considering the still-in-limbo state of PSN in Asia - not to mention the Store, everywhere - the \"but I get up again\" line might be a little presumptuous :P", "group_id": 9493, "id": 1175021}, {"user_id": 31866, "stars": [], "topic_id": 36100, "date_created": 1306310364.4589469, "message": "@ZAnimus Witcher 2 for consoles confirmed! ;)", "group_id": 9493, "id": 1175576}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306313788.8664019, "message": "OK, so I'm not staying up for Sony's presser: http://www.eurogamer.net/articles/2011-05-25-sony-e3-press-conference-2011-time", "group_id": 9493, "id": 1175983}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306330639.1317999, "message": "Is it sad that I put in leave for 7 June so I could stay up for all the conferences? It is, isn't it?", "group_id": 9493, "id": 1177884}, {"user_id": 32692, "stars": [], "topic_id": 36100, "date_created": 1306333628.2240529, "message": "I hope you like strange, licensed games.", "group_id": 9493, "id": 1178791}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1306343918.003993, "message": "It's OK, Hermes, I'm off that day too!", "group_id": 9493, "id": 1181104}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1306702080.6975701, "message": "This is probably one of Microsoft's games: http://www.ebgames.com/xbox-360/games/rise-of-nightmares/91195", "group_id": 9493, "id": 1220349}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1306702141.178942, "message": "\"•An unashamedly mature title in a sea of family-friendly offerings on Kinect ...\" \"Use your whole body to fight the undead horde with physical brutality.\" Umm yes.", "group_id": 9493, "id": 1220356}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306702413.7171891, "message": "That was already announced and shown at last year's TGS, though.", "group_id": 9493, "id": 1220382}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1306707460.124752, "message": "Anyone hear any news from Capcom, besides the dodgy Resi game they kinda need to announce something worth our attention. Jap developers... They're just falling further and further behind :( thank goodness for Platinum Games.", "group_id": 9493, "id": 1220984}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306736429.7123661, "message": "I was hoping to be done with undead hordes.", "group_id": 9493, "id": 1224688}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306737068.83922, "message": "Oh yes, I find it really hard to muster any enthusiasm for more zombie games. That being said, I'll gladly take one which does something new with the subject matter (hint: Rise of Nightmares ain't it, although Dead Island might be).", "group_id": 9493, "id": 1224733}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1306737567.95031, "message": "It's a pretty boring context (and very passé now) but I do like when games (and other mediums, like in The Walking Dead, for instance) do interesting things with it. I'd never have guessed that Left 4 Dead would be one of my favourite games, but there it is. Dead Island definitely seems very interesting, and at least more than a little experimental.", "group_id": 9493, "id": 1224784}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306741518.8613689, "message": "One week to go! I'm not really expecting earth-shattering announcements, but I would like confirmation of the Halo remake and a sooner-than-expected release date for Journey.", "group_id": 9493, "id": 1225087}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306742041.1076379, "message": "A wonderfully resourceful NeoGAF member made the following table with all the E3 conference dates and times. We're \"CEST\", obviously.\n\nhttp://i299.photobucket.com/albums/mm309/Dr_Clipper/e3times24.png", "group_id": 9493, "id": 1225133}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306752398.6593561, "message": "webcal://www.me.com/ca/sharesubscribe/1.1332284743/5E465AE4-5012-41C6-8C17-B61A5906C3D9.ics", "group_id": 9493, "id": 1226061}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306752395.5014739, "message": "I stuck these into a calendar that I'm sharing here:", "group_id": 9493, "id": 1226059}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1306786415.940388, "message": "There are Devil May Cry rumours doing the rounds as well.", "group_id": 9493, "id": 1230756}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306784408.625735, "message": "Apparently an HD collection for a \"major PlayStation franchise\" will be announced at E3. It'll be either Metal Gear Solid or Final Fantasy X/X-2/XII, right?", "group_id": 9493, "id": 1230302}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306787477.6391261, "message": "While I certainly wouldn't mind playing DMC3 on a current-gen system, those games were showing their age in a bad way when I played them back in 2006 already. I don't think the usual, quickie HDification would have very pleasant results with those.", "group_id": 9493, "id": 1230968}, {"user_id": 32692, "stars": [], "topic_id": 36100, "date_created": 1306786461.27385, "message": "Boo, that means buying a collection just for one game. I'd be surprised if it wasn't MGS...", "group_id": 9493, "id": 1230768}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1306794498.4056981, "message": "If it's HD MGS then I'll probably just end up getting a heart attack.", "group_id": 9493, "id": 1232325}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1306813616.7807879, "message": "If only we knew someone on Sony's internal mailing list!", "group_id": 9493, "id": 1234046}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306824050.4293799, "message": "Yeah, we'd wheedle the details out of him until we got him fired from his job, the bastard!", "group_id": 9493, "id": 1235151}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306834634.5250831, "message": "Apparently Sony accidentally and prematurely revealed Syphon Filter 4 for PS3 on the PlayStation Blog (they've sinced pulled the post). The game's set for an official reveal at E3. \n\nI know nothing about this franchise -- is it something to be excited about?\n", "group_id": 9493, "id": 1236279}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306838224.2519801, "message": "Man, Sony is bad at keeping secrets!\n\nSo the last Syphon Filter game I played was the first… so I'm obviously not the right person to answer your question.  You could say it's a Westernised take on MGS.  And I guess you could also say that some of the Tom Clancy games definitely took some inspiration for Syphon Filter.\n\nThere's a small but dedicated subculture who will claim that the Syphon Filter games are the best 3rd person stealth games ever produced.  But even they've been quiet of late, seeing as how it's been so long since there's been a mainline release in the franchise.\n\nThe PSP iterations had good reviews, as I remember.  I never did play them, but I'm sure you can pick them up for next to nothing nowadays.", "group_id": 9493, "id": 1236685}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306838901.8023651, "message": "Hmm, sounds promising.", "group_id": 9493, "id": 1236728}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1306927055.757005, "message": "Oh CRIPES.\n\nThere's this one background part of my brain that tracks things like E3 keynotes, and another much larger part of my brain that tracks things like WWDC keynotes, and the two rarely speak to each other… which is why it took me until now to realise that the E3 keynotes and the WWDC keynote fall ON THE SAME DAY this year.\n\nIn fact, the WWDC keynote starts at 10am in San Francisco, exactly an hour after the start of the Microsoft E3 conference in LA.\n\nIt's pretty much a certainty that we'll see no new hardware at WWDC this year, but it has also been officially confirmed that we'll see iOS 5, which should be of more than a little interest to gamers, what with it being likely to be a pretty important gaming platform going forward…\n\nSo… slot that Apple keynote in between Microsoft and EA;  I've updated my calendar (linked above).", "group_id": 9493, "id": 1252035}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1306929964.467562, "message": "Konami's conference last year was embarrassingly bad, which is to say it was by far the most entertaining E3 event. This year's is taking place this Friday already, at 14:00 our time. I don't know yet what the streaming options will be, but I'm sure they'll have ONE MILLION things that they'll be MARKETING THE SHIT OUT OF, so it'll probably be worth watching.", "group_id": 9493, "id": 1252312}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307066645.8916039, "message": "Metal Gear Solid HD Collection coming, on PS3 and 360: http://www.eurogamer.net/articles/2011-06-03-metal-gear-solid-hd-collection-coming", "group_id": 9493, "id": 1273674}, {"user_id": 31753, "stars": [], "topic_id": 36100, "date_created": 1307071951.5233541, "message": "Why no MGS1 love there? I'm sure many people would love to play the Twin Snakes remake on a modern console, I know I would.", "group_id": 9493, "id": 1274126}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307073535.1174071, "message": "Yeah, that seemed weird to me too. *shrugs*", "group_id": 9493, "id": 1274263}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307074781.4891031, "message": "Also announced: Silent Hill HD, with HD ports of SH 2 and 3 (not 1 or 4). Platforms TBC, but presumably PS360. And Silent Hill: Book of Memories for NGP/Vita.\n\nhttp://www.ign.com/videos/2011/06/02/silent-hill-e3-2011-announcements", "group_id": 9493, "id": 1274424}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307080645.3302579, "message": "You have a point, but I personally wouldn't use the word \"plagued\". I'd rather go with \"wonderfully and refreshingly spritzed\", imho :)", "group_id": 9493, "id": 1275046}, {"user_id": 31753, "stars": [], "topic_id": 36100, "date_created": 1307078854.1525249, "message": "I wonder of the final years of the current generation consoles will be plagued by released HD versions of previous generation hits...", "group_id": 9493, "id": 1274884}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307081164.8376751, "message": "Also, the MGS HD ports are being done by the same studio who did God of War HD Collection. Good news, in other words.", "group_id": 9493, "id": 1275088}, {"user_id": 31753, "stars": [], "topic_id": 36100, "date_created": 1307081571.5944409, "message": "It's only a matter of time before they start HD-ing the minor hits, and then it's a slippery slope downwards.", "group_id": 9493, "id": 1275126}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1307082374.3895299, "message": "They should make HD versions of Contra, Megaman and Mappy too. Then ZAnimus might play it...", "group_id": 9493, "id": 1275195}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307085953.7963941, "message": "I'd love Konami to take a leaf from Ubisoft's book with the Prince of Persia trilogy and make the games seperately downloadable. I'm up for Peace Walker, but I'm not sure I really want to play MGS2 and 3 yet again.", "group_id": 9493, "id": 1275498}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307086106.6815591, "message": "Keighley and GTTV have an exclusive first look at a bunch of upcoming games, including SoulCalibur V, SSX, Prey 2, Tomb Raider, Uncharted 3 Co-Op and Spider-Man: Edge of Time:\n\nhttp://www.spike.com/full-episodes/cjsthu/gttv-e3-first-look-season-4-ep-412", "group_id": 9493, "id": 1275513}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307086021.297473, "message": "Or ever again.", "group_id": 9493, "id": 1275509}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307087498.1422241, "message": "Ehhh, sorry. Mr_V tells me this might be US only. :(", "group_id": 9493, "id": 1275592}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307089779.0395989, "message": "I'm kind of with Broken.  It's possible to push this too far.\n\nGive me the Team ICO Collection and the Clover Collection (*cough*) and the Jak Collection (*cough cough COUGH*), and I'm happy.  Much beyond that, and it starts to become filler… time that would best have been put to use producing original content.", "group_id": 9493, "id": 1275736}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307091023.2585549, "message": "There's not much else other than what's already been announced from the PS2 era that I'd like to see given the HD treatment other than what Mr_V's already mentioned. FFX would be nice, I guess.", "group_id": 9493, "id": 1275861}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307102393.1040471, "message": "Except Broken doesn't want the \"minor hits\". You know, like ICO and Jak and everything Clover ever did ;)\n\nJokes aside, I don't see any real danger here. These ports are small- and cheap enough projects to not draw development resources away from new and more exciting projects. Plus, they don't really sell to the masses. God of War Collection and Sly Collection both faded out of retail distribution almost as soon as they'd been released; publishers wouldn't even bother unless they knew there was a core group of fans who'd definitely buy it.", "group_id": 9493, "id": 1276557}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1307102411.7322731, "message": "Not sure if anyone posted this yet, but it explains the HD MGS Collection in more details, along with ZOE HD... but he also shows us a future title he's working on: http://www.youtube.com/watch?v=VqCneCdZS7Y&feature=player_embedded", "group_id": 9493, "id": 1276560}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307351026.272773, "message": "According to a Forbes blogger, Sony will be announcing a \"new GOD OF WAR 3D adventure\" at its press conference tonight.", "group_id": 9493, "id": 1301530}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307351410.2982359, "message": "That's a pretty big announcement. But to be honest, after God of War 3 and Ghost of Sparta, I really feel this franchise has lost its spark and needs to be put on ice. It'd be cool if the next one is some sort of reboot, with significant differences from the previous games, but I wouldn't count on it.", "group_id": 9493, "id": 1301546}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307351741.6851959, "message": "They probably won't be brave enough to bring in a new character, which is something they should do because there isn't much more they can do with Kratos. There are no more gods and titans left for him to kill.", "group_id": 9493, "id": 1301552}, {"user_id": 31753, "stars": [], "topic_id": 36100, "date_created": 1307353398.8048229, "message": "I've had enough God of War myself. Time to put their skills to use on something new...", "group_id": 9493, "id": 1301667}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307360316.7725849, "message": "How Konami's E3 conference came to be…\n\nhttp://h7.abload.de/img/seinkonamie35udz.gif", "group_id": 9493, "id": 1302179}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307365699.6440339, "message": "I've got a bad feeling about this: http://www.youtube.com/watch?v=vrZN5K7JwVM", "group_id": 9493, "id": 1302766}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307365799.5102439, "message": "I think \"here\" (Convore, if not necessarily this thread) is probably a good idea.  It's just async chat, no?\n\nI might not be here for the Microsoft and Apple conferences, though, as they fall in the middle of my evening family routine.  And I don't think I'm staying up till 2 for Sony.\n\nSo, um I guess… maybe I wont be here at all.  But I'll check in after 8, definitely.", "group_id": 9493, "id": 1302784}, {"user_id": 32057, "stars": [], "topic_id": 36100, "date_created": 1307365949.809689, "message": "Yeah MS lands plumb on dinner time for me, will catch the second half of it though...", "group_id": 9493, "id": 1302814}, {"user_id": 32057, "stars": [], "topic_id": 36100, "date_created": 1307365606.7341881, "message": "So in true spirit of E3, Will we be live blogging here, in this thread? Or are there just gonna be Twitter spams galore?", "group_id": 9493, "id": 1302750}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307366584.451519, "message": "Good idea to create separate threads after some moron posted an *animated .gif* in this one!", "group_id": 9493, "id": 1302948}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307369876.514442, "message": "Pinch. Salt. Take. Apparent accidental leak of e3 annoucments on  Microsoft's web site: http://loot-ninja.com/wp-content/uploads/2011/06/Xbox-E3-2011-Page-Crop-620x333.jpg", "group_id": 9493, "id": 1303745}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1307375248.034879, "message": "Got to say, that looks like the real deal...", "group_id": 9493, "id": 1305059}, {"user_id": 31852, "stars": [], "topic_id": 36100, "date_created": 1307375457.1393819, "message": "It does, yes. And with three games that I'd personally be interested in playing (the two Halos and DC2) it's a somewhat stronger showing than I expected this year, although it does seem like it's going to be a conservative, relatively unexciting show.\n\nAre exciting, original IPs for core gamers too much to hope for this late in the generation? It probably is :/", "group_id": 9493, "id": 1305116}, {"user_id": 33318, "stars": [], "topic_id": 36100, "date_created": 1307375577.1214681, "message": "Nope, not there this year. This year I'll be at Gamescom :)", "group_id": 9493, "id": 1305150}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307375428.197001, "message": "Disappointing if true, especiallyabout Projects Kingdom being a Kinect game. Are you there this year Dawid?", "group_id": 9493, "id": 1305109}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307375812.0234389, "message": "Halo 1 will need some major reconstructive surgery to be interesting at this point in time IMO. I wonder if it will just be a HD hack job or a remake with new assets, updated gameplay mechanics and of course the full suite of next-gen maps?", "group_id": 9493, "id": 1305199}, {"user_id": 25703, "stars": [], "topic_id": 36100, "date_created": 1307505107.205291, "message": "My photos (be warned, I'm no photographer and these were taken from my iPhone): http://www.facebook.com/media/set/?set=a.519400457098.2014885.193700567", "group_id": 9493, "id": 1333062}, {"user_id": 31866, "stars": [], "topic_id": 36100, "date_created": 1307520485.1350269, "message": "*sniff* No TLG date *sniff*", "group_id": 9493, "id": 1334804}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307519848.9789209, "message": "http://i.imgur.com/BhYHo.gif", "group_id": 9493, "id": 1334754}, {"user_id": 32282, "stars": [], "topic_id": 36100, "date_created": 1307521312.704838, "message": "I'm still in shock about that Microsoft presser. It was like Nintendo E3 2009 all over again. I guess with the strong third-party line-up and most core gamers buying their multiplayer games on the 360, Microsoft feels no need to real try for our affections any more.", "group_id": 9493, "id": 1334868}, {"user_id": 31927, "stars": [], "topic_id": 36100, "date_created": 1307723776.6739349, "message": "Anyone have links to videos (stream or download) of the press conferences in their entirety?  GameTrailers broke them up into snippets, it seems.", "group_id": 9493, "id": 1362767}, {"user_id": 31866, "stars": [], "topic_id": 36100, "date_created": 1307769216.7941501, "message": "Where was Valve during E3? No HL3/ep3 or any new content coming to the PS3 via Steam? I am disappoint!", "group_id": 9493, "id": 1368625}]