[{"user_id": 11626, "stars": [], "topic_id": 43381, "date_created": 1312598007.1605489, "message": "FALSE FLAG FRIDAY 8/5/11\n\nWelcome to the \"False-Flag Friday\" edition of SCMLA's News Digest!\n\n\nAlex Jones: US Gov’t Protected Sinaloa Drug “Cartel”\nTheAlexJonesChannel\nAugust 5, 2011\n\nAlex Jones breaks down the truth behind the U.S. Government’s willing collaboration with large-scale narcotrafficking, even as the mainstream media now has to admit that major drug gangs are operating with official approval.\nhttp://www.infowars.com/alex-jones-us-government-protected-sinaloa-drug-cartel\n\n\nThe Mysterious Death of Osama bin Laden: Creating Evidence Where There Is None\nInfowars.com\nAug 5, 2011\n\nThe New Yorker has published a story planted on Nicholas Schmidle by unidentified sources who claim to be familiar with the alleged operation that murdered Osama bin Laden. There is no useful information in the story. Its purpose seems simply to explain away or cover up holes in the original story, principally why did the Seals murder an unarmed, unresisting Osama bin Laden whose capture would have resulted in a goldmine of terrorist information and whose show trial would have rescued the government’s crumbling 9/11 story? The gullible Schmidle tells us: “‘There was never any question of detaining or capturing him–it wasn’t a split-second decision. No one wanted detainees,’ the special-operations officer told me.” In other words, the SEALs murdered bin Laden, because the US government did not want detainees, not because trigger-happy stupid SEALs destroyed a font of terrorist information.\nhttp://www.infowars.com/the-mysterious-death-of-osama-bin-laden-creating-evidence-where-there-is-none\n\n\nMedia Matters: Jones Covering Gun Confiscation Will Get Cops Killed\nInfowars.com\nAugust 4, 2011\n\nThe George Soros funded disinfo operation, Media Matters, has recycled propaganda in an effort to attack and discredit Alex Jones. Writing for David Brock’s attack dog organization tied to establishment Democrats and the pro-war Center for American Progress, Chris Brown attempts to once again connect Jones to Richard Poplawski, the deranged lunatic who murdered three Pittsburgh police officers in 2009. Poplawski was found guilty by a jury on June 28, 2011, and sentenced to death. Media Matters insists Poplawski killed the police officers because he was convinced they were coming for his guns. Alex Jones was responsible for planting this idea in his head, they insist. “Poplawski’s friends and family say he actually believed this bizarre conspiracy theory, which he gleaned parts of from an extremist conspiracy website and radio program run by Alex Jones, a well known conspiracy monger,” Brown writes. Brown fails to mention the fact that the Poplawski link to Alex Jones was debunked after it was discovered that the cop killer held views opposed to those of Jones. This was admitted by none other than the ADL, we reported on April 6, 2009, two days after the shooting.\nhttp://www.infowars.com/media-matters-jones-covering-gun-confiscation-will-get-cops-killed\n\nGovernment to Monitor Social Networks For “Extremist Propaganda”\nNew White House plan follows Pentagon advisory targeting protests against Federal Reserve\nInfowars.com\nAugust 4, 2011\n\nA new strategy document released by the White House promises to “closely monitor…the Internet and social networking sites” in order to “counter online violent extremist propaganda” as the federal government attempts to embed itself further in local communities under the guise of preventing domestic extremism. The document, Empowering Local Partners to Prevent Violent Extremism in the United States (PDF), focuses on identifying Americans who have supposedly been radicalized or groomed by Al-Qaeda to carry out attacks in the United States. As the L.A. Times notes, the plan involves “federal departments not usually associated with national security,” and is heavily focused around increasing the federal government’s involvement with schools and the “emotional and behavioral development” of young people. The document defines extremist propaganda as that which is used to “feed on grievances” and “assign blame.” The government vows to “aggressively” combat such ideology by “continuing to closely monitor the important role the internet and social networking sites play in advancing violent extremist narratives.” In targeting the Internet and social networking websites for surveillance in the name of fighting domestic terrorism, the White House is continuing in the vein of the previous administration who in 2006 revealed that since 9/11 they had been pursuing a plan to diminish the role of “conspiracy theories” as a primary recruitment tool for terrorists. The document arrives in the same week that the Pentagon also announced it would be hiring individuals to “detect and track popular ideas on social networks”.\nhttp://www.infowars.com/government-to-monitor-social-networks-for-extremist-propaganda\n\nFormer CIA Official Predicts Cyber 9/11\nInfowars.com\nAugust 4, 2011\n\nCofer Black, veteran CIA spook and former vice chairman of the mercenary outfit Blackwater, sees parallels between the terrorism threat that emerged before the September 11 attacks nearly ten years ago and the emerging cyber threat we supposedly confront now, according to Reuters. Black worked nearly 30 years for the Directorate of Operations at the CIA, now known as the National Clandestine Service. As former CIA employee John Stockwell noted, the unit has “engineered covert action operations in virtually every corner of the globe,” resulting in violent coups and countless people killed. In 2007, it was revealed that more than 50 percent of the National Clandestine Service has been outsourced to private firms. Black mounted the stage at a Black Hat conference in Las Vegas to make his prediction. “Your world, which everyone thought was college pranks … has morphed into physical destruction,” he told the nearly 6,000 hackers and security professionals at the conference, reports the Wall Street Journal. “Guess what: It is your turn whether you know it or not.” Black’s comments fall on the heels of a suggestion by former CIA and NSA boss Michael Hayden that a “digital Blackwater” may be required to combat the threat of cyber terrorism.\nhttp://www.infowars.com/former-cia-official-predicts-cyber-911\n\nDocuments: Feds allegedly allowed Sinaloa cartel to move cocaine into U.S. for information\nEl Paso Times\nAugust 4, 2011\n\nU.S. federal agents allegedly allowed the Sinaloa drug cartel to traffic several tons of cocaine to the United States in exchange for information about rival cartels, according to court documents filed in a U.S. federal court. The allegations are part of the defense of Vicente Zambada-Niebla, a top lieutenant of drug kingpin Joaquin “Chapo” Guzman, who was extradited to the United States to face drug-trafficking charges in Chicago. The case could prove to be a bombshell on par with the ATF’s “Operation Fast and Furious,” except that instead of U.S. guns being allowed to walk across the border, the Sinaloa cartel was allowed to bring drugs into the United States over a five-year period, the documents allege.\nhttp://www.elpasotimes.com/ci_18608410\n\nVirginia Tech On Lockdown Following Report of Gunman\nABC News\nAugust 4, 2011\n\nVirginia Tech, the site of the worst campus shooting in U.S. history, is on lockdown with reports of a gunman on the campus. The university relations office confirmed that there is an alert but would offer no further detail. Students received text messages and emails that a gunman is on the campus. \"Person with a gun reported near Dietrick. Stay inside. Secure doors. Emergency personnel responding. Call 911 for help,\" the alert warned. On the university's web site, a message was posted at 9:37 a.m. alerting students that there is a gunman near Dietrick Hall. Dietrick Hall is a three floor, more than 92,000 square foot dining facility on the Blacksburg, Va., campus, according to the university's web site. Students have been told to stay indoors.\nhttp://abcnews.go.com/US/virginia-tech-gunman-loose-blacksburg-virginia-campus/story?id=14230729\n\nVirginia Tech Shooting 'Oddities' Compiled by Lori Price\nCitizens For Legitimate Government\nAugust 4, 2011\n\nHeads up! The false flags are about to come fast and furious as the US economy tanks after manufactured debt ceiling 'crisis:' Please see: Virginia Tech Shooting 'Oddities' Compiled by Lori Price.\nhttp://www.legitgov.org/virginia_tech_shooting_oddities.html\n\nThere Is A North America-Wide Strategy To Take Away The Right To Mass Protest, Using Terrorism To Stifle Dissent\nNorth Americans no longer have the right to mass protest. Courts rule those arrested and beaten during mass protests have no right to legal recourse against the establishment.\nThe Intel Hub\nAugust 4, 2011\n\nThis video explains how the police state infiltrates peaceful groups and demonizes them under the name of terrorism. They then use slander, harassment, illegal rubber stamped warrants, illegal surveillance, and agent provocateurs to conduct mass arrests. We now find ourselves in a country where the police are actively working against the people and for the tyrannical federal government. This is documented and should be a red alert to the people of the world no matter their political affiliation. The people of the world have a RIGHT to mass protest. When police officers and intelligence agents openly infiltrate groups it is an act of political terrorism. After the police infiltrate the protest group and cause mayhem, the corporate controlled media then blames the group for what the police actually did. If we continue to let big government use their storm troopers to stifle dissent we will soon find ourselves in a complete police state where any sort of political speech is outright illegal.\nhttp://theintelhub.com/2011/08/05/there-is-a-north-america-wide-strategy-to-take-away-the-right-to-mass-protest-using-terrorism-to-stifle-dissent\n\nDEADLINE LIVE EXCLUSIVE: DEA Protecting the Most Dangerous and Powerful Mexican Drug Cartel\nDeadline Live\nAugust 3, 2011\n\nThe Mexican drug war that began in 2004 was started by the Sinaloa Drug Cartel with the blessing and the protection of the DEA. The Sinaloa Drug Cartel reached an agreement with the DEA to provide information about drug cartel rivals. In exchange, the DEA would protect their drug shipments and their people. For several years now, DeadlineLive.info has been reporting that Mexico’s biggest and most powerful drug cartel, known as the Sinaloa Cartel, has been protected by the DEA and the CIA. The entire leadership of the Sinaloa Cartel is made of CIA operatives and DEA informants. The Sinaloa Drug Cartel is headed by Joaquin ‘El Chapo’ Guzman, who is listed among one of the richest men in the world according to Forbes Magazine. Ever since his capture and ‘mysterious’ escape from a maximum security prison in 2001, everyone in Mexico believes Guzman reached a deal with the DEA to provide information about his rival cartels. In exchange, the DEA would provide protection for him, his people, and his drug shipments. Guzman would also allow DEA operatives into his organization. This was kind of a rumor in Mexico; however, today we know it’s true. In essence, the Mexican Drug War that began around 2003-2004 with the capture of Gulf Drug Cartel leader Osiel Cardenas, was indeed started by the DEA through the Sinaloa Cartel. Guzman also betrayed his inner circle members: The Beltran-Leyva Brothers, who left his organization after they found out they were being ratted-out.\nhttp://deadlinelive.info/2011/08/03/deadline-live-exclusive-dea-protecting-the-most-dangerous-and-powerful-mexican-drug-cartel\n\nUS proposes ammonium nitrate regulations\nMSNBC\nAugust 3, 2011\n\nThe Department of Homeland Security is proposing to restrict the sale of ammonium nitrate, a commonly used fertilizer that has also been an ingredient in terrorist bombings for decades. Under the rule to be formally published Wednesday, anyone who buys large amounts of ammonium nitrate, including farmers or workers seeking to use it as an explosive in mining or construction, would be required to register in advance. If they're not on any government watch lists, they'd get a federal user number which, along with a photo ID, would allow them to make purchases. Dealers would be barred from selling more than 25 pounds of ammonium nitrate to anyone who wasn't registered and would also be required to keep records of all sales.\nhttp://today.msnbc.msn.com/id/43990321/ns/us_news-security\n\nNew York police launch system to detect and track radiation\nReuters\nAugust 3, 2011\n\nThe New York Police Department is launching a mobile radiation detection system equipped with location-tracking GPS technology that it says could help avert a so-called \"dirty\" bomb attack. While more than 2,000 belt-mounted radiation detectors are already used by city police, this will be the first time in the United States they will be combined with GPS technology to allow central monitoring, police spokesman Paul Browne said. If the technology is proven in New York it could appear elsewhere in the country.\nhttp://www.reuters.com/article/2011/08/03/us-newyork-radiation-idUSTRE7720D220110803\n\nBreaking: Feds Caught Shipping Cocaine into U.S. (video)\nTheAlexJonesChannel\nAugust 3, 2011\n\nFederal agents in the U.S. okay’d tons of cocaine in exchange for info from drug cartel.\nhttp://www.infowars.com/breaking-feds-caught-shipping-cocaine-into-u-s\n\nNRA To Sue Feds Over ATF Intimidation Of Gun Sellers\nHolder says measures are “appropriate” to stop flow of guns into Mexico even as feds caught directly shipping firearms to Mexican drug gangs\nInfowars.com\nAugust 3, 2011\n\nThe NRA is set to file a lawsuit challenging a federal “regulation” that requires gun merchants to report sales of more than one firearm directly to the ATF, a policy that is being enforced by harassment and intimidation of gun owners despite the fact that language codifying the measure was rejected by Congress back in April. “The N.R.A. is bringing the lawsuit in the name of two firearms dealers in Arizona. Its draft complaint, a copy of which was obtained by The New York Times, asks a federal judge in the United States District Court for the District of Columbia to issue an injunction barring enforcement of the rule by the Bureau of Alcohol, Tobacco, Firearms and Explosives,” reports the New York Times. “N.R.A. has always viewed this as a blatant attempt by the Obama administration to pursue their gun-control agenda through back-door rule making, and the N.R.A. will fight them every step of the way,” said Wayne LaPierre, the executive vice president of the gun-rights group.\nhttp://www.infowars.com/nra-to-sue-feds-over-atf-intimidation-of-gun-sellers\n\nMosque set on fire in Germany\nPressTV\nAugust 1, 2011\n\nA mosque being built in the Ruhr region of western Germany was set on fire earlier this month and right-wing extremists are the main suspects. However, no one has been arrested or charged yet. The Islamic Community Milli Goerues of Germany (IGMG) began the construction of the Dar-ul-Ekram Mosque about two years ago, the IGMG news agency reported.\nhttp://www.presstv.ir/detail/191893.html\n\nNuclear-Detection Effort Is Halted as Ineffective\nNew York Times\nAugust 1, 2011\n\nThe Obama administration has quietly canceled a much-criticized billion-dollar program to equip ports across the United States with detectors to pick out radioactive material and nuclear weapons being shipped into the country, after acknowledging that the devices did not work. While the Obama administration has not publicly announced the decision, Warren Stern, the director of the Domestic Nuclear Detection Office, a branch of the Department of Homeland Security, said in Congressional testimony this week that the program \"will not proceed as originally envisioned.\"\nhttp://www.nytimes.com/2011/07/30/us/30nuke.html\n\nFBI, ATF join investigation into Texas Planned Parenthood bombing\nPegasus News\nAugust 1, 2011\n\nThe hunt is still on for the person or persons responsible for throwing a Molotov cocktail at a McKinney women's clinic, and now, the federal authorities have joined the search. McKinney police officials confirmed Friday that the Federal Bureau of Investigation's (FBI) and the U.S. Bureau of Alcohol, Tobacco and Firearms' (ATF) Dallas field offices have joined the McKinney Police Department's investigation into Tuesday's attack on the Planned Parenthood clinic on Eldorado Parkway.\nhttp://www.pegasusnews.com/news/2011/jul/30/fbi-atf-join-investigation-mckinney-clinic-bombing\n\nUK Police Tells Public To Report Anti-Government Beliefs As Terrorism\nBriefing conflates dissent against the state with Al-Qaeda\nInfowars.com\nAugust 1, 2011\n\nThe London Metropolitan Police is encouraging businesses and the general public to immediately report anyone who holds anti-government political beliefs to the authorities as terrorists, calling on people to become volunteer informants as the state prepares for widespread social unrest. “This was the surprising injunction from the Metropolitan Police issued to businesses and members of the public in Westminster last week,” reports the London Guardian. “There was no warning about other political groups, but next to an image of the anarchist emblem, the City of Westminster police’s “counter terrorist focus desk” called for anti-anarchist whistleblowers stating: “Anarchism is a political philosophy which considers the state undesirable, unnecessary, and harmful, and instead promotes a stateless society, or anarchy. Any information relating to anarchists should be reported to your local police.” In also calling on people to report Al-Qaeda paraphernalia to police, the briefing conflates “anarchists” with terrorists.\nhttp://www.infowars.com/uk-police-tells-public-to-report-anti-government-beliefs-as-terrorism\n\nNorway massacre: British traders helped supply Breivik's arsenal of weapons\nThe Telegraph\nAugust 1, 2011\n\nBritish suppliers provided key equipment which helped Anders Behring Breivik build his arsenal of weaponry and explosives. Breivik used eBay traders across the world including the UK to obtain armaments for the shooting spree on Utoya island and chemicals for the bomb he detonated in Oslo, killing a total of 77 people. A Sunday Telegraph investigation... showed that an essential chemical for the bomb was bought from a British trader for just a few pounds, and that a British tool company sold Breivik equipment which he used to make poison-tipped bullets.\nhttp://www.telegraph.co.uk/news/worldnews/europe/norway/8673118/Norway-massacre-British-traders-helped-supply-Breiviks-arsenal-of-weapons.html\n\nFBI unable to find army rifles\nBig News Network\nJuly 31, 2011\n\nThe US Federal Bureau of Investigation has been unable to track down two dozen rifles stolen from a military base in California. The rifles, stolen on July 15th, were AK-47s which had been stored in a supply warehouse at the army post at Fort Irwin military base in the southern California. The Washington Post has reported the FBI is now offering a reward of up to $10,000 for information leading to the location of the firearms.\nhttp://feeds.bignewsnetwork.com/?sid=818650\n\n27 rifles stolen from Southern California military base\nWashington Post\nJuly 30, 2011\n\nMore than two dozen assault rifles have been stolen from a Southern California military base, and investigators sought the public's help as they looked to arrest suspects and recover the weapons, federal officials said Friday. Twenty-six AK-74 assault rifles and one Dragunov sniper rifle were stolen from a supply warehouse at Fort Irwin in San Bernardino County on July 15, the Bureau of Alcohol, Tobacco, Firearms and Explosives says in a statement.\nhttp://www.washingtonpost.com/national/27-rifles-stolen-from-southern-california-military-base-feds-offer-reward-for-more-arrests/2011/07/29/gIQAbxWGiI_story.html\n\nGun Grabbers in Congress Exploit Fast & Furious\nInfowars.com\nJuly 31, 2011\n\nEarlier this month, Rep. Carolyn Maloney introduced “Stop Gun Trafficking and Strengthen Law Enforcement Act,” H.R. 2554, a gun-grabbing bill little noticed by the corporate media. It is co-sponsored by Elijah Cummings, Democrat and Ranking Member of the House Oversight and Government Reform Committee, and notorious gun-grabber Carolyn McCarthy. Democrats introducing legislation designed to chip away at the Second Amendment is nothing new. This time around, however, the amazing part is Maloney and her co-conspirators are using the government’s gun smuggling program, Fast & Furious, as an excuse to clamp down on “illegal trafficking” in firearms. As the BATF admitted during hearings, the government didn’t entice gun dealers or send in informants to sell guns to drug cartels in Mexico. Instead, they sold 30,000 guns to the banker financed cartels through so-called “straw purchasers,” who were mostly “a bunch of kids.” The effort went up the chain of command to the director of the ATF, Kenneth Melson, who will probably retire in disgrace. AK-47s, sniper rifles and .38-caliber revolvers from the U.S. are showing up at Mexican crime scenes at an alarming rate. They are responsible for the murder of police, innocent bystanders, and countless victims of the drug cartels financed by Wacovia and other U.S. banks. Instead of prosecuting people at the BATF and the Justice Department, Maloney and her cohorts are using Fast & Furious as an excuse to further strip Americans of their Second Amendment rights. Her bill would lower the bar on gun trafficking and criminalize what is now considered legal trade in firearms.\nhttp://www.infowars.com/gun-grabbers-in-congress-exploit-fast-furious\n\nMystery surrounds loss of records, art on 9/11\nAssociated Press\nJuly 30, 2011\n\nNEW YORK (AP) -- Letters written by Helen Keller. Forty-thousand photographic negatives of John F. Kennedy taken by the president's personal cameraman. Sculptures by Alexander Calder and Auguste Rodin. The 1921 agreement that created the agency that built the World Trade Center. Besides ending nearly 3,000 lives, destroying planes and reducing buildings to tons of rubble and ash, the Sept. 11, 2001, attacks destroyed tens of thousands of records, irreplaceable historical documents and art. In some cases, the inventories were destroyed along with the records. And the loss of human life at the time overshadowed the search for lost paper. A decade later, agencies and archivists say they're still not completely sure what they lost or found, leaving them without much of a guide to piece together missing history.\nhttp://hosted.ap.org/dynamic/stories/U/US_SEPT_11_LOST_RECORDS?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2011-07-30-22-50-48\n\nBusinesses play critical role in thwarting terror\nAssociated Press\nJuly 30, 2011\n\nKILLEEN, Texas (AP) -- Ultimately, it was the keen eye of a Texas gun shop clerk that helped authorities find an AWOL soldier who'd stashed bomb-making material in his nearby motel room for a planned attack on Fort Hood soldiers. The tip that led Killeen police to Pfc. Naser Abdo on Wednesday prevented what could have been the second terrorist attack on the Army post, following a 2009 shooting rampage in which an Army psychiatrist is charged with killing 13 people. Earlier this year in Texas, a shipping company that told the FBI about a suspicious order for a chemical explosive foiled an alleged plot to blow up former President George W. Bush's Dallas home. The enduring lesson for a post-9/11 world: America's work force plays a crucial role in preventing potential terror attacks.\nhttp://hosted.ap.org/dynamic/stories/U/US_AWOL_SOLDIER_TERROR_TIPS?SITE=AP&SECTION=HOME&TEMPLATE=DEFAULT&CTIME=2011-07-30-14-29-33", "group_id": 3920, "id": 1807309}]