[{"user_id": 14826, "stars": [], "topic_id": 16228, "date_created": 1301492345.8797841, "message": "In our production environment at work, we're finally getting around to moving MySQL off of its old box.  It didn't have any redundancy before so we're looking into adding some.  After doing some googling, I've found lots of information on clustering or working up a master/slave or master/master environment.  How have you guys set this up on your servers?", "group_id": 4606, "id": 481626}, {"user_id": 2633, "stars": [], "topic_id": 16228, "date_created": 1301514839.73716, "message": "(Not that I've had to go past a single sql server, so take this with a grain of salt) I think it has a lot to do with how read/write heavy your app is. If it's 90% writes, a read-only slave won't do much. If you just want redundancy, then I would imagine a master/slave setup would do the trick, as long as the slave is good at keeping up with the master.", "group_id": 4606, "id": 484584}, {"user_id": 14826, "stars": [], "topic_id": 16228, "date_created": 1301515487.0167601, "message": "Thanks - for the most part, the app exists to serve out a bunch of static content files.  So there aren't many writes.  We were thinking that a master/slave might do the trick.  The only problem is if the master goes down then we'd have to figure out how to get the slave turned into a master PDQ.", "group_id": 4606, "id": 484683}, {"user_id": 14826, "stars": [], "topic_id": 16228, "date_created": 1301517607.644347, "message": "@darkhelmetlive Damn...meant to reply with that last comment.", "group_id": 4606, "id": 485007}, {"user_id": 21834, "stars": [], "topic_id": 16228, "date_created": 1301520961.7282579, "message": "+1 vote for master/slave", "group_id": 4606, "id": 485263}, {"user_id": 13919, "stars": [], "topic_id": 16228, "date_created": 1301521906.596498, "message": "+1, I've used MySQL replication in the past on a db with a relatively high number of writes and it still performed well. I was always impressed with how quick it was to setup MySQL master/slave replication.", "group_id": 4606, "id": 485318}]