[{"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1299136626.5623209, "message": "The Dramatica group in San Francisco discussed In Bruges during the last two meetings. We spent time discussing potential options given to us by the software, and made the best choices based on our experience and understanding thus far. We did not complete the StoryGuide, but this is how far we got:\n\nCHARACTER DYNAMICS:\nMC RESOLVE:  Change\nMC GROWTH:   Stop\nMC APPROACH:  Do-er\nMC MENTAL SEX:  Male\nOC RESOLVE:  Steadfast\n\nOBJECTIVE STORY\nDOMAIN:  Universe\nCONCERN:  The Future\nISSUE:  Openness vs. an unchosen item\nPROBLEM:  Consider\nSOLUTION:  Reconsider\nFOCUS:  Faith\nDIRECTION:  Disbelief\nCATALYST:  Delay\nINHIBITOR:  Dream\nBENCHMARK:  Progress\n\nOBSTACLE CHARACTER\n(IMPACT CHARACTER (Ken))\nPROBLEM:  Pursuit\nSOLUTION:  Avoidance\nFOCUS:  Faith\nDIRECTION:  Disbelief\nUNIQUE ABILITY:  Commitment\nCRITICAL FLAW:  Morality\n\nMAIN CHARACTER\n(MAIN CHARACTER (Ray))\nPROBLEM:  Consider\nSOLUTION:  Reconsider\nFOCUS:  Logic\nDIRECTION:  Feeling\nUNIQUE ABILITY:  Self Interest\nCRITICAL FLAW:  Responsibility\n\nSUBJECTIVE STORY\nDOMAIN:  Mind\nCONCERN:  The Subconscious\nISSUE:  Closure vs. an unchosen item\nPROBLEM:  Consider\nSOLUTION:  Reconsider\nFOCUS:  Pursuit\nDIRECTION:  Avoidance\nCATALYST:  Hope\nINHIBITOR:  Choice\nBENCHMARK:  The Preconscious", "group_id": 2515, "id": 258729}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1299183369.8947389, "message": "I wish I could help you. I haven't seen it.", "group_id": 2515, "id": 263112}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1299192688.2364919, "message": "Next week Chris is going to discuss the movie at the DUG in Burbank. Once the podcast is released, I would like to discuss the differences.", "group_id": 2515, "id": 264774}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1299193447.064091, "message": "I think that's a really valuable way to learn. I recently did a breakdown of The Exorcist, and in the end came to very different conclusions than the storyform on the site.", "group_id": 2515, "id": 264859}, {"user_id": 7645, "stars": [], "topic_id": 10433, "date_created": 1299864141.5577071, "message": "We came up with a considerably different storyform in the Dramatica User Group. It was an extremely interesting discussion as I was fairly convinced the OS was in Psychology but Sandy managed to \"manipulate\" me into thinking it was in Mind. After that it was easy to see where the rest of the story fit.  Podcast should be up sometime next week.", "group_id": 2515, "id": 324887}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1299868709.3233249, "message": "Now I'm going to have to watch this.", "group_id": 2515, "id": 325463}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1299894694.081254, "message": "That's going to be very interesting.", "group_id": 2515, "id": 329461}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1300202796.1278369, "message": "Oh, I know what I wanted to mention. We began our analysis using the Start Here button, beginning at the top of the list with Character Storyforming. The OS Domain of Universe was pre-populated for us by the time we got to Theme Storyforming.", "group_id": 2515, "id": 357335}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1300208340.052146, "message": "Why did you start with the Start Here button and not the Story Engine?", "group_id": 2515, "id": 358569}, {"user_id": 7645, "stars": [], "topic_id": 10433, "date_created": 1300208519.469099, "message": "Usually at the DUG meetings we figure out the four throughlines, then the Main Character dynamics, then the story dynamics (driver, limit, outcome, judg.), then we kind of guess and argue over where the four throughlines fall. Only then do we actually turn the software on and by using a combination of the theme browser and story engine we kind of figure it out. It seems to work better the longer you can go without going to the software (because it is so accurate and precise)", "group_id": 2515, "id": 358598}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1300213788.2558589, "message": "Jim, that sounds like a great approach. I think that by the end of the year there will be enough regulars in the group who have become familiar enough with the theory to follow that lead.", "group_id": 2515, "id": 359197}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1300213705.113868, "message": "Mike, we began with the Start Here button because it says \"Start Here.\" None of us attending the group, myself included, have enough experience with the software an theory to teach it right-out, so we started In Bruges as an experiment. I knew from Melanie's training that starting at the Start Here point is probably (usually) not the best place to start, especially for new writers, and announced that to those attending when we began. Starting There was an experiment and we knew that our storyform may turn out to be completely different than the Burbank DUG. Now, even though our storyform is different, we were able to work through much of the vocabulary and related elements of the definitions to scenes in the story, making it very worthwhile our time and effort.", "group_id": 2515, "id": 359191}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1300214631.480969, "message": "I wasn't criticizing. I thought you had listened to some podcasts and was curious why you'd decided on a different route. \n\nWorking through the vocab, though, is the best thing you can do. I think I've mentioned this before, but my first storyform took me about 21 attempts to get right. Throwing yourself in really is just about the best (and only) successful tactic.\n\nI just watched \"The Wedding Banquet\" and am already dreading the analysis. It always takes me a few stabs, still, to get things to fall into place.", "group_id": 2515, "id": 359323}, {"user_id": 7712, "stars": [], "topic_id": 10433, "date_created": 1300257915.5804739, "message": "Hi Mike, if I came across as too abrupt then I apologize because it means my academics are beginning to stress me out a bit this semester, and that stress is usually something that I have under control. Thank you for bringing my stress to my attention, and please know that I didn't interpret your question as (antagonistic) criticism at all (because I feel too comfortable with you from Jim's previous chat site), but rather as a good and valid question.\n\nBut more on the Start Here button... If someone new to writing (and no familiarity with Dram Theory) as I was in 2005 who picked up a copy of DP4.0, opens the software and sees the \"Start There\" button, what would be their intuitive action? We felt it would be to \"start there,\" and did so for the learning experience.\n\nBeyond that there was another reason based on the cliche \"you don't know what you don't know,\" and that it is very difficult to write about something one knows absolutely nothing about. From this experience and experiment, as a writer I have first hand experience of how others might approach the software and if new to writing, the confusion and intuitive tendencies that might present themselves, which improves my ability to explain the DP4.0 environment (and theory) to others. At least I hope that's what the result will be.", "group_id": 2515, "id": 363342}, {"user_id": 7664, "stars": [], "topic_id": 10433, "date_created": 1300298217.4812889, "message": "Cool. Thanks. Let me know when you've watched \"Wedding\" and we'll get to that.", "group_id": 2515, "id": 368054}]