[{"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1305916563.4322779, "message": "I know this has been discussed. But new people, new idea's. So, does God woo us, or is it like the binary calvin switch... once God flicks that switch, you are saved, his choice.", "group_id": 9787, "id": 1128923}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1305970272.404954, "message": "I'm staying out of this one :)", "group_id": 9787, "id": 1133353}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305972165.801034, "message": "@LintonCaldecott Arminians also believe in pre-destination and election. Just the mechanic is different :) Or at least Jacobus Arminius did :)", "group_id": 9787, "id": 1133391}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1305976722.2276449, "message": "I believe there is something to pre-destination and election, I just don't think the calvinists have it right.", "group_id": 9787, "id": 1133552}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305978390.150347, "message": "@LintonCaldecott Is there someone you would say has it right? What is your understanding?", "group_id": 9787, "id": 1133585}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1305984772.1259201, "message": "How is it that most of our debates revolve around single scripture theologies?", "group_id": 9787, "id": 1133901}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305985015.893189, "message": "Think I should step out this one again cause I can see this going the same way as the last time. The three of us will talk. I will explain what I think and you will ignore what I say. ", "group_id": 9787, "id": 1133910}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1305984921.9195001, "message": "@penkin I am sitting it out. It was a comment on this and other controversial topics that seem to revolve around a single key scripture and end up causing division", "group_id": 9787, "id": 1133906}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305984354.0869479, "message": "Maybe this will help? http://www.marshillchurch.org/media/religionsaves/predestination I know @LintonCaldecott not a fan of Driscoll.", "group_id": 9787, "id": 1133892}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305984855.000376, "message": "@pevans_om Are you talking about the sermon? I have not finished but he has read a few areas? And I thought you were sitting this one out :) So far it seems he looks at all sides?", "group_id": 9787, "id": 1133903}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1305984986.4845281, "message": "@pevans_om Did you watch? Cause he reads a lot and explains best he can? Not sure why you say it's one scripture?", "group_id": 9787, "id": 1133908}, {"user_id": 32891, "stars": [], "topic_id": 36170, "date_created": 1306136597.818727, "message": "I love how the Bible supports both points of view..", "group_id": 9787, "id": 1149937}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306137366.2546959, "message": "@EdwinGarden It would seem so and thus the in-house debate. I like how from the video that Driscoll says both camps are Christian, both love Jesus.", "group_id": 9787, "id": 1150061}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1306215787.821722, "message": "NO! calvinists don't believe the bible!", "group_id": 9787, "id": 1162111}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306309446.6213181, "message": "http://www.youtube.com/watch?v=co_ue0CdP-Y&feature=related aaaannnndddd... DISCUSS!", "group_id": 9787, "id": 1175479}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1306314188.6689489, "message": "that's just saying that those that want to be saved will be saved... and that there will be some kind of evidence of that repentance. It doesn't really cover the whole Calvinist idea of pre-destination and election", "group_id": 9787, "id": 1176024}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306318588.600462, "message": "@LintonCaldecott I didn't say it was. I was asking us to discuss what he is saying and what we think about what he is saying. What he is saying is there is an objection that we say that if someone is elect that he can never be choose to be saved. The bible seems to give support that there are no people like that. However that plays out, whether God looks down the passage of time and see's who will choose Him or whatever.", "group_id": 9787, "id": 1176325}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1306344356.8406971, "message": "Insha'Allah", "group_id": 9787, "id": 1181200}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306346041.3932819, "message": "http://en.wikipedia.org/wiki/Insha'Allah For the rest of us uncultured that have no clue what  @pevans_om is saying :P", "group_id": 9787, "id": 1181562}, {"user_id": 32891, "stars": [], "topic_id": 36170, "date_created": 1306394301.44011, "message": "Off topic, but the Irish will chuck in a 'please God' when talking about stuff they hope to do / want to happen..", "group_id": 9787, "id": 1189474}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1306395325.668035, "message": "The Arab nationals in dubai blame everything on God. Late for a meeting? Insh'Allah", "group_id": 9787, "id": 1189593}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306432218.0467701, "message": "@LintonCaldecott I hear Christians doing the same thing. \"See you now now.\" \"God willing.\" Which is strange to me. I get that if God really did not want you to see someone later He may step in and stop the show but surely that's a given? I don't tell everyone if my car starts I'll drive to <insert place>.", "group_id": 9787, "id": 1194476}, {"user_id": 32891, "stars": [], "topic_id": 36170, "date_created": 1306480064.495822, "message": "@penkin Ha! That's true.. I say it when I'm talking to Christians.. I blame James.", "group_id": 9787, "id": 1201716}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1306482164.21907, "message": "I think the western process is to sound Godly, the middle eastern default is God is in control. At least with the Jews, it's all about the sovereignty of God. We like to say that, but we are totally into the whole free will thing. I think most people say \"God willing\" or \"God <anything>\" to give a reason for their decisions.", "group_id": 9787, "id": 1202077}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1306502752.7740099, "message": "majority of middle-east use it just as a statement. It's so common no one even notices....like the F-word in some other cultures", "group_id": 9787, "id": 1204742}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1306502789.379252, "message": "...yes.....I did just talk about Insha'Allah and the F-word in the same sentence.....hope there's no muslims reading this.... :/", "group_id": 9787, "id": 1204749}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1306513835.21261, "message": "@pevans_om http://www.youtube.com/watch?v=vqPOKbTSMpk :P", "group_id": 9787, "id": 1206673}, {"user_id": 32888, "stars": [], "topic_id": 36170, "date_created": 1307569435.4140899, "message": "Here is a scripture we've all looked at before, but that just nags at me all \nthe time. Hebrews 6:4-6. Now, I'll start with the calvinist/once saved always \nsaved defense. The idea is that each individual description isn't conclusive \nin proving that the author is talking about true Christians. They will cite \nSaul who had the spirit of God and spoke by it, but was not saved. And they \nwill say that partaking of any of these things was a by product of being in \ncommunity with other believers. But for me, since the author didn't just \nmention one description of who he was talking about but 7 different \ndescriptions. Let's enumerate using the ESV (one of my favourite more word \nfor word translations);\n\n1. those who have once been enlightened\n2. who have tasted the heavenly gift\n3. have shared the holy spirit\n4. tasted the goodness of the word of God\n5. and the powers of the age to come\n6. and then have fallen\n7. restore again.\n\nOne of the arguments is that tasting the heavenly gift is akin to the\n nonstarters in the sewn seed parable, but then the author goes on to \ninclude tasting the goodness of the word of God, which therefore makes \nthe first idea rather moot. The combination of all of those idea's seems \npretty sufficient evidence that the author is not speaking of non-Christians. \nOtherwise it seems to be quite a bit of overkill. The idea that they be \nrestored AGAIN to repentance? You can repent more than once? The author’s \npoint is either that it is impossible for someone to be a true Christian, \nreject God and then return to salvation, or his point is that it is impossible \nfor someone to fake being a Christian, to not truly be saved, then turn his \nback and then become either A: a fake Christian Or B: a real Christian. So\n by once saved always saved interpretation the author is saying false \nChristians can never turn away from their empty professions, and return \nto them or they can’t turn away from their empty misunderstood professions \nand then at a later stage receive true repentance. Which seems unlikely. \nThe more likely here is that the author means a person cannot return to \nChristianity once they reject it, which is why it says “return to repentance”.\n John Wesleys notes on the text seem to agree. \n\n“With the light of the glorious love of God in Christ. And have tasted the \nheavenly gift - Remission of sins, sweeter than honey and the honeycomb. And\n been made partakers of the Holy Ghost - Of the witness and the fruit of he \nSpirit.\nHave had a relish for, and a delight in it. And the powers of the world to \ncome - Which every one tastes, who has an hope full of immortality. Every \nchild that is naturally born, first sees the light, then receives and tastes \nproper nourishment, and partakes of the things of this world. In like manner,\n the apostle, comparing spiritual with natural things, speaks of one born of \nthe Spirit, as seeing the light, tasting the sweetness, and partaking of the \nthings \"of the world to come.\"\nHere is not a supposition, but a plain relation of fact. The apostle here\n describes the case of those who have cast away both the power and the form \nof godliness; who have lost both their faith, hope, and love, Heb_6:10, &c., \nand that wilfully, Heb_10:26. Of these wilful total apostates he declares, \nit is impossible to renew them again to repentance. (though they were renewed\n once,) either to the foundation, or anything built thereon. Seeing they \ncrucify the Son of God afresh - They use him with the utmost indignity. \nAnd put him to an open shame - Causing his glorious name to be blasphemed.”", "group_id": 9787, "id": 1343031}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1308046799.5136681, "message": "I think the tough thing in all this is to make sense of it all. There are obviously scriptures people use on both sides to support their camp. Does that then mean the Bible contradicts itself? Does the Bible teach both eternal security and the ability to loose your salvation.\n\nOn the extreme on both sides I think there lies error. Either you think you cannot loose and live a life of willful sin or you live in fear of loosing your salvation and live a life of empty works.\n\nWhat is interesting to me though, is I see people on both sides living in the middle somehow. People that believe they cannot loose their salvation and out of love and wonderment they live life full of faithful works and I see people that believe they can loose their salvation living without fear that they are on the edge of the cutting board.\n\nMy current camp is it seems to me I cannot loose my salvation as I did nothing for it. I trust my Saviour to keep me. Problem then is I need to make sense of these verses that seems to point to me being able to loose it.", "group_id": 9787, "id": 1389660}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1308046966.570863, "message": "That is hard I have to admit. What I find strange though is those in the other camp seem to not think it's hard. We can loose our salvation so shape up buddy. Do your spiritual push-ups. Those verses you use mean nothing... look at mine!\n\nIt does not seem to be the rest that I think our salvation should have in Jesus?", "group_id": 9787, "id": 1389694}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1308052496.621911, "message": "I said I'd stay out of this...I lied.....\n\nOk, just a comment on doing nothing for your salvation - not technically true. Because you DO have to accept the gift of salvation....otherwise we're drifting into the 'everybody saved' territory. It does need a response.\n\nI agree with the concern over the ease of losing salvation - that then results in works focused salvation, which is wrong.\n\nAccording to my understanding there is 1 thing that can lose you salvation:\n\"Truly I tell you, people can be forgiven all their sins and every slander they utter, but whoever blasphemes against the Holy Spirit will never be forgiven; they are guilty of an eternal sin.” Mark 3 : 28-29\n&\n\"For it is impossible to bring back to repentance those who were once enlightened—those who have experienced the good things of heaven and shared in the Holy Spirit, who have tasted the goodness of the word of God and the power of the age to come—and who then turn away from God. It is impossible to bring such people back to repentance; by rejecting the Son of God, they themselves are nailing him to the cross once again and holding him up to public shame.\" Hebrews 6:4-6\n\nI believe these two passages speak of the same thing. Direct rejection of Jesus and thus of God. Hard to imagine a true believer doing this, but the writer of Hebrews seemed to think it happens. \n\nOur choice to accept or reject God does not disappear after that first saving moment. Otherwise it would be pointless. It just becomes harder to do the more we learn and know God - til it seems impossible to us.", "group_id": 9787, "id": 1390281}, {"user_id": 13817, "stars": [], "topic_id": 36170, "date_created": 1308054487.6155729, "message": "@pevans_om I though \"blasphemes against the Holy Spirit\" was that they were saying that the work Jesus performed was by the power of Satan? They were saying He was doing His work by an \"unclean spirit\" when in fact it was The Holy Spirit.", "group_id": 9787, "id": 1390390}, {"user_id": 32900, "stars": [], "topic_id": 36170, "date_created": 1308056135.32287, "message": "@penkin Yes, I've heard that explanation too. But it boils down to the same thing. Direct rejection of God. I can't help but feel the similarities with Hebrews when you see the dire consequences of the action is the same.", "group_id": 9787, "id": 1390574}]