[{"user_id": 30287, "stars": [], "topic_id": 40273, "date_created": 1308875905.2135689, "message": "I'd like to hear a Dramatica perspective on this film, if anybody's got one!", "group_id": 2515, "id": 1472913}, {"user_id": 7645, "stars": [], "topic_id": 40273, "date_created": 1308876359.9506071, "message": "Hrmmm...I still haven't seen it yet but I've heard it doesn't have one, or that it's broken", "group_id": 2515, "id": 1472977}, {"user_id": 33839, "stars": [], "topic_id": 40273, "date_created": 1308878598.4438951, "message": "I don't know who the IC would be because ultimately, I don't think anybody changes during the course of the story.  Sheriff Bell talks a lot about the past and how it's changed and I think that's where his perspective has changed - but it's not really within context of the story itself.  He ends up confused as to where the world has gone, and that the older he's become, the more senseless and irrational the violence is - hence it's no country for old men.  Whether he starts out the story with a different perspective, I can't recall - but it is bookended with his narration which may give some insight.  Luckily I have the DVD right here so I can look at it some tomorrow.", "group_id": 2515, "id": 1473283}, {"user_id": 33839, "stars": [], "topic_id": 40273, "date_created": 1308878267.173933, "message": "Loved the movie, hated the ending... until I watched it again a month ago with the notion of splitting the MC from the Protagonist, then it made perfect sense.  MC is Sheriff Bell, the Protag is Llewelyn Moss.  The story is told from the perspective of the Sheriff.  Since I'm still figuring out all the Dramatica stuff, I won't pretend I know what the story form is, or if it's complete/broken, etc., but would render a guess the conclusion to its thematic argument is tragedy.  Maybe I'll sit down tomorrow and see if I can figure out at least the bits I do know without going too deep.", "group_id": 2515, "id": 1473257}, {"user_id": 7664, "stars": [], "topic_id": 40273, "date_created": 1308883002.8132789, "message": "I haven't seen this movie since it came out, but I would venture to guess that \"Chaos\" is highlighted somewhere in the storyform. \n\nInterestingly, I think this movie has a very clear meaning -- interesting because it may not have a storyform.\n\nI wish I had time to watch it right now (or, I wish I had the DVD...).", "group_id": 2515, "id": 1473712}, {"user_id": 33839, "stars": [], "topic_id": 40273, "date_created": 1308883502.463237, "message": "\"Chance\" is Chigurh's... I'm not sure what you'd call it.  Methodology, perhaps.  Re: the ending and why I now think it's brilliant - it's almost like an inside joke.  A lot of the audience left confused because it felt like the movie just stopped, but really, we're meant to see it from the Sheriff's perspective and the Sheriff is confused.  So we're confused because he's confused - there being no resolution to what just unfolded *is* the story's resolution.  I've always viewed Chigurh has being death, personified... like an unstoppable force: you can run, but sooner or later, whether through chance or circumstance, it catches up to us all.", "group_id": 2515, "id": 1473746}, {"user_id": 30287, "stars": [], "topic_id": 40273, "date_created": 1309272427.3948381, "message": "Interesting. The reason I ask is, a friend of mine is writing his first feature and I'm trying to offer suggestions as he goes. I told him I was confused about who the main character was--it seemed to shift point of view between two characters throughout. His reply was just that \"a lot of movies are doing that, I'm cool with it\", and the example he gave was No Country for Old Men. \n\nI was just wondering if there was some deeper structure at work in it that I didn't see.  It's not going to convince him if I tell him it's a broken storyform; he'll just point to the 95% it got on Rotten Tomatoes, and the Oscar for Best Adapted Screenplay, and then he'll merrily go on shifting between two main characters.", "group_id": 2515, "id": 1506219}, {"user_id": 33839, "stars": [], "topic_id": 40273, "date_created": 1309290081.304332, "message": "Chris made some good observations about it in the thread I created re: dramatica lexicon.  I agree it's not trying to make any grand argument, rather, it's a statement/observation as to how the world is.", "group_id": 2515, "id": 1509211}, {"user_id": 33839, "stars": [], "topic_id": 40273, "date_created": 1309290976.5450449, "message": "I'm not sure whether I would agree that the POV shifts or not - sure, there's the long chase sequence with Llewlyn, but it's essentially just that:  he doesn't provide any countering viewpoints, really, save perhaps his is a more violent time with being a Vietnam Vet.  \n\nWhereas it may have some storyform problems, where it does function wonderfully is as almost pure cinema(tic) form:  so much of the film unfolds wordlessly or with brief interjections of dialogue with perhaps one noticeable piece of soundtrack... its images doing double-duty to evoke time/place/character/etc. without resorting to all the other \"amenities\" while it plays out largely like a silent film.", "group_id": 2515, "id": 1509664}, {"user_id": 7664, "stars": [], "topic_id": 40273, "date_created": 1309293796.859575, "message": "@ScreenwritingScreenwriter If he's writing his first screenplay, the only important thing is getting to page 120.\n\nThat's been my experience anyway.", "group_id": 2515, "id": 1510712}]