[{"user_id": 33839, "stars": [], "topic_id": 43327, "date_created": 1312509745.9819219, "message": "...specifically, where the MC and IC don't actually meet (before the MC's time).  \n\nI know that an IC can have an impact on a character without knowing it, do it from afar, or indirectly (I think To Kill a Mockingbird is something of an example of these as Boo Radley really doesn't interact physically with Scout until the end), but what I'm looking for are any examples where a MC changes due to a person's influence from the past.  \n\nThey're probably more prevalent than my brain can muster at the moment, and I'm thinking of a story where there's two time periods where the IC's past is explored - ultimately having an impact on the MC's present.", "group_id": 2515, "id": 1798807}, {"user_id": 38500, "stars": [], "topic_id": 43327, "date_created": 1312540720.332756, "message": "Hitchcock's \"Rebecca\", perhaps?", "group_id": 2515, "id": 1801055}, {"user_id": 33839, "stars": [], "topic_id": 43327, "date_created": 1312547132.4284141, "message": "At first I didn't see how Rebecca changed the characters... then I realized it's a story problem of perception/actuality.  Max is haunted by her death - specifically her actions prior to it - then the circumstances themselves which may implicate him.  \n\nBut as we learn, her behavior was a ruse because of her terminal illness (at least I think that's the conclusion we come to and Max's hatred of her subsides once he understands this).  \n\nWhich leads to a good question: who is the MC?  Is it Max?  Joan Fontaine's character plays the unnamed narrator, who feels more like a protagonist driving the story.  Or are these characters really antagonists of a story goal to keep Rebecca's past a secret, perpetuated by Rebecca herself?  \n\nI think I'm gonna have to watch this tonight... But either way, I think it's a good example (she's a deadfast character, lol).", "group_id": 2515, "id": 1801455}, {"user_id": 7645, "stars": [], "topic_id": 43327, "date_created": 1312550281.5283959, "message": "Ok, now that was a good one :)", "group_id": 2515, "id": 1801672}, {"user_id": 37586, "stars": [], "topic_id": 43327, "date_created": 1312557660.22826, "message": "Julia Childs character in Julie and Julia.", "group_id": 2515, "id": 1802797}, {"user_id": 10814, "stars": [], "topic_id": 43327, "date_created": 1312567561.6765449, "message": "Elise McKenna (Jane Seymore) in \"Somewhere in Time\".", "group_id": 2515, "id": 1803964}, {"user_id": 7664, "stars": [], "topic_id": 43327, "date_created": 1312568030.3361361, "message": "Anything with a journal? Maybe \"Letters from Iwo Jima\"? I can't think of anything specific, I'm just throwing out things that might spark something.\n\n\"A History of Violence\"?", "group_id": 2515, "id": 1804015}, {"user_id": 10814, "stars": [], "topic_id": 43327, "date_created": 1312567597.9866469, "message": "Half of the ghosts in \"A Christmas Carol\"", "group_id": 2515, "id": 1803965}, {"user_id": 10814, "stars": [], "topic_id": 43327, "date_created": 1312567474.8158879, "message": "Blythe in Blythe's Spirit, perhaps.", "group_id": 2515, "id": 1803949}, {"user_id": 7664, "stars": [], "topic_id": 43327, "date_created": 1312568396.975632, "message": "I've never seen it. I was just thinking that anything where a journal or letters was essential. I guess, just like Julie and Julia.", "group_id": 2515, "id": 1804059}, {"user_id": 7664, "stars": [], "topic_id": 43327, "date_created": 1312568660.141701, "message": "The Lake House?", "group_id": 2515, "id": 1804092}, {"user_id": 7664, "stars": [], "topic_id": 43327, "date_created": 1312568093.3262219, "message": "@JBarker I like \"deadfast\" -- I want to use that for something now!", "group_id": 2515, "id": 1804028}, {"user_id": 7645, "stars": [], "topic_id": 43327, "date_created": 1312568353.170603, "message": "The Impact Character in \"Letters from Iwo Jima\" is very much alive.", "group_id": 2515, "id": 1804057}, {"user_id": 33839, "stars": [], "topic_id": 43327, "date_created": 1312571816.3615961, "message": "A Christmas Carol had crossed my mind.  Haven't seen some of these others so I'll have to check them out.  \n\nDeadfast character: a dead character who \"appears\" to change over the course of a story, but really it's other's perception of them once information is revealed concerning their true nature (because dead is dead).  \n\nI'm wondering if The Trouble With Harry would qualify.", "group_id": 2515, "id": 1804529}, {"user_id": 7664, "stars": [], "topic_id": 43327, "date_created": 1312575060.499825, "message": "What about Hamlet's Ghost?\n\nHe's dead -- but you really want their time explored?", "group_id": 2515, "id": 1804965}, {"user_id": 33839, "stars": [], "topic_id": 43327, "date_created": 1312577354.8442121, "message": "@MikeDerk Not necessarily, but I would think for them to make an impact we'd get to know them to some extent.  The \"battle\" of ideals/pov that takes place isn't face to face, but the IC still manages to change the MC in some way.  \n\nI think Rebecca is a good example as it deals with perception/actuality that I'm looking for because we get revelations about her as the story goes along that paint a more complete picture of her objectively vs. what everyone else's individual perceptions were.  Once we get the answer of actuality and the truth is revealed, our perceptions change as well re: what was REALLY going on.  This is where I've heard Chris in the podcasts say when there's a mystery, you've got to get your head wrapped around the mystery element first and see the big picture.  \n\nI'm going through and storyforming the script from a previous thread (here: https://convore.com/dramatica/working-my-way-backwards-crucial-element/) and wanted to see how other stories may have explored the SS through a similar set up since this involves diaries.", "group_id": 2515, "id": 1805300}]