[{"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771532.2522991, "message": "2-Creación de confianza y credibilidad de la aproximación gubernamental\nTalleres abiertos.\nCapacitación en creación de productos turísticos innovadores, herramientas para agilizar la gestión interna y mercadeo digital entre otros. Via streaming y en videos on-line para los proveedores de servicios turísticos.", "group_id": 2696, "id": 1106192}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771572.0436161, "message": "3- Promocionar destinos y  proyectos turísticos por medio de un blog especializado donde los Brigadistas Viajeros puedan compartir las experiencias, historias, fotos y vídeos de sus viajes.", "group_id": 2696, "id": 1106196}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771475.5437231, "message": "Actividades\n1-Estado del arte de la situación actual del turismo en Colombia.\nInformes de análisis de las estadísticas del sector de diferentes fuentes, trimestral y anual. Estos informes facilitaran a las empresas turísticas e inversores nacionales y extranjeros información de la situación actual del sector. Diferentes informes se presentarán de forma trimestral con continuidad anual", "group_id": 2696, "id": 1106187}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771801.264046, "message": "6- Crowdsourcing. Utilizar la inteligencia colectiva a través de Twitter y por ´medio de la #BrigadaDigital para aportar ideas generales para el sector y/o especificas para proyectos comunitarios", "group_id": 2696, "id": 1106236}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771330.5075591, "message": "Objetivo: Identificar oportunidades y promover el uso de las TIC como herramientas de desarrollo del sector.", "group_id": 2696, "id": 1106163}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771754.657068, "message": "4- RSE: Articular proyectos comunitarios, ecoturisticos, accesibles y de turismo rural con empresas desde su RSE\nCon TorrenegraLabs (Localo, Localia y Let Me Go) se gestiona una plataforma tecnológica para la presencia on-line de alojamientos turísticos colombianos.\nEsta plataforma se enfocaría en proyectos de turismo responsable, comunitario, rural, ecológico y accesible", "group_id": 2696, "id": 1106223}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305771780.9691241, "message": "5- Georeferenciación de los lugares de interés en Colombia e información valiosa para los viajeros.", "group_id": 2696, "id": 1106231}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305772897.5233171, "message": "Para empezar con la actividad del blog de viajes, hemos convocado a los bloggers de viaje por Colombia http://bit.ly/TurisTICBloggers a un meetup http://bit.ly/turisBlog el 8 de Junio y por supuesto para todos los brigadistas quienes quieran participar en el blog de viajes.", "group_id": 2696, "id": 1106605}, {"user_id": 15483, "stars": [], "topic_id": 35908, "date_created": 1305820206.662035, "message": "Excelente @annieburbano, contá con todo el apoyo que humildemente te pueda brindar para sacar adelante a #turisTIC", "group_id": 2696, "id": 1112725}, {"user_id": 22865, "stars": [], "topic_id": 35908, "date_created": 1305848035.5068619, "message": "reportandome en este gruponpara novedades", "group_id": 2696, "id": 1117863}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1305904717.0673709, "message": "gracias Juanda, estamos abiertos a todas las ideas, sugerencias y aportes.", "group_id": 2696, "id": 1126707}, {"user_id": 26153, "stars": [], "topic_id": 35908, "date_created": 1305985132.621913, "message": "Como saben yo viajo mucho por mi trabajo y el 80% de mis clientes son del sector turistico, si ven en que puedo colaborar me avisan .", "group_id": 2696, "id": 1133914}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1306091900.8392379, "message": "Bueno tu y todos los brigadistas nos pueden ayudar con los alojamientos de la plataforma. La idea es vincular alojamientos de proyectos de turismo comunitario, rural, eco-turismo, social, responsable y accesible por todo el país. No tiene coste para ellos (solo 10% de comisión por reserva) y nosotros haríamos la promoción, y la capacitación en el uso del back office de la plataforma. Si conocen alojamientos y nos los pueden remitir, perfecto.", "group_id": 2696, "id": 1143393}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1307503953.3665209, "message": "Mañana miércoles están todos invitados al encuentro de bloggers de viaje TurisBlog Colombia, si te gusta viajar ya eres un candidato al evento. http://bit.ly/turisBlog y pueden seguir el evento vía streaming http://www.ustream.tv/channel/turistic", "group_id": 2696, "id": 1332837}, {"user_id": 16513, "stars": [], "topic_id": 35908, "date_created": 1312504161.887413, "message": "Estamos reuniendo al equipo de trabajo de la app de georeferenciación de contenido turístico de Colombia. El que quiera unirse avisar a @amonerdj  thanks", "group_id": 2696, "id": 1798314}, {"user_id": 17517, "stars": [], "topic_id": 35908, "date_created": 1313338702.5203869, "message": "Uy yo me meto en boyaca hay mucho por hacer", "group_id": 2696, "id": 1869793}, {"user_id": 18844, "stars": [], "topic_id": 35908, "date_created": 1313524121.0063579, "message": "Ya yo estoy?", "group_id": 2696, "id": 1886038}, {"user_id": 22865, "stars": [], "topic_id": 35908, "date_created": 1316041938.0823519, "message": "javi necesito que por el momento sumerce sea mis ojos en boyaca estare por skype y coordinamos las tareas para boyaca mientras llego  seguimos pendientes", "group_id": 2696, "id": 2129504}]