[{"user_id": 7712, "stars": [], "topic_id": 7861, "date_created": 1298311677.3362889, "message": "Somewhere in Melanie's Dramatica Unplugged series, she mentioned that Signposts (SP) should be told in order, and then explained that the various happenings of the Main Character (MC) and Impact Character (IC) should be told in any order within that respective Signpost.\n\nI've noticed that in the Dramatica Screenplay template that is not the case. Sometimes a previous SP appears after the next, such as in the Subplot Development. After SP2 begins, the Subplot Development is mapped to Subjective SP1.\n\nDoes this mean that the SS-SP1 is a flashback?", "group_id": 2515, "id": 160310}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298315014.5528059, "message": "I didn't lay out the scene order in that template, so I can't vouch for the thinking behind it, but I'll try to tackle this question anyway.  First -- no, that aspect of the scene order is not meant to represent a flashback.", "group_id": 2515, "id": 162736}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298315136.275218, "message": "Second, keep in mind that the order of storyform appreciations laid out in that scene order is merely meant to serve as a suggestion, and you can move things around as much as you like.  In some stories, the Subjective Story signposts will start much earlier than what that template suggests.", "group_id": 2515, "id": 162851}, {"user_id": 7712, "stars": [], "topic_id": 7861, "date_created": 1298317656.737447, "message": "Hi Sandy. Regarding points 1-3, thank you, that's very useful insight. On #3, I did not have that understanding based on my understanding of Melanie's Dramatica Unplugged series (I guess that's one of those \"exceptions\"). As far as my actual question is concerned, I wanted to understand why the SS-SP1 occurs after SS-SP2 because, based on my understanding from the Dramatica Unplugged series, Signposts should be told in order (all throughlines for SP1 should come before all throughlines for SP2, and the same for the throughlines of SP3 & 4). Based on what you are telling me, a certain degree of flexibility is okay.", "group_id": 2515, "id": 165102}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298315473.0463619, "message": "Third, keep in mind that the occurrence of the signposts in the script will be staggered among the four throughlines.  It's okay if Signpost 1 in one throughline--such as the Subjective Story--occurs shortly after Signpost 2 passes in the other throughlines, such as the Objective Story.  But don't let any one throughline get TOO far behind the others!  Don't hit Signpost 3 in one throughline until at least all the Signpost 1's have passed.", "group_id": 2515, "id": 163183}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298315786.6243041, "message": "Actually, I realize now you may be asking a different question -- are you saying that in the screenplay template, the Subjective Story (or Main vs. Impact) Signpost 1 is placed after the SS Signpost 2?  Because I'm scrolling through that template, and I see that the SS Signpost 1 occurs in \"Step #19-Subplot Development\" and not before, and it's not repeated.", "group_id": 2515, "id": 163456}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298320830.3226471, "message": "Actually, I think I learned from Melanie herself that it's okay to let a Signpost 1 occur after the other Signpost 2's have started, but not TOO much later than that.  Maybe my memory is unclear on that--I'll see if I can find those notes.  Anyway, I want to address your statement that \"the SS-SP1 occurs after SS-SP2\" -- can you point to the specific places where you're seeing that?  I looked at the screenplay template, and what I saw was the SS Signposts occurring in order, albeit later than the others.  Within a throughline, yes, the Signposts should be told in order, even though they may be staggered to a greater or lesser degree in relation to the other throughlines.  In any event, flexibility is definitely okay!  Let the storyform guide you, not dictate to you!", "group_id": 2515, "id": 167930}, {"user_id": 7712, "stars": [], "topic_id": 7861, "date_created": 1298322895.2831941, "message": "In the Screenplay template, Step 15: Subplot Point 1 has the first occurrence of a SP2. Step 19: Subplot Development is then mapped to SS-SP1.", "group_id": 2515, "id": 169877}, {"user_id": 7712, "stars": [], "topic_id": 7861, "date_created": 1298323051.9090419, "message": "Oh, wait, I see my problem. I'm thinking of Signposts as a whole, not individually. SS-SP1 occurs before SS-SP2.", "group_id": 2515, "id": 170011}, {"user_id": 7669, "stars": [], "topic_id": 7861, "date_created": 1298333978.6893511, "message": "Okay, yeah, the signposts in a given throughline are in order, but like I said, they may be staggered relative to the other throughlines.", "group_id": 2515, "id": 175795}, {"user_id": 10814, "stars": [], "topic_id": 7861, "date_created": 1298334080.997679, "message": "When looking at the plot in act-sized chunks, then seeing them as signposts is fine.  However, the moment you break them down into smaller chunks, e.g. scenes or beats, then those act-sized signposts are somewhat meaningless except as umbrella contexts over the activities happening within each act.\n\nKeep in mind that signposts are part of plot -- the order in which things really happen in a story.  Scenes are part of Storyweaving, which means they can happen out of plot order.  A mystery is only a mystery because events in the plot are withheld from the audience until later in the Storyweaving.  \n\nThat MAY be a reason those SS signposts were listed in the scenes out of order.  First, show the relationship in full conflict, then go back and show what ignited or reignited the conflict through storyweaving.", "group_id": 2515, "id": 175799}]