[{"user_id": 11626, "stars": [], "topic_id": 7770, "date_created": 1298260043.2671199, "message": "http://images.dailytech.com/nimage/18710_Comcast_Doesnt_Care.jpg\r\n\r\nIt has seen the end of the net neutrality legislation, it will soon see the end of the Rebellion...\r\n\r\nHouse Republicans have managed to pull off a high profile rejection of a key tech-related component of the Obama administration's initiatives. In control of the House for the first time in four years, Republicans have voted to overturn so-called \"net neutrality\" rules proposed earlier this year by the Obama administration.\r\n\r\nThe rules had previously been approved by the Democratic House, but were stalled in the Senate as Republicans awaited the prospect of regaining control of the House in the new year.\r\n\r\nI.  What's Net Neutrality and What Did This Bill Mean?\r\n\r\nIn the early 1900s the American Telephone and Telegraph Company (AT&T) basically held a monopoly on phone service in the U.S.  It owned all the lines and it sought to crush or buy out any small competitors entering the market.  Its tactics are viewed in retrospect as \"anticompetitive\", but at the time the government did little to act.\r\n\r\nToday cable internet service providers don't enjoy the same kind of monopoly, but they do enjoy a market in which there are only a few players.  Most people have access to only one to three cable internet service providers.  The rise of tethered internet has helped the market become more competitive, somewhat, adding a few wireless tethering options to the mix.\r\n\r\nAt best, though, most people enjoy four or five 3G/cable or better internet options.\r\n\r\nWorse, the cable and wireless companies tend to make decisions about pricing and services in mass.  Take for example the trend towards cutting \"unlimited\" data plans on cell phones -- AT&T and Verizon both made the switch and now it looks like Sprint and T-Mobile may follow.  While there's laws against collusion (companies making joint decisions in a loosely populated market), the government can only prosecute companies if it proves they met and worked out the decision together.  That's typically too hard to prove, so they don't bother.\r\n\r\nAs a result cable providers typically underdeliver on their promised speeds and overcharge customers, as they can work together with their handful of competitors to keep rates high and service quality low.\r\n\r\nFurther, some companies are eyeing the potential to gain further revenue by offering faster access to some sites like The New York Times or Google Search -- who might be willing to pay to give customers faster access.  To get this faster access, independent sites that didn't pay would be relegated to slow connections.\r\n\r\nAnd telecoms also wanted to \"throttle\" the connections of users who make full use of their data plans.  These busiest users would see their connections slowed to prevent them from using as much data.\r\n\r\nIn the face of all of this, the net neutrality movement was born.  Its aims were multifold:\r\n\r\n   1. To allow communities to vote and enact municipal Wi-Fi projects delivering faster service at a lower cost (telecoms have fought to outlaw municipal Wi-Fi projects).\r\n   2. To prevent telecoms from charging websites for faster access.\r\n   3. To prevent the throttling of internet connections.\r\n\r\nAll of these measures were seen as ways of remedying the relatively uncompetitive internet market, and prevent those in power from abusing their dominant positions.\r\n\r\nThe Obama administration's Federal Communications Commission appointees proposed a series of net neutrality rules that covered much of those points.  It however, cut some deals with the communications industry that frustrated net neutrality advocates.  For example in only prevented the throttling of \"legal traffic\" opening the door to throttle P2P and torrent connections.  It also exempted mobile operators from certain rules and restrictions.\r\n\r\nThe bill was tacked on to a spending bill that was passed on December 21, 2010 by the Democratic House.  A copy of the FCC's published rules is available online [PDF].\r\n\r\nII. The Death of a Bill\r\n\r\nOn February 17, 2011 (Thursday), the new Republican 112th Congress voted to overturn the spending bill before it could reach a Senate vote.  With the death of a bill comes the death of the legislation to give the FCC power to regulate net neutrality.\r\n\r\nFederal courts have already ruled that current legislation does not give the FCC this power, so essentially unless another bill passes; the effort to legislate net neutrality is dead.\r\n\r\nRepublicans claim net neutrality restricts the free market.  States Republican Representative Steve Scalise, \"We think the FCC overstepped their boundaries. This is something that should be done and solved in the halls of Congress.\"\r\n\r\nMany Republicans, such as Senator John McCain (R-Ariz.), argue that any legislation to regulate net neutrality is an affront to capitalism.  They argue for a laissez-faire approach to regulating telecommunications.\r\n\r\nDemocrats are devastated at the loss of the net neutrality bill.  Democratic Representative Edward Markey says that telecoms and cable providers are now free to squash small competitors and user rights, much as they did during AT&T's monopoly era in the early 1900s.  He states, \"Verizon's not going to invent anything new. What they want to do is squeeze competitors.\"\r\n\r\n(The statement appears to allude to the legal challenge from Verizon in January against the bill, which was filed with the U.S. Court of Appeals for the District of Columbia.)\r\n\r\nIII. What's Next for Net Neutrality and the Internet\r\n\r\nRepublicans seem dead set against preventing internet service providers from throttling traffic or slowing/speeding up website access.  They also tend to oppose on a state basis allowing local communities to spend their government dollars to set up independent municipal internet access -- even if the citizens in that community want the service and are paying for it with their own tax dollars.  They have championed several efforts to stop municipal internet projects.\r\n\r\nTogether these stances serve to cement the power of a handful of telecoms and cable providers like Comcast, Time Warner, Verizon Wireless, etc.  And that means a fat payday for these players.\r\n\r\nRepublicans are being rewarded handsomely for their loyalty.  Various telecoms raised millions for John McCain's 2008 Presidential run and they provided free service to his personal ranch.  Many other Congressional Republicans enjoy similar perks, albeit on a smaller scale.\r\n\r\nThis mean that over time customers can expect to see slower access to independent sites on the internet, though access to big corporate sites may speed up slightly.  And those who fileshare with torrents, etc. or who use lots of bandwidth streaming Netflix, etc. will likely see their connections slowed.  Last, but not least, customers may find themselves having to pay their cable company monthly fees to access websites on a per-site basis.\r\n\r\nAlong with the push for metered internet plans, all of this means that customers will be paying more, while getting less -- less website access, less speed, and less traffic types.\r\n\r\nOf course cable providers aren't stupid.  They fought hard for this bill to be overturned.  They will likely try to slowly sneak in these changes to prevent public outcry.\r\n\r\nhttp://www.dailytech.com/US+House+Votes+to+Allow+Cable+Providers+to+Throttle+Internet/article20947.htm", "group_id": 3920, "id": 155911}]