[{"user_id": 11626, "stars": [], "topic_id": 6662, "date_created": 1297903718.720036, "message": "Barack Obama and Canadian Prime Minister Stephen Harper quietly have taken a major step toward erasing the border between the two nations with a new \"Beyond the Border\" bilateral declaration.\r\n\r\nIn a ceremony designed to remain below the radar of national public opinion, Obama and Harper bypassed Congress to sign on the basis of their executive authority a declaration that put in place a new national security vision defined not by U.S. national borders, but by a continental view of a \"North American perimeter.\"\r\n\r\nIt happened Friday, the day the Obama administration usually pushes through issues that it prefers the media ignore.\r\n\r\nBy signing the declaration, the Obama administration has implemented without congressional approval a key initiative President Bush began under the Security and Prosperity Partnership of North America, moving the United States and Canada beyond the North American Free Trade Agreement, commonly known as NAFTA, toward a developing North American Union regional government.\r\n\r\nThe declaration signed by the two heads of state and titled \"Beyond the Border: A Shared Vision for Perimeter Security and Economic Competitiveness,\" was described as \"For Immediate Release\" on the websites of the White House and the Canadian chief executive.\r\n\t \t\t \r\nHarper followed Obama's lead in signing the declaration as a form of executive order, deciding to bypass the Canadian parliament, much as Obama had decided against taking a proposed bilateral \"Beyond the Border\" declaration to Congress for prior review and approval.\r\n\r\nStealth implementation of a 'continental perimeter'\r\n\r\n\"To preserve and extend the benefits … our close relationship has helped bring to Americans and Canadians alike, we intend to pursue a perimeter approach to security, working together within, at, and away from the borders of our two countries to enhance our security and accelerate the legitimate flow of people, goods, and services between our two countries,\" the declaration announced in the preamble.\r\n\r\nThe decision to declare a continental perimeter for the United States and Canada, designed to effectively combine the two nations in mutual national security and economic efforts, affirms the Obama administration's intent to implement the key objectives of the Security and Prosperity Partnership of North American in a way that avoids the type of public scrutiny and criticism that dogged President George W. Bush after he openly declared his plans with the SPP.\r\n\r\nThe Obama and Harper administrations' use of a low-key methodology to pursue continental political integration was further confirmed last week in Canada by the Toronto Star. The paper disclosed a 14-page confidential public relations document circulated within the Canadian government that recommended the talks between Obama and Harper keep \"a low profile\" in the months leading to last Friday's signing of the bilateral declaration.\r\n\r\nWND has reported since 2006 that a blueprint published in 2005 by the Council on Foreign Relations titled \"Building a North America Community\" called for the establishment of a common security perimeter around North America by 2010 to facilitate the free movement of people, trade and capital between the three nations of North America.\r\n\r\nAmerican University's Robert Pastor, co-chair of the CRF blue ribbon committee that authored \"Building a North American Community,\"  wrote in 2001 the book \"Toward a North American Community.\"\r\n\r\nHe called for creation of a North American Commission, a North American Parliament and a North American Court on Trade and Investment.\r\n\r\nThe language of the \"Beyond the Border Declaration\" easily could have been taken almost verbatim from the CFR report or Pastor' book.\r\n\r\nThe 2005 CFR report \"Building a North American Community,\" called on page xvii of the foreword for the \"establishment by 2010 of a North American economic and security perimeter, the boundaries of which would be defined by a common external tariff and an outer security perimeter.\"\r\n\r\nThe U.S.-Canadian 'Beyond the Border Working Group'\r\n\r\nThe Beyond the Border Declaration signed by Obama and Harper also created a new Beyond the Border Working Group, designated by the acronym BBWG, composed of representatives from \"the appropriate departments and offices of our respective federal governments.\" The BBWG is tasked with developing a \"Plan of Action\" to realize the goals of the declaration and to report annually to the \"Leaders,\" the president of the United States and the prime minister of Canada.\r\n\r\nThe declaration focused on four areas of joint U.S.-Canadian bilateral action, supposedly the content areas of the BBWG action plan:\r\n\r\n    * The joint early assessment and management of security threats \"including natural disasters and man-made disasters, including terrorism\";\r\n\r\n    * The joint facilitation of trade, economic growth and jobs, \"including expanding trusted traveler and trusted trader programs, harmonizing existing programs, and automating processes at the land border to increase efficiency\";\r\n\r\n    * Integrated U.S.-Canadian cross-border law enforcement to combat transnational crime; and\r\n\r\n    * Coordinated U.S.-Canadian efforts to develop critical infrastructure and provide cyber-security, working together \"to defend and protect our use of air, land, sea, space, and cyberspace, and enhance the security of our integrated transportation and communications networks.\"\r\n\r\nUnder the Bush administration's Security and Prosperity Partnership for North America, or SPP, the U.S., Mexico and Canada organized some 20 different \"shadow government\" bureaucratic working groups composed of agency heads and undersecretaries in the three nations. The groups spanne a wide range of policy areas, from e-commerce, to aviation policy, to borders and immigration, trilateral travel, transportation, energy, environment, food and agriculture, health, and financial services.\r\n\r\nThe creation of the Beyond the Border Working Group strongly suggests that U.S-Canadian bureaucratic integration begun by Bush within SPP is proceeding under the Obama administration, even though the SPP officially has been replaced by a new trilateral structure that includes Mexico called \"The North American Leaders Forum.\"\r\n\r\nSPP goes underground with Obama\r\n\r\nWND previously reported that the Obama administration replaced the content of the SPP website, spp.gov, under the title \"Commerce Connect,\" which announces its purpose as \"a one-stop shop for information, counseling and government services that can help U.S. businesses around the country transform themselves into globally competitive enterprises.\"\r\n\r\nNow, the Obama administration has made the spp.gov website totally inoperative.\r\n\r\nWND reported in September 2009 that the Obama administration has \"rebranded\" and \"refocused\" the SPP to advance the Bush administration's agenda of North American integration under the rubric of the \"North American Leaders Summit,\" a less controversial banner, according to confidential sources in the U.S. Department of Commerce and State Department who agreed to speak with WND only if their names were kept off the record.\r\n\r\nIn September 2009, sources confirmed to WND that the SPP was being directed from within the White House, as reflected by a new blog posted on the White House website entitled \"The North American Leaders Summit\" that is intended to replace spp.gov as the official website documenting trilateral government activities going forward under the rebranded name.\r\n\r\nCurrently, the White House blog for the North American Leaders Summit contains content that appears not to have changed since the site first appeared, sometime around September 2009.\r\n\r\nOnly the Canadian government website today continues to archive the security agenda, the prosperity agenda, trilateral meeting summaries going back to 2007, and key SPP reports and documents – all content that has been scrubbed from current U.S. government websites.\r\n\r\nhttp://www.wnd.com/index.php?fa=PAGE.view&pageId=261477", "group_id": 3920, "id": 127644}]