[{"user_id": 11626, "stars": [], "topic_id": 6760, "date_created": 1297921207.355917, "message": "Japanese Prime Minister Naoto Kan on Thursday voiced fresh concern about China's defence spending and its maritime activities and said Japan should focus on its alliance with the United States.\r\n\r\nKan also pledged to take the lead in setting up rules on regional ocean disputes and boost ties with Tokyo's Asian neighbours to better confront security risks like North Korea's nuclear programme.\r\n\r\n\"We can't help but have concerns about a certain lack of transparency in (China's) defence build-up and growing maritime activities,\" Kan said in a foreign policy speech ahead of this year's parliament session, which starts on Monday.\r\n\r\nIn December Japan called China's military rise a source of international \"concern\" in its 10-year defence guidelines, following Beijing's increased assertiveness in territorial disputes in the East China and South China seas.\r\n\r\nKan said it was \"extremely regrettable\" that Tokyo and Beijing had been embroiled in a tense diplomatic standoff after Japan's arrest of a Chinese trawler captain near disputed islands in September.\r\n\r\nHe added that he wanted to \"take the initiative\" on establishing maritime rules that would prevent disputes in the region.\r\n\r\n\"Conflicts over maritime interests have been surfacing recently and we cannot ignore that they are becoming elements of regional instability,\" Kan said. \"We should claim Japan's own rights openly and squarely.\"\r\n\r\nJapan wants China to resume stalled talks over a disputed gas field as Tokyo suspects Beijing has started drilling in the field, which sits in waters both sides claim as part of their exclusive economic zone.\r\n\r\nHowever, Kan said he wants to maintain \"mutually beneficial strategic relations\" with China and called on the two countries to act responsibly as major powers in the global community.\r\n\r\nHis comments came as Chinese President Hu Jintao makes a long-awaited state visit to the United States.\r\n\r\nIn the speech, Kan called Japan's relations with the United States \"the most important bilateral relations for our country,\" but vowed to spare no effort to maintain their half-a-century alliance, comparing it to his marriage.\r\n\r\n\"It requires efforts on both sides to maintain it,\" he said. \"I have been married for 40 years and I get very severe payback from my wife when I spare efforts.\"\r\n\r\nEarlier Thursday, Japan and the United States agreed that the US Pacific territory of Guam will host around three weeks of US military drills involving Okinawa-based F-15 jets in an effort to ease the burden on the Japanese island.\r\n\r\nJapan and the United States squabbled for much of the past year over the relocation of the Marine Corps Air Station Futenma on Okinawa, amid hardening opposition from residents of the southern island to the large US military presence.\r\n\r\nThe base lies in an urban area of Okinawa, where residents have long complained about aircraft noise and the risk of accidents, and is set to be relocated to a coastal, less developed location on the island.\r\n\r\nKan, meanwhile, urged North Korea to stop taking \"provocative action\" and return to multilateral talks over its nuclear programme.\r\n\r\nHe reiterated his earlier condemnation of the North's artillery strike on South Korea in November, which \"threatened the peace and stability of not only northeast Asia but also the world.\"\r\n\r\nPyongyang in recent years has fired missiles over Japan, staged two nuclear tests and in November unveiled a new uranium enrichment plant.\r\n\r\n\"We will strongly urge North Korea to fulfil the 2005 six-party joint communique in which it agreed to abandon all nuclear weapons and its nuclear programme,\" Kan said.\r\n\r\nhttp://www.spacewar.com/reports/Japan_PM_concerned_over_Chinas_defence_build-up_999.html", "group_id": 3920, "id": 129477}]