[{"user_id": 2946, "stars": [], "topic_id": 20477, "date_created": 1303275251.1554661, "message": "Escuchando este podcast (http://ecorner.stanford.edu/authorMaterialInfo.html?mid=2478) sobre Startup Chile, me llamó la atención la pregunta que le hacen al ministro: \"En Sillicon Valley tenemos una cultura de que si fallas no hay problema, te levantas e intentas de nuevo, ¿Cómo funciona eso en Chile?\"\n\nY me pareció un interesante tema de conversación para Startups-MX. Estadísticamente hablando, lo mas probable es la mayoría de los que estamos hablando aquí de startups vayamos a fracasar feamente. Que va a pasar entonces? Se van a desanimar? Se paran y lo intentan de nuevo?\n\nAdemás, como creen que sea la reacción de la gente a su alrededor tras un fracaso sonado? Estamos preparados en México para eso?", "group_id": 965, "id": 752087}, {"user_id": 10227, "stars": [{"date_created": 1303336713.4848509, "user_id": 29963}], "topic_id": 20477, "date_created": 1303299459.1842749, "message": "Aqui se reirian de tí, y algunos se alegrarian de tu fracaso, lastima que sea asi la mentalidad de la mayoria de los mexicanos", "group_id": 965, "id": 753763}, {"user_id": 12739, "stars": [], "topic_id": 20477, "date_created": 1303302241.814074, "message": "@mishudark pero lo sabemos a ciencia cierta? es decir, siempre decimos eso, pero recuerdan algún ejemplo? Diría que iWiks, pero no se si contar \"eso\" como emprendimiento.", "group_id": 965, "id": 754137}, {"user_id": 26084, "stars": [], "topic_id": 20477, "date_created": 1303304595.5462749, "message": "Creo que si de verdad le metiste galleta a tu proyecto y te aventaste el todo por el todo, nadie se burlara, al contrario te impulsaran cuando intentes algo mas, caso Me Quadra.", "group_id": 965, "id": 754482}, {"user_id": 29866, "stars": [], "topic_id": 20477, "date_created": 1303306326.8837249, "message": "Hoy precisamente leía una frase que va mucho con esto: \"El peor resultado para una startup no es fracasar - es la mediocridad\"", "group_id": 965, "id": 754711}, {"user_id": 29866, "stars": [{"date_created": 1303310060.333904, "user_id": 26088}], "topic_id": 20477, "date_created": 1303307630.954797, "message": "@soska Muy buena la platica, que orgullo para los chilenos, esperemos algún día ver a alguno de nuestros políticos dar una charla de este tipo, por ahora solo dan pena ajena.", "group_id": 965, "id": 754889}, {"user_id": 26088, "stars": [], "topic_id": 20477, "date_created": 1303310325.633738, "message": "A veces siento es dificil medir hasta que punto haz fracasado o cuales son los sintomas, supongo depende de cada startup, tal vez es un continuo fracasar-levantarte sin que a veces te des cuenta? en lo personal soy bien necio y seguiria a menos que no tuviera sentido", "group_id": 965, "id": 755349}, {"user_id": 26088, "stars": [], "topic_id": 20477, "date_created": 1303320588.4750049, "message": "@soska creo eso seria la reacción de la mayoría, es el problema del estereotipo que la gente tiene de los \"trabajos de verdad\" en México, ser empleado asalariado y quedarse asi hasta llegar a tener una buena pensión o pensar en un puesto ejecutivo después de muchos años, eso más que la burla es lo que la gente dice de los emprendedores en general", "group_id": 965, "id": 757809}, {"user_id": 2946, "stars": [], "topic_id": 20477, "date_created": 1303319565.793143, "message": "Personalmente, tengo un tío que siempre ha sido emprendedor (nunca en la industría tecnológica) y hasta ahorita nunca ha tenido un éxito. La reacción de la gente a su alrededor desde que recuerdo ha sido del tipo \"ya deja de hacerte menso y búscate un trabajo de verdad\".", "group_id": 965, "id": 757479}, {"user_id": 29866, "stars": [{"date_created": 1303321605.0823219, "user_id": 26088}, {"date_created": 1303324585.3461621, "user_id": 19921}, {"date_created": 1303331654.1068649, "user_id": 20022}], "topic_id": 20477, "date_created": 1303321311.6997781, "message": "Para mi es el síndrome de \"Pepe el Toro\" \"Nosotros los pobres y ustedes los ricos\" siempre se ve con malos ojos el ser ambicioso, hay mucha gente que siempre dice \"Prefiero ser pobre que ser rico e infeliz\" como si no existiera felicidad e infelicidad en ambos contextos. Existe un estigma muy marcado en nuestra sociedad. México necesita romper paradigmas en el tema de emprededurismo, hace falta más educación al respecto. En china en los libros de historia se enseñan las historias de los grandes emprendedores, en México seguimos hablando de los héroes de hace 100 y 200 años. Hay un libro que leí de esto muy bueno, se llama \"Basta de Historias!\" de Andres Oppenheimer.", "group_id": 965, "id": 758040}, {"user_id": 2946, "stars": [{"date_created": 1303339282.211431, "user_id": 26088}, {"date_created": 1303348848.6841469, "user_id": 12739}, {"date_created": 1303351168.2584591, "user_id": 26084}, {"date_created": 1303452554.3391249, "user_id": 25716}, {"date_created": 1303501881.2592101, "user_id": 13316}], "topic_id": 20477, "date_created": 1303324857.191627, "message": "Robert Kiyosaki (de padre rico y padre pobre) lo expresa muy bien. Dice algo como: \"He sido muy pobre y he sido rico, he sido infeliz siendo pobre y he sido infeliz siendo rico. Pero ser infeliz y pobre es peor que la infelicidad siendo rico\"", "group_id": 965, "id": 759310}, {"user_id": 29866, "stars": [], "topic_id": 20477, "date_created": 1303328072.691669, "message": "@soska Si, también recuerdo esa frase de Robert Kiyosaki, solo que no me la se de memoria como tú. Muy buena, me viene nostalgia de cuando leí por primera vez un libro de él. Hace ya 6 años y los libros de él personalmente me han cambiado la vida...", "group_id": 965, "id": 760059}, {"user_id": 10406, "stars": [{"date_created": 1303342786.1248, "user_id": 29866}], "topic_id": 20477, "date_created": 1303342061.9337029, "message": "Personalmente he tenido muchos fracasos, pero cada uno de ellos ha generado la suficiente tracción interna para intentar el siguiente reto y misteriosamente termina en éxito. La gente que me rodea sabe que siempre intento y los amigos que en verdad me aprecian siempre están a la expectativa de mi siguiente proyecto, simplemente por que solo hay 2 opciones: o un fracaso feo como dice soska o un éxito tremendo. Al principio me daba mucho miedo, perder energía, dinero, \"amigos\" y la apariencia, después te das cuenta que es cuestión interna, de motivación, de necedad y de nunca nunca arrepentirse... sinceramente sin todos estos fracasos no habría obtenido todos estos éxitos. Moraleja y sin agredir a los presentes: Que te valga madre!", "group_id": 965, "id": 762764}, {"user_id": 26105, "stars": [], "topic_id": 20477, "date_created": 1303448848.1407211, "message": "Es terrible como en varios proyectos (sean startups, changarros, pymes o lo que sea que hayas invertido tiempo y vida), fallan. Sin embargo, pues uno o se hace fuerte y continua (porque ya aprendiste de algún error) o te dedicas a otra cosa.", "group_id": 965, "id": 779182}, {"user_id": 25716, "stars": [{"date_created": 1303454364.6706049, "user_id": 24172}, {"date_created": 1303481448.6169729, "user_id": 29866}], "topic_id": 20477, "date_created": 1303454191.7840049, "message": "@soska, gracias por este tema, es muy interesante! Pero, por mi, yo solo quiero escuchar acerca experiencia en este. En verdad, quien aqui han experimentado el fracaso en startups? Es impossible saber como se va a fallar, si tu nunca ha tratado esto. Es diferente para cada personas y cada relaciones.\r\n\r\nPor mi, yo no compartir mucho mi fracasos (solo las experiancia buena yo aprendar de estos fracasos), porque mucho gentes solo quiera escuchar sobre exito. Y yo entiendo este :) Por ejemplo, es interesante escuchar las faltas/fracasos de gentes con mucho exito, pero no al reves :)\r\n\r\nYo he perdido dinero, tiempo y mucho mas porque en ese momento yo no tenia la suficiente experiencia. Pero estos fracasos construyo la experiencia que yo necesitaba. Es dificil para la mente y el alma, pero te ensena disciplina y humildad. Asi yo digo; bienvenido el riesgo de fracaso, porque como Nietszche decia: \"Lo que no te mata, te hacer mas fuerte\"", "group_id": 965, "id": 779575}, {"user_id": 25716, "stars": [], "topic_id": 20477, "date_created": 1303454341.266772, "message": "@dsch ah, si, ahora yo hablo mucho mas sobre mi fracasos, porque yo tengo mucho mas exito :P", "group_id": 965, "id": 779598}]