[{"user_id": 29475, "stars": [], "topic_id": 39125, "date_created": 1307910128.796411, "message": "Kyle,\n\nA year ago I requested that you separate the paid employees from the volunteers or the guide writers from the answer givers.  I also asked that you give a little material recognition to those who work so hard everyday answering questions.  You’ve really done neither, the promised Tees shirts have never appeared.  Your library of answers should now answer 97% of Mac repair questions.  I may drop by for one or two questions a day.  Good luck with your endeavor.", "group_id": 8807, "id": 1375599}, {"user_id": 29357, "stars": [], "topic_id": 39125, "date_created": 1307921389.743916, "message": "I've scaled back big time...Mainly because it's all the same questions. Does no- one read through any answers???", "group_id": 8807, "id": 1376492}, {"user_id": 29142, "stars": [], "topic_id": 39125, "date_created": 1308012145.1701629, "message": "Check out this post, it very accurately reflects how we feel:http://blog.stackoverflow.com/2011/06/optimizing-for-pearls-not-sand/ I really want to reduce the number of duplicate questions that are coming in.  What do you think of the ideas they're trying out there? What can we do to reduce simplistic duplicate questions and encourage quality posts? Sterling and I are going to be working very hard on fixing this over the next month or so.", "group_id": 8807, "id": 1386341}, {"user_id": 29142, "stars": [], "topic_id": 39125, "date_created": 1308012191.0728941, "message": "Oh, and good news! We got the t-shirts in! I'm hoping to we'll be able to send out an email later this week.", "group_id": 8807, "id": 1386345}, {"user_id": 29484, "stars": [], "topic_id": 39125, "date_created": 1308019443.934947, "message": "It does seem that we are getting the same questions and a simple cut and paste instead of using ones grey, (or is it white matter? ) gets kind of taxing.", "group_id": 8807, "id": 1386833}, {"user_id": 29484, "stars": [], "topic_id": 39125, "date_created": 1308019720.922487, "message": "It is you my colleagues and your support and acceptance that matter. Not some \"stinking T-shirt\" If my participation with the answer puts extra business or money into ifixit, so what? I am having fun and absolutely no obligation :-)", "group_id": 8807, "id": 1386855}, {"user_id": 29484, "stars": [], "topic_id": 39125, "date_created": 1308020467.5174179, "message": "I'd be careful with becoming to specialized but weeding out the \"simplistic duplicate questions\". Many of the people looking for answers may not be capable of asking 'sophisticated\" questions due to language barriers, age, and other factors. I do believe that it is up to the person that might have the solution, to inquire deeper into the subject. Consider your audience. Who are the people that you want to help?", "group_id": 8807, "id": 1386909}, {"user_id": 29484, "stars": [], "topic_id": 39125, "date_created": 1308019601.669482, "message": "T-shirt? What T-shirts? :-) I still get a kick out of a simple Thank you from the person that was helped. Pardon me for saying so but \"Screw the T-Shirt\" I know it is people like us that make ifixit a success.", "group_id": 8807, "id": 1386845}, {"user_id": 29357, "stars": [], "topic_id": 39125, "date_created": 1308034691.167639, "message": "This is after all is said and done a voluntary site.. There is no obligation on either party. I'm taking a break to recharge, I enjoy this \"job\"", "group_id": 8807, "id": 1388375}, {"user_id": 29484, "stars": [], "topic_id": 39125, "date_created": 1308099875.1961679, "message": "Me too :-) Hope to see you back soon pollytintop. Enjoy your break ....:-)", "group_id": 8807, "id": 1396469}]