[{"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297886722.691292, "message": "In looking back at my story, what seems to be going on is this: The IC wants the MC to be more like him. The result is that the MC becomes less like him. So, this all seems to be operating in the IC's P/S/S/R quad.", "group_id": 2515, "id": 123576}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297886751.6711881, "message": "Can I ask, what is your IC Concern & IC Benchmark?", "group_id": 2515, "id": 123585}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887387.515614, "message": "Maybe late in the story the IC \"reminds\" the MC of someone else very strongly, but it'd be hard to comment without knowing the specifics.", "group_id": 2515, "id": 123705}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887490.369683, "message": "Does it help compel a Change in the MC?  (If the MC is Change.)  Probably, but it's just part of the mix.", "group_id": 2515, "id": 123725}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887510.0348699, "message": "Does any of that rambling make sense?", "group_id": 2515, "id": 123731}, {"user_id": 7712, "stars": [], "topic_id": 6479, "date_created": 1297888147.884325, "message": "It's making sense to me.", "group_id": 2515, "id": 123856}, {"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297886840.1136839, "message": "IC Concern: Subconscious. Benchmark: Memory.", "group_id": 2515, "id": 123608}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887145.350035, "message": "Remember the Benchmark \"feels\" like a Concern, but it differs in that it gets stronger and stronger as you get closer to the end.  And sometimes it even overtakes the Concern in prominence.", "group_id": 2515, "id": 123652}, {"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297885923.801955, "message": "I'm taking a hard look at the Impact Character's Benchmark, actually, and it's intrinsically linked to how much or little they are impacting the MC. I'm assuming that this impact is most strongly felt by the MC in the Problem/Situation/Symptom/Response arena (of the MC througline). Or is it more flexible than that? The IC Benchmark is weak in my current draft, and I want to beef it up, but want to be clear about what I'm aiming for.", "group_id": 2515, "id": 123465}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887157.6245799, "message": "So does it impact the MC's Problem/Solution etc.?  Sure, everything impacts everything else as it all comes to a climax.", "group_id": 2515, "id": 123654}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887436.597249, "message": "Anyway, as you get closer to the climax of the story, whatever quality the IC has, either purposefully or inadvertently, that impacts the MC in terms of Memory becomes more prominent, but the IC throughline is not resolved until you've put a period on the \"Subconscious\" element.", "group_id": 2515, "id": 123715}, {"user_id": 7669, "stars": [], "topic_id": 6479, "date_created": 1297887190.0561399, "message": "\"Memory\" can mean \"remembering\" or \"forgetting\".", "group_id": 2515, "id": 123662}, {"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297892480.485877, "message": "Yes, this is all making sense. Unfortunately, only on the theory front. Staring at my story, I can come up with possibilities, but nothing that leaps out at me and yells, \"aha!\"", "group_id": 2515, "id": 124893}, {"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297892568.0502651, "message": "Incidentally, I'd love an example of when the benchmark overtakes the concern. (Or is this as simple as \"The last pedal is about to fall off the rose!\" so everyone hops too because they know the curse is going to become permanent -- it's not the concern, but it lights a fire under everyone's tail.)", "group_id": 2515, "id": 124915}, {"user_id": 7664, "stars": [], "topic_id": 6479, "date_created": 1297898563.7012939, "message": "In addition to all of this, I'm having trouble separating the purpose of the IC Benchmark from the purpose of the SS Benchmark (which is Conceptualizing). I mean, it's in the SS where the two interact after all.", "group_id": 2515, "id": 126245}]