[{"user_id": 13496, "stars": [{"date_created": 1311206020.1505949, "user_id": 3580}], "topic_id": 42385, "date_created": 1311205552.3150711, "message": "Did everything keep working or did you have to re-jigger?", "group_id": 81, "id": 1685737}, {"user_id": 3580, "stars": [], "topic_id": 42385, "date_created": 1311206053.1839011, "message": "Thanks for asking. It's sitting on my dock waiting for someone to tell me this is the first major upgrade that doesn't trash my MySQL installation and MacPorts install.", "group_id": 81, "id": 1685786}, {"user_id": 4976, "stars": [{"date_created": 1311653256.2965031, "user_id": 3580}], "topic_id": 42385, "date_created": 1311225772.7343359, "message": "If it's any help, my MacPorts install seems to be working fine after the upgrade, as are all my ports. Haven't tried MySQL, though (my PostgreSQL is working fine as well).", "group_id": 81, "id": 1687389}, {"user_id": 26888, "stars": [{"date_created": 1311653264.2124839, "user_id": 3580}], "topic_id": 42385, "date_created": 1311227413.444021, "message": "I installed the mysql .dmg package on snow leopard, upgraded this night and everything works like I didn't upgraded.", "group_id": 81, "id": 1687489}, {"user_id": 23018, "stars": [], "topic_id": 42385, "date_created": 1311225846.6415429, "message": "I had upgraded to the latest development preview of Lion, and it didn't mess up my virtualenv's too badly.  Certainly nothing that took longer than 30 minutes to sort out and get up and running again.  My current project is hitting MySQL, PostgreSQL and MongoDB and all the respective libraries have compiled and installed themselves fine.", "group_id": 81, "id": 1687393}, {"user_id": 26595, "stars": [], "topic_id": 42385, "date_created": 1311229730.185751, "message": "The problem isn't if you have snow leopard with everything installed and you upgrade, the problem usually is if you have a fresh install and need to compile everything.", "group_id": 81, "id": 1687603}, {"user_id": 33347, "stars": [], "topic_id": 42385, "date_created": 1311249239.0448151, "message": "I avoid the hassle of having to get python/db stuff working on my mac entirely but just spinning up a new EC2 instance and working on that. I generally just SSH in and use vim, or if I need to edit files on my mac I use MacFuse and mount with SSHFS.", "group_id": 81, "id": 1688422}, {"user_id": 33202, "stars": [], "topic_id": 42385, "date_created": 1311254467.145035, "message": "I upgraded last night -- didn't need to reinstall MySql, did have to re-install mysql-python (pip install -U mysql-python) which required me to install the newest xcode (now free in the app store)", "group_id": 81, "id": 1689008}, {"user_id": 1633, "stars": [], "topic_id": 42385, "date_created": 1311290960.8137369, "message": "Jiaaro: I just installed xcode but still cannot compile mysql-python. I keep getting an error related to llvm.", "group_id": 81, "id": 1693363}, {"user_id": 38798, "stars": [], "topic_id": 42385, "date_created": 1311772609.4911261, "message": "I've tried to reinstall mysql-python after lion upgrade but I've got some errors (xcode library).. Maybe I have to reinstall xcode but I didn't tried yet", "group_id": 81, "id": 1730902}, {"user_id": 3580, "stars": [], "topic_id": 42385, "date_created": 1312217967.6078019, "message": "My upgrade went fine.. definitely install XCode afterward... but didn't need to do anything with my mysql stuff, though I use python from macports.. so I assume folks who needed to rebuild the bindings were using system python...", "group_id": 81, "id": 1767687}, {"user_id": 927, "stars": [], "topic_id": 42385, "date_created": 1312248207.4943709, "message": "It was painless with homebrew: 20 minutes installing and rebooting while I was at lunch and I resumed working when I got back. I spent more time rebuilding virtualenvs using Python 2.7 since it's now the system python and … hey … shiny", "group_id": 81, "id": 1771672}, {"user_id": 13496, "stars": [], "topic_id": 42385, "date_created": 1312267417.853811, "message": "@Jiaaro If \"pip install -U mysql-python\" now works, then Lion has made some huge improvements! That's never worked for previous cats.", "group_id": 81, "id": 1773116}, {"user_id": 37128, "stars": [], "topic_id": 42385, "date_created": 1312279131.3013871, "message": "I was able to skip the XCode install by using this:", "group_id": 81, "id": 1773617}, {"user_id": 37128, "stars": [], "topic_id": 42385, "date_created": 1312279137.6740601, "message": "https://github.com/downloads/kennethreitz/osx-gcc-installer/GCC-10.7.pkg", "group_id": 81, "id": 1773618}, {"user_id": 37128, "stars": [], "topic_id": 42385, "date_created": 1312279218.0934451, "message": "The package includes GCC, LLVM, Clang, Developer CLI Tools (purge, etc), DevSDK (headers, etc) - all taken from the XCode installer.", "group_id": 81, "id": 1773627}]