[{"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304181882.4648831, "message": "Excruciatingly so. I hate most social media sites because they don't have a `remove all my data from your servers` button.", "group_id": 95, "id": 869419}, {"user_id": 9108, "stars": [], "topic_id": 32951, "date_created": 1304182391.6013031, "message": "@Aranjedeath I agree. And for many which actually do have the option to remove all of your data, it's frequently a buried option or you have to actually email their support staff to request it.", "group_id": 95, "id": 869637}, {"user_id": 30354, "stars": [{"date_created": 1304188398.0824561, "user_id": 26065}], "topic_id": 32951, "date_created": 1304186171.2588849, "message": "@Aranjedeath So you're annoyed that they tried to make your re-integration into their site easy? Why shouldn't that have happened? I'm guessing a user ID associated with your email address was added to some method of suggesting you to other users, and when you rejoined it just went in reverse. Why does it matter?", "group_id": 95, "id": 870281}, {"user_id": 30354, "stars": [], "topic_id": 32951, "date_created": 1304186273.2933891, "message": "(full disclosure: I'm of the thinking that privacy has it's place, but this is the future and I think people hype it up a bit too much online.)", "group_id": 95, "id": 870288}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304185901.823431, "message": "@Lloyd That makes sense to me, but I would rather the ability to wipe myself from a site. I would rather the ability to delete too much, than too little.", "group_id": 95, "id": 870260}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304187188.8266051, "message": "@JohnFail This.", "group_id": 95, "id": 870367}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304186593.4973819, "message": "@Lloyd For Facebook, that's true. But some other sites respect their user's intellectual property and speech rights (You say it, you own it).", "group_id": 95, "id": 870315}, {"user_id": 30354, "stars": [], "topic_id": 32951, "date_created": 1304185771.3872249, "message": "I get that you should be able to delete your account, but at the same time I don't think the things you posted should be removed. Anonymized or something, sure - but not deleted. Anything you'd engaged in, conversations you'd had-  might not make sense any more. It's all about consistency when you're looking over things.", "group_id": 95, "id": 870251}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304186720.5527511, "message": "(My bad, lack of shift-enter on my part) But also, that's not true. Other people can see it. And it can be packaged up in a .tar.gz and sold or given for free to any of those three letter government agencies. I don't want that to happen, unless there's a search warrant for MY information. I want my information removed because I know for a fact that the large companies don't have my best interests at heart, and I don't trust that their best interests in any way align with mine. So when I want my data removed, I actually mean it.", "group_id": 95, "id": 870327}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304185987.5034699, "message": "I deleted my facebook at one point, and was horrified when, due to the flood of complaints, I rejoined and they suggested most of my old friends. I had actually deleted, not disabled, my account, too. That sort of thing should not have happened, in my opinion.", "group_id": 95, "id": 870267}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304186281.5660231, "message": "@Lloyd Because when I delete my account, as far as I'm concerned I'm actually, ya know, deleting it. Not leaving most of my data on their servers to come back for later. I hate facebook enough as it is, I don't want them keeping my data when I've specifically asked them to delete it as well.", "group_id": 95, "id": 870289}, {"user_id": 30354, "stars": [], "topic_id": 32951, "date_created": 1304186403.794482, "message": "I'm pretty sure when you sign up it says something about anything you post being their property. Why does it matter if your data stays on their servers? Nobody else can see it, what exactly do you imagine they're doing with it? Attempting to build a robot clone of your consciousness based on a Facebook profile? :P", "group_id": 95, "id": 870296}, {"user_id": 28472, "stars": [], "topic_id": 32951, "date_created": 1304186839.0887101, "message": "And there's no real risk of disrupting the continuity of a conversation by removing my data anyway. I don't say anything on Facebook. Mostly song lyrics.", "group_id": 95, "id": 870338}, {"user_id": 9108, "stars": [], "topic_id": 32951, "date_created": 1304188086.533417, "message": "@Lloyd That's true, but I disagree with the logic that because it can happen with sites where you don't delete your profile it's okay to have more places where a potential problem could occur. It's akin to saying that because you can still get lung cancer without smoking, you may as well smoke. Just because a site that I use regularly can be compromised doesn't provide a basis for me leave a bigger trail on the Internet. This does change the probability. Is it changed by a lot? No. But it is still greater.", "group_id": 95, "id": 870503}, {"user_id": 9108, "stars": [{"date_created": 1304187194.221482, "user_id": 28472}], "topic_id": 32951, "date_created": 1304187133.4628949, "message": "@Lloyd Nobody else is *supposed* to be able to see the data which stays on their servers, but that's not always necessarily the case. Bad things can happen and people can gain access to things they shouldn't see. What recently happened with Sony is proof enough of that. If I delete my account from a site, I don't want there to be the possibility of any lingering information becoming available to another party.", "group_id": 95, "id": 870361}, {"user_id": 30354, "stars": [], "topic_id": 32951, "date_created": 1304187632.7452519, "message": "@Aranjedeath OK, YOU don't say much but that's not always the case. Quite frankly if you don't want the TLA agencies to get it.. don't put it on the internet!", "group_id": 95, "id": 870430}, {"user_id": 30354, "stars": [], "topic_id": 32951, "date_created": 1304187765.2318561, "message": "But yeah I have to agree with @johnfail, that can suck. But it's not a regular occurrence - what's stopping someone breaking into a system that you don't delete your data from? ie if you deleted your facebook but not your twitter, won't anyone ever crack twitter open and take your data? It's an issue everywhere you put your data, the ability to delete it from sites like Facebook isn't going to change the probability of your data leaking out by much at all.", "group_id": 95, "id": 870444}, {"user_id": 28472, "stars": [{"date_created": 1304223648.14868, "user_id": 24}], "topic_id": 32951, "date_created": 1304187977.9067709, "message": "I'm not concerned about people hacking in and taking it, I'm concerned about it being given away against my wishes. Hackers will be hackers, and security will always fail. That's a given. But if I've left the site and asked them to delete my data, there shouldn't be anything for a TLA or hacker to get.", "group_id": 95, "id": 870482}, {"user_id": 31293, "stars": [], "topic_id": 32951, "date_created": 1304193142.5948589, "message": "very very important!", "group_id": 95, "id": 871267}, {"user_id": 14637, "stars": [], "topic_id": 32951, "date_created": 1304319112.7220609, "message": "I think sites should allow you to purge data before a certain date as well as delete accounts.  You never know how data on social networks can come back and bite you on the arse in the future.  I wrote a short piece on it a few weeks ago http://www.timjoslyn.com/post/4396114047/why-i-am-glad-i-am-not-the-facebook-generation", "group_id": 95, "id": 880898}]