[{"user_id": 13650, "stars": [], "topic_id": 11761, "date_created": 1299694726.954999, "message": "I'm pretty sure I know the answer but I've got to ask. Is there a way to import data INTO DP. For instance, I'd like to import some scene info INTO the scene list.", "group_id": 2515, "id": 307324}, {"user_id": 7664, "stars": [], "topic_id": 11761, "date_created": 1299696785.7579451, "message": "Cut and Paste.", "group_id": 2515, "id": 307455}, {"user_id": 13650, "stars": [], "topic_id": 11761, "date_created": 1299697094.936923, "message": "That's a laborious process for tons of data.  See next", "group_id": 2515, "id": 307482}, {"user_id": 13650, "stars": [], "topic_id": 11761, "date_created": 1299697262.3421681, "message": "At some point I received/downloaded/got by osmosis/saw a stone tablet-\n\nthat was concerned with “Novel Structure”\n\nIt was based on something by V. Propp and mentioned “Writer's Digest” The Scenic Master Plot and how to write one.\n\nI found it interesting. \n\nI'd tell you where to get a copy but I don't know. Anyone else? I looked through the DP site and maybe I'm blind. Seems to me a good starting point since it at least gives an idea of scenes. Has anyone used it?                                                                                                    The scene list is something I'd like to plug into my scene list section. (Yeah cut and paste but I was hoping for something easier for 60+ scenes.", "group_id": 2515, "id": 307499}, {"user_id": 7664, "stars": [], "topic_id": 11761, "date_created": 1299724173.1011269, "message": "It's pretty easy to find Vlad Propp's story points using Google.", "group_id": 2515, "id": 310073}, {"user_id": 7664, "stars": [], "topic_id": 11761, "date_created": 1299724189.7622199, "message": "As for the rest of what you talk about, I've never used those parts of Dram.", "group_id": 2515, "id": 310076}, {"user_id": 10814, "stars": [], "topic_id": 11761, "date_created": 1299777921.684936, "message": "Since Dramatica Pro is not well suited to writing your finished work, it was not designed to import information into it.  The power of Dramatica Pro is to get you to develop and understand your story better.  The storytelling/illustrating sections in the software are best used to jot down ideas about your story, rather than write finished prose.  This is true if you analyze an existing story or create a new story.", "group_id": 2515, "id": 315032}, {"user_id": 13650, "stars": [], "topic_id": 11761, "date_created": 1299784927.7718711, "message": "My intent is not to write the story \"there\" but Propp's story points would be nice to include as info about what each scene \"might\" be showing", "group_id": 2515, "id": 315663}, {"user_id": 7712, "stars": [], "topic_id": 11761, "date_created": 1299790235.4133971, "message": "I've done what you are asking using Michael Hague's system, John Truby's, Blake Snyder's, and Paul Ruven & Marian Batavier's system to academically study similarities in story concepts, and gain a better understanding of what element to map to specific scenes... but I did so as Mike suggests -- copy and paste.", "group_id": 2515, "id": 316269}, {"user_id": 7645, "stars": [], "topic_id": 11761, "date_created": 1299864013.2765651, "message": "There are so many better alternatives for writing your story in than Dramatica that I wouldn't even bother with the copy and paste. Dramatica's power is in the story engine, the query system and the theme browser. Right now I capture all notes/thoughts/ideas in Simplenote which is an app easily accessible from my phone, my iPad or my desktop computer - both at home and at work. As far as the actual writing of a screenplay, well then you have Screenwriter", "group_id": 2515, "id": 324864}, {"user_id": 7664, "stars": [], "topic_id": 11761, "date_created": 1299868836.4800301, "message": "I also want to add that I think that it can be helpful to look at, well, pretty much any other story theory when you're looking to brainstorm, but I seriously question their value. You can use them to double-check your work, so to speak, but if yuo don't get the building blocks right, they're not going to help much. IMHO.", "group_id": 2515, "id": 325477}]