[{"user_id": 35099, "stars": [], "topic_id": 37989, "date_created": 1307119683.0827489, "message": "Hi everyone -- I'm new to studying Dramatica theory and am getting bogged down in this swamp of terminology that Dramatica throws at me in the theme section.  I was wondering what everyone's approach is to using the quads.  Do you memorize them, use them as cheat sheets, derive the terms?", "group_id": 2515, "id": 1278801}, {"user_id": 7664, "stars": [], "topic_id": 37989, "date_created": 1307122073.0628929, "message": "I use the theme browser and the dictionary all the time, and don't rely on my memory to get it right.\n\nThat said, what exactly do you mean by \"using the quads\"?", "group_id": 2515, "id": 1279103}, {"user_id": 7712, "stars": [], "topic_id": 37989, "date_created": 1307197528.542403, "message": "Hi skrantz822. But not just any swamp, a fertile swamp to help bring new life to any story! hahaha. Yeah, it can seem overwhelming, especially in the beginning--and I'll dare to add that complexity is even complicated by discussion groups such as these (but only in the beginning). I follow Mike Derk's lead and use the definitions located at the bottom of the theme browser, and the terms in the dictionary all of the time.", "group_id": 2515, "id": 1286496}, {"user_id": 7712, "stars": [], "topic_id": 37989, "date_created": 1307197760.2012031, "message": "Beginning by memorizing the terms is one possible approach, but it's more than just the definitions that come into play because each will have an influence on the other as it pertains to your story. I think that when one is beginning to use Dramatica, the learning-as-you-go approach is best--but each to his/her own as all of us have different learning styles.", "group_id": 2515, "id": 1286502}, {"user_id": 7712, "stars": [], "topic_id": 37989, "date_created": 1307197937.8464561, "message": "I think that if you feel overwhelmed, then you feel like many Dramatica users in the beginning. Continuing will a gradual approach, or the approach that works best for you, will lessen the initial impact and it will become a much more natural process in time.", "group_id": 2515, "id": 1286508}, {"user_id": 30951, "stars": [], "topic_id": 37989, "date_created": 1307199224.30496, "message": "The other thing I would recommend (as someone who still checks and double checks the Dramatica meaning of many of the terms) is to try switching between 'Original terms' and 'Layman's Terms' (Edit -> Preferences). A few of the terms were changed, so seeing both can also help to clarify. \n\nThis also helps when reading articles because some use the old terms, some new. Here you will find a mixture of old and new terms sometimes.", "group_id": 2515, "id": 1286545}, {"user_id": 35099, "stars": [], "topic_id": 37989, "date_created": 1307310848.7315271, "message": "Thanks everyone for the advice.  By \"using the quads\" I mean understanding how the creators of Dramatica derived the names of the elements from certain classes (e.g. how did they decide that Situation is composed of past, present, future, and PROGRESS?)  In other words, I want to be able to derive the meaning of the quads rather than defer to their specific definitions. ", "group_id": 2515, "id": 1296212}, {"user_id": 13650, "stars": [], "topic_id": 37989, "date_created": 1307351225.82074, "message": "Curious, what is the adavantage to \"derive the meaning of the Quads\"?", "group_id": 2515, "id": 1301543}, {"user_id": 30951, "stars": [], "topic_id": 37989, "date_created": 1307352232.2840941, "message": "Interesting question, mp131. About the how and why for the quads, my guess would be that these connections are what showed up in stories that were analysed.", "group_id": 2515, "id": 1301567}, {"user_id": 35323, "stars": [], "topic_id": 37989, "date_created": 1307354745.686188, "message": "I guess I understand what you mean. The Throughline-level of the chart is pretty well-explained in the theory book, and also the motivation action-decision part of the table. The rest is just thrown in front of you wihtout much explanation. (why is it that \"obtaining\" as an issue contains concerns like \"approach\" \"attitude\" \"self interest\" and \"morality\". Seeing the links between them is pretty hard for me too (not to mention bending my mind around concepts like: \"Gathering information relates to Activity as Present to Situation\"", "group_id": 2515, "id": 1301726}, {"user_id": 35323, "stars": [], "topic_id": 37989, "date_created": 1307354843.1253879, "message": "having a more detailed explanation of both the concern and the issue level of the chart, and also an explanation of not just the motivation elements but also the methodology, evaluation and purpose part would definitely be a nice touch. We have to work it out on our own I guess...", "group_id": 2515, "id": 1301738}]