[{"user_id": 11626, "stars": [], "topic_id": 6802, "date_created": 1297927898.7603431, "message": "Can someone say: FALSE FLAG ALERT?", "group_id": 3920, "id": 129837}, {"user_id": 11626, "stars": [], "topic_id": 6802, "date_created": 1297927519.9586551, "message": "MONTREAL - Montrealers might notice some unusual sights and sounds in the skies over the city on Thursday, but officials say there's no need to panic.\r\n\r\nThe North American Aerospace Defence Command (NORAD) announced Wednesday morning that it would be conducting a series of \"intercept and identification procedures\" in airspace over southern Quebec, eastern Ontario, northeastern Rhode Island and southeastern Massachusetts.\r\n\r\n\"Those living in these areas may hear and/or see NORAD-controlled fighter jets in close proximity to a U.S. Air Force C-21, which will be taking on the role of a Track of Interest (TOI),\" said a release issued by NORAD.\r\n\r\n\"In order to test responses, systems and equipment, NORAD continuously conducts exercises with a variety of scenarios. These exercises are carefully planned, closely controlled and include exercising airspace restriction violations, hijackings and responding to unknown aircraft.\"\r\n\r\nA TOI is a suspicious plane or a plane in distress.\r\n\r\nThe tests are scheduled to finish by early Thursday afternoon.\r\n\r\nNORAD is the bi-national Canadian and United States military command that provides maritime warning, aerospace alerts and aerospace defence for the two countries.\r\n\r\nThe practice exercises are being held as part of Operation Noble Eagle, introduced by NORAD after the Sept. 11, 2001, terrorist attacks.\r\n\r\nOperation Noble Eagle gives Canadian and U.S. fighter pilots an opportunity to practise ways to identify and intercept unknown aircraft, planes that violate airspace restrictions, and planes that report hijackings.\r\n\r\nhttp://www.montrealgazette.com/NORAD+conduct+exercises+Thursday+over+Montreal/4294605/story.html", "group_id": 3920, "id": 129825}]