[{"user_id": 30901, "stars": [], "topic_id": 43030, "date_created": 1312085937.1104519, "message": "It's called Yorco. We're getting close to moving into a beta phase on our first app Yorco Task. We're still prototyping the flow and content on our landing page - Love to get your guys thoughts and reactions.", "group_id": 250, "id": 1757471}, {"user_id": 30901, "stars": [{"date_created": 1314489341.8442211, "user_id": 40272}], "topic_id": 43030, "date_created": 1312085971.8573589, "message": "Website is http://yor.co and my email is robb@yor.co if you'd like to get in touch or shoot over more thoughts.", "group_id": 250, "id": 1757476}, {"user_id": 7110, "stars": [], "topic_id": 43030, "date_created": 1312105030.551897, "message": "Hi Robb - it looks like a clean page with an intriguing concept - although after a quick read through your front page, it is a bit unclear to me what your app does, why I would want to use it and who it is for. Why do I need to track \"tasks\" with my friends? I think you are mixing your history as a company (how we came together to make some software) with your product and what / who it is for - and the end result is a sort of muddled statement on both counts. Maybe refocus on some core thoughts - who are you targeting? Why do they need your app? What will they be able to do with it? What are some example use cases of what they are doing with it ? Then convey that ...", "group_id": 250, "id": 1758247}, {"user_id": 8433, "stars": [], "topic_id": 43030, "date_created": 1312109759.502249, "message": "I agree with Kravitz.  The story needs to move to an About Us page.  The landing page needs to be about the app - what does it do?  what makes it different from the 1000 other task management apps out there?  I think getting \"things done with your friends\" is not the market you should be going after.  I doubt anyone wants to use a task management tool to remind their friends to buy beer for the party.  Small distributed teams (i.e., businesses) might use a tool like this if it offers some functionality that is missing from whatever they use now.  I'd also spend more time thinking about what it means to be \"social\" in terms of tasks.  No one wants a twitter feed full of mundane items that were assigned to you by your team.", "group_id": 250, "id": 1758406}, {"user_id": 27734, "stars": [], "topic_id": 43030, "date_created": 1312117667.5008359, "message": "I also agree with BryanBurke, As their are several task managements apps exits in market plus things are not that much clear on your web page....and i also want to suggest to provide some interactive demo of your app on your webpage...and why not to take it on phones, smartphones etc??", "group_id": 250, "id": 1758637}, {"user_id": 30901, "stars": [], "topic_id": 43030, "date_created": 1312135681.576992, "message": "Awesome! Great thoughts. Thanks a ton for the feedback guys. Really appreciate that. We've been talking about restructuring the page to give a much larger introduction to the app. We got a bit stuck up in trying to introduce in the company as a whole vs. just introducing the task - Your guys thoughts definitely help confirm what we were thinking in that it's just a bit muddled.", "group_id": 250, "id": 1759674}, {"user_id": 33127, "stars": [], "topic_id": 43030, "date_created": 1312181393.2149291, "message": "looking forward to seeing round-2", "group_id": 250, "id": 1763710}, {"user_id": 34269, "stars": [], "topic_id": 43030, "date_created": 1312221493.8462, "message": "The site has a nice visually appealing look. That being said, you might consider letting some of the text or content from below the first group of text under the story heading show at the bottom of the screen to cue the user to scroll down. At normal zoom on my 27 inch mac monitor it wasn't obvious to scroll down further because of all the white space at the bottom. Also, it's not clear what to download in order to try out your product. The join feature was obvious but where do I download the product?", "group_id": 250, "id": 1768175}, {"user_id": 26533, "stars": [], "topic_id": 43030, "date_created": 1314115379.226723, "message": "@robbschiller so good", "group_id": 250, "id": 1940800}, {"user_id": 26533, "stars": [], "topic_id": 43030, "date_created": 1314115393.503629, "message": "@robbschiller so good", "group_id": 250, "id": 1940806}, {"user_id": 33347, "stars": [], "topic_id": 43030, "date_created": 1314481087.154392, "message": "As soon as I learned that it was a collaborative task manager, I wanted to see a short video of the workflow and some screenshots. I'd like to see a video demo (if a short demo isn't possible, the workflow needs to be streamlined) in-place of the splash image and a row of screenshots under that. The number one concern for me is whether or not this is usable.", "group_id": 250, "id": 1977289}, {"user_id": 40463, "stars": [], "topic_id": 43030, "date_created": 1314760072.388593, "message": "just do it", "group_id": 250, "id": 2008477}, {"user_id": 30901, "stars": [], "topic_id": 43030, "date_created": 1315957089.235285, "message": "Awesome! Thanks guys. We've been working on the landing page a little bit the last 3 weeks or so. Made a few changes and love to know your thoughts! We're actually about 1 week away from starting an alpha phase and getting the working product into some users hands. Would love for any of you guys to be in that process! Definitely sign up in the Join Us section if you'd like to check it out!", "group_id": 250, "id": 2120297}, {"user_id": 26780, "stars": [], "topic_id": 43030, "date_created": 1317578998.9252319, "message": "rtuoguiug", "group_id": 250, "id": 2261619}, {"user_id": 26780, "stars": [], "topic_id": 43030, "date_created": 1317578966.7550609, "message": "hey everyone", "group_id": 250, "id": 2261616}, {"user_id": 26780, "stars": [], "topic_id": 43030, "date_created": 1317578988.129261, "message": "what's happening?", "group_id": 250, "id": 2261618}, {"user_id": 41938, "stars": [], "topic_id": 43030, "date_created": 1317931459.0716591, "message": "The design is really great, but as others said the vague value proposition and mixing up the founding team story doesn't help in that. Screenshots are good, better yet is telling me what I'm able to do you with your app that I couldn't do before", "group_id": 250, "id": 2294322}, {"user_id": 14650, "stars": [], "topic_id": 43030, "date_created": 1318572388.8479719, "message": "drives me a bit insane looking at how much text appears on landing page", "group_id": 250, "id": 2344852}, {"user_id": 14650, "stars": [], "topic_id": 43030, "date_created": 1318572326.214148, "message": "too much info", "group_id": 250, "id": 2344847}, {"user_id": 14650, "stars": [], "topic_id": 43030, "date_created": 1318572371.9061289, "message": "i thought it has too much info, but no substance on the main thing that it's supposed to do", "group_id": 250, "id": 2344851}, {"user_id": 41102, "stars": [], "topic_id": 43030, "date_created": 1318681442.2289071, "message": "eye catching. IMHO, move the Who to another page.", "group_id": 250, "id": 2353270}, {"user_id": 42383, "stars": [], "topic_id": 43030, "date_created": 1319011508.9697449, "message": "I'd love to see an introduction video of Yorco. I love the large font.", "group_id": 250, "id": 2383481}, {"user_id": 42383, "stars": [], "topic_id": 43030, "date_created": 1319011682.0459421, "message": "Take a look at https://trello.com/. I am using it for organizing my personal projects and it is perfect for it. I love the simplicity of Trello. It has a super simple core idea that can be used in many ways like Google Wave had. The only problem with Google Wave was that I didn't know how to use it. Trello solved this problem by providing use case examples on their front page. I think Trello could be a source of inspiration for you guys. I'd love to see a super simple service that does its main value proposal brilliantly.", "group_id": 250, "id": 2383492}, {"user_id": 42442, "stars": [], "topic_id": 43030, "date_created": 1319014703.34039, "message": "I love the freshness and funkiness of the design. I think the colours work really well within the  overall site design. Speaking with my \"social media marketing\" hat I was trying to see what problem was yor.co solving and who were the people that needed that problem solving. I think you can tell the \"story\" of the brand more effectively through video, like common kraft videos: http://www.commoncraft.com/  I think with yor.co being so fresh, we need the faces of the team to be seen on video, as I think it would influence me more to find more about yor.co (the human touch element. I am so glad to see more and people using .co ending in their domain names. I am going to be really helpful but it might not feel good. Narrow down your niche. If this is for families than you would have a different design atmosphere, I also found myself asking in what way is yor.co different from base camp, which I have been using and still use. So again what niche has base camp left out, which yor.co can be the big fish in a smaller pond. Really clever how when you hit the pages on the top menu the appropriate page slides up or down. I think that the design of this project 10/10 but if someone were to ask me who was yor.co niche, I would not be able to give a clear answer.", "group_id": 250, "id": 2383633}, {"user_id": 42452, "stars": [{"date_created": 1319025448.4165521, "user_id": 42383}], "topic_id": 43030, "date_created": 1319021462.446311, "message": "The visual layout looks great. I didn't get the whole selling point, though. I'd like to see screen shots and/or screen cast of the product to get a feeling of it.", "group_id": 250, "id": 2383934}, {"user_id": 30901, "stars": [], "topic_id": 43030, "date_created": 1319292636.7547081, "message": "@EdgarDanmer thanks for the great response!", "group_id": 250, "id": 2406805}, {"user_id": 42434, "stars": [], "topic_id": 43030, "date_created": 1319533209.683779, "message": "hi", "group_id": 250, "id": 2428097}]