[{"user_id": 13650, "stars": [], "topic_id": 12450, "date_created": 1299876355.663733, "message": "For those of you who might be interested, here are the story points  I discern in the book Maltese Falcon if you want to compare them to the ones in the 1941 movie. \nStory events:\nMiss Wonderly (aka Brigid) hires Spade and Archer (partner) to follow Thursby\nArcher found dead. (At the end of the book we learn Brigid killed Archer.)\nPolhaus and Dundy (police) visit Spade asking about his whereabouts Thursby's death revealed.  Wilmer shot Thursby (a difference fro your point))\nSpade gets visit from Archer's wife (he was having an affair with her before Archer was killed)\n Spade is visited  Joel Cairo (offers him 5K for black bird)\nCairo pulls gun. Spade disarms him. Spade questions him and lets him search office.\nBrigid contacts Spade. Spade mentions Cairo. Brigid becomes nervous. Says she must meet Cairo.\nCairo and Brigid meet at Spades apartment.\nDuring argument between Brigid and Cairo police show up.\nCairo is taken by police for questioning. \nSpade tries to question Brigid but she sleeps with him (book AND Cortez movie- pre-code)\nNext day Spade visits Cairo. \nSpade confront Wilmer Cook who is tailing him. Confront Cook.\nSpade gets call from Gutman.\nGutman explains “Falcon.”\n       Gutman sends his “agents” (Cairo, Thursby, and Brigid) to get it from a Russian. (Thursby and Brigid supposedly stole it)\n       It is during this “explanation Spade is drugged.\n  Upon waking up Spade goes to office and tell Effie the story.\nInjured man shows up with package (Jacobi) and dies from gunshots.\n      Falcon is in package.\n      Spade secrets the bird.\nSpade goes to ship (which is on fire)\n Spade goes to Brigid meeting   finds drugged “woman (Rhea Gutman) she lies about where Brigid is\nAt his apartment he finds Brigid along with Gutman, Cairo, Cook\nGutman gives Spade money for bird.\nSpade mentions he needs a fall guy for the various murders.\nCairo and Gutman agree that it should be Cook.\nGutman starts clearing up mysteries. \n       He and Cook approached Thursby. Thursby was loyal to Brigid. Cook shot Thursby.\n       Brigid  had seduced Jacobi and hid Falcon with him.\n    Brigid instructed Jacobi to give bird to Spade. \n         Gutman tried to drug Spade to keep him from getting bird.\n         Cook shot Jacobi but the bird still got to Spade.\nSpade calls Effie to retrieve bird.\nBird is given to Gutman and he discovers it is a fake.\nWilmer escapes.\nGutman asks for money back (Spade gives some) and he and Cairo are headed for Europe.\nSpade calls police.  Tells them story.\nSpade asks Brigid why she killed Archer.\n           She wanted to get Thursby out of the story so she could profit from Falcon. (interesting side note: no mention of Jacobi )\n                She killed Archer to pin that on Thursby (I think this is a weak point)\nSaid she need Spade to protect her from Gutman. Now she says she is in love wwith Spade.\nHe says he will turn her in for killing Archer to protect himself.\nPolice show up. He turns over Brigid, the fake Falcon and money he kept from Gutman.\nBack at office tells Effie. Story. \nEffie disgusted by what he has done.\nArcher's wife shows up.", "group_id": 2515, "id": 326844}, {"user_id": 13650, "stars": [], "topic_id": 12450, "date_created": 1299876972.7531109, "message": "Based on the above story point you might see that just about everyone is in it for themselves even when they appear to be working with others. And in the end we see Archer's wife show up even though we know it too will be just an \"affair\" where Spade and Iva have no feelings. In fact the only \"emotion\" might be Effie saying \"Don't touch me.\" No a resounding affirmation of the human situation.", "group_id": 2515, "id": 326951}, {"user_id": 13650, "stars": [], "topic_id": 12450, "date_created": 1299877410.2101779, "message": "SUPPOSE the story goal is \"the system doesn't allow anyone to win\" Can \"the system\" be the protagonist? Can the system be the the MC? Do we have difficulties seeing it this way because we don't want THAT type of MC to triumph? Just thought I'd toss that out.", "group_id": 2515, "id": 327008}, {"user_id": 10814, "stars": [], "topic_id": 12450, "date_created": 1300033468.505877, "message": "Remember, the MC represents the \"I\", personal perspective in problem solving.  \"The system doesn't allow anyone to win\" is an objective perspective, not a subjective perspective like that of the MC.  So, I do not think that abstraction could represent the MC.  HOWEVER, the MC could personally believe in that as part of his thematic focus.", "group_id": 2515, "id": 341559}]