[{"user_id": 16549, "stars": [], "topic_id": 36739, "date_created": 1306330858.707339, "message": "I've just bought my first ever MBP (13\" SSD i7 8GB) and I'm loving it, so much so that the thought of it breaking scares me!  Is it worth paying for AppleCare to speed up any repairs in case something breaks??", "group_id": 1295, "id": 1177972}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306331345.389981, "message": "It is better to be safe than sorry down the line.", "group_id": 1295, "id": 1178157}, {"user_id": 16549, "stars": [], "topic_id": 36739, "date_created": 1306331605.9176829, "message": "So if you don't have AppleCare you just have to pay for repairs yourself? It's like insurance??", "group_id": 1295, "id": 1178232}, {"user_id": 581, "stars": [], "topic_id": 36739, "date_created": 1306332296.698895, "message": "Basically", "group_id": 1295, "id": 1178410}, {"user_id": 16549, "stars": [], "topic_id": 36739, "date_created": 1306330899.5327339, "message": "I do live near a couple of big Apple Stores", "group_id": 1295, "id": 1177989}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306331330.7046421, "message": "It is definitely worth it.", "group_id": 1295, "id": 1178149}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306331302.3367009, "message": "AppleCare isn't for speeding up repairs, you don't get bumped in front of everyone on a line. It is for extending your warranty three years.", "group_id": 1295, "id": 1178139}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306333061.195585, "message": "Yes, that's what a warranty is.", "group_id": 1295, "id": 1178619}, {"user_id": 651, "stars": [{"date_created": 1306370691.201071, "user_id": 581}], "topic_id": 36739, "date_created": 1306337705.856869, "message": "I think it's really worth it, as MacBook repairs are often quite expensive. However you have a 1-year warranty anyway, so you can also wait a year without risk if you are not sure. Just make sure you register the AppleCare before the 1-year warranty runs out.", "group_id": 1295, "id": 1179680}, {"user_id": 32277, "stars": [], "topic_id": 36739, "date_created": 1306370152.0708561, "message": "I have never had a repair that Apple wouldn't do, and I've never gotten AppleCare. They even do a lot of stuff out of warranty, for free, if it's something that seems defective. I've had my entire keyboard replaced due to one of their manufacturing glitches with old black Macbooks, 3.5 years after I bought it.  Gotten new chargers, in and out of warranty, and I got them to replace my battery a day before my 1 year warranty expired once. It's probably something you can live without if you don't want to pay.", "group_id": 1295, "id": 1186225}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306373792.0915141, "message": "some people are lucky and some people have shitty applecare managers", "group_id": 1295, "id": 1186575}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306373805.0756791, "message": "in my cases, they refused me a few times because of not having applecare", "group_id": 1295, "id": 1186577}, {"user_id": 26433, "stars": [], "topic_id": 36739, "date_created": 1306373779.6797421, "message": "that doesn't happen everywhere", "group_id": 1295, "id": 1186573}, {"user_id": 22218, "stars": [], "topic_id": 36739, "date_created": 1306387140.8411851, "message": "I got 3 batteries, 1 hard drive and 1 logic board out of the apple care (AFTER the 1 year warranty) on my last MBP.  Paid for itself after 2 batteries in case you didn't do the math...", "group_id": 1295, "id": 1188252}, {"user_id": 30796, "stars": [], "topic_id": 36739, "date_created": 1306389496.7258539, "message": "My last MBP's warranty covered two battery replacements, before the MBP totally died. After they tried fixing it (replacing almost every part) they couldn't fix it so they replaced it. Since I had a 15\" with Expresscard and the new 15\" doesn't have Expresscard, they replaced it with a 17\" (at no extra charge). And they let me buy new AppleCare for the new MBP so it's covered too.\n\nSo it wasn't worth it for all the other Macs I've ever bought, but that AppleCare alone paid for most of (if not all) the AppleCares I've ever bought.", "group_id": 1295, "id": 1188554}, {"user_id": 34499, "stars": [], "topic_id": 36739, "date_created": 1306950920.047446, "message": "I also asked myself that same question a couple of days ago, when my new MBP arrived, but since the last one worked for 5 full years without a glitch I'm (again) not going for the AppleCare.", "group_id": 1295, "id": 1255962}, {"user_id": 12709, "stars": [], "topic_id": 36739, "date_created": 1306952825.364568, "message": "I'd say that AppleCare is worth it. I've thankfully only needed to use it on one of my Macs, but when my fan, HDD & battery went, they replaced them all for free. It's just peace of mind if something does go wrong.", "group_id": 1295, "id": 1256313}, {"user_id": 11421, "stars": [], "topic_id": 36739, "date_created": 1307014547.4124401, "message": "The standard 1 year warranty has a good chance of covering any damage caused by faulty parts, as they're most likely to break within the first year and will get replaced for free. This just leaves the parts that break by wear & tear (drives, fans, keyboard, display hinge, plugs and battery). So that leaves three things to consider: 1) How long do you plan to keep the machine? If you're going to replace it after 1.5-2 years, you get limited benefit from a 3 year AppleCare contract, apart from a slightly higher resale value. 2) How well do you treat your computer? If you keep it in a bag and only ever get it out on a desk, you're probably save. If you use it on the road, in an industrial setting or you need to plug things in/out of it 15 times a day, get Applecare. 3) How good are you with fixing things yourself? You can buy 3 hard drive replacements for the cost of AppleCare if you replace them yourself.", "group_id": 1295, "id": 1265585}, {"user_id": 35872, "stars": [], "topic_id": 36739, "date_created": 1307688738.2012889, "message": "hi", "group_id": 1295, "id": 1357833}, {"user_id": 43010, "stars": [], "topic_id": 36739, "date_created": 1320196409.2915349, "message": "Yeah I guess", "group_id": 1295, "id": 2488263}, {"user_id": 2726, "stars": [], "topic_id": 36739, "date_created": 1320211201.839972, "message": "Statistically speaking it is financially better to NOT buy AppleCare. As @sdfjkl says, most part failures occur under the one year warranty. By the time most models have aged to the point of failure due to old age, the AppleCare warranty has long expired.", "group_id": 1295, "id": 2489850}, {"user_id": 2726, "stars": [], "topic_id": 36739, "date_created": 1320211185.837672, "message": "Statistically speaking it is financially better to NOT buy AppleCare. As @sdfjkl says, most part failures occur under the one year warranty. By the time most models have aged to the point of failure due to old age, the AppleCare warranty has long expired.", "group_id": 1295, "id": 2489847}, {"user_id": 32812, "stars": [], "topic_id": 36739, "date_created": 1320220428.3983121, "message": "I'm on my second MBP in the past 5 years.  First one I sold to my old roommate. Have never once had AppleCare or have ever needed it, and I can say with much certainty that I abuse my laptop quite a bit more than the average consumer.  I will say these machines can in fact take a beating and continue ticking.\n\nAC is limited coverage and only covers wear/tear.  If anything is to happen, its highly unlikely it happen after the first year.  Only time I've ever had an issue was my first MBP had a weird battery issue (happened right after a battery firmware update and lots of others had the same issue.)  This in fact happened after my first year warranty was over.  Apple sent a new battery to me the next day before i sent the old one back, free of charge, postage on them.\n\nI think of it this way: what's more likely to happen after one year: it actually malfunctions due to wear/tear or due to something stupid that applecare doesn't cover anyway? (in my case most definitely the latter for how much i abuse my laptop.)\n\nThis of course can always be taken with a grain of salt.  I have made upgrades to my laptop (new HDD on first, replaced DVDROM on second with second hard drive.) and i have zero issues fixing things myself.  I have never had to fix either of my laptops (both upgrades due to me wanting them.)  I may see someone less avid of a user wanting it for the ease of mind but thats about it.  Even then I still would highly NOT recommend it.  (may be a bit of rant)", "group_id": 1295, "id": 2490626}, {"user_id": 32812, "stars": [], "topic_id": 36739, "date_created": 1320220501.4627769, "message": "I'm on my second MBP in the past 5 years.  First one I sold to my old roommate. Have never once had AppleCare or have ever needed it, and I can say with much certainty that I abuse my laptop quite a bit more than the average consumer.  I will say these machines can in fact take a beating and continue ticking.\n\nAC is limited coverage and only covers wear/tear.  If anything is to happen, its highly unlikely it happen after the first year.  Only time I've ever had an issue was my first MBP had a weird battery issue (happened right after a battery firmware update and lots of others had the same issue.)  This in fact happened after my first year warranty was over.  Apple sent a new battery to me the next day before i sent the old one back, free of charge, postage on them.\n\nI think of it this way: what's more likely to happen after one year: it actually malfunctions due to wear/tear or due to something stupid that applecare doesn't cover anyway? (in my case most definitely the latter for how much i abuse my laptop.)\n\nThis of course can always be taken with a grain of salt.  I have made upgrades to my laptop (new HDD on first, replaced DVDROM on second with second hard drive.) and i have zero issues fixing things myself.  I have never had to fix either of my laptops (both upgrades due to me wanting them.)  I may see someone less avid of a user wanting it for the ease of mind but thats about it.  Even then I still would highly NOT recommend it.  (may be a bit of rant)", "group_id": 1295, "id": 2490629}, {"user_id": 831, "stars": [], "topic_id": 36739, "date_created": 1320243655.0129521, "message": "I think some people are lucky and some not. I've had 4 MacBooks and have had AppleCare on all of them. Not for me it was a no-brainer since I get them for work, and on expense (capital purchase, technically), but I have needed the AC all 4 times, and they have never failed to cover something, defect or wear and tear. I'm not as careful as I should be with my laptops, and I travel a lot and I have had some serious accidents, and AC has always taken care of everything hassle-free. So as someone else said, it's paying for peace of mind. I don't think the stats are clear one way or another as to whether AC has ben a good value for most users, I've seen stats that call it either way, and I suspect you can always find stats to support your inclination, but I will say that stats are no use when you're at an Apple Store with a broken product pleading with them to cut you a break on the expensive repair since you didn't get AC. I've been to the Apple Store often enough to watch that sad scenario in progress several times for some other poor soul there at the same time. It's almost as heartbreaking as the \"I don't have a backup\" sob story.", "group_id": 1295, "id": 2491738}, {"user_id": 43015, "stars": [], "topic_id": 36739, "date_created": 1321300390.612922, "message": "No", "group_id": 1295, "id": 2573514}]