[{"user_id": 11626, "stars": [], "topic_id": 7220, "date_created": 1298019899.5351839, "message": "Hyperinflation Watch - January 15, 2011\r\n\r\nNot Only Commodities are Signaling Hyperinflation –\r\n\r\nJanuary 15, 2011 – The rise in commodity prices over the past several months has been unrelenting. Equally unrelenting has been the stream of central bank apologists aiming to re-direct the blame for soaring prices to almost everything imaginable except the real cause, which of course is unrestrained money printing.\r\n\r\nhttp://www.fgmr.com/images/Images Articles/S&P 500 and quantitative easing 14 Jan 2011.GIF\r\n\r\nHere is a chart that shows rising prices that cannot be blamed on bad weather, failed crops, global warming, a new ice age or sunspots. This chart of the S&P 500 Index shows a near perfect correlation to the Federal Reserve’s money printing, a/k/a “quantitative easing”.\r\n\r\nThe S&P Index and other stock indices like the Dow Jones Industrial Average are not rising because of better economic conditions or an improved outlook for economic activity. Stock prices are rising because of money printing, just like they did in the early days of the hyperinflations in Weimar Germany, Argentina, Zimbabwe and every other country ravaged by misguided government and central bank policies.\r\n\r\nhttp://www.fgmr.com/not-only-commodities-are-signaling-hyperinflation.html", "group_id": 3063, "id": 140920}, {"user_id": 313, "stars": [], "topic_id": 7220, "date_created": 1299934929.4813621, "message": "One of the reasons for the recent rise in corporate stock prices is that their share prices were seriously beaten down, and now after massive layoffs and cost cutting measures, many investors see them as \"leaner and meaner\" and poised for a rebound.", "group_id": 3063, "id": 331511}, {"user_id": 11626, "stars": [], "topic_id": 7220, "date_created": 1301092329.737747, "message": "Well, there's nothing like \"positive thinking\"...", "group_id": 3063, "id": 443021}, {"user_id": 11626, "stars": [], "topic_id": 7220, "date_created": 1301092346.9080541, "message": "AKA: \"Denial.\"", "group_id": 3063, "id": 443022}]