[{"user_id": 43051, "stars": [], "topic_id": 47413, "date_created": 1320283538.6372731, "message": "I just started this, and I'm just getting back from vacation, so my pantry was a little bare. I spent about $18 on ingredients that will last me 2 days... If you don't mind, could you share what your grocery spending has been like?", "group_id": 11977, "id": 2495750}, {"user_id": 42626, "stars": [], "topic_id": 47413, "date_created": 1320300314.6747899, "message": "My spending has gone waaaay down since I started this. Granted, I cook not only for my vegan self, but also for a hardcore 'meat-atarian' so I still buy meat for him, which makes my bill slightly higher. In all, it works out for us to about 40-50 a person per week, but when I catch produce on sale, I stock up and using dry beans that I cook in my crockpot has saved us quite a bit. If I was by myself, I think it would be closer to 30-40 a week for just me. Meat is super expensive!", "group_id": 11977, "id": 2497469}, {"user_id": 42630, "stars": [], "topic_id": 47413, "date_created": 1320433830.73562, "message": "One you have the 'basics' (spices, stock, etc) you will notice a big decrease in your bill.  That has been a really big help.  Plus, veggies grow in pots beautifully. Try doing that, I have and it is wonderful!", "group_id": 11977, "id": 2507306}, {"user_id": 42833, "stars": [], "topic_id": 47413, "date_created": 1320494557.836184, "message": "I've noticed a decrease as well... AFTER I got my pantry stocked. Once that happened, it's just a matter of supplementing.", "group_id": 11977, "id": 2511301}, {"user_id": 42932, "stars": [], "topic_id": 47413, "date_created": 1320675966.66047, "message": "400 a month for two", "group_id": 11977, "id": 2526143}, {"user_id": 42635, "stars": [], "topic_id": 47413, "date_created": 1320701505.7008109, "message": "Mine has been high but I've been having to get quite a few pantry staples for my apartment at school...at home with my hubby, I have a well-stocked pantry but at school it was quite barren.  Looking much better now, but my grocery bill has suffered quite a bit :(", "group_id": 11977, "id": 2528517}]