[{"user_id": 30287, "stars": [], "topic_id": 36579, "date_created": 1306243888.1241491, "message": "Random thought: I was just considering how some really great documentaries actually conform precisely to the Dramatica theory.  \"King of Kong\" especially came to mind.\n\nFour throughlines!  OS: the Donkey Kong competition. MC: Steve Wiebe's desire to finally achieve something he can be proud of. IC: Billy and his obnoxious self-aggrandizing. SS: Steve vs. Billy\n\nI suspect that \"American Movie\" and \"Hoop Dreams\" will work as well. It's amazing how much this theory seems to permeate really good stories.", "group_id": 2515, "id": 1165859}, {"user_id": 30287, "stars": [], "topic_id": 36579, "date_created": 1306244512.5597601, "message": "Chris and co., my hat is off to you.", "group_id": 2515, "id": 1165956}, {"user_id": 33839, "stars": [], "topic_id": 36579, "date_created": 1306260660.4682341, "message": "That's interesting to look at documentaries through Dramatica.  When I stop and think about it, though, it shouldn't be because documentaries, as objective as they try to be, usually try to take \"something\", whether it be an argument, piece of history, etc., and examine it from different aspects.  The Paradise Lost documentaries could probably be filtered through Dramatica, while a documentary like the Thin Blue Line clearly sets out to make an argument and overturned a man's wrongful conviction.", "group_id": 2515, "id": 1168826}, {"user_id": 10814, "stars": [], "topic_id": 36579, "date_created": 1306281214.284126, "message": "I know of a Dramatica user that used it to organize his documentary, though I can't seem to find my discussions with him.", "group_id": 2515, "id": 1172012}, {"user_id": 7669, "stars": [], "topic_id": 36579, "date_created": 1306301251.347394, "message": "We also have a storyform among the Users Group discussions for Michael Moore's \"Sicko\".  A podcast too, I presume.", "group_id": 2515, "id": 1174729}, {"user_id": 33839, "stars": [], "topic_id": 36579, "date_created": 1306333951.0635779, "message": "Thanks, I'll have to check it out.  I am reminded of my documentary professor back in college who complimented me on my writing (papers), noting that I had this sneaky way of writing something which appeared to be objective, yet hidden within there were hints of \"the author's voice\" - or more specifically, the argument I was making.  There are all sorts of different kinds of documentary styles, but Michael Moore's are definitely ones which are made to formulate an argument... and any good argument is going to look at opposing viewpoints, much in the same way good stories, er, complete stories, have those four through lines.", "group_id": 2515, "id": 1178901}]