[{"user_id": 11626, "stars": [], "topic_id": 7616, "date_created": 1298195873.540699, "message": "http://www.google.com/hostednews/afp/media/ALeqM5iNjo3VkJW4PhlgMr9C0cleHJzFzg?docId=photo_1298040938438-1-0&size=s2\r\n\r\nSAN FRANCISCO — The US National Security Agency (NSA) chief on Thursday urged top computer security specialists to harden the nation's critical infrastructure against inevitable destructive cyber attacks.\r\n\r\n\"This is an important time,\" NSA and Cyber Command director Gen. Keith Alexander said during a presentation at a premier RSA Conference in San Francisco.\r\n\r\n\"Most of the destructive tools being developed haven't been used; we need to use this window of opportunity to develop defenses.\"\r\n\r\nTwo days earlier, Deputy Secretary of Defense William Lynn gave a similar warning, saying the capability clearly exists for malicious software to cause real-world damage at power plants, water supplies and other vital points.\r\n\r\n\"Few weapons in the history of warfare, once created, have gone unused,\" Lynn said during a speech at RSA.\r\n\r\n\"It is possible to imagine attacks on military networks or critical infrastructure-like our transportation system and energy sector-that cause severe economic damage, physical destruction, or even loss of life.\"\r\n\r\nLast month, Russia called on NATO to track down the culprits behind a Stuxnet computer worm that targeted a Russian-built Iranian nuclear power plant, saying the incident could have triggered a new Chernobyl.\r\n\r\nSecure military networks will matter little if power grid cuts or other government systems are disabled by cyber attacks, according to Lynn.\r\n\r\nHe called for extending military computer defenses to privately held parts of the infrastructure key to the nation functioning.\r\n\r\n\"During a natural disaster, like a hurricane, military troops and helicopters are often used by FEMA to help deliver relief,\" Lynn said.\r\n\r\n\"In a similar vein, the military's cyber capabilities will be available to civilian leaders to help protect the networks that support government operations and critical infrastructure.\"\r\n\r\nPrivate operations that the government wants to guard include companies that supply defense department equipment, according to Alexander.\r\n\r\nHe argued that the military network's \"secure zone\" needed to be extended to all critical resources in partnerships with the private sector.\r\n\r\nAlexander maintained that national security agents and the computer wizards running company networks could work together without infringing on people's rights.\r\n\r\n\"I believe we have the talent to build cyber security that protects our civil liberties and privacy,\" he said. \"We can and must do both.\"\r\n\r\nAlexander added that the nation's security depended on the education of coming generations as well as today's software and hardware innovations.\r\n\r\n\"Our nation needs to push science, technology, engineering and mathematics,\" Alexander said. \"It is absolutely vital to our future.\"\r\n\r\nAs in past years at the annual RSA gathering, US defense officials called on computer security specialists to help them keep the nation safe.\r\n\r\n\"Securing our nation's networks is a team sport,\" Alexander said. \"We need your help.\"\r\n\r\nhttp://www.google.com/hostednews/afp/article/ALeqM5g2PNEhqFVvKQRnXzhi4iKZ7p12_g?docId=CNG.caf89b431a9c66f3e75cf5c8f5b2c68e.b1", "group_id": 3920, "id": 152967}]