[{"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309902455.0586481, "message": "Got a question about this being a decision story.\n\n** SPOILERS **\n\nYes, it begins with a dragon attack. But the decision to start the story is the vikings deciding to go look for the nest (I'm assuming).\n\nHiccup, though, makes a decision to fire his cannon because they are under attack. And the Action of bringing down the dragon leads his decision to go look for it.\n\nI've never really paid attention to this, but it seems like the OS is Decision, and Hiccup's is Action. (Even though only the OS driver even exists as a concept.)\n\nI'm just curious, because I've always heard that the Inciting Incident to this movie was \"Hiccup decides to make peace with the Dragons\". I'm watching it now, and that hasn't even happened, 30 minutes in...", "group_id": 2515, "id": 1570828}, {"user_id": 30287, "stars": [], "topic_id": 41218, "date_created": 1309915691.346873, "message": "I believe the Inciting Incident is Hiccup klutzily joining in the battle and causing havoc. Jim wrote a great article about it: http://storyfanatic.com/articles/story-structure/how-to-train-your-inciting-incident", "group_id": 2515, "id": 1572002}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309917676.378547, "message": "Yes the decision to look for the nest is forced by Hiccup's unintended destruction of Berk. The above link is one of three articles I wrote about the structure of the film (November of 2010). In addition, the podcast on the main site discusses the driver at length. Hiccup \"making peace\" is the first act turn. It is common for people to confuse this act turn with the Inciting Incident.", "group_id": 2515, "id": 1572156}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309924724.4807, "message": "I forgot you wrote all those articles. I skipped them, so I could see the movie cold.\n\nI really enjoyed it!", "group_id": 2515, "id": 1573012}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309925335.806705, "message": "I haven't read through the articles yet, but this is a failure story? I would have said the goal of finding the nest and undoing it was met... interesting...", "group_id": 2515, "id": 1573038}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309935917.319653, "message": "The key is figuring out who the Protagonist is. The podcast really helps to explain things (if my articles don't).  I'm glad you liked it -- I hear Dragons 2 is even better!", "group_id": 2515, "id": 1573794}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309970902.6105731, "message": "So, theoretical question. \n\nSay Stoick is the protagonist, and that his goal is to rid the area of dragons. His plan is \"find the nest, kill them all.\"\n\nBut, Hiccup finds the nest and drives the dragon away.\n\nStoick has failed, but the goal was reached via a different methodology.\n\nSuccess story? Or Failure?", "group_id": 2515, "id": 1576929}, {"user_id": 36437, "stars": [], "topic_id": 41218, "date_created": 1309974791.7625151, "message": "Thanks Jim :)", "group_id": 2515, "id": 1577650}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309974855.3792419, "message": "No problem - here's a link to an example of what that full-scale animatronic stuff will look like. http://www.youtube.com/watch?v=pN0c1QH7jI8 video from a visit we had at lunch one day", "group_id": 2515, "id": 1577662}, {"user_id": 37364, "stars": [], "topic_id": 41218, "date_created": 1309974285.0751891, "message": "Stoick's goal to destroy the dragons - or to protect his people? in which case surely it is successful? BTW there is a huge stadium -sized live version with full scale animatronic dragons and Soleil style Circus skills planned for next year. Will be interesting to see how closely they stick to the story...", "group_id": 2515, "id": 1577587}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309974729.4462881, "message": "Hey Bee - right here: http://www.dramatica.com/podcasts/index.htm", "group_id": 2515, "id": 1577640}, {"user_id": 36437, "stars": [], "topic_id": 41218, "date_created": 1309974450.5696349, "message": "delurking (hi guys) to ask where I can find the podcast...", "group_id": 2515, "id": 1577605}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309974022.539721, "message": "If Stoick's goal was to rid the area of dragons, then the goal was not achieved since they're now living with dragons.", "group_id": 2515, "id": 1577534}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309974028.013814, "message": "I don't think thats his goal though.", "group_id": 2515, "id": 1577535}, {"user_id": 33839, "stars": [], "topic_id": 41218, "date_created": 1309975345.4435329, "message": "I really enjoyed watching this after reading Jim's articles (like a good number of other movies, Animal Kingdom another example).  It's definitely a \"dynamic\" story and I can see where the inciting incident is confused with the first act turn (which I think happens with some of my own writing -- something I attribute to more complex stories).", "group_id": 2515, "id": 1577783}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309977416.754432, "message": "@jimhull Sorry, my question was theoretical and has nothing to do with the actual movie. It has to do with whether or not it's important that the protagonist fulfill his own goal.", "group_id": 2515, "id": 1578213}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309978332.8831401, "message": "If you're looking at the OS Outcome I suppose it's not as important that the Protagonist achieve the Story Goal himself (or herself) as it is that the Goal is achieved or not.", "group_id": 2515, "id": 1578363}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309978943.471205, "message": "Thanks.", "group_id": 2515, "id": 1578461}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309979004.51105, "message": "Onto the real movie, I wish I hadn't sent the disk back now that I need to figure out why the goal is training the next generation and not finding the nest.", "group_id": 2515, "id": 1578470}, {"user_id": 7645, "stars": [], "topic_id": 41218, "date_created": 1309979061.2840049, "message": "You can always go buy it. :)", "group_id": 2515, "id": 1578481}, {"user_id": 7664, "stars": [], "topic_id": 41218, "date_created": 1309979403.5466771, "message": "If it were skewed a little younger, I would totally buy it.", "group_id": 2515, "id": 1578537}]