[{"user_id": 29165, "stars": [], "topic_id": 19105, "date_created": 1302660053.0867679, "message": "Favorite Electronic Gizmo Source: SparkFun (www.sparkfun.com) Check this out. If you like electronic gadgetry or plan to build anything these guys have a great selection of goodies. And they add new stuff every Friday. Plus they have great Maker resources like how to solder little tiny surface mount parts, or how to use Eagle PCB software. I have ordered from here many times and had no issues. Everything is out their door in a day or less and is packed phenomenally. As a bonus they ship in these cool little red flip top boxes that you will not throw out and will use to store assorted goodies. Give them a try!", "group_id": 8728, "id": 654898}, {"user_id": 29165, "stars": [], "topic_id": 19105, "date_created": 1302659727.087405, "message": "Favorite Source for Nuts and Bolts: Small Parts (www.smallparts.com)This site has a great tool for zooming in on exactly the hardware you need. For example, you can select \"Plastic\", \"Nuts\", \"3\", etc and see all the choices. My experience ordering has been solid. Every order was correct, shipped fast, and parts were top quality. Check them our and buy bulk! A maker can never have too much hardware, but be warned, you must organize stuff in drawered bins, plastic tackle boxes, or even the cheapest and most portable: envelopes. Not the size you mail letters in, but small 3\" x 3\" manila type that cost like $6 for a hundred at Staples.", "group_id": 8728, "id": 654806}, {"user_id": 29165, "stars": [], "topic_id": 19105, "date_created": 1302660200.8969519, "message": "On SparkFun: I forgot to mention, each year in early Jan they have free day, where your whole order up to $100 is free. No strings attached, just free. I know of nobody else that does this.", "group_id": 8728, "id": 654927}, {"user_id": 29165, "stars": [], "topic_id": 19105, "date_created": 1302660636.710712, "message": "Favorite Big Boy Erector Set: 80/20 Inc. (www.8020.net) This stuff is ultra cool and versatile. If you look closely you will see it all the time on TV at places like MythBusters and in factories that Mike Rowe in Dirty Jobs visits. It is not cheap, but when building something that need to be straight, strong, and adjustable, this stuff cannot be beat. They have .pdf downloads of full catalogs and be sure to look at the \"Made with 80/20 Stuff\" on their downloads page. This showcases some really creative uses. 80/20 has an eBay store where you can buy like one three foot piece or two brackets (this is how I acquired some) so if you want to check it out, I'd recommend this route. The local rep is in this area once in a while and has a minivan with all the parts for show and tell. I will let this group know if I know of him coming to the area.", "group_id": 8728, "id": 655039}, {"user_id": 29251, "stars": [], "topic_id": 19105, "date_created": 1302736276.820359, "message": "Favorite Misc Source: American Science & Surplus (http://www.sciplus.com) I get test tubes, glass slides and bottles from them but they have much more than just science related items.  Have had no complaints to date about their service and the shipping has been reasonable.", "group_id": 8728, "id": 673536}, {"user_id": 28990, "stars": [], "topic_id": 19105, "date_created": 1302887822.245667, "message": "Quickly becoming a favorite: http://hacknmod.com/", "group_id": 8728, "id": 702905}]