[{"user_id": 7645, "stars": [], "topic_id": 34430, "date_created": 1304974437.770242, "message": "Some of Katy's analysis have the Steadfast character employing their Solution. I don't believe it can be seen as canon as Steadfast suggests the Solution isn't there. That being said, I'm sure there are moments when it can seem as if the Solution is in place or where the Solution diminishes the character's drive (Problem). The important thing is that their personal point-of-view remains unaltered.", "group_id": 2515, "id": 977770}, {"user_id": 7664, "stars": [], "topic_id": 34430, "date_created": 1304973857.2545559, "message": "On top of that, I was surprised to see that the UA was used to return the problem to equity. I didn't think that was the role of the UA. I thought the UA was what made the MC eligible to solve the problem, but they had to employ something else to do it (The solution in a change story, and ... maybe... the direction in a steadfast story).", "group_id": 2515, "id": 977577}, {"user_id": 7664, "stars": [], "topic_id": 34430, "date_created": 1304973712.8806081, "message": "Aware/Self-aware lead me to read http://www.dramatica.com/story/film_reviews/reviews/Scream.html, per Jim's suggestion. \n\nBut I found it odd that both the MC and the IC employ their solution:\n\n>>\nFinally aware (mc solution) enough to understand what really has been going on, Sidney and Gale join forces against the psycho killers and Sid is able to utilize her unique ability (interdiction)-successfully interfering with their best laid plans (outcome).\n\nSIDNEY: So Stu, what's your motive? Billy's got one (os signpost 4-understanding). The police are on their way (os solution-aware). What are you going to tell them?\n\nSTU: Peer pressure . . . I'm way too sensitive.\n\nSidney, angst resolved (mc judgment-good), unties her bound and gagged father (whom the boys-now mortally vanquished-had intended to frame) and Gale, steadfast (oc resolve) in her drive for celebrity, gets an exclusive breaking story (oc solution-knowledge).\n>>", "group_id": 2515, "id": 977538}, {"user_id": 7645, "stars": [], "topic_id": 34430, "date_created": 1304975681.972276, "message": "Yeah, I really enjoy her work because it comes off as a *super* version of the included examples. Often gives me another insight into how to use the theory to improve my own work.", "group_id": 2515, "id": 978054}, {"user_id": 7645, "stars": [], "topic_id": 34430, "date_created": 1304975004.5839429, "message": "In regards to the Unique Ability, I believe her conversational approach to analysis frequently blends items of the theory, appearing almost as if she is \"bending\" the rules. I've always felt this was a strength of her articles as it shows how Dramatica is not as compartmentalized as one would think. It's almost a holistic approach to the theory that the software has a hard time communicating.", "group_id": 2515, "id": 977905}, {"user_id": 7664, "stars": [], "topic_id": 34430, "date_created": 1304975735.112699, "message": "It makes the theory accessible, that's for sure.", "group_id": 2515, "id": 978063}, {"user_id": 7664, "stars": [], "topic_id": 34430, "date_created": 1304975610.716311, "message": "I certainly have a bias towards wanting everything to be very fixed, so these things throw me. But I see it as a strength of the theory too.", "group_id": 2515, "id": 978045}, {"user_id": 7645, "stars": [], "topic_id": 34430, "date_created": 1304975932.050585, "message": "An interesting thing, technically the theory definition says the Unique Ability describes the quality needed to meet the *Requirement*, not the Goal. http://www.dramatica.com/theory/d_dictionary/dictionary/u.htm", "group_id": 2515, "id": 978113}]