[{"user_id": 26653, "stars": [], "topic_id": 45278, "date_created": 1315960448.8356731, "message": "My understanding was that I could push jekyll code to giithub and it would do the generation of the site there rather than local generation. Is that not possible with octopress? Is it a function of the additions? What is diff in octopress that would stop a jekyll github pages pushed auto generate?", "group_id": 10576, "id": 2120638}, {"user_id": 26653, "stars": [], "topic_id": 45278, "date_created": 1315960242.157505, "message": "I spent Sunday moving over my large wordpress install over to octopress (7 years, 2000+ posts) and while I'm really lurving it, I'm noting that a rake generate takes quite a while to create the entire site before I rake deploy to github pages.", "group_id": 10576, "id": 2120617}, {"user_id": 26653, "stars": [], "topic_id": 45278, "date_created": 1315960178.1710899, "message": "Sorry, tried irc twice but no one was around yesterday or today (I'm in Aus so timezone issues).", "group_id": 10576, "id": 2120607}, {"user_id": 29081, "stars": [], "topic_id": 45278, "date_created": 1316003987.5284591, "message": "This is an issue I hope to resolve, but I haven't found a way around it yet. How long is the generation taking you?", "group_id": 10576, "id": 2124674}, {"user_id": 29081, "stars": [], "topic_id": 45278, "date_created": 1316003947.549474, "message": "@Daryl On Github Jekyll works in a safe mode. This means that certain types of plugins are unable to be loaded as a safety measure for Github's servers. This means that some of the plugins that ship with Octopress won't work if you tell Github to generate the site.", "group_id": 10576, "id": 2124671}, {"user_id": 26653, "stars": [], "topic_id": 45278, "date_created": 1316051584.7693081, "message": "@imathis Figured it was something like that. Can you specify which plugins don't load? (And gen is taking over 15 minutes. =<  - lovin Octopress though. Just need to fig out safe mode issue to get it working for me properly to do switch over.)", "group_id": 10576, "id": 2130731}, {"user_id": 26653, "stars": [], "topic_id": 45278, "date_created": 1316088635.161104, "message": "Ah, ok, after RTFM jekyll, I'm gathering *nothing* in the _plugins directory gets run on github pages then? So generation has to be done locally and then pushed? Hmmm... I'd really like to push updated articles to github and have generation happen somewhere so perhaps I need to be looking at a post-commit hook to generate on amazon EC2 or say heroku (imagining rack-jekyll can take advantage of varnish caching there?).", "group_id": 10576, "id": 2133365}]