[{"user_id": 11626, "stars": [], "topic_id": 7374, "date_created": 1298073464.4990079, "message": "http://www.channel3000.com/2011/0217/26906355_240X146.jpg\r\n\r\nMADISON, Wis. -- Madison public schools are closed again on Friday because too many teachers are taking the day off to protest Gov. Scott Walker's proposal to limit union bargaining.\r\n\r\nIt's the third consecutive day the Madison Metropolitan School District has canceled classes \"due to substantial concerns about staff absences.\"\r\n\r\nThe district said it has received reports Thursday evening that there will again be significant staff absences in the district on Friday in protest of the governor's proposed changes in labor law.\r\n\r\nThe district said the decision was made to cancel classes because administrators were concerned about a safe and secure school environment.\r\n\r\n\"We regret having to make this decision for the third consecutive day, but with the significant percentage of staff members expected to be absent on Friday, we can not assure the safety of all students. We realize this is difficult for families because it impacts family routines and schedules and we appreciate your flexibility during these difficult times,\" said Ken Syke, the district's spokesman, in a statement released on Thursday night.\r\n\r\nSyke said that all Madison Metropolitan School District staff is expected to work Friday.\r\n\r\nSuperintendent Dan Nerad said teachers who are taking a sick day will be asked to show proof of a medical reason.\r\n\r\nMany teachers in the Madison district spent Wednesday and Thursday at rallies at the Capitol in opposition to Walker's collective bargaining proposal.\r\n\r\nThe closings come after the leader of Wisconsin's largest teachers union said Wednesday she wants all state residents to join protests in Madison against the bill that would strip most public workers of almost all their collective bargaining rights.\r\n\r\nWisconsin Education Association Council President Mary Bell didn't explicitly call on teachers to skip classes during a news conference outside the state Capitol on Wednesday evening, but she did say that all Wisconsinites should look into their hearts and come to Madison on Thursday and Friday.\r\n\r\nThe governor introduced a bill last week that would restrict public workers' collective bargaining rights to salaries only. The measure has prompted a massive protest at the state Capitol that has gone for the last two days.\r\n\r\nStay tuned to WISC-TV and Channel 3000 for continuing coverage.\r\n\r\nhttp://www.channel3000.com/education/26907578/detail.html", "group_id": 3920, "id": 147610}]