[{"user_id": 22183, "stars": [], "topic_id": 36323, "date_created": 1306084476.7316761, "message": "Which one do you prefer and why?", "group_id": 97, "id": 1142856}, {"user_id": 4149, "stars": [{"date_created": 1306112750.594187, "user_id": 224}], "topic_id": 36323, "date_created": 1306087198.5202091, "message": "I love evernote, First off it is incredible easy to share and have people edit not auth at all just a link, Second evernote is just so powerful from just editing to clipping parts of sites to put inside of a note to organizing to syncing with my iphone, web, and mac app. The search is the best. it does have cons, one of the biggest cons is that the iphone app doesn't allow you to do rich editing so that sucks, also they limit amount of data, which for me that uses it only for notes have never ever hit but if you want video's or pics or audio you probably will hit it really quickly, but aside from that evernote you just can't go wrong with it", "group_id": 97, "id": 1143037}, {"user_id": 1364, "stars": [], "topic_id": 36323, "date_created": 1306084982.9427481, "message": "I've been using http://workflowy.com lately. Very simple and you can share with anyone via just a link. Doesn't run into the awful auth issues of google docs.", "group_id": 97, "id": 1142886}, {"user_id": 22183, "stars": [], "topic_id": 36323, "date_created": 1306123426.746989, "message": "I tried evernote before, the problem I had was that, I often like to attach a screenshot w/ a paragraph or two of notes / thoughts / captions.  I couldn't get that working at all.", "group_id": 97, "id": 1148160}, {"user_id": 17061, "stars": [{"date_created": 1306395890.790518, "user_id": 20249}], "topic_id": 36323, "date_created": 1306193425.6052229, "message": "I really like Google Notebook.  I still use it.  I think they should enable the browser plugins again", "group_id": 97, "id": 1158665}, {"user_id": 9108, "stars": [], "topic_id": 36323, "date_created": 1306282739.5935199, "message": "I previously just used locally stored notebooks with OneNote. Just this week decided to test out EverNote and I'm already hooked after only a couple of days. All of my OneNote files imported easily, and being able to link them to the cloud is nice in case I need to pull them up from a different computer. I still need to check out the BlackBerry app.\n\nInitially I was worried about the 60 MB sync limit per month with a free account, but given that my notes are pretty much always just text I don't think there will be any problems.", "group_id": 97, "id": 1172139}, {"user_id": 34196, "stars": [{"date_created": 1306288804.7381649, "user_id": 9108}], "topic_id": 36323, "date_created": 1306285468.8263249, "message": "Gotta go with the group on this. Evernote is the best I've seen so far. I'm constantly trying new things though.", "group_id": 97, "id": 1172452}, {"user_id": 17061, "stars": [], "topic_id": 36323, "date_created": 1306382338.4425211, "message": "My main problem with the free Evernote is that I need to use the iphone version on my ipod touch offline at work and it always complains and it's not obvious which notes I can view when offline", "group_id": 97, "id": 1187517}, {"user_id": 31563, "stars": [], "topic_id": 36323, "date_created": 1306841178.991925, "message": "Plain Text on the iPhone with Dropbox sync to the desktop.", "group_id": 97, "id": 1236871}, {"user_id": 24951, "stars": [], "topic_id": 36323, "date_created": 1306850148.9295709, "message": "i use ubernote.com its web based and supports migration from google notebook.", "group_id": 97, "id": 1237533}, {"user_id": 34772, "stars": [{"date_created": 1307145297.0286269, "user_id": 32223}], "topic_id": 36323, "date_created": 1306886597.6508999, "message": "I wrote a post on this exactly subject that comes up near the top of the Google results for \"Evernote vs. Springpad\": http://www.xconomy.com/national/2010/04/16/online-notebook-smackdown-evernote-vs-springpad/  My answer depends on whether you are more interested in just storing stuff (in which case Evernote is better) or doing stuff with what you store (Springpad).", "group_id": 97, "id": 1245028}, {"user_id": 34718, "stars": [], "topic_id": 36323, "date_created": 1306886752.459013, "message": "Evernote is great because it has more apps that integrate with it's API. Springpad will get these over time but for now Evernote, in my opinion, is the better choice.", "group_id": 97, "id": 1245044}, {"user_id": 6149, "stars": [], "topic_id": 36323, "date_created": 1307597892.751744, "message": "I would have to say that springpad has a a great UI but evernote makes everything so simple.", "group_id": 97, "id": 1346606}, {"user_id": 5431, "stars": [], "topic_id": 36323, "date_created": 1307623212.3119409, "message": "I was using spingpad but now I am testing evernote. They are both great!!!", "group_id": 97, "id": 1349327}, {"user_id": 38827, "stars": [], "topic_id": 36323, "date_created": 1311803342.065155, "message": "I can't stand Evernote's interface. I've tried it twice. Really used it for several months. Maybe I'm too right-brained or something. I love all the features and found Evernote very useful. I love Springpad (interface is much better) but it's just not quite there. Just can't capture info as easily - laggy capture tool from the browser - buggy log in which kicked me off even though I told it to remember my log in. I miss Google Notebook. Diigo is a really good annotation and bookmarking tool but really suffers from log in issues.", "group_id": 97, "id": 1734625}, {"user_id": 29698, "stars": [], "topic_id": 36323, "date_created": 1311904192.6476631, "message": "Evernote", "group_id": 97, "id": 1743868}, {"user_id": 40281, "stars": [], "topic_id": 36323, "date_created": 1314393497.5615439, "message": "Zukmo (http://www.zukmo.com) offers a pretty good information management product that's totally cloud based with unlimited free storage. It's growing pretty quickly as a product and even in its open alpha has notetaking, web clipping, bookmarking and RSS feed aggregation", "group_id": 97, "id": 1970677}, {"user_id": 4893, "stars": [], "topic_id": 36323, "date_created": 1315990281.463948, "message": "I love the combination of Evernote and Skitch. Together they have more or less replaced any other form of note-taking for me.", "group_id": 97, "id": 2123465}, {"user_id": 41557, "stars": [], "topic_id": 36323, "date_created": 1317096545.12356, "message": "Evernote!! Springpad has a cool concept, but it takes too long to jot something down. Simplenote is great if all you need is txt.", "group_id": 97, "id": 2222133}, {"user_id": 5431, "stars": [], "topic_id": 36323, "date_created": 1317126403.3519249, "message": "After testing Evernote this is the main application I now use. The clip article feature is great.", "group_id": 97, "id": 2224320}]