[{"user_id": 11626, "stars": [], "topic_id": 7219, "date_created": 1298019373.8226371, "message": "Hyperinflation is a devastating phenomenon. It wipes out the middle class by destroying the value of cash, savings, bonds and other paper instruments. But, how does it affect stock markets? With the Federal government just having added $5.2 trillion in Fannie/Freddie liabilities of which about $600 billion will likely default, the Federal Reserve having now polluted its balance sheet by some $700 billion worth of toxic mortgage bonds with a 41.6% default rate ($291 billion in likely defaults), an $85 billion bailout for AIG, and, now, the Administration asking for some $700 billion more to bail out financial firms, it seems clear that the winds of hyperinflation are upon us. What will be the comparative effect of hyperinflation upon index funds, like DIA, QQQ, and SPY, versus bonds and cash?\r\n\r\nHyperinflation is not a particularly uncommon episode in human history. It has occurred in the following countries in the following countries, in the last 150 years. Weimar Republic of Germany 1920 – 23 (1/466 billionth of starting value), Zimbabwe 2003 - Now (6 quadrillionth of the starting value and continuing to fall), Former Soviet Union 1993 – 2002 (1/14th of starting value), Argentina 1975 – 1983 (1/1,000th of starting value), Austria 1921 – 23 (about ¼ of starting value), Bolivia 1984 - 86 (1/1,000 of starting value); Bosnia-Herzegovina 1992 – 93 (1/100,000th of starting value), Brazil 1960 – 94 (1 trillionth of starting value), Chile 1971 – 73 (1/3rd of starting value), China 1947 – 55 (1/10,000th of starting value), Greece 1943 – 53 (1/50 trillionth of starting value), Hungary 1945 – 46 (100 quintillionth of the starting value), Hungary 1922 – 23 (1/4 of starting value), Israel 1976 – 86 (1/16th of starting value), Japan 1934 – 51 (1/362nd of starting value), Poland 1990 – 94 (1/10,000th of starting value), U.S.A. (Confederate States of America) 1861 – 65 (1/90th of starting value, and then, by the end of the Civil War, the Confederate Dollar depreciated to zero). It also happened in the ancient Roman Empire, when the silver and gold coinage of that day was progressively debased with base metals, in order to fund wars, giveaways to the Plebeians, and various other adventures. There are many additional examples that I have not bothered to cover here.\r\n\r\nThe most studied hyperinflation episode was the early 1920s, in the Weimar Republic of Germany. At the end of the First World War, the mark to dollar ratio was trading at 9:1. By July 1921 the ratio had risen to 77:1, and prices more than doubled again by January 1922, as the ratio of marks to the dollar climbed to 192:1. By the time that the Weimar government introduced the Rentenmark in November 1923, which replaced the deflated mark, the exchange rate had risen to 4.2 trillion marks to the dollar.\r\n\r\nGermany’s economic situation in the early 1920s, except for being a defeated combatant in World War I, is frighteningly similar to our own economic situation, today. We can trace the road to hyperinflation, step by step, and compare Germany’s path to the path that is now being travelled by the U.S. Germany abandoned the gold standard in 1914. America abandoned the gold standard, 60 years later, in 1974. Back in 1914, the German government did not expect World War I to last very long, and the war wasn’t properly budgeted, and, instead, it was financed by deficit spending. Similarly, in 2003, the Iraq War was not expected to last very long, and was financed by deficit spending. However, in comparison to the size of the German economy in 1914 and the U.S. economy in 2003, the Iraq War is a somewhat cheaper war.\r\n\r\nAfter WWI, Germany suffered a severe current account deficit, just like the current account deficit we now have in the USA. About 1/3rd of their deficit was generated by the need to pay gold to European allied governments as war “reparations”. But, the rest was due to economic mismanagement, and 2/3rd of the German current account deficit was composed of non-war related spending. Back then, other than for war reparations, America was Germany’s biggest creditor, with American financial institutions, particularly J.P. Morgan, Jr., arranging for consortium loans to the Weimar government, its businesses and industries. News accounts, from that time, indicate that the Weimar German government, like the American government now, was far more concerned with avoiding recession, lowering the unemployment rate, and stimulating business activity than it was about inflation.\r\n\r\nGerman economists in the 1920s thought, just as American economists think now, that a cheaper currency helps stimulate export activity and industrial production. Germany needed exports to buy raw materials, just as the U.S. needs them, now, to buy oil and Asian made consumer goods. Back then, however, the United States was a net creditor nation. It played that role in relation to Germany, similar to the role played by Asian nations, including China and Japan, toward the USA, except that, instead of exporting consumer goods, the 1920s USA exported mostly raw materials to Germany. United States financial firms, in the early 1920s had great faith in Germany, and were buying German government bonds, and supplying loans to facilitate purchase of American commodities. These loans offset the German trade imbalance, just as Chinese Treasury bill and bond buying now offsets the U.S. current account deficit.\r\n\r\nWhen financiers like JP Morgan, Jr., however, finally decided that Germany was no longer a good credit risk, they cut off funds. After that, everything fell apart very quickly. By 1923, you needed a trillion marks to buy one dollar. The German financial class managed, to some extent, to avoid some of the losses, by purchasing large quantities of gold and other hard assets. The German middle class, however, lost everything. This led to a deep resentment of Jews, who dominated the German financial industry, and, later, it gave birth to the Nazi movement and the murder of millions of innocent Jewish people.\r\n\r\nGerman Wholesale Price Index\r\n\r\nhttp://static.seekingalpha.com/uploads/2008/9/22/saupload_hyperinflation.jpg\r\n\r\nSource: http://www.usagold.com/GermanNightmare.html\r\n\r\nAll factories, houses and buildings were still standing, before, during and after 1920s German hyperinflation, just as they will be in 2011 America. Germany in the roaring 20’s was still a potentially rich nation, just as America will be in 2011. But, the stored work product of a generation, represented by the symbols of stored wealth, in the form of cash, savings, stocks, bonds and other paper instruments, became essentially worthless, almost overnight. The same may happen here.\r\n\r\nFor America, like 1920s Germany, the hyperinflationary trigger will not come from within the nation. It will come from outside. Eventually, China, Japan, and/or some other nation, will see the endlessly increasing American deficit spending as a threat to the viability of the U.S. dollar. In response, they will reduce their purchases of treasury bills. This will bring America to her knees. Indeed, there is already talk, in China, about the danger of keeping Chinese foreign reserves predominantly in the form of U.S. dollar denominated treasury bills and bonds. The Chinese are talking about diversifying away from the U.S. dollar. This will happen, eventually, no matter what we do. It is not a matter of “if”, but, rather, of when.\r\n\r\nThe joint mismanagement of the American economy by sequential administrations, both Democratic and Republican, have insured that we are now totally dependent upon the whims of the Asian governments. When it finally happens, dollar denominated paper will begin to lose value very quickly. The U.S.A., with a hollowed out economy, is no longer producing much of anything but agricultural products, some sophisticated technological products, a lot of internal services and housing. The need for imports, using a deflated dollar, will swing the country into a hyperinflationary downward spiral.\r\n\r\nIt will not happen overnight, but it will happen. The situation is so far advanced, at this point, that no matter what we do, there is probably no way around it. The new plan, from this Administration, to buy toxic mortgage instruments from the irresponsible financial firms who caused the credit crisis is not going to stop it, and may very well be the straw that breaks the “camel’s back.”\r\n\r\nAt minimum, the U.S. dollar will depreciate by the amount by which the Federal balance sheet is corrupted by the toxic mortgage paper. Most frightening is the prospect of giving Hank Paulson, the prior Chairman of Goldman Sachs, one of the key creators of the toxic mortgage instruments that have caused the credit crisis, unlimited discretion in doling out $700 billion in bailouts, without any possibility of judicial review. Doing that assures that the money is used in the most inefficient and nepotistic manner. It will bring us deeper into hyperinflation.\r\n\r\nWe can rationally expect that the US dollar will lose about 75% of its value, within 2-3 years. Cash in the form of government and/or corporate bonds, money in CDs and other bank accounts, will be hit the hardest. General index fund type of investments, such as DIA, SPY, QQQ, and the like will also be very bad investments. Stocks, in general, do not do well in a highly inflationary environment. However, if the Weimar experience is any guide, stocks will do much better than bonds or cash. Financial and retail stocks, however, will be the worst investments of all equities sectors. The best investments, in contrast, will be gold, silver, shares of companies whose assets consist of modern plant & equipment, productive lands, and other hard assets that will retain value.\r\n\r\nhttp://seekingalpha.com/article/96723-what-effect-will-hyperinflation-have", "group_id": 3063, "id": 140850}, {"user_id": 11626, "stars": [], "topic_id": 7219, "date_created": 1298019440.8557811, "message": "THE ABOVE ARTICLE WAS WRITTEN IN 2008 & THIS GUY NAILED IT. SCROLL DOWN HALFWAY TO SEE WHAT HE SAID WOULD HAPPEN IN 2011. PRETTY GOSH DARN ACCURATE.", "group_id": 3063, "id": 140856}]