[{"user_id": 13109, "stars": [], "topic_id": 6943, "date_created": 1297955185.85305, "message": "Has anyone else seen that with the quad the dynamic pair of Static/Internal (Fixed Attitude) is Static and External (Situation) and not Action and External (Activity) as would be expected from a normal matrix setup.  The bottom two (or top two) seem reversed to what you would expect.  Does anyone know the thinking behind this?", "group_id": 2515, "id": 132280}, {"user_id": 7669, "stars": [], "topic_id": 6943, "date_created": 1297962203.836453, "message": "The pattern goes like this:\n\nExternal State     |   External Process\n-------------------------------------------------\nInternal Process  |  Internal State\n\nSee it?  The \"State\" and \"Process\" pairs are dynamic (diagonal) to each other, while the \"Ext.\" & \"Int.\" pairs are companion (horizontal) to each other.", "group_id": 2515, "id": 133135}, {"user_id": 7645, "stars": [], "topic_id": 6943, "date_created": 1297963796.935622, "message": "What Sandy said", "group_id": 2515, "id": 133319}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297964724.0656321, "message": "Granted, you could say that \"well, one of them is going to share the internal or external quality\" to which I say, \"yup. don't know what to make of that.\"", "group_id": 2515, "id": 133465}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297964276.2130001, "message": "I don't think there is \"thinking\" behind it, in so much as Chris and Melanie were noticing things and organizing them, not creating something that worked.", "group_id": 2515, "id": 133380}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297964588.435396, "message": "I came to say what Sandy said in a slightly different way: By having the IC and MC in the same fixed or active state, then they will both be in a different state in the SS -- a combination of Fixed Attitude & Universe will meet in an SS that is active (psychology or physics). That means neither one will be \"at an advantage\".", "group_id": 2515, "id": 133438}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297970611.893507, "message": "Actually, the pattern is more complicated than that, particularly at the Variation and Element levels.  We imagined the relationships as they are mathematically, which was then reproduced on a napkin by mirroring the pattern left to right and top to bottom.", "group_id": 2515, "id": 134472}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297970908.6194041, "message": "So the patterns are not supposed to be all the same, though they do represent the same elements in similar relationship, though not the same relationship.", "group_id": 2515, "id": 134540}, {"user_id": 7645, "stars": [], "topic_id": 6943, "date_created": 1297971772.2575951, "message": "yes", "group_id": 2515, "id": 134861}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297970838.592427, "message": "For example the equation K / T = A * D when displayed in quad form looks like this:\n\nK | A\n-------\nD | T\n\nwhen mirrored left to right becomes A / = K * T:\n\nA | K\n-------\nT | D\n\nthen mirrored vertically becomes T / K = A * D:", "group_id": 2515, "id": 134522}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297970871.3566561, "message": "T | D\n------\nA | K\n\nand so on.", "group_id": 2515, "id": 134529}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297971017.5765071, "message": "Correct, though it is predominantly because the structural model is a K based system.  That is the bias we chose for it.", "group_id": 2515, "id": 134573}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297971307.0925541, "message": "That is why you'll tend to find K in the upper leftmost quadrant on any level, D on the lower leftmost quadrant, A on the upper rightmost quadrant, and T on the lower rightmost quadrant.", "group_id": 2515, "id": 134701}, {"user_id": 7645, "stars": [], "topic_id": 6943, "date_created": 1297970941.6153581, "message": "In other words K is not always upper left as you move down?", "group_id": 2515, "id": 134549}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1297971397.4347129, "message": "If you look at the element Knowledge in the Universe/Situation domain, it is the most \"K of K's\" position you'll find.  In other words, it is the most K Element in the most K Variations in the most K Type in the K Domain.", "group_id": 2515, "id": 134756}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297971125.4650271, "message": "*woosh*", "group_id": 2515, "id": 134623}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297971749.8216169, "message": "K = Knowledge, T= Thought, A = Abilty, D = Desire ? (or Mass, Energy, Space & Time)?", "group_id": 2515, "id": 134854}, {"user_id": 7664, "stars": [], "topic_id": 6943, "date_created": 1297971883.5842121, "message": "I'm going to stick with trying to figure out \"Benchmarks\"", "group_id": 2515, "id": 134903}, {"user_id": 13109, "stars": [], "topic_id": 6943, "date_created": 1298117698.0475249, "message": "Thanks all.  Just looking at the matrix though I was wondering why it didn't appear as the usual matrices you could expect:\n\nExt. State      Ext. Process\n_____________________\nInt. State       Int. Process\n\nSo the dynamic pair of Ext. State would be Int. Process. (i.e. both the Int/Ext and State/Process are opposite.", "group_id": 2515, "id": 149231}, {"user_id": 13109, "stars": [], "topic_id": 6943, "date_created": 1298118004.021513, "message": "As MikeDerk mentioned. it seems to work, but I was just wondering the theory behind it.  It seems as if the dynamic pair (the one provides the most dramatic feel is between the internal and external aspects of a problem.  e.g. if you were looking at putting the M.C. in Activity (Ext. Process).  I.C. would be put in Manipulation (Int. Process).  I am guessing that you would then be exploring the difference between the internal and external aspects of the process when you are exploring the differences between the M.C. and I.C. throughlines.\n\nDon't know if I am right, just something I notices with the matrix when I was trying to remember where everything was situated", "group_id": 2515, "id": 149233}, {"user_id": 10814, "stars": [], "topic_id": 6943, "date_created": 1298140482.4490211, "message": "The basic idea is that inequities grow from internal/external imbalances.  That is the primary difference between the MC and the IC.  The same is true of the objective OS throughline and the subjective relationship throughline.\n\nThis dichotomy between being different in terms of interior and exterior vs. the same as either state or process is the reason the \"You and I are just alike\" / \"We're nothing alike!\" conversation goes on between the MC and IC.  They are the same in one context (state OR process), but also different -- one's perspective is external, while the other's is internal.  This \"same but different\" relationship is one of the things that makes the IC have influence on the MC.", "group_id": 2515, "id": 150119}]