[{"user_id": 7664, "stars": [], "topic_id": 42641, "date_created": 1311611475.4059191, "message": "The way things are shaping up, my MC is also the Antagonist in the OS.\n\nThis puts the Unique Ability and the Critical Flaw into an interesting place, since the UA can be used to solve her own Problem and the OS Requirement.\n\nBut, being the Antagonist, she would do everything she can NOT to complete any steps leading up to the solution of the Goal.", "group_id": 2515, "id": 1716376}, {"user_id": 7645, "stars": [], "topic_id": 42641, "date_created": 1311612553.546694, "message": "I would say you can decide to do anything you want. I think the UA and CF are ways to connect the MC to the OS, i don't think there are any rules for how it is supposed to be used.", "group_id": 2515, "id": 1716526}, {"user_id": 7664, "stars": [], "topic_id": 42641, "date_created": 1311613019.4234929, "message": "okay", "group_id": 2515, "id": 1716573}, {"user_id": 7664, "stars": [], "topic_id": 42641, "date_created": 1311611641.2166331, "message": "I'm sure the answer is \"you can decide to do anything you want\" but I'm going to ask anyway:\n\nDoes this mean the MC can willfully NOT use her UA (as an OS character -- truth be told, this is a grey area for me, since there seems to be some overlap of the roles)?\n\nOr, does it mean that she cannot help but use her UA -- at least up to the point where the requirement has been filled?", "group_id": 2515, "id": 1716404}, {"user_id": 37586, "stars": [], "topic_id": 42641, "date_created": 1312324873.0876119, "message": "It would be interesting if impulsive responses were in there somehow where she could not help herself from using her UA.", "group_id": 2515, "id": 1779852}, {"user_id": 7664, "stars": [], "topic_id": 42641, "date_created": 1312421139.067065, "message": "Her personal goal and the protagonist's goal involve developing the same piece of technology, so there is no way for her to achieve her goal without assisting the protagonist. It becomes a game of chicken -- can she get what she wants before the protagonist, and then screw him over?", "group_id": 2515, "id": 1790110}, {"user_id": 38500, "stars": [], "topic_id": 42641, "date_created": 1312755941.8062651, "message": "You may want to think of your MC as a \"bad guy\" Protagonist instead of the Antagonist. This was common in Film Noir, e.g., \"Double Indemnity\".", "group_id": 2515, "id": 1816644}, {"user_id": 38500, "stars": [], "topic_id": 42641, "date_created": 1312756055.824204, "message": "I meant that only in terms of the storyform -- that your MC is the Antagonist can still be clear in the story telling, but structurally, if the MC is the \"bad guy\", that may be useful.", "group_id": 2515, "id": 1816661}, {"user_id": 7664, "stars": [], "topic_id": 42641, "date_created": 1312768629.828819, "message": "@PhillyJeff I have the advantage of being very clear what the inequity is that needs to be solved. I had initially not really considered this very thoughtfully, but eventually decided to pin it down -- and the answer surprised me. It's only a very thin sliver of the OS, a little bit like \"saving doc\" is the OS Goal in BTTF.\n\nAnyway, that precludes me from thinking of the MC as a \"bad guy\" protagonist -- although, I like your train of thought. It was only after I was able to look at all stories from the inequity first that I solved the problem of \"who is the antagonist?\" in a movie like Die Hard.", "group_id": 2515, "id": 1817674}]