[{"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1317585274.154691, "message": "Having trouble trying to deploy with rails 3.1. Has anyone else here succeeded in deploying yet?  I keep getting this error when I run \"cap deploy\"", "group_id": 4606, "id": 2262087}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1317585282.773515, "message": "You have already activated rake 0.8.7, but your Gemfile requires rake 0.9.2. Consider using bundle exec.\n", "group_id": 4606, "id": 2262090}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1317585524.8731079, "message": "I have tried so many hints and tricks I found using google searches and none of them seem to fix it.", "group_id": 4606, "id": 2262112}, {"user_id": 21842, "stars": [], "topic_id": 46018, "date_created": 1317587032.7761409, "message": "Have you tried using bundle exec?  Conversely you can uninstall the old version of the gem.  Use gem uninstall rake, and then select 0.8.7 to uninstall.", "group_id": 4606, "id": 2262240}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1317587112.2575951, "message": "How would I use bundle exec? I will try uninstalling the old version of the gem. Thanks.", "group_id": 4606, "id": 2262243}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1317643463.6248741, "message": "@ecoulthard Yeah, @benzittlau is right.  Anywhere you use \"rake\" (i.e. rake db:migrate), use \"bundle exec rake\" (i.e. bundle exec rake db:migrate).  This will use the version of rake that is specified in your app's Gemfile rather than the system-installed version of rake.", "group_id": 4606, "id": 2266520}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1317643515.1593461, "message": "@ecoulthard BTW, it has nothing to do with Rails 3.1.  It's just a coincidence that you didn't run into this until you started using 3.1.", "group_id": 4606, "id": 2266522}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1317643475.03985, "message": "@ecoulthard Read this article for more info:  http://yehudakatz.com/2011/05/30/gem-versioning-and-bundler-doing-it-right/", "group_id": 4606, "id": 2266521}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318791709.207808, "message": "Sorry, I didn't respond earlier. In the process of blindly trying anything to fix the problems, I installed ruby-1.9.2p290. This caused a lot of new things to break, which I spent part of the last 13 days fixing.  Now I am trying once again to deploy and kaboom. I fixed the rake problem by uninstalling rake 0.8.7 as benzittlau suggested. Then I got a similar error with rack from passenger after I deployed. I installed the latest version of rack and this went away. I got the site would load today but it displays the 500.html error page. I have exception notification but for some reason it doesn't send me the error message.  I'll let you guys know if I get things working. Thanks for your help. So far upgrading to 3.1 has taken me 3 weeks. :P", "group_id": 4606, "id": 2361925}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318793212.231369, "message": "I tried switching this flag (config.consider_all_requests_local) to true in production and redeploying. Now for some reason everything seems to be working. When I first access the app on development I get the error \"undefined method `page_cache_extension' for ActionController::Base:Class\". It goes away if I refresh the page. I wonder if the 2 problems are related.", "group_id": 4606, "id": 2362099}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318828233.747695, "message": "Well I got it mostly working except now it wont use ruby-1.9.2p290 in production. I type in RUBY_VERSION in rails console production and I get ruby 1.8.7 even though the command ruby -v gives ruby-1.9.2p290. Not having the recent version is causing some things to break. Sometimes I really wish I had a fellow rubyist here to help me out. :(", "group_id": 4606, "id": 2366479}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1318853607.092623, "message": "@ecoulthard Definitely sounds like you need some help.  Troubleshooting deployments and server environments is tough without a lot of info.  Are you using a VM that you can build from scratch?  It might be best to start over.", "group_id": 4606, "id": 2367699}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1318853684.479923, "message": "@ecoulthard If you start over then I can probably help you through things step by step.  I haven't used Passenger before (I've been going with nginx & unicorn lately) but it shouldn't be too bad to figure out.", "group_id": 4606, "id": 2367704}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318859095.9630699, "message": "I am running a VPS with dreamhost. I can restore the machine to default settings but this would just restore it to the default version of rails, ruby and passenger that dreamhost provides. I'm not sure how to start from scratch completely. Remove all ruby and rails files and reinstall? I managed to get rails console production to use the latest version of ruby but I am getting inconsistent behavior on some pages in production compared to development. I have a shared machine running mysql that I hope wouldn't be affected by starting over.", "group_id": 4606, "id": 2368092}, {"user_id": 33175, "stars": [], "topic_id": 46018, "date_created": 1318911439.8016729, "message": "Try looking at you nginx or apache config file and see what version of Ruby it's trying to load. Could be trying to load an older version.", "group_id": 4606, "id": 2373922}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1318938212.7895119, "message": "@ecoulthard Did you try what @rafaldyrda suggested?  It could be a passenger issue.  I don't have any experience with passenger so you should probably start with his tip.", "group_id": 4606, "id": 2375330}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318954231.125289, "message": "I'll try it later tonight. Thanks guys. I got it to use the correct ruby version on rails console production but I am still getting the inconsistent behavior using the production console versus the development console. I wonder if some of the gems are older versions. Not sure what else it could be.", "group_id": 4606, "id": 2377080}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1318956537.9111149, "message": "@rafaldyrda Thanks. I'll try that as well. On the plus side when I updated ruby it complained about sections that contained bugs which I didn't know about.", "group_id": 4606, "id": 2377420}, {"user_id": 33175, "stars": [], "topic_id": 46018, "date_created": 1318956154.544065, "message": "also do a command: which ruby It will tell you where your ruby is installed. Updating can be a total nightmare,", "group_id": 4606, "id": 2377387}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1319004351.056138, "message": "Thanks for your help guys. I changed the version being loaded by apache and it seems to have worked. :) The only thing that isn't working right now that I know of is galleria, but that is probably because I have it in the wrong directory for the asset pipeline system. Galleria is a jquery photo album. I'll tackle that tomorrow, its time for bed now.", "group_id": 4606, "id": 2383148}, {"user_id": 33175, "stars": [], "topic_id": 46018, "date_created": 1319059039.2289519, "message": "@ecoulthard what are you working on? I used galleria in a site, pretty cool plugin :)", "group_id": 4606, "id": 2387179}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1319084034.5330701, "message": "The site is http://summitsearch.org. It is a mountaineering community site. My hobby is mountain climbing and taking photos of my adventures. The site is a cross between an encyclopedia and a trip report, photo album site. It has a page for each mountain in Western Canada + Alaska and the North West States. It also has pages for various other mountain landmarks like lakes, glaciers, waterfalls ... etc. When a photo is submitted it adds a thumbnail link to that photo on the page of each mountain mentioned in the photo. It applies various rules to determine whether a mountain mentioned in the photo is actually in the photo.", "group_id": 4606, "id": 2389882}, {"user_id": 27260, "stars": [], "topic_id": 46018, "date_created": 1319086215.84319, "message": "Woohoo. Just got Galleria fixed. I cheated and put it in public/javascripts/. Galleria doesn't like its files being moved around and it is too much of a hassle to change it to work in the pipeline. Plus if I leave it in public/javascripts then it is easy to update if I decide to do so in the future.", "group_id": 4606, "id": 2390057}, {"user_id": 14826, "stars": [], "topic_id": 46018, "date_created": 1319115262.544944, "message": "@ecoulthard Good to hear you got it working!", "group_id": 4606, "id": 2391464}, {"user_id": 33175, "stars": [], "topic_id": 46018, "date_created": 1319123195.0900731, "message": "Sounds like an interesting project. Good luck :)", "group_id": 4606, "id": 2392332}]