[{"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305916299.1471739, "message": "Yes, sorry, I forgot to say that it was chosen specifically because there was a existing analysis / storyform for. I won't be looking at that until we have all got to the point of end fizzling....", "group_id": 2515, "id": 1128878}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305915525.919769, "message": "Myself and MikeDerk have chosen this. Anyone else interested, chip / chime in. Lets do it! Storyforming, arguing, debating, checking, re-doing (and that's just what happens in my head).", "group_id": 2515, "id": 1128708}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1305915639.8680749, "message": "Yeah, but http://www.dramatica.com/story/storyforms/.../groundhogday_storyform.pdf", "group_id": 2515, "id": 1128728}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305915716.5215199, "message": "Yes, but don't look at that. We picked a movie that wouldn't end in a fizzle, like District 9 did.", "group_id": 2515, "id": 1128742}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305968694.9013, "message": "So, starting with the simple (I hope!) bits..........    MC: Phil      IC: Rita \n\nDomains, well, I see either MC or OS domain as Situation.  MC because he is placed in a situation he can't get out of (repeating day), or OS situation because they all are repeating. However, I'd lean towards MC: Situation because he is the only one that is affected by it.\n\nIn which case, the MC Concern could be Progress (he is working out how to deal with the repeating day).\n\nI'll stop there in case you don't agree / I'm wrong on the domains.", "group_id": 2515, "id": 1133326}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305968868.2391629, "message": "Could I also ask (I think MikeDerk will agree) that we leave out of this thread elements from the existing Dramatica storyform. The plan is that we do it ourselves, then compare at the end.", "group_id": 2515, "id": 1133329}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1305987450.2985361, "message": "No problem. I think I'll skip this one because of my involvement with the first. Good luck!", "group_id": 2515, "id": 1134085}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305996083.4637699, "message": "The way he takes advantage of the repetition is \"how can I take advantage of the way things are\" -- that's Present.", "group_id": 2515, "id": 1134977}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305995086.215158, "message": "Here's my initial breakdown:\n\n4 Throughlines:\n1. Phil is stuck in the same day\n2. Relationship with Rita & Phil\n3. Town is celebrating Punxatawney Phil coming out\n4. Rita (who must be the IC)... is sunny about everything?\n\nI think Phil is definitely situation for the same reason you said -- only he is stuck in the repeating day. Nobody else is even aware of it, therefore it's not causing problems for them.", "group_id": 2515, "id": 1134904}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305996026.330168, "message": "I think we should ignore the fact that time is repeating as far as choosing the concern - I think the story time still moves forwards. Time is still moving for the MC.", "group_id": 2515, "id": 1134970}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305996030.5219519, "message": "Two things.\n\n1. Phil doesn't seem to have a real goal. He's not striving to \"get out\" of today. When he finally does, the story ends, but it's not per se a \"goal.\"\n2. The only thing I feel confident ruling out is \"The Past.\"", "group_id": 2515, "id": 1134972}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305995964.596122, "message": "Now I'm not sure about MC concern of Progress either.  At the start, I think he is focused on the present, not wanting to repeat the day. However, the main thing seems to be his development when he realises he can use this; first to get Rita in bed, then to better himself. So I would now say the concern is the Future - he is working towards and focused on something that will happen later (even though that later is the repeated day).", "group_id": 2515, "id": 1134964}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305995135.6919889, "message": "@Jim,   well, if you were involved in the first then your input after we've come to some conclusions could be extremely valuable. For me, the really interesting bit will be once we have agreed or discussed a storyform and how that compares to the original.", "group_id": 2515, "id": 1134908}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305995630.9265201, "message": "Phil's Concern: \nHe does try to figure out how to fill his day, but we don't see him actually too worried about that. I think the only thing on his mind is \"Am I going to hear Dylan when I wake up?\" ie. Is it still the Present?\n\nBut, you do bring up a good point I'll get to in a bit.", "group_id": 2515, "id": 1134942}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305995572.2422731, "message": "@Mike   Yes, that looks good to me. I agree MC domain: situation.  \n\nBased on your list and the Rita / Phil relationship, I'd say the OS domain is Activity. This leaves M/I Domain as Manipulation and IC domain as Fixed Attitude.\n\nM/I domain makes sense to me. They both change the nature to fit with the other (MC becomes more compassionate, IC more open-minded).\n\nOS Domain as activity also makes sense. The activity being the celebrating..", "group_id": 2515, "id": 1134940}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305996110.804215, "message": "FYI, I can't really do too much of this today. I'll be spotty all weekend.", "group_id": 2515, "id": 1134981}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305996156.258707, "message": "I'm not sure - I mean to take advantage of it, that happens in his future.\n\nTo put another way, he seems to me to in fact be giving up the present for the sake of a better future (his future).", "group_id": 2515, "id": 1134983}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000999.7737801, "message": "At least, that's how I see it. Not as confident with this as I maybe am sounding.............", "group_id": 2515, "id": 1135411}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305998209.172965, "message": "I don't like looking at other threads, because I worry we come back and justify a choice we couldn't really figure out. It breeds laziness....", "group_id": 2515, "id": 1135179}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305996521.913784, "message": "But he never gets to \"keep\" his future. It's stolen from him every day. He's like Sisyphus. \n\nBesides, he's not preparing for the next day -- he says at the beginning that he's moving, getting a new job, etc. He doesn't spend his time researching things that will help that eventuality (like learning about NY). He focuses on what's right there.", "group_id": 2515, "id": 1135022}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305997008.1992781, "message": "I think he does start preparing for the next day - knowing the next day will be the same day. So to him that is the future (whether or not it is his Concern). I think he gives on the next day being anything else.", "group_id": 2515, "id": 1135067}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305997026.2097969, "message": "Still, I agree definitely not 'the Past'", "group_id": 2515, "id": 1135069}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305998316.958343, "message": "I like the theory being something we prove, not a crutch, basically.", "group_id": 2515, "id": 1135184}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305998134.4490321, "message": "Later in the film...... I'm not sure. He seems content with things and wants to improve his situation / himself. The other way to approach this is to look at the OS concern (assuming we follow the Dram principal of one affecting the choice of the other).", "group_id": 2515, "id": 1135174}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305998810.5169339, "message": "I just had a look with Dramatica.  As well as Concern, in the same elements we have Benchmark. Now, for me, I could see Benchmark as being Progress.", "group_id": 2515, "id": 1135229}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305998039.543149, "message": "But, what matters more to him? Waking on up on the same day or being prepared for the next day?", "group_id": 2515, "id": 1135171}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305998153.5018311, "message": "This is where I tend to break down -- I can see 1. He's stuck in the Present. 2. He spends his time getting better at things (Progress) 3. What he wants more than anything is tomorrow (Future). So which is it?\n\nLikewise, in the (presumed) OS: Are they doing the festival? Or Learning what Punxatawney Phil is going to say?", "group_id": 2515, "id": 1135175}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305998687.3191271, "message": "I agree with that breakdown, although as we are talking about the MC only, the future is also the following day for him (even if everyone else is living the same day)\n\nFor number 2, I guess for me it leads to a question 'Why is he trying to get better at things?' and the answers I think would be 'Because he wants something from the next repeated day'. And surely that is still his future. His time is not repeating, everyone else's is.\n\nFor me, that could be a #4 on your list - What he wants from the next repeated day (Future). ", "group_id": 2515, "id": 1135214}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1305998824.0039001, "message": "Assuming I understand Benchmark...........................", "group_id": 2515, "id": 1135231}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305999308.654506, "message": "He does all these things to cope with his situation. And, maybe, if the movie ended and the situation hadn't changed (he was going to be in Feb 2 for eternity) then we'd look at coping as his \"goal\". \n\nBut, since the movie ends when his situation ends, I think his \"goal\" needs to be the thing that unlocks his situation and un-sticks it. What causes that??", "group_id": 2515, "id": 1135304}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000563.370446, "message": "I suppose what I'm asking is, does the MC story change because time repeats? What if he was stuck in the town and couldn't leave (for other reasons), with time moving normally. He might still lead the same path of development.", "group_id": 2515, "id": 1135376}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305999216.3163929, "message": "We have an omnipotent view, right? So maybe what he wants isn't that relevant.\n\nBecause, despite learning the piano, despite learning how to get Rita into his bedroom (if not his bed)... nothing changes -- meaning, the situation doesn't change. He's still stuck in the present, even if it's a \"better\" present.", "group_id": 2515, "id": 1135298}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000386.8138511, "message": "yes, he definitely stops being selfish..... so that is a change..... he has / develops a drive to learn things to help people. \n\nGoing back a few posts, I actually not sure about this bit (from 2 posts up):  'meaning, the situation doesn't change. He's still stuck in the present, even if it's a \"better\" present.'\n\nI still think this aspect is more complex. It is not his present, it is his future. Each day, even though repeated for everyone else, is another step in his personal future. In other words, I don't think the MC concern should be affected by the fact time is messed with. His development continues. He does not re-start his own development every day.\n\nFor OS matters, I think the repeating time is a factor, but I'm not sure it should be an MC factor.", "group_id": 2515, "id": 1135367}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306000827.7907059, "message": "Okay, but what breaks him out of his situation? Does he figure something out about the future that finally makes it all move?", "group_id": 2515, "id": 1135396}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000917.8005099, "message": "Good question. His situation seems to end once he has lived the day to the best of his ability.", "group_id": 2515, "id": 1135403}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1305999791.2178509, "message": "I think what I'm saying is this: does the concern come from the character or from the writer? I think it's the writer.\n\nThe whole point of an Optionlock (exploring different options), or Playtime (or whatever STC says) or exploring different rooms in a house (Ursula Le Guin's take) is that the character gets to try out different things, different concerns, different attempts, on their way to solving the goal. \n\nAs much as we are saying \"progress\", we could be saying, \"Understanding\" (he wants Rita to understand what's going on). But understanding doesn't let him get out of the situation. And, hey, doesn't he stop learning stuff after a while? He's done learning the piano, and then he turns his attention to helping people: the kid in the tree, the old man who dies... he becomes very empathetic. After that point, he doesn't pick up any new skill. (Maybe he picks up \"being a doctor\" but it's to help others, not to learn an instrument to bed Rita -- he stops being selfish about things.)", "group_id": 2515, "id": 1135331}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306000222.263289, "message": "At some point, that shift from selfish to concerned should be represented in the storyform. \n\nIn fact, it's Rita's discovery of his selflessness (all the good things he's done) that bring her to his room. And that's a selfish 'project' he's given up to the point where he's not even telling her any of the good things.", "group_id": 2515, "id": 1135355}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306000569.594331, "message": "Hmmmm... I just don't think you drive yourself (and a rodent) into a quarry because you're happily moving forward into your future. I think you do it because you're not.", "group_id": 2515, "id": 1135378}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000719.2976761, "message": "Agreed. But is that because the day is repeating or because he has reached a point? He could have reached that point (as many do) without the day repeating.\n\nWhen he is talking to the drunks in the bowling alley, Phil says something like \"Can you imagine living the same day again and again, where nothing you do matters\".  One of the drunks replies \"Yep, that just about sums it up for me\".", "group_id": 2515, "id": 1135386}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000971.6835351, "message": "And he does that by focusing on what he can learn each day to help him with the next one (for example, trying to learn how to save the old man's life the next time).", "group_id": 2515, "id": 1135408}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306001974.6575999, "message": "Is it Rita, or himself that 'finds out' he has lived such a selfless day?  Also, it's not just selfless though. I would say also a very productive one (for him also). For example, playing piano in the band. But in principal, yes, that seems to be why the repeating day ends.", "group_id": 2515, "id": 1135508}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306000841.7744629, "message": "So that suggested to me that his development was incited by the repeating day, but the way he develops is not just because of the repeating day, but due to how he changes in himself. He seems to decide he can be a better person. If, for example, the film ended three quarters of the way through, I get the impression his development would still continue in a similar way.", "group_id": 2515, "id": 1135398}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306001347.81179, "message": "I think the day ends when Rita finds out that he has lived such a selfless day.", "group_id": 2515, "id": 1135451}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306001502.5455079, "message": "Anyway, I think you've managed to push \"progress\" off the table. I wonder if Learning is going to be the Requirement.", "group_id": 2515, "id": 1135458}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306002644.614502, "message": "I think he transitions to a selfless guy when he finds the old man dying in the alley. After that, he knows he's been selfless.", "group_id": 2515, "id": 1135569}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306003011.660641, "message": "Yes, and when he had tried everything to save the man but couldn't, I think he realised he had achieved the maximum. the day possible also ended because he had got the maximum from it.", "group_id": 2515, "id": 1135603}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306003313.0112751, "message": "True. I'm going to have to sign off, but I did one last thing. I looked at the quad under future and the quad under Present.\n\nThe Future doesn't seem to fit at all. But The Present does. (So does The Past.)", "group_id": 2515, "id": 1135642}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306003083.127836, "message": "Exactly how this relates to the concern, I'm not sure. \"\n\nby the way, I don't think there is anything wrong with looking at a different thread, to determine another one. I think, in the end, dramatica will never be perfect for all of them, so I think there will always be some compromise (or apparent compromise) when doing this.", "group_id": 2515, "id": 1135616}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306003122.120028, "message": "Still Mc in this story is a good place to start as most time is spent on him.", "group_id": 2515, "id": 1135622}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306004342.299964, "message": "And perhaps we should re-include Past...... the Dramatica definition includes this  \"a reevaluation of the meaning of what has occurred\".   I'm not sure I can confidently discount that now.", "group_id": 2515, "id": 1135745}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306004169.17694, "message": "Interesting....... I will look at the quads as well. That could help clarify for sure.", "group_id": 2515, "id": 1135711}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306006113.9514251, "message": "Does he ever question why this is happening to him or what it means? I don't recall that. (Not to say \"The Past\" is out.)", "group_id": 2515, "id": 1136080}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306007783.786829, "message": "He says to Rita that he thinks he is a God, but that seems more down to confusion. Then again, his actions - changing how he approaches the day, suggest he re-evaluates his position within it (so the meaning of it to him).\\", "group_id": 2515, "id": 1136279}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306021837.1637261, "message": "Can I make a small suggestion? If you start out with the big stuff first, it will be WAAAY easier to nail down the details. In the User Group meetings, we start with the 4 throughlines (just their subject matter, no domains etc.) then we go to the 4 MC questions then the 4 Story questions and THEN we start working on the Domains. The only reason I bring this up is because this reminds me of the District 9 thread where I believe it got way too detailed before the big chunks were agreed upon. Just my 2 cents, carry on!", "group_id": 2515, "id": 1138749}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306025207.4467449, "message": "Sounds like a good approach. I think for me I'm  1) not sure always about the terminology and its meaning in story   2) how I should apply it to the story (for example, how directly). \n\nFor #2, I'm going to start a new topic.", "group_id": 2515, "id": 1139039}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306026240.6942091, "message": "Driver: Actions force decisions (action of waking up on same day  = decide what to do that day, among other things)", "group_id": 2515, "id": 1139115}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306026041.9660611, "message": "Sorry, haha, I think you're right. Here's what I think:", "group_id": 2515, "id": 1139102}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306026205.3783591, "message": "MC: Change (he starts caring about other people)\nOS: Physics (Groundhog day... very light)\nMC: Situation (Repeat Day)\nIC: Mind (Sunny :))\nSS: Psychology (manipulating Rita into loving him)\n\nOptionlock (when he gets the day right, he will graduate to tomorrow)\nSuccess: (have no idea what though)\nGood: (\"Let's live here!\" = author's proof)", "group_id": 2515, "id": 1139112}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306029136.9261, "message": "Did you watch the movie again? I have a feeling the \"goal\" is set in the car on the way out. Andie McDowell refers to the town as quaint, and Phil is derisive. I have a feeling he has to overcome that to succeed. Would have to watch it again to get the specifics.", "group_id": 2515, "id": 1139234}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306060582.6107559, "message": "So, to end this run of posts, to let someone else speak........ the main thing to meet Jim's criteria (which makes a lot of sense to me), is to match the 4 throughline descriptions (assuming we agree on them) to the domains you've stated. ", "group_id": 2515, "id": 1140852}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306060048.053055, "message": "Yes, I watched it again. Yes, he certainly needs to change his attitude. I think there's also something about realising potential here as well, or being true to yourself. \n\nI think your selections above look pretty good. I'd go with that. I'm going to give Jim's approach a bash as well. You already started that way, of course. \n\nSo, here's you earlier list of the 4 throughline descriptions, with some comments:\n\n1. Phil is stuck in the same day \nHe gradually comes to see the positives of this rather than the negatives, initially trying to manipulate Rita into bed, but ultimately puts this to better use - helping people\n\n2. Relationship with Rita & Phil\nStarting with her innocence to his manipulating, moving towards her being a reason for his change and him seeing the better person in himself. In the last part of the film, he is not manipulating her at all. In the end, it works because he is honest.\n\n3. Town is celebrating Punxatawney Phil coming out\nThe OS characters - Phil, Larry, Rita, Ned, Old Man, Drunks, Mayor, Nancy. I'm not sure about this one. Only Rita, Mayor and Nancy seem to be concerned with the celebration. The rest of the 'happy' characters we hardly see. Perhaps we should be looking for something else that concerns them all. \n\n4. Rita (who must be the IC)... is sunny about everything?\nShe possibly seems to be missing something in her life as well, but something more pure (love?), although seems content with her role. I would say her honesty and openness are the main reasons for her ultimately positive effect on Phil.", "group_id": 2515, "id": 1140778}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306060256.242449, "message": "Re. the 4 MC questions..... \n\nMC Resolve: Change (as you said)\nMC Growth:  Stop?  (losing his selfishness?)\nMC Approach:  Do-er  (he just keeps trying things till they work)\nMC Problem-Solving:  Logical  (same as above really..... he doesn't analyse his situation too much - why me?, etc - he looks more at what it means to him now and how he can use it)", "group_id": 2515, "id": 1140800}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306060397.6175759, "message": "Re. the 4 Story questions.... you've covered those and I would agree with what you've said and why. For Success - he becomes a better person, he makes the most of himself in the situation.", "group_id": 2515, "id": 1140828}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306122030.3820729, "message": "I just watched the beginning of the movie again. I think Stop is going to be Stop being a primadonna. But, more importantly, he says to Rita, \"I think the producer's most important job is to keep the talent happy.\" What finally happens in the movie is he makes himself happy, and if I'm not mistaken, it's the last thing he says to Rita the night before the spell breaks. \"If nothing else, I'm happy right now.\" \n\nWhat's so aggravating about that though is that ... I'm not sure that's a goal he's striving for. He does many things, but he never sets out to make himself happy, although it is where he ends up.", "group_id": 2515, "id": 1147990}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306124200.0854239, "message": "I'm also totally baffled about what the OS Goal is. There just seems to be so little time spent there.", "group_id": 2515, "id": 1148246}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306134454.1675811, "message": "Right, yes, stop being a primadonna and ending up happy.", "group_id": 2515, "id": 1149461}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306135061.298733, "message": "Re. OS Goal, I guess the only overall link I can see right now is one of finding love, or finding oneself........ I don't think that's the best way of explaining what I mean.... here are the characters, and what I think they seem to need/want:\n\nNancy: the affections of a man\nNed: a friend / success in his job / belief in himself\nDrunks: a more interesting life\nLarry: a girl / a relationship\nRita: Love / a relationship\nPhil: finding something more than he has / more success\n\nNow I look back at that list, it is a list of wants / needs. I think it's interesting that not one character seems to start the film happy with what they've got (Rita looks happy, but we seem to be told she needs to be loved).\n\nI'm not sure how much of that was actually directly stated, but I think it came through in the characters to some degree, and with Dramatica being the authors view, I think that can be a part of it.", "group_id": 2515, "id": 1149557}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306167913.105623, "message": "Why do you limit the repeating day to just Phil's problem?  Why isn't everybody reliving the same day, with Phil in the unique position of being aware of the repitition?  How do the answers to these questions support your current domain choices?", "group_id": 2515, "id": 1154285}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306167798.5781939, "message": "RE: \"For Success - he becomes a better person, he makes the most of himself in the situation.\"\n\nThat sounds more like a Judgment of Good than an Outcome of Success.  The question is does \"he\" refer to the news anchor (OS) or Phil (MC)?", "group_id": 2515, "id": 1154275}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306171215.460578, "message": "Re. the repeating day, I felt it didn't impact on everybody because they didn't know about it. By then end of the film, none of what happened has any effect on them, other than seeing a much improved news anchor.....", "group_id": 2515, "id": 1154754}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306171051.2224751, "message": "Well.......  the 'he' (I see I was mixing the OS character and the MC) I guess is the news anchor (OS). Actually, I'm having trouble differentiating the two, or more exactly, placing these issues on one or the other. \n\nThe  concerns for the MC, I think, takes us on a journey from a synical view of the celebration, to a distressed / no hope view with the repeating days, and then the view of hope when Phil realises how to best use the repetition.\n\nFor the OS news anchor character, we see, I think, someone not enjoying his job, needing more in his life, not putting anything into what his doing, who then turns things around due to seeing a better way of dealing with things.\n\nI'm not sure if I've just said the same thing twice........,", "group_id": 2515, "id": 1154726}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306172765.5813799, "message": "Anyway, without being able to pin down the OS Goal, I'm going to have to withdraw my \"Success\". It feels that way, but until I can support it.\n\nI mean, what if Phil is the protagonist and he wants out. Well, he fails at that.", "group_id": 2515, "id": 1154940}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306171509.277662, "message": "I may be going off on a weird limb here, but... have you ever acted? The only way to be a good actor (in my opinion) is to be in the moment. This is remarkably similar to what Buddhists say, and The Power of Now, and Eckhart Tolle. And we never have to deal with the exact same thing repeating for thousands upon thousands of times. \n\nWe even get a glimpse of MC Phil \"pretending\" to be genuine when he is laughing maniacally with the kids in the snowball fight. It sends him down the wrong path. Then he kind of gives up trying to plan everything, which to me is a turning point.\n\nAnd, if I'm right, then his concern can only be The Present, because he's finally open to the Now.", "group_id": 2515, "id": 1154798}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306172070.257935, "message": "So... too support my domain choices.\n\nI limit the repeating day to Phil because it only causes him problems. Nobody else alters their behavior, so any problems they may have are independent of the Situation of the repeating day.\n\nThis forces the IC into Mind. Now, Rita doesn't seem to have any problems that affect her, but her sunny nature is a problem for Phil -- it absolutely rubs him the wrong way. (\"She's fun, but not my kind of fun.\") \n\nIf I run with my argument for \"The Present\" above, this forces her into The Conscious. And Phil does change in how to comes to conclusions about things. It's not a preconscious reaction to the town... it's three previous trips that made him hate it, and 10,000 repetitions that (after that one good night's sleep) he says \"Let's live here!\"", "group_id": 2515, "id": 1154859}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306172579.63679, "message": "So... the OS goal. I still don't know. I disagree with @mikeaja on about every count! \n\nI don't think Ned needs success. He has it. He's a weirdo, but he's doing fine. Nancy seems to be a tool to demonstrate what Phil's initial instinct is to do with his repeated time. The drunks seem to be there to make a thematic statement, and to tie us into Phil's emotional line. But... do they have a goal? Nah.\n\nI can't even figure out who the Protagonist is. Phil wants out, of everything. Out of PA. Out of this crap job. Out of the fleabag hotel. So, can he be pursue?\n\nPunxatawney Phil seems to be the thing that brings everyone together. Could it be him? (Concern: Learning ... about the shadow?)", "group_id": 2515, "id": 1154919}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306173514.5004549, "message": "Unless, referring back to Chris's comments, and possibly you've said this already, that the Goal is simply 'getting through the day'. Sometimes that is my Goal!!", "group_id": 2515, "id": 1155040}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306174211.8386681, "message": "I think I am also seeing Chris's comment much clearer - I think I was getting too involved in my vision of the world, rather than the story.", "group_id": 2515, "id": 1155121}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306173444.4196041, "message": "I had a post earlier about Vague Goals, and this movie seems to be exactly what I'm talking about. People have needs, but not goals.", "group_id": 2515, "id": 1155032}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306173511.6468, "message": "Are we confident the OS is Physics?", "group_id": 2515, "id": 1155038}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306173768.61677, "message": "I meant everyone...... but I realise that is just something really simple......", "group_id": 2515, "id": 1155056}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306173356.9263029, "message": "Well, about the OS Goal.....it's a doozy....... (or whatever it is Ned says). \n\nNot sure (therefore you might be right) about Ned. For the others, I'll try to explain how I see it.\n\nNancy is a tool to demo Phil's instinct, yes, but she also didn't have someone. The story doesn't play on her need, other than we see her standing on her own at the celebration. But if we are considering the writer's view, I would say the writer saw her as a girl that wanted a man, to enable the match with Phil.\n\nI think a similar thing is true about the producer (OS Rita) and / or IC. She is a character that, although sunny, if she was fully loved up at the start, then there would have been not place in her heart for the news anchor / MC.\n\nI think the drunks thematic statement is entwined with there 'loser' character status, and meeting Phil makes one of them say out loud what a rubbish life they have. So, again, although the story doesn't play on it, they do have gaps in their life, perhaps seen as needs if we imagine the writer's view on his / her characters.", "group_id": 2515, "id": 1155013}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306173426.3821011, "message": "I would only say that the one and only thread I can see through all of them is needing / wanting more from life (love, interest, greater business success).", "group_id": 2515, "id": 1155028}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306173575.0193501, "message": "You mean, once Phil realizes he can't die, he has to figure out how to get through the day (knowing he'll repeat it) -- and that is the goal? But that's an MC goal....", "group_id": 2515, "id": 1155043}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306173461.1937251, "message": "Yes, I was just going to write pretty much the same thing.....", "group_id": 2515, "id": 1155033}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306174142.9801631, "message": "Hmmmm..... well...... OS could be Physics. Actually for me not because of the celebration. I still don't think the main OS characters are that interested in it (Ned is working, drunks who knows, Larry just is working), BUT they are all involved in both the day (of course) and the activities that make the day function.", "group_id": 2515, "id": 1155110}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306173834.124553, "message": "Hmmm... I'm finally seeing Chris's comment in a new way. I now think that OS is definitely Physics. \n\nEveryone *is* reliving the same day -- they have to be, or nothing could change with them. That makes \"getting through the day\" a viable goal, and an activity.", "group_id": 2515, "id": 1155061}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306173897.819078, "message": "And, could they all be the Protagonist? The way the whole town is the IC in Blazing Saddles?", "group_id": 2515, "id": 1155075}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306174563.234705, "message": "Also, you have not discussed the Relationship throughline and its domain much.  I think it is one of the more obvious fits with the storyform.  There are lots of examples supporting your choice for it.", "group_id": 2515, "id": 1155214}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306174182.7139101, "message": "If 'getting through the day' is the goal, for me that makes Phil definitely the protagonist - he is the only one that can stop it repeating.", "group_id": 2515, "id": 1155116}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306174249.8334401, "message": "In other words, of Phil doesn;t stop the day repeating, the OS characters don't get through it.", "group_id": 2515, "id": 1155127}, {"user_id": 10814, "stars": [{"date_created": 1306186723.6131921, "user_id": 7645}], "topic_id": 36160, "date_created": 1306174479.071914, "message": "You are on the right track with the domains.  \n\nIn the OS, what causes trouble for everyone in the story -- even before the never ending loop begins?  It causes trouble for the production crew, the towns people, everyone.  What is the disruptive force?  And, by the end of the story, is that disruptive force resolved?", "group_id": 2515, "id": 1155193}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306175271.953855, "message": "Re. the relationship domain, Psychology stands out for me, because their relationship grows through changing their opinions of each other.", "group_id": 2515, "id": 1155332}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306175006.133182, "message": "A disruptive force before the loop............ hmmmm ...... the focus of attention is the celebration and / or the prediction of the weather.... but neither seem too disruptive on the characters. This is a tricky one..... what am I (are we) missing?", "group_id": 2515, "id": 1155281}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175282.4832699, "message": "The disruptive force... The day is different from any other day because:\n1. New Producer\n2. Punxatawney Festival \n3. The Blizzard", "group_id": 2515, "id": 1155334}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306175449.1067719, "message": "Was the blizzrd known at the start?", "group_id": 2515, "id": 1155401}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175461.7840259, "message": "He denies it's going to be a problem in the opening scene.", "group_id": 2515, "id": 1155404}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175513.506151, "message": "Also, nobody but Phil knows that \"a major network is interested in me/I'm not sticking around\" until he announces it to the woman he calls \"Hair-do\" in the opening scene.", "group_id": 2515, "id": 1155415}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306175518.093497, "message": "Your points back up the choice of Psychology well......", "group_id": 2515, "id": 1155417}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175442.9449279, "message": "Relationship domain. (I'm terrible with Psychology....)\nBut, Phil spends a lot of time Being -- pretending to be someone he's not (to get Rita).\nHe also tries to get her to Conceive of the Idea that he's stuck in the day, so that she can help him Conceptualize a way out of it.\nAnd their relationship changes dramatically. Hostile to Becoming Partners.", "group_id": 2515, "id": 1155399}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175568.261569, "message": "He also Becomes happy with himself because he's pursuing things just to bed her. He actually falls in love with the music, the poetry...", "group_id": 2515, "id": 1155425}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306175859.974966, "message": "[This is a total aside that I find interesting. Apparently in the original draft of the movie, there is an ex-lover of Phil's that casts a spell, creating the repetition. Also, in Dead Poet's Society, Professor Keating has cancer, which motivates his \"Carpe Diem\" attitude. Both things were ultimately removed, obviously.]", "group_id": 2515, "id": 1155474}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306176240.625181, "message": "Really? what a different take on the story that would have been. Of course, if  M/I domain is Psychology, that fits with OS Physics.", "group_id": 2515, "id": 1155536}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306178091.139462, "message": "The answer to my OS question was the obnoxious reporter/talent.  He is caustic and causes trouble for everyone he meets.", "group_id": 2515, "id": 1155965}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306178020.370837, "message": "Think of Relationship throughline in terms of Manipulation and I think it makes more sense.", "group_id": 2515, "id": 1155949}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306178479.9909699, "message": "I hate how simple that answer looks. And how easy it is to see with hindsight.", "group_id": 2515, "id": 1156076}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306178706.9603579, "message": "And Phil is trying to Manipulate how/what Rita thinks of him. In fact, there is that funny scene where she names her perfect guy and he says, \"That's me\" to all of her points.\n\nThis seems a lot like \"The Conscious.\" But, I also feel like he abandons his plan of trying to influence her (directly, anyway) for the second half of the movie. (Or, maybe last third.)", "group_id": 2515, "id": 1156115}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306180701.338444, "message": "Are you saying that the Protagonist is the person who gets rid of the obnoxious reporter?", "group_id": 2515, "id": 1156471}, {"user_id": 10814, "stars": [{"date_created": 1306186787.923408, "user_id": 7645}], "topic_id": 36160, "date_created": 1306179014.448149, "message": "This is why it is important to keep the throughline context in mind when answering these types of questions.  Phil is not in the OS, it is the obnoxious reporter.  The obnoxious reporter isn't having a relationship with his producer, it is the self-centered Phil trying to manipulate the sweet and level-headed Rita. \n\nObviously, both are in the story and the characters share players, but the Dramatica questions require you to look at the appropriate part of the story to answer your questions accurately (with tolerances! <g>).", "group_id": 2515, "id": 1156184}, {"user_id": 10814, "stars": [{"date_created": 1306186939.458812, "user_id": 7645}], "topic_id": 36160, "date_created": 1306185148.6541531, "message": "Not exactly, but the obnoxious reporter does give an indication of the source of the troubles.  \n\nSo...is he troublesome because he is obnoxious or because he is a reporter?  \n\nThe answer to that question should lead you in the direction of the OS Concern, and therefore the Story Goal.\n\nWhat causes the looping anomaly?  In what ways is it connected to the obnoxious reporter?", "group_id": 2515, "id": 1157189}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306185218.3208189, "message": "And, of course, the flip-side to the above question:  What stops the looping anomaly?", "group_id": 2515, "id": 1157202}, {"user_id": 7645, "stars": [{"date_created": 1306190573.1615989, "user_id": 29788}], "topic_id": 36160, "date_created": 1306187042.7674921, "message": "The next version of the DQS should have a direct link to Chris's desktop. That way we could get personalized Query Questions for our stories like the ones above :) I would certainly pay for the upgrade!", "group_id": 2515, "id": 1157486}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306190046.1352739, "message": "That's a very interesting question, because 90% of the movie takes place \"inside\" the repeating day, but very little time is actually spent exploring why it's happened or how to get out of it. So, I'm not sure how to weigh it. \n\nIt's like following two people trapped in an elevator. It's 100% about being in the elevator, except for the 95% they come to blows over their relationship.", "group_id": 2515, "id": 1158023}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306188917.6828489, "message": "Seriously! \n\nI think the looping stops, btw, when Rita spends the night in his bed.\n\nOooo... is that the goal? MC Phil has to learn to be at peace, but OS Reporter has to get her into bed? (Which would have a requirement of not being obnoxious?)", "group_id": 2515, "id": 1157844}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306190835.892637, "message": "Re. Chris' questions:\n\n\"...is he troublesome because he is obnoxious or because he is a reporter? \"\n - because he is obnoxious", "group_id": 2515, "id": 1158179}, {"user_id": 10814, "stars": [{"date_created": 1306191690.9971969, "user_id": 7645}], "topic_id": 36160, "date_created": 1306189692.155654, "message": "Another thing to consider is the relative emphasis of the four throughlines.  Which throughline is most emphasized?  Which throughline is least emphasized?  Where do the other two throughlines fit in between the two in terms of emphases?\n\nBy \"emphasis,\" I mean the amount of time or importance that the author has given the throughline.\n\nAudience members often mistake the most emphasized throughline as the Overall Story throughline, even when it is not.  (NOTE: That doesn't mean Ground Hog Day does or does not emphasize the OS more than others.)", "group_id": 2515, "id": 1157973}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191509.2089059, "message": "Crap... could the OS be Situation, and Phil be in Activity?", "group_id": 2515, "id": 1158313}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191040.250881, "message": "You have the OS in Activity.\n\nWhich of the four Types best fits the goal:  Understanding, Doing, Obtaining, or Gathering Information (Learning)?", "group_id": 2515, "id": 1158241}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192048.9854839, "message": "Oohhh, I accidently used the word 'Situation' there.....", "group_id": 2515, "id": 1158468}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192242.3536351, "message": "So my Zen thoughts were ... exactly opposite.", "group_id": 2515, "id": 1158513}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306190942.3933949, "message": "He changes his ways very early. I don't think that's specific enough.", "group_id": 2515, "id": 1158208}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306190944.879199, "message": "If my answers are right, this must make obnoxious reporter the protagonist as he solves the problem.", "group_id": 2515, "id": 1158210}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191639.0740459, "message": "Hold on...... I think we mixed posts. Chris, I guess you're saying OS is Activity?", "group_id": 2515, "id": 1158345}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192009.7090011, "message": "He wants \"a major network\"", "group_id": 2515, "id": 1158459}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192711.096715, "message": "There's also the cameraman - producer, cameraman - Nancy  elements that show other people that must learn to together. Although only reporter and producer achieve this, if it is the goal.", "group_id": 2515, "id": 1158559}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191667.7752831, "message": "I think 'that's right' was for my post...............", "group_id": 2515, "id": 1158354}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191899.4755709, "message": "Ah... he remembers?", "group_id": 2515, "id": 1158427}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306190870.181602, "message": "\"What causes the looping anomaly? In what ways is it connected to the obnoxious reporter?\"\n- obnoxious reporter not living the day in a good way", "group_id": 2515, "id": 1158184}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191550.4166689, "message": "I'm not sure how to separate this:\n\n \"The Reporter spends a lot of his time Learning (To play the piano, French, about the women -- \"No white chocolate.\"\n\nfrom the MC throughline.", "group_id": 2515, "id": 1158326}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306190971.2732871, "message": "Perhaps then the answer is he lives the perfect day, to the bes of his ability?", "group_id": 2515, "id": 1158222}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191648.2316511, "message": "Wait... OS is Situation with Learning?", "group_id": 2515, "id": 1158347}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306190918.9697599, "message": "\"What stops the looping anomaly?\"\n- obnoxious reporter changing his ways", "group_id": 2515, "id": 1158196}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306190976.2161059, "message": "I think you now have an indicator of the direction of the goal, and yes, I would say the reporter is the protagonist.", "group_id": 2515, "id": 1158224}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192304.956706, "message": "The god-like being thing doesn't work for him.  No one remembers it except him, and his god-like powers do not extricate him from the time loop.", "group_id": 2515, "id": 1158516}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191096.259887, "message": "In a way, you have already selected the OS Concern because of your choice for MC Concern.", "group_id": 2515, "id": 1158248}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191534.35256, "message": "That's right.", "group_id": 2515, "id": 1158321}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191801.5073569, "message": "Ok.... I think I get it....... so the obnoxious reporter is learning (piano, French), and becoming less obnoxious, and more popular with the townsfolk. Phil is growing and understanding the importance of how this can help him grow....     (???)", "group_id": 2515, "id": 1158397}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192032.372972, "message": "He hates that he's going back to the festival for the fourth year.", "group_id": 2515, "id": 1158464}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192389.7913201, "message": "As was said earlier (I think), the reporter must learn to live with others, to mesh, and not to set himself apart.", "group_id": 2515, "id": 1158527}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191977.4466259, "message": "He is unhappy with what he has, he wants out of small network TV, wants to be more important / recognised.", "group_id": 2515, "id": 1158451}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192417.7808709, "message": "Can the OS goal be about only the protagnist?", "group_id": 2515, "id": 1158529}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193086.728704, "message": "Which makes sense considering the 'story mind' principal", "group_id": 2515, "id": 1158611}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191367.28859, "message": "Ohh... I'm just realizing something. The Obnoxious Reporter is stuck in the loop, too. It's not just Phil.", "group_id": 2515, "id": 1158286}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191368.216249, "message": "I was thinking along the lines of everyone learning to live with the reporter.", "group_id": 2515, "id": 1158287}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192013.954174, "message": "Yes, because he thinks he is more than his situation", "group_id": 2515, "id": 1158461}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191318.0576451, "message": "The Reporter spends a lot of his time Learning (To play the piano, French, about the women -- \"No white chocolate.\", even about when are where people are going to die/fall out of trees/choke). I have an easier time seeing that as a Concern than as a Goal, unless it's Learning what Rita wants.\n\n(I run into this issue a lot. I feel like I see Concerns adding up to a different Goal -- like, I want Phil to understand all he's learned.)", "group_id": 2515, "id": 1158276}, {"user_id": 10814, "stars": [{"date_created": 1306191822.4019499, "user_id": 7645}], "topic_id": 36160, "date_created": 1306191666.12957, "message": "OK, what is Phil's problem, the one with which he comes to the story?  What personal issue(s) would travel with him if you place him (as he is at the beginning of the story) in some OTHER story?  That will help you define HIS issues as opposed to the reporter's issues.", "group_id": 2515, "id": 1158352}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191846.05586, "message": "Phil is in a problematic Situation.  How is he stuck...personally?", "group_id": 2515, "id": 1158410}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191938.756984, "message": "Where is he at the beginning of the story personally, before the time loop?", "group_id": 2515, "id": 1158441}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192207.159225, "message": "No.  He just wants to be wanted, but he doesn't know how until after he has lived MANY days/years/decades/etc. before he works it out.", "group_id": 2515, "id": 1158509}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192222.52988, "message": "He is focused on the Present, which causes him trouble.", "group_id": 2515, "id": 1158510}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192432.2500429, "message": "I think it specifically only is about the protag.", "group_id": 2515, "id": 1158532}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192480.6357279, "message": "The reporter accomplishes this with the help of his other function as MC.  The MC changes and loses his angst.  That is the \"crucial\" aspect that allows the reporter to break the spell.", "group_id": 2515, "id": 1158537}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306191548.3528509, "message": "You're incredibly patient.", "group_id": 2515, "id": 1158325}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191559.6683209, "message": "And Learning is the OS Concern, not the Relationship Concern.", "group_id": 2515, "id": 1158331}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191887.946017, "message": "Always keep the context in mind.", "group_id": 2515, "id": 1158421}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191756.873266, "message": "Yes.", "group_id": 2515, "id": 1158376}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192241.6997139, "message": "Yes to \"Stop.\"", "group_id": 2515, "id": 1158512}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306191910.3753691, "message": "So in a different story, it could be, for example, a major incident (accident, etc) that makes Phil understand he needs to be a better person / lead a more fulfilling life.", "group_id": 2515, "id": 1158430}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192648.9827361, "message": "I'm tempted to throw out Issue: Repulsion; Unique Ability: Attraction.\n\nRepulsion -- he wants out of where he is, he hates the motel.\nAttraction: the town loves the reporter. Rita loves phil. \n\nI may be getting ahead of things again.", "group_id": 2515, "id": 1158552}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193203.3074529, "message": "I meant that, as the theory is based on conflicts that exist in our minds, repeating days don't.", "group_id": 2515, "id": 1158626}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193237.7020209, "message": "I guess a lot of stories are not really about the actual stuff that happens.", "group_id": 2515, "id": 1158632}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191970.4860749, "message": "Why is he so bitter?", "group_id": 2515, "id": 1158450}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306191995.231967, "message": "And that causes him grief?", "group_id": 2515, "id": 1158455}, {"user_id": 10814, "stars": [{"date_created": 1306192966.8426869, "user_id": 7645}], "topic_id": 36160, "date_created": 1306192043.639477, "message": "You could put him in ANY story and he'd come with this baggage.", "group_id": 2515, "id": 1158465}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192071.8258059, "message": "You know, one thing about the movie that I don't like is that he opts to stay in a town that knows him only as this god-like being. But what you're saying is... that was his personal goal.", "group_id": 2515, "id": 1158475}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192946.475312, "message": "I'll let you all begin hashing those things out.  \n\nHowever, I recommend you look to all four Concerns to see how they play out.  When you are comfortable with all four of them, you'll know you're on the right track.", "group_id": 2515, "id": 1158577}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306193407.4650631, "message": "So, here are our four throughlines:\n1. Phil is bitter about being stuck in a small market, boasts/lies about being wanted by a bigger market, and in contrast, the cameraman had to cover the swallows for 6 years.\n2. OS Reporter is obnoxious, and makes trouble for people around him. (He does a lame report. He makes fun of the producer. He asks to be treated like a primadonna.)", "group_id": 2515, "id": 1158659}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192712.399704, "message": "When you say \"Issue,\" to which Issue do you refer?  Each throughline has an Issue.", "group_id": 2515, "id": 1158560}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306193046.7796509, "message": "The thing that I find sort of amazing at this point is that it seems that \"being stuck in a time-loop\" is not going to be one of the throughlines.", "group_id": 2515, "id": 1158602}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192134.731632, "message": "I think what he has to \"Stop\" then is he has to stop wanting more.", "group_id": 2515, "id": 1158501}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192373.608027, "message": "Only once he finds what he (didn't know) he wanted....", "group_id": 2515, "id": 1158523}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192380.685395, "message": "I mean, the next day, hasn't he done all these things like save someone from choking, save a kid falling from a tree... that's still all true. That last day is still true. I didn't mean that he could die and be reborn.", "group_id": 2515, "id": 1158524}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306193125.982091, "message": "How so?", "group_id": 2515, "id": 1158616}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193271.059746, "message": "What I just said could be good, or the biggest load of nonsense you've ever heard!", "group_id": 2515, "id": 1158641}, {"user_id": 10814, "stars": [], "topic_id": 36160, "date_created": 1306192022.395174, "message": "Exactly.", "group_id": 2515, "id": 1158462}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306192161.421396, "message": "I guess..... he needs to start living in the present..............................", "group_id": 2515, "id": 1158507}, {"user_id": 10814, "stars": [{"date_created": 1306193021.3660231, "user_id": 7645}], "topic_id": 36160, "date_created": 1306192500.0251, "message": "Whatever the Story Goal is, the protagonist is for it.", "group_id": 2515, "id": 1158541}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306192835.4147129, "message": "I think the OS Issue might be Prerequisites: He will only be wanted if he knows these things first.\nThe MC Issue could be Repulsion.", "group_id": 2515, "id": 1158567}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193013.1450419, "message": "You mean the 4 different throughline concerns (Present, Learning, .....) or 4 within each throughline?", "group_id": 2515, "id": 1158589}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306193262.547426, "message": "They become the setting for the story to play out...", "group_id": 2515, "id": 1158637}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193303.43806, "message": "Yes, and the setting is just that I guess - the place for the story but not the story itself.", "group_id": 2515, "id": 1158646}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193318.2287259, "message": "I'm started to sound like I know what I'm talking about!", "group_id": 2515, "id": 1158649}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306193381.323668, "message": "Must continue this tomorrow. Very interesting stuff.", "group_id": 2515, "id": 1158656}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306193420.2275131, "message": "And we'll weave Rita into this tomorrow.", "group_id": 2515, "id": 1158664}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306221543.6862841, "message": "My take on IC:\n\n3. Rita (IC) is happy with herself, although perhaps also in need of love. She sees this troubled, bitter Phil, who she helps even though he doesn't deserve her help. She sees the good in people, so the better Phil becomes (the better he lives the day), the more chance they have of being together.", "group_id": 2515, "id": 1162934}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306221176.741004, "message": "I think we need to separate Phil and obnoxious reporter more. If we can take Phil (MC) our of this story and place in any other, and he'd have the same issues, then I guess MC issues need to be more about him. \n\nTaken your idea above, here's how I'd organise them, given what I (think I) have learned in this thread:\n\n1. Phil feels unwanted, but he doesn't know what he really wants. This makes him uninterested in what he's doing and bitter, and less interested in other people.\n\n2. Reporter (OS) is bitter about being stuck in a small market, boasts/lies about being wanted by a bigger market, is obnoxious, and makes trouble for the people around him (particularly the cameraman and producer). The cameraman had to cover the swallows for 6 years, but has less ambition (or cares less about what people think about him), but is later shown as needing a girl. The producer is the opposite to reporter - she is focused fully on making the best of her task now.", "group_id": 2515, "id": 1162891}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306222160.594306, "message": "Changing the subject slightly, some time ago I saw a short film called '12:01 PM'. If you like this one and haven't seen it, highly recommended. Kept me thinking for weeks afterwards. Same concept as Groundhog.", "group_id": 2515, "id": 1162991}, {"user_id": 30287, "stars": [], "topic_id": 36160, "date_created": 1306238017.6886129, "message": "@Mikeaja, Do you mean this one?  http://shortfilmcenter.blogspot.com/2008/03/1201-pm.html", "group_id": 2515, "id": 1165117}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306259653.493216, "message": "Yes, that's it. Had me thinking for weeks afterwards.", "group_id": 2515, "id": 1168596}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306268843.2011931, "message": "But, remember, you said, \"he thinks he's better than his situation.\" Isn't that the MC?", "group_id": 2515, "id": 1170235}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306266953.0824931, "message": "I want to make sure that we are specifically talking about MC Phil in a situation.\n\nSituation: he's in a crap job that makes him bitter. (Other people have similar jobs, but don't get bitter about it.) I see this replaying every morning when he wakes up: the Dylan song says, \"You're still stuck here,\" and then he must go do a report that he hates. {Plus, we've already said that the solution to this is \"being wanted.\"}\n\nI'm not sure exactly when this guy transitions to the OS Reporter. I see a lot of what he does with the rest of his day as fall-out from trying to bed Rita.", "group_id": 2515, "id": 1169972}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306267766.7323251, "message": "Well, my view on this is:\n\n\"he's in a crap job that makes him bitter.\"    this is the OS reporter\n\n\"I see this replaying every morning when he wakes up: the Dylan song says, \"You're still stuck here,\"  - his reaction to this, showing us how he feels about it, is what I think is the MC view.", "group_id": 2515, "id": 1170082}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306267892.0822611, "message": "\"I'm not sure exactly when this guy transitions to the OS Reporter.\"  - as far as I (think) I understand all this, there is no transition. The part played by Bill Murray is both characters at the same time from beginning to end.", "group_id": 2515, "id": 1170107}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306267780.4826391, "message": "\"and then he must go do a report that he hates\"  - is OS reporter", "group_id": 2515, "id": 1170084}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306267831.3598399, "message": "Sort of knowing that he isn't really so bad (are there clues in the film to back this up?) - MC view", "group_id": 2515, "id": 1170098}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306267923.697, "message": "If I'm wrong I'm gonna steal a rat and drive off a cliff!", "group_id": 2515, "id": 1170113}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306268910.086287, "message": "I'm also beginning to get the sense that he might be a steadfast character. If he \"wants to be wanted\" and then finds satisfaction when finally finally everyone wants him... that's steadfast, no?", "group_id": 2515, "id": 1170242}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306271485.1387839, "message": "The situation I guess is being (stuck) in a place he initially doesn't want to be. So I would say the MC view is showing us the boring, depressing side of  being stuck in a job and place we don't want to be, to then a journey towards hope. The situation just provides the means to force the story / characters to stay there (otherwise he would certainly have left after the celebration).\\", "group_id": 2515, "id": 1170686}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306270699.0642829, "message": "Or something like that", "group_id": 2515, "id": 1170475}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306271379.5933299, "message": "I watched 12:01 btw. It's interesting how many beats overlap with Groundhog Day.", "group_id": 2515, "id": 1170640}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306271137.6037021, "message": "So what Situation is he stuck in?", "group_id": 2515, "id": 1170579}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306270879.6249311, "message": "I'm not sure if maintaining the same needs/wants means steadfast. He, as MC (so our view of his situation and how he feels about it) definitely changes. Well, I'd say the OS reporter solves the problem due to changing his ways.", "group_id": 2515, "id": 1170517}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306271603.617348, "message": "A beat is just a section of a story -- it has nothing to do with STC.\n\nBoth characters say \"I am a God!\" -- same beat.", "group_id": 2515, "id": 1170718}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306271574.366487, "message": "I guess Groundhog day used that story.", "group_id": 2515, "id": 1170712}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306270694.860863, "message": "I might have been wrong before....... for me now this:\n\n\"he thinks he's better than his situation.\"   if we are talking about his reporter job is OS. if we are talking about the audience feeling towards him, then MC.", "group_id": 2515, "id": 1170474}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306271542.2516601, "message": "Not sure what a beat is. I know it's part of Save the cat, but don't know the details.", "group_id": 2515, "id": 1170705}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306271812.6233151, "message": "The writer of 12:01 claimed the movie was a rip-off of his short story, but Ramis claimed it was based on something Nietzche wrote.", "group_id": 2515, "id": 1170775}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306274094.1057179, "message": "As a summary to our storyforming, am I right to say that the current main choices are:\n\nOS Activity / Physics\nMC Situation\nM/I  Manipulation\nI   Mind \n\nOS Concern :  Learning\nMC Concern: Present\n\nI notice in Dramatica, the above choices fix the following two:\nMC Growth:  Stop\nMC Approach: Do-er", "group_id": 2515, "id": 1171150}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306274852.1158221, "message": "That's what I have too. \n\nThe Impact Character and M/I Concerns are fixed as well at: Conscious & Conceiving, respectively, but we haven't talked about why.", "group_id": 2515, "id": 1171257}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276321.9073451, "message": "I would say now is a good time to look at Jim's work....... and compare.", "group_id": 2515, "id": 1171437}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306275765.7051649, "message": "For me, IC Issue of Conscious is the clearer one, because Rita doesn't ignore Phil even though he is not making an effort to be a nice person. If she did, he wouldn't have her good influence to help him grow.\n\nM/I Conceiving is trickier for me. He has the idea of using previous day knowledge to seduce her, but not sure that is part of it.", "group_id": 2515, "id": 1171386}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276490.137727, "message": "You didn't know? They're amazing.", "group_id": 2515, "id": 1171458}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306275098.9834211, "message": "We haven't really talked about why, but we have Action, Optionlock, Success, Good too.\n\nAction: Going to the festival, Waking up on the same day forces him to decide what to do that day, ends with Action of Rita spending the night.\n\nOptionlock: Not only is time infinite, but he spends each day exploring every option possible.\n\nSuccess: He stops causing problems for everyone he's around.\n\nGood: He happily decides not to leave the town.", "group_id": 2515, "id": 1171295}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306276990.699259, "message": "lol", "group_id": 2515, "id": 1171557}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306277007.915029, "message": "actually i think you guys got the big parts", "group_id": 2515, "id": 1171559}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306275889.002645, "message": "I would go for MC Resolve of Change, because I think we see his mind-set change as far as dealing with the day. That would make MC Growth losing a characteristic (stop), which describes the loss of his bitterness, negative outlook.", "group_id": 2515, "id": 1171397}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276890.1753161, "message": "Did you copy and paste from Google?", "group_id": 2515, "id": 1171533}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276450.734292, "message": "Podcast?", "group_id": 2515, "id": 1171449}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276541.916714, "message": "Yes, saw that. Just a forum thing I guess", "group_id": 2515, "id": 1171472}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276652.506639, "message": "Wow..... and Maltese Falcon podcast is there.........", "group_id": 2515, "id": 1171488}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306276847.537281, "message": "My links always work", "group_id": 2515, "id": 1171522}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276984.802407, "message": "This must have been the saddest game of tennis you ever watched Jim.", "group_id": 2515, "id": 1171554}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276986.2421811, "message": "Now we can see if Jim was right.............................. ;)", "group_id": 2515, "id": 1171555}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276387.724885, "message": "I see Conscious as something like, \"She is able to see the best in every situation.\" \n\nFor the M/I, I would define their relationship as \"Pursuer/Wary Female\" and Conceiving as \"He's trying to get her to see their relationship as a good idea\" but I'm just winging it...\n\nSo, yes, let's bust open the link Jim provided. Also, there's a full podcast.", "group_id": 2515, "id": 1171441}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276870.898375, "message": "You are in for a treat. \n\nThanks for the back-and-forth on this. I would love to do The Conversation or Festen next.", "group_id": 2515, "id": 1171526}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276920.554095, "message": "Like twitter, etc does", "group_id": 2515, "id": 1171542}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306276504.0420129, "message": "Also, Jim's abbreviated link doesn't work.", "group_id": 2515, "id": 1171463}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306277466.115489, "message": "I like the idea of doing movies that have a podcast!", "group_id": 2515, "id": 1171658}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306276874.282393, "message": "But for some reason that one doesn't work lol", "group_id": 2515, "id": 1171528}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276887.8552999, "message": "lol", "group_id": 2515, "id": 1171531}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306276907.9654689, "message": "i thought i did it from the URL, but there's a chance i did", "group_id": 2515, "id": 1171536}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276910.13223, "message": "It just looks like this forum compresses links", "group_id": 2515, "id": 1171537}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276963.866051, "message": "Yes, thanks to you too Mike. Was great to throw this around. I've actually learnt a lot just on this one story.", "group_id": 2515, "id": 1171550}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306277014.056731, "message": "Ironic considering I play 4 times a week (and I'm not very good).", "group_id": 2515, "id": 1171560}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306276797.6474521, "message": "It's almost 2 hours!!! How did I miss these?", "group_id": 2515, "id": 1171513}, {"user_id": 7645, "stars": [], "topic_id": 36160, "date_created": 1306276919.842082, "message": "wonderful!", "group_id": 2515, "id": 1171541}, {"user_id": 30951, "stars": [], "topic_id": 36160, "date_created": 1306277158.3030369, "message": "The one aspect I'm still not 100% on is OS Activity. I can see the other throughlines, and that makes OS activity, but I'm not clear what the activity is (because the repeating day seems like situation to me).", "group_id": 2515, "id": 1171590}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306277345.0842669, "message": "Man, I don't. I woke up this morning, no joke, reciting dramatica terms. If that isn't proof that I was trying to sort things out still, I don't know what is.", "group_id": 2515, "id": 1171630}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306277420.601109, "message": "I think the podcast will clear that up. But, I'm with you. What is the process-gone-wrong that's causing problems?", "group_id": 2515, "id": 1171649}, {"user_id": 7664, "stars": [], "topic_id": 36160, "date_created": 1306277437.27457, "message": "Now, I'm officially going to stop thinking about it.", "group_id": 2515, "id": 1171653}]