[{"user_id": 11626, "stars": [], "topic_id": 15412, "date_created": 1301102248.2151129, "message": "Radiation Burns on My Face?\r\nKim M.\r\nSoCal Martial Law Alerts\r\nMarch 25, 2011\r\n\r\nI will say it again:\r\n\r\nI received (light) radiation burns on my face after being exposed to the first rainstorm from Japan to hit land here on the California coast, March 18, 2011.\r\n\r\nIt was nighttime (after 7:00 p.m. PDT) and I was only in the rain for about 10 minutes. There was still a little light in the sky, due to its being Daylight Savings Time, but not very much wind. I was wearing a raincoat, but didn't have an umbrella, so the rain went right in my face. When I got inside, I noticed that my face was bright red as if I had been sunbathing and the redness didn't disippate until the next day (which is what typically happens whenever I get sunburned). One week later, the top layer of skin is brownish and brittle and is beginning to flake off. (Again, this is typical for a sunburn.)\r\n\r\nThe media has told us that \"miniscule quantities\" of radiation were detected at a monitoring station in Sacramento, California.\r\n\r\n\"Miniscule quantities\" do not cause radiation burns.\r\n\r\nIt's also interesting to note that the only radioactive isotope mentioned in the Environmental Protection Agency's \"statement\" is Xenon 133. Xenon 133 is a gas and has a half-life of only five days (which is why they use it in nuclear medicine). Fukushima reactor #3 blew up on Monday, March 14, 2011 and the first rain from Japan hit California five days later, on March 18, 2011.\r\n\r\nMiniscule quantities indeed.\r\n\r\n    \"Most of the radiation that's been released is gaseous, which goes right up,\" one [congressional] aide said. \"So radiation levels at ground level will be different from radiation levels above the reactor.\"\r\n\r\n\r\n\r\nUm, yeah. Which would explain why only \"miniscule quantities\" of Xenon 133 the gas with a half-life of only 5.243 days were detected way over here in California, five days later. Great.\r\n\r\nBut what about all the other radioactive isotopes that were sure to have been included in that blast?\r\n\r\nThe Japanese are just now admitting that Fukushima reactor #3 is indeed leaking radiation and, remember, #3 is the reactor that uses the deadly MOX fuel containing Plutonium 239. Plutonium 239 has a half-life of, oh say, forever (24,200 years to be exact).\r\n\r\nSo the real questions are:\r\n\r\nWhy hasn't our crack mainstream media given us a specific list of all the radioactive isotopes that were released into the atmosphere at Fukushima on March 14, 2011?\r\n\r\nAnd why haven't the media and the federal government released a comprehensive list of all the radioactive isotopes that have been detected in the United States, plus specific information on their properties (half-lives, effects on the human body, etc.)?\r\n\r\nAnd why are we just now learning that at least half the radiation monitoring stations in California don't even work and/or are \"sending data with 'anomalies?'\"\r\n\r\nAt the very least, if we had reliable information on what really happened, then we the people could make our own decisions on what to do, or not do.\r\n\r\nBecause when I heard that \"miniscule quantities\" of radiation had been detected in California and that they \"posed no risk to human health\" -- and this was after having experienced a radiation \"sunburn\" on my face -- my first thought was, \"I'll bet those monitoring stations don't even work!\"\r\n\r\nHa. Sometimes it's just wrong to be right.\r\n\r\nhttp://www.meetup.com/socalmartiallawalerts/messages/boards/thread/10609769", "group_id": 3920, "id": 443773}]