[{"user_id": 14215, "stars": [], "topic_id": 11427, "date_created": 1299560232.3718071, "message": "Im trying to figure out if it is possible to turn a video clip into a menu interface. Something you normally make in flash with hyperlinks and mouse rollovers to cause the video to jump to a spot and stop.", "group_id": 1270, "id": 293847}, {"user_id": 12430, "stars": [], "topic_id": 11427, "date_created": 1299562988.9653039, "message": "Do you mean the player interface? Can you explain it better?", "group_id": 1270, "id": 294456}, {"user_id": 14215, "stars": [], "topic_id": 11427, "date_created": 1299613099.5481441, "message": "Im making a website with a layout designed in 3D. The menu interface is 3D text in side of a box and the roll over effect is for each lighter to light up. I put some thought into it and decide to render out stills of the roll over (the letters lite up) and the down state (the normal letters). The problem I'm having is I cant just slice it and make a mouse over because the box with the text is at a 30 degree angle.", "group_id": 1270, "id": 298805}, {"user_id": 14215, "stars": [], "topic_id": 11427, "date_created": 1299613276.3570049, "message": "My question is how to best go about making a roll over effect based on the mouse position over the image to show the highlighted state or normal state if the mouse is not over a word. I imagine something like this can be done with java. I just havent been able to fine any tutorials.", "group_id": 1270, "id": 298827}, {"user_id": 12430, "stars": [], "topic_id": 11427, "date_created": 1299667669.1085179, "message": "Supposing you have something like this,\n\n<nav id=\"menu\">\n    <ul>\n        <li><a href=\"\">Menu Element</a></li>\n    </ul>\n</nav>\n\nYou can use a selector like #menu li a:hover but be sure to make the <a> with a height and width, and display:block or display:inline-block. That way the <a> will not only cover the text.\n\nIf this is not what you meant, I'm sorry... Maybe you can post some lines of your menu...", "group_id": 1270, "id": 303612}, {"user_id": 13562, "stars": [], "topic_id": 11427, "date_created": 1299667671.102829, "message": "You could either have images representing the words. And these images are bigger than the word itself - so that the area around is also responsive to the mouse position.\n\nOr you could make your a-Tag or a div in display=block and a bigger size than the \"3D\" word itself. And then the link or div changes the contained image or word. (Either via CSS or JS).", "group_id": 1270, "id": 303613}, {"user_id": 12430, "stars": [], "topic_id": 11427, "date_created": 1299667369.9073651, "message": "I'm not sure if I totally understand you.", "group_id": 1270, "id": 303585}, {"user_id": 14215, "stars": [], "topic_id": 11427, "date_created": 1299689136.388113, "message": "Here's a link to the image I'm working with. As you can see its at an angle and I will have the roll over effect be the letters light up. I have stills of all the states but since this image is at an angle I need to make some kind of mouse position or hot spot so when someone rolls over a word it jumps to the frame or loads the frame with the lite word. I was wondering if its something that can be done with JQuery lib? http://www.shihstudio.com/client/menu.jpg", "group_id": 1270, "id": 306670}, {"user_id": 13562, "stars": [], "topic_id": 11427, "date_created": 1299702872.6290879, "message": "You should consider using an imagemap which changes the whole big image on mouseover to a version which has only the current point highlighted. I am not sure if imagemaps are kind of deprecated in modern browsers.", "group_id": 1270, "id": 308101}, {"user_id": 20884, "stars": [], "topic_id": 11427, "date_created": 1300007612.977041, "message": "I like what you did with that, may I suggest animated GIFs or APNGs? And then kinda layer the <li> elements on top of each other? BTW, change the permissions in your /client/ folder. I can read all you work.", "group_id": 1270, "id": 339717}, {"user_id": 19791, "stars": [], "topic_id": 11427, "date_created": 1300046781.9576859, "message": "You don't really need jQuery to do this.  Simplest way and most efficient (time-wise) way, if you presumably still have the files you used to render this, is to render only the front face for each of the four options in whatever highlight color you want.  Render them as four PNGs (or GIF) with alpha which can be layered (via layer) on top of the menu whenever the mouseover occurs at the right place (via imagemap).", "group_id": 1270, "id": 343275}, {"user_id": 17592, "stars": [], "topic_id": 11427, "date_created": 1300175778.18085, "message": "Create a sprite for all the words highlighted and turned off, and set them as background-images to each link in an unordered list. And text-indent the actual link text, replaing it with the background.. on hover just reset the background-position to show the highlighted version of that word.", "group_id": 1270, "id": 353891}, {"user_id": 34892, "stars": [{"date_created": 1307375885.4589131, "user_id": 13568}, {"date_created": 1311975520.511868, "user_id": 8192}], "topic_id": 11427, "date_created": 1307345315.2581551, "message": "An imagemap will help you here.  But as a user I would hate you for designing such a convoluted interface.  What is wrong with text?  This seems like a bad case of form over function.  \"Wouldn't it be cool if...?\" - yeah it would be cool, for about 3 seconds, after which I'm never coming back to your crappy site again.  Name me one successful site that uses anything except simple text links for navigation.", "group_id": 1270, "id": 1301078}, {"user_id": 3556, "stars": [], "topic_id": 11427, "date_created": 1308493632.4667759, "message": "@chambem9, clearly you don't follow any advertising agencies, FWA or any of the guys who came out of tDR (Build, Universal Everything, David Bailey), Kleber, Studio Output, DixonBaxi, Hi-ReS!. Or any video game site for that as well. Or probably anything that Tha. LTD does either. By the way, everyone I listed there happen to be multiple award winning designers who all create unconventional websites. Get over yourself.", "group_id": 1270, "id": 1431727}]