[{"user_id": 11626, "stars": [], "topic_id": 40791, "date_created": 1309396572.728281, "message": "http://oathkeepers.org/oath/2011/06/21/an-empire-strikes-home-_-part-two/", "group_id": 3920, "id": 1524057}, {"user_id": 11626, "stars": [], "topic_id": 40791, "date_created": 1309396539.3433681, "message": "June 21st, 2011\nAn Empire Strikes Home _ Part Two\n\nPart One: http://oathkeepers.org/oath/2011/05/16/an-empire-strikes-home-_-part-one/\n\npolice-state-heavily-armed\n\nAn Empire Strikes Home _ Part Two\n\nMilitarizing Law Enforcement / Domestic Military Deployment,\n\nBy Elias Alias, May 18 – June 21, 2011\n\nProfiling The Policy\n\nIn Part One of “An Empire Strikes Home” we focused on a sad shooting death involving the Pima County, Arizona, Sheriff’s Department regional multi-jurisdictional S.W.A.T. team. We also spotlighted several Arizona news articles in which the Sheriff’s Department issued conflicting stories regarding the S.W.A.T. raid. The published statements began by claiming that the suspect initiated and conducted a “standoff” and started a “gun battle” with deputies who had come to his home to serve a warrant.\n\nI think that everyone knows that for any government action involving shooting of a citizen those kind of reports is the proper (meaning, from LE’s perspective) way this sort of operation should be presented to the press and to the public – the cops are the good guys and the dopers are the bad guys.\n\nWhen SWAT showed up to enforce the law one of the bad guys had the audacity to draw down on the good guys as they were busting in his front door. As the acceptable, just, and lawful scenario was presented to the press, the good guys prevailed and the bad guy failed.\n\nMessage done, cut and dried, clean and closed, nothing more to see here, now move along to the next five-second news sound bite and have a nice day.\n\nThe public will take that kind of story and say, “Oh well, that ‘bad guy’ should have thought twice before choosing a life of crime, and it’s no loss to society that he’s gone. Too bad about the widow and fatherless children she’ll raise alone now – she married the wrong dude.  The man was associated with marijuana, so he must be a ‘bad guy’.  Live by the gun, die by the gun.”\n\nThat is, generally speaking, how a significant part of the public would see this event by reading the first Sheriff’s Department accounting of the death of Jose Guerena. And that is the desired perception which the Sheriff’s Department and higher-ups wished to present for public consumption, for that is the perception which will spare the County the trouble of more extensive damage control. If it works.\n\nDays later, however, the Pima County Arizona Sheriff’s Department confessed that Jose Guerena did not shoot at the officers. Tough luck for Sheriff Dupnik, drat.\n\nIn early June, 2011, the cheerleaders for militarized law enforcement are saying “But hey – wait a minute here! We’re telling you the facts as we get them. There are new discoveries coming out of the investigation and we now know that earlier reports were less than factual. It is true that we said Jose fired on the officers first, and that bullets were bouncing off the SWAT shield at the doorway, bullets fired by Guerena.  Yeah we said that, but now we are saying that he did not fire his rifle at the SWAT team, and besides, we now believe that the man was associated with a grouping of family members who constituted a threat to society They are under suspicion of marijuana-related crimes.  So he really was a bad guy and we really were justified in sending a SWAT urban-warfare combat team into his home and shooting him dead. After all, he did have a rifle in his hand.”\n\nThey’re saying stuff like that already, not quite a month into this. Jose was shot on Cinco de Mayo, May 05, 2011.\n\nBut shouldn’t we ask: Who gave that story to the Sheriff’s Department’s official spokespersons?\n\nWho told the two spokespersons to tell the press and media that Jose fired first, and that his bullets were bouncing off the SWAT team’s shield as they came through the doorway?\n\nIt’s a good question, because just asking that question leads to something very sinister, a psychological anomaly which is subtle and very much out-of-sight, very much hidden from the public awareness. We must ask – Is there a purpose in the perception generated by the Sheriff’s Department?\n\nI do not think for one minute that the two spokespersons would dare make-up a story like this on their own. But even if they did make up this story, they would certainly have submitted it to higher-ups in the chain of command for approval before releasing it to the press. I mean, this story has one shot-up dead man, after all. And there were 71 rounds expended in the operation which must be reconciled according to protocol. A dead war veteran and 71 bullets cascading upon the busting down of a front door of an American home needs proper public perception, lest the natives grow restless. Care should be taken in making press releases. Both spokespersons have a chain of command to which they must report and be held accountable. Did some higher-up tell those two spokespersons to tell that story to the media and press? Or did they just make it up and peddle it to the press?\n\n(Like a gelatinous amorphous blob of pulsating undulating mood-bearing omni-directional free-floating mass of unconscious consciousness, the public mind is to be symbolized as a cohesive field of action. We each have a “mind”, and all of our minds together create what Carl Jung dubbed to be the “collective consciousness” of the human race – well over six billion individual minds registering the impulses and vibration-waves from Alpha through ever-how-many frequencies science now knows the brain emits – and all of those minds together constitute the collective mind of mankind. Specific to America, there are over three hundred million individual minds with each being a singular element (like a molecule in your physical body) in the sum total of all American minds. That collective of American minds constitutes what I refer to as the “public mind”. Edward Bernays and his pals of the day back in the 1920s referred to it as the “Group Mind”.)\n\nRemember: The story initially put forth was that the good guys prevailed and the bad guy failed.\n\nThat is a perception, and that perception was manufactured using the press and media. The press and media, however, merely reported what the Pima County Sheriff’s Department spokespersons gave them. The spokespersons relating the story to the news people were using the press and media to get a public perception into the public mind or the group mind – the floating resilient elastic amorphous collective consciousness. It appealed to a common meme, and the news outlets dutifully reported it. Some in the news business at Tucson felt the sting when it came out later that Jose had not fired. (Oath Keepers especially would like to salute KGUN9 of Tucson.)\n\nThe S.W.A.T. team members fired seventy-one shots in seven seconds to kill the man dead because he had grabbed a rifle as his wife woke him up shrieking and S.W.A.T. broke in his door. It is questionable whether he had a chance to actually know it was law enforcement invading his home.  I mention this because we are looking at something which is a mask, a veil of sorts placed over the public mind. We are looking at a designed, engineered, carefully crafted perception, duly perfected and inserted into the public mind through the regular programming stations and the press. It’s what got into the News. The good guys prevailed, and the bad guy failed. That was the meaning in the initial injection from the Sheriff’s Department into the consciousness of the public mind.\n\nThe details of that incident aside, we note that the trend in American law enforcement reveals a large-scale policy of escalation in a process of militarization of local enforcement agencies. And that is a policy with which Oath Keepers has a problem. America’s good cops, the experienced ones who’ve survived many years in law enforcement and know the score through a body of knowledge which only the years can render, know what I am talking about. Such good souls join Oath Keepers as a way to band together with other good cops who also see the larger horror behind the News.\n\nFBI_SWAT\n\nFBI_SWAT\n\nCops Playing Soldiers?\n\nOur nation is embroiled in much emotional upheaval and wide-spread confusion as the public is being bombarded 24/7 by a compliant media which trumpets Federal utterances on behalf of a desired consensus on Federal policy and issues. Why?\n\nBecause Americans are awakening from the somnambulistic sleep states in which for generations they’ve been living the American dream. They are awakening because the oppression coming from a centralized and unstoppable Federal behemoth in Washington D. C.  has now reached outward into all of the several sovereign States, down into the respective Counties of those fifty Republics and right into their own cities, towns, neighborhoods, and even into their very homes. They’re feeling the pinch of bungled Federal governance over the past four to six decades, with emphasis on the last four Presidential administrations. Don’t deny it. We all know it’s true.\n\nTensions are high and continue to rise. Fear is rampant and is being fanned by Department of Homeland Security (DHS) and all the other usual suspects in the Federal array. Our economy is in its death throes and preparations are being made for the U.S. dollar to be replaced as the world’s reserve currency. Home loss is rampant, job loss is rising, suicide rates among civilians and veterans is skyrocketing, natural disasters are pounding, corruption is everywhere, socialism/Marxism/collectivism are on the march through our social and cultural institutions, our Bill of Rights is being held hostage by a belief system based on ignorance of the virtues of personal freedom in a Republic of law, our schools are pumping humanist/behaviorist existentialist immorality into our children’s heads while Wall Street is conquering their souls with hi-tech toys and myriad related distractions. The nation is in a bad way, and the worse things become, the tighter the Federal government squeezes to wring out the last vestiges of personal freedom and liberty for the American people.  And their wealth. Many Americans are feeling such angst now, and the public mentality shifts toward a heightened awareness of the presence of government in everything people do.\n\nCaught up in the middle of everything are our cops and soldiers and firemen, each of whom is an individual, possessed of one subjective mind of one’s own, is one of countless good Americans sent up to their respective posts from the bosom of American society, from families and neighborhoods, communities and towns.\n\nOur men and women with the authority, the badges, the guns, the uniforms are noble Americans who have grown up and lived in tumultuous times just like everyone else. They represent a cross section of America, and the overwhelming majority of them want to make a difference on behalf of the good in life, want to serve for the benefit of this nation, our respective States, and our local communities.\n\nBut they are often trained to see things in Govlish terms, and are not often trained to see things in Constitutional contexts. They are taught, trained, schooled, conditioned, programmed, and motivated to follow instructions, to be a team player, to care for one’s career, to succeed by acting as expected and required. To the ‘T’. The best pro-and-con marks bring the best career successes. If not shot in the  line of duty, a nice retirement, graced by public appreciation, awaits the proper mindset in any soldier or cop.\n\nThe title of this article suggests an empire striking home. Part One was about a Tucson home which has been struck down horribly. Parts Two and Three will reveal the empire and its tentacular interface across the landscapes of America with an enforcement arm emanating from a centralized governmental structure tied into a global economic balancing act which keeps the power elite jumping and the government pumping and the average cop and soldier humping.\n\nWe will note how international, national, Tribal, State, County, and Local government is now interfaced into the same circuitry – and we shall see how this statist madness made it possible that Jose Guerena was gunned down in his home by a militarized urban warfare combat team of Sheriff’s deputies doing the work of would-be soldiers.\n\nThe tactic elected by the Sheriff’s Department for the simple serving of a warrant was a military-styled assault with plenty of multi-jurisdictional equipment and personnel. This was an urban combat team operation, and it gave the Sheriff’s Department a little on-the-job training for executing procedures, practice in real time, coordination testing for execution of an official court-sponsored urban warfare scenario.\n\nThis militation did not come from the neighborhoods of Tucson or Pima County. It originated in Federal programs and the offices which run them. It did not come from grassroots, where we people live and work – it came from top-down concentrated, designed, choreographed, engineered and focused Federal power.  That fact is part of Oath Keepers’ interest in this case.\n\nIn this second installment we will look more deeply into the militarization of our local peace officers, and note the transformation from local-service peace officers who signed up to “serve and protect”, into authoritarian-styled enforcement tools of bureaucratic governmental mechanisms. We will look at both the military side, and the law enforcement side of the military-police paradigm.\n\nThrough the Department of Homeland Security (DHS) you’re looking at a burgeoning police state apparatus connected across agency lines, across Federal, State, and County lines. This particular home invasion by SWAT under color of law has exposed the thing to public scrutiny.\n\nBut wait; did you read Part One?  Understanding of Part Two will be more complete with one’s knowledge of the information in Part One. Thank you for having read Part One first:\n\nhttp://oathkeepers.org/oath/2011/05/16/an-empire-strikes-home-_-part-one/\n\n-\n\nSWAT_Combat\n\nSWAT_Combat\n\nCohen: Welcome To A Grave New World\n\nBefore looking at his infamous speech of 1999, let us first go back in time to the Clinton Administration, where in 1997 then-Secretary of Defense William S. Cohen was giving a press conference which referenced “terrorism” in exaggerated Hollywood fashion.\n\n– William S. Cohen, April 28, 1997 at a news briefing.  The link for this transcript is –\n\nhttp://www.defense.gov/transcripts/transcript.aspx?transcriptid=674\n\nYou can trust the link – it’s a dot gov link. While briefing the press as Secretary of Defense, Cohen touches upon the concept of weather wars. The sentence is contained within the paragraph below. Watch for it, when it comes up. Here is the sentence: “Others are engaging even in an eco- type of terrorism whereby they can alter the climate, set off earthquakes, volcanoes remotely through the use of electromagnetic waves.\n\nIt’s that “electromagnetic waves” part. Recall, Cohen said this in 1997 -\n\n“…But as we’ve learned in the intelligence community, we had something called — and we have James Woolsey here to perhaps even address this question about phantom moles. The mere fear that there is a mole within an agency can set off a chain reaction and a hunt for that particular mole which can paralyze the agency for weeks and months and years even, in a search. The same thing is true about just the false scare of a threat of using some kind of a chemical weapon or a biological one. There are some reports, for example, that some countries have been trying to construct something like an Ebola Virus, and that would be a very dangerous phenomenon, to say the least. Alvin Toeffler has written about this in terms of some scientists in their laboratories trying to devise certain types of pathogens that would be ethnic specific so that they could just eliminate certain ethnic groups and races; and others are designing some sort of engineering, some sort of insects that can destroy specific crops. Others are engaging even in an eco- type of terrorism whereby they can alter the climate, set off earthquakes, volcanoes remotely through the use of electromagnetic waves. So there are plenty of ingenious minds out there that are at work finding ways in which they can wreak terror upon other nations. It’s real, and that’s the reason why we have to intensify our efforts, and that’s why this is so important.”\n\n-\n\nWhen Secretary of Defense William S. Cohen gave that press conference in 1997 and listed some of the horrific wmd sciences which he alleged the world of terrorists was even then developing to use against us, his message was echoed down the line of command, outward to the entire nation. Justice Department bulletins spread the word, State-level intelligence and enforcement communities dispersed the message to local authorities and offices, and finally your friendly firefighter down the street saw it in a journal while your next-door neighbor cop got it at roll call. The soldiers? They got it straight down the chain of command. A Secretary of Defense has power over the thinking and perception of the entire military, as well as an influence in the public mind, the group mind, the amorphous, shimmering, oscillating bubble of the collective consciousness.\n\nSo cops and firefighters and soldiers who served honorably back in 1997 and since have had a choice to make. Does one conscientiously believe that any rogue nation-state has the technology to “alter the climate, set off earthquakes, volcanoes remotely through the use of electromagnetic waves”? Or does one simply accept whatever the Secretary of Defense says without asking the hard questions, such as, “How can any rogue nation-state get that kind of technology and the materials and logistics needed to actually study such science, much less develop and deliver it, without help from our own Defense contracting multi-nationals?” (We’ll go into HAARP in another article, at another time.)\n\nIn other words, public servants who do not ask such questions will tend to somewhat-blindly accept whichever new reality our leaders pontificate and announce. And act accordingly in order to get good pro and con marks on one’s record of service. Don’t rock the boat. If Cohen says someone is developing the ability to use ultra-low frequency electromagnetic waves to set off the Yellowstone Caldera or bust loose the San Andreas Fault, then by God it must be true and we’d better start looking out for such varmints wherever we work or are deployed.\n\nIt becomes a mindset.\n\nDARPA Mind Control\n\nDARPA Mind Control\n\nThat basic foundational mindset has surfaced in the visage of one Pima County Arizona Sheriff named Clarence Dupnik. He obviously believes the government’s propaganda. We will look into that here, for it is an altered state of consciousness and it sets in one of the people’s seats of power and authority. And, we should note, it has a SWAT team.\n\nBut Oath Keepers firefighters and cops and soldiers are awake, are very reasonable and knowledgeable individuals, can think well for themselves, and they do ask questions. As such, Oath Keepers now offers a look back in time to July 26, 1999, a couple of years after Cohen made his rash predictions in ‘97.\n\nOn that day the Washington Post published a speech by then-Secretary of Defense William S. Cohen, President Clinton’s go-to military guy.  The speech is entitled “Welcome To A Grave New World”.\n\n< http://www.cohengroup.net/news/op_ed/op_ed072699.cfm >\n\nCouched among all the grave reasons why the U.S. Defense Department should be on call to civil authorities for domestic operations, Defense Secretary Cohen was telling us that there would need to be a chain of command between the Pentagon and the appropriate civilian authorities. He dared not use the words “chain of command”. No sir. He put it this way –\n\nAs part of a federal interagency effort launched last year by President Clinton and led by the National Security Council, the Defense Department is doing its part to prepare the nation for the catastrophic consequences of an attack that unleashes these horrific weapons. Because it has long prepared to face this grim possibility on the battlefield, the military has unique capabilities to offer in the domestic arena as well. Several core principles are guiding our efforts. First, any military assistance in the wake of a domestic attack must be in support of the appropriate federal civilian authority — either the Department of Justice or the Federal Emergency Management Agency.  Second, an unequivocal and unambiguous chain of responsibility, authority and accountability for that support must exist.\n-\n\nThat’s it. An “unequivocal and unambiguous chain of responsibility, authority and accountability”.\n\nIs that by any other definition not a “chain of command”? You’re right. But he was speaking a couple of years before 9/11/2001, and at that time any claim by the Pentagon to have any authority to give marching orders to civilian agencies, such as the Justice Department’s enforcement groups or any others, would have been laughed out of court by the American people.  Therefore Cohen also notes in his speech –\n\nFinally, we must not [sic] trample on American lives and liberties in the name of preserving them. Fears about the military’s role in domestic affairs are unfounded, as evidenced by a long history of reasonable and successful military support to communities ravaged by natural disasters, such as fire and flood.\nAs in the past, any military support will be precisely that — support. Both legal and practical considerations demand it. The Posse Comitatus Act and the Defense Department’s implementing policies are clear — the military is not to conduct domestic law enforcement without explicit statutory authority, and we strongly believe no changes should be made to Posse Comitatus.\n\n-\n\nBut of course Cohen was not being genuine. In fact, he was flat-out lying. Consider: It is doubtful that “explicit statutory authority” exists in any body of lawfully written mandate, for Posse Comitatus stands opposed to any ‘explicit statutory authority’ which would place the military on U.S. soil in a policing role. He states clearly that no changes should be made to Posse Comitatus, the old 1878 law prohibiting the use of the Army to police the people of the several sovereign States.  He was preparing the way for George Bush 43 to completely butcher Posse Comitatus, as indeed happened.  But look at this – Cohen continues…\n\nAlso clear is that the military’s unique assets are most valuable when used to supplement — not supplant — continuing federal, state or local efforts. This is one of the reasons we are helping to train the local emergency “first responders” in 120 cities under a program mandated by Congress and now being transferred to the Justice Department.\nBut merely managing the consequences of an attack is not sufficient. We must be vigilant in seeking to interdict and defeat the efforts of those who seek to inflict mass destruction on us. This will require greater international cooperation, intelligence collection abroad and information gathering by law enforcement agencies at home. Information is clearly power, and greater access to information will require the American people and their elected officials to find the proper balance between privacy and protection.\n\n-end excerpt from Cohen’s speech-\n\nDid we notice how slick he was in sneaking that in there? I mean the part about the “information gathering by law enforcement agencies at home”. This speech was published in 1999. Cohen’s drawing-table mentality, like all planning adventures, dealt with abstractions, with concepts which planners use like wishful building blocks of children’s play. Think-tankers and Planners (working groups, etc) get their blocks and Tinker Toys from the U.S. Census, the NSA, the NRO, Pentagon, FBI, CIA, etc, etc.  (More on that in part three.)\n\nDARPA\n\nDARPA\n\nBut as the Guerena shooting shows clearly, the “proper balance between privacy and protection” was anything but an abstract in Jose Guerena’s life. Jose Guerena’s death is sourced to national-level planners who saw, even back in the 1980s and 1990s, some reason to militarize our civilian peace officers. Cohen was pushing that policy in the 1990s.\n\nBefore moving along, please note for recall later that Cohen also said, “Information is clearly power”.\n\nFrom Cohen’s speech in 1999 we can jump now to 2011, just a dozen thrill-packed years later, and find that there exists a Federalized/militarized infrastructure, similar to the 120-City gambit under Clinton’s Administration in which major population centers would become networked in communications and other areas vital to the national intelligence systems required by the Pentagon. There now exists a unifying central hub for all this, and it’s called the Department of Homeland Security. In its outreach, DHS uses for conduits a network of intermediary Intelligence centers called Fusion Centers.\n\nHad Cohen been candid and truthful he would have noted that his announcement of the government’s intent to use U.S. military forces on U.S. soil under whichever exigent circumstances would be deemed worthy, and in conjunction with our local peace officer community, was actually itself predicted by the Defense Advanced Research Projects Agency (DARPA).\n\nKeeping in mind the fact that Cohen has just told us about 120 centers to be established in as many cities around the nation, and that the 120 centers would exert liaison relationships with local, State, Federal, and Military interface, with that unequivocal and unambiguous command structure of unambiguous authority and accountability etc., let’s look at something else before getting to the fruits of his prophecy.\n\nThis is a National Institute of Justice report from 1997, well before Cohen’s Grave New World speech.\n\nhttp://www.ncjrs.gov/txtfiles/164268.txt\n\nIn 1994 the U.S. Department of Justice (DOJ) and the U.S.   Department of Defense (DOD) entered into a cooperative agreement to develop technologies of value to both. This agreement, codified in a Memorandum of Understanding (MOU) and signed by the Deputy Secretary of Defense and the Attorney General, formalized and focused a longstanding ad hoc relationship. To manage this technology development program and to direct its day-to-day activities, the MOU established a Joint Program Steering Group (JPSG) that would represent both departments and be staffed with members from several agencies…\n\nPart I: The Partnership Between Law Enforcement and the Military [emphasis EA]\n\nThe boundaries separating the functions of the law enforcement and military communities are clearly defined in law. The military’s function is to provide for the national defense, while Federal, State, and local law enforcement agencies maintain domestic tranquillity. [Sic] Although performing different functions, law enforcement and the military perform many of the same tasks. Both law enforcement and the military operate their own judicial, police, and prison systems. Within the limits set by law, civil law enforcement and the military communities work cooperatively…. Often law enforcement and the military may also participate in the same missions. Such interagency efforts include waging the war against drugs, countering terrorism and espionage, and providing disaster relief… [emphasis EA]\n\nThe potential benefits of a joint development program became clear to officials in DOD and DOJ, as well as to Congress, in 1993. The overlap of technology needs had been noted by a senior working group (SWG) convened by DARPA in 1993 to assist in formulating a program to develop technologies to enhance the effectiveness of U.S. forces engaged in Operations Other Than War (OOTW). These kinds of operations involve providing humanitarian assistance, peacekeeping, countering the flow of drugs into the United States, and countering terrorism. This initiative was prompted by events in Somalia and elsewhere. The SWG and DARPA noted many common technology needs between civilian law enforcement operations and OOTW. [emphasis EA]\n\nCongress and senior officials in both DOJ and DOD moved DARPA and NIJ toward establishing a formal partnership agreement. In June 1993, the Attorney General sent a letter to DOD and the Central Intelligence Agency (CIA) suggesting collaboration on technology development. In July 1993, Congress initiated language directing the establishment of an interagency working group, which included DOJ and DOD, to look to the development of dual-use technologies. This was prompted by the recognition of the effect of defense downsizing on the industrial base and the effort to reduce Federal expenditures and by apparent interest within the administration to “reinvent government” by eliminating unnecessary redundancies. In hearings before the House Armed Services Committee’s Subcommittee on Research and Technology that year, the DOD Director of Defense Research and Engineering endorsed establishing joint technology development with DOJ. Also at these hearings, key NIJ and industry officials testified about the value such a partnership might produce. [emphasis EA]\n\nNIJ reorganized in 1994 by elevating its Division of Science and Technology to full office status and establishing a Law Enforcement and Corrections Technology Advisory Council (LECTAC) consisting of 85 representatives from Federal, State and local law enforcement agencies. At that time, LECTAC identified law enforcement technology needs for NIJ and noted that many of these needs were pertinent to the military. [emphasis EA]\n\nMemorandum of Understanding. The clear benefits of this partnership led to the execution of an MOU between DOJ and DOD on April 20, 1994. Highlighting the importance attached to this MOU was its execution by the Attorney General and the Deputy Secretary of Defense and the presence of the VicePresident, the Secretary of the Treasury, and the Director of the Office of National Drug Control Policy at the signing ceremony. This MOU set in motion the development and enactment of the technology program described in Part II of this report.\n\n[Interjection by Elias – Please note that an unlawful merging of the Justice Department and the U.S. Military was enacted at this juncture and was officially presided over by the Vice President as well as representatives of the Treasury Department and the Office of National Drug Control Policy. Also note that this sub-authority grouping of government officials did not include the U.S. Congress. No law was passed in Congress to permit this, the public mind was not advised of this until after the fact and even then only briefly in the back sections of newspapers for a day or two, and therefore no case regarding this merging of two diametrically-opposed civil bodies, DOJ and DOD, would ever involve the Supreme Court, which would undoubtedly have condemned this mischief. They just did it in the same off-hand way that NORTHCOM recently merged the U.S. Northern Command with the Canadian Army. See: http://www.northcom.mil/news/2008/021408.html ]\n\nThe MOU calls for the establishment of an extendable 5-year program in which a JPSG, jointly staffed by DOD and DOJ representatives, manages daily operations and a high-level interagency Senior Review Group sets policy. Members of the JPSG have been drawn from DARPA, NIJ, the FBI, the Bureau of Prisons, and the U.S. Army. The JPSG works at any point along the research, development, and acquisition (RDA) spectrum so that it can support demonstrations of existing technology as well as development of totally new and unique technologies. [EA note: When the report mentions that JPSG works at any point along the research, development, and acquisition spectrum, it created the capability of the military and civil law enforcement communities to interchange equipment, technology, science, and logistics, which explains how SWAT teams dash about sporting amazing militarized toys such as APCs and Sound Weapons etc. Recall, this would officially begin in 1994, because a group of visionaries decided to bypass Congress and the American people to build an infrastructure which would be occupied readily under COG or COOP as what General Tommy Franks dubbed “a military form of government”.]\n\n- End quote from 1997 NCJRS  report. Read the whole thing at above link. -\n\nI have saved this document for many years, just as I also saved that Grave New World speech by Cohen back in 1999. These are the kind of documents which the theater-going average Wal-Mart shoppers and the typical American voter will hardly ever read, but the documents are there for those who care, and the documents mean something. For example, it was in this DARPA document that I first encountered  the term, “OOTW”.\n\nOperations Other Than War.\n\nThat concept is quite a clever innovation for the pursuit of an ever-growing policy which would empower government. Remarkably, that concept came to us on the heels of our victory in the Cold War, and recall: after we won the Cold War, America had no “enemy” left on this planet who could dare attack us.\n\nThis was the case with every major war of the 20th Century – we won WWI, WWII, and the Cold War, and after each victory there was no conceivable enemy left on this earth who could dare threaten us.  After WWI, Wall Street and the City of London built up the Third Reich in Germany across the 1930s, giving us the second World War by 1939. [See Antony C. Sutton’s books at Amazon] After we won WWII, again there was no credible “enemy”, so Stalin, Churchill, and Franklin D. Roosevelt created the United Nations (1945) and then used Yalta to launch a mutually beneficial Cold War which they could milk for another forty years or so.\nMujahideen_1979_CIA\n\nMujahideen_1979_CIA\n\nAnd when America finally won the Cold War 1989-1991, lo and behold our Defense contracting industry was once again faced with the need for an enemy, so our think-tankers came up with a War on Terror which George Bush 43 boasted would last beyond our lifetime.\n\nThat should explain why “Policy” dictates sending massive military incursions into tiny nations to hunt down a handful of “terrorists”, yes? It also explains why, ten years after invading Afghanistan to hunt down Osama bin Laden, and finally, allegedly, killing him and conveniently dumping his body into the great blue sea for the bellies of disinterested fish, the U.S. military is still fighting an escalating war in Afghanistan, yes? But I digress.\n\nuav4tf3_DARPA\n\nuav4tf3_DARPA\n\nThe point is that the U.S. economy is addicted to Defense contracting and spending big time.  We all know it, and 20th Century history now shows it – win a war and save the world, and walah, a new “enemy” magically appears.\n\nWhile it is a stretch to understand how the military can fight a concept employed by surrogates handled  and directed by black-op CIA and other Intel agents, we do admit that “terrorism” is a concept with very real consequences, not the least of which is a tinkering with perceptions in the public mind. That perception is necessary, according to neo-con philosophy as vomited forth by the now dissolved Project For A New American Century…\n\nhttp://en.wikipedia.org/wiki/Project_for_the_New_American_Century\n\n…which suggested to the White House, on page 51 of its 2000 report entitled Rebuilding America’s Defenses …\n\nhttp://www.newamericancentury.org/RebuildingAmericasDefenses.pdf\n\n…the following psy-op need –\n\nFurther, the process of transformation, even if it brings revolutionary change, is likely to be a long one, absent some catastrophic and catalyzing event – like a new Pearl Harbor. Domestic politics and industrial policy will shape the pace and content of transformation as much as the requirements of current missions.\n\nIn exploiting the “revolution in military affairs,” the Pentagon must be driven by the enduring missions for U.S. forces. This process will have two stages: transition, featuring a mix of current and new systems; and true transformation, featuring new systems, organizations and operational concepts. This process must take a competitive approach, with services and joint-service operations competing for new roles and missions. Any successful process of transformation must be linked to the services, which are the  institutions within the Defense Department with the ability and the responsibility for linking budgets and resources to specific missions.\n\n-end quoted passages from page 51 in PNAC document-\n\nAll planners know that if we dry up the Defense contracts to the Defense contracting industry Wall Street’s bubble will pop pronto. See:\n\nhttp://www.jeffersonrivercoalition.com/Report_From_Iron_Mountain_2.htm\n\nIt is surely no exaggeration to say that a condition of general world peace would lead to changes in the social structures of the nations of the world of unparalleled and revolutionary magnitude. The economic impact of general disarmament, to name only the most obvious consequence of peace, would revise the production and distribution patterns of the globe to a degree that would make changes of the past fifty years seem insignificant. Political, sociological, cultural, and ecological changes would be equally far-reaching. What has motivated our study of these contingencies has been the growing sense of thoughtful men in and out of government that the world is totally unprepared to meet the demands of such a situation. [EA: that situation being the occurrence of global peace]\n\n-\n\nSo we see that a War on Terror would be a solution for the Defense contracting corporations which drive Wall Street and the local economies of countless communities around the nation. Peace-keeping forces would engage in very limited police actions such as Korea and Vietnam, Iraq and Afghanistan, and much of the new duties for the military would involve “Operations Other Than War”.\n\nBut an added benefit would be that in a War on Terror, the U.S. military could also be deployed domestically as a charitable and benevolent service to the Department of Justice and its enforcement agencies as well as State-level and local-level law enforcement offices and departments. This scenario would allow for the U.S. Army’s NORTHCOM to engage in OOTW right here in our own country – and as Defense Secretary Cohen pointed out previously, there is a governmental intent to merge the military with civilian law enforcement for purposes of interdicting domestic terrorists.\n\nI did not say that – Cohen did.\n\nTo any Constitutionalist who knows about the Constitution’s references to standing armies, there would be no authority for the standing army to involve itself with police work within any of the several sovereign States. To those who would argue to the contrary, I can pass this along to you from a Constitutional historian named Dr. Edwin Vieira, Jr.  –\n\n“…the doctrine of ‘emergency powers’ runs afoul of America’s Constitution in particular. Anyone who bothers to read the Constitution will see that it:\n\n1- Delegates to the General Government as a whole – or to Congress, the President, or the Supreme Court separately – no ‘emergency powers’ under that rubric;\n\n2- Delegates neither powers that only an ‘emergency’ can call into existence, nor powers that may be exercised only in an ‘emergency’;\n\n3- Delegates no power even to  declare that an ‘emergency’ exists; and perhaps most decisively of all,\n\n4- Does not even employ the word ‘emergency’, let alone define it as a legal principle relevant to any part of the ‘supreme Law of the Land’.\n\nThus, constitutionally speaking, “emergency” has neither place nor meaning and therefore by itself cannot serve as the justification for or measure of any power whatsoever.\n\nEven the Supreme Court has recognized, as a fundamental constitutional principle, that: “…emergency does not create power. Emergency does not increase granted power or remove or diminish the restrictions upon power granted or reserved. The Constitution was adopted in a period of grave emergency. Its grants of power to the Federal Government and its limitations of the power of the States were determined in the light of emergency and they are not altered by emergency”. (HB&LA v Blaisdell, 290 U.S. 398, 425; 1934)\n\n-          End quoted passage from Dr. Vieira’s Constitutional “Homeland Security”. [1]\n\nSo we now see that back in the 1990s we had a Federal government with agencies eager to assimilate their powers into an interfaced network which could be employed by government authority – in emergency situations – to keep the peace in our communities, towns, and cities nationwide. The military would see this as OOTW.\n\nNot clear yet on OOTW? Here is an example –\n\nhttp://www.msnbc.msn.com/id/41258569/ns/us_news-life/t/million-mock-city-rises-marine-base/\n\nFrom that page – “A mock city roughly the size of downtown San Diego has risen in a remote Southern California desert to train military forces to fight in urban environments. The $170 million urban training center was unveiled Tuesday at the Twentynine Palms military base, 170 miles northeast of San Diego… Seven separate mock city districts spread across 274 acres of desert. The fake markets, hotels and other businesses are complete with actors who create scenarios that pose a full range of challenges from humanitarian relief efforts to peacekeeping to police work and direct combat, according to the Marine Corps.”\n\nAnd there it is. Humanitarian relief efforts, peacekeeping, and police work. Those are three sorts of OOTW.\n\nLet’s quickly sum up. We have seen here that the military is interested in interface with law enforcement at the State, County, and local levels. We have seen that local law enforcement everywhere is vying for local SWAT teams, search and rescue teams, first responder teams, and intelligence gathering by law enforcement on behalf of the DHS. We have seen a bit about the Fusion Centers operated by DHS, and we know that DHS also interfaces with the Pentagon as well as with the Department of Justice, FEMA, the various Port Authorities, the Secret Service, the U.S. Treasury, the NSA and NSC, and all sorts of other fancy agencies wielding Federal power like a wand over the lives of the mesmerized American people.\n\nAll of this represents a philosophy of statist authoritarianism. It is a mindset frequently alluded to as a neo-con mindset. It is the ruthless and bullheaded approach to governing an unwilling population. It is force, and as we shall see, it employs remarkable psychological operations involving the media and press and entertainment industry. In part three, coming right up, we’ll look further into the military-police interface and the ADL / DHS / SPLC trinity of tyranny, which will bring yet more clearly to the surface and make more readily seen and comprehended the reality of an unequivocal and unambiguous chain of responsibility, authority and accountability. Finally, we will see how that chain of command can transform well-intended men and women from our communities and ultimately send a SWAT team to anyone’s house to kick down one’s door and shoot one dead in one’s own home over a weed which grows wild in Nature, while one’s wife and child hide in terrified confusion and unspeakable horror.\n\n1- To order Dr. Vieira’s Constitutional Homeland Security Order your copy directly from Dr. Vieira: $19.95 postpaid, by check or money order to\n\nEdwin Vieira * 52 Stonegate Court * Front Royal, Virginia 22630\n\nConstitutional “Homeland Security”: Volume 1: The Nation In Arms by Dr. Edwin Vieira, Jr.; copyright 2007 by Edwin Vieira, Jr.; Bookmasters, Inc., 30 Amberwood Parkway, Ashland, Ohio 44805; International Standard Book Number (10): 0-9671759-2-5; International Standard Book Number (13): 978-0-9671759-2-8.\n\nElias Alias for Oath Keepers\n\n-\n\nPart 1: http://oathkeepers.org/oath/2011/05/16/an-empire-strikes-home-_-part-one/\n", "group_id": 3920, "id": 1524055}]