[{"user_id": 3543, "stars": [{"date_created": 1300329445.0773981, "user_id": 21980}], "topic_id": 13412, "date_created": 1300309718.7804749, "message": "O que vamos provavelmente candidatar-nos e também será muito relevante para todos é o SIFIDE - http://sifide.adi.pt - onde a ideia é que custos afectos a projectos que envolvam I&D podem ser parcialmente abatidos na taxa de IRC - mesmo que não tenham IRC naquele ano, ficam com o saldo a favor durante aquele ano + 5. Estou a fazer a candidatura através de uma empresa especializada nisto. Alguém tem experiência/opiniões sobre isto?", "group_id": 6883, "id": 369482}, {"user_id": 3543, "stars": [], "topic_id": 13412, "date_created": 1300309509.1869099, "message": "Concordo com a aquela que parece ser a opinião generalizada por cá: de que o QREN e outros programas de investimentos mais ou menos governamentais não são grande coisa, seja pela sua complexidade da candidatura/pouca transparência na atribuição/demasiados compromissos focados no controle excessivo", "group_id": 6883, "id": 369466}, {"user_id": 3543, "stars": [], "topic_id": 13412, "date_created": 1300309623.8025119, "message": "Na Quodis temos um incentivo fiscal em curso, e outro em vias de passar a candidatura. Já que pagamos sempre os impostos devidos, melhor ainda haver incentivos para quem se porta bem :) Temos um incentivo da Segurança Social: trabalhadores sem termo que estejam no seu primeiro contrato podem ficar isentos da contribuição de segurança social da empresa por um período de até 36 meses. Não sei se ainda está activo (ouvi dizer que fecharam a torneira temporariamente), mas aconselho vivamente, falem com os vossos contabilistas.", "group_id": 6883, "id": 369481}, {"user_id": 21929, "stars": [], "topic_id": 13412, "date_created": 1300315089.0595081, "message": "Conheço este que saiu este mês http://www.governo.gov.pt/pt/GC18/Governo/ConselhoMinistros/ComunicadosCM/Pages/20110310.aspx", "group_id": 6883, "id": 369832}, {"user_id": 21931, "stars": [], "topic_id": 13412, "date_created": 1301740188.7698629, "message": "@lxvr, portanto esse programa do sifide permite-te criar um tax shield para lucros futuros, é isso?", "group_id": 6883, "id": 508038}, {"user_id": 3543, "stars": [], "topic_id": 13412, "date_created": 1301828140.3135791, "message": "@Detig actuais e futuros (até 5 anos), sim", "group_id": 6883, "id": 513774}]