[{"user_id": 11626, "stars": [], "topic_id": 43562, "date_created": 1312966470.0792871, "message": "When Should You Shoot A Patriot?\nSoCal Martial Law Alerts\nAugust 9, 2011\n\nThey say that turn-about is fair play and so we shall now consider the flip side of the firestorm sparked by a patriot \"Liking\" a Facebook post which linked to an article entitled: When Should You Shoot A Cop?\n\nBut first a word from our sponsors:\n\n\"Frankly, I think the Sheriff of Kershaw County is a coward and a hypocrite. What he and his underlings do, day after day, is go around with guns, using violence and the threat of violence, to control, rob, kidnap or kill people. That's what 'law enforcement' is all about: forcibly imposing the will of the politicians upon everyone else. To spend day after day acting as a mercenary and hired thug of politicians, and then to have a tantrum because some people were having an abstract philosophical conversation about the possibility of resisting unjust aggression committed by cops, is cowardly in the extreme. On top of that, to ignore repeated invitations to have a polite, open discussion about things (as the Sheriff has done in this case), in favor of preparing for mortal combat, is the sign of a bully and a coward.\" — Larken Rose, CopBlock.org contributor and author of When Should You Shoot A Cop?\n\n\"Thanks to a recent article by Joseph Farah... the surge in the number of armed Federal bureaucrats has been brought to our attention. Farah points out that in 1996 alone, at least 2,439 new Federal cops were authorized to carry firearms. That takes the total up to nearly 60,000.... Force and intimidation are the tools of tyrants. Intimidation with government guns, the threat of imprisonment, and the fear of harassment by government agents puts fear into the hearts of millions of Americans.... Even though the average IRS agent does not carry a gun, the threat of incarceration and seizure of property is backed up by many guns. All government power is ultimately gun power and serves the interests of those who despise or do not comprehend the principles of liberty. The gun in the hands of law-abiding citizens serves to hold in check arrogant and aggressive government. Guns in the hands of the bureaucrats do the opposite. The founders of this country fully understood this fact.\" — Congressman and 2012 Presidential candidate Ron Paul (R-TX), who was recently conflated with domestic terrorists in a Missouri fusion center report (a fusion center which operates under the auspices of the Department of Homeland Security [DHS] and the Department of Justice)\n\nAnd now back to our irregularly-scheduled program.\n\nOur (real-life) cast of characters include:\n\nLarken Rose, author of the now infamous article: When Should You Shoot A Cop?\n\nMarlene Motley, Kershaw County Patriot who posted the article to Facebook\n\nJeff Mattox, Kershaw County Patriot and (former) Kershaw County Republican Party Co-Chairman who \"Liked\" the article\n\nJim Matthews, Kershaw County Sheriff who publicly objected to the \"Liking\" of the article\n\nSouth Carolina Fusion Center, domestic intelligence agency which ever lurks in the shadows\n\nIn our last episode of: \"The Little Patriot That Liked,\" you will recall that:\n\n    * Sheriff Matthews alerted the media to his displeasure with the shocking act of \"Liking\" and placed his deputies on high alert;\n    * Patriot Mattox was asked to resign from his GOP Co-Chair position due to the \"Liking\" incident and he, in turn, called for various resignations of which Sheriff Matthews was one;\n    * Author Rose issued a challenge to Sheriff Matthews to publicly debate the philosophical underpinnings of the article that he wrote.\n\n\nAnd the Fusion Center ever lurks.\n\nIn the interim, we've had the following developments:\n\n    * Patriot Mattox was voted out of his GOP Co-Chairmanship;\n    * Angry callers shut down the phone lines of the Kershaw County Sheriff's Department for 45 minutes prompting an investigation and threats of prosecution;\n    * Patriot Mattox and his compatriots received death threats and threats of harm from various sources;\n    * Author Rose's friendly invitation to debate has gone completely ignored by Sheriff Matthews.\n\n\nAnd the Fusion Center ever lurks.\n\nSo let us now recall that the article which prompted this whole firestorm — When Should You Shoot A Cop? — was an examination of the question of whether, or not, populations  should defend themselves against tyrannical regimes when left with no other option.\n\nWhich begs the equal and opposite question: When Should You Shoot A Patriot?\n\nOr, as Patriot Motley so succinctly put it: \"I bet [Sheriff] Matthews would not have a problem picking up a police journal that had an article entitled 'When Should You Shoot A Civilian.'\"\n\n(We should perhaps point out here that, although Sheriffs' departments in general have become highly militarized over the years, they are not military and therefore We The People are not \"civilians.\" But no matter. Let us not quibble over words when we have more important things to consider.)\n\nSheriff Matthews has stated that \"warped individuals\" might read an article such as the one Author Rose wrote and take it as a cue that it's OK to shoot police. Sheriff Matthews also said that Author Rose's article was \"irresponsible\" and \"hateful\" and then placed his deputies on high alert ... under the presumption that every unbalanced individual in his county is about to read Author Rose's treatise and \"snap.\"\n\nBefore we continue, let us not forget that all this much-ado-about-nothing — the media hysteria, the police on high alert, the GOP circling their little red wagons — was all triggered by one man, Patriot Mattox, who clicked \"Like\" on Facebook. He did not write the article, he did not promote it — he merely read it, \"Liked\" it and moved on.\n\nSo now that Sheriff Matthews' rhetoric has everyone with a badge and an overabundance of firepower shaking in their body armor — looking for \"ultra rightwing ... extremists\" behind every tree and at every traffic stop — let us now consider what it might take for all these itchy trigger fingers to get a little \"happy.\"\n\nIs it when a patriot such as Mattox joins a political group like the 912 Project?\n\nIs it when a patriot such as Mattox helps create a political action group such as Kershaw County Patriots?\n\nIs it when a patriot such as Mattox is elected to serve the local Republican Party and a \"co-chair\" position is created on his behalf so that \"Tea Party patriots\" would have a voice?\n\nIs it when a patriot such as Mattox shows up at City Council on the very day of Sheriff Matthews' inauguration and questions the militarization of his department and the constitutionality of conducting internal checkpoints which target his own constituents?\n\nIs it when a patriot such as Mattox encourages locals to challenge the constitutionality of traffic tickets written for the mere purpose of generating revenue and especially when they violate all the principles of due process?\n\nOr is it when a patriot such as Mattox clicks \"Like\" on an article that encourages people to consider when and if they would ever stand up to state-sponsored tyranny — tyranny that enslaves and kills people with the power of state-sponsored guns?\n\nThe First Amendment.\n\nFreedom of speech.\n\nPeaceful political action.\n\nIs that all it takes to put a department full of state-sponsored guns on high alert?\n\n\"Unfortunately,\" said Author Rose, \"more often than not, cops are the ones committing forcible aggression against innocent people, and any who try to stop them — even by using passive resistance or non-violent civil disobedience — are usually assaulted and caged, or killed.\"\n\nThat said, does Patriot Mattox take the death threats and threats of harm seriously?\n\n\"Yes, I do,\" Mattox said. \"I've been watching a lot of these Homeland Security briefs that've been coming out and, of course, Mr. Matthews is 30 years DEA and trained military and FBI and all. So he's used to command and control. When something comes down from the heirarchy he believes it to be gospel. I think this is where it's coming from. He considers regular, average citizens a threat.\"\n\nAnd the Fusion Center ever lurks.\n\nWhen Patriot Mattox speaks of \"Homeland Security briefs,\" he is, of course, referring to documents such as, \"Rightwing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment,\" which DHS regularly distributes to domestic intelligence centers such as the South Carolina Fusion Center.\n\nThese \"briefs\" speak of \"rightwing terrorists\" and \"hate-oriented\" groups which \"favor ... state or local authority.\" In other words, what you believe about the proper role of government makes you a hateful, rightwing terrorist in the eyes of the DHS. Thinking has become evidence of crime and/or pre-crime.\n\nPlease note: Sheriff Matthews' Department is within the South Carolina Fusion Center's jurisdiction.\n\n\"If anyone has been extreme it is [Sheriff Matthews],\" said Patriot Motley. \"Did he really need the extremist vote to get elected? He came to the [Kershaw County Patriot] meetings regularly until after he was elected.\"\n\n\"Whether it was Matthews intention, or not, he managed to put fear in the people of the group and several would not come to the last meeting because they were afraid of being arrested just for being there. One member was asked by friends to remove them from his e-mail list. A couple even talked of changing the group name... He has terrorized people who for the most part aren’t even on the [Facebook] page. Yet he calls us hateful and irresponsible.\"\n\nAnd the Fusion Center ever lurks.\n\nFusion centers have been known to infiltrate local activist groups, as was the case with the Olympia Port Militarization Resistance, an antiwar group located in Washington state and Wikileaks.org released a document showing that domestic \"Army Fusion Cells\" coordinate with local law enforcement to collect information on local activists.\n\nAuthor Rose has said that his offer to debate Sheriff Matthews in a friendly and reciprocal manner is still open, but he doubts the Sheriff will ever take him up on it:\n\n\"It's far easier to try to paint me, and Mr. Mattox, and anyone else who ever questions 'authority,' as nasty, dangerous, irresponsible, hateful extremists who must be destroyed at all costs. As I've said before, I would rather exchange words than bullets any day. So far it seems that the same is not true of the Sheriff of Kershaw County.\"\n\nAnd so ends this episode of: \"The Little Patriot That Liked.\" Stay tuned for more entertaining and edifying details on what should have been, at the very most, a non-issue.\n\nLINKS:\n\nA Federal Police Force Is Unconstitutional: A Speech by Rep. Ron Paul (R-TX), House of Representatives\nhttp://www.ncc-1776.org/tle1997/le971225-11.html\n\nClinton's militarization of the government\nhttp://www.comeandtakeit.com/natlcops.html\n\nSecret State Police Report: Ron Paul, Bob Barr, Chuck Baldwin, Libertarians are Terrorists\nhttp://www.infowars.com/secret-state-police-report-ron-paul-bob-barr-chuck-baldwin-libertarians-are-terrorists\n\nIntelligence Fusion Centers\nhttp://publicintelligence.net/intelligence-fusion-centers\n\nWhen Should You Shoot A Cop\nhttp://www.copblock.org/5475/when-should-you-shoot-a-cop\n\nKershaw County Patriots Facebook page\nhttp://www.facebook.com/groups/kcpatriots\n\nSheriff, chiefs warn officers after Web post\nhttp://www.chronicle-independent.com/archives/7817\n\nSouth Carolina Fusion Center (Component of the South Carolina Law Enforcement Division)\nhttp://www.sled.sc.gov/SCIICContact.aspx?MenuID=ContactInformation\n\nGOP leader asked to resign after discussing \"when to shoot a cop\"\nhttp://www.wistv.com/story/15152529/gop-leader-asked-to-resign-after-discussing-when-to-shoot-a-cop\n\nSheriff, Police on High Alert After GOP Chair \"Likes\" Anti-Tyranny Article on Facebook\nhttp://stuffedsuits.com/news/sc-politics/695-sheriff-police-on-high-alert-after-like-facebook\n\nInvestigators: \"Extremist\" group shuts down phone lines at sheriff's office\n﻿http://www.wistv.com/story/15176906/extremist-group-shuts-down-phone-lines-at-sheriffs-office﻿\n\nReports of Death Threats Against Jeff Mattox\nhttp://stuffedsuits.com/news/sc-politics/698-death-threats-against-jeff-mattox\n\nWho Is The Extremist?\nhttp://marlenemotley.wordpress.com/2011/08/02/who-is-the-extremist\n\nRightwing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment\nhttp://www.scribd.com/doc/24840936/H-R-404-Rightwing-Extremism\n\nSpying on anti-war protesters: US Army Concept of Operations for Police Intelligence Operations\nhttp://www.wikileaks.org/wiki/Spying_on_anti-war_protesters:_US_Army_Concept_of_Operations_for_Police_Intelligence_Operations%2C_4_Mar_2009", "group_id": 3920, "id": 1838240}]