[{"user_id": 11626, "stars": [], "topic_id": 6294, "date_created": 1297839506.960808, "message": "Former U.S. Pacific Command Chief Adm. Tim Keating (ret.) reiterated what we’ve been hearing from U.S. defense officials for a while now regarding China: The question isn’t what type of military technology is the Asian giant developing, it’s what will it do with all that firepower?\r\n\r\n“We kinda have a pretty good feel for what they’re fielding” in terms of weapons, said Keating during a talk on missile defense at the Heritage Foundation here in Washington. For example, the U.S. has known about weapons like the J-20 stealth jet for a while now, according tot the former admiral.\r\n\r\n“It wasn’t a surprise, we knew about it the whole time,” said Keating. “We were hardly surprised by this airplane rolling out.”\r\n\r\nThe real question is, how does China plan to use new weapons such as stealth jets and aircraft carriers that appear to be designed to project power and counter Western technology?\r\n\r\n“What does China really intend to do with their more muscular military posture and undoubtedly increasing military capability?” asked Keating. “When I asked Chinese counterparts [this question], the theme they expressed generally was, we only want to protect that which is ours; fair enough.”\r\n\r\nThe problem is, China has so far failed to reveal what exactly it means when it says it’s only interested in “protecting that which is ours.”\r\n\r\nKeating acknowledged that on the surface, such a statement is legit for any global power that must keep trade and shipping lanes open for it to prosper. However, an anecdote he shared with the audience may provide some insight into what PLA officials are thinking:\r\n\r\n    I had a conversation while at Pacific Command with a Chinese admiral during one of my visits to China. In this conversation he proposed the following. He said: ‘You know, we, China are going to build aircraft carriers, we’re already doing it. and what we propose is; you take Hawaii-east, from the United States to Hawaii and you keep your carriers and your ships there and take care of everything that happens there. We’ll take Hawaii-west through the Indian Ocean with our aircraft carriers and our ships and anything that happens there, we’ll let you know, but we’ll take care of it. I declined his offer.\r\n\r\nHe later added, “it’s the intention, what do they want to do with these things beyond ‘that which is ours’?”\r\n\r\nIt looks like China hopes to be the regional hegemon. What this means for U.S. interests there remains to be seen. How will Beijing react to a U.S. that has no plan of giving up its heavy presence in the region? Will China simply work to keep trade routes open in the region and respond to disasters with its new military might or does it want something more?\r\n\r\nhttp://defensetech.org/2011/02/10/former-pacom-chief-how-will-china-use-its-new-weapons", "group_id": 3920, "id": 118065}]