[{"user_id": 14402, "stars": [], "topic_id": 39659, "date_created": 1308334308.5475609, "message": "Right now I'm looking at code hosting and was wondering the pros and cons or any other thoughts and opinions on deploying. I've narrowed it down to Github and Springloops or Beanstalk. The major thing is deployment.", "group_id": 106, "id": 1421205}, {"user_id": 4149, "stars": [], "topic_id": 39659, "date_created": 1308341040.543514, "message": "Git is version control, so if you don't need version control then don't use it, A pro of git is that you always have a local copy of all the branches and versions so if you lose a connection to a central repo, you can just make your local copy the repo second a git push is putting your commits and syncing them with a central repo to allow others to pull and work on, but a pull request is a change that outside people have made and want the owners of the repo to check out. so it depends i love git for version control but if you don't need that then look for a place to host your code", "group_id": 106, "id": 1422165}, {"user_id": 21274, "stars": [], "topic_id": 39659, "date_created": 1308518172.4067171, "message": "I use https://github.com/scttnlsn/dandelion to deploy Git repositories via FTP/SFTP", "group_id": 106, "id": 1433401}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308548180.5445919, "message": "You don't want to be in a situation where you need to push a critical security fix, but github is down.", "group_id": 106, "id": 1436082}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308548165.7006691, "message": "friendly tip: *don't* rely on github, springloops, or any other service to deploy your code.", "group_id": 106, "id": 1436078}, {"user_id": 4149, "stars": [], "topic_id": 39659, "date_created": 1308550370.5077901, "message": "@justinlilly i have never had a problem where i need to get a critical security fix out to a community and github downtime was a factor, and if that is a problem that is why git is the best choice since you would commit to a dev server on a non-public facing server with a mirror of the repo and it will push as soon as github is back up", "group_id": 106, "id": 1436215}, {"user_id": 28370, "stars": [{"date_created": 1308608239.4427559, "user_id": 4149}, {"date_created": 1308689062.2105131, "user_id": 22109}], "topic_id": 39659, "date_created": 1308557790.222913, "message": "No need for FTP, just push over SSH... http://ozmm.org/posts/when_github_goes_down.html", "group_id": 106, "id": 1436826}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308633025.6442101, "message": "When github was less stable, you'd hear people yelling about how they couldn't deploy b/c github was down.", "group_id": 106, "id": 1445743}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308633008.2879901, "message": "@italiano40 Sure. If you're willing to allow github downtime affect your deployment then that's fine. Just something to be aware of.", "group_id": 106, "id": 1445741}, {"user_id": 4149, "stars": [], "topic_id": 39659, "date_created": 1308633393.764504, "message": "@justinlilly but there downtime has never affected me usually if there site is down the GIT repo's are still acessed thru the git program so i not seeing how github downtime should even factor in and if it did, it is easily solvable", "group_id": 106, "id": 1445781}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308633050.4008019, "message": "Just when you write your git deploy scripts, allow them to take the repo endpoint as an argument :)", "group_id": 106, "id": 1445750}, {"user_id": 218, "stars": [], "topic_id": 39659, "date_created": 1308634235.7809939, "message": "right, but assuming you're using github as the datastore for you code, then pulling from there when its down is impossible. That said, yes.. easily solveable, but better to plan for than not. Sounds like you're on the right track :)", "group_id": 106, "id": 1445908}, {"user_id": 4149, "stars": [], "topic_id": 39659, "date_created": 1308639692.952868, "message": "@justinlilly not true, if you know the url then you can use git pull from there git server which is usually up during there site downtime, but most developers using a simple git command they can turn there local copy into a full server repo and that is why git is the only version control i would ever use and you have as many backups as many developers working on the project", "group_id": 106, "id": 1446294}, {"user_id": 5778, "stars": [], "topic_id": 39659, "date_created": 1308894832.017318, "message": ":s/there/their/g", "group_id": 106, "id": 1474732}]