[{"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302725603.307955, "message": "http://www.bottleneck.dotcloud.com", "group_id": 95, "id": 670999}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302725628.5638011, "message": "What do you think?", "group_id": 95, "id": 671011}, {"user_id": 4149, "stars": [], "topic_id": 19282, "date_created": 1302726277.473947, "message": "Ok first off make a new video it should be short and sweet, second get a designer and third this would probably should have a desktop application tied with it who wants another window open and even better if your targeting program write plugins so then it would auto select the things for the user, this needs a lot of work but a decent idea behind it", "group_id": 95, "id": 671213}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302728685.1577301, "message": "2)  Yeah, I'd be interested in talking with a designer, but have no money.  I agree that the design sucks.  Will improve it one way or another.", "group_id": 95, "id": 671836}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302728762.390604, "message": "3)  Wouldn't a desktop app be \"another window\"?   One thing you can do in chrome is go wrench -> tools -> create application shortcuts...  Then you kind of get a desktop app.   Don't understand what you mean by \"write plugins\" to \"auto select things\".", "group_id": 95, "id": 671846}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302728839.482002, "message": "Agree it needs a lot of work...  it's definitely mvp (or almost mvp :)", "group_id": 95, "id": 671857}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302728655.7992699, "message": "1) yeah, I'll make another video", "group_id": 95, "id": 671833}, {"user_id": 5369, "stars": [], "topic_id": 19282, "date_created": 1302730383.257998, "message": "So I don't have speakers or headphones with me at the moment to watch the video and I have no idea what this is or what it does. Might be worthwhile to put a short (like < 200 words) description of what's going on.", "group_id": 95, "id": 672354}, {"user_id": 4149, "stars": [], "topic_id": 19282, "date_created": 1302730984.1267619, "message": "@jca ok for a designer i am sure you can snoop around and find a person that just wants to do something for fun or something\n\nmaybe desktop wasn't the correct wording but a plugin for like eclipse that does that selecting for you, since i would just be moving around and completely forget to deselect and select another item from the workflow so experiment with that", "group_id": 95, "id": 672453}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302732458.583214, "message": "@rfunduk I added a few words to the splash page", "group_id": 95, "id": 672738}, {"user_id": 8327, "stars": [], "topic_id": 19282, "date_created": 1302732424.7598801, "message": "It'd be nice to have some sort of analyse button to click at the end of the day to give you a summary, maybe list the top 5 longest tasks or subtasks as the current interface could be a pain to manually look over and get a good impression at the end of busy day", "group_id": 95, "id": 672726}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302732795.789865, "message": "@undefined Yeah, that's a good idea. I'll add that.", "group_id": 95, "id": 672789}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302733585.900378, "message": "Definitely an interesting idea.  I'll keep it in mind.", "group_id": 95, "id": 672985}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302732667.50109, "message": "@italiano40 heh, finding someone who would work for fun would be nice, but somehow I doubt I'm gonna find that :)  we'll see...  I see what you're saying about an Eclipse plugin or some such...  would be pretty hard to automatically figure out which task is supposed to be selected.  I'll think about it.", "group_id": 95, "id": 672775}, {"user_id": 842, "stars": [], "topic_id": 19282, "date_created": 1302732852.04668, "message": "@mal  er... that was to you, not \"undefined\"", "group_id": 95, "id": 672797}, {"user_id": 4149, "stars": [], "topic_id": 19282, "date_created": 1302733162.445539, "message": "@jca actually if you supply like a syntax or even better like follow a UML syntax it shouldn't be that hard so like a message could be like \"testMethod: int fix bug\" i could figure out that if i am working in the testMethod that returns an int i am probably fixing that bug just an idea", "group_id": 95, "id": 672858}]