[{"user_id": 34385, "stars": [], "topic_id": 39322, "date_created": 1308060458.378094, "message": "I think there are many options for Sass and Compass users and grid frameworks. Just wanted to start some conversation around this here so other can share what they use and why.", "group_id": 10556, "id": 1391265}, {"user_id": 36025, "stars": [], "topic_id": 39322, "date_created": 1308109580.8747051, "message": "I'd think the Less CSS framework would be a natural fit", "group_id": 10556, "id": 1397437}, {"user_id": 35946, "stars": [], "topic_id": 39322, "date_created": 1308111775.086601, "message": "@dangayle https://github.com/idangazit/compass-less-plugin", "group_id": 10556, "id": 1397685}, {"user_id": 29081, "stars": [], "topic_id": 39322, "date_created": 1308138037.00138, "message": "I don't use a grid framework. Beyond getting past the outer container and sidebar(s) I've never seen the point at all. The outer container is something I prefer to code up with variables so it's easy to adjust, but abstracting that into plugin doesn't appeal to me. 1. Because I lose flexibility, and have to define a grid which I'll hardly use. 2. Because learning how the outer frame is styled is part of my job and I want to understand it, not hand it off. 3. It isn't very hard.", "group_id": 10556, "id": 1399771}, {"user_id": 10783, "stars": [], "topic_id": 39322, "date_created": 1308235946.26789, "message": "I've used the built-in Blueprint grid framework, then moved onto 960.gs.  Next, I'll probably be checking out Susy [http://susy.oddbird.net/] as it seems like it might be a good fit for doing responsive layouts.", "group_id": 10556, "id": 1410842}, {"user_id": 35498, "stars": [], "topic_id": 39322, "date_created": 1309046532.6428211, "message": "I have used blueprint and susy. I prefer susy, no real reason other than it just seems a lot simpler to me. It seems to be able to handle a fair amount of abuse and overrides when you need to break the grid. Also it just feels a lot lighter than blueprint, especially when you already have all of compass in your back pocket.", "group_id": 10556, "id": 1486374}]