[{"user_id": 11626, "stars": [], "topic_id": 6792, "date_created": 1297925077.423033, "message": "'Thousands' of protesters may have been tortured: report\r\n\r\nEgypt's secret police, long accused of torturing suspects and intimidating political opponents of President Hosni Mubarak, received training at the FBI's facility in Quantico, Virginia, even as US diplomats compiled allegations of brutality against them, according to US State Department cables released by WikiLeaks.\r\n\r\nOne cable, dated November 2007 and published by the Telegraph, describes a meeting between the head of the SSIS, Egypt's secret police, and FBI deputy director John Pistole, in which the secret police chief praises Pistole for the \"excellent and strong\" cooperation between the two agencies. (Pistole has since been appointed head of the TSA.)\r\n\r\nSSIS chief Abdul Rahman said the FBI's training sessions at Quantico were of \"great benefit\" to his agency. The cables did not address what sort of training Egyptian secret police received at Quantico, or how many officers were trained there.\r\n\r\nIn another cable, dated October 2009, a US diplomat reported on allegations from \"credible human rights lawyers\" that the SSIS was behind the torture of terrorism suspects held in Egyptian jails.\r\n\r\nMembers of a Hezbollah cell arrested in 2008 were tortured \"with electric shocks and sleep deprivation to reduce them to a 'zombie state',\" the cable stated. The lawyers \"asserted that 'this kind of torture' is different from what [name redacted] normally sees, and speculated that a special branch of Interior Ministry State Security (SSIS) could be directing the torture.\"\r\n\r\nThe history of torture allegations against the SSIS reaches back decades, but allegations have grown since the war on terror was launched after 9/11. In a 2007 report, Amnesty International accused the Egyptian government of turning the country into a \"torture center\" for war on terror suspects.\r\n\r\n\"We are now uncovering evidence of Egypt being a destination of choice for third-party or contracted-out torture in the 'war on terror',\" Amnesty's Kate Allen said at the time.\r\n\r\nThe Egyptian government acknowledged in 2005 that the US had transferred 60 to 70 detainees to Egypt since 2001.\r\n\r\n'THOUSANDS' MAY HAVE BEEN TORTURED AMID PROTESTS: REPORT\r\n\r\nThe latest accusations of torture coming out of Egypt focus not on the SSIS, but on the Egyptian army, which in the early days of the Egyptian protests was lauded for taking a hands-off approach and not attempting to suppress the demonstrations.\r\n\r\nAccording to the Guardian, witnesses reported \"extensive beatings and other abuses at the hands of the military in what appears to be an organized campaign of intimidation.\"\r\n\r\n    Egyptian human rights groups say families are desperately searching for missing relatives who have disappeared into army custody. Some of the detainees have been held inside the renowned Museum of Egyptian Antiquities on the edge of Tahrir Square. Those released have given graphic accounts of physical abuse by soldiers who accused them of acting for foreign powers, including Hamas and Israel.\r\n\r\n    Among those detained have been human rights activists, lawyers and journalists, but most have been released. However, Hossam Bahgat, director of the Egyptian Initiative for Personal Rights in Cairo, said hundreds, and possibly thousands, of ordinary people had \"disappeared\" into military custody across the country for no more than carrying a political flyer, attending the demonstrations or even the way they look. Many were still missing.\r\n\r\nhttp://www.rawstory.com/rs/2011/02/09/cables-fbi-trained-egypt-torturers", "group_id": 3920, "id": 129702}]