[{"user_id": 11626, "stars": [], "topic_id": 6673, "date_created": 1297904862.643482, "message": "Members of the RAF's 51 Squadron have completed their first week of training with the US Air Force on the Rivet Joint aircraft, designed for airborne intelligence-gathering.\r\n\r\nUp to four UK crews will deploy from summer 2011 with their US colleagues on combined operations worldwide, including Afghanistan.\r\n\r\nPilots, navigators and electronic warfare officers, in addition to intelligence operators and airborne maintenance technicians, are amongst those being trained on the aircraft at Offutt Air Force Base, Nebraska.\r\n\r\nThis co-manning arrangement gives the UK access to this highly effective means of gathering intelligence - replacing that provided by the UK's Nimrod R1, which retires in March 2011 - as well as preparing crews to operate the UK's own three Rivet Joint aircraft, which are due to enter service in 2014.\r\n\r\nWing Commander Garry Crosby will be Officer Commanding 51 Squadron when he completes his training at Offutt Air Force Base. He said:\r\n\r\n\"Co-manning is vitally important to the RAF; it allows us to train and operate Rivet Joint with the US Air Force ahead of our formal acquisition of the aircraft.\r\n\r\n\"The first group of 51 Squadron personnel are the pioneers and face a demanding period of training on Rivet Joint. I am proud to be one of them. We are looking forward to our first training missions on Rivet Joint and setting our sights on future operational success together.\"\r\n\r\nTraining will take between three and five months depending on specific crew positions. Once this is complete, the RAF aircrew members will return to the UK and be attached to the 55th Wing's 343rd Reconnaissance Squadron.\r\n\r\nThis unique opportunity allows RAF personnel to benefit from the US Air Force's experience of the aircraft, whilst bringing high levels of combat experience and specialised knowledge to share with their US colleagues.\r\n\r\nhttp://www.spacewar.com/reports/RAF_Begin_Training_With_US_On_Intelligence_Aircraft_999.html", "group_id": 3920, "id": 127795}]