[{"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1299871956.1868391, "message": "Here's a good lecture by Thomas Metzinger: http://www.youtube.com/watch?v=mthDxnFXs9k. He has also written a sort of landmark book about the subject. Metzinger basically says that the self isn't an illusion, because there is no one having the illusion in the first place. He makes a pretty convincing case for it. Do you agree, and what would be the implications, if his theory was assumed true?", "group_id": 175, "id": 325919}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1299873272.2017879, "message": "I sort of agree with Metzinger's ideas. I'm sure there can't either be a 'philosophical zombie', or we can all assumed to be such zombies. Because in order to be convincing, the zombie would have to talk about his / her phenomenal self and first-person perspective, the feeling of existing, just like a non-zombie does. So if there was such a zombie, it would just mean that either the experience (mine as well) can be explained purely physically, or the zombie isn't actually a zombie. But the whole idea of the thought experiment is to construct a zombie, that is purely automatic, physical thing that mimics a human perfectly, so if such a thing was actually a non-zombie, it would only serve to prove physicalism.", "group_id": 175, "id": 326215}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1299874093.2403059, "message": "However, I think the physical world is a lot weirder and amazing than physics currently or ever knows, so physicalism or Metzinger's theory doesn't rule out consciousness that has a lot of power to affect its surroundings, or that anyone's consciousness and mind could be modeled and accurate predictions made based on it. Most religions have a problem with Metzinger's theory, but some schools of buddhism might not. They consider consciousness  to be just sort of a flame, with no memory, personality or will of its own.", "group_id": 175, "id": 326313}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1299888870.4099381, "message": "^ Oops, I should have of course said \"doesn't rule out consciousness that has a lot of power to affect its surroundings, or MEAN that anyone's consciousness and mind could be modeled and accurate predictions made based on it\" Instead of: \"doesn't rule out consciousness that has a lot of power to affect its surroundings, or that anyone's consciousness and mind could be modeled and accurate predictions made based on it.\"", "group_id": 175, "id": 329010}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1300051360.6382351, "message": "So, the instance of you, who got \"teleported\", would indeed feel exactly like he / she had been teleported around, feeling a continuous experience. He would know nothing of the detonation at either location. But the original instance, that is, you, will still be detonated, so you can feel a continuum from this moment to that. The main question is, do you think you would feel a continuous experience from this moment to beyond the moment you return to earth (if you decide to return)?", "group_id": 175, "id": 343665}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1300051000.1494091, "message": "Thought experiment: You are given a chance to visit some earth-like world a thousand light-years away. Assume it is perfectly safe and you can return whenever you like. But there is a catch: the only way to get there is by first 'scanning' your body and all the electric and magnetic fields etc that apply inside it, and then 'printing' it in the destination. Assume the scanning and printing operations are perfectly safe, sure and accurate. To prevent multiple instances of you, the original version would be detonated before the data is sent to the destination, with say, some kind of anti-materia device, which would just make you disappear instantly and painlessly. Would you do it?", "group_id": 175, "id": 343625}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1300051378.6551311, "message": "@mrtazz exactly", "group_id": 175, "id": 343668}, {"user_id": 651, "stars": [], "topic_id": 12422, "date_created": 1300051345.5264981, "message": "Once reassembled I assume I wouldn't have any memory of my disappearance, since I got \"copied\" before? I think I wouldn't choose to do it if I could remember the process of my own disappearance.", "group_id": 175, "id": 343664}, {"user_id": 11619, "stars": [], "topic_id": 12422, "date_created": 1300135070.956286, "message": "I'm thinking this thought experiment is a nicely constructed exercise of the ancient essence/existence precedence question. For me, the answer lies in the investigation of what it would take to get myself to the point where I could actually answer the question. Just like I can't do geometry without arithmetic, there are philosophical questions I cannot answer without some relevant knowledge and experience. And, of course, I can pretzel my mind with \"who is it that is knowing?\" However, what seems critical is the discovery that such things are knowable. Without that, philosophy spirals into endless mind chatter.", "group_id": 175, "id": 350802}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301673042.8763161, "message": "@fsopho the book: amazon? http://www.amazon.com/Being-No-One-Self-Model-Subjectivity/dp/0262633086/ref=ntt_at_ep_dpt_2", "group_id": 175, "id": 502810}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301671790.6881101, "message": "where can I find metzinger's work (paper or bock), in which he explains his model?", "group_id": 175, "id": 502619}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301673403.054486, "message": "thanks! I want to understand better the role of the emulation in the formation of self conception.", "group_id": 175, "id": 502859}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301674470.058847, "message": "I actually do agree that Jackson's argument isn't valid. But I also think that even knowing everything that can be scientificaly known about conscious color-vision, color-blind Mary is missing factual knowledge of sense-experience, while \"normal\" Mary acquires new knowledge as she starts seeing colors. I think the premises are true - BUT, the conclusion is a non-sequitor (the claim that there are non-physical facts that can only be known via \"phenomenal knowledge\", and therefore physicalism is false). I mean, even if it is the case that Mary acquires new knowledge when she starts seeing colors, that does not mean that the phenomenon she is now accessing isn't physical.", "group_id": 175, "id": 503011}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301675719.926084, "message": "By the way, I haven't read the book myself either, I think I'm grabbing it too. I think the model can actually have practical applications, like you can try to manipulate what you will have in your self-model and model of the outside world and these two models' connections and so on. I have already tried a bit it seems to work for me at least.", "group_id": 175, "id": 503242}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301675434.3922081, "message": "If we view the phenomenal color sensation as just an illusion, that is, it's just some reasoning & conceptualization process we are unaware of, manifesting itself to us as a feeling or 'qualia', Mary doesn't really acquire any new information, because the feeling or qualia isn't information, but rather an illusion. (for qualia, see http://en.wikipedia.org/wiki/Qualia ). I'm inclined to take this view, because knowledge og the feeling cannot be described nor can it be used in any way, so I don't think it's really knowledge or information. It's just that someone is familiar with a certain unconcsious thought process and can recognize it.", "group_id": 175, "id": 503182}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301676698.168772, "message": "got it. but if there is no factual knowledge of qualia, or properties of sense experience, which was supposed to be known via introspection, does that mean that there is absolutely no knowledge via introspection at all? (notice that we know reasoning via introspection)", "group_id": 175, "id": 503362}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301677447.6890111, "message": "The thought experiment is of course unrealistic, no one person can really hold all that knowledge and understanding, it's way too complicated. Sometimes I wonder if such a model is even theoretically possible.", "group_id": 175, "id": 503442}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301677224.50666, "message": "I don't think so. For example, the effect that seeing blue has on your consciousness, or mind, is real knowledge. However, if Mary indeed knew and understood everything there was to know about the subject, she should have understood this too. Plenty of knowledge is obtainable through introspection, I was just saying I don't think the feeling is really knowledge, but the hidden process that manifests as the feeling is. The knowledge through introspection is from these processes, I think. But Mary should have known all about them, when it comes to color experience, right?", "group_id": 175, "id": 503410}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301680731.0929301, "message": "nor would it even be knowledge if you wouldn't really be able to sense red. So I wouldn't count it as new knowledge in any case.", "group_id": 175, "id": 503934}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301679862.8721039, "message": "I know right know that \"I'm appeared to redly\", in that I look to a book which is red and have a color experience. Doesn't seem that I know something that color-blind Mary doesn't?", "group_id": 175, "id": 503832}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301679271.4382, "message": "The problem is that it might not work the same for us and the alien. Nor does seeing a color necessarily have exactly the same effects in every human. It certainly feels different to have the experience for the first time, than when used to it. If I was to have the same kind of vision as the alien, I argue I would know nothing more about what goes in his / her / its head, if I already had all the theoretical knowledge of the issue.", "group_id": 175, "id": 503739}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301678483.5888889, "message": "yeah, the thought experiment is unrealistic - but even so it seems to account for some problems regarding knowledge of sense-data. Well, it doesn't need to be feasible to be used in argument - but how can we say that she knows all about color-vision experience if she has no color-vision experience. I mean, I agree that she has a comprehensive understanding of functional processes which has sense experience as output - but that is an output of which she has no acquaintance with. Imagine there's an alien organism that scientific theories describes as having structural-molecules vision (whithout using any optic device). We can know everything we have to know about this curious phenomenon that occurs in the alien's mind - but we don't know how it is to have such a vision. The alien knows something we don't: the output of that kind of vision.", "group_id": 175, "id": 503627}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301678597.319885, "message": "but of course, I'm just exploring the use of the thought experiment in argument - I don't know how metzinger explains his theory at full lenght (and I appreciate you're trying to explain something about this to me)", "group_id": 175, "id": 503651}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301678572.558934, "message": "To add to my previous post: Besides manifestations of reasoning or conceptualization, feelings can for example be manifestations of your brain & body's state / mode and changes to the state / mode. The process itself is transparent, like Metzinger says in the lecture.", "group_id": 175, "id": 503645}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301679337.863687, "message": "Therefore, the only new knowledge would be the knowledge I obtain with the new vision.", "group_id": 175, "id": 503747}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301679919.3969171, "message": "I agree it *seems* so. Or I suppose it comes down to what you regard as knowledge.", "group_id": 175, "id": 503845}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301680203.7886009, "message": "belief in what in this case?", "group_id": 175, "id": 503889}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301680149.9612579, "message": "knowledge as justified true belief plus a fourth condition (I think that the no-defeaters condition is the better). You don't conceive knowledge this way?", "group_id": 175, "id": 503880}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301680354.957721, "message": "yeah, I agree with your definition, but what do you believe in this case, when you have the experience of the color?", "group_id": 175, "id": 503908}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301680311.851999, "message": "yes, factual belief. I know that P iff (i) I believe that P, (2) P is true, (3) My belief that P is justified, and (4) there is no true defeater form my belief that P", "group_id": 175, "id": 503900}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301680533.205137, "message": "... I'm arguing there really isn't anything, assuming the setup in the Mary -thought experiment.", "group_id": 175, "id": 503916}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1301680547.971354, "message": "I believe I'm appeared to redly. Or if you prefer: I believe I'm sensing red", "group_id": 175, "id": 503918}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301680666.97995, "message": "but that isn't knowledge about the sensing itself, is it?", "group_id": 175, "id": 503926}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1301681315.1227641, "message": "... rather, you retain your knowledge of an attribute, while the value of the attribute changes.", "group_id": 175, "id": 504012}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1302014276.6386571, "message": "yes, of course, because it is not the case that you are blind is such a situation, and I can only know what is the case", "group_id": 175, "id": 541565}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1302013411.191813, "message": "yes, it is knowledge of the sensing itself AND about the content of this sensing. I'm not saying that it it the 'knowledge by acquaintance' (Russell). I'm saying that I know the proposition [I sense red] or [I am appeared to redly]. I couldn't know that proposition if I was color-blind Mary, even knowing everything I have to know about color sensation in scientific terms", "group_id": 175, "id": 541423}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1302014004.2840879, "message": "but if you think about it like that, you would also lose knowledge at the same time. You would not anymore know the proposition [I am color blind]", "group_id": 175, "id": 541502}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1302014458.8833411, "message": "so, saying \"Mary acquires new knowledge\" would be kinda misleading", "group_id": 175, "id": 541592}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1302014756.404177, "message": "I guess we should ditch the word knowledge in this case, and use something else, like understanding", "group_id": 175, "id": 541674}, {"user_id": 26842, "stars": [], "topic_id": 12422, "date_created": 1302015547.981209, "message": "ok, it would look more plausible. so that we could say that Mary understand everything she has to understand about color vision, and she is certainly not widening her understanding about that when she start seeing colors. =]", "group_id": 175, "id": 541798}, {"user_id": 10087, "stars": [], "topic_id": 12422, "date_created": 1302015691.3265769, "message": "well it's not obvious; the original argument went, that having the actual experience herself really did widen her understanding.", "group_id": 175, "id": 541818}]