[{"user_id": 1363, "stars": [], "topic_id": 42718, "date_created": 1311724449.455373, "message": "BTW if you're in San Diego I know some good Rails developers (or if not I know some good Rails contractors to get you by until you can hire someone)", "group_id": 95, "id": 1727300}, {"user_id": 1363, "stars": [{"date_created": 1311759447.573736, "user_id": 15929}, {"date_created": 1311783102.374496, "user_id": 13735}], "topic_id": 42718, "date_created": 1311724402.3227129, "message": "Depends on what you're trying to do with it, it's all about the right tool for the right job.", "group_id": 95, "id": 1727297}, {"user_id": 1363, "stars": [], "topic_id": 42718, "date_created": 1311724514.416858, "message": "Hit me up at jarin@robotmodehq.com", "group_id": 95, "id": 1727304}, {"user_id": 13735, "stars": [{"date_created": 1311898796.914443, "user_id": 1363}], "topic_id": 42718, "date_created": 1311783214.979686, "message": "As @jarin says, unless of course your looking for an excuse to try experimenting with node.js in which case go for it.", "group_id": 95, "id": 1732230}, {"user_id": 13735, "stars": [], "topic_id": 42718, "date_created": 1311783597.039784, "message": "@jarin I'm looking to get feedback from contractors on a set of questions aimed at providing clear project proposals as part of a new service we have a few test cases going through now. Could I email you the set of questions and have you forward them to the contractors you know?", "group_id": 95, "id": 1732280}, {"user_id": 1363, "stars": [], "topic_id": 42718, "date_created": 1311844487.0147591, "message": "Sure thing (I'm one of the contractors as well)", "group_id": 95, "id": 1737666}, {"user_id": 931, "stars": [], "topic_id": 42718, "date_created": 1312017128.8979411, "message": "I found that hiring people can be a bottleneck at an early-stage company. Eg. where I live, the vast majority of web devs is PHP, so I'd go with PHP for a new site.. Perhaps you should check out your area's job listings and use that information. IMO although one technology != the other, it won't make or break your startup, go with the one where you can hire!", "group_id": 95, "id": 1753845}, {"user_id": 11179, "stars": [], "topic_id": 42718, "date_created": 1312341932.329241, "message": "Are you a development shop? I tend to hire the person and not specific skill sets. A solid web developer, php/python or otherwise should pick up rails quickly with some good mentoring.", "group_id": 95, "id": 1781844}, {"user_id": 671, "stars": [], "topic_id": 42718, "date_created": 1312373819.267025, "message": "I find this funny because a client of mine wants to rebuild a Grails app in Rails because they can't find any decent Grails devs.  My bigger point to them (repeatedly) is that it won't really solve the issue as much as they think it will.  Finding *solid* devs who can really comprehend the complexity of their system is *hard* regardless of the platform.  They have a rather complicated logistics system, and it's just... complex.  If you think finding 'awesome Rails engineers' is hard, why on earth do you then want to add node to the mix?  If you want to find awesome engineers, I'd look at expanding *out* to php or python (or maybe even perl), not include node.", "group_id": 95, "id": 1783719}, {"user_id": 671, "stars": [], "topic_id": 42718, "date_created": 1312376187.7058401, "message": "Maybe you should look at using erlang or clojure if you're having a hard time finding 'awesome' rails devs - I'm sure that'd make things easier. :)", "group_id": 95, "id": 1783834}, {"user_id": 39281, "stars": [], "topic_id": 42718, "date_created": 1312417638.442167, "message": "Hey whats up?", "group_id": 95, "id": 1789663}]