[{"user_id": 30951, "stars": [], "topic_id": 21486, "date_created": 1303850728.7444611, "message": "I've been working on a storyform, had it, changed it, then put it back to how it was. It just occurred to me that perhaps I should have a way to check a storyform. I'm not talking story-specific here, but generally.\n\nI suppose my question is, does anyone here have any methods for checking a storyform compared to the story they (think they) want to write? Are there any particular elements that may more evidently highlight an appropriate / inappropriate storyform (assuming the author already has a good grasp of the complete story).", "group_id": 2515, "id": 818685}, {"user_id": 7712, "stars": [], "topic_id": 21486, "date_created": 1303851864.50618, "message": "Hi Mikeaja. Like you, I'm relatively new to using Dramatica to help me write. Several months ago when I settled on a storyform and continued to write the story with it as a guide, I was dismayed to discover that the storyform needed to be changed because new elements of the story emerged when the story began to write itself... those new elements added a new dimension to the story that caused my storyform to change, and although it was disturbing at the time, a better story was developed because of it.\n\nAt this point in my writing with Dramatica I now consider the storyencoding process to be an organic one. I am no longer set on it remaining on the initial way (which may have taken 15+ drafts) it was, instead I let it grow as the story grows.\n\nThe screenwriting class that I am in has taught me how to write a Step Outline, a sequential list of scene summaries that are very brief (maybe only a sentence or two in length). As I imagine each sequential step in the story, I plug that summary into the Scenes manager and adjust the reporting fields of that scene as necessary. When something new comes up that changes the storyform, I let it.", "group_id": 2515, "id": 818858}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303851965.3396089, "message": "An imperfect method that some people utilize is to write a first draft, and then -- if that seems to be the story they want to write & improve upon -- they make the storyform.", "group_id": 2515, "id": 818867}, {"user_id": 7645, "stars": [], "topic_id": 21486, "date_created": 1303852474.858083, "message": "Totally normal. In fact, if it didn't change, you might be a robot. Or really really understand Dramatica. Just know that *sometimes*, those things that don't fit your story are things that are intrinsically wrong with your story, i.e. you're trying to write something that doesn't work. Dramatica's storyforms are not as cool as your imagination, but your imagination will always be cooler than your story.", "group_id": 2515, "id": 818940}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303936055.834435, "message": "Oh, crap. I think the movie I wrote has a different storyform than I intended. Now what?", "group_id": 2515, "id": 832069}, {"user_id": 7645, "stars": [], "topic_id": 21486, "date_created": 1303938149.334758, "message": "Are you serious about this? can't tell...", "group_id": 2515, "id": 832578}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303938349.0324459, "message": "I realized a couple of minutes ago that I might look like I'm making fun of Mikeaja, and coming off like an a-hole.", "group_id": 2515, "id": 832641}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303938287.4462299, "message": "Dead serious.", "group_id": 2515, "id": 832624}, {"user_id": 7645, "stars": [], "topic_id": 21486, "date_created": 1303938474.707355, "message": "lol, yes thats what i thought...any specific questions or just stating panic?", "group_id": 2515, "id": 832676}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303939351.481107, "message": "I'm going to stay firm, though, and battle through with my current storyform.", "group_id": 2515, "id": 832902}, {"user_id": 30951, "stars": [], "topic_id": 21486, "date_created": 1303941736.0895319, "message": "No problem. Didn't think that at all. I wasn't sure if you were serious, but just thought either you were or you were going to follow it up with an example. :)", "group_id": 2515, "id": 833287}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303945493.0368559, "message": "I'm totally willing to share if you want. Basically, I created the storyform looking mostly at what most people would call \"the plot,\" which is: a crew is stuck on a boat that is infested with ... well, think of it as \"the blob on a boat.\" While this seems like a Situation, it is actually an Activity, with a Goal of Obtaining. (I worked this out with Jim.)\n\nBut, now that I'm looking at it, I thought, \"Oh, no -- the Captain isn't really worried about The Future: he's worried about people listening to him RIGHT NOW!\" And the Mate (The IC) isn't worried about Subconscious, but Conscious -- how people think about him. \n\nThen I went back to my script and noticed that everybody was concerned about Learning in the OS, not about Obtaining. \n\nThen I stopped freaking out and realized that I had done it right the first time. Because people listening to the Captain RIGHT NOW, well, that's part of the OS, not the MC throughline. Etc.", "group_id": 2515, "id": 833860}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1303947005.3284039, "message": "Plus, it's not helping that, after writing the thing, I still have a poor sense of why the MC has a Concern of The Future.", "group_id": 2515, "id": 834069}, {"user_id": 30951, "stars": [], "topic_id": 21486, "date_created": 1303984067.7567251, "message": "I'm curious why the OS domain is Activity and not Situation? Aren't they stuck in a (difficult) situation? Isn't that what creates he problem? Or are we saying it was the activity of the crew that cause the situation (and also the activity of the blob?).  With OS Goal, similar question. Is Obtaining about Obtaining the boat back? It seems to be a story of survival.\n\nI'm not suggesting I'm right, not at all. But by saying it as I see it is may highlight where I might be going wrong.....", "group_id": 2515, "id": 838801}, {"user_id": 30287, "stars": [], "topic_id": 21486, "date_created": 1303994063.043503, "message": "I'm not very familiar with the story, but I'll take a guess on that question...  when the domain is \"Situation\", the characters are not working to change or escape the situation.  They're just working within it.  Like, for example, Jimmy Stewart's character in Rear Window--he's trapped in his apartment, but the story is about him dealing with that limitation rather than trying to escape it.  Since these characters are trying to kill the monster and/or escape the boat, it's Activity instead.", "group_id": 2515, "id": 839767}, {"user_id": 7664, "stars": [], "topic_id": 21486, "date_created": 1304007309.1074359, "message": "It's that, but it's also that the creature can escape with them -- the creature isn't a fixture of the boat. Contrast that to a haunted house.\n\nThe way it works out, too, is that the majority of the problems come from HOW they are trying to deal with the creature -- they come from the activity surrounding the creature, not the creature itself. [It's about 50/50.]", "group_id": 2515, "id": 842960}]