[{"user_id": 1521, "stars": [], "topic_id": 12021, "date_created": 1299797517.686341, "message": "Idk about their iPhone 4 case but I had a Mopjhie Juice Pack for my 3GS & can NOT recommend it. The battery worked fine & was a nice addition, but the Mini USB connector use for charging came apart real easily, making the case useless as a charger. Just seemed to be cheaply made but not cheaply priced!", "group_id": 1295, "id": 317306}, {"user_id": 14028, "stars": [], "topic_id": 12021, "date_created": 1299823212.005758, "message": "Thanks for the reply. Two people on twitter did like the mophie pack for the 3G. I can see how the mini USB could fail. This happened to my last windows mobile phone. Saw the iPhone 4 one today in a coffeshop at SXSW. Guy seemed to like it and I liked the build quality. I may risk it. Anyone want to comment on the quality of the 4s USB port?", "group_id": 1295, "id": 319729}, {"user_id": 14896, "stars": [], "topic_id": 12021, "date_created": 1299863590.975158, "message": "Not a case, but I have this Kensington external battery pack for my iPhone. It worked for both my 3G and 4. Since it has standard USB interfaces I also use it to recharge my eReader on the go.  It's never let me down and I'm quite pleased.  http://us.kensington.com/html/15458.html", "group_id": 1295, "id": 324743}, {"user_id": 1521, "stars": [], "topic_id": 12021, "date_created": 1299881305.5876679, "message": "i think monoprice (http://monoprice.com) still had external batteries to connect to the dock port sans case, but for a very fair price ($15 iirc) I do own an i4 and the battery life is phenomenal. Ive had it last me up to two days multiple times!", "group_id": 1295, "id": 327890}, {"user_id": 21028, "stars": [], "topic_id": 12021, "date_created": 1299956350.341156, "message": "As for cases... iPhone 4 speck geometric case all the way! http://www.speckproducts.com/iphone-case/iphone-4-case/geometric-iphone-cases.html You'll have to stretch it out when you first get it because it's very tight and holds down your sleep wake button if you don't, but after you do this it is hands down the most protective while still light and comfortable case I think for the iPhone", "group_id": 1295, "id": 334904}]