[{"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305166463.45472, "message": "You pick the topic. It should be a) simple enough for new Rubyists to understand, and b) able to be explained in 5-minutes. It's ok if the topic has already been covered at another past meetup since this is meant to be a \"recap\".", "group_id": 4606, "id": 1017526}, {"user_id": 21842, "stars": [], "topic_id": 34875, "date_created": 1305255173.7719271, "message": "Hey Mark, you still looking for someone?", "group_id": 4606, "id": 1033645}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305297665.812201, "message": "@benzittlau I can suggest a topic or go ahead and pick one that would be interesting to you.", "group_id": 4606, "id": 1042207}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305297619.9959841, "message": "@benzittlau I am! I want to focus on finishing off the website update and putting together notes on upgrading to Rails 3.1 so I could really use some help. Are you interested?", "group_id": 4606, "id": 1042191}, {"user_id": 21842, "stars": [], "topic_id": 34875, "date_created": 1305395827.3757391, "message": "I was thinking of doing one on bundler and rvm.  Let me know if that makes sense, or throw me another topic and I'll do that up.", "group_id": 4606, "id": 1053798}, {"user_id": 21842, "stars": [], "topic_id": 34875, "date_created": 1305413599.4894559, "message": "I'll play around and see what makes sense.", "group_id": 4606, "id": 1056016}, {"user_id": 21842, "stars": [], "topic_id": 34875, "date_created": 1305413386.9837091, "message": "I'm going to try to do them both together as I think it makes sense to present them as such.  If I can't fit them both in I'll probably focus on rvm.", "group_id": 4606, "id": 1055983}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305413443.9089, "message": "I think they're important enough that it would be useful for people to see how to use them togethre.", "group_id": 4606, "id": 1055995}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305413234.253037, "message": "@benzittlau that sounds like a great recap. would you want to do them together in one talk or two seperate ones? if you're able to do it as slides or a screencast that would be great so that we can make it available on the wiki afterwords for new members to follow at their convenience.", "group_id": 4606, "id": 1055956}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305413420.1539409, "message": "If you want longer that's fine. It's just fletcher and I doing long form talk so we've got the time if you want it.", "group_id": 4606, "id": 1055991}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305413524.348628, "message": "Are you going to show using an .rvmrc or manually switch with rvm use? I guess that might be something for a part II talk if you wanted to keep things simple first time out. Just getting RVM and bundler working is probably enough for most new rubyists.", "group_id": 4606, "id": 1056009}, {"user_id": 13919, "stars": [], "topic_id": 34875, "date_created": 1305413687.9510961, "message": "Cool. I'll leave it to you. Thanks again! Let me know if there's anything you need from me.", "group_id": 4606, "id": 1056027}]