[{"user_id": 11626, "stars": [], "topic_id": 6205, "date_created": 1297807459.987577, "message": "http://www.smh.com.au/news/technology/the-cia-uncovers-a-secret-how-to-look-things-up-on-the-internet/2005/11/28/1133026405281.html#", "group_id": 3920, "id": 115890}, {"user_id": 11626, "stars": [], "topic_id": 6205, "date_created": 1297807441.892801, "message": "THE CIA now has its own bloggers. In a bow to the rise of internet-era secrets hidden in plain view, the agency has started hosting weblogs with the latest information on topics including North Korean dictator Kim Jong-Il's public visit to a military installation (his 38th this year) and the Burmese media's silence on a ministry reshuffle. It even has a blog on blogs, dedicated to finding useful information in the rapidly expanding milieu of online journals and weird electronic memorabilia on the net.\r\n\r\nThe blogs are posted on an unclassified, government-wide website, part of a rechristened CIA office for monitoring, translating and analysing publicly available information, called the DNI Open Source Centre. The centre, which made its debut this month, marks the latest wave of reorganisation in response to the failures of intelligence collection before the September 11, 2001, attacks.\r\n\r\nAnalysis of those failures pointed to insufficient efforts to tap into the huge realm of information on the internet, as well as a climate of disdain for such information among spy agencies. \"There are still people who believe if it's not top secret it's not worth reading,\" says an outside expert who works with government intelligence agencies.\r\n\r\nBy adding the new centre, \"they've changed the strategic visibility\", says the centre's director, Douglas Naquin, a CIA veteran. \"All of a sudden open source is at the table.\" But he acknowledges that \"managing the world's unclassified knowledge [is] much bigger than any one organisation can do\".\r\n\r\nThe DNI Open Source Centre began life in 1941 as the Foreign Broadcast Information Service - FBIS to insiders - which was charged with monitoring publicly available media and translating their output. Its pastel-hued booklets became a familiar presence throughout government. At the height of the Cold War, it was FBIS translators who pored over Izvestia and Pravda from the Soviet Union, providing the little hints such as a word change that might signal something broader for the CIA's Kremlinologists.\r\n\r\nBy the 1990s, the office had fallen on hard times. Some advocated abolishing it, saying it was irrelevant in the age of 24-hour cable news. It survived, but had its staff slashed by 60 per cent, Naquin says. September 11 gave it new purpose, as \"open source\" became an intelligence buzzword. Across government, policymakers began to debate how to find the nuggets of genuine information hidden in the internet avalanche.\r\n\r\nEven before the Open Source Centre officially opened it had added a video database that makes its archives available online, and rolled out an upgraded website with blogs and homepages on topics such as Osama bin Laden, Iraq insurgency leader Abu Musab al-Zarqawi, China and bird flu.\r\n\r\nThe centre sees itself as a repository of what Naquin calls \"open-source tradecraft\" in a self-conscious echo of his clandestine colleagues. It teaches courses such as Advanced Internet Exploitation to intelligence analysts.\r\n\r\nPerhaps the toughest challenge for the new centre is proving its mettle inside the sceptical world of intelligence, where the stolen secret has long been prized above the publicly available gem. Although the centre's website is unclassified and available across the government, so far it has only 6500 users with active accounts, Naquin says.\r\n\r\n\"Rarely is there the 'aha!', the 'oh-you-solved-this or you-prevented-this\"' moment, Naquin acknowledges.\r\n\r\n\"The reluctance to use it is astounding to me,\" says Michael Scheuer, the former head of the CIA's bin Laden unit. \"Nobody wants to go back in response to an assignment and say, 'Oh, my Open Source Centre found this on a server in Belgium.\"'\r\n\r\nThe culture clash isn't likely to disappear soon - especially when intelligence services still classify material that can be found easily on the internet. Not long ago, says a former senior government terrorism analyst, he was teaching a class to future CIA intelligence analysts that included a PowerPoint presentation on the evolution of al-Qaeda since September 11, with images taken from the internet.\r\n\r\nTwo men at the back of the class came up to the instructor after the presentation. Where, they asked, had he got a particular image from Iraq? It's classified, they insisted. The former analyst laughed. He had taken it from a gruesome website that compiles terrorist atrocity videos along with pornography.", "group_id": 3920, "id": 115886}]