[{"user_id": 11626, "stars": [], "topic_id": 6533, "date_created": 1297891172.0705681, "message": "Two Iranian warships are expected to pass through the Suez Canal Wednesday night on their way to Syria, a move that Israel considers a \"provocation\" and that sent oil prices soaring.\r\n\r\nThe passage, which Iran said was part of a training mission, is \"something which has not happened in many years,\" Israeli Foreign Minister Avigdor Liberman said.\r\n\r\n\"This is a provocation that proves that the self-confidence and insolence of the Iranians is growing from day to day,\" he said. \"This happens after the Iranian president's visit to south Lebanon and his aggressive declarations there towards Israel.\"\r\n\r\nThe Israeli Defense Ministry said Israel was monitoring the movement of the Iranian ships and alerted its allies.\r\n\r\nCrude oil for delivery in March rose as much as 1.2% to $85.95 a barrel, following the news. Brent crude, which is traded primarily overseas in Europe, rose as much as 2.1% to $103.31 a barrel.\r\n\r\nTraders urged caution, saying the reports were still vague.\r\n\r\n\"The reports are sketchy at the moment, but the news of Iranian warships in the Suez did rally the market a bit,\" said Andrew Lebow, a commodities broker with MF Global. \"The market is looking for more information but certainly we're seeing some short covering on the reports.\"\r\n\r\nThe Suez Canal serves as a key passageway for international trade, allowing ships to navigate between Europe and Asia without having to go all the way around the Cape of Good Hope in South Africa.\r\n\r\nMillions of barrels of oil move through the Suez every day on the way to both Europe and North America.\r\n\r\nIranian Navy officials have said the flotilla has embarked on a yearlong training mission that takes it to the Gulf of Aden to the Red Sea and through the Suez Canal into the Mediterranean Sea, according to the semi-official Fars News Agency.\r\n\r\nDuring the mission, Iranian Navy cadets are due to be trained and prepared for defending the country's cargo ships and oil tankers.\r\n\r\nIranian Navy Cmdr. Rear Adm. Habibollah Sayyari said cadets would be trained to protect ships and tankers now under threat of attack from Somali pirates, Fars said. Part of the mission was also to gather intelligence.\r\n\r\nSayyari said the ships were in the region in \"pursuit of a powerful (military) presence in the high seas and to consolidate our friendly ties and declare our message of peace and friendship to the regional countries.\"\r\n\r\nLiberman urged Israel's allies to pay attention.\r\n\r\n\"We expect the international community to act speedily with determination against the Iranian provocations, designed to deteriorate the situation in the area, and put the Iranians in their place,\" he said.\r\n\r\nLiberman's comments were not so much a threat but a wake-up call about a \"worrying development,\" said a senior government official who was not identified because he was not authorized to speak to the media.\r\n\r\nThe official said Liberman was \"painting it as a challenge to the West.\"\r\n\r\nIsraeli Prime Minister Benjamim Netanyahu's office offered no immediate comment.\r\n\r\nhttp://www.cnn.com/2011/WORLD/meast/02/16/israel.iran.warships/index.html", "group_id": 3920, "id": 124522}]