[{"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1317821356.473093, "message": "What are people interested in seeing this quarter? \n\nI'm probably able to do talks about:\n* Ruby, part 2\n* Git\n* Rails\n* Javascript/JQuery\n* Haskell (neither web development nor for new programmers) \n\nI know people who might be able to do talks about:\n* Rails\n* Sinatra\n* Python\n* Django (python web framework) \n* Cappuccino (rich javascript ui library)\n\nDiscussion, go!", "group_id": 11802, "id": 2284451}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1317832144.42206, "message": "Rails would certainly be good. Sinatra would be nice too, but I don't think it would take as long to present on since it is much smaller framework.  Maybe we should have a web frameworks day where we present several smaller frameworks.\n\nHaving a version control day would also be good. GIT is good to know, but mercurial and Bazaar are easier to learn. Could start with one of those and work our way up to GIT.\n\nAlex: If you can get you're python friend to come in that would be great!", "group_id": 11802, "id": 2285441}, {"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1317835668.7246089, "message": "And Git isn't anymore complicated than Mercurial or Bazaar. I promise. The main benefit I see of Git is the ability to use Github.", "group_id": 11802, "id": 2285777}, {"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1317835565.1601651, "message": "Well, Rails could certainly be a multi-day/week thing. There's a lot of moving parts and I could do an intro, but there's a lot of stuff I could learn myself.", "group_id": 11802, "id": 2285766}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1317912387.1834021, "message": "As far as rails is concerned, I think an introduction from you would be great! Other's in the group who also use rails might have things to add.", "group_id": 11802, "id": 2292087}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1317912262.987777, "message": "Hmm... I think GIT is more complicated, if only because it is more complex. Mercurial simply doesn't have the number of options GIT does and furthermore, it does some things for you that you have to specify in GIT. IMHO GIT is better because it is more powerful, but Mercurial has an advantage as far as a learning curve goes.\n\nThat's just been my experience though.", "group_id": 11802, "id": 2292078}, {"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1317915515.743192, "message": "Git is only more complex because it has a lot of options that are not necessary for 99% of use cases. Once again, I'd say Git is more useful for people to know because of the critical mass that Github has gathered. Plus, I know enough to give a talk about Git, but I can't say the same for hg.", "group_id": 11802, "id": 2292482}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1317941070.287029, "message": "Yeah, I agree, GIT is more useful to know, but I still think it's harder to learn (that's my experience at least).  Still, I suppose any difference in difficulty would not be substantial enough to justify teaching the easier one first.", "group_id": 11802, "id": 2295266}, {"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1317967833.22068, "message": "Well, I highly recommend http://gitimmersion.com/ for learning Git. It's a fantastic guide.", "group_id": 11802, "id": 2297584}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1317998889.4667511, "message": "Looks cool. Apparently, some large manufacturing company is coming to campus to do a Tech Talk on cloud computing.  Could go to that too. I emailed the list about it.", "group_id": 11802, "id": 2299296}, {"user_id": 41970, "stars": [], "topic_id": 46174, "date_created": 1318003302.052464, "message": "I can do talks on:\n* Basics of Git\n* Basics of TDD\n* Node.js\n* Maybe something else depending on interest and notice given.", "group_id": 11802, "id": 2299697}, {"user_id": 41985, "stars": [], "topic_id": 46174, "date_created": 1318021214.538537, "message": "I'd like to see talks on Git, Python, Ruby/Rails and Haskell. I'd also like to do talks on\n* Javascript \"The right way\"\n* jQuery\n* Groovy/Grails", "group_id": 11802, "id": 2301167}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1318056647.5613029, "message": "This is all great! If anyone knows when they want to present let's hear it. From what I understand, Alex isn't tied to presenting something on Tuesday.", "group_id": 11802, "id": 2303588}, {"user_id": 2909, "stars": [], "topic_id": 46174, "date_created": 1318179618.0808771, "message": "If someone else wants to present something, fantastic, but I have no problem presenting again. If someone else wants to cover Javascript, they'd probably do a better job at it than I would.\n\nAt some point in the quarter, I could probably do a basic presentation on using basic web hosting options (github/heroku/ec2).\n\nAs far as additional topics go, I can probably also do a presentation on Hadoop (distributed computing) and Thrift (cross-language data protocol).", "group_id": 11802, "id": 2311969}, {"user_id": 41849, "stars": [], "topic_id": 46174, "date_created": 1318355365.536324, "message": "I'm very interested in learning about jQuery/JavaScript and using them in Rails.  Unfortunately, I won't be able to make the meeting this evening (10/11/11) due to a death in the family :-\\   I will see you guys again next week, though.", "group_id": 11802, "id": 2326201}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1318368864.3698249, "message": "@mvance I'm sorry to hear that.\n\nThanks for the topic suggestion.", "group_id": 11802, "id": 2327678}, {"user_id": 41739, "stars": [], "topic_id": 46174, "date_created": 1318398621.0738981, "message": "I would like learn about HTML5, JS/jQuery, CSS3, RoR, node.js. I would  love discussing/hearing about Hadoop and its ecosystem. I have basic understanding about Hadoop, HBase, and HDFS. As the entire hadoop ecosystem is a big thing to cover, I can contribute by covering few of the topics.", "group_id": 11802, "id": 2330674}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1318517859.2112069, "message": "@prasanth_llz I think I can handle at least some of those front-end things.  However, someone else really should present on Hadoop (@Seterus).I'd also like to see some NoSQL.", "group_id": 11802, "id": 2339770}, {"user_id": 41738, "stars": [{"date_created": 1318551115.3748231, "user_id": 41738}], "topic_id": 46174, "date_created": 1318551093.973419, "message": "I just sent out an email to this list. Basically trying to determine who is presenting what next week. Anyone is allowed to present anything web/programming related.  If you don't tell anyone in the group ahead of time, it doesn't matter (although I would like to know).\n\nCurrent (but tentative list of presentations):\n\n* Compass - Ryan (me)\n* Git or Bundle/rvm ... - Alex\n* Media Queries - Tony?\n\nAlso, I'm think we should void our normal meeting two weeks from now and go to http://www.meetup.com/girldevelopitcbus/events/30865351/ 10/23 instead. It's a GDI Hacknight with some Closure talk.", "group_id": 11802, "id": 2342892}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1319913631.757674, "message": "Any opinions on what we should do next week?", "group_id": 11802, "id": 2462608}, {"user_id": 41738, "stars": [], "topic_id": 46174, "date_created": 1320689844.2058499, "message": "Any ideas on what to do next week? My best idea atm is a koanathon.  Basically get people working through various Koans to learn some new languages", "group_id": 11802, "id": 2527366}]