[{"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976209.272342, "message": "so, frameworks, not app? you think Milk will produce frameworks for users to build on top of?", "group_id": 95, "id": 534324}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976056.2880111, "message": "oh, to put everything in context, Milk Lab is Kevin Rose & Daniel Burka new start-up - http://techcrunch.com/2011/04/04/milk-kevin-roses-new-company-aims-to-solve-big-problems-on-the-mobile-web/", "group_id": 95, "id": 534266}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301975909.4331369, "message": "I was on the fence on creating a new thread, instead of just adding to the existing thread (https://convore.com/hacker-news/someone-can-get-me-in-touch-with-kevin-rose-or-daniel-burka/)", "group_id": 95, "id": 534207}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976055.095283, "message": "but, what do you guys think about: “We’ve been upfront with investors that the lab’s companies are going after big ideas, not launching continuous small projects,” he said in an interview yesterday. “There is so much opportunity to disrupt old media and old business.” So no Kevin Rose take on a mobile photo sharing app? “No,” he laughed. “Nothing like that.” Wow–that alone is counter-Valley thinking these days.", "group_id": 95, "id": 534264}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301976814.7614851, "message": "@unwrangle there are some small frameworks out there, but big i mean something like having them run the servers for certain things like social and location", "group_id": 95, "id": 534490}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301976036.1465609, "message": "I like what kevin is doing, he is saying instead of making 20 small little frameworks he is going to create 2-4 big frameworks that will be gear towards mobile and if anything probably the biggest mobile platform will be the iphone so this will give independent IOS developers to have a simple idea and be able to run an amazing app", "group_id": 95, "id": 534259}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976541.785409, "message": "I remember something about Stocks app mentioned in the Random show with Tim Ferris... that kinda 'big', but then again, it might just be a misdirection.", "group_id": 95, "id": 534414}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976656.326828, "message": "the thing is @italiano40, i don't think there's such thing as a 'small framework'", "group_id": 95, "id": 534448}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301976373.585696, "message": "that is what i am thinking by the way he said it, maybe framework was the wrong word to use but something along those lines it sounds like it, i mean if you look at the twitter list that was just posted http://twitter.com/milk/status/55115648489099265 the first thing i noticed was no designers it was all engineers, expect for burka so that is what i am thinking", "group_id": 95, "id": 534371}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301977125.6557779, "message": "@unwrangle ohh i missunderstood what you meant by a stock app sorry, and yea they would house all servers and cpus and you would just put your framework into your app, remember joe stump from digg, he started https://simplegeo.com/ i think kevin may go that way", "group_id": 95, "id": 534575}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301976697.671313, "message": "@unwrangle if apple is outsourcing a iphone project and kevin can scoop that up for milk i mean that would be unbelieve, but that is a misdirection i don't think apple would do that, they built all apps in house and a stock app i mean that isn't a big app so i doubt apple would a lot that", "group_id": 95, "id": 534456}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301976992.6861401, "message": "it doesn't have anything to do with apple. there are plenty of other stocks app... bloomberg for example. But now I see what you meant by big... lots of servers, data, and/or cpu cycles, right?", "group_id": 95, "id": 534539}, {"user_id": 15929, "stars": [], "topic_id": 17330, "date_created": 1301977126.965179, "message": "my opinion of 'big' is to the business they want to disrupt,... stocks, project management, etc. so no more niche market.", "group_id": 95, "id": 534576}, {"user_id": 4149, "stars": [], "topic_id": 17330, "date_created": 1301977672.884455, "message": "i hear you on that but i think they will not disrupt any business, i purely believe this is to create and optimize", "group_id": 95, "id": 534690}, {"user_id": 5136, "stars": [], "topic_id": 17330, "date_created": 1301991073.905808, "message": "@italiano40 One good way to understood what they wants to do, is following every tweet the Milk's team tweet :P", "group_id": 95, "id": 538477}]