[{"user_id": 16549, "stars": [], "topic_id": 35567, "date_created": 1305582761.9126, "message": "Personally I'm not a fan but I guess reasons for using it would be; mature ecosystem, plenty of (too many?) tools/libraries/frameworks etc", "group_id": 95, "id": 1075333}, {"user_id": 8668, "stars": [], "topic_id": 35567, "date_created": 1305583256.656342, "message": "(just... stiff competition these days)", "group_id": 95, "id": 1075427}, {"user_id": 16549, "stars": [], "topic_id": 35567, "date_created": 1305582592.500365, "message": "37 replies on Programming Language of choice (https://convore.com/hacker-news/programming-language-of-choice/) and nobody has mentioned Java.  Is anyone using it for new projects??", "group_id": 95, "id": 1075294}, {"user_id": 8668, "stars": [], "topic_id": 35567, "date_created": 1305583248.619194, "message": "Java is still my language of choice", "group_id": 95, "id": 1075424}, {"user_id": 960, "stars": [{"date_created": 1305667173.2776871, "user_id": 28560}], "topic_id": 35567, "date_created": 1305582638.681622, "message": "@shutton The bigger question is why would anybody? :-)", "group_id": 95, "id": 1075301}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305584734.8309109, "message": "Yeah - the JVM is rock solid, and Java code can be.", "group_id": 95, "id": 1075630}, {"user_id": 8668, "stars": [], "topic_id": 35567, "date_created": 1305583273.862942, "message": "I would say that Java 7 will really bring a lot to the language that is needed... but it's been a long time coming!", "group_id": 95, "id": 1075430}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305584742.2211859, "message": "Most of the time it's way too much for what people want though", "group_id": 95, "id": 1075632}, {"user_id": 7999, "stars": [], "topic_id": 35567, "date_created": 1305583676.473855, "message": "I don't think that Java 7 will make people more likely to start projects with it. I know a lot of people who continue to use the JVM, but write in ruby or groovy", "group_id": 95, "id": 1075488}, {"user_id": 8668, "stars": [], "topic_id": 35567, "date_created": 1305586353.0441079, "message": "It's a pity inter-operability between languages isn't stronger - if it was more like .net that would be very nice. Some things still mix and match - Play Framework uses Java or Scala for the controllers and models, and Groovy for views, which works well (and mirrors my PHP/Smarty setup at work)", "group_id": 95, "id": 1075837}, {"user_id": 22924, "stars": [], "topic_id": 35567, "date_created": 1305587855.246141, "message": "I don't consider Java when starting projects. I've used it in the past but would much prefer Python / Ruby. If I had to use the JVM for some reason I'd probably use Clojure or Scala.", "group_id": 95, "id": 1075998}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305590836.3950839, "message": "@italiano40 Do you really know people writing CLI apps in Java?", "group_id": 95, "id": 1076368}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305590763.917706, "message": "Java hasn't jumped the shark, it is just used more for servers, backends for websites, and command line apps so it isn't too mainstream", "group_id": 95, "id": 1076360}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305590940.3489871, "message": "@tswicegood yep me LOL i have developed very little apps most things to do in bulk but yea i know most of my sysadmin friends do it", "group_id": 95, "id": 1076385}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305591115.4278619, "message": "@italiano40 Wow.  I can understand it, I guess, if you're writing an app to wrap something that's already in a Java API, but Java doesn't seem CLI friendly for standard command-line style stuff compared to Ruby or Python", "group_id": 95, "id": 1076416}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305591122.861706, "message": "100% opinion, obviously... :-)", "group_id": 95, "id": 1076418}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305591355.6523969, "message": "java is very CLI friendly, i use java when i have a lot of task to do and i don't want to start messing with C++ memory management", "group_id": 95, "id": 1076456}, {"user_id": 12719, "stars": [], "topic_id": 35567, "date_created": 1305597621.1346569, "message": "java is the only choice for enterprise software.  it's way faster than Python/Ruby/Clojure/etc, it makes it straightforward to write code that's relatively easy to understand, which means you can extend and maintain code you didn't write, it has a really good web framework (playframework.org), it has great tool support, and it has libraries for anything you might want to do.", "group_id": 95, "id": 1077675}, {"user_id": 12719, "stars": [{"date_created": 1305613562.0056069, "user_id": 12641}], "topic_id": 35567, "date_created": 1305597711.565043, "message": "sure it's verbose, and sure there are plenty of code snippets that can be more elegantly expressed in other languages, but the strong typing is very important, and being able to easily understand large systems that you didn't write is extremely important.", "group_id": 95, "id": 1077697}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305606211.693269, "message": "Though I guess NASA deciding that Python was the way to go for their cloud infrastructure means they're just a clueless government bureaucracy.  Couldn't have anything to do with the fact that Python actually is a pretty solid language.", "group_id": 95, "id": 1078877}, {"user_id": 960, "stars": [], "topic_id": 35567, "date_created": 1305606132.920007, "message": "Way faster than Python, Ruby, or Clojure?  Come on... Clojure is a language on top of the JVM so it's not even in the same category as Python and Ruby which each have implementations on the JVM with their core \"original\" implementations elsewhere.", "group_id": 95, "id": 1078869}, {"user_id": 15141, "stars": [], "topic_id": 35567, "date_created": 1305610156.3972859, "message": "That is both trolling and true.", "group_id": 95, "id": 1079198}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305609648.9281361, "message": "Python is not a high level language never will be", "group_id": 95, "id": 1079167}, {"user_id": 15141, "stars": [{"date_created": 1305946983.2104311, "user_id": 9108}, {"date_created": 1307255975.4785371, "user_id": 2376}], "topic_id": 35567, "date_created": 1305610138.6125441, "message": "@italiano40 are you a troll? Worked 6 month with java to make a GUI. The thread and notification system was a mess. The syntax was awful. It consume a lot of RAM. Java is good if you are a team manager and want to hire a team of medium to low quality developers.", "group_id": 95, "id": 1079197}, {"user_id": 12641, "stars": [], "topic_id": 35567, "date_created": 1305613514.8064201, "message": "@tswicegood I have done this in the past, and have friends using Java for CLI apps as well.  Usually this is useful when you want to perform services against enterprise tier apps/services used in other systems.  Otherwise I'd usually hack something out in Perl.", "group_id": 95, "id": 1079427}, {"user_id": 1692, "stars": [{"date_created": 1305613616.2728209, "user_id": 12641}, {"date_created": 1305643363.4474909, "user_id": 22924}], "topic_id": 35567, "date_created": 1305613100.4405651, "message": "Java is just nothing to hack in, like many people here do. Go into IT consulting and enterprise software and you will find loads and loads of Java. Its a great language but i wouldnt choose it for any web related projects.", "group_id": 95, "id": 1079410}, {"user_id": 8195, "stars": [{"date_created": 1305644827.2233591, "user_id": 4149}], "topic_id": 35567, "date_created": 1305619426.5352359, "message": "I use Java for my upcoming project\nmain reason is that I want to access resources of Google App Engine\nbecause java is involved I'm using GWT which is really great\n\nI use Intellij IDEA which is very powerful and I don't feel that Java is old language\nPrimarily I am Ruby and Rails developer and I am using Backbone.js and even Node.js for some projects. But sometimes Java is also very good fit!", "group_id": 95, "id": 1080006}, {"user_id": 8195, "stars": [], "topic_id": 35567, "date_created": 1305619587.926527, "message": "sometimes there is a need to speed up the process\nand I really recommend to try Groovy language\nit gives you the power of Java and the beauty of Ruby\ntesting or internal scaffolding can't be made easier than with Groovy", "group_id": 95, "id": 1080022}, {"user_id": 13404, "stars": [], "topic_id": 35567, "date_created": 1305629923.1210899, "message": "As others already mentioned: If you have to do enterprise software, there is now way around Java. Most enterprise systems are written in Java and will stay there for a very long time. The good thing is that you can sometimes use other languages (like JRuby, Scala and Clojure) that run on the JVM and interoperate quite well with Java code.", "group_id": 95, "id": 1081329}, {"user_id": 19238, "stars": [], "topic_id": 35567, "date_created": 1305630812.9629149, "message": "I don't like Java. It is going to die early or late.", "group_id": 95, "id": 1081389}, {"user_id": 19238, "stars": [], "topic_id": 35567, "date_created": 1305630849.0847721, "message": "It doesn't progress like .NET, and probably never will with Oracle", "group_id": 95, "id": 1081393}, {"user_id": 8668, "stars": [], "topic_id": 35567, "date_created": 1305631395.765229, "message": "@tswiceasgood: While other languages on the JVM are getting there, Java is still the fastest. The only other really fast language is Scala afaik, dynamically typed languages have extra overhead on the JVM atm (but this is being worked on)", "group_id": 95, "id": 1081432}, {"user_id": 2362, "stars": [{"date_created": 1305642428.45151, "user_id": 26065}, {"date_created": 1305651928.6405311, "user_id": 960}], "topic_id": 35567, "date_created": 1305640622.9230709, "message": "@ZoFreX We are past the point of making speed as big a deal. Design intelligently, design to scale, and be it Python, Ruby, or something else, it's going to be fast enough.", "group_id": 95, "id": 1083086}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305644793.8743141, "message": "@NARKOZ have you seen java 7 i am guessing not or know what places and applications would use the java benefits, and how are comparing .NET to java? you can't even compare C# to java and they are basically the same just one is microsoft and one is oracle, do some research", "group_id": 95, "id": 1084019}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305644711.305912, "message": "@yogsototh ok that is your problem i will agree java uses a lot of RAM, and i wouldn't really build a whole GUI with java, you misunderstood me, I use java to build Server like applications and the API's are huge and wide, or anything that would be a pain to write all the memory management in C++ so yea java isn't perfect but it is better than python which i use for quick scripts and nothing more, but if i was a true troll i would of said F python, and get on the LUA train but i am not so no trolling here, and java 7 will be changing alot it will be game changing js", "group_id": 95, "id": 1083996}, {"user_id": 719, "stars": [{"date_created": 1305651883.0638051, "user_id": 960}, {"date_created": 1305656741.2177169, "user_id": 15929}, {"date_created": 1305695138.869947, "user_id": 22924}, {"date_created": 1306217947.934607, "user_id": 15162}], "topic_id": 35567, "date_created": 1305646824.9124589, "message": "<<Troll Mission : Success>>", "group_id": 95, "id": 1084359}, {"user_id": 15929, "stars": [{"date_created": 1305696452.095088, "user_id": 15141}], "topic_id": 35567, "date_created": 1305657803.9907761, "message": "I honestly think that java has never been to the other side of the shark, so to speak. had to took 2 classes during uni on Java, right there and then I know it's not for me. Avoid it like a plague. kinda hard decision, cause back then, a lot of interesting classes requires Java, including UI design and application testing and stuff (requires jUnit was it? the tool on java to write test cases)", "group_id": 95, "id": 1086397}, {"user_id": 11946, "stars": [{"date_created": 1305877028.645942, "user_id": 8195}], "topic_id": 35567, "date_created": 1305841876.654716, "message": "Also Java + GWT is very powerful combination imho.", "group_id": 95, "id": 1117045}, {"user_id": 11946, "stars": [], "topic_id": 35567, "date_created": 1305841842.773649, "message": "Hmm, how about strong typing, generics coding against interfaces?", "group_id": 95, "id": 1117033}, {"user_id": 15929, "stars": [{"date_created": 1307258202.348525, "user_id": 2376}], "topic_id": 35567, "date_created": 1305871953.366482, "message": "i think azureus is the best example for java. the early days of the app was horrendous, please excuse my French, but many of java dev land on this end of the equation. however, recent days of azureus just show how powerful java is. it's a huge gun, spend the time to learn using it properly", "group_id": 95, "id": 1121262}, {"user_id": 15929, "stars": [], "topic_id": 35567, "date_created": 1305871414.1405971, "message": "it probably is. I guessed my point was, bigger gun doesn't make a better shot", "group_id": 95, "id": 1121165}, {"user_id": 33308, "stars": [], "topic_id": 35567, "date_created": 1305935258.8920391, "message": "Anyone know why linkedin chose and still use mostly java? Is it just because of employee expertise and exisitng infrastructure?", "group_id": 95, "id": 1131388}, {"user_id": 26065, "stars": [{"date_created": 1305947140.223841, "user_id": 9108}], "topic_id": 35567, "date_created": 1305943144.297534, "message": "I don't know why they chose it, but why they still use it is obvious: You never change a running system, especially of that magnitude unless you really have to. Potential gains never out weight the risks. Besides, while java is not something to build a startup in these days it is a very strong platform for mature services (as is .net btw).", "group_id": 95, "id": 1131731}, {"user_id": 323, "stars": [], "topic_id": 35567, "date_created": 1305953949.62836, "message": "I've programmed for > 10 years with java, but after Oracle bought Sun, I just can't see recommending it as a technical choice to another company. It's just not where the creative force of our industry is anymore.", "group_id": 95, "id": 1132684}, {"user_id": 323, "stars": [], "topic_id": 35567, "date_created": 1305954036.9470639, "message": "JavaOne, for example, was *vibrating* with innovation 7 or 8 years ago. It was where *all* the engineers went. I didn't feel that a couple years ago. Innovators went elsewhere.", "group_id": 95, "id": 1132691}, {"user_id": 14692, "stars": [], "topic_id": 35567, "date_created": 1305968505.3546209, "message": "I wouldn't say it has jumped the shark exactly and java is going to be around for a very long time.  I've worked developing trading systems for investment banks for the past 10 years and it is still very much the language of choice for enterprise and server side development in financial institutions.  You won't get very much traction in this environment suggesting a trading system written in python or ruby.  Having said that I wouldn't recommend Java for GUI or Web.  I do worry about Java's future under Oracles stewardship.", "group_id": 95, "id": 1133325}, {"user_id": 14692, "stars": [{"date_created": 1305968983.488193, "user_id": 2382}, {"date_created": 1305969375.344763, "user_id": 14692}, {"date_created": 1305991622.67922, "user_id": 9108}, {"date_created": 1305994787.068095, "user_id": 3444}, {"date_created": 1306004552.4129829, "user_id": 28606}, {"date_created": 1306030077.4480331, "user_id": 22924}], "topic_id": 35567, "date_created": 1305968942.5617909, "message": "I've also noticed that the community here primarily consists of Python/Ruby front end type developers, so that may influence the direction of the discussion here.  As a consultant with a family I know which language I'll choose for the next 10 years to keep bread on the table for my family.  That said I do remain a keen follower of alternative languages, it's certainly important for any developer worth their salt to understand different concepts and languages.  I'll always reject a candidate in an interview if they display any kind of religious adherence to one language.", "group_id": 95, "id": 1133330}, {"user_id": 26395, "stars": [], "topic_id": 35567, "date_created": 1305991922.8679631, "message": "why nobody mentions Adobe AIR *pouts*...", "group_id": 95, "id": 1134551}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305996189.9519179, "message": "@amiamirul adobe air was a failure", "group_id": 95, "id": 1134987}, {"user_id": 26395, "stars": [], "topic_id": 35567, "date_created": 1305997736.544482, "message": "@italiano40 TweetDeck and Destroy Twitter are testaments of Air's potential in desktop apps", "group_id": 95, "id": 1135143}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1305997901.148963, "message": "@amiamirul i don't use those at all, but i when i say adobe air is a failure i mean i pretty sure with chrome apps and firefox pin apps those are replacing and phasing out what is left in air's software, i live in my browser i don't need another then outside my browser to show me something that can be in my broswer and i feel more people live inside a broswer so it is dead", "group_id": 95, "id": 1135159}, {"user_id": 15929, "stars": [{"date_created": 1306015041.5990341, "user_id": 9108}], "topic_id": 35567, "date_created": 1306001842.728231, "message": "@italiano40 it amazes me that you can call something a failure when you don't even use it. 'motorbike is a failure. I drive a car, I don't think bikes should even exist'", "group_id": 95, "id": 1135489}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1306001934.4118891, "message": "@unwrangle FACEPALM, i never used tweetdeck or destory twitter, but i have used adobe air so maybe you need to read better, and second it is a failure what websites still use it not that many", "group_id": 95, "id": 1135499}, {"user_id": 15929, "stars": [], "topic_id": 35567, "date_created": 1306002061.892828, "message": "all I'm saying is that it's not a zero sum game. you clearly not a target market for air apps.", "group_id": 95, "id": 1135516}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1306002162.0027349, "message": "@unwrangle i havent seen one website i use say they have an adobe air app so maybe i would use it if a good website that is why it is a failure not because it is bad, it is because it is phased out", "group_id": 95, "id": 1135524}, {"user_id": 15929, "stars": [], "topic_id": 35567, "date_created": 1306003260.353219, "message": "@amiamirul has pointed out a couple of great example for air apps. if it's not for you, then so be it. personally I think air is a fun platform, m$ kinda tried to copy it with silverlight before they pivot it. maybe you didn't say this way but, if you meant HTML 5 stole their thunder, then I completely agree. and to circle back to the topic, I think air is more fun than java", "group_id": 95, "id": 1135634}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1306003910.022393, "message": "@unwrangle first off he pointed out two twitter applications if it is only good for twitter than yes it isn't for me and i am on a mac so don't care about silverlight, actually html5 did but also with chrome web applications i feel like that replaced it, and to say air is more fun than java, then you have never used java correctly, java isn't for making applications with gui's, it is made for backend stuff and with it's regx patterns also make for a good irc bot but it isn't suppose to be fun, i don't want my languages fun i wan them cutting edge technology, robust, scalable, maintainable, and easy to deploy which java gets it a jar file and you can run it from a mac OSX command line or a linux command or windows command prompt", "group_id": 95, "id": 1135679}, {"user_id": 21348, "stars": [], "topic_id": 35567, "date_created": 1306090671.245971, "message": "@italiano40 I would think \"used [...] for servers, backend for websites\" is indeed what mainstream means. :P", "group_id": 95, "id": 1143324}, {"user_id": 21348, "stars": [{"date_created": 1307267747.0849199, "user_id": 26305}], "topic_id": 35567, "date_created": 1306098340.4535699, "message": "@italiano40 Certainly there's a *lot* more engineering than meets the eye (behind web front-ends -- where, I agree, Java has lost terrain probably not to recover again). Given that arguably most developers start with small front-end apps, I would say Java is mainstream, but not hip anymore.", "group_id": 95, "id": 1144160}, {"user_id": 4149, "stars": [], "topic_id": 35567, "date_created": 1306094732.62938, "message": "@shrein no mainstream means making GUI applications for deployment and i think right now java isn't really strong in that area, but i wouldn't think twice about deploying a tomcat server with some java servlets for a strong, robust web site", "group_id": 95, "id": 1143745}, {"user_id": 1692, "stars": [], "topic_id": 35567, "date_created": 1306133677.6003611, "message": "However there also examples for pretty good Desktop applications written in Java, i for one really like Netbeans for Web Development and Eclipse has a huge following aswell. Sure they use a bit more resources than traditional c++ apps but with todays computing power, boatloads of RAM and SSDs that isnt really an issue anymore.", "group_id": 95, "id": 1149381}, {"user_id": 1692, "stars": [], "topic_id": 35567, "date_created": 1306133590.151372, "message": "java is much to verbose and complex for small to medium size web projects. But for serverside enterprise applications its still the best choice because alot of stuff is already there.", "group_id": 95, "id": 1149376}, {"user_id": 8595, "stars": [{"date_created": 1306168927.7267821, "user_id": 34025}], "topic_id": 35567, "date_created": 1306167680.214746, "message": "I agree with @coopernurse -- I think a lot more people would be using Java if those languages weren't around. The JVM is an awesome platform, if not the taste of some. Dynamic languages like Scala, Clojure, Groovy, and languages rebuilt on the JVM (JRuby, JHaskell) most of which don't lose too much performance wise, are extremely attractive alternatives for those who don't want to learn Java, or would much prefer dynamic typing. Without these languages though I think Java would possible be used much more, especially for FOSS", "group_id": 95, "id": 1154269}, {"user_id": 28054, "stars": [], "topic_id": 35567, "date_created": 1306166700.744482, "message": "Java (the language) is becoming less and less interesting now that Scala and Clojure are in the mix IMHO", "group_id": 95, "id": 1154173}, {"user_id": 28054, "stars": [], "topic_id": 35567, "date_created": 1306171333.723664, "message": "Agreed @eyenstyn - After 15 years of Java I'm starting to learn Clojure.  Initial thoughts are very positive.  Greatly simplified tooling, plenty of example projects to learn from, decent performance.", "group_id": 95, "id": 1154771}, {"user_id": 34070, "stars": [], "topic_id": 35567, "date_created": 1306203544.407912, "message": "Java is the pleated khakis of the software world. @hipsterhacker", "group_id": 95, "id": 1160327}, {"user_id": 13404, "stars": [], "topic_id": 35567, "date_created": 1306232706.08094, "message": "@injekt I wouldn't really call Scala a dynamic language. Scala is a statically typed language (with the appearance of a dynamically typed language in some cases)", "group_id": 95, "id": 1164737}, {"user_id": 8595, "stars": [], "topic_id": 35567, "date_created": 1306233577.2939379, "message": "@MartinGross Yeah that's true, I haven't really touched it so made some bad assumptions. I guess I meant functional. You're quite right", "group_id": 95, "id": 1164777}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307028397.4778781, "message": "@loughtonSpur Actually as far as I know, some investment banks and quite a few hedge funds are using Python or evening moving to Python wholesale.  And a LOT of high-frequency trading places use Python for non-critical-path stuff, while leaving all the trading infrastructure in C++, C, or FPGAs.", "group_id": 95, "id": 1267988}, {"user_id": 34929, "stars": [], "topic_id": 35567, "date_created": 1307028863.4291241, "message": "Java's very stable though, and is very speedy (once the JVM is up and running)", "group_id": 95, "id": 1268050}, {"user_id": 8649, "stars": [{"date_created": 1307029797.191926, "user_id": 26065}, {"date_created": 1307034731.3346839, "user_id": 15929}], "topic_id": 35567, "date_created": 1307028526.58583, "message": "Part of the reason Java has such a strong presence in \"big enterprises\" is because it is a tool favored by the types of programmers that enterprises favor managing, i.e. a middle manager can reason about the bulk efficacy of a team of middle-of-the-road Java programmers, whereas trying to manage a heterogenous mix of maverick Python/Ruby hackers might not really be the best way to advance their management career.", "group_id": 95, "id": 1268008}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307028563.826395, "message": "There is definitely a bit of \"no one ever got fired for buying Microsoft\" mentality when it comes to choosing Java in \"enterprise\" environments.", "group_id": 95, "id": 1268017}, {"user_id": 2726, "stars": [], "topic_id": 35567, "date_created": 1307031683.566679, "message": "@amiamirul Air's potential to leak memory. :) That was my big complaint.", "group_id": 95, "id": 1268444}, {"user_id": 34929, "stars": [{"date_created": 1307094673.5140719, "user_id": 12641}], "topic_id": 35567, "date_created": 1307033298.1327071, "message": "Whoa whoa wait, I just noticed @pwang's earlier quote... should be IBM in there, not Microsoft ;)", "group_id": 95, "id": 1268662}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307037577.6795731, "message": "Wondering who would catch that :)", "group_id": 95, "id": 1269227}, {"user_id": 9108, "stars": [], "topic_id": 35567, "date_created": 1307218352.95244, "message": "I figure most people in this group saw it on HN, but if not this made it to the front page: http://www.javacodegeeks.com/2011/06/hate-java-fight-wrong-battle.html", "group_id": 95, "id": 1288508}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307224785.6955509, "message": "I don't think I can make any comments about that article without repeating what's already said in the comment thread on HN (http://news.ycombinator.com/item?id=2619417)", "group_id": 95, "id": 1289510}, {"user_id": 8649, "stars": [{"date_created": 1307224981.310518, "user_id": 26065}], "topic_id": 35567, "date_created": 1307224834.8040819, "message": "But IMHO it speaks volumes if your best defense of a language is that \"COBOL sucks worse\".", "group_id": 95, "id": 1289519}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307225000.1196549, "message": "To be fair, though - Java as a language can be productive in the hands of the right people. The problem is that most developers don't code in a vacuum, and Java teams can frequently fill up with mediocre programmers.", "group_id": 95, "id": 1289538}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307225063.6622491, "message": "(My talk was informed by particularly annoying interactions with some Java programmers at a large company that had been commanded to start developing in Python.)", "group_id": 95, "id": 1289546}, {"user_id": 8649, "stars": [{"date_created": 1307259881.272064, "user_id": 15929}], "topic_id": 35567, "date_created": 1307225018.0000911, "message": "I touched on this during my lightning talk on Python Evangelism during SciPy 2010: http://www.archive.org/details/Scipy2010-PeterWang-PythonEvangelism101", "group_id": 95, "id": 1289540}, {"user_id": 26065, "stars": [], "topic_id": 35567, "date_created": 1307225474.855515, "message": "watching it right now...", "group_id": 95, "id": 1289585}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307226497.768244, "message": "Thanks!  I do think it's an important point, and one that is oftentimes missed when people talk about the power of dynamic languages.", "group_id": 95, "id": 1289704}, {"user_id": 26065, "stars": [], "topic_id": 35567, "date_created": 1307226092.8389499, "message": "good talk, interesting observation about the scalability of the language with the level of the programmer.", "group_id": 95, "id": 1289650}, {"user_id": 26065, "stars": [], "topic_id": 35567, "date_created": 1307226764.0420561, "message": "Totally agree. I never thought of it this way, makes perfect sense", "group_id": 95, "id": 1289743}, {"user_id": 15929, "stars": [], "topic_id": 35567, "date_created": 1307260090.932343, "message": "@pwang dude, great talk. thanks for sharing that. I'm having the same feeling for awhile now about node.js (even js in general) as opposed to Python at your talk. love it.", "group_id": 95, "id": 1292242}, {"user_id": 8649, "stars": [], "topic_id": 35567, "date_created": 1307306176.752769, "message": "Thank you!  \"Share and Enjoy!\" :)", "group_id": 95, "id": 1295339}, {"user_id": 35341, "stars": [], "topic_id": 35567, "date_created": 1307365009.7685151, "message": "Java is so old news it's almost hip again.", "group_id": 95, "id": 1302654}]