[{"user_id": 11626, "stars": [], "topic_id": 9013, "date_created": 1298622995.4446521, "message": "(Infowars) – When George Orwell (pen name of Eric Blair) first published his famous novel, Nineteen Eighty-Four, it was the year 1949, and it told a dark story of what he envisioned life may be like in the future-in the year 1984. His book, as well as his name, have become synonymous with privacy concerns involving technology and also an all-powerful, oppressive ruling elite that strictly governs the activities of the population with an iron fist.\r\n\r\nOrwell’s book is where we get the term Big Brother from, such as when people say “Big Brother is watching you.” When people say this, they’re referring to the omniscient surveillance system described in the novel that continuously watched and listened to people-even in their own homes. When we call something Orwellian to describe the invasiveness of certain technology or government policies, we are also referring to George Orwell’s nightmarish vision he described in his novel. There are several other terms that Orwell himself coined in Nineteen Eighty-Four, such as doublethink, thoughtcrime, and memory hole, which have also become part of our vernacular.\r\n\r\nEven if you have not read the book or seen the film, you are still undoubtedly familiar with the issues that make up the storyline, such as the high-tech surveillance system watching and listening to everyone in order to keep them in line with the government (called the Party in the novel). You are probably also familiar with the concept of a small elite ruling class (what Orwell calls the Inner Party) living in luxury and wielding unimaginable power over lower level citizens. In the novel, people have lost their freedom, their critical thinking skills, and even the ability to love due to the cultural depths society has sunk to as a result of Big Brother’s control. The reason Nineteen Eighty-Four remains so popular, and the reason society has adopted vocabulary from the book, is because it serves as more than merely a fictional novel for the reader’s entertainment. The novel served (and continues to serve) as a stark warning of what the future may hold if we don’t resist invasive technology and oppressive government policies, or if the population at large becomes so lost in a world of pop culture, sports entertainment, or our own selfish desires, that we simply don’t care. My new non-fiction book, Big Brother: The Orwellian Nightmare Come True, looks at technology that now exists or is under development and will exist in the near future, that threatens to make our world just as horrific or even worse than the world George Orwell described. I have assembled information from mainstream news sources, industry experts, and even patent numbers of the most invasive and sinister Orwellian devices anyone could dream of. We will also look at actual government programs and policies that seem as if they came right out of Orwell’s dark imagination, such as the government secretly paying mainstream media reporters to act as gate-keepers and propagandists for the establishment, and the FBI illegally spying on and smearing peaceful political activists who were seen as problematic.\r\n\r\nI am certainly not anti-technology. Technology is a fantastic tool which can benefit those who use it, or harm them, depending on the intentions of the person designing it or using it. Technology has brought us amazing inventions that would seem supernatural to civilizations that lived just a few hundred years ago. Arthur C. Clark, the author of 2001 a Space Odyssey, was correct when he said, “Any sufficiently advanced technology is indistinguishable from magic.” While this magical technology has brought us the convenience of calling our friends or family on our cell phones, allowing us to talk with them from virtually anywhere in the world, and given us the ability to watch events on the other side of the earth unfold live on television, and other wonders such as the Internet, DVR recorders, YouTube, Excel spread sheets, word processors, e-mail, Facebook, and more; it has also brought us identity theft, illegal wiretaps, Peeping Toms using hidden video cameras, cyber stalkers, and worse. If you have ever left your cell phone at home when you’ve left the house for the day, you’ve realized how much we depend on technology for what have become common and necessary activities. If you’ve ever been at home when the electricity unexpectedly goes out, you have also realized how much we take for granted in our modern world.\r\n\r\nUnfortunately, with tremendous advances in technology often come unforeseen consequences. Nobody could have envisioned young teenage girls taking nude photos of themselves with their cell phone cameras and sending them to their boyfriends, and then having the boyfriends forward them to others, eventually ending up on the cell phone of someone over the age of eighteen, resulting in what is essentially child pornography in their possession. The music and film industries certainly didn’t anticipate millions of Internet users downloading music and movies for free, sometimes before the products are even officially released. And when Albert Einstein was searching for the laws of physics to learn how our Universe functioned, he could have never imagined that his work would be used to design weapons capable of destroying the entire earth. It seems that the dark minds of men in power always strive to build sinister devices designed to enable them to hold onto their power, no matter how disastrous the consequences.\r\n\r\nIn my book I will show you some of the sinister inventions currently in operation, as well as the ones on the drawing boards, and the ones mad scientists are hoping to one day create. Facial recognition video cameras that can pick you out of a crowd of tens of thousands of people in a split second, machines that can read your mind, high-tech killer-robots, psychotronic weapons that can literally put voices in people’s heads, and more. You will see beyond a doubt that George Orwell’s description of Big Brother was chillingly accurate, and perhaps not as horrific as the reality we may one day face. Like a Pandora’s Box, once much of this technology is created, there will be little hope of stopping it or even regulating it.\r\n\r\nIf one reads old Popular Mechanics magazines from the 1950′s, one can realize how wrong, and even silly, the techno-utopian dreamers were in the past. Many were led to believe that by the twenty-first century we would all be living lives of luxury like the Jetsons, with large blocks of free time to enjoy ourselves as we had most manual labor and menial tasks taken care of by robots and computers. Yet more than a decade into the twenty-first century, we still need to spend time cooking and cleaning, and commuting to work and raising the kids, and fixing up the house and countless other tasks and obligations that are required of us in our daily lives. Our cars must still continuously be maintained, the oil needs to be changed, the engine serviced, the tires rotated and replaced, and the average vehicle now costs as much as a house did for people just two generations ago. The grass still needs to be cut, the bushes need to be trimmed, and things around the house continue to break and need to be fixed or replaced. People are working longer hours, having less time with their families, having to retire later in life, and are having less savings than past generations. Where is this techno-utopia that so many had promised would come in the near future?\r\n\r\nInstead of living lives of luxury and leisure, now many people can’t escape their job even after they leave the office. Where once we left work and were outside of the reach of our boss, now he or she can call us on our cell phone at anytime, day or night, and expects a promptly returned phone call or e-mail.\r\n\r\nPeople are being turned into numbers and statistics, and mathematical formulas are used by employers to determine whether an employee is being efficient enough. It’s difficult to get a person on the phone when calling a company’s customer service department, and social networking sites such as Facebook and Myspace have turned everyone into their own favorite celebrity and supplement actual friendships and interactions. People don’t need to get together for a dinner party to catch up on each other’s lives anymore; we just monitor their newsfeed on Facebook from the comfort of our own home while sitting in our favorite chair getting fatter from lack of exercise and a poor diet. Where we once discussed politics and religion with our friends and neighbors, such topics have become taboo and are replaced with the enticing entertainment of celebrity news as most people feel that it is more important to know about who our favorite celebrities are dating than it is to know what bills are being introduced and voted on in the halls of Congress or our own city council. It’s interesting that while people seem to be getting dumber, computers are getting smarter.\r\n\r\nWe are becoming a nation of morons who can’t think for themselves, and are being dehumanized into nothing more than a mentally enslaved workforce who are constantly being monitored, databased, and kept in line by the fear of the omniscient Big Brother technology that has gotten so advanced and so cheap, that the watchful eyes of surveillance cameras are mass produced, almost as if they were disposable.\r\n\r\nAt a presentation at the 2010 DICE Summit (Design, Innovate, Communicate, Entertain), an annual meeting of videogame executives, Jesse Schell, the former Creative Director of the Disney Imagineering Virtual Reality Studio, gave a speech on the future of gaming and talked about how in the future, “Before too long we’re going to get to the point where every soda can, [and] every cereal box is going to be able to have a CPU, a screen, and a camera on board it, and a Wi-Fi connecter so that it can be connected to the Internet.”\r\n\r\nHe concluded his speech by saying that our children and grandchildren will be able to know exactly what books we’ve read, what foods we ate, and practically everything we’ve done in our entire lives. He gave this speech not to warn people about these Orwellian technologies, but he was extremely excited about them, and looked forward to them.\r\n\r\n“You have no idea what books your grandparents read, or where they went on a daily basis, but these sensors that we’re going to have on us and all around us everywhere are going to be tracking and watching what we’re doing forever,” Schell said. He concludes by saying that because we will all be constantly watched and our actions and interests databased forever, that we’ll possibly be better people and be nicer and make better decisions because of the fear of judgment from others. Is this the kind of world you want to live in? Well, it’s the kind of world that’s rapidly approaching.\r\n\r\nBig Brother: The Orwellian Nightmare is meant to serve as a warning for what is already here, and what is soon to come. It is to encourage people to think about how to possibly prevent or minimize dramatic hazards to our lives by the very technology we have created. It is my goal to give you an accurate forecast of the coming storm so that you as an individual, and we as a society and species, may be better equipped to handle it when it hits. It is my hope that we do not lose our privacy, freedom, or our humanity in this 1984-style New World Order.\r\n\r\nhttp://static.infowars.com/2011/02/i/article-images/instruction.jpg\r\n\r\nhttp://static.infowars.com/2011/02/i/article-images/cometrue2.jpg\r\n\r\nhttp://dprogram.net/2011/02/24/big-brother-the-orwellian-nightmare-come-true-mark-dice", "group_id": 3920, "id": 206598}]