[{"user_id": 844, "stars": [], "topic_id": 46960, "date_created": 1319419162.297338, "message": "I have been a user of Python for a while now but as a solo learning experience I'm still frustrated. I don't have people next to me to pick up from. And while I have tried to start a Python users group in town that has not yielded much result.", "group_id": 292, "id": 2417258}, {"user_id": 844, "stars": [], "topic_id": 46960, "date_created": 1319419482.3623791, "message": "The problem as I now see it is that I consistently  run into issues as I use python, and I'm don't have a handy guide as to how to resolve the issues,, When I see a traceback I am often mystified what to do next. How to see the variables, particularly if they are in objects of various types.. How to execute modules that are part of larger systems , using various debug tools.. how to trace down missing imports.. how to figure out what packages are where ( I think I'm finally getting somewhere with this..", "group_id": 292, "id": 2417295}, {"user_id": 844, "stars": [], "topic_id": 46960, "date_created": 1319419951.467716, "message": "So are there some pointers that the true pythonistas can share? I want to join the secrets society! I may have missed something obvious, would not be the 1st time..", "group_id": 292, "id": 2417362}, {"user_id": 844, "stars": [], "topic_id": 46960, "date_created": 1319420388.5259321, "message": "as I look through some of the questions here they are in the same vein,, so maybe there might be a way to put a simple faq type guide for some of these types of questions,, I'm just at the early edge of being able to start, So that has prompted me to ask to see what else I have missed.", "group_id": 292, "id": 2417413}, {"user_id": 16589, "stars": [], "topic_id": 46960, "date_created": 1319435387.798327, "message": "When you see a traceback, the first thing to do is to read it very attentively. This sounds trite, but it's easy to be put off by a wall of message and to skim over it. Open the files referenced, read the code, and try to understand it. \n\nPersonally I find IPython fantastic for exploring modules: http://ipython.org/\nOne of the things it can do is to automatically start the debugger when an exception is raised, so that you can examine the program state at that point.\n\nJust in case, for the basics work through: http://learnpythonthehardway.org/ and http://www.diveintopython.net/", "group_id": 292, "id": 2418982}, {"user_id": 844, "stars": [], "topic_id": 46960, "date_created": 1319471214.3574719, "message": "I agree that Ipython is proving quite useful.. And I have read through the books which cover \"programming\" quite well but not usage in the broader sense. For instance learning the whys and wherefores of Distribute, what to do when libraries go wrong, how to figure that out etc.. and then there is virtual env.. And nothing seems to cover debugging larger projects.. I also use four versions of Python on my system, and that took a while before I figured out how to do it properly... (2.5 for app-engine, 2.6 shipped with my Ubuntu and 2.7 for new projects, and then there is Python 3) Which once you are beyond the basics you tend to dive into using Python tools, and sometimes having issues... :-) NEW Python users run into these issues way before they are \"prepared\" to deal with them.", "group_id": 292, "id": 2421257}, {"user_id": 5630, "stars": [], "topic_id": 46960, "date_created": 1319479039.465663, "message": "@neaj +1 for these suggestions... Really good stuff.", "group_id": 292, "id": 2422186}, {"user_id": 16589, "stars": [], "topic_id": 46960, "date_created": 1319968515.8703101, "message": "\"when libraries go wrong\" <-- That's like \"how long is a piece of string\". It might be a bug in the library, it might be a bad interaction with some other software, or the library might just not work the way you think it does. General troubleshooting practice applies. The first step is usually to try and boil down your issue to something simple and reproducible that clearly illustrates your problem. This may help you fix it, and also helps when asking on sites like http://stackoverflow.com/", "group_id": 292, "id": 2467384}, {"user_id": 16589, "stars": [], "topic_id": 46960, "date_created": 1319968026.5340409, "message": "I can only agree that `distribute` and the whole setuptools saga is a pain. Try and avoid it. Stick with http://guide.python-distribute.org/installation.html and try not to get caught up in the acres of blogs debating the whys and wherefores. The guide is on https://bitbucket.org/tarek/hitchhiker-guide-packaging/issues/ where you can log issues, and there is a mailing list. ", "group_id": 292, "id": 2467357}, {"user_id": 16589, "stars": [], "topic_id": 46960, "date_created": 1319968851.1300931, "message": "For normal use of virtualenv, everything you need should be at http://www.virtualenv.org/", "group_id": 292, "id": 2467407}]