[{"user_id": 7364, "stars": [], "topic_id": 9754, "date_created": 1299001154.6252661, "message": "One of the most frequently asked Pyramid questions is whether to use URL dispatch or traversal (or both) with a project. Which are people using, and why ?", "group_id": 2163, "id": 236402}, {"user_id": 6543, "stars": [], "topic_id": 9754, "date_created": 1299001572.136035, "message": "url dispatch when i use non-zodb apps, traversal with zodb apps", "group_id": 2163, "id": 236424}, {"user_id": 7364, "stars": [], "topic_id": 9754, "date_created": 1299001976.5820451, "message": "@chrismcdonough: do you think traversal is suitable for sqla apps ?", "group_id": 2163, "id": 236446}, {"user_id": 6543, "stars": [], "topic_id": 9754, "date_created": 1299003105.8843291, "message": "for people who really know what they're doing in applications where traversal makes sense (like apps that need very granular security), yes... that's probably not a very large percentage of apps though", "group_id": 2163, "id": 236524}, {"user_id": 7364, "stars": [], "topic_id": 9754, "date_created": 1299004231.5984631, "message": "I've found it's quite possible to have granular security using url dispatch+factories", "group_id": 2163, "id": 236683}, {"user_id": 7364, "stars": [], "topic_id": 9754, "date_created": 1299004293.2215121, "message": "although you don't have the \"inherited\" permissions traversal might give you", "group_id": 2163, "id": 236692}, {"user_id": 16188, "stars": [], "topic_id": 9754, "date_created": 1299005762.576966, "message": "Whenever I build web apps these days 90% of the time data access benefits from a REST-style interface.  One such use case is building a rich javascript-based front end using Dojo's JsonRestStore.  REST-style interfaces are far easier to build (in my experience) on top of traversal based systems.  So I've been experimenting heavily with patterns to enable simple traversal-based interfaces on top of pyramid+SQLAlchemy.  There are a number of us working on such patterns, it would be nice to come to some sort of agreement.", "group_id": 2163, "id": 236970}, {"user_id": 7364, "stars": [{"date_created": 1299072261.9809439, "user_id": 12404}], "topic_id": 9754, "date_created": 1299012383.6398571, "message": "The only real concern with sqlalchemy+traversal is ensuring that the traversal doesn't cause unnecessary queries, especially in deeply nested URLs.", "group_id": 2163, "id": 238116}]