[{"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320177237.398519, "message": "I've sent some advanced environemntal / ambience details to the StarryExpanse team. I've sent those to the sponsoring EMail adress because I didn't know where else.", "group_id": 11772, "id": 2485842}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320177328.5301881, "message": "Anyway, now here are all the suggestions. I don't know how this 'forum' exactly works but I try to list them: Please add some big fish in the water! Barely seen in the deep. If you get things done and enough time, that would be an awesome detail for extra!\n \n----\n \nIf you want to get even further add slight cultures of algae, seaweed and fisch-schools!\nWhile you're at it, Add sea-gulls, random weather effects and other small animals that make the island live!\nIf I were on the Starry Expanse team, I'd even include extremely rare weather phenomenas, just as: Really dense fog, snow blizzard, physical wind and dry leaves flying about, micro-tiny-insects flying about and making buzzing noise. crickets (especially at night and dry locations), Ionic lighting storms (just a little above your ordinary lighting storm: extra-electrical), dryness (and the resulting haze due evaporating water).\nMoon-cycle ;) Other weather-conditions that appear so rare: 1st: They won't feel un-natural, keep the player surprised for months, if not years!\nRainbows or alternative dawn conditions.", "group_id": 11772, "id": 2485852}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320177401.6497581, "message": "And those are the newer suggestions. (The formatting possibilities on this forum are really terrible) -Glowing Fireflies (very small, not as obvious they would appear in another game/movie).\n-Ground dust stirring up due physicaly existing wind-events, similar to a desert sand-storm.\n-Special Astronomical details: Shooting-stars, faintly visible star-clusters/galaxies and smoothly colored nebulaes. Alternating degree of visibility. (some night you would see the whole glory).\n-Glowing/flickering stars and various levels of atmospheric haze (repeat last scenario: More or less visibility).\n-Going even further would mean: Making a seagull hunt for a fish or land on the water, making the water splash with a sound (very rare!).\n-A frog hopping about, coming out of the bushes and making the typical frog noise. Only appearing in wet regions obviously.\n-Thousands of environment sounds: The crack of a branch, wind whooshing trough the trees, gravel rolling down a hill, wind-events (matching them up with the real physical wind), insects, exotic birds, rumbles, distant calls, outerworldly cinematic chills, erosion (i.e. rocks crumbling and falling into the water. Ever heard that one?),\nPlayer sounds: breathing, movement, rustle, different footstep sounds for various surfaces (if you get rock, grass, metal thats okay. but If you wet rock, heavy rock, dusty rock, gravel, pebels, sand, grass, moss, wood, light wood, moldy wood, earth, swamp, moisture levels, and constant erosion sound due the wind corresponding to the current environment. Thats even better!", "group_id": 11772, "id": 2485862}, {"user_id": 41763, "stars": [{"date_created": 1320215837.1443, "user_id": 38225}], "topic_id": 47372, "date_created": 1320203621.1888831, "message": "Note that I created a separate topic on wildlife in Starry Expanse. A very good point that someone brought up is that if you add a lot of new wildlife, it might disturb the puzzle for identifying animals. For example, if you add new frog varieties it may either confuse the player who is trying to identify the frog in the frog catching device, or make it too easy because you wouldn't have to catch the frog.", "group_id": 11772, "id": 2489129}, {"user_id": 41763, "stars": [], "topic_id": 47372, "date_created": 1320203663.5014081, "message": "Similarly, adding lots of other animals might break the idea that there are just five \"important\" animal species. However, adding very subtle things like fireflies might be a nice touch.", "group_id": 11772, "id": 2489135}, {"user_id": 38225, "stars": [], "topic_id": 47372, "date_created": 1320215819.8064189, "message": "@BuddhaMaster You have made some very good suggestions. Some we have already considered and have noted down, like fish schools and realistic and detailed weather effects, and some are new. I don't think we have considered including the firefly before, which is certainly a possibility - especially for the Jungle areas.\n\nOur ideal weather system is rather complex, and we're still working it all out, to see what is possible and what just won't work. Rare weather events like lightening storms are something we have discussed, but there are some things we have previously agreed not to do. Snow for example, is very unlikely to be found in Rivens tropical climate.\n\nWe need to be careful when it comes to player sounds. Including breathing noises would harm the everyman character of 'The Stranger' as breathing will obviously sound different for different people. So would footstep sound effects, and we're being careful how we go about this.\n\nSuggestions like these are the reason we set up a forum like this, so thanks so much for the input. Keep 'em coming!", "group_id": 11772, "id": 2490312}, {"user_id": 42853, "stars": [], "topic_id": 47372, "date_created": 1320261466.447731, "message": "I agree that the Stranger should not make any noises.  It would harm the experience more than it would help it.  I do like the idea of firefly's though.", "group_id": 11772, "id": 2493279}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320271640.543493, "message": "BUT, for my point of view. Sea-gulls are an absolute necessity! Because seagull prefer water and since Riven is all about Island- they would never truly interfere gameplay.", "group_id": 11772, "id": 2494349}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320271506.984108, "message": "Everything I've seen so far looks great and far beyond my expectation as long-term Myst fan can be. Thats some good suggestion considering the \"extra-animals\" part. You're right. Riven is hard as hell as it is. \"but\" the idea of complexity was exactly that, creating basically imossible puzzle to solve, so hard it would take you a lifetime study a whole world you don't know! Since it's still a game and STILL one of the hardest ever created, it would be wise to not include distracting animals. I like to hear that fireflies find some acceptance, but actually just don't overdo them, they tend to get corny very fast! --- Rather that do some dust-effects and especially leaves swirling about (jungle areas), make them affect different light conditions. Spider webs are another thing common to a living plant world.", "group_id": 11772, "id": 2494337}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320271887.671979, "message": "(I hate that \"pressing enter = submit post). What about hawks/vultures, since they would be very high up the sky, they wouldn't interfere gameplay either. Also consider the fact that a generic animal would not make the sound puzzle harder. Since he Player would be able to distinguish from the rest. And if it accidentally WOULD distract you from the puzzle, even better. Because thats part of the Riven natural environment ;)", "group_id": 11772, "id": 2494386}, {"user_id": 41710, "stars": [], "topic_id": 47372, "date_created": 1320276684.058217, "message": "As for weather, I think we've also agreed that especially violent weather should be left out, for the sake of the puzzles. We just don't want to leave the player solving a sound based puzzle in a hurricane, you understand.", "group_id": 11772, "id": 2494948}, {"user_id": 41710, "stars": [], "topic_id": 47372, "date_created": 1320276625.877804, "message": "I'm certainly going to work on ambient animals in the game. The only ones I think I've agreed with everyone on are some insects, small fish, and seagulls. Perhaps some predator birds as well. I definitely like the idea of fireflies in the jungle. Would add an extra element, and give some visual justification for all of the insect noises that area has.", "group_id": 11772, "id": 2494936}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320285441.0262251, "message": "It must not be every 15 minutes, but maybe after 5 month of playing, this would be a fun event you won't forget!", "group_id": 11772, "id": 2496037}, {"user_id": 41720, "stars": [], "topic_id": 47372, "date_created": 1320285764.4083059, "message": "I add my veto for Stranger sound effects. The footsteps that can be heard when the player exits one of the crystal chutes in Myst 4 ruined Spire for me.", "group_id": 11772, "id": 2496112}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320285390.5835159, "message": "Why not, solving a Riven puzzle inside a hurricane sounds like a lot of fun :D", "group_id": 11772, "id": 2496026}, {"user_id": 42853, "stars": [], "topic_id": 47372, "date_created": 1320510765.456347, "message": "I don't like the idea of really extreme weather.  If you do add it it would need to be extremely uncommon and furthermore should have 0% chance of occurring in the first say 20 hours of game play.  This way it would be even more unlikely to interfere with people who are trying to solve the puzzles, and would only be a nice surprise for those of us who wanted to really explore the world.", "group_id": 11772, "id": 2512330}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320533507.965519, "message": "Ok I've encrypted your message. Yes they would have to be extremely rare and not occuring the first 20h, also they need to appear in a way to not confuse the player. ere the solution could be: Don't do X special weather event if {Player didn't discover a new element or entered an unknown location} past 30 minutes! --- Merely to prevent the confusion element", "group_id": 11772, "id": 2514751}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320533170.7451551, "message": "So are you against rare weather events or not? It's hard to point your opinion. Them not appearing too often is the quintessential requirement to make them a rare surprise eperience, you wouldn't have to need a 0.0001% generic amount of appearance but rather say. Every 6 hour there is a 0.5% chance of any of those events. You could further surpress them by making certain cycles of generic weather schemes (seasons) and make the whole percentage raise by amount by hours played. Heres your non-interfering algorithm.", "group_id": 11772, "id": 2514706}, {"user_id": 43003, "stars": [], "topic_id": 47372, "date_created": 1320534255.3411889, "message": "Sorry to flood the discussion but my most preferred extra element would certainly be the extended astronomical/star details. That has always been a (mystical) involved part of MYST. Definitively needs shooting stars. A true star map and elements that would be visible rarely (due changing atmospheric conditions)", "group_id": 11772, "id": 2514843}, {"user_id": 41709, "stars": [], "topic_id": 47372, "date_created": 1320714777.0685329, "message": "Also, just to add to the night time thingy, I think it would be really neat to see this at night:\n(rrgh, how do you add images?! anyway, the one inside the moiety entrance looking out at the wahrk gallows)\nI think it would look really cool, especially if the wahrk skulls were illuminated in the moonlight. With that and the shadowy cliff face in the back, it would look very ominous and spectacular.", "group_id": 11772, "id": 2530067}]