[{"user_id": 11626, "stars": [], "topic_id": 7743, "date_created": 1298252009.605005, "message": "Two states have introduced legislative plans that would set up standing commissions whose members would be tasked with reviewing \"all existing federal statutes, mandates, and executive orders\" to determine their constitutionality, then recommending to lawmakers whether that state should \"nullify\" any federal law or regulation \"that is outside the scope of the powers delegated … to the federal government.\"\r\n\r\nAnd 28 more states are considering the move. Sometimes there have been inquiries from lawmakers, sometimes the requests for information and help have come from the governors' offices.\r\n\r\nIt's a huge leap beyond what already has developed among the states whose officials are telling Washington to back off on individual issues ranging from state marijuana laws, National Guard control, and the imposition of Obamacare, the nationalized health care program.\r\n\r\nAlready introduced in Montana and Arizona, the legislation is from The Patriots Union, a Wyoming-based organization that is taking in hand the battle against what it considers an overreaching federal government.\r\n\r\nIn Arizona, the bill already has been approved 5-2 in committee, and it now is headed up the ladder in the state legislature.\r\n\r\n\"Our view is we must save the states first, in order to save this nation. So that's where we focus,\" spokesman JB Williams told WND in an e-mail about the program.\r\n\r\nGet \"Taking America Back,\" Joseph Farah's manifesto for sovereignty, self-reliance and moral renewal\r\n\r\nBarbara Ketay, head of the organization's Constitutional Justice Division, was integral in researching and drafting the proposal, which was distributed to members of state legislatures where it now either has been introduced or is being developed.\r\n\r\nShe told WND her proposed legislation has options for states to describe the size and composition – or even designation – of their commissions. But the focus is the rights of the states which, according to the U.S. Constitution, includes everything not specifically assigned to the federal government. \t\t \r\n\r\n\"This is not anything new,\" she told WND. \"We just reiterated the power that the states have always had.\"\r\n\r\nBut she said over the past 70 or 80 years, the \"federal government has been encroaching on the [rights and responsibilities] of the states.\"\r\n\r\nBills such as those to nullify Obamacare or federal firearms rules are all fine, she noted. But this is a \"broad sweeping bill\" that will cover almost any dispute that a state would have with the federal government, she said.\r\n\r\nPotential to address issues\r\n\r\n\"This bill has the potential\" to address a large number of issues, she said. \"States have to realize they are sovereign. They have a compact with the federal government. The federal government was established to serve at the pleasure of the states.\"\r\n\r\nIn Arizona, the \"USPU Nullification Act\" was introduced as SB 1433 by Sen. Lori Klein, and it's being support by several cosponsors already. It first was introduced in Montana, where House Bill 382 is sponsored by Rep. D. Skees.\r\n\r\n\"If passed, the bill reasserts the states' right to nullify any federal statute, executive order or judicial intrusion which the state legislature deems unconstitutional and abusive toward the states or the people of the states,\" the Patriots Union explained.\r\n\r\nThe project was helped along by the work of Stand Up America, the organization run by Maj. Gen. Paul Vallely.\r\n\r\nAccording the Patriots Union, \"The sovereign states lost congressional representation of states' interests in 1913 with the passage of the 17th Amendment, which removed the constitutional right of each state legislature to choose two representatives of state interests, to be seated in the U.S. Senate.\r\n\r\n\"Since then, all branches of the federal government have increasingly acted against the best interests of the states and the people, reaching farther and farther beyond the scope and authority granted them in the U.S. Constitution and today, the federal government functions with utter disdain for both states' and individual rights.\"\r\n\r\nThe explanation continued, \"With no legitimate venue available in which to demand redress of grievances in the legislative, executive or judicial branches of the federal government at present, we have determined that the people of each state, via their elected stated officials, must take broad but specific state measures to force the federal government to live within the confines of the U.S. Constitution and the enumerated powers.\"\r\n\r\nProhibits 'infringement' of rights\r\n\r\nIn Montana, the proposal is \"an act prohibiting infringement of the state of Montana's constitutional right to nullification of any federal statute, mandate or executive order considered unconstitutional.\"\r\n\r\nIt specifically repudiates the federal belief that the \"Commerce Clause,\" the \"Necessary and Proper Clause\" or the \"General Welfare Clause\" are foundations for a complete federal control over states.\r\n\r\n\"Congress and the federal government are denied the power to establish laws within the state that are repugnant and obtrusive to state law and to the people within the state,\" it states.\r\n\r\n\"[This act] serves as a notice and demand to the federal government to cease and desist all activities outside the scope of the federal government's constitutionally designated powers.\"\r\n\r\nArizona's calls for its secretary of state to \"transmit copies of this act to the legislatures of the several states to assure that this state continues in the same esteem and friendship as currently exists and that this state considers union for specific national purposes and particularly those enumerated in the Constitution of the United States to be friendly to the peace, happiness and prosperity of all the states.\"\r\n\r\nIt also specifies that the president, president of the Senate, Speaker of the House and members of Congress be notified of the plan.\r\n\r\nThey both provide that if adopted, their state committees, \"may recommend for nullification existing federal statutes, mandates and executive orders enacted before the effective date of this section.\"\r\n\r\nFollowing the committees' recommendations, the state legislatures would vote on the validity of the federal action.\r\n\r\n'Of no effect'\r\n\r\n\"Until the vote, the issue in question is of no effect. … If the legislature votes by simple majority to nullify any federal statute, mandate or executive order on the grounds of constitutionality, this state and its citizens shall not recognize or be obligated to live under the statute, mandate or executive order.\"\r\n\r\nFurther, the \"committee shall ensure that the legislature adopts and enacts all measures that may be necessary to prevent the enforcement …\"\r\n\r\nAccording to the Tenth Amendment Center, which advocates a return to the constitutionally delegated powers for the federal government, Thomas Jefferson advised, \"Whensoever the general government assumes undelegated powers ... a nullification of the act is the rightful remedy.\"\r\n\r\nA multitude of nullification acts already are in the works across the nation on issues ranging from firearms freedom acts that reject some federal gun laws, a rejection of Washington's mandates on cannabis laws and even Obamacare.\r\n\r\nCenter founder Michael Boldin said the idea that states would reject a Washington demand is not radical, it's reasonable. He said what's radical is \"the idea that the federal government can be the final arbiter of the extent of its own powers.\" \r\n\r\nhttp://www.wnd.com/index.php?fa=PAGE.view&pageId=262773", "group_id": 3920, "id": 155488}]