[{"user_id": 11626, "stars": [], "topic_id": 6553, "date_created": 1297892467.0338991, "message": "Props to Steve Trimble at The DEW Line for posting a very interesting analysis of China’s new J-20 stealth fighter by Russian aerospace expert Vladimir Karnozov. He takes a look at the defining physical features of the jet to conclude that it’s most likely designed to be a long-range carrier killer.\r\n\r\nI won’t get into all the technical reasoning Karnozov uses to come to this determination,  however, he essentially says that the big jet is built for speed not maneuverability. Basically, the jet is designed to be stealthy and fast enough to evade enemy air defenses and fire anti-ship cruise missiles.\r\n\r\n    My impression from the J-20 is that it is an uncompromised airplane for supercruise, for flying at moderate supersonic speeds corresponding to Mach M=1.4–1.6. Such speeds can be achieved without afterburning. Surely, the J-20 can accelerate to M=2 and faster, but this would require engaging afterburners. In turn, the fuel burn will go high, lowering operational range of the aircraft and enlarging its heat signature.\r\n\r\n    In my view the Chinese designers optimized their new jet for M=1.4–1.6. Here comes the clue: the J-20 is a missile launching platform able to evade enemy interceptors by means of a high cruise speed. The J-20 may prove a good interceptor, — very possibly. But its main task seems to be anti-shipping: firing missiles at enemy warships while denying their air defense cover.\r\n\r\n    One day it may happen that the new Chinese jets would be used in anger. On such a day People’s Liberation Army would order its pilots to attack enemy warships off the coast of a freedom-loving island not far from the mainland China. In that sense the J-20 is a likely replacement for the JH-7A strike aircraft.\r\n\r\nHowever, Teal Group aviation analyst Richard Aboulafia thinks that using the J-20 as a carrier killer doesn’t make sense given the fact that stealth jets cost so much to develop and China is already working on ballistic missiles designed to do the same thing:\r\n\r\n    If real, [J-20] would fall under Secretary Gates “exquisite” category. Why not invest the enormous platform-related resources into better long-range stealth missile technology? That sounds like much better bang for the buck, especially since they could try to overwhelm US defenses with larger numbers that way. Also, how does it explain those radar signature-producing canards on the J-20? Still, you can’t discount the possibility.\r\n\r\nHere’s a link to Trimble’s posting featuring a translation of Karnozov’s article. Check it out for the technical reasons as to why the plane is a long-range strike jet, not an air superiority fighter.\r\n\r\nWhat do you guys think of this? Anyone have any more insight into the purpose of the J-20? We at DT have noted that the plane is awfully big for a fighter. It may be a sort of 21st century F-111 optimized to hit carriers and the like. Or, as Karnozov also points out, a plane this big could be a very fast interceptor like the old MiG-25. Maybe its just a tech demonstrator meant to prove that Beijing can build an airplane capable of stealth and supercruise. At the end of the day, we’re likely to keep guessing until the Chinese government spills the beans as to the true purpose of the J-20.\r\n\r\nhttp://defensetech.org/2011/02/09/is-chinas-j-20-stealth-jet-a-carrier-killer", "group_id": 3920, "id": 124889}]