[{"user_id": 30951, "stars": [], "topic_id": 36263, "date_created": 1306026477.3546741, "message": "I've realised I'm unclear on how to approach the thematic message with Dramatica. I'm going to use an older story idea as an example.\n\nThe thematic message was 'Betrayal vs loyalty'. Now, if I have a story, and lets assume the thematic message is fixed and can't / won't change, How should I select the OS Issue in Dramatica? Would it be.........\n\n1) by trying to find the Issue that most closely resembles Betrayal\n\nor\n\n2) by using the Issue to describe the actions in the story that refer to the Betrayal\n\nor .... something else?\n\nI used to do #1, but I think that is not the right approach.", "group_id": 2515, "id": 1139132}, {"user_id": 7645, "stars": [], "topic_id": 36263, "date_created": 1306034375.993546, "message": "There are some good thoughts about this elsewhere, I'll try and find them for you.", "group_id": 2515, "id": 1139639}, {"user_id": 7645, "stars": [], "topic_id": 36263, "date_created": 1306034347.777792, "message": "It's close to #2. The problem with the traditional A vs. B approach to theme is that it doesn't give you a clue as to how to prove it, and it is easily disproved because it is such a general blanket statement.", "group_id": 2515, "id": 1139635}, {"user_id": 7645, "stars": [], "topic_id": 36263, "date_created": 1306035079.2460499, "message": "Found it: http://www.dramatica.com/theory/tip_of_month/tips/tip0511.html", "group_id": 2515, "id": 1139691}, {"user_id": 30951, "stars": [], "topic_id": 36263, "date_created": 1306060915.3821559, "message": "Thanks Jim. That was what I was expecting (I'm starting to see somtimes I take the Dramatica terms too literally). \n\nAnother example of a theme, 'Crime doesn't pay'. Based on what you've said, lets assume I had 4 stories with exactly this thematic message. Does this mean that, the Dramatica OS Issues could be different for each one, depending on how the author wants to present this?\n\nI think this is a significant aspect of my Dramatica learning. 1 week ago I would have assumed they would all be the same Issue, one that matches 'Crime doesn't pay' as much as possible. I probably would have selected either 'Self-interest' or 'Approach' (depending on the one I considered the closest match) because they, to me, have the meaning closest to 'Crime doesn't pay'.", "group_id": 2515, "id": 1140855}, {"user_id": 30951, "stars": [], "topic_id": 36263, "date_created": 1306068757.7108991, "message": "Ok, that link pretty much answers my question. So in fact, I could (perhaps) use any of the 64 variations to provide a context to analyse 'Crime doesn't pay'.\n\nI think, as a start, I need to do two things before looking at dramatica Issues - 1) know my theme  2) know how I want to play with that theme. I guess, if I understand correctly, 2) will lead me to which Dramatica OS Issue I should choose.", "group_id": 2515, "id": 1141442}, {"user_id": 10814, "stars": [], "topic_id": 36263, "date_created": 1306126684.3822241, "message": "With Crime doesn't pay, one thing that jumps out at me is that it is either an Outcome:Failure and or Judment:Bad.  That would be the doesn't pay, part.", "group_id": 2515, "id": 1148522}]