[{"user_id": 3019, "stars": [], "topic_id": 35470, "date_created": 1307589373.370348, "message": "Menu:Soft White Cheese & Walnut Dip - A delicious dip of walnuts, feta, yoghurt, parsley and olive oil. Served with toasts.\nCheddar & Nigella Seed Biscuits with Spiced Green Apple - Rich, delicious, refreshing. Homemade crackers served with a Granny Smith, cider vinegar, garlic and chilli chutney/dip.\n\nTropical Summer Rolls with Sambal - Rice paper rolls stuffed with snow peas, pea shoots, daikon, carrot, shiitake mushrooms, basil, cilantro and mint, with a spicy sweet sambal and soy dipping sauce.\nMerguez Sausage Sandwiches with Sweet & Sour Onions - Homemade Turkish bread filled with homemade spicy lamb sausage, blacked red peppers and onions slowly cooked in sugar and sherry vinegar.\n\nCha Siu Thai Chicken - Chicken marinated in a sweet chilli sauce and then pan fried and served room temperature with cucumber, tomato, carrots, red onion, coriander and a ginger-soy-tomato dressing.\nSummer Vegetable Medley - A delightful mix of blanched corn, asparagus, peas, beans, zucchini, fennel, peppers, radishes, fresh mozzarella and then tossed in a lemon and mint dressing.\nSpinach Orzo - An accompaniment or on its own. A room temperature dish of orzo, spinach, dill, scallions, cos lettuce, parsley and a touch of lemon.", "group_id": 868, "id": 1345930}, {"user_id": 3019, "stars": [], "topic_id": 35470, "date_created": 1307589395.184665, "message": "registration page coming soon", "group_id": 868, "id": 1345932}, {"user_id": 30460, "stars": [], "topic_id": 35470, "date_created": 1307654294.449986, "message": "Do we have any pre-regs yet?  Have you considered 1 July as an alternate date?  I know we've had some success being the \"after-party\" for 2600...  (But that is 4 July weekend, so maybe people will be leaving the city fri. night.)", "group_id": 868, "id": 1353984}, {"user_id": 3019, "stars": [], "topic_id": 35470, "date_created": 1307676080.7859049, "message": "I haven't added this to eventbrite yet, we may have to move the date to work with groupon too.", "group_id": 868, "id": 1356987}, {"user_id": 3019, "stars": [], "topic_id": 35470, "date_created": 1308431179.271718, "message": "The Roof Gala is postponed. Stay tuned for the new date.", "group_id": 868, "id": 1428547}]