[{"user_id": 11626, "stars": [], "topic_id": 6240, "date_created": 1297813591.834832, "message": "Here’s an explicit example of the Egyptian government using social networking tech to help organize the violent, pro-government counter demonstrations that broke out in Cairo this week; it’s a sample of one of the mass-text messages the Mubarak government apparently ordered U.K.-based cellphone carrier Vodafone and a local cell provider to send to Egyptian citizens.\r\n\r\nFrom our sister site, DoDBuzz:\r\n\r\n    “Massive demonstration to start at noon this Wednesday from Mustafa Mahmoud Square, in support of President Mubarak.”\r\n\r\nVodafone says its service was essentially hijacked by the Egyptian government. Here’s a company statement:\r\n\r\n    “Under the emergency powers provisions of the Telecoms Act, the Egyptian authorities can instruct the mobile networks of Mobinil, Etisalat and Vodafone to send messages to the people of Egypt. They have used this since the start of the protests. These messages are not scripted by any of the mobile network operators and we do not have the ability to respond to the authorities on their content.\r\n\r\n    Vodafone Group has protested to the authorities that the current situation regarding these messages is unacceptable. We have made clear that all messages should be transparent and clearly attributable to the originator.”\r\n\r\nThis was combined with the country’s move to shut  down Internet access to all but a few corporate interests in Egypt.\r\n\r\n    “That’s becoming de riguer for authoritarian governments around the world,” he said, referring to Egypt’s decision to shut down Internet access. One interesting tidbit– not all Internet access was killed, he said.  One Internet Service Provider “was still alive last week, providing 5 star hotels, Coca Cola and a few other companies with Internet access while the rest of Egypt was unable to check news webs sites and Facebook.\r\n\r\nBuzz also notes that shutting down the Internet is a growing trend around the world whenever governments are looking to control sensitive situations within their borders.\r\n\r\nOh, and we’ve already seen Russia use cyber attacks to shut down parts of the civilian web in countries it was feuding with, a la Estonia and Georgia.\r\n\r\nStill, we noted yesterday that efforts to control the Internet can be circumvented. Meanwhile, Mubarak’s government restored Internet service while pro-government demonstrators made concerted efforts to physically attack and silence more traditional channels for information sharing; print and broadcast reporters.\r\n\r\nThis is all just another real world example of how high-tech and traditional methods of conflict merge and play each other in the modern world.\r\n\r\nhttp://defensetech.org/2011/02/04/high-tech-merges-with-old-fashioned-in-efforts-by-egyptian-government-to-cut-information-flow", "group_id": 3920, "id": 116879}]