[{"user_id": 15780, "stars": [], "topic_id": 10240, "date_created": 1299095928.458477, "message": "While actively participating in today's iPad 2 threads (in Apple and TWIT groups) I would sometimes not be able to tell which of my messages were being @'d by users.", "group_id": 88, "id": 252347}, {"user_id": 15780, "stars": [], "topic_id": 10240, "date_created": 1299096017.80216, "message": "I like the way the messages come by the time in which they were sent as opposed to burying replies to the original statement which probably means we'd lose the ability for the conversation to remain fluid... so all I can think of would be a way, like with twitter, to see which specific message is being @replied", "group_id": 88, "id": 252366}, {"user_id": 9108, "stars": [{"date_created": 1303417129.923943, "user_id": 18485}], "topic_id": 10240, "date_created": 1299107031.9491839, "message": "I think this is something that will become less of an issue as the site becomes more popular. Then it will be more like an actual chat and less like a forum.", "group_id": 88, "id": 254411}, {"user_id": 16271, "stars": [], "topic_id": 10240, "date_created": 1299106772.200748, "message": "@calebcherry Yeah it's a tough UI question.  Because while the chat is active it's a flow but then for archival purposes maybe threaded is good.  Perhaps having the option as with Yammer would be the way to go?  Not sure.", "group_id": 88, "id": 254368}, {"user_id": 1516, "stars": [{"date_created": 1299166249.8123751, "user_id": 10182}, {"date_created": 1299536037.4056129, "user_id": 4859}, {"date_created": 1303417117.288095, "user_id": 18485}], "topic_id": 10240, "date_created": 1299165906.8680451, "message": "isn't the whole idea of Convore that it should also work as a a forum when no one is around?", "group_id": 88, "id": 260724}, {"user_id": 30546, "stars": [], "topic_id": 10240, "date_created": 1303412614.646883, "message": "I think implementing the way twitter tracks replies would work well.  You could have the main chat in the window it is in, but if there is a conversation developing, you could break that out to the side and see that conversation.  If you need an example just fire up twitter.com, find a conversation, click the chat looking icon and whala, you have the conversation.  this would make jumping back into a topic you have been away from much easier.", "group_id": 88, "id": 774354}, {"user_id": 18485, "stars": [{"date_created": 1303417339.7965951, "user_id": 4149}], "topic_id": 10240, "date_created": 1303417172.365591, "message": "@JohnFail for me the best thing about convore is it can be both a forum and a chat and do both well.", "group_id": 88, "id": 775235}, {"user_id": 24490, "stars": [], "topic_id": 10240, "date_created": 1303563070.20736, "message": "What about including (embedding?) just the message you're replying to in your message, then you have context without cascading message doom. Of course then the question is how to reply with the keyboard.", "group_id": 88, "id": 788867}, {"user_id": 24495, "stars": [], "topic_id": 10240, "date_created": 1303576784.1601989, "message": "I think if someone clicks the reply button, Convore knows a lot about what message is being replied to and could overlay something like message-threading or highlighting.  If you just @reply, then perhaps its in regards to the last message...", "group_id": 88, "id": 789877}]