[{"user_id": 14559, "stars": [], "topic_id": 7842, "date_created": 1298342432.1222241, "message": "i know for me, personally, starting my own business means that i get to work on something i'm passionate about day in and day out.  it's really that simple.  and i think most entrepreneurs enjoy building \"things\" in new and unique ways...ways that others can't see or don't want to risk taking", "group_id": 250, "id": 176594}, {"user_id": 11405, "stars": [{"date_created": 1298836018.817534, "user_id": 9013}], "topic_id": 7842, "date_created": 1298356336.9348149, "message": "For me it is a bet on certain future developments. Example: I believe that node.js and CouchDB might turn out to be extremely cost effective and powerful tools that ultimately will enable each individual to host their own awesome web apps (stuff like rememberthemilk and the likes). However when working as an employee for a huge (= safe but slow) company I never had the time to really dive into these technologies. After working as an Entrepreneur I was able to teach myself a whole bunch of new technologies that ultimately will empower me to create a nice service that will (hopefully) bring in some money. If it doesn't, at least I will be a much better developer than I was before. Finding a new job won't be too hard.", "group_id": 250, "id": 177444}, {"user_id": 3030, "stars": [], "topic_id": 7842, "date_created": 1298357601.456861, "message": "For me, it is to one day fully decouple my time and how much I earn. But the journey itself to get there is great for personal development.", "group_id": 250, "id": 177501}, {"user_id": 3869, "stars": [], "topic_id": 7842, "date_created": 1298358493.260097, "message": "Revenge.", "group_id": 250, "id": 177562}, {"user_id": 3869, "stars": [{"date_created": 1298362142.4422951, "user_id": 3766}], "topic_id": 7842, "date_created": 1298358509.5912781, "message": "Seriously though, a mode of creation is a lot more inpsiring than being part of another persons dream.", "group_id": 250, "id": 177563}, {"user_id": 14637, "stars": [{"date_created": 1299821809.299552, "user_id": 10694}, {"date_created": 1300388619.9964321, "user_id": 416}], "topic_id": 7842, "date_created": 1298366700.141526, "message": "For me it always that you believe you can do something better than everybody else, or that you can create something that is needed but doesn't yet exist.  I believe that other reasons (money, prestige, felxible working) will just lead to failure...", "group_id": 250, "id": 178012}, {"user_id": 8224, "stars": [], "topic_id": 7842, "date_created": 1298387320.0227189, "message": "No one is crazy enough to hire me except myself.", "group_id": 250, "id": 179537}, {"user_id": 14559, "stars": [], "topic_id": 7842, "date_created": 1298402684.0487299, "message": "@nerdyworms +1", "group_id": 250, "id": 181669}, {"user_id": 4520, "stars": [], "topic_id": 7842, "date_created": 1298406089.504952, "message": "http://langworth.com/pub/misc/another_happy_cat.jpg", "group_id": 250, "id": 182316}, {"user_id": 4520, "stars": [], "topic_id": 7842, "date_created": 1298406100.974103, "message": "(whoops)", "group_id": 250, "id": 182321}, {"user_id": 3413, "stars": [], "topic_id": 7842, "date_created": 1298431164.2111521, "message": "I love the passion I feel when working on my own projects, my own ideas. That, and I knew I could create a much better product than the incompetent company I worked for. :D", "group_id": 250, "id": 185610}, {"user_id": 14970, "stars": [], "topic_id": 7842, "date_created": 1298431382.3322859, "message": "I think its more the idea of creating something that could fuel everything else I want to do. The level of return possible tied so heavily to performance is not anymore realizable than in your own business.", "group_id": 250, "id": 185622}, {"user_id": 7723, "stars": [{"date_created": 1298491294.7921591, "user_id": 8985}, {"date_created": 1299809280.693141, "user_id": 14070}], "topic_id": 7842, "date_created": 1298475849.264493, "message": "I think many of us start our own business after realizing the 9-5 job isn't as stable and rewarding as we thought.  I went out on my own after losing my job but knew exactly what I didn't want to do, which was working for the man for the rest of my life.  I strongly feel in order to succeed as an entrepreneur you need passion, determination, flexibility to handle challenges & dedication to believe in yourself.   Everything else will fall into place.", "group_id": 250, "id": 188171}, {"user_id": 14443, "stars": [], "topic_id": 7842, "date_created": 1298534842.0937369, "message": "My motive is people. I am a big people person and I just want to help. Along with this would be passion.", "group_id": 250, "id": 195997}, {"user_id": 15148, "stars": [], "topic_id": 7842, "date_created": 1298797246.1574459, "message": "Starting up my own business - for me it means: 1. challenging myself and the nonbelievers 2. rewarding challenges that were absent from your 9-5 job 3. When you have developed a talent for coping with rejection - you're set to go on your own 4. Learning by sharing and listening when communicating with a lot of different people 5. the feeling of helping other people. The list could go on but this is my top 5", "group_id": 250, "id": 216861}, {"user_id": 13676, "stars": [], "topic_id": 7842, "date_created": 1299522586.637831, "message": "My love for creatively fixing problems...", "group_id": 250, "id": 289459}, {"user_id": 3235, "stars": [], "topic_id": 7842, "date_created": 1299523970.3658831, "message": "In a sense it was a natural progression from being a autodidact, I also felt I gained experience a lot faster in a personal setting as opposed to a conventional manner. It gives an immediate advantage to be in such a flexible starting point.", "group_id": 250, "id": 289674}, {"user_id": 20138, "stars": [], "topic_id": 7842, "date_created": 1299800504.948554, "message": "Freedom.", "group_id": 250, "id": 317631}, {"user_id": 16719, "stars": [], "topic_id": 7842, "date_created": 1299819314.6182089, "message": "i do better when i lead..", "group_id": 250, "id": 319434}, {"user_id": 22627, "stars": [], "topic_id": 7842, "date_created": 1300438124.149534, "message": "@bhu1st +1", "group_id": 250, "id": 380644}, {"user_id": 22729, "stars": [], "topic_id": 7842, "date_created": 1300472201.249047, "message": "Working for other people can be stifling.  At some point your learning plateaus and staying there is more about comfort rather than intellectual challenge or excitement. When it comes down to it, in most situations companies want heads-down, docile producers rather than those who question convention.", "group_id": 250, "id": 384379}, {"user_id": 22729, "stars": [], "topic_id": 7842, "date_created": 1300472220.653825, "message": "Doing your own startup requires ll", "group_id": 250, "id": 384381}, {"user_id": 22729, "stars": [], "topic_id": 7842, "date_created": 1300472351.596, "message": "Lots and lots of learning, particularly in areas out of your comfort zone (eg developers have to think about business models, market positioning, go-to-market strategy etc). Some people (like me) thrive and hunger for such challenges. I find the comfort of 9-5, managing some project that barely moves uninspiring and boring.", "group_id": 250, "id": 384387}, {"user_id": 22729, "stars": [], "topic_id": 7842, "date_created": 1300472397.284225, "message": "I've always loved how technology can be used it new and novel ways to change peoples lives and executing on that vision means going out on my own.", "group_id": 250, "id": 384388}, {"user_id": 21397, "stars": [], "topic_id": 7842, "date_created": 1300516311.7587271, "message": "Everyone has a dream and it requires financial freedom. I started my business because I wanna keep playing games for life but still get paid passively from my business.", "group_id": 250, "id": 387139}, {"user_id": 23098, "stars": [], "topic_id": 7842, "date_created": 1300689061.0797441, "message": "Really? How does one go about that?", "group_id": 250, "id": 395699}, {"user_id": 21360, "stars": [], "topic_id": 7842, "date_created": 1300664404.481029, "message": "My startups were purely motivated by a need to get great ideas out of my head and put down on paper.  From there they took on a life of their own.  I don't think I had a choice, they would have haunted me until I did something about them.", "group_id": 250, "id": 394329}, {"user_id": 21397, "stars": [], "topic_id": 7842, "date_created": 1300688207.6966529, "message": "@Energypanacea You could try sell those ideas. Not sure if you knew but, if you can write up a proven business plan, you get 10% out of the required startup capital as your business plan price.", "group_id": 250, "id": 395633}, {"user_id": 23098, "stars": [], "topic_id": 7842, "date_created": 1300689061.530884, "message": "@Qoyyuum Really - how does one go about that?", "group_id": 250, "id": 395701}, {"user_id": 2060, "stars": [], "topic_id": 7842, "date_created": 1300727415.0689521, "message": "Make money", "group_id": 250, "id": 400192}, {"user_id": 21360, "stars": [], "topic_id": 7842, "date_created": 1300755983.05302, "message": "I don't think 10% of the required startup capitol is practical.  If I were selling I would ask for 300% of the startup costs, but I'm not selling.  I don't think you get paid just to write a business plan.  Please explain.  Do you mean a government energy program?", "group_id": 250, "id": 404156}, {"user_id": 7577, "stars": [], "topic_id": 7842, "date_created": 1300990173.3970649, "message": "For me it is like @Energypanacea already said; I need to get these ideas out in the world or probably regret it for the rest of my life.", "group_id": 250, "id": 429239}]