[{"user_id": 11626, "stars": [], "topic_id": 21562, "date_created": 1303877844.8934431, "message": "http://www.infowars.com/busby-fukushima-explosion-was-nuclear\r\n\r\nBusby: Fukushima Explosion Was Nuclear\r\nKurt Nimmo\r\nInfowars.com\r\nApril 26, 2011\r\n\r\nBritish scientist Christopher Busby, a researcher on the negative health effects of ionizing radiation, told Russia Today that one of the explosions at the crippled Fukushima nuclear plant in Japan was a nuclear explosion, not a hydrogen explosion as widely reported in the media.\r\n\r\nBusby said the explosion at Chernobyl in 1986 was also a nuclear explosion. The Chernobyl nuclear accident dispersed large quantities of radioactive fuel and core materials into the atmosphere. Busby told RT the crisis at Fukushima is far worse than Chernobyl.\r\n\r\nHe said the explosion did not originate in the reactor core, but the tanks where spent plutonium MOX fuel rods are stored. MOX fuel contains plutonium blended with natural uranium, reprocessed uranium, or depleted uranium. The explosion vaporized the plutonium rods and ejected a large amount of radiation into the atmosphere.\r\n\r\nTakeshi Tokuda, a member of the Lower House of the Japanese Diet, also believes the first explosion at Fukushima was nuclear. Tokuda talked with a doctor Oikawa of the Minami Soma City General Hospital. Oikawa told the government representative that materials ejected from the plant after the explosion registered high radiation levels.\r\n\r\n“When the hospital checked the radiation level on the people who escaped from around the nuke plant after the explosion, there were more than 10 people whose radiation level exceeded 100,000 cpm [counts per minute], beyond what could be measured by the geiger counter the hospital had,” Tokuda wrote. “100,000 cpm is the new level that the Japanese government set that requires decontamination. Before the Fukushima accident, the level was 6,000 cpm.”\r\n\r\nThe EPA has attempted to downplay the fact that plutonium is now bombarding the United States and much of the Northern Hemisphere. According to Lucas Hixton Whitefield, an EPA RADNet report shows increased levels of plutonium in the atmosphere. Whitefield found information on the plutonium in a RADnet dataset.", "group_id": 3920, "id": 821921}]