[{"user_id": 32942, "stars": [], "topic_id": 40561, "date_created": 1309294083.4242671, "message": "I'm going. Should be interesting seeing what new startups are demoing, the energy/creativity from startups is always infectious. @phi1rene are you going?", "group_id": 9753, "id": 1510803}, {"user_id": 32938, "stars": [], "topic_id": 40561, "date_created": 1309349371.8811419, "message": "I am.", "group_id": 9753, "id": 1516387}, {"user_id": 32801, "stars": [], "topic_id": 40561, "date_created": 1309525787.054234, "message": "How did it go? I haven't seen any blog posts about it yet.", "group_id": 9753, "id": 1540150}, {"user_id": 32938, "stars": [], "topic_id": 40561, "date_created": 1309613794.0276921, "message": "Well. I think the products were much more polished this time than some previous iterations. Fewer people in the room (50-75% - probably because of construction in front) but that's not necessarily a bad thing as we had some breathing room. Dave from Live 88.5 complained about people talking in the background but for once he was not referring to me. :)", "group_id": 9753, "id": 1547890}, {"user_id": 32810, "stars": [], "topic_id": 40561, "date_created": 1309800174.244647, "message": "@saidimu, yes I was there. My company presented. It was nice, I had some good feedback and some comments about features and the product in general. It was really nice to talk with people and see some interest. We're still seeking users and funding so, this event helped a lot.", "group_id": 9753, "id": 1561059}, {"user_id": 32942, "stars": [], "topic_id": 40561, "date_created": 1309806215.7082601, "message": "The level of presentations was quite good. Another notable company presented a hardware device + mobile app for streaming videos from your home network to wherever you may be. The video quality was quite good even over a 1-Mbps upload link (from the presenter's home network). The transcode everything on-the-fly, quite impressive considering how it taxes the CPU.", "group_id": 9753, "id": 1561572}, {"user_id": 32942, "stars": [], "topic_id": 40561, "date_created": 1309806068.449662, "message": "@phi1rene Your company had a great presentation! I've done some motion-detection work before (car traffic analysis) but I was intrigued by the compression you guys achieved for your product. Congrats!", "group_id": 9753, "id": 1561559}]