[{"user_id": 19, "stars": [], "topic_id": 9454, "date_created": 1298860930.5062139, "message": "I only use them for building things in Interface builder", "group_id": 97, "id": 223381}, {"user_id": 14243, "stars": [{"date_created": 1299836427.7250681, "user_id": 20298}], "topic_id": 9454, "date_created": 1298860888.495383, "message": "I use them a lot.. but I come from a KDE enviroment. Multiple desktops rock my world... But I don't see many people using them. At least not 'standard' mac users", "group_id": 97, "id": 223380}, {"user_id": 19, "stars": [], "topic_id": 9454, "date_created": 1298860943.7120619, "message": "Because having real windows behind IB is probably the most confusing situation in the universe", "group_id": 97, "id": 223382}, {"user_id": 4070, "stars": [], "topic_id": 9454, "date_created": 1298864366.661489, "message": "I use them vigorously, but it's not a complete solution for multiple desktops. It's really more like a super-sized desktop; I use it to increase screen real estate, since I'm all-portable, all the time. That's about all you can use it for; really. I used to assign certain types of applications to certain spaces (web in 1, text in 2, graphics in 3, distractions in 4), but that got kind of tiresome. Now I mostly want everything to open in the space I'm in, but I'll move something to another one as a way of splitting up my workflow.", "group_id": 97, "id": 223455}, {"user_id": 6370, "stars": [], "topic_id": 9454, "date_created": 1298872962.90466, "message": "I use the standard 4 spaces to split up my activities.  Web, Email, Twitter on one space.  XCode, Terminal and Tower on another space, iTunes on a 3rd space and my 4th space is almost always empty.", "group_id": 97, "id": 223774}, {"user_id": 15780, "stars": [], "topic_id": 9454, "date_created": 1298875614.078325, "message": "I agree with @skabber .... I tend to split them up for different types of applications based on their service. I could live without them, but I like that they're around for me to use them.", "group_id": 97, "id": 223896}, {"user_id": 4893, "stars": [], "topic_id": 9454, "date_created": 1298889208.233391, "message": "With a bit more options regarding the cmd+tab behaviour (like being able to only include windows used in the current space) Spaces would be great, so it is just good IMO ;-) Especially on smaller displays it simply doesn't help all that much with the flood of windows.", "group_id": 97, "id": 224827}, {"user_id": 651, "stars": [], "topic_id": 9454, "date_created": 1298893398.8216269, "message": "I use spaces a lot. I usually have communication apps like Email, Skype, IRC in the first space and all other spaces are for specific projects. For everything new/different I start on an empty space.", "group_id": 97, "id": 225031}, {"user_id": 14885, "stars": [], "topic_id": 9454, "date_created": 1298910883.3225861, "message": "I use spaces constantly, and divide them up based on application types as well. This is on a 27\" imac, where screen real estate isn't really a problem. One of my favorite things is being able to leave photoshop fullscreen in a space.", "group_id": 97, "id": 226982}, {"user_id": 14896, "stars": [], "topic_id": 9454, "date_created": 1298911807.8912399, "message": "Spaces is a vital part of my workflow. I have nine spaces. Four of them are in constant use, each with its designated apps in their own little home base. The other five are in flux depending upon which projects are currently in the works. I'm constantly swapping between them and suspect that watching me work could be almost seizure-inducing.", "group_id": 97, "id": 227161}, {"user_id": 3952, "stars": [], "topic_id": 9454, "date_created": 1298954360.0735531, "message": "I use spaces a lot. I come from an Ubuntu environment, so I used them a lot there. On my 15\" MBP it really makes a big difference.", "group_id": 97, "id": 231844}, {"user_id": 7610, "stars": [], "topic_id": 9454, "date_created": 1298985250.7187879, "message": "I come from Gnome, Linux, wich I still find more atractive for web development, so of course Spaces is used on OSX. 4th for communications (email, Chat, IM), 3rd for code (Macvim and Browser), 2nd for Terminals (VM's, etc) and the first as a generic one or documentation PDF's", "group_id": 97, "id": 234268}, {"user_id": 14243, "stars": [], "topic_id": 9454, "date_created": 1299023527.4265971, "message": "/me Notices how the users of spaces are the ones who come from linux/unix/bsd visual enviroments where virtual desktops are more common...", "group_id": 97, "id": 242060}, {"user_id": 14896, "stars": [], "topic_id": 9454, "date_created": 1299024852.191735, "message": "@aseba: Agreed (and I count myself in their number). It's been years since I used Windows. Doesn't Windows 7 have virtual desktops or am I misremembering?", "group_id": 97, "id": 242187}, {"user_id": 9108, "stars": [], "topic_id": 9454, "date_created": 1299025540.4348321, "message": "@vmbrasseur No, it doesn't have anything like the *nix virtual desktops.", "group_id": 97, "id": 242243}, {"user_id": 581, "stars": [], "topic_id": 9454, "date_created": 1299026998.331609, "message": "I used to use it more than I do now. Probably because I have two monitors now, and didn't before.", "group_id": 97, "id": 242345}, {"user_id": 3094, "stars": [], "topic_id": 9454, "date_created": 1299039272.454216, "message": "When I was working on my PhD, and rocking a 13\" MBP, I had nine spaces, and used them all. Now that I'm done the degree and have a 27\" iMac with a 20\" external monitor attached, I really only use two spaces. One for \"every day\" stuff, the other for Xcode+Devonthink", "group_id": 97, "id": 243230}, {"user_id": 12709, "stars": [], "topic_id": 9454, "date_created": 1299061765.3474059, "message": "I sort of do, but not in a really structured way. I work on a 13\" MBP with a 24\" cinema display attached most of the time. I have Chrome & Safari set to space 1, Textmate to space 2, and iChat / Twitter / Terminal across all spaces. I tend to throw things around spaces a lot too (sometimes need Textmate & Safari at the same time)", "group_id": 97, "id": 246162}, {"user_id": 16771, "stars": [], "topic_id": 9454, "date_created": 1299073731.450366, "message": "I've never been able to really integrate Spaces into my workflow.  Alternatively, I've set Command+1 and Command+2 to previous and next tab.  My workflow consists of Command+Tab-ing to the app I need, Command+`-ing to the window I need, and then Command+1 or 2 to the tab of choice if necessary.  Been doing it for 5 years, hard to break old habits.", "group_id": 97, "id": 246969}, {"user_id": 7610, "stars": [], "topic_id": 9454, "date_created": 1299096069.9811981, "message": "If it was not for Homebrew, I'd have sell my Mac. I do my main work in my Ubuntu laptop, Debian on the servers, and have the Mac desktop for when I want to use the wonderful keyboard :-)", "group_id": 97, "id": 252374}, {"user_id": 17769, "stars": [], "topic_id": 9454, "date_created": 1299201868.7399349, "message": "@JohnFail  WHen I am using windows I find myself missing virtual workdesktops", "group_id": 97, "id": 265441}, {"user_id": 17769, "stars": [], "topic_id": 9454, "date_created": 1299201793.992264, "message": "I need spaces as it keeps my wife and kids' stuff separate from my stuff...", "group_id": 97, "id": 265436}, {"user_id": 17769, "stars": [], "topic_id": 9454, "date_created": 1299201830.041718, "message": "@vmbrasseur When I", "group_id": 97, "id": 265438}, {"user_id": 12689, "stars": [], "topic_id": 9454, "date_created": 1299204037.1298771, "message": "I tried it for a bit, but then turned it off. Didn't speed up my workflow any.", "group_id": 97, "id": 265726}, {"user_id": 9108, "stars": [], "topic_id": 9454, "date_created": 1299203942.608043, "message": "@ericortega It doesn't really bother me much to be honest. When I'm at work I have 3 monitors, so I don't miss it. At home I generally only have a browser open, so even when I'm working on my *nix laptop I rarely to never use the virtual desktops.", "group_id": 97, "id": 265705}, {"user_id": 14726, "stars": [], "topic_id": 9454, "date_created": 1299205079.362982, "message": "I didn't use to, but ever since I started using Better Touch Tool I use it all the time... With a 3 finger swipe on my touchpad I move between them, which makes my productivity increase!!! Not sure if I'll be able to adapt to OSX Lion easily though...", "group_id": 97, "id": 265877}, {"user_id": 651, "stars": [], "topic_id": 9454, "date_created": 1299206284.268934, "message": "@uncachable you can cycle through windows of one app with cmd+~", "group_id": 97, "id": 266054}, {"user_id": 12709, "stars": [], "topic_id": 9454, "date_created": 1299205410.5249159, "message": "@ericortega different user accounts?", "group_id": 97, "id": 265932}, {"user_id": 2345, "stars": [], "topic_id": 9454, "date_created": 1299206135.260982, "message": "I use Spaces in lieu of Exposé just because it's faster, and there's no easy keyboard-based window-switching feature that I know of (Command+Tab only switches between applications, not windows of one app). Surprising that not many people use it.", "group_id": 97, "id": 266035}, {"user_id": 2345, "stars": [], "topic_id": 9454, "date_created": 1299206500.8359859, "message": "@mrtazz Thanks! Still going to use Spaces for window organization, though.", "group_id": 97, "id": 266075}, {"user_id": 18495, "stars": [], "topic_id": 9454, "date_created": 1299208880.0578499, "message": "Used it initially, turned it off as didn't make much of a difference in my workflow. I use the keyboard to cycle through apps and windows anyway", "group_id": 97, "id": 266225}, {"user_id": 18766, "stars": [], "topic_id": 9454, "date_created": 1299258816.859046, "message": "I use it to focus on particular apps quickly.  Works great for presentations, work mode or just browsing", "group_id": 97, "id": 271364}, {"user_id": 18604, "stars": [], "topic_id": 9454, "date_created": 1299258715.463783, "message": "i use it for web development quite a bit. Find it easier than 4 finger swipe/cmd tab to switch between apps (that shows how lazy I am :)). 1 space for browser, 2nd for devlmnt. tools.", "group_id": 97, "id": 271336}, {"user_id": 17912, "stars": [], "topic_id": 9454, "date_created": 1299338287.550523, "message": "I use it and love it! As a graphic designer, I find it very helpful to push my different applications to different Spaces. For example, browsers live in Space 1, email in Space 2, etc.", "group_id": 97, "id": 276412}, {"user_id": 17912, "stars": [], "topic_id": 9454, "date_created": 1299338353.002723, "message": "The trouble is, some programs don't play nice with Spaces. For example, Microsoft Office opens documents wherever the hell it likes, and doesn't care that I assign a Space to Word, another to Excel, and so forth. Also, Adobe CS sometimes forgets which space is assigned to which app. So it's a work in progress.", "group_id": 97, "id": 276415}, {"user_id": 17124, "stars": [], "topic_id": 9454, "date_created": 1299350940.6388659, "message": "I come from nowhere, meaning I started on a Mac and I still use it, although I've been fiddling with other platform as well.I use two or three workspaces occasionally, whenever I need a bit more uncluttered space, and can have, say, iTunes playing on the background, or multiple browsers or editors open at the same time.", "group_id": 97, "id": 277192}, {"user_id": 16194, "stars": [{"date_created": 1299779897.3319919, "user_id": 17106}], "topic_id": 9454, "date_created": 1299773710.5170259, "message": "I used them to improve my focus. I basically turn off all the notification and use a different space for chat, email and stuff like that. Then I visit that space only when done with my work or taking a break.", "group_id": 97, "id": 314599}, {"user_id": 20298, "stars": [], "topic_id": 9454, "date_created": 1299836455.0964711, "message": "@JonMwords  good", "group_id": 97, "id": 320989}, {"user_id": 25414, "stars": [], "topic_id": 9454, "date_created": 1301095056.2264919, "message": "I've never used it - but perhaps I'll give it a go", "group_id": 97, "id": 443240}, {"user_id": 18971, "stars": [], "topic_id": 9454, "date_created": 1301176506.4507749, "message": "I like the idea but I do not use it", "group_id": 97, "id": 447806}, {"user_id": 25702, "stars": [], "topic_id": 9454, "date_created": 1301203606.792043, "message": "I use it quite a bit. That might be reduced greatly if I decide to order an external monitor.", "group_id": 97, "id": 449560}]