[{"user_id": 14128, "stars": [], "topic_id": 35424, "date_created": 1305502388.491513, "message": "I have a project that relies on a git submodule, but it looks like epio upload doesn't pull it in. Is there a way to make git submodule update run during upload or git clone --recursive?", "group_id": 2873, "id": 1064434}, {"user_id": 8740, "stars": [], "topic_id": 35424, "date_created": 1305535166.8385899, "message": "@eyeseast Our receiver already calls git submodule init and git submodule update. Are you uploading using git itself or epio upload?", "group_id": 2873, "id": 1068752}, {"user_id": 8740, "stars": [], "topic_id": 35424, "date_created": 1305535187.2752631, "message": "The latter strips out git metadata, as it's meant to be VCS-agnostic", "group_id": 2873, "id": 1068756}, {"user_id": 14128, "stars": [], "topic_id": 35424, "date_created": 1305593714.9769869, "message": "I was using upload. I'll try pushing with git.", "group_id": 2873, "id": 1077017}, {"user_id": 14128, "stars": [], "topic_id": 35424, "date_created": 1305596912.834636, "message": "Ah, that worked. And as an added bonus, git push is vastly faster than epio upload. I was timing things yesterday (when I was making a bunch of small tweaks I didn't want to commit) and each upload took at least five minutes. I'm not sure how much of the difference relates to not having to upload all those shapefiles in one go, but I'll take it.", "group_id": 2873, "id": 1077597}, {"user_id": 14128, "stars": [], "topic_id": 35424, "date_created": 1305596920.9389551, "message": "Thanks, I should add.", "group_id": 2873, "id": 1077599}, {"user_id": 8740, "stars": [], "topic_id": 35424, "date_created": 1305617991.4064209, "message": "git push should be just as fast as epio upload (in fact, it should be slower) - epio upload uses git push behind the scenes, and our servers don't yet cache repos at all, so you have to push the entire repo every time. Strange.", "group_id": 2873, "id": 1079920}, {"user_id": 14128, "stars": [], "topic_id": 35424, "date_created": 1306086626.508538, "message": "I think a lot of the speed here is probably coming from using a submodule. In this case, it's a trove of shapefiles.", "group_id": 2873, "id": 1142988}, {"user_id": 43491, "stars": [], "topic_id": 35424, "date_created": 1321287164.1576021, "message": "This is not working for me. Neither with \"epio upload\" nor with \"git push epio master\" my git submodules are initalized on epio or updated. Am I missing something?", "group_id": 2873, "id": 2572423}]