[{"user_id": 528, "stars": [], "topic_id": 14336, "date_created": 1300751848.5303669, "message": "yikes", "group_id": 614, "id": 403745}, {"user_id": 2937, "stars": [], "topic_id": 14336, "date_created": 1300750758.3463211, "message": "Caltrain's a really convenient way to get between SF and the rest of the peninsula, but they're looking at crippling it. The current proposal is to cut all service except for weekday, commute-hour service, and also close some stations. http://www.caltrain.com/about/fiscalcrisis.html", "group_id": 614, "id": 403649}, {"user_id": 779, "stars": [], "topic_id": 14336, "date_created": 1300752594.187392, "message": "help", "group_id": 614, "id": 403837}, {"user_id": 779, "stars": [], "topic_id": 14336, "date_created": 1300752726.64112, "message": "They should team with a tech company and build a new Business concept around the commute itself. After all you have people spending at least 1h on the longer commutes. That time should be monetized somehow by the people onboard.", "group_id": 614, "id": 403845}, {"user_id": 779, "stars": [], "topic_id": 14336, "date_created": 1300752592.2555611, "message": "I just started to like the Service :( so what can we do to", "group_id": 614, "id": 403836}, {"user_id": 2937, "stars": [], "topic_id": 14336, "date_created": 1300762560.9911921, "message": "They're looking at some ways to boost revenue (small fare increases, more advertising on trains/stations, etc), but unless someone writes them a big check, there's probably going to be some significant cuts", "group_id": 614, "id": 404636}, {"user_id": 2937, "stars": [], "topic_id": 14336, "date_created": 1300762141.5311861, "message": "The root cause is that they don't have a stable source of funding other than fares (and fares basically aren't enough to cover the operating costs of any transit system in the country). SFMTA, SamTrans, and VTA (the transit authorities for SF, San Mateo County, and Santa Clara county, respectively) give them money, but they're making huge reductions because of their own budget issues", "group_id": 614, "id": 404618}, {"user_id": 2937, "stars": [], "topic_id": 14336, "date_created": 1300762238.2861421, "message": "For the current fiscal year, SFMTA, SamTrans, and VTA gave a total of $35M. (Caltrain's budget is ~$100M, so that's very significant.) For next fiscal year (which starts July 1), they're cutting that to ~$11.5M. So that's the source of most of the ~$30M shortfall Caltrain is looking at for next year if they don't make cuts", "group_id": 614, "id": 404620}, {"user_id": 2937, "stars": [], "topic_id": 14336, "date_created": 1300762765.134053, "message": "For example, I think the commute service to Gilroy is gone for sure. Reading their ridership report [http://www.caltrain.com/Assets/Stats+and+Reports/Ridership/2010_Caltrain_Ridership_Counts.pdf], between 2004 and 2010, the number of people riding the Gilroy extension has fallen by half.", "group_id": 614, "id": 404661}]