[{"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307437825.377748, "message": "Another look at a movie that we (myself and MikeDerk) are aware already has a Dramatica storyform. The idea is to re-do it then compare afterwards (so please don't quote parts of the existing storyform until the new analysis is done).\n\nOne thing that I do remember is seeing beginnings of two storyforms, and they each had a different character as Protagonist.\n\nAs per Jim's advice in a previous thread, starting by looking at the bigger stuff and static appreciations first (4 throughlines, 4 MC questions, 4 Story questions) seems like a good idea.", "group_id": 2515, "id": 1318516}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307441998.3943131, "message": "First film. We could also do JD later as well.", "group_id": 2515, "id": 1319069}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307441181.5378189, "message": "Sounds fun. But do you think of the first film, or Judgment day? The second one sounds more interesting for me - and I don't remember too much from the first movie.", "group_id": 2515, "id": 1319031}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307444434.0976501, "message": "Well then: The Main character is Sarah Connor I guess and the Impact character is Kyle Reese. The OS is about an activity (Terminator chases Sarah, Sarah runs from the terminator :) ) The Main Character story is in the Situation domain ( she finds herself in the position of the mother of mankind's only hope ). The Impact Character Storyline is then in the Fix Mindset domain (Kyle is convinced that rise of the machines is about to come and his mission is to defend Sarah) And the Subjective TL is Manipulation - making Sarah believe that she is special and set up her mind to fight against machines. The Main Character changes (she accepts her role), she is a Be-er type of character - in alignment with her Throughline. Growth and PS style is a good question. The story driver is Action (Terminator arrives), the limit is optionlock (they have to destroy the machine eventually) the outcome is success (they destroy the terminator), I'm unsure wheter Judgment is good or bad.", "group_id": 2515, "id": 1319203}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307448424.5557859, "message": "I'd agree Sarah Connor is the MC, and IC Kyle. Regarding the OS throughline, I've listed what I see happening in the OS to see if that relates to your choice.\n\nFollowing advice before, I'll use character roles (rather than names) when talking OS.\n\nOS: After cyborg arrives, waitress wants to survive, soldier needs to save waitress / destroy cyborg, who needs to kill waitress to stop child being born. The police are trying to catch a serial killer. Soldier needs waitress to believe his future story. \n\nIt looks Activity to me, with OS Concern: Doing. I guess there also an argument to say they have all been placed in a Situation beyond their control.\n\nI'll wait for MikeDerk to comment before adding more...", "group_id": 2515, "id": 1319565}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307449061.306036, "message": "My total support for your analysis so far Mikeaja. The OS Concern is definitely Doing. \n\nOne could argue that they share the same Situation which is... a war situation? Now that sounds weird. \n\nOn the other hand Situation is definitely the unique characteristic of the MC. She is the key person for both of the opposing parties. The IC is just a soldier in a war with a mission. With a very special mission but it's still not his defining characteristic. Even the MC thinks he's mad when he tells his story, so I guess this mission of his, this belief is his most important characteristic. If we agree with that from the two remaining domains only Activity can be applied to the OS - it's definitely not about Psychology.", "group_id": 2515, "id": 1319715}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307449991.5528581, "message": "Going further: Supposing that the OS Concern is Doing, MC Concern must be How Things Are Changing (as OS and MC Throughlines must share the same Problem, the crucial element)- which kinda fits imho. \n\nThe main character is in a situation which changes very fast. In one moment she is just an average woman, in the other she is the mother of mankind's only hope, she has to fight with robots from the future etc. Her environment is in constant change as newer and newer facts are revealed for her about the future and she is concerned about the direction of those changes. She wants to stick to her past life but she feels that changes of her environment simply force her to change too.", "group_id": 2515, "id": 1319968}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307455067.7027481, "message": "Going even further: The IC TL should be Impulsive Responses and the Subjective TL should be Playing a Role. (I'm unsure whether it's a Dramatica rule to put the Concerns of all TL-s into the same segment - in this case, into the Methodology part - of the domain but as I see it's how it works in most of the cases. Some explanation of this would be nice.)\n\nAgain, these also make sense. The Subjective part: The IC tries to make the MC play the role of a soldier and the mother of mankind's only hope - this is pretty much what their story is about - apart from the \"IC tries to save the MC\" part.\n\nThe IC part is Impulsive Responses: The IC is pretty much concerned about the MC-s normal reactions on the abnormal situation. Convincing the MC that her natural responses to the appearance of a seemingly lunatic man (the IC) and a metal robot from the future are inappropriate and can lead her into danger is really a great concern of the IC. The MC-s Impulsive Responses basically threaten the success of his mission", "group_id": 2515, "id": 1321625}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307464112.5416541, "message": "More Domains.\nMC: Situation? Oh, no, and I just called her a be-er...\nI'll think, and be back. (Pun totally unintended, really.)", "group_id": 2515, "id": 1323328}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307463849.4091599, "message": "I'm adding my own starting point before going back and reading what others have put.\n\nMC: Sarah Connor.\nIC: Kyle Reese\nAntagonist: The TX1000 (is that the right number?)\n\nSorry, I'm realizing this is going to be a bit scatter-shot.\n\nI'm going to start with the things that seem most \"right.\" \n\nSS Domain: Manipulation. Kyle has to teach Sarah to believe in herself and save herself.\nThat forces the OS into Physics. Seems okay. But to play devil's advocate to myself, I'm going to point out that Sarah (mother to be), Kyle (only soldier) and the Terminator (only terminator) are three unique characters... could OS be Situation? Nah, it's all about the hunt of Sarah Connor -- seems like an activity causing the problems. (Sarah's unique position isn't a problem until the Terminator tries to hunt her down.)", "group_id": 2515, "id": 1323228}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307464041.97176, "message": "Outcome: Success -- John Connor is in utero.\nJudgement: Good -- she's making the audio tapes for him, and has accepted her role as his mentor\nMC PSS: Be-er. She tries to blend into the crowd at the club. (Admittedly , that's a pretty weak argument.) But Reese is a Do-er for sure -- makes bombs, teaches, goes through time, etc.\nMC Mental Sex: Female(?) The way Reese communicates with her is by stressing motivations: \"He will not stop, ever, until you are dead.\" Also, her reaction to getting stood up is to make the best of it, not to go after the guy and yell at him.", "group_id": 2515, "id": 1323300}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307464844.5381379, "message": "Plus, I thnk the Concern: How things are changing? (progress) fits what is happening to her.", "group_id": 2515, "id": 1323601}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307464420.604851, "message": "Yeah I was going to say, if the MC Approach is Be-er then it can't, by definition, be in Situation. It has to be Mind or Psychology", "group_id": 2515, "id": 1323435}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307464789.9893811, "message": "I would have said Sarah was a Do-er anyway. She takes action when it is necessary, she doesn't make a plan to survive, she just reacts. She starts to become a soldier herself.\n\nIf......I'm wrong and she is a Be-er, domain-wise I would say Mind, as there the fact tha she never really believes in the danger presented by the terminator until later in the story.\n\nStill, my choice would be Do-er and Situation.", "group_id": 2515, "id": 1323582}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307466316.868773, "message": "I'm not sure about the Goal. Killing the terminator is only necessary to enable the survival of Sarah and John. They don't gain (Obtain) anything from killing the terminator, other than it enables Sarah to survive, and John to be born. If they could escape from the terminator, they would do that instead as the same Success would be achieved.", "group_id": 2515, "id": 1324092}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307465192.5626359, "message": "With the TX as Antagonist, either Sarah or Kyle could be Protagonist. If Story goal is 'Survival and enabling John to exist' then it could be either of them. If it is 'Killing the terminator' then only Kyle has that aim from the start. \n\nI'd lean towards Sarah though as it is ultimately her actions that finish off the terminator.", "group_id": 2515, "id": 1323704}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307465819.3968079, "message": "I can only see Obtaining as the Goal: Reese is here to kill the Terminator. He can't protect her in perpetuity... So", "group_id": 2515, "id": 1323902}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307465834.353231, "message": "Doing seems like a stretch.", "group_id": 2515, "id": 1323912}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307471767.6739309, "message": "But the story will not end until the Terminator is no longer a threat, which is never. Unless it's destroyed.", "group_id": 2515, "id": 1325993}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307474295.8285129, "message": "Yes.......  Well, could it be the Requirement rather than the Goal? What I mean is, they are not killing the terminator to kill the terminator. They are doing it because it is the way to achieve survival and the existence of John Connor.\n\nKyle has gone back in time to save John, not because he needs to kill a terminator. It just so happens that, unlike a person, the terminator will never stop, so as you say, they have to kill him. \n\nBut the story doesn't end there. We see Sarah preparing John for what's to come. If they killed the terminator and then Sarah was killed, the story is a failure.", "group_id": 2515, "id": 1326493}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307475239.727596, "message": "I think that the Goal is something like \"ensuring her survival.\" That still sounds like obtaining to me. \n\nI also think that the requirement will be something like Learning or Understanding, because the waitress has to do one of those things before she is equipped to kill the terminator in the factory.", "group_id": 2515, "id": 1326719}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307475392.5170169, "message": "I think, too, that the story does end when the Terminator dies. The rest of it is either the coda, author's proof or the tail end of Sarah's situation (last signpost of Future or Present?)", "group_id": 2515, "id": 1326765}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307475654.1606669, "message": "Let's look at some of the other concerns to see if that can help us narrow this down.\n\nThe Terminator: Kill Sarah Connor. (Not Pursue Sarah Connor.)\nThe Cops: Catch a killer. (I can't really remember how they end up at the police station.)\nThe Psychiatrist: Understand? Kyle Reese", "group_id": 2515, "id": 1326833}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307484260.5416341, "message": "I agree with the Goal, although I would add \"to enable her son to become a leader\".\n\nWhen the terminator dies, I agree that is the end of the story for the audience, but for me I am not happy that the terminator is dead, but that Sarah has survived. I think the reason the story ends there is because we know that 'dead terminator = safe mother and son will exist'. The end of the film is there, imo, just to confirm that.\n\nWith Obtaining..... maybe you're right. I keep going back to Star Wars and the fact that it's Doing. But I appreciate 'surviving' is something achieved, therefore Obtained.", "group_id": 2515, "id": 1328789}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307484975.7269299, "message": "Becoming could be \"Because of Reese, she becomes a leader of soldiers.\" She lets him take care of her for so long in the movie, until she -- in desperation -- starts treating him like a subordinate. She yells at him so he won't die. Then she also starts preparing to train her son.\n\nSubconscious. I can't quite place it yet.", "group_id": 2515, "id": 1329006}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307485210.0149469, "message": "After what I just said, I'm now not sure about scraping Present...........................", "group_id": 2515, "id": 1329116}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307485268.362313, "message": "I would say all knowing Author....... although not sure with MC if I would see much difference there", "group_id": 2515, "id": 1329136}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307484792.2744329, "message": "I also like \"The Future\" for MC Situation Concern. Basically, because the only thing that matters is \"will she make it to the future?\"\n\nI think we can scratch Past and Present. Progress matters, but Reese isn't pressuring her to do things faster, or slower... There's no focus on that part of her transformation, really. So, I like Future. I mean, in the hotel, the pressure is \"will he find us/he will find us.\" Always keeping an eye for him showing up. \n\nThe Subconscious (IC) and Becoming (SS) ... I need some convincing.", "group_id": 2515, "id": 1328924}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307485321.8936059, "message": "Just that we know all the troubles raining down on her are coming from The Future, even if she doesn't believe it yet.", "group_id": 2515, "id": 1329145}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307486268.7068479, "message": "He can't communicate with his wife because, well, you know. Spoiler and all. That's his problem! (Anyway, we can debate this later. I don't want to bifurcate our thread.)", "group_id": 2515, "id": 1329578}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307485108.561398, "message": "Right.... Future or Progress. One thing I would say, seeing things through the MC's eyes is very much about how things change. I mean, we start with the waitress, then to someone scared, then starting to believe in robots, eventually to someone will to kill a terminator. \n\nEverything is about the Future, but I'm not sure that applies specifically to Sarah. I would even go so far as to say she cares less about the future than Kyle or Terminator (because she hasn't seen it).", "group_id": 2515, "id": 1329073}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307485212.4338441, "message": "Do we determine her Concern by looking through her eyes, or from the all-knowing Author place?", "group_id": 2515, "id": 1329117}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307485615.3312011, "message": "Or... in The Sixth Sense, the author knows where his troubles are coming from long before he does. Look at the anniversary dinner through his eyes, then the authors.", "group_id": 2515, "id": 1329273}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307485360.684485, "message": "I would scrap The Present because her issue isn't a discomfort with herself or where her life is. She's not looking for a new job, a new roommate, a new lizard, etc.", "group_id": 2515, "id": 1329160}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307486777.0147309, "message": "But that might not fit anyway.", "group_id": 2515, "id": 1329774}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307486100.7374821, "message": "If it is Future...... I don't think it is for that reason. I wouldn't say her troubles are from the Future in the main story. The arrival of the Terminator is before the main story starts. What I mean is, it isn't because of the future that she has problems, it is because a cyborg wants to kill her, and she doesn't believe it.\n\nTo me, the person who is definitely concerned about the future is Kyle. Everything he does is to make sure John exists.", "group_id": 2515, "id": 1329489}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307486188.8709841, "message": "FWIW, in the Sixth Sense, - SPOILER ALERT! -  I wouldn't say his troubles are because he is dead, I think it's because he lost faith in his ability to help. Not know he was dead just made his path to succeed easier.", "group_id": 2515, "id": 1329541}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307486725.0840721, "message": "I don't think that's his bifurcating problem! (I have no idea how to use that word or what it means......)\n\nThe future is coming to kill her ..... in the OS story..... if I understand the difference in the throughlines correctly. I just think, from the MC view, or audience view of the film, is this lady that grows from strength to strength, not really understanding why, being told this incredible story that she has to try and believe, and in the mean time needing to survive. \n\nWhat I'm starting to think now.... is is Sarah in a situation at all......... This is very bifurcating............ In fact, Kyle is the one that has to do what he has to do. He's the one that really understands that there is no choice. He lands from the future and can't go back. It is kill the terminator or nothing.", "group_id": 2515, "id": 1329752}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307487059.4636891, "message": "Not to mention that \"releasing\" her subconscious might be the solution to her throughline. Maybe her Fixed Attitude is \"wimp\" or something. I'm not sold that she's in Situation. We just kind of ended up there! Oops.", "group_id": 2515, "id": 1329908}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307486360.376034, "message": "The Terminator IS the Future, no? The Future is coming to kill her. It's a way to look at it.\n\nAlso, her Concern can be thrust upon her by Reese, I think. It doesn't have to come from inside her.", "group_id": 2515, "id": 1329616}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307488538.0656171, "message": "Well...... I think you might be on to something... not sure what releasing her subconscious means........ but when I read it I thought about 'starting to believe'. If she finally believes in this terrible future, she can do something about it (prepare / train John). \n\nThis makes a lot of sense, because if she did not do that, the overall mission has failed anyway.\n\nThere's also an aspect of Terminator that I think makes no sense, and that is Kyle being the father. Its too paradoxical.", "group_id": 2515, "id": 1330408}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307511828.649189, "message": "In my opinion the overall story is pretty similar to the textbook case of Star Wars. The MC who is just a regular guy/girl meets the IC who is a person with strong beliefs and a mission. IC needs the MC to accomplish his mission, for this IC has to change the MC-s mind, beliefs and such, prepare him/her for what is ahead. They both fight against a greater evil. The only difference that in SW both opposing parties' goal is to destroy the key asset of the enemy (Death Star and the Rebel Base), while in Terminator only the bad guy's goal is that - the good guy's goal is to prevent it from happening.\n\nI don't think that the terminator would be the Antagonist. The Antagonist is Skynet himself, and his goal is to wipe out the human race. The terminator (T-800 btw) is only the contagonist (as Vader in SW) whose mission is to Hinder humans from succeed by preventing born of their leader. Even the fact that T-800 is willing to kill the MC doesn't qualify him as an Antagonist (Vader would do the same to Luke as it is portrayed in Ep. IV.)\n\nThe overall story is a war, more precisely a single battle of a great war (just like in SW). The goal of the good guys is not to win the war, just preventing great unbalance of forces of the opposing parties which would happen if one of them would destroy the key asset of the other. \n\nThis is why I think that the OS is rather about Doing than about Obtaining. Security of the MC is not a state! It's a process. Even if they kill the terminator Sarah can't and mustn't fell safe, she has to maintain all the security measures to ensure that her child will be born. I'd be really curious how you maintain your argument that the OS Concern is Obtaining while accepting that the OS Concern in SW is not Obtainig.", "group_id": 2515, "id": 1334147}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307521253.5767779, "message": "As I see Obtaining as an overall story concern has an ending characteristic (which means that reaching a specific state means that the OS ends) while Doing has progressive characteristics (which imply that it doesn't lead the overall story to an end). Obtaining is the OS concern of Lord of the rings: Destruction of the One Ring  means the end of the great war against Sauron - the OS ends when the good guys are successful with Obtaining. Obtaining is the OS Concern in Pirates of the Carribbbean first movie. Once the course is broken the OS ends. \nOn the contrary Doing is the OS Concern in Star Wars. The OS does not end by destroying the Death Star - it's only a great step forward for the rebels to weaken the Empire. That's why I think that Doing is the OS Concern in Terminator too. The OS does not end either when the Terminator gets destroyed. Skynet is still alive, Judgment day is about to come and Sarah still has to Do a lot of stuff to prepare for future battles and get ready to be the mother of mankind's great leader.", "group_id": 2515, "id": 1334866}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307521374.8095291, "message": "@Mikeaja \"There's also an aspect of Terminator that I think makes no sense, and that is Kyle being the father. Its too paradoxical.\"", "group_id": 2515, "id": 1334875}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307521722.582943, "message": "(damn, I just wanted to insert a line break...) I don't think it's too paradoxical as John Connor has no role in this movie. I guess we'd better look at it this way: There is a prophecy that Sarah will give birth to mankind's only hope. Only two characters are aware of this \"prophecy\" - Kyle and the cyborg. The first wants the porphecy to be fulfilled, the other wants to prevent it happening. Removing the timetravel part of the story at least partially for the sake of analisys sounds kinda reasonable for me.", "group_id": 2515, "id": 1334895}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307524370.58955, "message": "To be even more precise: Timetravel belongs to the Encoding part of the story, therefore it can't affect our Structural analysis.", "group_id": 2515, "id": 1335132}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307526646.257566, "message": "I think Skynet vs The Empire is dfferent. The Empire is a direct Antagonist to the Goal. Skynet are not. If we make Skynet the Antagonist, then we must include the future as part of the storyform.\n\nHowever, I agree that it probably shouldn't be a part of the storyform. MC's troubles, imo, come from the two areas of 1) crazy cyborg trying to kill her  2) this terrifying story about her impact and importance on the future. \n\nI'd also still go for an OS Concern of Doing, because even at the end of the film, the war has not been won. However, I think MikeDerk puts a pretty good case for Obtaining. They have achieved survival.", "group_id": 2515, "id": 1335260}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307532907.677283, "message": "@Mikeaja : I don't see how the Empire and Skynet are different. The pure fact that Skynet is not present in the story just makes him similar to the Wizard character in Wizard of Oz. He is not present yet he is the one who pulls the strings, the act of whom initiates the entire OS (like the act of building the Death Star initiates the OS in Star Wars)\n\n\"they have achieved survival\" - it doesn't sound like a valid argument for Obatining for me. They have eliminated a direct Threat - that's for sure, and that's one of the Preconditions of Sarah's survival (and John's birth). On the other hand she has to be prepared for future attacks, she can't stop working on preparing for the war. \n\nAs I see if there was no chance that other robots are going to come back from the future (e.g. T-800 is the only robot ever built and there's no chance of building another one for some reason) then the OS Concern would be Obtaining. Destruction of the robot would solve all the problems. But as it is not the case, the concern can only be Doing. Ensuring the maximum level of safety for Sarah, preparing her for her role, etc.\n\nTo go further: Kyle was not sent back to sacrifice himself for Sarah - he was sent back to defend her. That defense wouldn't have ended with the destruction of the cyborg if Kyle wasn't die. The OS is successful because at the end Sarah is ready for defending herself and she has accepted her role - not because she survived. Were either of those missing, the Outcome would be Failure.", "group_id": 2515, "id": 1335945}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307535238.0930481, "message": "And again: If we accept that the OS TL is Activity and the Concern is either Obtaining or Doing, the Subjective TL Concern can help - which is definitely Playing a Role in my opinion, and not Changing One's Nature. \n\nFrom the Dramatica Dictionary: \" The important difference is that to \"Play a Role\" requires that all the elements of what one wants to be are present in oneself. To \"change one's nature\" requires that there are no elements in oneself that are not in that which one wants to become\" \n\nAs I see at the end of the movie there are all the important elements present in Sarah which is needed for her to be successful as the mother of John. But she doesn't lose too many of her original characteristics. It only happens between the first and the second movie. The Sarah we see in the second part has lost all the unnecessary traits of the original Sarah - her nature has changed.", "group_id": 2515, "id": 1336310}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307536093.151906, "message": "The Empire and the Wizard are both a part of their respective films. Skynet isn't. From Dramatica's point of view, it doesn't matter that the Wizard is at the end, because it is the view of the story fully told. If the Antagonist was Skynet, it would have to be controlling the T800 in the present, which it isn't (otherwise in every film the antagonist would be the original source of the character's badness).\n\nStill, who the Antagonist is probably doesn't influence the storyform anyway.", "group_id": 2515, "id": 1336444}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307537847.1584151, "message": "I guess the answer for the MC-IC TL question lies in the definition of MC (or IC) Throughline by the book. It's that special quality that makes the MC (or IC) different from ANYONE else in the story. \n\nNow lets see: Kyle is a guy from the future with a mission (Situation) But the same is true to T-800 also! From a special point of view they are both soldiers who has to accomplish a mission. A very special mission - but still just a mission. They share this situation - that's the reason it can't be their defining characteristic. \n\nOn the other hand: Kyle is a guy who believes that Sarah is the mother of the future leader, he believes that he has to defend her, he beleives that in a couple of years a nuclear holocaust will happen, etc. (we, the audience know that his beliefs are based on truths but for Sarah he is just a lunatic with a crazy tale)  No one else in the entire story shares his beiefs. Even T-800 doesn't - we can't really think about beliefs in his case anyhow. \n\nAnd again: Sarah is an average woman chased by a lunatic and a cyborg for no apparent reason. Pretty crazy Situation isn't it? I don't think he is concerned with her own Attitudes. Maybe with those two around her. But it would be a really forced explanation imho.\n\nThis is why Sarah is in the Situation domain and Kyle is in Fixed Attitudes and not vice versa. What do you say?", "group_id": 2515, "id": 1336690}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307536589.749505, "message": "@Mikeaja \"Still, who the Antagonist is probably doesn't influence the storyform anyway.\" - Good point. I think I can accept that T-800 is the Antagonist but then Contagonist is probably missing. It's really hard for me to see who represents Hinder, Temptation or Reconsider.\n\nSpeaking of which: I'd be really surprised if such a simple action movie as Terminator (with so little amount of characters) would be a Gran Argument story. I'm convinced that a whole set of elements is totally missing from the story - those few characters are just not deep enough to represent all the elements. Of course we can go on analyzing the storyform, still I think we'll find that some pieces are missing from our great puzzle.", "group_id": 2515, "id": 1336518}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307537001.094907, "message": "I've been thinking about the MC and the IC throughlines. The interesting thing is who gets what part of the storyform. If we discount their activities, as that is covered in their OS characters. On that basis:\n\nMC: chased by cyborg, told a terrifying story she finds hard to believe, gradually she sees evidence to support story (terminator not dying), finally defeating the T. and then accepting her responsibilities. We see her resolve grow throughout the film.\n\nIC:  knows about the future, knows he has to save Sarah / kill the T, knows that Sarah is one reason for John's future strength. Once he arrives in the present (where the story starts), he only has these things to do. He can't return.\n\nWith Dramatica throughlines, I see Situation applying to both of them (Sarah is thrown into an environment of having to survive, Kyle is in the present to do a job and can't stop), Mind applying to both of them (Sarah does not believe the story, Kyle knows about the future) .", "group_id": 2515, "id": 1336565}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307537095.496058, "message": "I don't think Terminator is a simple action movie. I think it goes beyond that (which I guess accounts for it's success). I think the characters are quite deep for the genre.", "group_id": 2515, "id": 1336575}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307539629.8998671, "message": "So as I see the setup is like this:\n\nMC Resolve: Change\nMC Growth: Stop\nMC Approach: Do-er\nMC PS Style: Intuitive\nStory Driver: Action\nStory Limit: Optionlock\nStory outcome: Success\nMC Judgment: Good\nOS Throughline: Activity\nMC Throughline: Situation\nIC Throughline: Fixed Attitude\nSubjective Throughline: Manipulation", "group_id": 2515, "id": 1336944}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307540172.343262, "message": "(why the hell does convore show my texts like this?)", "group_id": 2515, "id": 1337044}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307539689.0043819, "message": "Further on:\n\nOS Concern: Doing\nMC Concern: How Things Are Changing\nSubjective Concern: Playing a Role\nIC Concern: Impulsive Responses\n\nI've started to think about what the crucial element can be and I can't help thinking that it's Determination. Still trying to come up with an explanation for that but it simply feels right - mainly because of the deterministic time-loop the movie itself creates - and for Sarah to be determined to be the mother of John.", "group_id": 2515, "id": 1336955}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307541474.4696529, "message": "especially as choosing Determination as Crucial Element it would mean that the MC Issue is Threat - which doesn't even need too much explanation.", "group_id": 2515, "id": 1337327}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307543672.847652, "message": "@Novbert,  re. the MC and IC domains, I'm not sure where you are dividing OS characters and MC, and IC. Regarding this post:\n\n\"Now lets see: Kyle is a guy from the future with a mission (Situation) But the same is true to T-800 also! From a special point of view they are both soldiers who has to accomplish a mission.  ...............................\"\n\nisn't that OS story?\n\nJim made a very good point in another thread a while ago - using the character names for both OS, MC and IC, means it easy to confuse them. \n\nFor example, to me \"Kyle is a guy from the future with a mission\" is the OS character, the soldier, not Kyle the IC.", "group_id": 2515, "id": 1337643}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307544796.722554, "message": "... simply because he is part of the story and he can't really be seen as anything else.", "group_id": 2515, "id": 1337855}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307544757.471472, "message": "I guess I get your point. Clarification of what the OS really is about looks inevitable. Now let's see (from Wikipedia): \n\n\"In the near future an artificial intelligence network called Skynet will become self-aware and initiate a nuclear holocaust of mankind. Sarah's yet-unborn son John will rally the survivors and lead a resistance movement against Skynet and its army of machines. With the Resistance on the verge of victory, Skynet has sent a Terminator back in time to kill Sarah before John can be born, as a last-ditch effort to avert the formation of the Resistance.\"\n\nAs I see ignoring Skynet makes the OS inexistent. Without him (it?) the story is just about a crazy guy who wants to kill a woman and another crazy guy who tries to save her. Neglecting Skynet and the war with machines would mean that there is no overall story at all. Even if Skynet has only one single action in the story (sending back the T-800), it qualifies him as Antagonist.", "group_id": 2515, "id": 1337846}, {"user_id": 10814, "stars": [], "topic_id": 38436, "date_created": 1307547292.2130361, "message": "I think the Terminator (Arnold) is a representative of Skynet and embodies the antagonist's elements in the OS.  That said, this film has very few essential characters, which means the primary players (Sarah, Reese, the Terminator) must take on many of the extra duties of the other OS characters.  Occasionally, other OS characters pop up to take on the other roles (skeptical psychiatrist, etc.), but the bulk of the story surrounds these three players.", "group_id": 2515, "id": 1338424}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307550576.205184, "message": "@Novbert, I don't understand what you mean here: \"As I see ignoring Skynet makes the OS inexistent. Without him (it?) the story is just about a crazy guy who wants to kill a woman and another crazy guy who tries to save her. Neglecting Skynet and the war with machines would mean that there is no overall story at all.\"\n\nIf you forget all the other terminator films and series, Skynet is only a minor mention. They are not trying to defeat Skynet in this film. Everything you've quoted from Wiki is not in the film. It's like the credits before Star Wars - it's already happened (but in the future).\n\nPlus, my reference to OS story was only in the Dramatica sense, not meaning the plot. The OS story can't 'not exist' because it involves all the characters from an objective view. \n\nGoing back a step, and you're description of Kyle, I think issue was whether you were  describing the IC, or the soldier sent back in time, the OS character?", "group_id": 2515, "id": 1339006}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307550650.3307121, "message": "Good lord... so much to respond to! Convore isn't really built for this...", "group_id": 2515, "id": 1339017}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307551695.6368461, "message": "So, someone said something about \"if the T-800 were the only machine that could come back...\" then the story could be an Obtaining story.\n\nThe T-800 is the only Terminator that can come back. They destroy the time machine. \"No one goes back. No one else comes through.\"\n\nAlso, since you are saying that the goal is the fulfillation of the 'prophecy' -- I would say, \"Yes,\" and say that once it's fulfilled or prevented, it's Obtained (or not).\n\nThat is why this is an Obtaining story, and not a Doing story. It doesn't matter that the war is going to rage in the future, or that Sarah & John Connor have to be ready. That is not relevant to the story being told here, except that it's the new \"stasis\" that is established at the end.", "group_id": 2515, "id": 1339176}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307551795.0868759, "message": "The reason the movie is not about the process of protecting Sarah is that *they already know she lives and gives birth to John* -- except for this one thing: the Terminator. Remove the Terminator, the rest is written....", "group_id": 2515, "id": 1339188}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307552213.839926, "message": "Can we take a step back and decide on the four throughlines? It's obviously something we aren't clear on.\n\n1. A Terminator has come back from the future to kill the mother of John Connor. A soldier has come back to prevent that from happening.\n2. A passive, not very go-getting waitress (Sarah) has to grow into a leader.\n3. The soldier (Kyle) comes face to face with the woman he has loved forever.\n4. Kyle must convince Sarah that the world is headed into a terrible war in the near future.\n\nAny changes?", "group_id": 2515, "id": 1339246}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307554481.4146719, "message": "What do you think the four throughlines are?", "group_id": 2515, "id": 1339554}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307553928.813189, "message": "I'd say, looking at your descriptions and some of the earlier ones:\n\n1. OS: Activity\n2. (I think the description you've given is the OS character, I'd say the MC view is how we see Sarah inherently being quite resourceful and strong)  MC: Mind or Situation\n3.  IC: Mind or Situation (I think Kyle is more in Situation than Sarah, becomes he knows the outcome and what needs to be done)\n4. MC/IC: Manipulation", "group_id": 2515, "id": 1339481}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307553976.5155759, "message": "Having to choose one for Sarah, I'd choose Mind simply because I think Situation fits better for Kyle.", "group_id": 2515, "id": 1339487}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307554137.499099, "message": "Therefore, a IC concern of Future fits Kyle much better than Sarah. So I could give you Obtaining for the OS concern. The MC Concern would be 'Innermost desires' but can't say why. MC / IC Concern of Changing one's Nature is what Kyle (and the world) needs Sarah to do.", "group_id": 2515, "id": 1339507}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307554475.7707551, "message": "I'm just trying to pin down the four storylines before worrying about what Domain we put them in. We're doing two steps at once, and we're confusing ourselves. \n\nTo that end, I'm not really referring to an OS characters or the MC/IC characters yet. (Although, it's pretty obvious that Sarah is the MC....)", "group_id": 2515, "id": 1339553}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307561215.9354069, "message": "Simulpost.", "group_id": 2515, "id": 1341071}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307561340.1782279, "message": "I'm curious now to see if \"what Sarah brings with her\" is going to turn out to be her inability to fight back (mind) or her destiny to bear John (situation).", "group_id": 2515, "id": 1341116}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307561187.755749, "message": "The more I think about the throughlines, I wonder if we are making a mistake about how we are looking at Sarah. Her Domain/Problem, etc, should exist before the movie begins. It's what she brings with her.", "group_id": 2515, "id": 1341063}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307561253.2884691, "message": "Yes. Why before the movie begins? Isn't her problem this terrible story of the future that has suddenly been sprung on her?", "group_id": 2515, "id": 1341082}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307561171.2436831, "message": "Ok, see what you mean.... So using and adding to your list....\n\n1. A Terminator has come back from the future to kill the mother of John Connor, to stop his existence. A soldier has come back to prevent that from happening. A not very go-getting waitress gets caught up in a battle she knew nothing about.\n2. A passive Sarah is thrown into a situation where she has to learn how to survive, and is told a terrifying story about her son and the future which she doesn't believe. She has to grow into a soldier and learn about the terminators.\n3. Kyle knows what he has to do, has given up his life and sent himself to the past from which he can't return, to protect the human race, and comes face to face with the woman he has loved forever.\n4. Kyle must convince Sarah that the terminator is real and won't stop, that the world is headed into a terrible war in the near future, and that her son makes a difference to humanity.", "group_id": 2515, "id": 1341055}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307561423.3545661, "message": "I wouldn't say she is unable to fight back....... I think she initially appears unsuitable for fighting. However, at the end we see a strong woman becoming a soldier.", "group_id": 2515, "id": 1341148}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307561862.6023569, "message": "I'd also say your post is a reason why she might not be Situation.......... her destiny to bear John is not part of the story - it existed before and after.", "group_id": 2515, "id": 1341301}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307564977.657938, "message": "But... if it exists before and after, isn't that an argument that it is a Situation?\n\nThe more I think about it, the more I think she must be Situation: She's been targeted for termination. Her name is Sarah Connor. She will bear a son who will lead the resistance.", "group_id": 2515, "id": 1342270}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307565491.8383391, "message": "I'm also curious is Reese's Fixed Attitude is really just a reflection of The Terminator's. (Can that work within the theory?) It's the Terminator who is obsessive. \"He will not stop.\" It's that Fixed Attitude that fuels Reese (and nobody else, except the cyborg).", "group_id": 2515, "id": 1342339}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307566812.422996, "message": "It exists before, during and after. The others don't traverse all three. (She's no longer a target for Termination, and doesn't know she's fated to give birth to John before -- and she has to know, or it can't be something she personally has to deal with.)", "group_id": 2515, "id": 1342599}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307566641.3768051, "message": "I don't think, as far as I know, that what exists before and after is part of the storyform. Otherwise we could add all sorts of things that brought events to where we are as the film starts (in the Star Wars examples, what is in the starting credits is not included in the storyform).\n\nI would say the targeting for termination has already happened, and her position of giving birth to John is also before and after (the story doesn't decide that). \n\nNot saying your wrong about Situation, but I don't think it is for that reason.\n\nI also think the 'Kyle knowing about the future, knowing the consequences, Sarah needing to start believing it and realising her future role'  is significant re. the MC, IC and MC/IC.", "group_id": 2515, "id": 1342565}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307571049.7731371, "message": "That is what changes for the MC, isnt it?", "group_id": 2515, "id": 1343243}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307571022.6893671, "message": "You know...... I think this is it...... sorry to quote myself  \"The only difference is, she now knows about it and believes it.\"", "group_id": 2515, "id": 1343239}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307571882.970083, "message": "I'm also pretty willing to put \"Becoming\" in as the last SS signpost, and Being in as the penultimate one (when she acts like a commander to get Reese to move, and she builds the bombs with him.)", "group_id": 2515, "id": 1343330}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307570703.2228529, "message": "Here is what I'm pretty confident in, just to keep things up to date:\nOS Physics/Obtaining\nSuccess/Good\nAction/Optionlock\nChange", "group_id": 2515, "id": 1343208}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307570879.389075, "message": "Yes, I agree with that. But I don't think that can mean Situation. Surely the domain choice has to be whatever causes conflict within the story, and is resolved at the end. As MC, she starts the film already in the situation of mother of leader (she doesn't know bt the author does), and ends the film the same way in the same situation. The only difference is, she now knows about it and believes it.", "group_id": 2515, "id": 1343225}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307571082.6047461, "message": "I dunno.", "group_id": 2515, "id": 1343248}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307570968.69555, "message": "And, to paraphrase Chris, if it doesn't change or develop, it's not what the throughline is about.", "group_id": 2515, "id": 1343233}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307571208.2000821, "message": "I like Psychology/Becoming, too, fyi. \nWhat is their relationship? Protector/Protectee... yes, but also \"teacher/student\" -- he's always teaching her, telling her about what's to come. Then, at the end, she Becomes the leader, the legend, he has always known about.", "group_id": 2515, "id": 1343251}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307571242.2611599, "message": "Still, none of that pursuades me that Situation is wrong, I also see Mind here as well........ but I do think our view of the story through her is about her development, rather than her being the mother.", "group_id": 2515, "id": 1343254}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307572713.214854, "message": "What's interesting here for me is that I think the analysis / Dramatica is showing us why this film is more than an action robot film. I think the MC adds this. She's not some tough cop type character (like Die Hard). She couldn't appear less suitable for the task at the start of the film. \n\nSo I think the MC throughline is adding the layer, and audience position of seeing her evolve from 'passive waitress' into 'almost leader'. \n\nFor me, this is highlighted in the scary beginning, up against impossible odds, this girl has no chance, she's not even a good waitress............. whereas at the end, almost feeling sorry for the terminator with no legs being against this strong, resourceful woman.\n\nSo, after all that, Mind or Situation????? \n\nFrom the Dramatica definition., I thought this was interesting....... \"When a story's problem revolves around the unsuitability of someone's essential nature to a given situation or environment, the central issue is Impulsive Responses. \"\n\nWe can't have Impulsive Responses with Obtaining, however it does suggest Sarah could well be Mind.", "group_id": 2515, "id": 1343403}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307571443.3021231, "message": "Yes, I'd go along with that. And I think it applies to Kyle to. He becomes a success, a real asset in the war, and protector / lover of Sarah.", "group_id": 2515, "id": 1343265}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307571672.9478011, "message": "I don't normally go about things this way, but I really see her as a Start character, too. I don't see her doing anything to inhibit herself throughout the whole movie.\n\nThat would make her be-er/Mind (if the storyform is applicable). Which would point to her reluctance as her \"fixed attitude\". But, I'd still have to convince myself she's not in a situation.", "group_id": 2515, "id": 1343290}, {"user_id": 7664, "stars": [{"date_created": 1307574897.3689489, "user_id": 7645}], "topic_id": 38436, "date_created": 1307573314.5025671, "message": "I think you're exactly right that her change is what makes this movie successful. \n\nThat's why I say all stories must have a Hero who Changes!\n\nJust kidding.\n\nBut, her change is crucial here. Still, I think what you're describing is the fallout from the SS Throughline. (I have no problem with that. It just doesn't help the Situation/Mind dilemma.)", "group_id": 2515, "id": 1343484}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307573778.5537851, "message": "But if it is her change and she is MC, whether its a fallout of the SS or not, surely it must also be MC......... or not??   Won't it always be the case that MC change is the fallout of the SS story??  That is what the IC is therefore afterall.", "group_id": 2515, "id": 1343543}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307574113.37585, "message": "Is that sarcasm....??   By the way, looking in Dramatica, adding the domains, OS concern and static appreciations you mention, Becoming can be signpost 4, Being, 3. So that also works. It makes Doing the OS benchmark...... so nice to see it got a look in!", "group_id": 2515, "id": 1343594}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307573832.528451, "message": "Good Point! And so obvious! Yes, absolutely, you're right.", "group_id": 2515, "id": 1343549}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307577026.1295941, "message": "No, not sarcasm. Amazement that I overlooked a cornerstone of the theory.", "group_id": 2515, "id": 1343962}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307577910.7975011, "message": "Glad I was right! So does tha mean we've almost got a storyform? I mean, has this led us to MC Mind or could it still mean Situation? With change as the focus, and that quote from the Dramatica definition, I'm finding it hard to see beyond Mind now.", "group_id": 2515, "id": 1344122}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307580465.132323, "message": "Let's stick with Mind and see where it gets us", "group_id": 2515, "id": 1344461}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307589857.2863851, "message": "I noticed there were 16 storyforms left, and 16 problems, so I jumped ahead and went straight there. \n\nI'll let you pick your own Problem, though, just to see if we got the same one.", "group_id": 2515, "id": 1345964}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307605909.5012889, "message": "So many things to comment on. Yet I'm still not convinced by some of your points. Well, I guess it's better to present my point (quotes from Dramatica Dictionary) and see what you think about it:\n\nMC Throughline (\"Everything the Main Character does and represents that primarily relates to him alone, as opposed to specific relationships he has with other characters\"): Situation (\"any fixed state of affairs ... that remains stable and unchanging\"): The MC is the mother of mankind's great leader. She always was, she always will be. She can do nothing about it. It's her destiny. The MC TL revolves around how she deals with this situation - when it gets revealed for her - and with all the implications.", "group_id": 2515, "id": 1347237}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307606387.125633, "message": "IC Throughline (\"The dramatic progression which builds the Impact Character's pressure on the Main Character to change\"): \n\nFixed Attitude (\"...The key is that the attitude is fixed, meaning it is accepted as a given and not re-evaluated...\")\n\nThe IC pressures the MC pretty much with his fixed attitude. He insists that a future war is coming and the MC's not born son will be the leader of humans. He also insists that the MC has to get prepared for those things and he is not willing to change or give up his views or give up staying with the MC and protecting her. Everything the IC does comes from his Fixed Attitude and that's what puts pressure on the MC to change.", "group_id": 2515, "id": 1347258}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307606915.7552159, "message": "OS Throughline (\" The Overall view of a story is the widest, examining the issues that affect all the characters in the story overall.\")\n\nActivity (\"The Activity Class is one of action\")\n\nThere is a war going on between humans and machines. Humans, led by a great leader, are at the edge of victory. The leader of the machines decides that his only option is to make the humans unprepared for the war by preventing the birh of their great leader. Being aware of that humans try to do everything to protect the mother of their leader in the past. All the characters in the story participate in this activity - this war.", "group_id": 2515, "id": 1347278}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307607679.268172, "message": "so you argue that  \"everything the Main Character does and represents that primarily relates to her alone, as opposed to specific relationships she has with other characters\" is her fixed attitude of disbelief?", "group_id": 2515, "id": 1347310}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307607858.325429, "message": "@MikeDerk ....... possibly  OS Problem: Pursuit,  which from the 16 storyforms selects all the others as well. This gives IC Problem: Help, MC/IC Problem: Conscience and MC Problem: Pursuit.\n\nThe OS, IS and MC/IC I can see, but not sure about the MC problem there. However, if I start with the MC problem, I don't see any that immediately jump out at me, so will leave as this.", "group_id": 2515, "id": 1347314}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307607315.404557, "message": "Subjective Throughline (\"... This is not the view from within the shoes of either the Main or Impact Characters, but is rather like an Overall (Objective) view of their relationship. It is a view of their story together which always sees both of them.\")\n\nManipulation (\" The Manipulation Class is where the evolution or change in an attitude is explored,\")\n\nThe story of the MC and IC is pretty much about changing their ways of thinking. The IC wants the MC to accept her destiny and act like the mother of mankind's leader, also to be cautious and prepared for any future threats. Changing the way the MC thinks is crucial for the IC - if he fails to change the way the MC thinks, mankind is most likely lost. On the other hand if he succeeds in changing the way the MC thinks about his story, there is hope that the MC's son will be born and raised in a way so that he is prepared for his future role.", "group_id": 2515, "id": 1347294}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307607473.609544, "message": "@Novbert,  I'm not sure about this as a reason for Domain choice - \"The MC TL revolves around how she deals with this situation - when it gets revealed for her - and with all the implications.\"\n\nThat could be said about every MC throughline. Plus, bear in mind, as we've discussed, being the mother of the leader is not actually part of this story. She was before, and she is afterwards. We need to look at just the middle bit.\n\nHave a look at this........ it's from your comment but I've reversed the focus. I think it still works:\n\n\"The IC pressures the MC because he knows about a future war and MC's role, and has to change the MC's fixed attitude of disbelief. He also knows that the MC has to get prepared for those things and his Situation and knowledge means he can not give up staying with the MC and protecting her. Everything the IC does comes from his Situation (one way trip, knowing the future) and that's what puts pressure on the MC to change her Fixed Attitude\"\n\nThis is just my opinion regarding the film. In a more general sense, I think you are using these Dramatica terms too literally. We need to see why it relates to a fixed attitude, not that his attitude is fixed. \n\nSo back to the film...... Kyle KNOWS the future and this doesn't change, Sarah DISBELIEVES the future story and this needs to change. Surely disbelief relates more to a fixed attitude than knowledge. Kyle has not belief that needs changing. He knows what will happen.", "group_id": 2515, "id": 1347302}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307607973.227881, "message": "Also I'm simply not willing to accept that argument that the MC being the mother of the leader is not part of the story just because it doesn't change throughout the story. The whole story only happens because she is the mother. \nAs I see the pure fact that the MC has an unchanging characteristic which ignites a lots of events can't be translated as anything else than MC TL: Situation", "group_id": 2515, "id": 1347318}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307608068.342047, "message": "@Novbert   not sure what you mean, but one thing that seems to come through the MC throughline is her growth from disbelieving waitress to a much stronger woman resigned to the truth. There is a change in attitude. Kyle beliefs, his position on the issues, is not a factor of the story. He knows what he has to do, and he has come to do it.  His attitude / outlook has no bearing on what he is doing, whereas Sarah's does because she has to start to believe.", "group_id": 2515, "id": 1347322}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307608234.533293, "message": "@Novbert worth checking out ont of the threads that discussed Star Wars. It was said that what is told to us in the credits at the start is not part of the Dramatica storyform. We are not analysing the world, just the story.\n\nHer situation doesn't ignite events, the terminator and kyle coming back do that.", "group_id": 2515, "id": 1347327}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307608542.97019, "message": "The opening credits in SW are not part of the storyform??? Now check this out:\n\nThe opening credits of SW: \n\n\"It is a period of civil war. Rebel spaceships, striking from a hidden base, have won their first victory against the evil Galactic Empire. During the battle, Rebel spies managed to steal secret plans to the Empire's ultimate weapon, the DEATH STAR, an armored space station with enough power to destroy an entire planet. Pursued by the Empire's sinister agents, Princess Leia races home aboard her starship, custodian of the stolen plans that can save her people and restore freedom to the galaxy.... \" \n\nThe description of the OS Throughline of SW from the Dramatica book:\n\n\"The Objective view of Star Wars sees a civil war in the galaxy between the Rebels and the evil Empire. The Empire has built a Death Star which will destroy the Rebels if it isn't destroyed first. To even hope for a successful attack, the Rebels need the plans to the Death Star which are in the possession of a farm boy and an old Jedi master. These two encounter many other characters while delivering the plans, ultimately leading to a climactic space-battle on the surface of the Death Star.\"\n\nBasically I see only phrasing differences between the two.", "group_id": 2515, "id": 1347335}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307609285.6704919, "message": "@Mikeaja \"one thing that seems to come through the MC throughline is her growth from disbelieving waitress to a much stronger woman resigned to the truth\"\n\nNo no. Of course you are right but it's the description of MC's Problem and Solution. I can tell pretty much the same thing about Star Wars - and Luke's Throughline - again. The MC Throughline there is his growth from a wannabe Jedi to a person who starts to use and rely on the Force. But it has nothing to do with his TL - it's his Problem and Solution.", "group_id": 2515, "id": 1347391}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307611889.764457, "message": "But the Star Wars OS domain isn't Situation. Look at the credits. If the storyform was about the civil war (similar to Sarah Connor's being mother), then it would be Situation.\n\nPrincess Leia isn't the Protagonist, which she would be if we follow the credits. The storyform starts after the events in the credits, using the end of your quote \"These two encounter many other characters while delivering the plans, ultimately leading to a climactic space-battle on the surface of the Death Star.\"\n\nRe. Problem / Solution and Throughline, these must be connected. The conclusion to the Throughline is when the Problem is Solved. We can't have the Problem in one domain, and the Throughline in another.", "group_id": 2515, "id": 1347668}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307614163.7715991, "message": "@Mikeaja: You've said that \"the MC throughline is her growth from disbelieving waitress to a much stronger woman resigned to the truth\"\nIn my opinion this statement only means that MC Resolve is Change. It also suggests that MC Growth is Stop (stop disbelieving). It doesn't define the MC TL at all.", "group_id": 2515, "id": 1347944}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307613270.6997521, "message": "And I don't really understand what you're arguing agains (or for). \nI pointed out that the opening credits of SW match the OS description by the book. What the OS domain really is (situation or not) has nothing to do with the pure fact that the OS story view is presented in written form in the beginning of the movie. Therefore it's part of the storyform.", "group_id": 2515, "id": 1347828}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307613637.6095991, "message": "Would you describe the OS in star wars to show how the opening credits are not part of it?", "group_id": 2515, "id": 1347871}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307614408.7604461, "message": "Everything defines the MC throughline. Just because it relates to other elements, it doesn't mean it's not the throughline. If that's not the throughline, I'm not sure what is. That's what we see in the film, imo. \n\nStill, if your saying the throughline is 'shes the mother-to-be of John Connor', then 1) we won't agree on that...... and 2) I would say that's OS anyway.", "group_id": 2515, "id": 1347990}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307612504.8296919, "message": "@Mikeaja: \"We can't have the Problem in one domain, and the Throughline in another\"\nProblems are on the lowest level of the chart. They are Elements, which are repeated in all four domains. Therefore they are not dependent on the TL - and not defined by the domain.", "group_id": 2515, "id": 1347724}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307613269.913018, "message": "I'm not sure why you're separating Problem from the Domain, when you've said yourself it's in the Domain. If the Problem i in the domain, then to me tha suggests it also depends on it.\nI think that's wrong with regard to how Dramatica works and how we should storyform, so perhaps we should agree to disagree on that point.....", "group_id": 2515, "id": 1347827}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307613435.427443, "message": "@Mikeaja: I separate Problem from Domain, because Problems are Domain-independent. The Problem of Equity can be found in all the four domains. So the other 64 possible problems. That means that by defining the problem you don't define in which domain it resides.", "group_id": 2515, "id": 1347842}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307613462.484822, "message": "I think my example showed that the credits in SW are not describing the story we then see, and the end of the OS description has nothing to do with the credits. They describe what happened before, whereas the OS description finishes with what the story is about.\n\nStill, good to flesh these things out. I'd say it's got very much to agree to disagree territory.", "group_id": 2515, "id": 1347848}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307614107.9355381, "message": "Ok.... well, if it is about the civil war (which the credits are referring to) the Domain would be Situation. The OS Goal would be 'to end the war'. \n\nIf we start the storyform form including the credits, we have an on-going civil war, and stealing the plans. Leia would be Protagonist, Luke and Ben would only be at the end of the story. It would also be a massively epic story because we'd start with Leia as this fearless Protagonist, who would then become victim, and then almost insignificant. \n\nThe Dramatica storyform starts with farm boy finding droids, presumably days / weeks after the credits timeline. The Dramatica goal is to blow up the death star / protect the rebel base, not win the war.\n\nI'd also recommend finding that thread because this idea was stated by others who know far more than me.", "group_id": 2515, "id": 1347939}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307613589.721504, "message": "I think you've misunderstood the terminology relating to Problem, but I might be wrong. it might be the same word in each Domain, but the Domain and Concern provide the context for that Problem, thereby changing the meaning of that word. Otherwise, Dramatica would not repeat them and put them within the Domain space.", "group_id": 2515, "id": 1347860}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307616853.964663, "message": "If you go up approx 54 posts.......... I think that's what you mean. The post by me that starts with \"OK.... I see what you mean\".", "group_id": 2515, "id": 1348225}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307616250.082413, "message": "@Mikeaja: I appreciate your honesty.\n\nOn the other hand I gave a pretty detailed description of the four TLs as I see them and explained why I think they are set up that way. I'd be more than happy if you'd do the same to illustrate your opinion on all the four TL-s instead of arguing about them separately. Who knows, maybe you can even convince me.", "group_id": 2515, "id": 1348174}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307617594.76858, "message": "@Mikeaja: Well then. Some quotes from your own post:\n\n\"2. A passive Sarah is thrown into a situation....\" - even you argue that the MC's defining characteristic is her situation.\n\"3. Kyle knows what he has to do...\" - Fixed Attitude can't be described more precisely imho\n\"4. Kyle must convince Sarah that the terminator is real and won't stop...\" - sounds pretty much like Manipulation for me\n\nWhat remains is that OS domain is Action.", "group_id": 2515, "id": 1348276}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307618653.3207741, "message": "For 2., the key word there is passive, and thrown into a situation she is not initially suitable for. You are mixing English definitions with Dramatica ones. plus that is only the start. The key element of MC throughline, imo, is that she needs to believe in this stuff and what it means (Fixed Attitude).\n\nFor 3, knowing what you have to do does not sound like Fixed Attitude at all to me. How is there any attitude or belief? Remember that these throughlines have to MEAN something in the story, have to create conflict, not just be word definitions. Kyle knowing about the future sends him to protect Sarah. He has already acted on that knowledge. What we see is Kyle having to protect Sarah and kill the terminator (Situation).\n\nIt's Sarah that needs to start believing, not Kyle, therefore only Sarah's beliefs create any conflict.\n\nI should add, before writing this post I checked the storyform throughlines on the Dramatica site, and they do agree with this.", "group_id": 2515, "id": 1348386}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307622254.133116, "message": "Personally, given that those storyforms are not user submissions, I'd go with it. What's interesting though is that it gives MC Domain: Mind for different reasons. \n\nGoing back to 2), you said \"What the MC needs to do to resolve her problems has nothing to do with her domain. It rather defines MC Problem and MC Solution Elements. MC domain on the other hand is that aspect of the MC which is uniqe to her. \"\n\nI guess this highlights our differing opinions....... as I disagree resolving the problem is nothing to do with the domain (I actually think the opposite), and I don't think the Domain is what is unique to an MC. The Domain is the area within which the MC operates, and the area where the conflict resides.\n\nRe. 3)  and this bit \"The IC only has to do things because of his Fixed Attitude. If it wasn't for his Fixed attitude he wouldn't give a crap - the whole story would not happen.\"\n\nI don't see an IC fixed attitude as effecting the story at all, although again I think you are using these terms too literally. His knowledge and drive are not Fixed Attitude. How is that causing any internal conflict?? He actually causes him to act externally. Phsyics and Situation are external domains.\n\nAnyway, I think we should agree to disagree on this.\n\n@MikeDerk did you see the Problems I suggested? Were they the same as yours?", "group_id": 2515, "id": 1349021}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307620689.640676, "message": "For 2: What the MC needs to do to resolve her problems has nothing to do with her domain. It rather defines MC Problem and MC Solution Elements. MC domain on the other hand is that aspect of the MC which is uniqe to her. Which makes her different from every single other character in the story. Her fixed attitude of not believing in timetravel, robots and such doesn't make her unique - the same things can be said about the Psychiatrist or any other everyday person. Her Situation on the other hand is pretty unique - and it defines her very well.\n\nFor 3: From the audience's point of view the IC acts normal yet, every character thinks he is a lunatic with a weird tale he's sticking to. Knowing and believing aren't so different - they are both mental things and they are both static. And as I see this Attitude create a lot of conflict for him. You say \"What we see is Kyle having to protect Sarah and kill the terminator (Situation).\" Now if that's Situation then literally everything can be called Situation. The IC only has to do things because of his Fixed Attitude. If it wasn't for his Fixed attitude he wouldn't give a crap - the whole story would not happen.\n\n\"It's Sarah that needs to start believing, not Kyle, therefore only Sarah's beliefs create any conflict.\" If a lunatic would chase you saying: \"I know you're the mother of humanity's only hope\" I'm curious what you'd say, whose beliefs create a conflict between you two. On the other hand the MC doesn't even have any beliefs to change. She's a regular everyday normal woman. The source of conflict is that she doesn't have the beliefs that the IC has.", "group_id": 2515, "id": 1348674}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307620918.0274529, "message": "About the Dramatica storyform argument: The pure fact that someone once analized the story the same way you do now doesn't prove anything. You both can be wrong. Just like me.", "group_id": 2515, "id": 1348718}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307625281.094059, "message": "@Mikeaja:   I can agree to disagree, yet ... some more thoughts on what you wrote: So your point is that the conflict of a given TL identifies that TL. So what is the MC conflict? You have to go very deep into the story to see the MC even considering changing her mind or not. Random lunatics attack her, that's her conflict. Solving this conflict requires a whole lot of things from her (Preconditions) one of them is changing her mind.\n\nAlso I don't see why IC's domain should create INTERNAL conflict. On the other hand the IC would have no conflict at all if it wasn't for his Fixed Attitude - by which I mean both memories, knowledge and that he is willing to fulfill his mission at any cost. Damn that guy has such strong beliefs that he eventually dies sticking to them. Without his Fixed Attitude he could have opted for travelling to Hawaii and drink mojito - he'd have been without conflict. Also he's surrounded with other Fixed Attitude folks. The MC, the cyborg, the Psychiatrist, they all have their own fixed attitudes. Would they be easier to convince there would also be no conflict for the IC.", "group_id": 2515, "id": 1349857}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307627012.759172, "message": "Re: Sarah's Throughline in The Terminator. Look to her Approach. You would be hard pressed to see her as anything but a Be-er. She doesn't \"do\" anything until the end of the story, which is typical of many Change characters in either the Mind or Paychology domains.", "group_id": 2515, "id": 1350158}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307627069.2788761, "message": "@Mikeaja: Checked the analysis on dramatica site. The explanation for why the MC domain is mind sounds totally ridiculous for me. She is chased by an obsessed cyborg, THEREFORE her domain is Mind. I'd rather accept your explanation if I had to choose between the two.", "group_id": 2515, "id": 1350175}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307628052.559243, "message": "@jimhull,  thanks for the clarification.\n\n@Novbert, I've selected a few extracts, because I think we've covered the overall idea already to some extent.\n\n\"You have to go very deep into the story to see the MC even considering changing her mind or not. \"  - Mind domain covers more than just this, it's also about someone being unsuitable for a task, being pushed to their limits, being desperate, etc. You're still using 'Fixed Attitude' much too literally, imo.\n\n\"Random lunatics attack her, that's her conflict. \"   - but that's OS story. How she copes, how she develops is the MC story in this film, imo.\n\n\"Damn that guy has such strong beliefs that he eventually dies sticking to them. \" - No, they are not beliefs. It's not a feeling or opinion. He KNOWS what is to come. For that reason, he gave up his life to place himself in the past to protect Sarah, stop the terminator. That is when the story starts. About internal conflict see this page: http://dramaticapedia.com/tag/domains.\n\n\"Would they be easier to convince there would also be no conflict for the IC.\"  - yes there would, there would be a unstoppable terminator trying to kill Sarah, and the only person who can stop it is Kyle. He doesn't benefit from them being convinced, they do.", "group_id": 2515, "id": 1350301}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307631250.131391, "message": "Because she adapts to what happens to her. Kyle is not running away - he came here to stop the terminator and save Sarah.", "group_id": 2515, "id": 1350785}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307629956.00194, "message": "@jimhull: Good point, and I don't remember the movie well enough to argue against it. Still I think it might be hard to decide whether the MC or the IC is the Do-er when both of them is just constantly running away from an unstoppable cyborg. How exactly is the MC's Be-er approach portrayed? Really don't remember.", "group_id": 2515, "id": 1350525}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307633580.3509929, "message": "I wonder how you're trying to make these fit......... because two absolutely jump out at me as clearly Sarah - Subconscious and Precocious.", "group_id": 2515, "id": 1351142}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307632313.565619, "message": "Okay, I guess I can accept that MC Domain is Mind just because it's either Mind or Situation and she is a Be-er as you've said. But then... what is her concern? None of the four seems to fit.", "group_id": 2515, "id": 1350973}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307633713.820945, "message": "She needs to survive. her and her son's lives depend on it. It's the most basic need - Subconscious\n\nShe is initially not suitable at all for the task - Preconscious \n\nHowever, at the end of the film she clearly is up to the task, so Concern: Subconscious,  Benchmark: Precocious.", "group_id": 2515, "id": 1351163}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307637829.517746, "message": "I'm on a deadline, so i can't participate today. I could barely ingest all the good thoughts above.\n\nBasically, though, I'm not finding much evidence in the movie that Sarah is a Be-er (despite \"not doing\") and I'm having trouble thinking of her as Mind. Same, but opposite for Reese: seems like Mind to me, but acting like a Do-er.\n\nI did pick \"Pursuit\" for the OS Problem. This opened up a bunch of other things that made me go, \"what?\" \n\nI checked the site: a bunch of what I read seems like a stretch to me. \"Her female energy lets her give birth to a son\" -- hmmmm....", "group_id": 2515, "id": 1351747}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307640031.397114, "message": "I looked into the Be-er thing...... I wasn't convinced at first. But then I saw examples of Be-ers because they adapted to the situation, rather than changing the situation. Then it made sense.\n\nWell. both you, me and the Dramatica storyform picked Pursuit as OS Problem.", "group_id": 2515, "id": 1352015}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307640798.4863181, "message": "She has the characteristics of a Be-er, but seemingly no real fixed attitude. Or, just a really weakly defined one.\n\nI know it's anal of me, but I like each point to be proven independently.", "group_id": 2515, "id": 1352086}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307642244.7260799, "message": "She has the characteristics of a Be-er, but seemingly no real fixed attitude. Or, just a really weakly defined one.\n\nI know it's anal of me, but I like each point to be proven independently.", "group_id": 2515, "id": 1352193}, {"user_id": 30951, "stars": [{"date_created": 1307654431.1159389, "user_id": 7645}], "topic_id": 38436, "date_created": 1307647023.076406, "message": "Saying that, I think there will always be some throughlines that are weekly defined given the stronger emphasis on some throughlines, and because we're only seeing the audience view.", "group_id": 2515, "id": 1352827}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307646932.5215869, "message": "Re-quoting one of my earlier posts, I think when looking at the Concerns Subconscious and Preconscious I think it shows the fit much better.\n\nI think it's easy (I know I did) to look at Fixed Attitude as 'being stubborn', 'stuck in one point of view' or 'having a fixed long-term belief', whereas I think it is supposed to encompass much more than that.\n\nLook at the Concern descriptions - they could almost be describing Sarah's story of survival and as passive waitress (her unsuitability).", "group_id": 2515, "id": 1352825}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307650879.539741, "message": "I've just watched the movie and I hate to say but I was wrong all the time. I didn't remember Reese saying \"no one will ever come back. They'll blow the place up\". When you put it this way OS Concern is definitely Obtaining. Now I'm also convinced that Sarah is a Be-er. She really adapts to many situations others would try to change. She never even questions the crazy story of the IC - the plot doesn't really gives her a chance for doubt. That implies that her MC domain is Mind and MC Concern is Subconscious (survival).", "group_id": 2515, "id": 1353309}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307652771.085273, "message": "Avoid also means prevent. The problem with flopping it that way is that Reese would be driven by Hinder. Help seems more appropriate in this context.", "group_id": 2515, "id": 1353658}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307652381.0859489, "message": "MC Problem: Pursuit? Sounds trivial - almost too trivial for me. She's being pursued, that's for sure, but her problem rather lies in the fact that she wants to avoid her enemy (and her destiny) instead of facing it. Facing the enemy solves the problem, but if Pursuit would be the MC Problem, then Avoid would be the solution which is just about not facing the problem. So Avoid is the MC Problem and MC Solution is Pursuit? How do you like it?", "group_id": 2515, "id": 1353590}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307652958.629751, "message": "@jimhull: \"Reese would be driven by Hinder\" How does that translate to Dramatica terms? IC Problem is Hinder? What do you mean by \"he is driven by\"?", "group_id": 2515, "id": 1353702}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307654405.026844, "message": "Interestingly enough -- I looked up my notes from way back when we did the initial analysis of this (the one on the main site) -- and right under the exploration of Sarah's throughline were the notes \"weak storytelling.\" So I believe Chris and Co. would agree with @mikeaja above when he spoke about how some throughlines will have less emphasis than others.", "group_id": 2515, "id": 1354006}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307654156.292336, "message": "If the IC is Steadfast, then his or her Problem will seem more like the source of his drive.", "group_id": 2515, "id": 1353967}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307654708.6267829, "message": "@Novbert    with the risk of repeating myself again..... I really think you're taking the Dramatica words too literally. They describe the area of the action, not the action itself. Avoid doesn't only mean 'trying to avoid someone' (otherwise Dramatica would be limited to only 64 possible story / real-life problems, which is clearly not the case).\n\nSo, if a part of her problem is that she wants to avoid the enemy, that doesn't immediately mean the Problem is Avoid. I think the MC Problem is Pursuit because not only is she being pursued by the terminator, but she has to survive, and most importantly, find a way through this. That can also be seen as Pursuit (directed effort, attempt to acheive).", "group_id": 2515, "id": 1354076}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307654691.474, "message": "Another interesting thing to consider is her Thematic Issue of Closure vs. Denial. She is the ONLY one that has to deal with closure -- do I end this now or not? This is in contrast to her personal issue of denial - is the end of the world tied to me or not?", "group_id": 2515, "id": 1354070}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307655011.0802419, "message": "@jimhull  interesting, yes, and also is highlighted in her refusal to let the whole thing get the better of her. She could walk away, but then the situation would be left unresolved, and she's got to deal with the huge cost of that.", "group_id": 2515, "id": 1354161}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307679563.6565681, "message": "@jimhull I really like seeing messages that tie actual events in the movie to things in the storyform.", "group_id": 2515, "id": 1357179}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307684141.5964501, "message": "@Mikeaja: Okay then but how do you translate the solution for the MC-s problem as Avoid (\"escaping from a problem rather than solving it \")?", "group_id": 2515, "id": 1357606}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307684215.4250391, "message": "What she does at the end is anything but escaping.", "group_id": 2515, "id": 1357613}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307690838.3954229, "message": "Or can we say that the fact that her problem is Pursuit means that she wants her regular life back and the solution - Avoid - means that she escapes from her regular life - as it is portrayed at the end?", "group_id": 2515, "id": 1358060}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307691236.774025, "message": "And there is one thing that has been bugging me all along and it just got even more emphasized with this choice of MC Problem: The movie is all about destiny, fate, predetermination and such. It appears on so many levels of the movie it's even hard to list all its occurences. My initial expectation was that this thing should also be apparent when looking at the Dramatica storyform. Yet checking the settings at which we currently are neither Destiny nor Fate elements are part of the storyform. What can be the reason for that?", "group_id": 2515, "id": 1358113}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307703801.909198, "message": "Re. Solution: Avoid, I think this can be seen to describe the fact she survives. Killing the terminator was not the point; it was stopping the terminator from killing her.\n\nRe. destiny and fate, I agree these could definitely be seen as the thematic issues of the story.  I see no problem in that being part of the storyform, but in no way does that mean the elements 'Destiny' and 'Fate' are where the issues are explored.", "group_id": 2515, "id": 1359603}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307709306.4960101, "message": "@Mikeaja : Well, then could you provide an example where Destiny is the issue? Or explain what does Destiny as an issue mean, and how would it be represented if that was the issue?", "group_id": 2515, "id": 1360206}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307713099.1309359, "message": "In short, Fate and Destiny are not problematic in this story. They're subject matter. Same with The Matrix. There's a bunch of discussion about Neo's destiny and matters of fate (knocking the vase over), but what is problematic is that he doesn't believe he is the One.", "group_id": 2515, "id": 1360957}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307711322.48545, "message": "Not sure if I understand the question. As thematic issues, I think you're right about destiny and fate (normal meaning, not Dramatica terms). Nothing to do with Destiny (Dramatica term).\n\nI'd say the main thing is describing how Obtaining vs Doing is used to deal with those thematic issues.", "group_id": 2515, "id": 1360545}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307714902.831228, "message": "Content isn't story points.", "group_id": 2515, "id": 1361235}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307715877.922873, "message": "Not exactly that, and only looking at MC, but in principal......", "group_id": 2515, "id": 1361319}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307715279.028476, "message": "That could be on the back of a fortune cookie. \n\n. @jimhull could it also be said that the thematic issue of destiny is explored through 'finally accepting ones destiny' (Closure) vs 'not believing in what you are told about your future' (Denial) ?", "group_id": 2515, "id": 1361267}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307723397.514771, "message": "@Mikeaja, that sounds right, cause it isn't so much about the path that is problematic but bringing closure to it", "group_id": 2515, "id": 1362678}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307725841.5399621, "message": "For a real world example of Destiny as MC Issue, look to Cobb (Leo) in \"Inception\". While I don't think the story is complete (really really week Relationship Throughline, if there at all), the MC thematics are quite well done. His personal issues revolve around the guilt he feels for his complicity in his wife's suicide. This inability to resolve this problem of the Past is the source of all his troubles and his area of most Concern. When you want to see his issue of Destiny, think of the train and what it represents within the context of this problem. He's waiting for a train that will take him far away, he knows where he hopes it takes him, but he doesn't know for sure, and it doesn't matter because all he cares about is that he'll be with his wife. This perceived Destiny is a huge issue for him, and will continue to be a problem for him until he finally gains the awareness that the image he holds of her in his mind is not the *real* her.", "group_id": 2515, "id": 1363223}, {"user_id": 10814, "stars": [{"date_created": 1307729878.4248631, "user_id": 7645}], "topic_id": 38436, "date_created": 1307729377.5467551, "message": "Something we do not point out, though maybe we should, is what \"Change\" means with regard to the relationship throughline.  When the MC changes, they adopt the position of the IC -- or rather, the Change character adopts the position of the Steadfast character.\n\nSo, for Sarah, she grows out of her inability to see herself as special (growth) and adopts Kyle's position of needing to protect her unborn, yet already conceived, son John -- the future savior of humankind.", "group_id": 2515, "id": 1363911}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307728163.396322, "message": "That sounds more external to me.", "group_id": 2515, "id": 1363690}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307728058.3767509, "message": "@jimhull Just a question about Closure. \n\nIs she really the only person who deals with it in the movie? Reese is there specifically to put an end to the threat of the Terminator -- isn't that closure? (Although, I guess it could be \"ending\" too).", "group_id": 2515, "id": 1363672}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307728277.9538951, "message": "I've been dwelling a lot on the Domains of this movie because I was feeling uncomfortable that Reese was really in a Situation and not in a Fixed Attitude.\n\nBut, I think I've sorted it out.\n\nYes, Reese has a very strong fixed attitude -- but these aren't the source of his problems. It's just his motivation. And, Dram is about pinning down problems.\n\nWhat are Reese's problems? First, he arrives naked, steals pants and is pursued by the cops -- this is a specific fallout from his Situation. Later, Sarah won't believe him (in the car) -- and not because of the mindset he brings, but because he says, \"I'm from the future.\" In the police station, his intricate delusion (as the shrink sees it) is merely him stating the truth about his situation.", "group_id": 2515, "id": 1363712}, {"user_id": 10814, "stars": [], "topic_id": 38436, "date_created": 1307730356.3070741, "message": "BTW, IF the OS Problem is Pursuit, which may or may not be accurate, then the IC is best seen as Situation with a \"problem\" (i.e. source of motivation) of Help.\n\nAlso, with the IC Concern of The Future, that gives Sarah a Concern of Subconscious (Innermost Desires).  The phrase \"innermost desires\" can be misleading because it also refers to fears.  \n\nEach Dramatica term embodies the idea of positive and negative, too much and too little.  In that way, Obtaining includes possession and loss; Innermost Desires includes desire for and fear of; etc.", "group_id": 2515, "id": 1364083}, {"user_id": 10814, "stars": [], "topic_id": 38436, "date_created": 1307729517.141643, "message": "I have not done or looked at the storyform for The Terminator, so I can see the domains switching between Sarah and Reese.  The question is, which of the REST of the story points support the argument present in the movie.", "group_id": 2515, "id": 1363933}, {"user_id": 10814, "stars": [{"date_created": 1307729874.468821, "user_id": 7645}], "topic_id": 38436, "date_created": 1307729165.651262, "message": "As IC, especially a Steadfast IC, Kyle Reese's throughline is not about his problem as much as how his Situation influences Sarah Connor's growth and ultimate Change.  \n\nHi Situation is that he is from the future.  That alone challenges Sarah's safe, middle-class world view.  She sees herself as normal, not special, and cannot process that all that Reese says will happen depends on her.\n\nThis is somewhat different from many Change MC stories in that Sarah doesn't really have a personal \"problem\" until the Terminator shows up.  But even with all the evidence, it still requires her to grow past her preconceptions of herself and her place in the world for her to be able to Change.", "group_id": 2515, "id": 1363876}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307729349.5746901, "message": "bb...b...bb...but what I said sounded so reasonable. Argh!", "group_id": 2515, "id": 1363908}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307729719.1631889, "message": "I have only recently been able to \"absorb\" that the IC really about impact, they aren't treated like a second MC, which is how I was looking at Reese.\n\nStealing pants doesn't really affect Sarah, but the other two events I pulled out do directly. I just have to remember to adjust my perspective when talking about the IC.\n\nI think the Domains, as they stand, are correct.", "group_id": 2515, "id": 1363974}, {"user_id": 10814, "stars": [], "topic_id": 38436, "date_created": 1307730593.0300701, "message": "So Sarah is concerned with her fear.  She's scared of having the weight of the survival of the human race based on her.", "group_id": 2515, "id": 1364157}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307733120.3777411, "message": "@Chris_Huntley: Some really great insights here. To be honest I'm still thinking about whether Sarah is a Do-er or Be-er and her Resolve is Start or Stop. As I see the main problem with deciding her approach is - as you've pointed out - she has no problems until the terminator arrives so we have little to no clue on what her preferred way of solving problems is. The pure fact that she is clumsy doesn't mean that her preferred way of PS is not Doing and her naivety doesn't mean that her preferred Approach is not Be-ing. I'd risk that her Approach is simply not portrayed in the story - or at least not enough so we can't be exactly sure about it.", "group_id": 2515, "id": 1364603}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307733525.1033571, "message": "About Resolve: Being the mother of John Connor is definitely a role she has to grow into - which would qualify her as a Start character. On the other hand her actions worsen her situation again and again (she makes the terminator aware of her whereabouts twice via phone) but it would make her a Stop character. Currently I'd still opt for the Start version, simply because her lack of action definitely didn't work to reach the goal and both the turning point (when she starts to talk to Reese as some captain to one of her soldiers) and the closure of the story shows her with brand new character traits", "group_id": 2515, "id": 1364677}, {"user_id": 10814, "stars": [{"date_created": 1307738282.5939569, "user_id": 7645}, {"date_created": 1307774230.4137959, "user_id": 35323}], "topic_id": 38436, "date_created": 1307735036.372247, "message": "This is exactly why the totality of the storyform is more important than any one story point.  It is easy (or at least easier) to make an argument for any particular story point selection in a storyform, but difficult to make the case for over 80 concurrent story points.\n\nAlso, it is wise to make storyforming choices about the aspects of the storyform that are clearest, or about which you have the strongest feelings.  Skip the story points that are iffy or unknown.  It is likely other choices you make may determine those choices for you.", "group_id": 2515, "id": 1365058}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307735560.716975, "message": "@Chris_Huntley  Interesting insight into the IC's role. As MikeDerk said, it's an easy mistake to make to see the IC as a secondary MC. Have done the same myself. I think that's where we initially went wrong in this thread.", "group_id": 2515, "id": 1365179}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307806345.6829801, "message": "Can I make a quick suggestion? Instead of looking at each possible Problem individually, look to the four groups of elements under Obtaining. One quad will stand out from the others as feeling more like the source of the character's difficulties.", "group_id": 2515, "id": 1370252}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307806045.2739339, "message": "I've checked the number of possible storyforms and now I think it's very easy to narrow down our possibilities to 16 forms and a bit harder to decide which one to choose. Things I'm pretty sure of:\nMC Resolve: Change - The MC is a whole different person in the end.\nMC Growth: Start - Her passivity is the main source of the problem, standing on her own feet is the solution\nMC Approach: Be-er - she adapts to very different situations fast, it's hard to make her angry or make her try changing her situation (Also comes from the fact that OS domain is Activity and MC Growth is Start)\nMC PS Style: Intuitive - she is not a real planner, she does what feels right to get closer to the needed state of affairs\nOS Driver: Action - the terminator arrives\nOS Limit: Optionlock - face the machine and destroy it or you'll run for the rest of your life\nOS Outcome: Success - The MC is prepared and John is about to be born.\nOS Judgment: Good - the MC overcame her fears and she's prepared to fulfill her destiny\nOS TL: Activity - chasing and defense of the mother of John Connor\nOS Concern: Obtaining - Reaching a state when Connor's mother is dead - or not under direct threat\nThat all comes down to 16 possible forms. Now here comes the tricky part.", "group_id": 2515, "id": 1370240}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307806748.123122, "message": "The MC domain is Mind based on the above considerations. Her critical flaw can be Delay or Preconception. I tend to opt for preconception, mainly because her preconceptions put her in lots of trouble (not believing the story of the IC, trusting the cops, trusting her mother on the phone, low self-esteem). This makes Closure to be her Unique Ability which sounds reasonable. No other character can stop what they are working on (the cops, the IC, the terminator), they all have their fixed goals wich they won't stop chasing under any circumstances. Only the MC can decide to give up her old life and resistance and be what she has to be. \nNow the MC Issue can be Dream or Denial. Dream sounds better for me. The Issue of the MC is that in the IC's eyes she's the future leader's mother - but she doesn't think she could play that role. Her issue is also that her happy future in general looks unreachable being chased by an unstoppable cyborg. \nNow we are at 4 possible forms.", "group_id": 2515, "id": 1370268}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307807062.5889871, "message": "@jimhull : Good suggestion, but I prefer seeking for binary choices as I dig down into a storyform. As i mentioned, at the resulting 16 storyform there are only two possible elements for the MC Critical Flaw. I think it's much easier to choose between two than between four - or even sixteen.", "group_id": 2515, "id": 1370279}, {"user_id": 35323, "stars": [], "topic_id": 38436, "date_created": 1307808393.5290439, "message": "Back to my analysis: MC Issue (Dream) leads to four possible problems: Faith, Disbelief, Oppose and Support. Faith sounds like the Solution of the MC for me (at the end of her journey she's looking forward to whatever is about to come. She has faith in herself that she'll be able to fulfill her mission). This makes her Problem Disbelief, which seems to fit - she doesn't believe the IC-s story at first and once she accepted it, she doesn't believe in herself.\nAt this point the storyform is done. \nAny comments?", "group_id": 2515, "id": 1370342}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307895609.0670929, "message": "While it is simply painted, the implication is that Sarah's \"gee shucks, that's the way it goes\" kind of attitude is what is keeping her from finding true love and ultimately, happiness. This lack of Closure keys us in on the problem from a personal perspective and grows nicely into her difficulty with bringing an end to the fear she experiences at the outstretched metal hand of the Terminator. The dissonance felt between her need to be pursued and the metal monster who comes to answer her dreams provides an excellent explanation as to why the story has endured for so long and why it compels subsequent viewings.", "group_id": 2515, "id": 1374683}, {"user_id": 7645, "stars": [], "topic_id": 38436, "date_created": 1307895587.1016669, "message": "Watched \"The Terminator\" again this weekend. Sarah's personal throughline is in there, even before Reese gets to her. It's extremely simple and certainly cliched (this is the guy who wrote Avatar after all) but it nevertheless is there. Evidence of her problem of Pursuit comes with her date's call of cancellation on a Friday night. That crush of disappointment exists because Sarah is the stereotypical female who wants to be Pursued -- waiting for someone to lift her off her feet and take her away from the doldrums of a life spent waitressing. ", "group_id": 2515, "id": 1374681}, {"user_id": 30951, "stars": [], "topic_id": 38436, "date_created": 1307908422.2826941, "message": "@jimhull interesting insight. Through this process I'm starting to see how much more of a character based movie this really is. If she was some tough ex-cop type girl, this would be some whole other story.\n\nNever occurred to me before about the conflict with her waiting for a guy to sweep her off her feet to getting pursued by a guy she definitely doesn't want. \n\n. @Novbert Actually, I think the narrowing down based on static appreciations is probably not the way some here (from my experience) would want to do this. Personally, I think it's important to identify the 4 throughlines (as in a description for each), OS concern, and look at the rest of the 12 questions independently of each other before taking anything as definite, or narrowing down.\n\nRe. MC Growth and this bit \"Her passivity is the main source of the problem, standing on her own feet is the solution\", I can't say I saw that in the film. Not saying the choice is wrong though.\n\nStill I think where we got to at the point of identifying the OS Concern and Problem was pretty much there (and matched the existing storyform for further confirmation). I don't think we'll ever match all points (or necessarily agree on them)", "group_id": 2515, "id": 1375438}, {"user_id": 7664, "stars": [], "topic_id": 38436, "date_created": 1307917872.885216, "message": "@jimhull Yes, really good insight.", "group_id": 2515, "id": 1376239}]