[{"user_id": 22379, "stars": [], "topic_id": 15755, "date_created": 1301304936.9900391, "message": "Moi c'était il y a... euh... en fait, je suis allé voir Shrek 4. Et avant... ça faisait un an et demi que je n'étais pas allé au ciné. Ce qui m'interroge : est-ce bien raisonnable de faire partie de ce groupe convore ?", "group_id": 7811, "id": 456633}, {"user_id": 25488, "stars": [], "topic_id": 15755, "date_created": 1301305629.7740381, "message": "Mon dernier film : The Fighter. La carte UGC illimitée est bien pratique. Bon il y a des mois où je ne l'utilise pas assez mais à partir de deux films par mois, c'est rentable.", "group_id": 7811, "id": 456751}, {"user_id": 25488, "stars": [], "topic_id": 15755, "date_created": 1301305732.4293511, "message": "@brunobord Et puis si tu regardes des flims à la maison, ce groupe est pour toi. (même s'il est vrai que je l'ai juste créé pour tester convore)", "group_id": 7811, "id": 456761}, {"user_id": 14375, "stars": [], "topic_id": 15755, "date_created": 1301394956.5988741, "message": "La dernière fois c’était pour voir «Les Rêves dansants, sur les pas de Pina Bausch». C’était genre en novembre 2010? L’époque où j’allais beaucoup au cinéma c’était à la fac: ciné avec des copains d’un côté, et séances tranquille dans mon cinéma de quartier de l’autre.", "group_id": 7811, "id": 468514}, {"user_id": 14375, "stars": [], "topic_id": 15755, "date_created": 1301394997.6052611, "message": "(En passant, rien à voir mais j’attaque la saison 5 de The Wire.)", "group_id": 7811, "id": 468521}, {"user_id": 10318, "stars": [], "topic_id": 15755, "date_created": 1301398710.1927471, "message": "J'ai été voir l'Agence samedi, du bon complot américain avec un peu de religion et tout :)", "group_id": 7811, "id": 468813}, {"user_id": 25488, "stars": [], "topic_id": 15755, "date_created": 1301402149.4129529, "message": "Ah bah ça m'étonne du coup que vous n'alliez pas plus souvent au ciné. Même avec une bonne installation à la maison, je peux pas m'en passer. Le fait de se déplacer, d'avoir des gens autour de moi, entendre rire ou les souffles en cas de tension, ça fait un peu partie du film.", "group_id": 7811, "id": 469072}, {"user_id": 22379, "stars": [], "topic_id": 15755, "date_created": 1301402873.1150689, "message": "@rik24d gamine en bas-âge => baby-sitter + un peu moins de temps libre, en fait. mais c'est vrai qu'on pourrait faire un petit effort, j'en conviens.", "group_id": 7811, "id": 469136}, {"user_id": 14375, "stars": [], "topic_id": 15755, "date_created": 1301479619.3089559, "message": "Je pourrais prétexter mes cours du soir qui m’accaparent, mais même avant je n’allais presque plus au cinéma. C’est arrivé quand j’ai déménagé un peu loin de mon cinéma de quartier, et qu’en même temps j’ai perdu contact avec les quelques amis de la fac avec qui j’allais souvent au cinéma. Et aujourd’hui, dans ma tranche d’âge et parmi les gens que je côtoie, personne ne va au cinéma entre copains ou presque; c’est devenu une sortie de famille ou de couple. </coupdevieux>", "group_id": 7811, "id": 480590}, {"user_id": 10318, "stars": [], "topic_id": 15755, "date_created": 1301861852.6483259, "message": "@rik24d mouais et les gros relous aussi malheureusement, ou alors de plus en plus le gars 2 rangs devant qui allume son téléphone en plein film, etc...", "group_id": 7811, "id": 516864}]