[{"user_id": 28329, "stars": [], "topic_id": 18225, "date_created": 1302347815.0268509, "message": "is this going to be the first hackathon in Nigeria?", "group_id": 8650, "id": 601741}, {"user_id": 5057, "stars": [], "topic_id": 18225, "date_created": 1302441744.368777, "message": "Yes, I think. Google DevFest was a similar event but I wouldn't really call it a hackathon.", "group_id": 8650, "id": 609421}, {"user_id": 719, "stars": [], "topic_id": 18225, "date_created": 1302486600.830713, "message": "I've been to a couple (including one just this weekend). It's quite addictive. One potential tip's to work in a team if that's allowed. It's a chance to meet new people and have a whale of a time.\n\nThere's no pressure apart from self imposed goals. So, it's also a chance to try out new techniques and tools without having anyone to answer to apart from yourself. If there's something you've had on the backburner for a while, here's a chance to prototype it and get some feedback.\n\nLast thing would be to scale one's goals to what can be achieved in a short period of time.\n\n*That full-text search engine you've been meaning to write from scratch... might not be done in 24hrs.* :P\n\nI tend to aim to have a solid complete project (with potential for future expansion) at the end for the show 'n tell sessions. So far, that's worked out pretty well.", "group_id": 8650, "id": 616738}, {"user_id": 719, "stars": [], "topic_id": 18225, "date_created": 1302486691.699851, "message": "Arrck... copy+paste borked the text. Time to click \"wrap text\" I guess.  :)", "group_id": 8650, "id": 616764}, {"user_id": 719, "stars": [], "topic_id": 18225, "date_created": 1302486510.695539, "message": "Crikey, that's a long message... Anyways, it might be useful to someone. Just remember to have fun. :)", "group_id": 8650, "id": 616713}, {"user_id": 28329, "stars": [], "topic_id": 18225, "date_created": 1302516239.504519, "message": "thanks @micrypt very helpful insight", "group_id": 8650, "id": 622730}]