[{"user_id": 13249, "stars": [], "topic_id": 8370, "date_created": 1298481668.377775, "message": "Currently in two jQuery groups called \"jQuery\". I feel it would create a better community if we could keep it to one group.", "group_id": 88, "id": 188876}, {"user_id": 13249, "stars": [{"date_created": 1298481828.070683, "user_id": 2}], "topic_id": 8370, "date_created": 1298481816.3036339, "message": "Maybe when creating a new group you could suggest groups with the same name that already exist. Or have multiple categories for each group. I haven't tried to create a group so I don't know if you do this already or not. The two jQuery groups I'm in are in different categories though. One in Programming and one in Web Development. Pardon my lack of research into this topic, just throwing it out there as I thought of it. I might be doing it wrong :o", "group_id": 88, "id": 188905}, {"user_id": 2, "stars": [], "topic_id": 8370, "date_created": 1298481846.126169, "message": "@patrickleet I think that's a good suggestion and something we'll work on soon", "group_id": 88, "id": 188911}, {"user_id": 13249, "stars": [], "topic_id": 8370, "date_created": 1298482420.9413271, "message": "@leah I don't know if you've ever used mint.com, but their.. err, ux (for lack of a better term), does something similar when adding new categories that would probably work well. It's basically an autocomplete so as you are typing in a new category, you can see if it's already been added and then select that category instead of adding it again.", "group_id": 88, "id": 188980}, {"user_id": 2, "stars": [], "topic_id": 8370, "date_created": 1298486279.1420939, "message": "@patrickleet thanks for the tip. I'll check out how mint does it for sure.", "group_id": 88, "id": 189660}, {"user_id": 4859, "stars": [], "topic_id": 8370, "date_created": 1298509328.764483, "message": "Yeah, I can think of a lot of utility for this, eg a tech group could inline watch and discuss a user group. Heck it could be useful for topics too... or imagine making public a private group that had a shadow discussion around a public topic...", "group_id": 88, "id": 194532}, {"user_id": 4859, "stars": [], "topic_id": 8370, "date_created": 1298509095.808099, "message": "what about a group read-only merge in of existing groups feature? :) ...and an admin feature to block new posts on old groups when everyone switches to the new group...", "group_id": 88, "id": 194476}, {"user_id": 67, "stars": [], "topic_id": 8370, "date_created": 1298527861.4636099, "message": "However...sometimes a topic like jquery is appropriate for more than one group.  It could be confusing if were all compiled into one group.", "group_id": 88, "id": 195723}, {"user_id": 13249, "stars": [], "topic_id": 8370, "date_created": 1298567842.125494, "message": "Right, but I think more often it's not. I think if it is the same then the ability to merge would be nice. And something to say \"hey this exists already, do you want to join this group instead of making a new one\" which the user can then say gtfo I want my own or join the existing one.", "group_id": 88, "id": 199227}]