[{"user_id": 11626, "stars": [], "topic_id": 6307, "date_created": 1297844788.1763811, "message": "While there’s been renewed interest in focusing the U.S. military on countering  high-end 21st Century threats such as the advanced area denial weapons being developed by China, don’t expect all of the relatively low-tech yet incredibly useful weapons of the last few wars to go away as soon as fighting dies down in Afghanistan.\r\n\r\nNorthrop Grumman just last month delivered first of the newest batch of what’s proven to be a very useful yet low-key weapon system over the last 20 years or so; the Army’s prop-driven RC-12 Guardrail signals intelligence planes.\r\n\r\nThe RC-12 and its MC-12 Liberty brethren flown by the Air Force (which focus more in imagery intelligence) have proven invaluable in doing everything from helping find drug lords in Latin America or insurgents in the Middle East to catching terrorists in the U.S.\r\n\r\nThe latest incarnation of the plane, the RC-12X, features a new glass cockpit along with “significant” structural improvements and new sensor arrays which may including the Advanced Signals Intelligence Payload (developed for the Air Force’s U-2 and RQ-4 Global Hawk strategic reconnaissance jets).\r\n\r\nThe first two RC-12Xs left a Northrop facility in Sacramento, Calif., on Jan. 8 to deploy to the Middle East and another two planes will deploy in the coming month, according to the defense giant. Ten more RC-12Xs will be delivered between 2011 and 2012 and are set to stay in service through 2025.\r\n\r\nApparently, the first four planes will be tested and fully outfitted in theater, a move that could reflects the urgency that military officials associate with getting these prop-driven airplanes into combat. Many have described the Air Force MC-12s as invaluable; a sort of manned UAV that can fly above a patrol, warning the troops, some of whom they’ve built a rapport with at their bases, in real time of approaching threats. The MC-12s Liberties were famously pushed into combat with incredible speed compared to most modern weapons programs.\r\n\r\nThe Army planes are used to sniff out and triangulate enemy communications and the like.\r\n\r\nFrom a Northrop announcement:\r\n\r\n    The RC-12X Guardrail Modernization program extends the life of the aircraft through 2025 and introduces new payloads to the system with enhanced capabilities to sense and exploit emerging and rapidly evolving irregular and conventional warfare threats. The program also enhances the sustainability of the RC-12X through commonality, a new glass cockpit, structural upgrades, and significant hardware and software improvements.\r\n\r\n    “The RC-12X will bring unprecedented SIGINT capability to the warfighter,” said Trip Carter, director for Northrop Grumman’s Airborne Intelligence, Surveillance, and Reconnaissance (AISR) initiatives. “We are excited with this latest step toward making this a reality for their missions and are eager to continue to work with the Army to make the system operational as soon as possible.”\r\n\r\nIt adds that:\r\n\r\n    The RC-12X Guardrail is the Army’s premier airborne SIGINT sensor and ground processing system, providing instantaneous precision geo-location and identification of threats to enable the Brigade Combat Team’s Find, Fix, Finish, Exploit, Analyze and Disseminate (F3EAD) battle command process.\r\n\r\nSometimes its the cheap, easy-to-field technology that can make a huge difference in a fight.\r\n\r\nhttp://defensetech.org/2011/02/08/first-rc-12x-sigint-spy-planes-making-their-way-downrange", "group_id": 3920, "id": 118254}, {"user_id": 11626, "stars": [], "topic_id": 6307, "date_created": 1297844945.3317161, "message": "More vintage planes to be on the lookout for...", "group_id": 3920, "id": 118257}]