[{"user_id": 33318, "stars": [], "topic_id": 38201, "date_created": 1307299107.746171, "message": "Here is the rumoured specs that's been leaked:\n\nThe System:\n\n    Uses a custom IBM triple-core CPU running at 3.6GHz per core\n    The development kit contains 1gb RAM, but Nintendo have hinted that the console will actually have 1.5gb\n    Nintendo will be releasing games that will run 1080p natively. Sources say that with Nintendo’s art style and the power the system has, the games look ‘stunning’.\n    The system does run on AMD R700 card, but the architecture is slightly different and the clock speeds are much higher.\n    The System resembles JPN/EU SNES machines in color only and not in shape\n    The development kit is about the size of a 360, not the console\n    Close sources say it’s as if Nintendo is in “damage control” with 3rd party developers. Nintendo is trying really hard to get 3rd parties on board to develop games and have offered incentives such as not releasing big-title Nintendo games in holiday seasons to compete against 3rd party titles.\n    Nintendo went to many 3rd party developers on guidance on what they were after with the new console in terms of system specs, controller and online system.\n\nThe Controller:\n\n    Nintendo have been keeping this really quiet and have only given developers controller prototypes to start designing games. However, the final controller build with all the features have only been given to Nintendo 1st and 2nd party developers for now.\n    Nintendo had planned on inserting a screen on the controller back when the Gamecube was in development, but opted out due to technology not being advanced enough to be functional\n    The controller that’s been given to developers has a large 5.7inch hd (960x640pixel) screen, 2 analogue sticks, 4 face buttons, 3 middle buttons (select/home/start in that order), 2 shoulder buttons and 2 triggers.\n    The triggers aren’t as deep as the 360’s triggers, but have plenty of push\n    The big thing about the screen is that it’s a multi-touch screen, contains it’s own battery and is detachable from the controller unit\n    The screen when detached contains its own memory so developers can store data on it, so gamers can play whatever the developer designs for the screen-only use\n    When the screen is attached to the controller it works by streaming content directly from the console\n    Nintendo are giving developers ideas other than just having it function as a quick menu screen for games while attached, or as a simple tamagochi-like mini-game when detached\n    The controller contains a gyroscope, but motion controls isn’t the focus of the controller like it was for the Wii\n\nGames:\n\n    Nintendo will release a Mario platformer as a launch title which hasn’t been done since the N64.\n    The Mario platformer looks to be the spiritual successor to Mario 64.\n    Gamefreak and EAD are hard at work developing a Pokemon online RPG.\n    The Pokemon RPG is not an MMO, but does have a large online emphasis and will be Nintendo’s flagship title when showing off the online capabilities of the console.\n    There will be at least one new IP Nintendo will reveal at E3.\n    Nintendo is working on a new Zelda, but didn’t reveal anything to developers.\n\nOther:\n\n    Some developers have had the Wii 2 dev kit for going on 2 years now. When the Wii 2 is released in late, that’s 3 years to develop games on.\n    Because of such generous development time, Nintendo have pushed 3rd parties to develop high quality games to be released at or near launch.\n    Nintendo have sourced an external company to develop their online network, which the developer has commented, surpasses both the PS3 and 360 in terms of speed and functionality.\n    Nintendo is pushing for the console to be online 24/7 and have seamless online integration with many of their games\n    Friend codes are confirmed to be gone\n    Nintendo has been toying with the idea of a game where the main character is your Mii\n    Nintendo will be pushing their Pokemon RPG to showcase their online network\n    Rockstar are supposedly hard at work in bringing on of their “most popular” titles to the console.\n\n\nI'm just going to go right ahead and call it the Dreamcast 2 :)", "group_id": 9493, "id": 1294636}, {"user_id": 31852, "stars": [], "topic_id": 38201, "date_created": 1307342977.4816511, "message": "New rumors suggest the system is to be called simply \"Nintendo\". Almost certainly rubbish, but then again it's so crazy it just might be true.", "group_id": 9493, "id": 1300958}, {"user_id": 25703, "stars": [], "topic_id": 38201, "date_created": 1307346264.6837189, "message": "The Nintendo Nintendo", "group_id": 9493, "id": 1301155}, {"user_id": 31852, "stars": [], "topic_id": 38201, "date_created": 1307347011.6691611, "message": "It worked for Scot Scott.", "group_id": 9493, "id": 1301212}, {"user_id": 32282, "stars": [], "topic_id": 38201, "date_created": 1307352077.8741429, "message": "Maybe I'm being cynical, but that sounds more like a wishlist than a leak. I do hope the specs and the online stuff turn out to be accurate, though.", "group_id": 9493, "id": 1301561}, {"user_id": 31927, "stars": [], "topic_id": 38201, "date_created": 1307359048.197176, "message": "Yep.  What he said.\n\nI don't concern myself too much with pre-event rumours.  We'll know what we'll know, and soon enough too.", "group_id": 9493, "id": 1302034}, {"user_id": 32057, "stars": [], "topic_id": 38201, "date_created": 1307365809.1938591, "message": "I hear it will be called beem? http://www.lazygamer.net/fixed/rumour/nintendos-new-consolelatest-rumours-and-its-real-name/", "group_id": 9493, "id": 1302788}]