[{"user_id": 1809, "stars": [], "topic_id": 2374, "date_created": 1297283864.4009809, "message": "Specific example for general question: We're looking at buying a new iMac. Would we be better off paying cash for a used one now ($900) or pay $1600 but put it on interest-free-for-a-year credit card?", "group_id": 250, "id": 55244}, {"user_id": 218, "stars": [], "topic_id": 2374, "date_created": 1297285102.653779, "message": "credit card == business card?", "group_id": 250, "id": 56023}, {"user_id": 218, "stars": [{"date_created": 1297285278.797224, "user_id": 805}, {"date_created": 1297355075.4302149, "user_id": 5853}], "topic_id": 2374, "date_created": 1297285166.310086, "message": "seems like if its a business card, and you're in an LLC.. interest free 1year thing sounds better, because you're likely to either easily have the money, or have folded.. in which case, neither become a problem.", "group_id": 250, "id": 56063}, {"user_id": 218, "stars": [], "topic_id": 2374, "date_created": 1297285188.3758979, "message": "disclaimer: I've never really done that before and I may be missing something, but that's what \"common sense\" tells me?", "group_id": 250, "id": 56080}, {"user_id": 1870, "stars": [], "topic_id": 2374, "date_created": 1297286108.1764431, "message": "Cash is king. The more cash you can conserve — in all stages of your business, but especially early on — the better off you are.", "group_id": 250, "id": 56640}, {"user_id": 1148, "stars": [], "topic_id": 2374, "date_created": 1297287176.9712379, "message": "In the interest of cash flow, can you get by with paying 900 for a used one on the business card?", "group_id": 250, "id": 57179}, {"user_id": 3662, "stars": [], "topic_id": 2374, "date_created": 1297297940.8497219, "message": "If you can't get by without it, keep the cash", "group_id": 250, "id": 61475}, {"user_id": 4875, "stars": [], "topic_id": 2374, "date_created": 1297411646.1374459, "message": "in my opinion, if we want to start a business, we better cooperate with people who are more experienced in that field. and for working capital the first time, we can use their money. so we do not need to use our own money. and we can get guidance from people who are more experienced", "group_id": 250, "id": 79090}, {"user_id": 6916, "stars": [], "topic_id": 2374, "date_created": 1297424854.621907, "message": "Can you get much finance as a new startup? I am in the UK and my new Limited Company managed to get £1000 credit line from Barclaycard but as for a bank loan, forget it!", "group_id": 250, "id": 79647}, {"user_id": 7636, "stars": [], "topic_id": 2374, "date_created": 1297546469.396415, "message": "For your question of buying that iMac, I'd go for the new one on credit and use your funds to market your website, service or product. How about crowdfunding? If you come up with a good crowdfunding plan or use a crowdfunding platform, shouldn't be that difficult to come up with the $700 difference between the used iMac and the new one. Finding 70 people to chip in $10 and you give them something in return. Doable right?", "group_id": 250, "id": 87598}, {"user_id": 8600, "stars": [{"date_created": 1297709175.9251649, "user_id": 10694}], "topic_id": 2374, "date_created": 1297610997.9422309, "message": "If you're personally liable for the business debt, pay it up front.\nIf you haven't found a business model, pay it up front.\nIf you have a business model that grows organically and via word of mouth, pay it up front.\nIf you have a working business model AND it scales via paid user acquisition AND you can't get a better loan elsewhere, take the financing.\n\nImproving your cashflow is very powerful, but only if you can do something valuable with the extra money. Speaking generally, avoid all debt before you can reasonably predict your future earnings (which most startups can't). Plus, too much of it makes you a less exciting investment target. Investors want their money to go toward the future, not to pay off the past.", "group_id": 250, "id": 91451}, {"user_id": 9996, "stars": [], "topic_id": 2374, "date_created": 1297696643.1887259, "message": "Hi robfitz, thanks for explanations. Made the decision much more transparent. Where did you get your knowledge from?", "group_id": 250, "id": 100562}]