[{"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301501518.0290861, "message": "I'm not a child :P But I want it! :)\nI want to get in touch with great startuppers and great mentors, to be able to learn more and to get help to create a great product.\nI really hope to get in touch with some ex-YC-companies or YC-mentors to talk with them and demonstrate the energy that is moving us! ;)", "group_id": 95, "id": 482694}, {"user_id": 2, "stars": [{"date_created": 1301517243.9382169, "user_id": 4375}, {"date_created": 1301517369.900053, "user_id": 24097}, {"date_created": 1301791368.722697, "user_id": 12963}], "topic_id": 16266, "date_created": 1301502669.1472981, "message": "the absolute best thing you can do is have a prototype though (even if it's bad)", "group_id": 95, "id": 482837}, {"user_id": 12927, "stars": [], "topic_id": 16266, "date_created": 1301502231.5076921, "message": "I can't think of a better way to demonstrate your passion for building a great product than to begin building a great product.", "group_id": 95, "id": 482771}, {"user_id": 2, "stars": [{"date_created": 1301502562.801723, "user_id": 25720}, {"date_created": 1301503413.6728909, "user_id": 14049}, {"date_created": 1301507534.1902471, "user_id": 776}, {"date_created": 1301517373.571413, "user_id": 24097}, {"date_created": 1301554592.377835, "user_id": 37}, {"date_created": 1301637995.8125041, "user_id": 22804}, {"date_created": 1301864084.2110169, "user_id": 15332}], "topic_id": 16266, "date_created": 1301502517.4059379, "message": "here's the best stuff you can do:\n- find co-founder(s)\n- build a prototype\n- move to the Bay Area or visit\n- meet up in person with YC alumni (send them a short email explaining that you're interested in YC)\n- do the best you can to further your product prior to applying to YC", "group_id": 95, "id": 482821}, {"user_id": 2, "stars": [{"date_created": 1301517247.7451401, "user_id": 4375}, {"date_created": 1301794346.228354, "user_id": 20120}], "topic_id": 16266, "date_created": 1301502697.95543, "message": "reminds me how bad the convore prototype used to be... :(", "group_id": 95, "id": 482840}, {"user_id": 26035, "stars": [], "topic_id": 16266, "date_created": 1301508494.201298, "message": "@leah , what resources have you found for finding co-founders?", "group_id": 95, "id": 483578}, {"user_id": 20025, "stars": [], "topic_id": 16266, "date_created": 1301508198.9331009, "message": "I would suggest making sure you are as prepared as possible. Ensure that you ask questions that will really help you in your future endeavours (more difficult than it sounds). I would also suggest not over-complicating you're idea; make sure you execute you're idea very well. That is always better than a sloppy idea that is perhaps more technologically advanced.", "group_id": 95, "id": 483547}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301508040.4472041, "message": "We have The private beta out http://challlengein.com . We're a complete team Of two persons, who have done a startup yet (failed), we're working together by 3 years and more. We've built that product by ourself. We're building the great product yet. We can't move in the bay if we don't get into the program, because w don't have money and we come from Italy. So I would love to pitch mentors or alumni via skype ;)", "group_id": 95, "id": 483530}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301508197.3291631, "message": "Ps if you want to try it use HINIIB as invitation code. And give us feedback. Tnx!", "group_id": 95, "id": 483546}, {"user_id": 26035, "stars": [], "topic_id": 16266, "date_created": 1301508477.9220619, "message": "That link doesn't work.", "group_id": 95, "id": 483575}, {"user_id": 4212, "stars": [], "topic_id": 16266, "date_created": 1301508633.5211971, "message": "@FredSexton I'm launching a beta for a co-founder finding service this next week. I'll post about it once it goes live. We're going to be merging with two SF based startups that also help bring early adopters and the tech community together.", "group_id": 95, "id": 483593}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301512361.9303291, "message": "Sorry the link is http://challengein.com Invitation code HINIIB", "group_id": 95, "id": 484167}, {"user_id": 22043, "stars": [{"date_created": 1301516920.8686409, "user_id": 20025}, {"date_created": 1301636393.8597889, "user_id": 1881}], "topic_id": 16266, "date_created": 1301513603.1383629, "message": "I think it's also important to point out here that getting investment and YC are businesses. You need to be able to present your idea in a way that makes sense as a business and is more than just \"cool technology\". I think your product has a real potential to provide that business proposition, but I'd take some time to think about what exactly that plan is and be able to clearly articulate how you're going to make money. That will not only provide your potential investors with some quantifiable metrics to bank on, but also it will show them that you're thinking pragmatically about your approach toward building your product.", "group_id": 95, "id": 484362}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301512651.026756, "message": "@tweakskys Tnx for the help. We're applying the principles of lean startup yet. We're delivering our core value proposition early as possible, getting feedback by real users and improving. We're iterating yet. \nWe're ready to do interviews, we've done few for our past startup and one for this with another US incubator. We give the 110% when we can explain by voice what we want to do.\n\nI was hoping to be able to pitch some alumni to get the ability to be able to pitch a YC referral/mentor. I think we can demonstrate our passion. ;)", "group_id": 95, "id": 484191}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301520729.962317, "message": "We have a complete business idea. With a full pitch. We have bm, target, communication plan and everything. We have reviewed all with some market experts, few Vc and angels. They like the plan. We now have to demonstrate traction. I have everything ready to show and to pitch.", "group_id": 95, "id": 485247}, {"user_id": 8244, "stars": [], "topic_id": 16266, "date_created": 1301525346.2786679, "message": "an idea is pretty meaningless", "group_id": 95, "id": 485612}, {"user_id": 8244, "stars": [], "topic_id": 16266, "date_created": 1301525337.991466, "message": "do you have a prototyp?", "group_id": 95, "id": 485609}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301526641.0511291, "message": "Sure we have public product. Go to http://challengein.com and download it", "group_id": 95, "id": 485724}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301579312.3950951, "message": "Can you give me names or links? Tnx", "group_id": 95, "id": 491874}, {"user_id": 15929, "stars": [], "topic_id": 16266, "date_created": 1301590964.4349589, "message": "is it just me, or the screenshots look more like a trivia game rather than a board game...", "group_id": 95, "id": 493659}, {"user_id": 15929, "stars": [], "topic_id": 16266, "date_created": 1301591854.2536261, "message": "ok, downloaded, tried, deleted. can't even force ourself to finish 1 game session... just a bunch of Q&A,.. honestly I don't see any reason for the 'location' part to be there at all.", "group_id": 95, "id": 493874}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301595320.9343159, "message": "Probably if you don't finish a match you'll not catch the core service. Neither you'll understand that there are different board games in it. And probably you'll never understand why it is location based. You can not like that product, but before judge and talk start to inform about the product. Else it's easy to make a bad impression and seems arrogant...", "group_id": 95, "id": 494390}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301595586.510931, "message": "Plus you will choose the theme of the questions: tech, videogames, general and in future about football, star wars, etc", "group_id": 95, "id": 494441}, {"user_id": 22729, "stars": [], "topic_id": 16266, "date_created": 1301530315.3262241, "message": "'Challengein is \"The first board game of the location-based era\".' Seems like a bold claim given I've seen other sorts of \"board location-based games\" quite a while ago.", "group_id": 95, "id": 486030}, {"user_id": 15929, "stars": [], "topic_id": 16266, "date_created": 1301591018.0050631, "message": "and by 'location-based' do you mean, it'll find players near by to answer a trivia about the city i live in?", "group_id": 95, "id": 493664}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301595501.349179, "message": "So the product is formed by different board/parlor games, jokes, stupid challenges. You will fight against your friends (not work alone) and against other companies of friends. You will earn badges, coupons in future. If you are the most winning ever crew in the venue where you have played, you will conquer it and become the King!", "group_id": 95, "id": 494425}, {"user_id": 15929, "stars": [], "topic_id": 16266, "date_created": 1301626786.2135429, "message": "@ccarnino as for the game, okay fair enough, this may just be not my cup of tea - i mean adding a q&a to snake and ladder, why no one has ever thought of it? however, i have 1 issue for the product, as a multiplayer game, i can't find where the point it's looking for an opponent (my housemate phone last night). so it's a single device multiplayer game??", "group_id": 95, "id": 498848}, {"user_id": 15929, "stars": [], "topic_id": 16266, "date_created": 1301627081.448657, "message": "here's a couple of my input (if you care to have it);\n1. it's obvious that you have business model for the game right out of the gate, but don't forget that a game is a game... you have to start there, build an amazing game first.\n2. the UI, it looks great,.. the problem is everything looks like a button. everything has the same level of the shiny-ness of a button...\n\njust my thought, and good luck :)", "group_id": 95, "id": 498879}, {"user_id": 14000, "stars": [], "topic_id": 16266, "date_created": 1301627101.2227111, "message": "sweet, we've almost ticked off everyone of @leah's tips for interstate!", "group_id": 95, "id": 498881}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301652388.2527399, "message": "@unwrangle Yes it's single device to play in party. In reality Challengein will bring together few winning concepts: board games, location based services and games. So we're sure enough that this will work too and the early tests with groups of users confirm it", "group_id": 95, "id": 500397}, {"user_id": 5136, "stars": [], "topic_id": 16266, "date_created": 1301652580.209224, "message": "@unwrangle \n1: yes you are right. Our #1 goals is to create a product (game in this case= that is Great. Then add to it cool stuff around, but after.\n2: this means that the users doesn't understand what is the real button? UX problem?\n\nTnx for your advices and opinion, this will help us to improve and reach our #1 goal ;)", "group_id": 95, "id": 500406}]