[{"user_id": 11626, "stars": [], "topic_id": 6630, "date_created": 1297898810.1196871, "message": "Under the banner of fighting child pornography, the Department of Homeland Security and the Department of Justice knocked out 84,000 websites last week. The websites did not host or link to child pornography as the government claims.\r\n\r\n“As part of ‘Operation Save Our Children‘ ICE’s Cyber Crimes Center has again seized several domain names, but not without making a huge error. Last Friday, thousands of site owners were surprised by a rather worrying banner that was placed on their domain,” reports TorrentFreak, a tech site.\r\n\r\nSenator Joe Lieberman peddles his kill switch legislation under the rubric of the phony war on terror.\r\n\r\n“Advertisement, distribution, transportation, receipt, and possession of child pornography constitute federal crimes that carry penalties for first time offenders of up to 30 years in federal prison, a $250,000 fine, forfeiture and restitution,” was the message visitors to the sites were greeted with after a judge signed a seizure warrant and Big Sis contacted the domain registries and instructed them to point the domains in question to a server that hosts the above warning message.\r\n\r\n“However, somewhere in this process a mistake was made and as a result the domain of a large DNS service provider was seized,” writes Ernesto for TorrentFreak.\r\n\r\nIt is certainly possible although not probable the takedown was an error. It is more likely the sites were taken offline in calculated fashion in order to send a message – government has the ability to deny a large number of websites access to the internet.\r\n\r\nIn response to widespread protests and mass unrest, the authoritarian Egyptian government shut down the internet in late January. In addition, the Mubarak regime gave the order to shut off mobile phone service. “All mobile operators in Egypt have been instructed to suspend services in selected areas. Under Egyptian legislation, the authorities have the right to issue such an order and we are obliged to comply,” explained Vodaphone.\r\n\r\nThe government wants to implement a likewise system in the United States. Senator Joe Lieberman introduced a bill that would allow the Obama administration to pull the plug on the internet. The bill would amend the Homeland Security Act of 2002 enacted during the manufactured hysteria following the events of September 11, 2001. According to the language of the bill, it would “enhance the security and resiliency of the cyber and communications infrastructure of the United States” by allowing the president to use a figurative “kill switch” and seize control of the web in response to a Homeland Security directive.\r\n\r\n“Right now China, the government, can disconnect parts of its internet in case of war and we need to have that here too,” Lieberman told CNN last year.\r\n\r\nMyanmar shut down the internet in 2007 and Iran and China did the same in 2009. Governments crave the absolute power of denying millions of people access to the internet and other forms of telecommunication.\r\n\r\nThe Protecting Cyberspace as a National Asset legislation is expected to be reintroduced into Congress this session. Late last month, Brandon Milhorn, Republican staff director and counsel for the Senate Homeland Security and Governmental Affairs Committee, said that the Senate was revisiting the bill. Detractors call it the “internet kill switch” bill while supporters argue it is essential for our national security.\r\n\r\nIf passed, the law would give Obama and future presidents the ability to designate the internet – and other network computer systems – as vital to national security. If the government decided to shut down the internet or certain parts during a declared emergency – more than likely a contrived false flag event – it will not be “subject to judicial review,” in other words the Fourth Amendment will not apply. The power to declare such an emergency would not come from Congress.\r\n\r\nAn early version of the bill introduced by Democrat Jay Rockefeller and Republican Olympia Snow authorized the White House to “declare a cybersecurity emergency” and explicitly gave the executive branch the power to “order the disconnection” of networks and websites. House Democrats have taken a similar approach in their own proposals, according to Declan McCullagh writing for CNet News.\r\n\r\nWebster Tarpley on Obama’s internet kill siwtch.\r\n\r\nBlocking the access of 84,000 websites from the internet is not a mistake. It was a beta test by the government to test the technical aspects of the action and gauge response. The government is not in the business of seriously combating child pornography. Like the Mubarak regime in Egypt, the government in the United States is interested in having a mechanism in place to shut down the public internet or take out targeted websites and domains.\r\n\r\nMore and more people are flocking to the internet for news and information. Millions are ignoring the corporate media and the government propaganda it spews. Before the economy crashes completely and people take to the street like they are now doing in the Middle East, the government wants to have its internet kill switch firmly in place.\r\n\r\nIt may get the chance during this session of Congress.\r\n\r\nhttp://www.infowars.com/kill-switch-beta-government-blocks-84000-websites", "group_id": 3920, "id": 126347}]