[{"user_id": 11626, "stars": [], "topic_id": 42558, "date_created": 1311462546.70189, "message": "Food, Control & the Growing Police State\r\nDeadline Live\r\nJuly 23, 2011\r\n\r\nFood has always been a tool the elite have used to control the masses. When you control the food supply, you control everything, even life and death. A starving man is more likely to sell his soul for a potato then someone with a full tummy. The relatively free market of food production and distribution that has been in place in this nation for a few centuries now has led to unrivaled prosperity. Food can, in fact, be grown for practically nothing if you have the land, the time and can afford to buy just a few heirloom seeds to grow the organic vegetables necessary for good health. This will save you money, is better for you than grocery store vegetables which may be genetically modified or may contain unwanted chemicals, and helps you to become less dependent on the state for your survival.\r\n\r\nIt is the last part of the above statement that frightens government officials. They want you dependent on them. For some, it makes them feel important. Others may just want to feel needed or helpful. Still others may just want the paycheck. Whatever the case, they don’t seem to just want to leave you alone to your own devices. Perhaps that’s why they’re attempting to pass laws making it illegal to grow your own garden. Perhaps that’s why they want to make sure you’re a compliant grass farmer just like your neighbors. Perhaps that’s why they’re trying to control the food necessary for life.\r\n\r\nThere was much reporting done on the story of Julie Bass from Oak Park, Michigan, who was arrested for growing a garden in her (gasp) front lawn. There was so much reporting on this story, in fact, that the city of Oak Park decided to drop the charges. They had claimed that the citizens of Oak Park were in favor of such ordinances that made it a crime to have anything but nicely manicured, inedible, Kentucky bluegrass lawns (an exaggeration, but you get the idea). I think they were rather surprised when the Bass’s neighbors came out decidedly against the arrest. Rather than apologizing and admitting they were wrong like normal people would do, however, they did what you would expect of government control freaks who think they’re perfect. They found something else to charge poor Julie Bass with. Things get tough for you once you’re on the government’s shit list.\r\n\r\nAs Julie Bass’s further adventures in the world of government abuse unfold, I hope she continues to receive the support of her neighbors and things turn out well for her. There are others who are not quite as fortunate as her, however, when it comes to the government’s longing for complete control over food. There are other victims of inane policies of local government gangs. The homeless in Orlando are a good example.\r\n\r\nNow, you’d think that government officials would want to help the disadvantaged such as people who have lost everything due to the economic downturn. That’s what government officials would have us believe in many cases, that they are there to help when one is down and out. Why, then, would they want to make sure the homeless are hungry? Why would they want to arrest people for feeding other people who can’t afford to buy a sandwich? Why would they wish to appear so callous about those who they are supposed to be helping? Perhaps they don’t like the thought that they aren’t the only ones who care about the plight of less fortunate people. Perhaps they simply don’t like someone trying to muscle in on their charity monopoly. I’m not sure, but there is something terribly wrong with a system that decides to arrest people for helping.\r\n\r\nThere is a man, a super activist so to speak, who is trying to rectify this situation. His name is Julian Heicklen. He is a 79 year old activist who is trying to show us all what it means to truly fight tyranny and become free. He is going to Lake Eola Park in Orlando Florida on August 18th to help the “Food not Bombs” people distribute food to anyone who’s hungry, including homeless people. Many have already been arrested by the not overly compassionate Orlando police for such acts of kindness. He also plans on engaging in other non violent illegal activities such as distributing Fully Informed Jury Association literature to people at the Orange County Court Complex and taking pictures of police officers doing their work to point out the ridiculousness of tyrannical laws, but it is the distributing of food down there that has really piqued my interest. The other activism is important as it sheds light on practices the controllers would like to keep secret, but one must truly wonder what on earth was going through their heads when they decided to make it illegal to help others who are less fortunate.\r\n\r\nSo, some local tyrants have decided not to allow the local serfs to grow vegetables in their front yards. They’ve decided that only they are allowed to help the needy, and they’re doing a real poor job of it. If that’s not enough to convince you of the immorality of many local governments that the common folk are supposed to be protected against, then I would point out the slew of kids’ lemonade stands that have been shut down recently. Many stories of this occurring have been circulating lately and all I’ve heard about is people shaking their heads and complaining. Recently, however, someone has decided to do something about it.\r\n\r\nRobert Fernandes has decided to create a website that promotes an event called Lemonade Freedom Day on August 20th, 2011. The idea is to spread the word that selling lemonade is not a crime and should not be treated as such. Don’t you remember being a kid and setting up a lemonade stand? I remember doing so, only I sold Kool-Aid. I’m fairly certain that millions of children across this nation have fond memories of similar experiences. Why would someone want to steal such a valuable activity from modern youth? Why would anyone want to criminalize such a delightful piece of summertime Americana? Could it be that perhaps they wish to suppress the entrepreneurial spirit that helped build America? Could it be that their lust for control is so overwhelming to them that they couldn’t care less about the children affected? Could it be that they are simply trying to drill into the heads of our youth the idea of obedience to law, no matter how onerous, bad, or immoral the law is? As I see it, authority has grown so far out of control that it has made itself illegitimate.\r\n\r\nThere are a couple of things that tie all these news stories together. The first is that none of these laws would matter if it wasn’t for the enforcers, the police. All of these so called crimes would not have made the news if the police had simply said “no” when asked to arrest the perpetrators or shut down their operations. But the police in this nation seem to no longer be able to think for themselves. They have become the automatons of the state, excusing their actions because they are “just doing their jobs” just like the German Nazis excused their actions during World War II. I would point out that their job includes upholding the Constitution of the United States of America. I would point out that their job includes saying “no” to enforcing bad laws when ordered to. If things were running properly and the system wasn’t so corrupt, perhaps that’s what would be happening. In a perfect world, the brave peace officer who stands up to the corrupt government official would become a hero and be rewarded while the corrupt government official would get his comeuppance. Instead, we have a world where any “law enforcement officer” is punished for standing up to the system and lives in fear of losing his job or worse if he does what’s right.\r\n\r\nThe other thing that ties these stories together is the common folk. It is their apathy that has allowed the system to deteriorate to this point. It is their going along to get along and simply not saying anything that has allowed the system to become so corrupt. It is their shrugging their shoulders and keeping their heads down that has allowed evil to win as much as it has, as the proverbial saying goes. Those in government have come to believe they can simply do as they please. They have come to believe that whatever they say is law and the people will grumble and moan, but simply obey and not do anything else about it. Well, that seems to be changing. The people spoke up about the Julie Bass situation and they’re taking action to correct the other injustices mentioned above. Methinks that perhaps the government officials have pushed the envelope just a little too far and more than enough people can now see just how much the tyranny has grown. Next month should be an interesting one as the people attempt to trim it back.\r\n\r\nMy archived articles are available at szandorblestman.com. Please visit there and make a donation to help support me and my efforts. I also have an ebook available entitled “The Ouijiers” by Matthew Wayne.\r\n\r\nhttp://deadlinelive.info/2011/07/23/food-control-and-the-growing-police-state", "group_id": 3920, "id": 1707425}]