[{"user_id": 11626, "stars": [], "topic_id": 43936, "date_created": 1313562365.240664, "message": "CYBERWAR WEDNESDAY 8/17/11\r\n\r\nWelcome to the \"Cyber-War Wednesday\" edition of SCMLA's News Digest!\r\n\r\n\r\nBook Excerpt: Ghost in the Wires — My Adventures as the World’s Most Wanted Hacker\r\nThreat Level (via Wired)\r\nAugust 16, 2011\r\n\r\nGhost in the Wires — My Adventures as the World’s Most Wanted Hacker, by Kevin Mitnick In his newly published autobiography, America’s most famous ex-hacker, Kevin Mitnick, tells his own story for the first time. In this excerpt, Mitnick describes his 1992 investigation into the mystery hacker “Eric,” who’d begun pumping him for information. Mitnick’s spy-versus-spy duel with the hacker would launch a chain of events destined to turn Mitnick into the most-wanted computer criminal in the country.\r\nRevelations We’re told that our medical records are confidential, shared only when we give specific permission. But the truth is that any federal agent, cop, or prosecutor who can convince a judge he has legitimate reason can walk into your pharmacy and have them print out all of your prescriptions and the date of every refill. Scary.\r\nhttp://www.wired.com/threatlevel/2011/08/kevin-mitnick-excerpt\r\n\r\nAnonymous hackers take on San Francisco subway\r\nReuters\r\nAugust 15, 2011\r\n\r\nSAN FRANCISCO (Reuters) – The hacker group Anonymous is taking on San Francisco's subway system after the Bay Area Rapid Transit turned off cell phone service in stations last week to foil a different protest. The transit service last Thursday shut down cell phone networks in some stations to stop a protest over a police shooting. In a city known for civil rights protests and technology, that tactic has landed the commuter train system in a new controversy. \"We've invited these protesters now,\" said Lynette Sweet, a BART director who said managers of the system should not have announced the in-station mobile phone network shutdown. Anonymous is a loosely knit group that has attacked financial and government Web sites, frequently claiming civil rights motives. They called for protesters to descend on the Civic Center station in San Francisco at 5 p.m. on Monday, publicizing the action with tweets from @YourAnonNews. Would-be protesters were encouraged to download software for short-range mobile-to-mobile messaging, in case the in-station networks are shut down again. BART said that a Web site for its users, myBART.org, had been hacked over the weekend, and that contact information from at least 2,400 people had been stolen.\r\nhttp://old.news.yahoo.com/s/nm/20110815/wr_nm/us_hackers_subway_sanfrancisco\r\n\r\nHackers threaten Fullerton police website, email\r\nOC Register\r\nAugust 14, 2011 \r\n\r\nThe hacker group Anonymous threatened to disrupt the Fullerton Police Department's website and email after the death of Kelly Thomas, a mentally ill homeless man last month following a confrontation with police officers. The group is demanding the resignation of Police Chief Michael Sellers, the prosecution of the officers involved and the city to pay out $5 million to the family of Thomas, 37, who died July 10.\r\nhttp://www.ocregister.com/news/police-312020-officers-anonymous.html\r\n\r\nAnonymous Announces BART Cyber Attack After Cell Phone Shutdown\r\nInfowars.com\r\nAugust 14, 2011\r\n\r\nFollowing BART’s illegal shut down of cell phone service last week to interrupt a protest at San Francisco Civic Center Station, the hacktivist group Anonymous promised to launch a cyber attack against the rapid transit system. “For the people outside of San Francisco, show solidarity by using black fax, email bombs, and phone calls to the BART Board of Directors. BART decided to cut off your communications and now we will flood theirs,” the group said in a statement. Anonymous calls the effort #OpBART. The statement includes links to media materials and “email and fax bomb info.” The BART cell phone shutdown occurred on Thursday and took out service from 4 p.m. to 7 p.m. PST at the Embarcadero, Montgomery Street, Powell Street, and Civic Center BART stations. “Shutting down access to mobile phones is the wrong response to political protests, whether it’s halfway around the world or right here in San Francisco. You have the right to speak out. Both the California Constitution and the First Amendment to the United States Constitution protect your right to free expression,” the ACLU said following the outage, a violation of the Communications Act of 1934.\r\nhttp://www.infowars.com/anonymous-announces-bart-cyber-attack-after-cell-phone-shutdown\r\n\r\nSecurity expert warns hackers can attack Android\r\nReuters\r\nAugust 12, 2011\r\n\r\nBOSTON (Reuters) – A mobile security expert says he has found new ways for hackers to attack phones running Google Inc's Android operating system. Riley Hassell, who caused a stir when he called off an appearance at a hacker's conference last week, told Reuters he and colleague Shane Macaulay decided not to lay out their research at the gathering for fear criminals would use it attack Android phones. He said in an interview he identified more than a dozen widely used Android applications that make the phones vulnerable to attack.\r\nhttp://old.news.yahoo.com/s/nm/20110812/wr_nm/us_android_security\r\n\r\nGerman hackers crack mobile phone GPRS code: report\r\nReuters\r\nAugust 10, 2011\r\n\r\nBERLIN (Reuters) – A Berlin security firm has cracked the encryption code for some mobile phones using the Internet, German newspaper Handelsblatt reported on Wednesday, citing the company's chief. The discovery of a way to eavesdrop so-called General Packet Radio Service (GPRS) technology allows a user to read emails and observe the Internet use of a person whose phone is hacked, said Karsten Nohl, head of Security Research Labs. \"With our technology we can capture GPRS data communications in a radius of 5 km,\" he told the paper before heading to a meeting of the Chaos Computer Club, a group that describes itself as Europe's largest hacker coalition. Phones using the newer UMTS standard are safer, Nohl said, but the crack effects industrial equipment, toll systems and anything using GPRS -- including newer devices like Apple Inc's iPhone or iPad which switch to the older GPRS in remote areas.\r\nhttp://old.news.yahoo.com/s/nm/20110810/wr_nm/us_germany_hackers_phones\r\n\r\nHacker group vows to ‘kill Facebook’\r\nCNN\r\nAugust 9, 2011\r\n\r\n(CNN) — Apparently, “Anonymous” won’t be accepting your friend request. Members of the shadowy collective known for its politically motivated Web hacks and attacks are targeting Facebook for what they claim to be the social-networking giant’s misuse of personal information. “Your medium of communication you all so dearly adore will be destroyed,” the speaker said in a YouTube video, which was posted July 16 but started circulating widely this week. Using a voice modulator to disguise his (or her) voice, the speaker, who purports to represent Anonymous, invites viewers to “join the cause and kill Facebook for the sake of your own privacy.” “Everything you do on Facebook stays on Facebook regardless of your privacy settings, and deleting your account is impossible,” the speaker says. “Even if you delete your account, all your information stays on Facebook and can be recovered at any time.”\r\nhttp://www.cnn.com/2011/TECH/social.media/08/09/anonymous.facebook\r\n\r\nChina says it was targeted in 500,000 cyberattacks\r\nAP\r\nAugust 9, 2011\r\n\r\nBEIJING – Nearly 500,000 cyberattacks were aimed at computers in China last year and almost half originated overseas, the government said Tuesday, following recent suggestions Beijing might be behind long-term security attacks internationally. The vast majority of the attacks a Chinese monitoring agency reported were in the form of Trojan horse malware that installs on computers, allowing them to monitor usage and access personal information. Of those Trojan horse attacks, 14.7 percent of those were traced to IP addresses in the United States and 8 percent in India.\r\nhttp://old.news.yahoo.com/s/ap/20110809/ap_on_hi_te/as_china_cyberattack", "group_id": 3920, "id": 1890391}]