[{"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311429063.6443629, "message": "Lumayan juga dari lebih 20 orang yang mendaftar, hadir 16 orang.\nBeberapa dari id-python ikut hadir, hanya saja nara sumber utama\npython dan django berhalangan datang, jadi yang lebih banyak dibahas\nadalah mcu :) Begitu banyak yang mau dibahas, seharian pun masih\nkurang waktunya. :)\n\nPak Hardy memberikan demo dan penjelasan keluarga HC, senter LED, dan GPS.\n\nSaya cuma sempat menunjukkan LPCXPresso, tidak bisa didemokan karena\nlupa bawa compilernya.\nUntuk mbed sempat didemokan web compilernya, cuma sayang karena\npengetahuan saya masih kurang, jadi demo kurang maksimal :( Dan\nkebetulan juga sempat demo kit Luminary Micro Cortex M3 yang\ndilengkapi display OLED.\n\nPak Adesst sempat hadir sebentar, bisa mengisi kekosongan nara-sumber\npython, trims Pak Ade :)\n\nTerakhir Pak Unggul memberikan demo FlowCode yang direkam langsung,\nditunggu sharingnya Pak :)\n\nTerima kasih kepada rekan-rekan yang hadir dan ikut meramaikan acara.\n\nYang ambil foto-foto dan video tadi, bisa di-share dong :D\n\nAda beberapa agenda yang tidak sempat dijalankan yaitu: demo embedded\nwebserver (AVR+ENC28j60) oleh Astonix, uji coba pemakaian/perkenalan\nAVR dengan kit yang dibawa Pak Adesanto, dan saya juga lupa demo\nPICKit2 dan 16F88 yang sudah dibawa :(\nYang ketinggalan juga pembahasan akan apa yang akan dilakukan pada\npertemuan selanjutnya.\n\nJadi bakal ada Kopdar kedua nih.\nBagi rekan-rekan yang ikut kali ini silahkan berbagi cerita, sumbang\nsaran, bagaimana kopdar bisa dijalankan lebih bail lagi. Monggo.\n\nBuat Pak Aston, tadi idenya boleh di-share di milis juga.", "group_id": 10816, "id": 1705708}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311429592.628803, "message": "Oh ya lupa, Pak Hardy juga sempat menunjukkan penerima siaran TV\ndigital dengan USB dan produk Meitan-X. Dan penjelasan untuk\narsitektur Von Neuman dan Harvard. Beberapa trik programming\nmikrokontroler. Penjelasan keluarga HC-nya sangat lengkap sampai demo\nIDE and debuggerya.\nTerima kasih buat Pak Hardy yang mau meluangkan waktunya untuk hadir\ndi Kopdar I Mikropop ini. :)", "group_id": 10816, "id": 1705727}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311429637.655381, "message": "Yang tadi ikut boleh ikut bagi cerita, biar rekan lain yang ikut bisa tahu :D", "group_id": 10816, "id": 1705728}, {"user_id": 36271, "stars": [], "topic_id": 42538, "date_created": 1311437451.7579739, "message": "oyah sama harga nya kisaran brp kl pake PIC? mungkin bisa juga di bagiin soal ARM spy bisa main embed (bakalan seru banget kl yg 1 ini) krn menungkinkan python utk bermain di dalam nya :D", "group_id": 10816, "id": 1706061}, {"user_id": 36271, "stars": [], "topic_id": 42538, "date_created": 1311437371.4234779, "message": "tq juga Pak Soliton, utk next kopdar mungkin boleh di bagi per target audience, jujur utk pemula spt saya sulit ikutin yg sdg d bahas. Oyah PIC 16F88 mau di bahas jg yahh? Mau tanya aja kl PIC16F88 mudah di cari tak chip nya brkt perangkat pendukung nya? Oyah 1 lg PIC ada yg pake C utk dev nya?", "group_id": 10816, "id": 1706054}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311470819.2742071, "message": "@adesst Untuk PIC ada banyak jenis chip harga sekitar 20rb sampai mahal sekali, kalau dibanding Atmel sih kalah murah, tapi daya tahannya dan kemudahannya, Atmel kalah jauh. Untuk programmernya saya pakai PICKit2 yg harganya sekitar 300-400rb. Nanti saya coba import buatan RRC yg lebih murah, atau rakit sendiri pun bisa :D Benar PIC bisa pakai C juga ada beberapa compiler C utk PIC, yang free dan bayar.", "group_id": 10816, "id": 1708003}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311470395.0543711, "message": "@adesst hm trims untuk masukannya bro, kopdar pertama ini kita juga masih meraba-raba, materi yang disampaikan apakah bersifat advanced atau pemula, atau sekedar sharing, makanya perlu input seperti ini. Sebenarnya saya berencana membahas PIC16F88 karena memang ini yang paling saya kuasai, sayang waktu tidak cukup, jadi mungkin next time. Kalo chipnya tidak terlalu sulit, meski harus impor. Seperti kata Pak Hardy, harus ada yang mau jadi stokist-nya... nanti saya coba jadi stockist-nya deh :D", "group_id": 10816, "id": 1707953}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311471265.3344121, "message": "Untuk ARM, memang ada rencana untuk impor juga, cuma lagi cari yang lumayan murah namun lengkap dan mudah. Kalau ada ide, misalnya pengen kit apa, boleh diusulkan.", "group_id": 10816, "id": 1708051}, {"user_id": 36884, "stars": [], "topic_id": 42538, "date_created": 1311471746.3734009, "message": "Kemarin sewaktu kopdar ada yang tanya harga mbed NXP LPC1768,\nini ada yang jual, tapi di luar negeri:\n\nhttp://www.lpctools.com/mbed.aspx", "group_id": 10816, "id": 1708078}, {"user_id": 36271, "stars": [], "topic_id": 42538, "date_created": 1311582813.213881, "message": "@soliton , sempet2 browsing soal mbed.org NXP LPC1768, http://stacksmashing.net/2010/11/10/mbed-org-introduction-improved-mbedrpc-module-for-python/", "group_id": 10816, "id": 1714275}, {"user_id": 36271, "stars": [], "topic_id": 42538, "date_created": 1311583175.1390231, "message": "anyway balik soal PIC, hehhehehe ada neh yg bisa di hub dg python, http://sourceforge.net/projects/pyastra/ a Python To Assembler Translator. Sama ini http://projectproto.blogspot.com/2009/12/python-for-pic-mcus.html humm mantab neh blog nya singkat tapi menarik", "group_id": 10816, "id": 1714286}]