[{"user_id": 11696, "stars": [], "topic_id": 12737, "date_created": 1299987920.0533831, "message": "Recently I started to move my website (Plone) to the T1-micro instance that amazon gives you for free during the first year. Obviously Plone is kind of a beast and it takes more than 1 hour to be built in that micro instance. So I started wondering how many disadvantages are there by deploying Python apps to the cloud.", "group_id": 5283, "id": 338596}, {"user_id": 8740, "stars": [], "topic_id": 12737, "date_created": 1300023475.638752, "message": "It really depends what you mean by \"the cloud\" - there's both commodity virtualisation services (like EC2, Rackspace Cloud) and Platform as a Service (PaaS) solutions, and each have their pros and cons", "group_id": 5283, "id": 340884}, {"user_id": 8740, "stars": [], "topic_id": 12737, "date_created": 1300023512.41189, "message": "The EC2 micro instances are particularly slow, however - you can't really expect to host anything other than a small site off of them.", "group_id": 5283, "id": 340887}, {"user_id": 13340, "stars": [], "topic_id": 12737, "date_created": 1300039473.0961919, "message": "You could always build the Plone site on a s/m/l instance and then downsize to a micro.", "group_id": 5283, "id": 342073}, {"user_id": 11696, "stars": [], "topic_id": 12737, "date_created": 1300045174.9280579, "message": "Yeah, that seems to be the best thing to do.", "group_id": 5283, "id": 342942}, {"user_id": 8740, "stars": [], "topic_id": 12737, "date_created": 1300068817.9192309, "message": "You can kind of solve that using a ramdisk, but then there's not exactly much memory on micros either.", "group_id": 5283, "id": 344577}, {"user_id": 8740, "stars": [], "topic_id": 12737, "date_created": 1300068799.2178049, "message": "Especially as building a Plone site is, I imagine, I/O heavy, which the EBS-backed instances aren't going to like!", "group_id": 5283, "id": 344574}, {"user_id": 8740, "stars": [], "topic_id": 12737, "date_created": 1300068859.5373909, "message": "Still, natea is right, spend the one hour's cost on a larger instance and build it there. That's the beauty of the \"cloud\" - having lots of firepower when you want it.", "group_id": 5283, "id": 344580}]