[{"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310791800.311105, "message": "Now to my question, which could be about storyweaving as much as anything.\n\nDoes the \"mistake\" she makes of helping need to be related directly to her MC Problem.\n\nAs a blunt example, does she need to have a Problem of Help? (Help is an example. I'm sure any element will work.)", "group_id": 2515, "id": 1650553}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310791887.405479, "message": "I always like when the Problem compels the development of acts. *The Fugitive* is like this, where help starts it out, moves the 2nd act, etc. I don't think it HAS to, but I like it", "group_id": 2515, "id": 1650554}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310792488.526793, "message": "i'm not going anywhere :)", "group_id": 2515, "id": 1650585}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310793065.2141199, "message": "Or...\nA guy has a problem of Help. He's also meek. So, he gets picked on. But this time, he gets out of it by Helping the bully's girlfriend on a math test, so the Bully stops picking on him. Meekness is just a character trait. And Help didn't get him into trouble with the Bullies...", "group_id": 2515, "id": 1650605}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310791438.7931991, "message": "I'm revamping an old story, and am bringing in some major changes. The primary change is how the MC gets involved in the meat of the OS.\n\nIn the original draft, she was essentially pulled into the story accidentally. She was in the wrong place at the wrong time, got her hands on a gizmo that other people wanted and voila, she's in.\n\nNow, I'm making her take an active role. Instead of stumbling across something in the bushes, she goes to help someone and ends up with the gizmo. Seemingly a small change, but it makes her a bit more proactive.", "group_id": 2515, "id": 1650539}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310791939.2201071, "message": "The Act is probably going to begin before she's involved. She'll have some MC Domain-specific scenes, and then make the fateful decision.", "group_id": 2515, "id": 1650557}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310792150.9464049, "message": "re your question before that, it could go either way i would think", "group_id": 2515, "id": 1650567}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310792379.9093699, "message": "oh yeah, he wouldn't promote the drug so she paid the price", "group_id": 2515, "id": 1650576}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310793377.3232329, "message": "Bob Lee Swaggart gets pulled into a job to protect some politician. It's a con. \n\nDoes he fall for that con because of his MC Problem? (Which I couldn't tell you what it is.)", "group_id": 2515, "id": 1650624}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310792112.0606611, "message": "that would be a jump, i would say his refusal to help ends up getting his wife killed, the wife's call for help gets him convicted (she says his name)", "group_id": 2515, "id": 1650566}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310791888.7715189, "message": "I think it's going to end up being a decision story (not sure). Does the MC's problem have to have a major role in the decision she makes to help out, which then gets her tangled up in the meat of the story? Would it be better if that were the case?", "group_id": 2515, "id": 1650555}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310792075.4594059, "message": "Re: The Fugitive. Does the MC Problem lead directly to his murder conviction?", "group_id": 2515, "id": 1650564}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310792277.8615551, "message": "Okay, so it's not the proximate cause, but you can draw a line from his refusal to Help (OS Problem) to his wife's murder...", "group_id": 2515, "id": 1650573}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310792470.7165251, "message": "I wish I could think of a good example we could bat around.", "group_id": 2515, "id": 1650581}, {"user_id": 36437, "stars": [], "topic_id": 42113, "date_created": 1310792564.594749, "message": "I don't know enough theory to add anything constructive, so I'm just \"listening\"...", "group_id": 2515, "id": 1650587}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310792826.418735, "message": "This is also just about how stories play out, so theory might not enter into it too much.", "group_id": 2515, "id": 1650596}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310792944.0048571, "message": "While I try to dig up an example, let's think about this. \nA bully story. A guy is meek, so the bullies start to pick on him. He's got his MC issue (meek) and the OS (high school hierarchy) right there. In order to survive, he's got to overcome his meekness, or use a philosophy of \"turn the other cheek\". Either way, his MC Problem gets him into the story.", "group_id": 2515, "id": 1650601}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310793262.582937, "message": "The Shooter might be a better example.", "group_id": 2515, "id": 1650616}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310793206.87394, "message": "The Man Who Knew Too Much. This is purely accidental right? I mean, the way the family is mistaken for the spies?", "group_id": 2515, "id": 1650611}, {"user_id": 33839, "stars": [], "topic_id": 42113, "date_created": 1310819932.960578, "message": "A lot of Hitchcock's work, such as TMWNTM, is about the ordinary man who accidentally finds himself in extraordinary circumstances.  There could be a lot of reasons for this, for example: does your story start small and grow big (like a conspiracy) and hold a mystery?  Then that approach would help segue the audience into the story through the MC.", "group_id": 2515, "id": 1651502}, {"user_id": 33839, "stars": [], "topic_id": 42113, "date_created": 1310838456.317946, "message": "Strange.  Where did my second post go?  Oh well... I think I said something along the lines of whether your story was one where the main character is aware of the gizmo and its potential consequences (Raiders of the Lost Ark), or unaware (The Fugitive) in the sense they have to put the pieces together to realize the big picture... or, completely unaware (North By Northwest), where the gizmo is a MacGuffin, simply driving the plot but not of any real interest to the audience?  \n\nBy the way, I see MacGuffins used less and less - the last one I can truly think of off the top of my head was the briefcase in Pulp Fiction.  I think it CAN be useful, but today's \"readers\" don't seem to get them/enjoy them and see them mostly as a detriment to a story (heck, I'll take that one step further and say anything with an open ending, too.)", "group_id": 2515, "id": 1652920}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310839278.498687, "message": "So, were the events that led to his getting chosen tied to his Problem? (Which I seem to recall is in the Situation domain: he's fat.)", "group_id": 2515, "id": 1652971}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310839208.64397, "message": "I think I have found an example: Kung Fu Panda. \n\nThe Panda is obsessed with The Five, and goes to the ceremony to see who is going to be the chosen one. After some physical comedy, voilà, *he* himself is chosen.", "group_id": 2515, "id": 1652966}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310839130.0659771, "message": "I'm going to get away from the gizmo, because the MC doesn't exactly get wrapped up in a mystery. They just get wrapped up in a society they didn't know existed. That said, there is a bumpy segue into the story that has a lot of exposition that can be a pain. The character ends up in the afterworld, and simply has no bearings on where she is or what the rules are. It's not like anything she expected.", "group_id": 2515, "id": 1652960}, {"user_id": 7645, "stars": [], "topic_id": 42113, "date_created": 1310851560.5924211, "message": "no - because I think those events have to do with the OS", "group_id": 2515, "id": 1654022}, {"user_id": 33839, "stars": [], "topic_id": 42113, "date_created": 1310856186.94502, "message": "@MikeDerk But a MC that gets wrapped up in a society they didn't know existed is still a sense of \"mystery\", though I should have probably chosen a better word.  Essentially it's the unknown vs. the known - in this case, the MC doesn't know what they're dealing with, which allows story elements to flow more organically (think Alien: we don't know that an egg leads to a spider-thing which leads to a chest-burster which leads to an Alien; we learn these through the course of the story... just as we learn the rules of dealing with them (their blood is acid).", "group_id": 2515, "id": 1654348}, {"user_id": 33839, "stars": [], "topic_id": 42113, "date_created": 1310857406.2852061, "message": "Perhaps Body Double, or heck, Vertigo itself is an example of what you're looking for?  In Vertigo, Scottie suffers from a Vertigo due to the inability to save the policeman who died at the beginning of the movie, falling from atop a building as he looked on.  \n\nAs a result, Gavin Elster uses Scottie's problem as his solution to killing his wife, Madeline: have Scottie \"witness\" her suicide from atop a bell tower, knowing he will be unable to climb to the top where Gavin himself throws the real Madeline over.  I looked over the elements and THINK Vertigo would translate into perception which feels like it would echo the SS story with Scottie perceiving Madeline as someone she's really not.  In both cases, actuality is the solution, but Scottie also deals with the other elements in the quad, to some extent.  Sorry, thinking out loud here... :).  \n\nI would think that would be part of the OS, the SS being the obsession Scottie develops over \"Madeline\" before her death, then with Judy afterwards, remaking her into, and discovering she was in fact, \"Madeline\" (quotes being she played the role of Madeline).", "group_id": 2515, "id": 1654401}, {"user_id": 10814, "stars": [], "topic_id": 42113, "date_created": 1310921962.72293, "message": "If the MC is not tied to the OS, why should he or she be in the story?  This is the kind of thing the crucial element is for -- to tie the throughlines together.  It is far more interesting if the MC is at least PARTLY responsible for getting mixed up in the OS, but it is not necessary.  Comedies and lightweight stories tend to make the connection spurious.  Dramas and serious action stories tend to make the connection between the MC's introduction to the OS (in his role as an objective character) more integrated.", "group_id": 2515, "id": 1657360}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310967437.172775, "message": "Well, I say it's accidental, but what I mean by that is this: Stephanie, our lead (and MC), finds something and picks it up in a \"curiosity killed the cat\" kind of way. The person who goes to retrieve it is supposed to do it quietly and secretly, but he screws up -- the screw up is the accident.", "group_id": 2515, "id": 1660776}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310967604.7432549, "message": "Because of the screw-up, she's forced to take a job she doesn't want. (Or get killed.)\n\nIt plays thematically with the story because she's just about to start making decisions about how to live her life, and then, no, here comes someone else defining what her life is going to be.", "group_id": 2515, "id": 1660792}, {"user_id": 7664, "stars": [], "topic_id": 42113, "date_created": 1310967681.4902771, "message": "What it doesn't do is draw on any of her traits. I like thinking about the Crucial Element to do that -- it had never occurred to me. \n\nI'm gutting the whole draft and rebuilding it, so I'll look towards the Crucial Element as a place to get her involved. Thanks!", "group_id": 2515, "id": 1660800}, {"user_id": 10814, "stars": [], "topic_id": 42113, "date_created": 1311001163.553432, "message": "Perhaps her personal issues are what put her in the wrong place at the wrong time.  That is a way of keeping it accidental but still tied to the main character issues.", "group_id": 2515, "id": 1663191}]