[{"user_id": 1924, "stars": [], "topic_id": 19331, "date_created": 1302746788.2139881, "message": "I was reminded of this as today I garage saled a Corner Clamp today to fix broken board game boxes, and build boxes and frames. <img height=\"40\" width=\"50\" src=http://www.proxibid.com/AuctionImages/1031/26554/Detail/143.jpg /> My 90' clamp was overkill and the box I failed to fix with a small angle bracket and clamps--most likely operator error though. :)", "group_id": 8728, "id": 676093}, {"user_id": 1924, "stars": [], "topic_id": 19331, "date_created": 1302746496.932785, "message": "Garage sale season is starting up and if there's something you've like us to keep an eye out for please post it here with description, condition requirements, and max price or just to send you a message if we see it. :)", "group_id": 8728, "id": 675976}, {"user_id": 28990, "stars": [{"date_created": 1303009937.806844, "user_id": 1924}], "topic_id": 19331, "date_created": 1302752111.530997, "message": "I'm looking for an old frame for a military rucksack. Specifically the one they are talking about here: http://www.gbfans.com/equipment/proton-pack/alice-pack-frame/", "group_id": 8728, "id": 677520}, {"user_id": 28990, "stars": [], "topic_id": 19331, "date_created": 1302752308.65376, "message": "I'm still trying to decide how much I'm willing to pay, I'm hoping finding one locally will be more cost effective than turing to ebay or the price gouging surplus stores. If you checked the link...yes I'm trying to build a proton pack...but mine's going to be functional, although haven't decided if it's going to shoot paintballs, air-soft pellets, or some other projectile.", "group_id": 8728, "id": 677540}, {"user_id": 28990, "stars": [], "topic_id": 19331, "date_created": 1302892231.8536661, "message": "$30 max on alice pack frame, depending on condition. Must be an LC-1 model, will consider LC-2 if it is extremely low priced.", "group_id": 8728, "id": 703892}, {"user_id": 28990, "stars": [], "topic_id": 19331, "date_created": 1302892355.5614331, "message": "I also am on the hunt for Nintendo 64 consoles and game cartridges. Consoles do not need to be compete or 100% working--I'll be ripping it apart anyway. Price depends on specific items and condition.", "group_id": 8728, "id": 703908}, {"user_id": 28990, "stars": [], "topic_id": 19331, "date_created": 1302892409.2847691, "message": "Please message, call, or email with any leads, thanks!! PM if you need my contact info.", "group_id": 8728, "id": 703913}, {"user_id": 29251, "stars": [{"date_created": 1303009926.9273479, "user_id": 1924}], "topic_id": 19331, "date_created": 1302992819.0443029, "message": "Pasta Machine- is not going to be used for food, max $15.  Doesn't have to have the pasta cutter attachment (top part of picture), just the roller part.  http://www.amazon.com/Marcato-Atlas-Wellness-Pasta-Maker/dp/B0009U5OSO    Handle and rollers should turn smoothly with no metal on metal noises.", "group_id": 8728, "id": 713713}]