[{"user_id": 11405, "stars": [], "topic_id": 7927, "date_created": 1298333098.9533291, "message": "What is the point of this service? For answering questions we have StackOverflow. For finding new content and discussing it we have reddit. What is the point and benefit of convore? Almost all threads I have read here so far are nearly impossible to follow because people tend to use it as a chat room and spam loads and loads of bullshit into each thread...", "group_id": 4772, "id": 175716}, {"user_id": 8391, "stars": [], "topic_id": 7927, "date_created": 1298333243.4765141, "message": "It's like IRC, but much prettier and user friendly.", "group_id": 4772, "id": 175729}, {"user_id": 927, "stars": [{"date_created": 1298341926.0248201, "user_id": 8391}], "topic_id": 7927, "date_created": 1298339440.410135, "message": "IRC without needing a persistent client, potentially firewalled ports and a prettier UI", "group_id": 4772, "id": 176471}, {"user_id": 8391, "stars": [], "topic_id": 7927, "date_created": 1298355545.1149981, "message": "Who needs that power? I just want conversation.", "group_id": 4772, "id": 177393}, {"user_id": 11405, "stars": [], "topic_id": 7927, "date_created": 1298354687.5764091, "message": "Yea ok the IRC point is a valid one - however IRC is so much more powerfull... convore will never ever replace it.", "group_id": 4772, "id": 177363}, {"user_id": 3617, "stars": [], "topic_id": 7927, "date_created": 1298359460.207901, "message": "IRC is powerful? Sure the server-side stuff may be complex, but who really uses it? Channel permissions, moderation, that's about it really.", "group_id": 4772, "id": 177596}, {"user_id": 1376, "stars": [], "topic_id": 7927, "date_created": 1298383604.1514571, "message": ":0 the silence has been broken", "group_id": 4772, "id": 179111}, {"user_id": 5639, "stars": [{"date_created": 1302636788.304378, "user_id": 1924}], "topic_id": 7927, "date_created": 1298387236.3622539, "message": "I value the conversation. I don't really want to search mailing list archives from 10 years ago to get an answer that might work today. I want to know what's working for people *now*. I've already learned about at least 5 new tools from conversations on convore (jekyll and hyde to name just two of them)", "group_id": 4772, "id": 179529}, {"user_id": 5639, "stars": [], "topic_id": 7927, "date_created": 1298386972.872236, "message": "I use IRC as well, but convore is like everything you need & nothing you don't from IRC. For example, I don't have to wonder if this is logged. In irc, even if a channel is logged, breakout channels are almost always *not* logged. If I find something useful, or participate in something, I want it logged. I want the knowledge from IRC to be generally available, and it seems the trend is that it's not.", "group_id": 4772, "id": 179504}, {"user_id": 5639, "stars": [], "topic_id": 7927, "date_created": 1298387150.07634, "message": "that's fine too @bryangarvin -- nobody's enforcing convore as the standard or anything.", "group_id": 4772, "id": 179527}, {"user_id": 5639, "stars": [], "topic_id": 7927, "date_created": 1298387043.916265, "message": "I'm 'jonesy' on freenode btw. Currently logged into a dozen or so channels across 3-4 different servers.", "group_id": 4772, "id": 179510}, {"user_id": 1203, "stars": [], "topic_id": 7927, "date_created": 1298387084.852911, "message": "With Google and Twitter, seems like questions get answered, and conversations happen easily as it is. One more step seems avoidable.", "group_id": 4772, "id": 179519}, {"user_id": 2344, "stars": [], "topic_id": 7927, "date_created": 1298386625.083437, "message": "i'm lurking", "group_id": 4772, "id": 179445}, {"user_id": 5639, "stars": [], "topic_id": 7927, "date_created": 1298387001.756372, "message": "the only thing I miss here from IRC-land is private chats. But I don't use that feature very often.", "group_id": 4772, "id": 179507}, {"user_id": 1203, "stars": [], "topic_id": 7927, "date_created": 1300219441.6375151, "message": "@jonesy I'm not trying to suggest that Convore should be abandoned. As long as it's searchable, then someone going to Google first, their questions can be answered by Convore convos. Conversations are good to have wherever they are held. But I wouldn't come here for answers, when the pool of data is small vs. a search engine, who's reach is much wider than just Convore members. That's all I'm saying.", "group_id": 4772, "id": 359867}, {"user_id": 3354, "stars": [], "topic_id": 7927, "date_created": 1318580970.699728, "message": "Remember, too, that a lot of Convore's popularity centers around events, where search engines are out of date - Google can't tell you when the open space session on web testing is, and who's thinking about going.", "group_id": 4772, "id": 2345278}, {"user_id": 3354, "stars": [], "topic_id": 7927, "date_created": 1318581082.692977, "message": "Which isn't to imply it isn't being - I just don't know Leah and her team well enough to know what's been going on lately.", "group_id": 4772, "id": 2345283}, {"user_id": 3354, "stars": [], "topic_id": 7927, "date_created": 1318581046.796684, "message": "I have my concerns about scalability (performance seems to have gone down as data volumes have gone up), but it does fill real needs, IMHO, and I'd like to see it maintained.", "group_id": 4772, "id": 2345280}]