[{"user_id": 32888, "stars": [], "topic_id": 41402, "date_created": 1310072466.126204, "message": "If someone has a point to make, even if it is a decent point, and they use scripture to back or illustrate it, but they use the wrong scripture, or take things out of the scripture in the wrong context... is it our responsibility to point that out? Should we just agree on the over all point of what the person is trying to say and ignore any possible misrepresentation of the message the scriptures used are actually conveying?", "group_id": 9787, "id": 1587920}, {"user_id": 13817, "stars": [], "topic_id": 41402, "date_created": 1310110542.449357, "message": "I think it is always wrong to take it out of context and I appreciate people correcting me and helping me. Sure someone can make a good point and use convoluted ways to back it with scripture that is not saying that point. I think though we have a responsibility to show the error in the use of the scripture and possibly point out a better way to back their sentiments.\n\nThe reason I say this is the same method can be used to create false hope, false gospel and a false Christ. So someone may get the sentiment right once but what happens when they get wrong ideas?", "group_id": 9787, "id": 1591018}, {"user_id": 32891, "stars": [], "topic_id": 41402, "date_created": 1310111099.263402, "message": "I'm with Chris. ;)", "group_id": 9787, "id": 1591030}, {"user_id": 32900, "stars": [], "topic_id": 41402, "date_created": 1310121518.525615, "message": "Wrong use of scripture? If it's a clear heresy, sure. It must be corrected. But have you actually looked at how Matthew quotes scripture? or Paul (of the bible). Sheesh...mind twisting to figure out how they ever saw some of the scriptural evidence they present to prove a point.", "group_id": 9787, "id": 1591539}, {"user_id": 32900, "stars": [], "topic_id": 41402, "date_created": 1310121625.692189, "message": "Do we break someone down for minor discrepancies in their thought pattern? I'm all for correcting mistakes and learning. but the method is quite often more important than the correction itself (note: I'm not talking Heresy here...this is minor discrepancies in understanding and context...the point itself is valid and correct)", "group_id": 9787, "id": 1591554}, {"user_id": 13817, "stars": [], "topic_id": 41402, "date_created": 1310136920.9203229, "message": "heh, this just came through my twitter stream :) http://twitter.com/#!/elohimito/status/88591897462968320", "group_id": 9787, "id": 1593350}, {"user_id": 13817, "stars": [], "topic_id": 41402, "date_created": 1310136845.6186941, "message": "@pevans_om Why does correction have to be \"breaking someone down?\" Are you saying, if they get a good thought and use bad scripture to back it up rather leave them than teach them? Make sure we all live in peace no matter what.\n\nWhat if the person in question is an Elder of a church using scripture badly? What if they get one thought right but others wrong? I don't think it is as simple as you're making it out to be.", "group_id": 9787, "id": 1593332}, {"user_id": 32900, "stars": [{"date_created": 1310204014.48083, "user_id": 13817}], "topic_id": 41402, "date_created": 1310202743.724633, "message": "@penkin Sorry, I just had a conversation with  @LintonCaldecott previously about this and I have an idea about the background to the question.\n\nI have no problem with correcting or questioning someone's use of scripture. I just have a problem with the method usually employed i.e. burn him/her at the stake!", "group_id": 9787, "id": 1598102}, {"user_id": 32888, "stars": [{"date_created": 1310204201.6599791, "user_id": 13817}], "topic_id": 41402, "date_created": 1310203714.3152461, "message": "the blog unsafechallenge is written by a guy I knew and worked with... know and worked with? This is the specific post that kindled this discussion http://www.unsafechallenge.com/hush you can see my comments in the comments section. I asked the question because in an earlier post the author also used scripture to make a point that is not invalid, but the scripture used is also, I believe, used incorrectly. The author aspires to leadership and is starting a home style church (as far as I know). So, I really asked the question because I think a person with leadership or teaching aspirations should be corrected if others see what they feel is a bad interpretation of scripture. After our discussion I agree with Paul that it appears that I ONLY have negative things to say, which paints me as a blog troll just looking to trip someone up, I don't know if Coenraad sees me that way, I hope not, we have an amicable relationship and we chat reasonably often on skype. At any rate, the question isn't about delivery, it's about whether or not we should confront it. I think the responsibility gets greater depending on the person. I.E. aspiring leader requires greater accountability and should also seek greater accountability.", "group_id": 9787, "id": 1598119}, {"user_id": 13817, "stars": [], "topic_id": 41402, "date_created": 1310204028.2156019, "message": "@pevans_om I can agree with that :)", "group_id": 9787, "id": 1598122}, {"user_id": 32900, "stars": [], "topic_id": 41402, "date_created": 1310206842.9835479, "message": "@LintonCaldecott I agree. Standing at a distance heckling a speaker doesn't help correction. Relationship is needed to be able to earn the respect of the individual in order to offer correction. Only then may the correction actually be heeded.\n\nPS: I STILL don't think his usage of that scripture was incorrect. Theological technicality means that, mentioning that they thought they were touched by the Messiah is probably not valid and the good news they spread was different in ways from the Gospel, sure. But the core is a quite valid point that can be extracted from that passage (other blog posts you've pointed out have had far worse theological inaccuracies though)", "group_id": 9787, "id": 1598199}]