[{"user_id": 3019, "stars": [], "topic_id": 8666, "date_created": 1298526945.9179881, "message": "On Wed, Feb 23, 2011 at 4:51 PM, Andrew Orr <andrew@andreworr.ca> wrote:\nThe live streaming depends on\nif we can get dvswitch set up to stream online somewhere the night before.\nHas anyone done this before using an online service like ustream.tv,\njustin.tv etc? Running our own icecast is a possibility but we're not sure\nof the bandwidth available at the venue, so this might not work out.\n\nI haven't tried this with ustream.tv or justin.tv, but you should be\nable to get it to work. You will need an FLV stream with H.264 video\nan MP3 audio being sent using the RTMP protocol.\n\nYou can take care of everything except RTMP using ffmpeg, then send\nthe ffmpeg output to a local RTMPd (open source rtmp server) using TCP\nand use RTMPd's \"proxypublish\" functionality to forward the stream to\nustream.tv using the RTMP protocol.\n\nThis works directly from dvgrab, so I'm guessing it will work from dvswitch:\n\n dvgrab - | ffmpeg -i - -vcodec libx264 -vpre superfast -acodec\nlibmp3lame -f flv -ar 22050 -deinterlace \"tcp://localhost:6666\"\n\nYou probably want to alter \"-vpre superfast\" for better quality.\n\nThen set up RTMPd. It should accept incoming connections on localhost\nport 6666 using the default config file.\n\nHave a look at this thread for some info on how to set up proxypublish\nfor forwarding to ustream/justin:\n\n http://groups.google.com/group/c-rtmp-server/browse_thread/thread/6f4f862a732a9183\n\nYou might run into trouble with the stream name, since I think\nustream.tv expects a specific flv stream name. If you do, I have a\npatched ffmpeg that supports -sname to set stream name from the\ncommand line.\n\nAnd yeah, I know it's fairly sucky that we have to wade through\nsetup/configuration hell just to get some live video on the web.\nWe're working to remedy the situation.\n\nSoon.\n\nSooooon...\n\n--\nJuul\n_______________________________________________\nDiscuss mailing list\nDiscuss@lists.hackerspaces.org\nhttp://lists.hackerspaces.org/mailman/listinfo/discuss", "group_id": 868, "id": 195642}, {"user_id": 3019, "stars": [], "topic_id": 8666, "date_created": 1300509864.53351, "message": "Here is a autohotkey script for windows http://www.ustream.tv/forum/showthread.php?504-multiple-cameras&highlight=auto+start", "group_id": 868, "id": 387042}]