[{"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309284643.4968369, "message": "Coming June 2012.", "group_id": 9493, "id": 1507918}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309284609.819876, "message": "Trailer! Watch in 1080p: http://www.youtube.com/watch?v=tYg0VgPy6Uk", "group_id": 9493, "id": 1507915}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309296262.205296, "message": "Part of me dies inside every time I'm reminded that this year's Pixar film is Cars 2. :(", "group_id": 9493, "id": 1511482}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309331936.436486, "message": "Hmm?  I only read the Ebert review, and he loved it.", "group_id": 9493, "id": 1515435}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309330108.463907, "message": "Why?  I thought it's suppose to be quite good.", "group_id": 9493, "id": 1515366}, {"user_id": 32282, "stars": [], "topic_id": 40641, "date_created": 1309333021.2493949, "message": "Oh well, at leasr Transformers 3 is out. That's good amirite?", "group_id": 9493, "id": 1515502}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309331114.7777491, "message": "Don't.", "group_id": 9493, "id": 1515392}, {"user_id": 32282, "stars": [], "topic_id": 40641, "date_created": 1309332988.1723959, "message": "I think it's Pixar's first ever rotten film on Rotten Tomatoes. I didn't hate Cars, but it's far from a favourite of mine and just about the last Pixar film I thought needed (deserved) a sequel.", "group_id": 9493, "id": 1515498}, {"user_id": 35612, "stars": [], "topic_id": 40641, "date_created": 1309336497.790983, "message": "I hated Cars 1. Will stay miles away from Cars 2.", "group_id": 9493, "id": 1515717}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309338009.1501269, "message": "Oh, sorry, I thought you were being facetious, Mr_V, as I had to assume you'd seen this make the very top of Reddit yesterday:\n\nhttp://i.imgur.com/9FuaF.png", "group_id": 9493, "id": 1515807}, {"user_id": 35612, "stars": [], "topic_id": 40641, "date_created": 1309341493.634331, "message": "For me Wall-E's first half was the best. Toy Story 3 was one of the best movies of last year for me. I wasn't much of a fan of Toy Story 2. Still, The Incredibles remains my favourite Pixar movie.", "group_id": 9493, "id": 1516018}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309341016.163151, "message": "Actually, those scores really are a bit out of whack, aren't they?  Instead of hovering in the high 90s and then a precipitous decline, there should be a gentle decline throughout.\n\nToy Story was a classic, in no small part due to Whedon's script.  The other films up to and including Nemo were also, in my opinion, great.  The Incredibles was the first film that made me wonder whether they'd lost it a bit…  It was okay, but otherwise not much better than your typical 3-star family viewing.  Cars and Ratatouille followed suit, Wall-E was *way* overhyped… and Up was just plain mediocre, as was Toy Story 3.", "group_id": 9493, "id": 1515996}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309340494.202723, "message": "Err… oh, no, I have.  It was pretty forgettable, actually.  99%?!", "group_id": 9493, "id": 1515950}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309340475.3061509, "message": "No, I hadn't seen that.  In fact I didn't know much about it at all apart from reading Ebert's review, since I follow him on Twitter.  Oh well.\n\n(That reminds me, I haven't seen Toy Story 3 yet.)", "group_id": 9493, "id": 1515949}, {"user_id": 31852, "stars": [], "topic_id": 40641, "date_created": 1309341878.7379329, "message": "Eh, I did not just find Wall-E to be one of the best animated movies I'd ever seen, but one of the best *films*, period. And The Incredibles would be my first runner-up for best Pixar movie.", "group_id": 9493, "id": 1516040}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309344996.916605, "message": "@ZAnimus A lot of people say that about Wall-E.  In fact, before I'd seen it I'd even heard it favourably compared to 2001.  Then I watched it and I was like… What?  THIS?!", "group_id": 9493, "id": 1516218}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309345279.17239, "message": "You know what was fan-tas-tic?  “Presto”, the short that accompanied Wall-E.  Proof positive that Pixar animators play Portal.", "group_id": 9493, "id": 1516222}, {"user_id": 32282, "stars": [], "topic_id": 40641, "date_created": 1309347242.3497939, "message": "I liked the stark poetry of the first half of Wall-e, which was pretty groundbreaking for a Hollywood cartoon; the second half with the fat people and the preachy environmentalism, not so much. \nThe Incredibles is probably the best film ever made about a mid-life crisis and my favourite of the lot. I didn't like UP the first time I saw it but it has a lot of heart and depth, which really shone through on the second viewing for me. \nMy least favourite is probably Monster Inc - a bit too much treacle for my taste.", "group_id": 9493, "id": 1516292}, {"user_id": 31753, "stars": [], "topic_id": 40641, "date_created": 1309350077.9051039, "message": "I see there's rumours going around that they're working on Toy Story 4 as well. So next year is a new IP, the year thereafter is a Monsters Inc. sequel, and I wouldn't be surprised to see a sequel to an existing movie again in 2014...", "group_id": 9493, "id": 1516442}, {"user_id": 32692, "stars": [], "topic_id": 40641, "date_created": 1309351323.581486, "message": "Monsters Inc is probably one of my favorites -- otherwise I mostly agree with Incredibles, Wall-E, Up and Finding Nemo being Pixar's best work. I fell asleep during Cars, so there's that.", "group_id": 9493, "id": 1516545}, {"user_id": 31866, "stars": [], "topic_id": 40641, "date_created": 1309356477.652117, "message": "Yep, apart from Cars I have absolutely loved every other Pixar movie. In fact, Cars is the only one I never managed to watched to the end. Ratatouie was probably my favourite along with Wall-E.", "group_id": 9493, "id": 1517005}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309368432.2967861, "message": "Mr_V: Wall-E and The Incredibles are my favourite Pixar films! Heck, like Hermes, I'd say Wall-E is one of my favourite *films*. I agree that people went unnecessarily crazy over Toy Story 3, which was ... good. I enjoyed Up, but there was a lot I didn't like too ... and I wasn't a huge fan of Ratatouille. I do think there is a fair bit of unnecessary Pixar love, but in the larger context of family friendly films, they're geniuses.", "group_id": 9493, "id": 1518707}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309368438.2823889, "message": "Also, Presto was amazing.", "group_id": 9493, "id": 1518713}, {"user_id": 31927, "stars": [], "topic_id": 40641, "date_created": 1309415352.353467, "message": "Actually, in retrospect, the comparison of Wall-E with 2001 might not have been so far out.  I also think 2001 is overrated.\n\n*is struck by lightning*  *dies*", "group_id": 9493, "id": 1526095}, {"user_id": 25703, "stars": [], "topic_id": 40641, "date_created": 1309417890.9701171, "message": "I should probably see that some time.", "group_id": 9493, "id": 1526348}]