[{"user_id": 30884, "stars": [], "topic_id": 38921, "date_created": 1307714163.8072629, "message": "I don't know if  James Bennett or Charles Leifer hang here, but would that discourage the average user from submitting snippets?", "group_id": 81, "id": 1361132}, {"user_id": 30884, "stars": [], "topic_id": 38921, "date_created": 1307713925.22875, "message": "There has been several incidents of spam snippets at the django snippets website. I think it would be a cool idea to force the user to answer a python question before he is allowed to post his snippet. The user account should be blocked for a day before he can retry to submit his snippet again. I'm sure this will stop spammers, unless they are pythonistas.", "group_id": 81, "id": 1361101}, {"user_id": 13325, "stars": [], "topic_id": 38921, "date_created": 1307714416.009367, "message": "You could do something much simpler like, \"Type the number 3\". Answering a python question would be annoying to the general user.", "group_id": 81, "id": 1361166}, {"user_id": 30884, "stars": [], "topic_id": 38921, "date_created": 1307715627.463469, "message": "These spams were actually manually entered into the system by a human, they were not added by a script or robot, so answering simple questions like type \"3\" or even captcha will not stop these sort of spams.", "group_id": 81, "id": 1361301}, {"user_id": 26595, "stars": [{"date_created": 1307982649.379797, "user_id": 30884}], "topic_id": 38921, "date_created": 1307716777.085021, "message": "The questions shouldn't be hard, but can be python: print 3+3, int(\"10\"+\"0\")", "group_id": 81, "id": 1361472}, {"user_id": 6648, "stars": [], "topic_id": 38921, "date_created": 1307887796.7428119, "message": "I think a \"report as spam\" button might be better. A determined spammer might still be able to figure out how to open a python shell.", "group_id": 81, "id": 1374444}, {"user_id": 13325, "stars": [{"date_created": 1307981324.7311649, "user_id": 28384}], "topic_id": 38921, "date_created": 1307979495.2584009, "message": "Can't fool a human. A report as spam button would work much better.", "group_id": 81, "id": 1381283}, {"user_id": 30884, "stars": [], "topic_id": 38921, "date_created": 1307982494.0272479, "message": "@emperorcezar so you're saying the spammer who posted http://djangosnippets.org/snippets/2460/ would actually bother to google a solution to the python question above posted by @hvdklauw just to get his spam message posted?", "group_id": 81, "id": 1381726}, {"user_id": 30884, "stars": [], "topic_id": 38921, "date_created": 1307982586.526824, "message": "I think the issue here is to prevent the spam messages from being posted from the first place rather than find a way to eliminate them after being posted.", "group_id": 81, "id": 1381753}, {"user_id": 13325, "stars": [], "topic_id": 38921, "date_created": 1308068379.9788139, "message": "@meitham Sometimes, yes. It is another layer of deterrent, but you can only take those so far before you create a barrier for legitimate posters. Yes, a legitimate poster could easily figure it out, but even a minor inconvenience is enough to make many people just go do a github gist. If your spam problem is too high, then maybe that's acceptable. That's a judgement call. Sometimes automation isn't the answer.", "group_id": 81, "id": 1392152}, {"user_id": 30035, "stars": [], "topic_id": 38921, "date_created": 1308068158.592267, "message": "@hvdklauw That type of python interpreter question might be more easily mechanized than a captcha, since the python interpreter can answer it. One might need *both*. Captcha to weed out machines, python question to weed out humans. :)", "group_id": 81, "id": 1392126}, {"user_id": 221, "stars": [{"date_created": 1308212800.067997, "user_id": 16762}], "topic_id": 38921, "date_created": 1308198475.7900159, "message": "Hey guys, this was brought to my attention the other day by jezdez and i'm planning on adding a \"report spam\" or some kind of moderation feature so we can get rid of this crap.  I was in jamaica for the last seven days, though, so it prob won't happen until this weekend :D", "group_id": 81, "id": 1407309}, {"user_id": 33725, "stars": [], "topic_id": 38921, "date_created": 1308221946.329006, "message": "The solution I have used in the past is the Akismet api. Through the api you send them the comment/snippets and they tell you if it's spam or ham. You can also mark items specifically after and they seem to learn from it.", "group_id": 81, "id": 1409083}, {"user_id": 221, "stars": [], "topic_id": 38921, "date_created": 1308752823.0426841, "message": "got around to adding a way for users to flag snippets as inappropriate/spam -- you can see it on the snippet detail page if you're logged-in (sidebar)", "group_id": 81, "id": 1457348}]