[{"user_id": 2941, "stars": [], "topic_id": 34726, "date_created": 1305110522.5985651, "message": "So I've been trying to get my old xbox online. . . finally. I tried routing it through my laptop and using the bajillion troubleshooting pages on the xbox site, and sifting through forums to make that work but I can't seem to get it. And while it's hooked to the laptop the connection gets lost every so often. Does anyone have any idea how to make this work?\n\nOr. . . . does anyone happen to have a wireless converter they are selling? I'd obvs opt for the free, albeit frustrating, laptop method. But as that feels like a lost cause right now, a cheap-ish converter seems like the next best. (Router and modem are downstairs, the only way to get to them is to drill holes in the floor/ceiling. . . which isn't completely off the table yet, but might be more trouble than it's worth)", "group_id": 857, "id": 1005539}, {"user_id": 3740, "stars": [], "topic_id": 34726, "date_created": 1305113440.059092, "message": "is it an xbox or an xbox 360?  I can help you with 360, but not original xbox", "group_id": 857, "id": 1006253}, {"user_id": 7219, "stars": [], "topic_id": 34726, "date_created": 1305190370.2013719, "message": "http://www.overclock.net/faqs/107402-how-bridge-your-xbox-your-computer.html", "group_id": 857, "id": 1022511}, {"user_id": 2941, "stars": [], "topic_id": 34726, "date_created": 1305189240.328994, "message": "It's a 360, 4 yrs old. I actually already found an adapter through the FB page. But if you were gonna explain some of the laptop stuff, I'd appreciate knowing a little bit about that as well since me and my add-on technology seem to have short relationships :/ (Don't feel obligated, though, since I have the adapter. Don't want to suck up your time. I can always come back if it stops working--or if I'm silly enough to need help getting the adapter working)\n\nEither way, thanks for getting back so quick. I expected this to be in limbo for a few days.", "group_id": 857, "id": 1022348}, {"user_id": 7219, "stars": [], "topic_id": 34726, "date_created": 1305190451.1418641, "message": "Basically just google Bridging Xbox to Laptop and you will find TONS of guides on how to get online.  I had to do this for the longest time until i just grew tired and dropped the money on an adapter.  Few months later new xbox came out with adapter built in.  little after, moved to college and adapters were worthless.  #winning?", "group_id": 857, "id": 1022525}, {"user_id": 2941, "stars": [], "topic_id": 34726, "date_created": 1305466135.485122, "message": "Thank you! I had no idea it was called bridging. A win for knowing all the ways to connect.", "group_id": 857, "id": 1059705}]