[{"user_id": 11626, "stars": [], "topic_id": 6697, "date_created": 1297909020.284893, "message": "School principals-turned-Inspector Gadgets had their online spy-gear store shuttered after the Daily News exposed their link to the sleuthing market.\r\n\r\nThe city Education Department pulled the plug on its website portal to an I-Spy-type arsenal where principals browsed for hidden cameras to trick out their halls.\r\n\r\nAmong the 45 undercover devices The News found listed on the site, were:\r\n\r\n- A fluffy teddy bear with a built-in camera.\r\n\r\n- A mini-cam fitted electric pencil sharpener.\r\n\r\n- Neckties that double as spy-ties.\r\n\r\nAfter inquiries from The News, the city pulled the spy gear down from its site and the New York Civil Liberties Union blasted the the online bazaar as Big Brother Gone Wild.\r\n\r\n\"When you have 5,000 police in the schools, why on earth do principals feel like they have to do their own crime solving?\" said New York Civil Liberties Union executive director Donna Lieberman.\r\n\r\nThe secret cameras, which appear to violate school rules that forbid taking photos of kids without parental permission, disturbed privacy advocates. Paranoid principals appeared to be using the site, with three schools ponying up $1,700 over two years on covert surveillance gizmos, some as crafty as those favored by James Bond.\r\n\r\nThe principal at the SEEALL Academy in Brooklyn faces a possible investigation for using a $490 hidden camera pencil sharpener. Principal Gary Williams also forked over $330 for a motion detector to guard his office. He declined to comment.\r\n\r\n\"It is strange to have cameras in a pencil sharpener. It makes me wonder why they would need it,\" said Albina Mazzaferro, 37, who has three kids in the school.\r\n\r\nAt Martin Van Buren High School in Queens, the principal purchased a $200 hidden camera Exit Sign after the theft of laptops two years ago, officials said. Principal Marilyn Shevell declined comment, but officials say the sign was never used. \"I'm kind of shocked,\" said one Van Buren teacher.\r\n\r\n\"It means to me that [the principal is] ... spying on ... what are we doing in the hallways and in the classrooms and in the teachers lounge.\"\r\n\r\nAt Foundations Academy in Brooklyn, principal Gary Beidleman said he ordered regular boom boxes and mistakenly got a hidden camera hook up: \"We ordered the boom boxes for [English] classes to be able to play books on tape, for the art class for ballroom dancing,\" he insisted.\r\n\r\nCity Education Department spokeswoman Deidrea Miller said the agency has asked the special commissioner for investigation to look into the spying.\r\n\r\n\"Purchasing hidden cameras would not be an appropriate use of school funds,\" she said. \"We are aware of an allegation that one school is using a device.\"\r\n\r\nSome parents weren't upset that their kids might be under the watchful eye of a hidden camera.\r\n\r\n\"Bosses have cameras on their employees all the time. This is no different,\" said Lauren Devirgilio, 28, the mother of a first-grader at SEEALL.\r\n\r\nhttp://www.nydailynews.com/ny_local/education/2011/02/14/2011-02-14_bosses_practicing_spier_education_ed_dept_yanks_website_for_sleuth_principals.html#ixzz1DyVNsRyw", "group_id": 3920, "id": 128597}]