[{"user_id": 7645, "stars": [], "topic_id": 41825, "date_created": 1310568600.1749909, "message": "Sometimes it does, sometimes it doesn't. It's kind of up to you. Does the relationship grow into a resolution? Or does it dissolve and the inequity still exists?", "group_id": 2515, "id": 1629035}, {"user_id": 30287, "stars": [], "topic_id": 41825, "date_created": 1310568049.6866751, "message": "I don't know why this question never occurred to me before.\n\nIf the MC changes, he substitutes his Problem for his Solution. In that case, the IC remains steadfast, and holds onto his \"Problem\" (which should be thought of as a \"drive\" rather than a \"problem\"). I get all that.\n\nWhat about the SS in that case? Does the Problem get resolved? Does the SS Problem *always* get resolved, and replaced with its Solution? Or are there cases where the SS Problem stays as it is?", "group_id": 2515, "id": 1628963}, {"user_id": 7645, "stars": [], "topic_id": 41825, "date_created": 1310568714.6198859, "message": "Theoretically I think the Subjective Story has its own Goal and Consequences etc. but they aren't addressed in the current version of the software. Ultimately, it's whatever feels right for you as an author.", "group_id": 2515, "id": 1629042}, {"user_id": 7664, "stars": [], "topic_id": 41825, "date_created": 1310581220.614495, "message": "I've always been amazed that the success/failure/change/no change/etc. of the SS doesn't affect how the storyform looks.", "group_id": 2515, "id": 1630635}, {"user_id": 30287, "stars": [], "topic_id": 41825, "date_created": 1310598317.551266, "message": "I had no idea that it didn't matter. That's fascinating!", "group_id": 2515, "id": 1632943}, {"user_id": 13109, "stars": [], "topic_id": 41825, "date_created": 1310603636.854852, "message": "ScreenwritingScreenwriter stated \"If the MC changes, he substitutes his Problem for his Solution. In that case, the IC remains steadfast, and holds onto his \"Problem\" (which should be thought of as a \"drive\" rather than a \"problem\"). I get all that.\". Unfortunately I don't.", "group_id": 2515, "id": 1633615}, {"user_id": 13109, "stars": [], "topic_id": 41825, "date_created": 1310603863.1425741, "message": "I am currently writing a story where the MC is Steadfast.  MC Problem is Faith, MC Solution Disbelief. I understand how that looks in a MC Change story, but can't get my head around what it looks like in a MC Steadfast story like mine.  Could anyone beckoned enough to outline what I should be looking to cover this in my script?  Cheers", "group_id": 2515, "id": 1633645}, {"user_id": 30287, "stars": [], "topic_id": 41825, "date_created": 1310604906.7773719, "message": "If the MC Problem is Faith and he's Steadfast, you don't need his solution. He's going to hang onto that Faith until the end. If it helps, don't think of Faith as his problem; think of it as his drive. He is driven by unwavering Faith. \n\nYour IC, on the other hand, will need to substitute his Problem with his Solution by the end, based on his interactions with the MC.\n\nI dunno, is that helpful?", "group_id": 2515, "id": 1633773}, {"user_id": 7645, "stars": [], "topic_id": 41825, "date_created": 1310605833.313426, "message": "And you can have \"sprinklings\" of the Main Character Solution here and there if you want them to seem less rigid. Throw it in there as a means of challenging their drive.", "group_id": 2515, "id": 1633869}, {"user_id": 33839, "stars": [], "topic_id": 41825, "date_created": 1310607411.37131, "message": "I was trying to think of a good example of MC problem of faith... I agree that if he's steadfast, he doesn't need a solution, but... The Wicker Man came to mind (the original, not that one with Nicolas Cage and \"the bees\", lol).  Sgt. Howie's steadfast faith in Christianity  is exactly what costs him his life.  There just isn't any IC in the story.  \n\nI'm not sure if that would qualify as a personal tragedy - on one hand, he's successful in finding the missing girl, Rowan, but the whole thing is a ruse to use him for sacrifice.  It's certainly not a happy ending (good/good).  It feels more like a personal triumph, thought it costs him his life.", "group_id": 2515, "id": 1634023}, {"user_id": 7664, "stars": [], "topic_id": 41825, "date_created": 1310620034.3022611, "message": "You can also approach it by having the steadfast character motivated to solve their Symptom with their Response. They hound after that until the Problem rights itself through other means.\n\nMy last screenplay had a steadfast MC. His problem was Oppose, and his Symptom was Hinder. He did a lot of Helping, which did little to solve his problem. But his activities in the OS eventually brought about a Success ending, and his Problem of Oppose disappeared.", "group_id": 2515, "id": 1635037}, {"user_id": 13109, "stars": [], "topic_id": 41825, "date_created": 1310644114.266995, "message": "Thanks for all the posts! Slowly getting my head around it - I think.\n\nJust wondering when we are looking at the interaction between the MC and the IC and the elements of the story how they all interact and also how to bring meaning into the MC throughline.\n\nIf the MC is Steadfast, would you not have to at least show the Solution to his Problem (or temptation to his drive as I am now probably trying to see it) otherwise his holding to his Problem wouldn't mean anything?", "group_id": 2515, "id": 1636323}, {"user_id": 13109, "stars": [], "topic_id": 41825, "date_created": 1310644143.15014, "message": "A little bit of research through the templates and I found Braveheart which has a similar storyform to mine. I wanted to check how the MC Solution and MC Problem interacted. \n\nIn defining the solution to his problems in relation to the film, the software states: Reconsider is the Main Character Solution: \n\nWhat is needed to truly satisfy William Wallace's drive: the solution to William Wallace's problems. Illustration of Reconsider as the Solution in \"Braveheart\": \n\nWilliam reconsiders his passivity when Murron is murdered by the English magistrate. And at the end he reconsiders his attitude towards the scottish nobles.\" \n\nAs @JimHull says, \"you can have \"sprinklings\" of the Main Character Solution here and there if you want them to seem less rigid\" seems to be the case with Braveheart.", "group_id": 2515, "id": 1636324}, {"user_id": 7645, "stars": [], "topic_id": 41825, "date_created": 1310659329.758554, "message": "I don't think you have to show his Solution. If you show the Problem, Symptom and Response the audience will instinctively know the 4th item. Remember, we all have the same mind :)", "group_id": 2515, "id": 1638006}, {"user_id": 10814, "stars": [], "topic_id": 41825, "date_created": 1310744284.965802, "message": "The Solution to a steadfast main character is that which would sap the character of his drive (or resolve it in more neutral terms).  So, a character driven by faith would not longer be driven if they became a disbeliever, but a steadfast character holds out against that transition, stays the course, and remains driven.  If the Judgment is Good, then the main character's inequity goes away without the need to change.  If the Judgment is Bad, then the main character's inequity is still in place and the MC feels unsettled/crappy about it.", "group_id": 2515, "id": 1646239}]