[{"user_id": 29596, "stars": [], "topic_id": 35310, "date_created": 1305403350.880708, "message": "I'm wondering who are the mobile app developers around HN, I started doing iOS development 2 years ago and really love what I'm doing, so that is why I'm building @appdk to empower mobile app developers. \n\nBeing in the mobile app dev world for so long, I've work on numerous projects and stumble upon numerous hurdles. iOS development 2 years back and now is an entire new slate. iOS API are mostly well documented nowadays compared to the days of 2008 but still developing mobile apps itself is still a great challenge for many. I love to know what are your personal challenges you face daily at work or with your own project.\n\nLet's get it started!", "group_id": 95, "id": 1054401}, {"user_id": 26065, "stars": [], "topic_id": 35310, "date_created": 1305405573.734828, "message": "Hi @appdk, just signed up, interested in what you guys have to offer. While waiting for my beta invitation I have a question for you: What are your thoughts about solving the mobile chicken and egg problem for location based services, e.g how to get a large enough audience to make it attractive for businesses to be part in your service, and vice versa. I am thinking mobile shopping here primarily. Creating a photo sharing app is not an option :P", "group_id": 95, "id": 1054580}, {"user_id": 29596, "stars": [], "topic_id": 35310, "date_created": 1305662871.042062, "message": "@martin_sunset I think the chicken and egg problem is universal for most mobile apps in general but adding LBS into the picture does make such an app even harder. IMO, even Foursquare whose considered the king of LBS doesn't have the large enough audience.", "group_id": 95, "id": 1087517}, {"user_id": 1781, "stars": [], "topic_id": 35310, "date_created": 1305696581.1457469, "message": "Hi, What do you think about HTML5 as possible solution for mobile app development? Right, it might not solving all the dev issues, yet (http://www.infoworld.com/d/mobile-technology/html5-not-yet-solving-mobile-dev-issues-268). But it seems that in the not-so-long run, it is a good cross platform solution.", "group_id": 95, "id": 1092933}, {"user_id": 24667, "stars": [], "topic_id": 35310, "date_created": 1305703396.6323619, "message": "BlackBerry and iPhone browsers come on top.", "group_id": 95, "id": 1094065}, {"user_id": 24667, "stars": [], "topic_id": 35310, "date_created": 1305703332.78704, "message": "There's such a huge disparity in mobile web development right now. From my experience, the worst implementation of WebKit Core is actually the Android browser.", "group_id": 95, "id": 1094057}]