[{"user_id": 7664, "stars": [], "topic_id": 42904, "date_created": 1311894739.999887, "message": "Not only that, but one of the kids who graduated early has come to count on hand-outs. [Interdiction is bad!]\n\nEtc.", "group_id": 2515, "id": 1743187}, {"user_id": 37168, "stars": [], "topic_id": 42904, "date_created": 1311892226.320179, "message": "Can anyone explain how the Counterpoint functions in terms of the Issue? e.g. Issue of Interdiction, Counterpoint of Prediction", "group_id": 2515, "id": 1743026}, {"user_id": 7664, "stars": [], "topic_id": 42904, "date_created": 1311894719.1312511, "message": "Look at Head Start. The idea is that we can predict these kids will end up poor if we don't do anything about their education. So we inderdict by educating them. [Interdiction is good!]\n\nI know that makes it look like a problem/solution. But you need to add up several more examples to make your point.\n\nLikewise, someone could do a post hoc analysis, and see that Head Start is terribly designed, poorly applies theory, and has no accountability. Anybody who has tried to do something based in science while dealing with Congress, could have predicted this outcome would happen -- and should have done something to head it off (private money?). [Interdiction is good!]\n\nSo, someone, predicting this will go on like this forever, tries to get it de-funded. The congressmen react by funding it indefinitely, cementing the problem. [Interdiction is bad!]", "group_id": 2515, "id": 1743185}, {"user_id": 37168, "stars": [], "topic_id": 42904, "date_created": 1311895519.3724079, "message": "Thanks! These comments -- as well as comments on my other posts -- have been extremely helpful!", "group_id": 2515, "id": 1743229}, {"user_id": 7645, "stars": [], "topic_id": 42904, "date_created": 1311895467.1238451, "message": "I think when it comes to Theme you want to be able to provide a balanced argument. If you just did the Issue it might come off too \"preachy.\"", "group_id": 2515, "id": 1743226}, {"user_id": 7664, "stars": [], "topic_id": 42904, "date_created": 1311897820.190547, "message": "@jimhull I would guess, too, that \"preachy\" stories are no good because people turn off -- audience reception plummets.", "group_id": 2515, "id": 1743388}]