[{"user_id": 22157, "stars": [], "topic_id": 13845, "date_created": 1300479181.0619071, "message": "Dynamic grid layout http://ow.ly/4hdp6 for #SilverStripe, integrates with versioning and workflow. Hope this keeps pace with #SilverStripe3", "group_id": 6946, "id": 385005}, {"user_id": 22631, "stars": [], "topic_id": 13845, "date_created": 1300523050.403764, "message": "Wasn't expecting my tweet to end up here. Very impressed with Page Elements though, impressed on first client outing as well which is always good.", "group_id": 6946, "id": 387295}, {"user_id": 22157, "stars": [], "topic_id": 13845, "date_created": 1300717613.9571199, "message": "I haven't had time to check it out on my own, but I liked what I saw on the site!", "group_id": 6946, "id": 398397}, {"user_id": 22631, "stars": [], "topic_id": 13845, "date_created": 1300790810.7624891, "message": "It works quite well really. And integrates well with the Workflow module. Will be integrating it into the first projects in the next few weeks so will shout some more once that is done.", "group_id": 6946, "id": 406262}, {"user_id": 34934, "stars": [], "topic_id": 13845, "date_created": 1307012410.901263, "message": "That's quite interesting, may look at using this myself", "group_id": 6946, "id": 1265357}, {"user_id": 22631, "stars": [], "topic_id": 13845, "date_created": 1307086318.1427331, "message": "Have been using it on a site. I have two gripes. First, why create an Element Class when decorating the Widget class probably would have been a better way to go. In fact I have had to back port WigetController and Widget Handling into the Element class so that I can use forms in an Element. Second the slot manager really needs to apply style from your elements in a meaningful way so that the user can really see what they are getting in the admin system rather than having to flick back and forth with a staged page.", "group_id": 6946, "id": 1275521}, {"user_id": 22631, "stars": [], "topic_id": 13845, "date_created": 1307086367.4641011, "message": "On the plus side, it does work quite well with versioned Elements. Overall a useful module, but it needs some work.", "group_id": 6946, "id": 1275523}]