[{"user_id": 10406, "stars": [{"date_created": 1311408280.831321, "user_id": 36313}], "topic_id": 42485, "date_created": 1311335328.062259, "message": "Por supuesto, felicidades también a Cursa.me", "group_id": 965, "id": 1697454}, {"user_id": 10406, "stars": [], "topic_id": 42485, "date_created": 1311335238.280509, "message": "Ayer fue la presentación de los ganadores de Wayra Mexico en la Campus Party y quiero aprovechar para felicitar a los emprendedores que participaron y también a aquellos que lograron ser seleccionados http://wayra.org/proyectos-mexico \nCuales son sus opiniones de la competencia? Algunos de ustedes fueron a la CPMX3? Cual fue el factor diferencial que vieron en los proyectos ganadores?", "group_id": 965, "id": 1697448}, {"user_id": 36313, "stars": [], "topic_id": 42485, "date_created": 1311376289.1940811, "message": "Gracias :)", "group_id": 965, "id": 1702156}, {"user_id": 12133, "stars": [], "topic_id": 42485, "date_created": 1311390390.169385, "message": "debe ser por que son los mejores ;)", "group_id": 965, "id": 1703178}, {"user_id": 12133, "stars": [], "topic_id": 42485, "date_created": 1311390401.155869, "message": "o que si tienen un modelo de negocios y un mercado", "group_id": 965, "id": 1703180}, {"user_id": 12133, "stars": [], "topic_id": 42485, "date_created": 1311390377.9380031, "message": "no es por ser aguado, pero siempre ganan los mismos ....", "group_id": 965, "id": 1703177}, {"user_id": 6541, "stars": [], "topic_id": 42485, "date_created": 1311402009.4552341, "message": "@zodman mandaste algo?", "group_id": 965, "id": 1704206}, {"user_id": 26964, "stars": [], "topic_id": 42485, "date_created": 1311402640.410569, "message": "@zodman yo nunca había participado en nada por el estilo, es mas, solo lo había visto con MexicanVC y perdí :P", "group_id": 965, "id": 1704253}, {"user_id": 10406, "stars": [], "topic_id": 42485, "date_created": 1311444939.339323, "message": "@zodman pero parece que ya tienes algo mas solido por que no participaste?  @bcessa  con que proyecto participaste?", "group_id": 965, "id": 1706409}, {"user_id": 10406, "stars": [], "topic_id": 42485, "date_created": 1311446774.784394, "message": "Es cierto que el emprendedor de Rutanet (ganador de Wayra) tambien es emprendedor en Aventones? (tambien ganador de este año) Es posible participar con mas de 1 proyecto y ganar? O es solo señal de que la competencia no era tan reñida?", "group_id": 965, "id": 1706490}, {"user_id": 36313, "stars": [], "topic_id": 42485, "date_created": 1311455185.991133, "message": "@fservin hay que enterarse bien antes de hacer acusaciones, Alberto Padilla es parte de Rutanet, y su empresa de desarrollo ayudó a Aventones, los emprendedores no son los mismos. Y si son dos proyectos que tienen una buena idea, modelo de negocios, y ya están facturando, dudo que la razón por la que ganen es que no hay competencia", "group_id": 965, "id": 1707011}, {"user_id": 26084, "stars": [{"date_created": 1311528419.775625, "user_id": 10406}], "topic_id": 42485, "date_created": 1311467537.940455, "message": "@leonrangel lo que comentas es cierto, pero también es cierto que en México casi no hay competencia, ya sea por que no se animaron, por que no alcanzaron, por mi perro se comió mi proyecto o por X y Y razón.\n\nDe igual manera, eso no demerita el que si el proyecto es genial ¡gane!, para eso son ese tipo de iniciativas para hacer un filtro de entre lo común a lo que tiene potencial.", "group_id": 965, "id": 1707678}, {"user_id": 12133, "stars": [], "topic_id": 42485, "date_created": 1311483956.1693151, "message": "@jyr @fservin no meti norecordlabel.net ya tome la desición que sea bootstrap ademas meterme en iniciativas asi requieren fulltime y por mi trabajo actual el cual me encanta aun no me lanzo a dejarlo. Ademas de que acabo de llegar al DF y me va bien en la oficina haciendo lo que me gusta programando en python :)", "group_id": 965, "id": 1708699}, {"user_id": 36313, "stars": [], "topic_id": 42485, "date_created": 1311487144.165925, "message": "@reymundolopez de acuerdo también contigo, entonces creo que hay que fomentar que quien tenga una idea o proyecto, la presente, lleve a cabo, etc. y no la deje como eso, una idea, no?", "group_id": 965, "id": 1708879}, {"user_id": 10406, "stars": [], "topic_id": 42485, "date_created": 1311527566.0065811, "message": "@leonrangel para nada era mi intención hacer acusaciones, es por eso mi uso del signo de interrogación, para poder aclarar lo que simplemente era una duda trivial. Tenia razon @soska y @cesarsalazar acerca de que hacer controversia ayuda los topics. En tu experiencia, que puedes recomendar para participar en wayra el proximo año? Cual crees que sea los puntos mas importantes de esta competencia? Hubo algo en particular que les costo trabajo o es pan comido?", "group_id": 965, "id": 1710473}]