[{"user_id": 11626, "stars": [], "topic_id": 41059, "date_created": 1309676096.55302, "message": "Welcome to the \"False-Flag Friday\" edition of SCMLA's News Digest!\r\n\r\nA Terror Attack This Weekend? FBI Gearing Up For Possible July Fourth Incident\r\nThe Business Insider\r\nJul. 1, 2011\r\n\r\nThe threat matrix that U.S. intelligence and law enforcement closely monitor to guard against terror attacks has ticked up in recent weeks as groups such as al Qaeda eagerly try to regroup from a series of leadership losses, including the killing of Osama bin Laden, federal officials say. Officials caution that there is no specific, credible threat of an impending attack as Americans head into the Fourth of July holiday, but their growing caution is evidenced by a series of recent bulletins they’ve sent local law enforcement. One bulletin last week disclosed that evidence found in bin Laden’s possession in May, when he was killed by U.S. special forces in Pakistan, indicated an interest in attacking Americans at major holiday gatherings, including Independence Day celebrations.... In past years, some holiday weekends have passed without incident after similar law enforcement warnings. But the increased vigilance comes as the Obama administration overhauled its anti-terror strategy earlier this week—after fresh signs of America’s vulnerabilities surfaced in New York, when a Nigerian man slipped past airport security with a fake ID and boarded a flight.\r\nhttp://www.businessinsider.com/the-fbi-and-us-intelligence-are-gearing-up-for-a-july-fourth-terrorist-attack-after-bin-ladens-death-2011-7\r\n\r\nLaunch Code for U.S. Strategic Nuclear Missiles Was Twelve Zeros Until 1977\r\nCryptogon\r\nJune 30th, 2011\r\n\r\n“But I don’t understand what would be such a big deal if there were a nuclear exchange, only about 500 million people would die…”\r\nhttp://cryptogon.com/?p=23269\r\n\r\nAuthorities Investigate Security Breach At JFK After Man Flies To L.A. Without Ticket Or ID\r\nNigerian National Allegedly Used Univ. Of Michigan ID & Expired Boarding Pass\r\nCBSNewYork\r\nJune 30, 2011\r\n \r\nNEW YORK — How could it happen? The FBI is investigating a major security breach at John F. Kennedy International Airport. Someone boarded a plane with a college ID and a bogus boarding pass her found on a subway train, reports CBS 2’s Hazel Sanchez. What authorities say Nigerian national Olajide Noibi pulled off was thought by many travelers to be impossible. “For what we’ve been going through since 9/11, it’s intolerable,” Astoria resident Nicholas Christopher said. “It’s very scary, especially when there’s thousands of people who travel every day,” added Long Island resident Elana Kaminsky. Law enforcement officials say big mistakes were made on Friday. Noibi passed Transportation Security Administration screening at JFK and boarded Virgin American Flight 415 bound for Los Angeles, with a University of Michigan ID and with an expired boarding pass that belonged to someone else. “That’s not great at all because then anybody can go through it,” traveler Julian Zapata said. New York Congressman Peter King, Chairman of the Homeland Security Committee, is calling for an internal investigation. He said we’re lucky this doesn’t appear to be a terror plot.\r\nhttp://newyork.cbslocal.com/2011/06/30/authorities-investigate-security-breach-at-jfk-airport-after-man-flies-to-los-angeles-without-ticket\r\n\r\nU.S. terror fight to focus on \"surgical\" hits\r\nCBS News\r\nJune 30, 2011\r\n\r\nWASHINGTON - The United States will push ahead with more targeted drone strikes and special operations raids and fewer costly land battles like Iraq and Afghanistan in the continuing war against al Qaeda, according to a new national counterterrorism strategy unveiled Wednesday. The doctrine, two years in the making, comes in the wake of the successful special operations raid that killed al Qaeda chief Osama bin Laden in May, and a week after President Obama's announcement that U.S. troops will begin leaving Afghanistan this summer. The document is a purposeful departure from the Bush administration's global war on terror. The worldwide hunt for terrorists that began after the Sept. 11, 2001, attacks focused first on Afghanistan, and small numbers of al Qaeda are still active there. White House counterterrorism chief John Brennan said the reworked doctrine acknowledges the growing threat of terrorism at home, including al Qaeda attempts to recruit and attack inside the United States. Brennan told a Washington audience Wednesday that more resources would be spent on the fight at home to spot would-be militants and their recruiters, and the U.S. would resist al Qaeda's attempts to bleed it economically by drawing it into costly invasions overseas. \"Our best offense won't always be deploying large armies abroad, but delivering targeted, surgical pressure to the groups that threaten us,\" Brennan said at the Johns Hopkins School of Advanced International Studies.\r\nhttp://www.cbsnews.com/stories/2011/06/30/national/main20075669.shtml\r\n\r\nWorld’s Biggest Cyber Threat?\r\nThe Diplomat\r\nJune 30, 2011\r\n\r\nWhen it comes to threats in cyberspace, conventional wisdom and expert commentary assign the number one slot to the country with the most failed operations. A failed operation is defined within the intelligence agencies of most countries as a compromised operation, i.e., one whose existence was discovered. It's important to note that the attribution of any specific country to any specific attack is an untrustworthy mix of art and science based upon IP address, who was victimized, technical evidence in the code, and what 'feels right' to the person or team investigating. Based upon this formula, China has been ceded the top position as the number 1 cyber threat in the world. Instead, I propose that you put aside the marketing hype, the questionable attribution methods, and the upside-down formula of # of failed ops = greatest threat and re-evaluate the cyber threat landscape through a more rational lens. To that end, and in the hopes of stimulating some informed discussion on the topic, here are seven reasons why the Russian Federation should replace China as the world's most dangerous cyber adversary....\r\nhttp://the-diplomat.com/china-power/2011/06/30/worlds-biggest-cyber-threat\r\n\r\nU.S. recognizes Muslim Brotherhood\r\nPolitico\r\n6/30/11\r\n\r\nThe U.S. has decided to formally resume contact with Egypt’s Muslim Brotherhood group - which does not recognize Israel – in a move that could further alienate some Jewish voters already skeptical of President Barack Obama, it was reported. One senior U.S. official said the Brotherhood’s rise in political prominence after the forced departure of former President Hosni Mubarak earlier this year makes the American contact necessary. The political landscape in Egypt has changed, and is changing… It is in our interests to engage with all of the parties that are competing for parliament or the presidency,” said the official, who confirmed the news to Reuters on condition of anonymity.\r\nhttp://www.politico.com/news/stories/0611/58094.html\r\n\r\nMissouri River Levee Fails in Southwest Iowa\r\nWOI TV\r\nJune 30, 2011\r\n\r\nPERCIVAL, Iowa -- Authorities are reporting that a Missouri River levee has failed near Percival in southwest Iowa. The National Weather Service says the breach occurred Thursday morning a mile northwest of Percival in Fremont County. Local emergency officials told the weather service that the breach is expected to flood only previously evacuated areas between Interstate 29 and the river. Percival sits just east of the interstate. National Weather Service forecaster Josh Boustead says the breach was discovered after the river level downstream at Nebraska City dropped about 6 inches this morning to 27.6 feet. The breach occurred shortly before 4 a.m. Boustead says the breach was roughly 100-to-150-feet-wide Thursday morning. Percival is about 16 miles northwest of Hamburg, which had to build a secondary levee earlier this month after earlier breaches.\r\nhttp://www.woi-tv.com/story/15004433/missouri-river-levee-fails-in-southwest-iowa\r\n\r\nThe U.S. Government Is Establishing Procedures for a Procurement Ban against Firms that Sell Iran Technology to Disrupt Communications but Has Not Identified Any Firms\r\nGAO-11-706R\r\nJune 30, 2011\r\n\r\nThe U.S. government is establishing procedures to implement the procurement ban, such as issuing an interim rule to federal agencies prohibiting procurement from firms that export sensitive technology to Iran. However, as of June 24, 2011, the U.S. government had identified no entities subject to this ban. Moreover, based on our review of credible open source information, we did not identify any firms that export technologies to the Iranian government for monitoring, filtering, and disrupting information and communications flows. There are several possible reasons for the difficulty in identifying any such firms, including (1) the competitive and proprietary nature of the communication industry limits information, if any, reported in open sources and (2) the lack of a clear distinction between technology exported to Iran to disrupt the free flow of information versus technology exported to Iran to support necessary and acceptable filtering and monitoring of communication. In addition, Iran's growing capacity to develop its own monitoring, filtering, and disrupting technology suggests it is relying less on non-Iranian technology to monitor and filter internal communications. We are making no recommendations in this report.\r\nhttp://www.gao.gov/products/GAO-11-706R\r\n\r\nSomeone Tell Obama’s Counterterrorism Crew About the Internet\r\nWired's Danger Room\r\nJune 30, 2011\r\n\r\nThe Obama White House’s new strategy to cripple al-Qaida vows to fight the terrorist network everywhere it operates. As long as it’s IRL. To read the strategy unveiled Wednesday by counterterrorism adviser John Brennan (.pdf) is to view a pledge to send armed drones and special operations forces from Pakistan to Yemen to Somalia to the Sahel. It’s obsessed with physical safe havens for terrorists in places from “northern Mali” to Mauritania. But it has practically nothing to say about one of the most important places al-Qaida inspires new adherents and spreads its propaganda: the internet.... Osama bin Laden’s couriers used thumb drives to blast out e-mails to the network from Pakistani internet cafes. Its loyalists hang out and debate on message boards, where they make grandiose boasts of future attacks that U.S. law enforcement takes seriously. The organization is even trying to recruit new terrorists through Facebook. Any minute now, it’ll probably get a Google+ invite.\r\nhttp://www.wired.com/dangerroom/2011/06/internet-mia\r\n\r\nNapolitano, Europeans Warn al-Qaeda May Get Libyan Weapons\r\nInfowars.com\r\nJune 30, 2011\r\n\r\nHomeland Security boss Janet Napolitano teamed up with her European counterparts and discussed how to prevent the transfer, according to the Egyptian Gazette.... The meeting represents yet another instance of hypocrisy for the sake of anti-Gaddafi propaganda. The terror group named after a Mujahideen database in Libya has received support from Europe since the mid-1990s. Britain’s MI6 supported Libya’s Islamic Fighting Group, at the time connected to al-Qaeda, in an effort of assassinate Col. Gaddafi in 1996. The revelation appeared in Forbidden Truth, a book published in America by two French intelligence experts. The corporate media in the United States has all but ignored the fact the al-Qaeda and the U.S. and NATO are on the same side in the engineered overthrow of Gaddafi, who has refused to play by rules dictated by the bankers, the IMF and the World Bank.\r\nhttp://www.infowars.com/napolitano-europeans-warn-al-qaeda-may-get-libyan-weapons\r\n\r\nGreece: This is What an IMF Riot Looks Like\r\nInfowars.com\r\nJune 30, 2011\r\n\r\nWhen the IMF eliminated food and fuel subsidies for the poor in Indonesia in 1998, the people went into the streets and rioted. After the banksters jacked up water prices in Bolivia, a series of IMF riots broke out. There were riots in Ecuador over the rise in cooking gas prices imposed by the World Bank. According to former chief economist at the World Bank, Joseph Stiglitz, the IMF and World Bank meticulously plot these riots. It’s all part of the plan. Greece is being gutted economically so the banksters and transnational corporations can rush in and buy assets and resources for pennies on the dollar. In 2008, as the engineered subprime mess began to roll and threaten economies, then IMF boss Strauss-Kahn (since disgraced and forced to resign) predicted advanced countries would ultimately experience what Greece is going through right now.\r\nhttp://www.infowars.com/greece-this-is-what-an-imf-riot-looks-like\r\n\r\nTop Obama Advisor: Homeland is “Primary” Focus of Counterterrorism\r\nActivist Post\r\nJune 30, 2011\r\n\r\nThe Huffington Post is reporting that the White House is set to release their new counterterrorism strategy on the White House website.  In a press conference Tuesday, deputy national security advisor for Homeland Security and counterterrorism, John Brennan, outlined some of the details: ‘This is the first counterterrorism strategy that focuses on the ability of al Qaeda and its network to inspire people in the United States to attack us from within,’ he said in a speech at Johns Hopkins University’s School of Advanced International Studies. ‘Indeed, this is the first counterterrorism strategy that designates the homeland as a primary area of emphasis in our counterterrorism efforts.’ These statements alone seem to indicate that Americans can expect more domestic surveillance, warrantless wiretapping, citizen spy programs and other guilty-until-proven innocent violations of their rights. In a chest-thumping admission, Brennan said they’ll use a “relentless campaign that harnesses every element of American power” to fight the war on terror. In other words, it seems the full power of the American war machine will be turned inward to monitor and respond to Al Qaeda’s “affiliates and its adherents” on American soil.\r\nhttp://www.infowars.com/top-obama-advisor-homeland-is-“primary”-focus-of-counterterrorism\r\n\r\nIs The Mainstream Media Covering Up The Truth At Los Alamos, Ft. Calhoun And Fukushima?\r\nThe American Dream\r\nJune 30, 2011\r\n\r\nWhat in the world is really going on at Los Alamos, Ft. Calhoun and Fukushima?  There are millions of Americans that would like the truth about what is happening at these nuclear facilities, but the mainstream media has been strangely quiet.  Instead, the mainstream media is running headlines such as “10 Dirtiest U.S. Beaches Named” and “Pole Dance Stops Times Square Cold”.  Yes, those are actually headlines that appeared on the front pages of major mainstream news websites in the United States today.  Sadly, you really have to dig to find anything about the problems that are currently happening at nuclear facilities in the United States, and the mainstream media seems to have gotten really tired of talking about Fukushima.  It is almost as if the mainstream media actually prefers to talk about mindless things rather than focus on the truly important events that are happening all around us. Look, most of us are not nuclear experts, but when one of our nuclear plants is completely surrounded by flood waters and another one is being seriously threatened by a raging wildfire we have a right to be concerned. Sadly, the coverage by the mainstream media has been so sparse that the majority of Americans don’t even know that there are problems at Los Alamos and Ft. Calhoun. Most Americans also don’t understand how serious the Fukushima disaster really is.\r\nhttp://endoftheamericandream.com/archives/is-the-mainstream-media-covering-up-the-truth-at-los-alamos-ft-calhoun-and-fukushima\r\n\r\nSaudi Arabia Vows To Get Nukes If Iran Acquires Them\r\nNewsBad\r\nJune 30, 2011\r\n\r\nSAUDI ARABIA – A senior Saudi Arabian diplomat and member of the ruling royal family has raised the specter of nuclear conflict in the Middle East if Iran comes close to developing a nuclear weapon. Prince Turki al-Faisal, a former Saudi intelligence chief and ambassador to Washington, warned senior NATO military officials that the existence of such a device “would compel Saudi Arabia … to pursue policies which could lead to untold and possibly dramatic consequences.” He did not state explicitly what these policies would be, but a senior official in Riyadh who is close to the prince said yesterday his message was clear. “We cannot live in a situation where Iran has nuclear weapons and we don’t. It’s as simple as that,” the official said. “If Iran develops a nuclear weapon, that will be unacceptable to us and we will have to follow suit.” Officials in Riyadh said that Saudi Arabia would reluctantly push ahead with its own civilian nuclear program. Peaceful use of nuclear power, Turki said, was the right of all nations. Turki was speaking earlier this month at an unpublicized meeting at RAF Molesworth, the airbase in Cambridgeshire used by NATO as a centre for gathering and collating intelligence on the Middle East and the Mediterranean. According to a transcript of his speech obtained by the Guardian, Turki told his audience that Iran was a “paper tiger with steel claws” that was “meddling and destabilizing” across the region. “Iran … is very sensitive about other countries meddling in its affairs. But it should treat others like it expects to be treated. The kingdom expects Iran to practice what it preaches,” Turki said. Turki holds no official post in Saudi Arabia but is seen as an ambassador at large for the kingdom and a potential future foreign minister. –Guardian UK\r\nhttp://www.newsbad.com/story/saudi-arabia-vows-get-nukes-if-iran-acquires-them\r\n\r\nTeaching jihad in Indonesian prisons\r\nAssociated Press\r\nJun 30, 2011\r\n\r\nPORONG PRISON, Indonesia – A sweeping crackdown on terrorism in the past decade has spawned a new problem in Indonesia, the world's most populous Muslim nation: Militants in jail are recruiting new followers to their cause. Prisons threaten to undermine the progress made against terrorism here since 2002, when nightclub bombings killed 202 people on the tourist island of Bali, many of them Australians and Americans. The campaign has assumed global importance because of feared links between Southeast Asian terrorist groups and al-Qaida. That possibility was underlined by the January arrest of Bali bombing suspect Umar Patek in Abbottabad, the same Pakistani town where Osama bin Laden was killed in May. The Associated Press was granted two days of unfettered access to Porong prison in early June by the chief warden, who wanted to show that changes were being made to limit the influence of jihadist inmates. While there were improvements, interviews with terrorists and other convicts show how openly the former still court some of the latter.\r\nhttp://old.news.yahoo.com/s/ap/20110630/ap_on_re_as/as_terrorism_jihad_in_prison\r\n\r\nTaliban commandos stage siege at Kabul Intercontinental hotel\r\nThe Telegraph\r\n29 Jun 2011\r\n\r\nThe first attacker blew himself up at the hotel entrance, blasting a way through the tight security around one of Kabul's leading hotels. Behind him, five more gunmen, some wearing suicide jackets and others armed with rocket-propelled grenades, swarmed into the lobby of the Intercontinental and began seeking out guests, floor by floor, room by room. At least 10 people were reported killed during a rare night-time raid carried out by the Afghan Taliban, in a well-planned operation that appeared to be modelled on the 2008 Mumbai attacks.\r\nhttp://www.telegraph.co.uk/news/worldnews/asia/afghanistan/8604668/Taliban-commandos-stage-siege-at-Kabul-Intercontinental-hotel.html\r\n\r\nMayor Bloomberg Remixes al-Qaeda Video to Push Gun Control Effort\r\nInfowars.com\r\nJune 29, 2011\r\n\r\nNew York mayor Michael Bloomberg has launched an ad campaign portraying entirely legal gun shows as a venue exploited by terrorists to obtain firearms... [Bloomberg] is exploiting a video featuring Adam Gadahn, said to head up al-Qaeda’s Sahab media wing. Earlier this month, Gadahn, aka Adam Pearlman from California, called for Muslims to buy guns and kill Americans. In the video, Gadahn makes the absurd claim that automatic weapons can be purchased at gun shows. “Criminals already know how to take advantage of gaps in our gun laws, and now Al Qaeda knows, too. Americans, including N.R.A. members, overwhelmingly support stronger laws to keep guns away from terrorists and other dangerous people,” Bloomberg said in a statement. He paid for the ads out of his own pocket. Media buyers estimate he shelled out between $200,000 and$250,000 for the ads, according to the New York Times. Bloomberg’s highly deceptive ad mixes in footage taken by his undercover operatives at gun shows in 2009, thus giving the impression that terrorists are buying fully automatic weapons from legal gun vendors. The ad urges viewers to contact their members of Congress to approve legislation that would further close down the right to purchase and own a firearm without government permission.\r\nhttp://www.infowars.com/mayor-bloomberg-remixes-al-qaeda-video-to-push-gun-control-effort\r\n\r\nQuestions arise over FBI terror profile\r\nAssociated Press\r\nJun 29, 2011\r\n\r\nLONDON – The FBI's most-wanted list features a dated black-and-white photograph for the man wanted in connection with the 1998 U.S. embassy bombings in Tanzania and Kenya. Saif al-Adel, reads the glaring red banner, alias Muhammad Ibrahim Makkawi. But intelligence officials and people who say they know al-Adel and Makkawi tell The Associated Press that they are two different men. In the wake of Osama bin Laden's death, AP reporters around the globe began hunting for fresh details on al-Adel — al-Qaida's so-called third man because of his strategic military experience. Traversing a reporting trail that spanned from Europe to Egypt and from Afghanistan, Pakistan and Iran, a new picture started to emerge about the al-Adel investigation: that the FBI's manhunt dragged in the name of a one-time jihadist turned vocal al-Qaida critic who now can't get his name off the wanted list. Intelligence officials from five countries and a handful of sources who say they knew the men personally over the years confirmed to the AP that al-Adel and Makkawi were two distinct people. Some of those sources came forward with two photographs that show two different men.\r\nhttp://old.news.yahoo.com/s/ap/20110629/ap_on_re_eu/eu_terrorism_the_real_makkawi\r\n\r\nUS refocuses on home-grown terror threat\r\nAFP\r\nJun 29, 2011\r\n\r\nWASHINGTON (AFP) – The United States vowed Wednesday to pursue the \"utter destruction\" of Al-Qaeda, while refocusing its counter-terrorism strategy to combat the threat of home-grown terror. The new strategy comes on the 10th year of the US-led \"war on terror,\" launched by former president George W. Bush after the deadly September 11 attacks on the United States. It is a \"pragmatic, not ideological\" approach to counterterrorism that \"formalizes\" the administration's approach since January 2009, said John Brennan, President Barack Obama's top counterterrorism advisor. The new strategy, developed after US commandos killed Osama bin Laden on May 2 in Pakistan, also reflects \"the extraordinary political changes\" sweeping the Middle East and North Africa, Brennan said. \"This is the first counterterrorism strategy that designates the homeland as a primary area of emphasis in our counterterrorism efforts,\" said Brennan, who is also deputy national security adviser for homeland security. The principal focus is \"Al-Qaeda, its affiliates and its adherents,\" said Brennan, speaking at the Johns Hopkins School of Advanced International Studies in Washington. \"We aim to render the heart of Al-Qaeda incapable of launching attacks against our homeland, our citizens, or our allies, as well as preventing the group from inspiring its affiliates and adherents to do so,\" he said. \"This is a war -- a broad, sustained, integrated and relentless campaign that harnesses every element of American power,\" he said. \"And we seek nothing less than the utter destruction of this evil that calls itself Al-Qaeda.\"\r\nhttp://old.news.yahoo.com/s/afp/20110629/pl_afp/usattacksqaedabrennan\r\n\r\nLong Island Officials Warn Of Rapidly Spreading Whooping Cough Virus\r\nAt Least 40 People In Suffolk, Mostly Children, Diagnosed With Pertussis\r\nCBS New York\r\nJune 29, 2011\r\n\r\nSMITHTOWN, N.Y. (CBSNewYork) — A cluster of whooping cough is growing on Long Island, with dozens of people infected by the virus. As CBS 2’s Hazel Sanchez reports, a warning was sent out as children begin to head to summer camp – a certain breeding ground for the illness. Parents in Smithtown are on high alert, as the highly contagious whooping cough is spreading through their community. “It’s one of those diseases you don’t think you’ll ever hear about again,” parent Rick Vollkommer said.\r\nhttp://newyork.cbslocal.com/2011/06/29/long-island-officials-warn-of-rapidly-spreading-whooping-cough-virus\r\n\r\nGovernment: No known terror threat tied to July 4\r\nAssociated Press\r\nJun 28, 2011\r\n\r\nWASHINGTON – U.S. intelligence officials say there is no specific or credible information that terrorists intend to strike over the upcoming holiday weekend. Documents found in Osama bin Laden's home show that, as recently as February 2010, al-Qaida was considering plots against the U.S. during major holidays, including Independence Day. Bin Laden was killed in a U.S. military operation in May. A joint FBI and Homeland Security Department intelligence bulletin, obtained by The Associated Press, shows that counterterrorism officials remain concerned that terrorists will target large gatherings in urban areas across the U.S. Yet they have no specific intelligence about an attack tied to the July 4 holiday. Counterterrorism officials say the driving factor for the timing of attacks is whether the operatives are ready to carry out the plan.\r\nhttp://old.news.yahoo.com/s/ap/20110628/ap_on_re_us/us_independence_day_threats\r\n\r\nNYPD beefs up hotel security after Afghan bombing\r\nAssociated Press\r\nJun 28, 2011\r\n\r\nNEW YORK – The New York Police Department is stepping up counter-terrorism measures at hotels in the wake of a terrorist attack in Afghanistan. Police spokesman Paul Browne says the move wasn't prompted by a specific threat in the city. But the nation's biggest police department is taking no chances as it learns more about the attack on Kabul's Inter-Continental Hotel, which is frequented by foreigners. Insurgents attacked the hotel with suicide bombers, machine guns and rocket-propelled grenades late Tuesday Kabul time. Two NATO helicopters later fired rockets that killed gunmen on the rooftop of the hotel. The Taliban claimed responsibility for the attack, which comes nearly a week after President Barack Obama announced he would end the American combat role in Afghanistan by the end of 2014.\r\nhttp://old.news.yahoo.com/s/ap/20110628/ap_on_re_us/us_nypd_hotel_security\r\n\r\nSuspect in DC building shootings out of Marines\r\nAssociated Press\r\nJun 28, 2011\r\n\r\nWASHINGTON – The Marines Corps says it has dismissed a reservist charged in a series of pre-dawn shootings at the Pentagon and other military buildings. The Marines on Tuesday completed the process of separating 22-year-old Yonathan Melaku, a lance corporal, from the Corps. The Corps says Melaku did not contest the proceeding. The Marines began the process this month after Melaku was charged with grand larceny in an unrelated case. Melaku was arrested after he was caught trespassing inside Arlington National Cemetery after dark. Police say he had with him bomb-making materials. The Marines say the shooting charges and Melaku's arrest at the cemetery had no bearing on their decision to kick him out.\r\nhttp://old.news.yahoo.com/s/ap/20110628/ap_on_re_us/us_military_buildings_shootings", "group_id": 3920, "id": 1551135}]