[{"user_id": 18795, "stars": [], "topic_id": 41140, "date_created": 1309831357.5594611, "message": "I'd like to set up some initial questions to lay the groundwork...", "group_id": 97, "id": 1563761}, {"user_id": 30354, "stars": [], "topic_id": 41140, "date_created": 1309833009.0947909, "message": "What don't you like (people will faff around telling you what they love, much easier to avoid stuff than to do everything they love), why don't you like what you already have, do you need any new features? I mean if they want their site re-done they probably already know what they want to change.", "group_id": 97, "id": 1563958}, {"user_id": 37070, "stars": [{"date_created": 1309881137.876451, "user_id": 15438}, {"date_created": 1310716947.4929769, "user_id": 23707}], "topic_id": 41140, "date_created": 1309875989.51263, "message": "I'd ask business questions first:\n\nWhat's the purpose/goal of the website? (Technical business goal, such as increase sales through the website, promote specific brand(s), have accessible information about the company etc.)\nWho do you see using it? (Examples of individuals)\nWhat do you want people to accomplish using the site? (Specific actions, including learning/getting information etc.)\n\nYou'll be surprised how many companies do not have answers to these questions. Based on the answers, look at the website and use your judgement to see whether it remotely does the job. \nIf not (and many times it doesn't), the redesign will turn into a brand new design with a new strategy in mind, in which case it doesn't matter that they're having troubles updating banners on the front page and want a better implementation for that. \n\nif the current site meets the business goals and needs a few tweaks, then you can ask what they don't like. make sure you take a note of what they do like and keep that in mind as well (pay attention, they may like something because they learnt how to use it long time ago, so if you can make it better - propose it).", "group_id": 97, "id": 1567291}, {"user_id": 30354, "stars": [], "topic_id": 41140, "date_created": 1309878920.0265679, "message": "What @olgavolkova said is a lot better than my 3am going-to-bed-now jabber :D", "group_id": 97, "id": 1567674}, {"user_id": 18795, "stars": [], "topic_id": 41140, "date_created": 1309921831.9403069, "message": "thanks.", "group_id": 97, "id": 1572734}, {"user_id": 9389, "stars": [], "topic_id": 41140, "date_created": 1309932693.9783139, "message": "Outside of defining the scope of the project, the most important question you can ask will be along the lines of \"Can you please sign this contract before I begin work?\"", "group_id": 97, "id": 1573593}]