[{"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300432783.145287, "message": "Which do you prefer for indentation? I prefer tabs because it gives every developer the option to set the tab width in their IDE to their own preference. Instead of enforcing a standard width of spaces.", "group_id": 499, "id": 380333}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300432891.135592, "message": "For indenting in between words I prefer spaces above tabs, to allow everything to line up right, and because it makes to sens to have a prefered in between width of space there.", "group_id": 499, "id": 380336}, {"user_id": 9636, "stars": [], "topic_id": 13744, "date_created": 1300440509.977628, "message": "I prefer spaces to \"build a clean code layout\". But i also think, it depends on which project you are working. You should follow it's coding standards.", "group_id": 499, "id": 380891}, {"user_id": 1548, "stars": [], "topic_id": 13744, "date_created": 1300465791.4869981, "message": "It should always be tabs, there really is no argument. To \"build a clean code layout\" with spaces is only \"clean\" in the eyes of the developer who chose the number of spaces per indentation level. Different developers prefer different levels and it's only fair to allow them to chose what that level is. Providing tabs is the only way to allow this.", "group_id": 499, "id": 383320}, {"user_id": 11991, "stars": [], "topic_id": 13744, "date_created": 1300468159.8231001, "message": "it doesn't matter if you use a good text editor, the problem is when you see mixed tabs with spaces", "group_id": 499, "id": 383774}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300523649.001585, "message": "@AbeEstrada I agree that the problem gets _worse_ when indentation gets mixed up in tabs and spaces. But for readability, imo, it should really be up to the developer to choose what width he/she is comfortable with. Some like 2 spaces, some like 4,6 or 8 spaces.", "group_id": 499, "id": 387333}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300523665.6098809, "message": "By a good text editor, do you mean you will convert the file to tabs? Shouldn't the developer that created the file not already have setup their editor correct in the first place? :)", "group_id": 499, "id": 387334}, {"user_id": 15486, "stars": [], "topic_id": 13744, "date_created": 1300616859.336319, "message": "Always tabs (4 spaces) for indentation, and spaces for alignment. Example, if a build and release a library built this way, and another developer opens the file in his editor, that he has setup to use tabs, but with 3 or 2 spaces, everything will look the way he wants in his editor. If I build my file with 4 spaces instead of tabs, the code will look exactly like in my editor, which he dislikes i suppose ;) I really think tabs are just a better solution.", "group_id": 499, "id": 391679}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300817619.362762, "message": "But I don't understand why there are open source projects for example, where the CGL suggests using spaces instead of tabs. I guess I'd like to hear more reasons not to use tabs for indenting :)", "group_id": 499, "id": 409774}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1300817599.675313, "message": "@strija Nice to see I'm not alone :)", "group_id": 499, "id": 409766}, {"user_id": 1102, "stars": [], "topic_id": 13744, "date_created": 1300824170.240248, "message": "but in the end... stick to your own guns (er, coding standards) http://www.codinghorror.com/blog/2009/04/death-to-the-space-infidels.html", "group_id": 499, "id": 411171}, {"user_id": 1102, "stars": [], "topic_id": 13744, "date_created": 1300824142.2445459, "message": "I like seeing the tab-only arguments, but I've almost always been a space-only type of person. I can see both ways on that. If you look at things like Python (where whitespace matters), spaces are preferred: http://www.python.org/dev/peps/pep-0008/ and also PEAR lands on the side of spaces", "group_id": 499, "id": 411164}, {"user_id": 20667, "stars": [], "topic_id": 13744, "date_created": 1300854137.8992419, "message": "There are so many codings standards in php that I decided to create my own. And I use spaces instead of tabs. At least my code will look good everywhere.", "group_id": 499, "id": 414190}, {"user_id": 15486, "stars": [], "topic_id": 13744, "date_created": 1300869056.2497499, "message": "I think the best way to go (for PHP) is for open source projects, use tabs for indentation, and spaces for alignment; for projects you work with a team of other developers, use whatever you can compromise with the other developers on your team; and for project that you work alone, use whatever you want ;)", "group_id": 499, "id": 415435}, {"user_id": 8430, "stars": [], "topic_id": 13744, "date_created": 1300870003.1219871, "message": "Most PHP coding standards mandate 4 spaces; when in Rome...", "group_id": 499, "id": 415466}, {"user_id": 20229, "stars": [], "topic_id": 13744, "date_created": 1301908148.189127, "message": "we had problems with tabs and cross-platform coding pc/mac and netbeans. So we decided to use spaces here..", "group_id": 499, "id": 521846}, {"user_id": 29669, "stars": [], "topic_id": 13744, "date_created": 1302857097.0687809, "message": "Space is best for version control software like Subversion.", "group_id": 499, "id": 698265}, {"user_id": 3444, "stars": [], "topic_id": 13744, "date_created": 1302884355.991236, "message": "In netbeans you can convert tabs to spaces. I have my tabs set to 3 spaces. It works great and is cross platform compliant. Also works with Subversion.", "group_id": 499, "id": 702058}, {"user_id": 16440, "stars": [], "topic_id": 13744, "date_created": 1302937307.9015751, "message": "Interesting to see so many people going for spaces. I've never had any problems with tabs specifically in git/svn, what kind of trouble do you have? Isn't it just a case of bad software for fe. diffing/merging?", "group_id": 499, "id": 709579}, {"user_id": 23707, "stars": [], "topic_id": 13744, "date_created": 1303726887.011194, "message": "I have always used tabs for Php. I believe in on of the pear standards it says use tab as 4 spaces", "group_id": 499, "id": 802264}]