[{"user_id": 11626, "stars": [], "topic_id": 21578, "date_created": 1303886882.9680171, "message": "http://www.wired.com/dangerroom/2011/04/socom-wants-invisible-commandos/?utm_source=co2hog\r\n\r\n\r\n\r\nSOCOM Wants ‘Invisible’ Commandos\r\nMadhumita Venkataramanan\r\n\r\nWired\r\n\r\nApril 26, 2011\r\n\r\n\r\nYou don’t need to be invisible to carry out clandestine military missions in hostile terrain. But something like it sure helps. That’s why U.S. Special Operations Command is focusing its research and development efforts this year on things like keeping humans’ presence cloaked, of the presence of humans, enhancing night-time feelers, and maintaining an acute sensitivity to information-gathering sensors in the battlefield.\r\n\r\nLisa Sanders, the Deputy Director of Science and Technology at SOCOM lists Special Operation Forces’ top priorities in the months to come as technologies that enhanced commando invisibility on special missions. “Invisible doesn’t mean the Klingon cloaking device,” she tells National Defense magazine, “We operate in environments where we just don’t want to stand out.”\r\n\r\nSo in the pipeline is equipment designed to conceal human heat signatures and visual signals from enemy sensors. To preserve Special Operations’ nocturnal monopoly, their aims also include development of technologies that will enhance night-time operations. Digital technology to sharpen human predatory vision in the dark is a top priority, said Sanders.\r\n\r\n\r\nAnother priority is understanding unfamiliar battle terrain. To make special ops commanders more aware of their environment, SOCOM R&D will focus on creating better sensors, jammers and radar technologies. The algorithms that underlie intelligence sensors will be fine-tuned to increase sensitivity and data-gathering capabilities. In forest settings, a new solution is required to visually penetrate dense plant undergrowth at the ground level, said Sanders.\r\n\r\nSwerving slightly from technologies that streamline stealth and stalking capabilities, another of SOCOM’s short-term research goals is “extended duration incapacitation.” Translation: Sub-lethal injuries that last just long enough to disarm the enemy. An appeal for applied research into this field was extended by the Joint Non-Lethal Weapons Directorate in 2007 and since then a host of less-lethals—including tasers, puke rays and bright lights—have entered the military marketplace.\r\n\r\nSOCOM’s main concern is that their missions often take place among “mixed populations” of civilians and fighters. Something that looks like a baby could turn out to be a gun and vice versa, Sanders tells National Defense. So the commandos are developing a taser-like weapon that would be a little less harmful to the kid.\r\n\r\nStill: Tasing a baby? Maybe they should stick to invisibility, instead.", "group_id": 3920, "id": 822686}]