[{"user_id": 6671, "stars": [{"date_created": 1299708960.4136159, "user_id": 13912}], "topic_id": 11488, "date_created": 1299652788.924978, "message": "Statistically speaking, desktop systems are running Windows XP, and are therefore not running Python at all.  Some smaller number of them are running Snow Leopard, and those are running 2.6. :)", "group_id": 292, "id": 302349}, {"user_id": 5942, "stars": [], "topic_id": 11488, "date_created": 1299654529.6142631, "message": "some guys use Python only for Google App Engine, so maybe 2.5.", "group_id": 292, "id": 302416}, {"user_id": 5942, "stars": [], "topic_id": 11488, "date_created": 1299659173.8566511, "message": "@adsworth , if one is a general Python coder, 2.6 or 2.7 can handle local GAE too. on the other hand, if one is a GAE only user, the tutorial from GAE said Python 2.5.2 is the right version, so.", "group_id": 292, "id": 302694}, {"user_id": 17897, "stars": [], "topic_id": 11488, "date_created": 1299658671.7917261, "message": "@sungiang but the guys who have 2.5 for GAE installed probably also have 2.6.", "group_id": 292, "id": 302666}, {"user_id": 17897, "stars": [], "topic_id": 11488, "date_created": 1299658623.2373321, "message": "@glyph to true about the WinXP thing and packaging an app for Win32 will include Python anyway. SL having 2.6 is good to know. I guess the rest of them are running Ubuntu and that also has 2.6. Debian Lenny still had 2.5 although Squeeze has just been released and that has 2.6.", "group_id": 292, "id": 302662}, {"user_id": 17897, "stars": [], "topic_id": 11488, "date_created": 1299658727.90959, "message": "Windows and MacOS X are pretty simple about versions. My thoughts were more in the direction of the Linux users who still only have 2.5 in their distros repositories.", "group_id": 292, "id": 302671}, {"user_id": 13501, "stars": [], "topic_id": 11488, "date_created": 1299665835.5053091, "message": "always assume the worst... so use hashlib imports...", "group_id": 292, "id": 303424}, {"user_id": 13912, "stars": [], "topic_id": 11488, "date_created": 1299709320.6859479, "message": "even if you take red hat and derivatives out of the equation, even for linux only", "group_id": 292, "id": 309007}, {"user_id": 13912, "stars": [], "topic_id": 11488, "date_created": 1299709158.7882979, "message": "yeah, relying on any one python version is generally a bad idea", "group_id": 292, "id": 308984}, {"user_id": 17897, "stars": [], "topic_id": 11488, "date_created": 1299710180.031554, "message": "the question came up for me whether I want to start using .format for string formatting. That means I would have to rely on 2.6. I'm using % for now so 2.5 is still OK.", "group_id": 292, "id": 309078}, {"user_id": 13912, "stars": [], "topic_id": 11488, "date_created": 1299713356.8734651, "message": "yeah, you can be pretty sure there are people using <2.6, especially red hat users, but that's your choice, what minimum version of python your project will require", "group_id": 292, "id": 309294}, {"user_id": 18972, "stars": [], "topic_id": 11488, "date_created": 1299713410.2567561, "message": "depends on who's desktops.. Enterprises using rhel4 and rhel5 are still both stuck on python 2.4 as their defacto version. :(  This is one reason I suggest people get over using the distro version and bundle their own with their app when possible.", "group_id": 292, "id": 309303}, {"user_id": 5942, "stars": [], "topic_id": 11488, "date_created": 1299725400.2829521, "message": "@gpshead for web dev, maybe. for client script/GUI app, maybe it's a bit of tired to ask user to installing a standalone Python before one can use it.", "group_id": 292, "id": 310205}, {"user_id": 19652, "stars": [], "topic_id": 11488, "date_created": 1299729388.147995, "message": "I think 2.5 will be more reasonable. The Redhat/centos case is pretty bad as  @gpshead pointed out they are stuck on 2.4 and due to support that's not going away for a long time. If i'ts a desktop app Perhaps going back to 2.4 will be the most secure option", "group_id": 292, "id": 310769}, {"user_id": 18972, "stars": [], "topic_id": 11488, "date_created": 1299730200.3941071, "message": "Yeah you never ever want to ask a user to install python x.y themselves for a client app, it needs to be bundled as part of your app (which is not how open source things tend to be released...) for a single \"click\" install.", "group_id": 292, "id": 310823}, {"user_id": 17897, "stars": [], "topic_id": 11488, "date_created": 1299743835.7240911, "message": "@gpshead I'm happy that my app is coming along nicely. I don't even want to try and wrap my head around bundling python with my release. Although I guess I could ask the WingIDE guys for tips. They have their own bundled python.", "group_id": 292, "id": 311718}]