[{"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305092868.7244301, "message": "It's a PDF file and the article starts around page 4", "group_id": 9787, "id": 1002447}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305093378.1696229, "message": "Overall it's an interesting topic. Just the other day a friend of mine shared with me that a girl he is interested in at church told him that God told her that it's not time for them to date yet and I have often wondered if that is a cop out so that the person does not have to actually deal with the situation. Rather say \"God told me\" so that no one can argue with you about it.", "group_id": 9787, "id": 1002534}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305092848.0119231, "message": "I read this article by Greg Kouk the other day on the topic of a \"Conversational Relationship with God\" http://www.str.org/site/DocServer/ESG0511Finalv2.pdf?docID=5421", "group_id": 9787, "id": 1002441}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305093138.264451, "message": "Remember the article is not complete as he says this is part 1 of a possible 3 part series.", "group_id": 9787, "id": 1002492}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305096798.2440121, "message": "Our language as Christians is pretty rife with these kinds of platitudes, I wonder if saying \"God told me\" should not be used with more care, because through observation, it seems that God changes his mind quite a lot. Subjective style Christianity can be damaging to the individual and his witness. Though, a retreat from experiential faith to pure academics is also wrong.", "group_id": 9787, "id": 1003001}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305096949.2339599, "message": "I mean to say that through observing some Christian friends saying \"God told me\" it seems that he changes his mind a lot, as God tells them something different a few weeks or days later. Usually it's accompanied by a phrase similar to \"God told me it's ok to rather...\"", "group_id": 9787, "id": 1003009}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305100519.2860579, "message": "It is interesting to read Hebrews 12 with this article in mind, in verse 25 it says \"see to it that you do not refuse Him who is speaking\". The earlier verses are about making straight paths, etc. which resonates with the article where it speaks about being led by the spirit.", "group_id": 9787, "id": 1003450}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305108000.44682, "message": "Just checked out Hebrews 12. Verse 25 seems to be the point he made as well where it is a listening to salvation?", "group_id": 9787, "id": 1004976}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305106961.402719, "message": "I'm sorry, is there supposed to be something we're meant to read first?", "group_id": 9787, "id": 1004788}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305106992.83391, "message": "oh...wait....I didn't see the first post....never mind", "group_id": 9787, "id": 1004791}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305109882.2399881, "message": "I guess I don't revolve in the right circles because I don't actually understand the issue. But for example Matthew says that the Spirit lead Jesus into the Desert which therefore shows that being lead by the Spirit CAN mean a physical leading to a destination. I agree with a concern when many people claim the God told them to do stuff, especially when 2 weeks later God apparently tells them different. But I believe that God can actually tell people to do stuff. Which is basically what the guy says in his disclaimer section anyway...moving on?", "group_id": 9787, "id": 1005401}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305110617.911607, "message": "@pevans_om That's what I like about you, does not matter what other people understand or how they act on those understandings. Christianity is simple... moving on?", "group_id": 9787, "id": 1005555}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305110852.2428241, "message": "@pevans_om What the piece is getting at is... Does the Bible teach that God speaks to people constantly and directly. Can I pray to Him, sit silently and wait for an answer like I can with any person in front of me? Can every Christian expect this level of communication? How do we deal with those that don't?", "group_id": 9787, "id": 1005612}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305111016.0312581, "message": "Yea, the idea is that EVERYONE can and must reach this level of maturity where God audibly speaks to them, all the time. The fact that God CAN speak in that sense, doesn't mean it's the standard. Also, we need to still find some means of assurance or confirmation of what we think, shouldn't we? We might like to think we can't be deceived, but wow... are we deceived.", "group_id": 9787, "id": 1005664}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305112232.690958, "message": "I don't understand \"but I personally don't see how there can be any issue with saying they're NOT scriptural with it.\"", "group_id": 9787, "id": 1005968}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305112172.6125381, "message": "So, like I said, perhaps there are specific churches teaching that personal communication is the only way and means you're spiritually mature, but I personally don't see how there can be any issue with saying they're NOT scriptural with it.", "group_id": 9787, "id": 1005956}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305111502.2741239, "message": "So...do any of us believe that hearing from God as in conversation is a requirement for Spiritual maturity?", "group_id": 9787, "id": 1005793}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305112060.8834231, "message": "And just so you don't think I don't consider this topic important..... I think that scripture is actually pretty ambiguous about how God communicates with us. You have everything from Angels to burning bushes to tongues of fire to booming sky voices. Each time it's to an individual in a way that best will apply to that individual and situation. I don't think we can ever say God works only one way and if you don't get it like that then sorry you're off the team. Equally we can't easily deny that God might communicate in a specific way to certain people.", "group_id": 9787, "id": 1005931}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305112983.9917991, "message": "The dude that wrote the article has another two coming with more on it and as they come out I will bang it in here.", "group_id": 9787, "id": 1006143}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305112937.115202, "message": "@pevans_om Their might not be in this group (yet) who believe that. But there are churches and Christians that teach that. So how do you refute someone that says the Bible says you should have this ability and if not you're either not in the camp or that the skill can be learnt.", "group_id": 9787, "id": 1006136}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305113498.883992, "message": "i know a few people that try very hard to do faith-ups to build up their maturity muscles so they can hear God like they are supposed to. practice practice practice and then you will hear him like you are supposed to.", "group_id": 9787, "id": 1006273}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1305120860.2584, "message": "@LintonCaldecott It means there is no scriptural basis for claiming that you have to personally hear from God to be a mature Christian", "group_id": 9787, "id": 1007209}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305124943.840384, "message": "@LintonCaldecott do they say why?", "group_id": 9787, "id": 1008220}, {"user_id": 33799, "stars": [], "topic_id": 34707, "date_created": 1305895004.705143, "message": "im not one that 'hears' god and therefore sometimes do feel that people sometimes just say this. but i dont believe its not possible either. have a look at http://www.sparklingadventures.com her and her family have been on a journey spanning several years and iv been reading her blog for a while. they 'unschool' their kids and subsequently 'unchurched' themselves as well. they believe that they are 'following the spirit' and 'listening to what 'The Father' wants them to do' this has lead them to a very bohemian way of life but its interesting non the less.", "group_id": 9787, "id": 1124994}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305896270.202816, "message": "@marcia I just saw this tweet from her: http://twitter.com/#!/Abidjanaise/status/71532931776122880 Not entirely sure what that means?", "group_id": 9787, "id": 1125131}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1305896158.9216549, "message": "@marcia That's pretty hectic. Checking out the site. At the moment I'm opinionless but knowing me, I'll have one soon enough :D", "group_id": 9787, "id": 1125109}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1305897434.9348259, "message": "When my girlfriend refused to take a job in JHB so we could move the relationship on to the \"next step\" it was a death knell for us. I prayed about it and as clear as a bell I heard \"you would be an idiot to let her go\" so I proposed, and now she is my wife... it wasn't a whisper though... so...", "group_id": 9787, "id": 1125367}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1310389578.0736301, "message": "It is interesting to me, cause I agree with a lot of what he is saying. I almost never pray for specific signs when I change jobs etc. I weigh up the pros and cons and determine if it is a good move. Most of the Christians I know almost go through a \"hair raising stress session\" of prayer when making these decision. Pleading with God to confirm their choices.\n\nI'm not sure if it is good or bad but the argument is interesting to me. There have been times that I feel God has specifically directed things, like when deciding to marry Nicole. That again though was more pushed from Nicole's side I think and God \"confirmed\" what she had asked.", "group_id": 9787, "id": 1611643}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1310389354.609961, "message": "Here is part 2 of  Greg Kouk's \"Does God Whisper?\" It starts on page 4. http://www.str.org/site/DocServer/EnhancedSolidGroundFinal_0711.pdf?docID=5582", "group_id": 9787, "id": 1611602}, {"user_id": 13817, "stars": [], "topic_id": 34707, "date_created": 1310389632.6335261, "message": "There is also the Christians that raise my brows when they claim that God told them to do X and then a month later God told them to forget that and rather do Y and so it goes for what seems like forever.", "group_id": 9787, "id": 1611651}, {"user_id": 32900, "stars": [], "topic_id": 34707, "date_created": 1310398389.3446939, "message": "It matters not which way you go. It matters most Who you take with you.", "group_id": 9787, "id": 1613005}, {"user_id": 32888, "stars": [], "topic_id": 34707, "date_created": 1310446173.6026211, "message": "I kind of agree with the earlier sentiment, God can and does guide and speak to us, we are responsible for making sure that we aren't guiding and talking to ourselves. It's a good set of articles to read through though... because the guy is right, many people, myself included at various stages, get pretty depressed because they assume it should be the normal state of affairs, and that as we mature we become better friends with God and he wants to speak to us more.", "group_id": 9787, "id": 1617967}]