[{"user_id": 41763, "stars": [], "topic_id": 46149, "date_created": 1317775482.261764, "message": "I don't have the game running now, but from memory there's some kind of gopher-like creature, and a couple of different types of fish. One that looks like a tadpole.", "group_id": 11772, "id": 2280764}, {"user_id": 41763, "stars": [], "topic_id": 46149, "date_created": 1317775447.3694439, "message": "Post this under \"crazy ideas I'm sure the SE team won't have time for\", but I thought I'd start a topic anyway. I was looking at the tablets in the Moiety Cave the other day and had a look at the drawings on there. (There are 25 I assume, but I could be wrong.) Obviously, five of them are the five creature types we had to encounter in Riven to solve that puzzle. What about the other twenty? I don't recall seeing any other wildlife in Riven besides those five.\n\nIn the same way that realMyst added lots of random wildlife in various places (especially underwater in Stoneship), it would be neat if Starry Expanse had each of those twenty creatures fleshed out into a real model and hidden somewhere in the game. What do you think the creatures are?", "group_id": 11772, "id": 2280760}, {"user_id": 7523, "stars": [{"date_created": 1317780847.6041591, "user_id": 41763}], "topic_id": 46149, "date_created": 1317780482.481236, "message": "@mgiuca \"crazy ideas I'm sure the SE team won't have time for\" - you might be surprised ;)", "group_id": 11772, "id": 2281390}, {"user_id": 38225, "stars": [], "topic_id": 46149, "date_created": 1317792923.68958, "message": "This is something we have discussed, and the inclusion of additional flora and fauna is an interesting prospect. Those animals on the stone tablets would be ones we'd consider creating if we were to do so.\n\nI don't know where I picked this up, but I always thought that the other animals on the tablets had gone extinct due to Rivens slowly collapsing ecosystem, the stone ring itself a sad reminder of Riven as it once was.", "group_id": 11772, "id": 2282665}, {"user_id": 41710, "stars": [], "topic_id": 46149, "date_created": 1317793998.216706, "message": "There are certainly animals other than the ones used in the puzzle. Boiler island in particular has some white dove-like birds that can sometimes be seen.", "group_id": 11772, "id": 2282747}, {"user_id": 41724, "stars": [], "topic_id": 46149, "date_created": 1317841891.722101, "message": "Besides that, bugs can be heard here and there, and tropical sounding birds as well.", "group_id": 11772, "id": 2286453}, {"user_id": 41724, "stars": [], "topic_id": 46149, "date_created": 1317841816.6909921, "message": "Like MYST, Riven has got some seagulls here and there (these might be the dove-like birds Everett_G mentioned)", "group_id": 11772, "id": 2286446}, {"user_id": 7523, "stars": [], "topic_id": 46149, "date_created": 1317848879.428246, "message": "Dried fish can be seen hanging in the village, which I would assume implies the existence of living fish, as well.", "group_id": 11772, "id": 2287118}, {"user_id": 38225, "stars": [{"date_created": 1317883985.049927, "user_id": 41763}], "topic_id": 46149, "date_created": 1317862527.1572599, "message": "Adding anything larger that small birds, insects or small sealife may muddle the Moiety entrance puzzle, as remembering the animals on Riven is part of the solution. We wouldn't want players confusing the sound of the ink beetle with some other insect for example.\n\n@Zib Those fish hanging in the village are one of the five key animals which unlock Tay - so their shape and 'sound' is critical.", "group_id": 11772, "id": 2288575}]