[{"user_id": 26084, "stars": [{"date_created": 1303357437.9944949, "user_id": 26088}, {"date_created": 1303456125.353703, "user_id": 25716}], "topic_id": 20636, "date_created": 1303351040.360342, "message": "Hace tiempo veníamos hablando sobre si utilizas X o Y tecnología y hoy, viendo el IAmA que hizo Joel Spolsky (Joel on Software, StackOverflow) me llama mucho la atención que le preguntan el por que selecciono .NET sobre otras tecnologías.\n\nI don't care about peoples reactions... I care about the productivity of our development team!\n\nAs I said to Jeff when we were starting this project... he and his friends were totally fluent in .NET, so they were way more productive in .NET. Even if .NET were, say, 20% worse than, say, Ruby on Rails (which it isn't, but if it were), they STILL should have chosen it, because they knew it so well. Using another platform would have been a steep learning curve.\n\nAsí que bien sea dicho, Ruby, phyton, Java, PHP, Node.js, etc... ¿es lo que conoces?, ¿eres productivo en ello? entonces esa es la tecnología ideal para tu startup.", "group_id": 965, "id": 764308}, {"user_id": 26084, "stars": [], "topic_id": 20636, "date_created": 1303351060.5128651, "message": "Link: http://www.reddit.com/r/IAmA/comments/gulpx/iama_cofounder_of_stack_exchange_and_fog_creek/", "group_id": 965, "id": 764314}, {"user_id": 12739, "stars": [], "topic_id": 20636, "date_created": 1303352173.9220681, "message": "Amen, es una de las razones por las que defiendo PHP. Puede ser más feo que nada, pero no se puede discutir que es una herramienta que hace su trabajo y lo hace bien.", "group_id": 965, "id": 764520}, {"user_id": 6541, "stars": [{"date_created": 1303361772.2808089, "user_id": 13316}, {"date_created": 1303449764.8344629, "user_id": 15089}], "topic_id": 20636, "date_created": 1303353575.780947, "message": "¿cuanto a que no tarda en veni @zodman y decir? python!!!", "group_id": 965, "id": 764791}, {"user_id": 2946, "stars": [], "topic_id": 20636, "date_created": 1303360627.5232961, "message": "Precisamente hoy discutía con un amigo si hacíamos nuestro side-project en python o ruby (o node!!) para experimentar con otras cosas. Pero llegamos a la conclusión de que con el poquísimo tiempo que le vamos a poder dedicar es mejor trabajar en lo que sabemos que es PHP (yo prefiero Cake y el Zend, lo cual es otro problema :P )", "group_id": 965, "id": 765923}, {"user_id": 15457, "stars": [{"date_created": 1303480112.6613281, "user_id": 12739}], "topic_id": 20636, "date_created": 1303372046.45207, "message": "No hay silver bullets, si solo usas lo que conoces nunca vas a entender otras cosas, si solo usas cosas nuevas nunca vas a llegar a tu maximo de productividad. Todos los proyectos estan en un punto entre esos dos, es importante saber hacia que lado quieres estar en diferentes proyectos, pero pues siempre es una inversion hacia cualquier lado.", "group_id": 965, "id": 767589}, {"user_id": 26084, "stars": [], "topic_id": 20636, "date_created": 1303441766.194737, "message": "@DFectuoso correcto, nada como hacer un proyecto en un lenguaje conocido e ir mejorando el conocimiento de ese lenguaje y crear uno \"just for fun\" con otra tecnologia, al hacerlo a la par, ves las similitudes y aprendes mas.", "group_id": 965, "id": 778185}, {"user_id": 25716, "stars": [], "topic_id": 20636, "date_created": 1303456217.806371, "message": "@reymundolopez very much agree", "group_id": 965, "id": 779663}, {"user_id": 24172, "stars": [{"date_created": 1303498352.593061, "user_id": 20521}], "topic_id": 20636, "date_created": 1303462439.6126339, "message": "Claro, creo que es muy importante saber la razón por la cuál desarrollas un proyecto. Si es porque es tu daily job, entonces no es buena idea utilizar tecnologías que no domines, y si el plan es divertirte mientras lo haces, lo mejor es que sea en algo que tengas muchas ganas de aprender :).", "group_id": 965, "id": 780147}, {"user_id": 15457, "stars": [{"date_created": 1303511482.854265, "user_id": 24172}], "topic_id": 20636, "date_created": 1303495401.218601, "message": "@nRikeDiaz estoy 100% de acuerdo, solo queria agregar que cuando digo que no hay silver bullets es porque aun que sea tu daily job, es posible que usar una tech nueva pueda hacer que el desarrollo sea mas sencillo, o incluso la unica manera de hacerlo. Me imagino si estas haciendo puro php y quieres hacer algo real time, es probable que te interese hacerlo en node, o en scala o en el app engine, o que igual y si puedes hacerlo en php con algun tipo de api como realtime, err, se supone que no puedo hablar de ese proyecto :P, igual vas a tener que aprender algo", "group_id": 965, "id": 783578}]