[{"user_id": 30469, "stars": [], "topic_id": 20844, "date_created": 1303486165.8827641, "message": "I mentioned this collaboration to my advisor, Ben Forget, who is the incoming chair of the ANS Reactor Physics Division. He said that this will definitely be of interest to RPD and that we ought to seek support from them, whether it be financial or otherwise.", "group_id": 9127, "id": 782124}, {"user_id": 10411, "stars": [], "topic_id": 20844, "date_created": 1303497125.257139, "message": "@paul_romano That is really interesting actually.  Even publicity would be helpful, but money is always nice too ;)", "group_id": 9127, "id": 783798}, {"user_id": 10411, "stars": [], "topic_id": 20844, "date_created": 1303497435.1833899, "message": "@sethrj Hah!  I think about this project as building a tool that will help my future self with my research and my job.   (Oh and it happens to help others as well.)  Different people contribute for different reasons, however, and are available for different lengths of time.", "group_id": 9127, "id": 783857}, {"user_id": 30471, "stars": [], "topic_id": 20844, "date_created": 1303497225.577914, "message": "I dunno about you, @scopatz, but I'd rather wrap up my dissertation work and move on to a job than to be a combination long-term grad student and project maintainer... :P", "group_id": 9127, "id": 783824}, {"user_id": 30471, "stars": [], "topic_id": 20844, "date_created": 1303498461.5344999, "message": "@scopatz Oh, I definitely agree with you there. I will be using my tools and such for a long time. I know of a particular instance where a grad student started a big transport project at his university, and ended up being the unofficial maintainer for a whole cadre of students for his nearly ten years in the Ph.D. program. I'm not saying that's bad (he enjoyed what he did and it ended up working out pretty well) but that I wouldn't want to be in that situation.", "group_id": 9127, "id": 783991}, {"user_id": 10421, "stars": [], "topic_id": 20844, "date_created": 1303515111.442323, "message": "@sethrj that's sweet! Now, as far as dissertations are concerned, you may know this already but @scopatz is competing for the world record in 'number of incredibly awesome sideprojects begun while in the final stage of one's dissertation' .", "group_id": 9127, "id": 786110}, {"user_id": 30469, "stars": [], "topic_id": 20844, "date_created": 1303530760.5412719, "message": "@sethrj It's surprisingly easy to fall into the trap of becoming a maintainer of a code you never planned on maintaining (and in my own history, becoming maintainer of a code I didn't even write!). Anyway, I think it's safe to assume that as long as none of us are getting paid to work on this, there will be no expectations/deadlines/etc. We can each contribute at our own leisure.", "group_id": 9127, "id": 787124}, {"user_id": 30471, "stars": [], "topic_id": 20844, "date_created": 1303576449.325593, "message": "@paul_romano Certainly. I was just remarking that getting support from RPD as @scopatz suggested might lead to expectations/deadlines/etc. :P That isn't necessarily bad, but as you clearly understand it can be a slippery slope from there.", "group_id": 9127, "id": 789849}]