[{"user_id": 11626, "stars": [], "topic_id": 7754, "date_created": 1298254670.7622509, "message": "First noted by geopolitical analyst and historian Dr. Webster Tarpley, some suspicious similarities could be seen between the Egyptian unrest and another, known US-backed uprising in Serbia. Serbia’s Otpor, or the “resistance,” was funded to the tune of millions by the US National Endowment for Democracy. Its signature clenched fist logo adorned flags, signboards, and t-shirts carried by the US State Department-laid astro-turf until the ousting of Slobodan Milošević in 2000.\r\n\r\nhttp://static.infowars.com/2011/02/i/rotator/20otpor.jpg\r\nCIA Coup-College: Recycled revolutionary\r\n\r\nThe exact same logo would turn up 11 years later across the Mediterranean Sea in the streets of Cairo, illustrating further the preposterous, foreign-backed nature of the Egyptian uprisings. Could it just be just a coincidence and Dr. Tarpley’s take mere speculative conjecture? Not even close.\r\n\r\nAfter its success, Serbia’s Otpor would continue receiving funds from the West and become a “CIA-coup college” of sorts, under the name CANVAS, or “Center for Applied Non-Violent Action and Strategies.” It appears that after the Egyptian April 6 Youth Movement finished attending the US State Department funded confab in New York City in 2008, it would make a trip to visit CANVAS in 2009. From there, it took CANVAS’s “curriculum” and apparently their logo, and began assembling a US-funded mob in Egypt.\r\n\r\nAmongst CANVAS’s current “partners” are the Albert Einstein Institution, Freedom House, and the International Republican Institute (IRI). The IRI includes amongst its board of directors John McCain, Lindsey Graham, and Brent Scowcroft. When John McCain says “We should have seen this coming,” in regards to the unrest in Egypt, he obviously isn’t talking about himself since he helped make it happen.\r\n\r\nSee with your own eyes, the absolutely shameless hoax foisted upon you, the general public, by your corporate owned mainstream media, the US State Department, and all the disingenuous leaders who have feigned ignorance and surprise over the premeditated and meticulously planned unrest still unfolding throughout the Middle East today, and NEVER believe a word they say again.\r\n\r\nhttp://4.bp.blogspot.com/-DbJ7_ZGER20/TWAE1Hlx2pI/AAAAAAAAALY/k-cgCKo6J0Y/s400/FistWhere.jpg\r\nSerbia’s US National Endowment for Democracy funded “Otpor”\r\n\r\nhttp://4.bp.blogspot.com/-U51i8Q0y8eQ/TWAE01FWQsI/AAAAAAAAALQ/eh1wBqrLV4o/s1600/fistOtporWall2.jpg\r\nSerbia’s “Otpor,” a model for future US-backed color revolutions.\r\n\r\nhttp://3.bp.blogspot.com/-QzlHBWZXEzc/TWAEs8nN-6I/AAAAAAAAALI/pe9KSW7TBKg/s400/fistOtporWall.jpg\r\nSerbia’s “Otpor.”\r\n\r\nhttp://4.bp.blogspot.com/-jM13mNe-Lfk/TWAEsnG_beI/AAAAAAAAALA/P-ltUzSWRDU/s400/FistOtporMob.jpg\r\nSerbia’s “Otpor,” US ready-made mob.\r\n\r\nhttp://1.bp.blogspot.com/-idjX7KbCFwY/TWAEsutQuaI/AAAAAAAAAK4/Qap0ZVWMEXg/s400/FISTOtpor.jpg\r\nSerbia’s “Otpor” or “Resistance.”\r\n\r\nhttp://3.bp.blogspot.com/-LWmAqwHttH0/TWAEsc87J1I/AAAAAAAAAKw/mOK-67bzbJM/s400/fistEgyptStencil.jpg\r\nEgypt’s “April 6 Youth Movement,” note the EXACT same fist logo, most likely brought back from Serbia by April 6 members studying the CANVAS “curriculum.”\r\n\r\nhttp://2.bp.blogspot.com/-EK2ooLmcweE/TWAEsUvGUjI/AAAAAAAAAKo/Mvtth8AHbEY/s400/FistEgyptRecycle.jpg\r\nEgypt’s “April 6 Youth Movement” recycling US-funded revolution “props.”\r\n\r\nhttp://1.bp.blogspot.com/-cXi8C8jljs4/TWAEcnEQpSI/AAAAAAAAAKg/y8Qfkv0lNLY/s400/fistEgyptBanner.jpg\r\nEgypt’s “April 6 Youth Movement” banner with painted in Egyptian flag to give the “Otpor-fist” some local flavor.\r\n\r\nhttp://3.bp.blogspot.com/-ZqtFgO8xUww/TWAEcVenabI/AAAAAAAAAKY/MDklKJ_bbEI/s400/fistEgypt.jpg\r\nEgypt’s “April 6 Youth Movement” sporting yet another identical “Otpor-fist.”\r\n\r\nhttp://4.bp.blogspot.com/-jzDIKRFJTYc/TWAEcV5o4RI/AAAAAAAAAKQ/dOW3NWfr78U/s400/fistBahrain.jpg\r\nBahrain’s “Youth for Freedom” may have attended the CIA-coup college as well. BBC’s canonizing of Bahrain’s protesters as heroes surely indicates establishment approval.\r\n\r\nhttp://2.bp.blogspot.com/-3w3qKicjsJ4/TWAEcH_n7NI/AAAAAAAAAKI/lqEL3epUKsc/s400/FistApril6KnockOff.jpg\r\nEgypt’s “April 6 Youth Movement” witlessly displaying foreign funded propaganda as they prepare to overthrow their country’s government and make way for a Soros-funded constitution.\r\n\r\nhttp://3.bp.blogspot.com/-njGlc9OJrlg/TWAEcEI8p6I/AAAAAAAAAKA/avYdfSDBnew/s400/fistApril6Egypt.jpg\r\nEgypt’s “April 6 Youth Movement” banner with a slight variation.\r\n\r\nA final note to consider is that CANVAS is on record in Foreign Policy magazine’s article “Revolution U,” assisting the “Rose Revolution” of Georgia, the “Orange Revolution” of the Ukraine, and is currently working with networks from Belarus, Myanmar (Burma) and 50 other countries. Taking a look at their activities and the overall globalist agenda, it is clear they are involved in regime change that will directly assist the globalists in their encirclement of Russia and China.\r\n\r\nJohn McCain went on to say of the unrest his IRI had helped fund in Egypt, “I would be a little less cocky in the Kremlin with my KGB cronies today if I were Vladimir Putin. I would be a little less secure in the seaside resort [of] President Hu and a few men who govern and decide the fate of 1.3 billion people.”\r\n\r\nMcCain’s careless comments, begotten of either senility or the utter contempt he holds the general public in, let slip the true nature of the game being played out via US-fueled color revolutions unfolding around the world. Indeed, this is about exacting concessions and forcing the integration of sovereign nations into the Anglo-American, unipolar world empire.\r\n\r\nhttp://dprogram.net/2011/02/20/cia-coup-college-recycled-revolutionary-%E2%80%9Cprops%E2%80%9D", "group_id": 3920, "id": 155552}]