[{"user_id": 544, "stars": [{"date_created": 1298912677.152462, "user_id": 1516}], "topic_id": 9248, "date_created": 1298737606.8818171, "message": "Through this article: http://schwitzsplinters.blogspot.com/2011/02/wason-selection-task-and-limits-of.html  I came across this PDF: http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.32.3107&rep=rep1&type=pdf", "group_id": 175, "id": 214580}, {"user_id": 544, "stars": [], "topic_id": 9248, "date_created": 1298737794.2625721, "message": "Also, it blows my mind a little bit.", "group_id": 175, "id": 214607}, {"user_id": 544, "stars": [], "topic_id": 9248, "date_created": 1298737718.3583641, "message": "It’s quite fascinating: the thesis explains that your belief in a preposition ought to change from 1/2 to 1/3 simply by your temporal location becoming relevant to the preposition, even though you know _up front_ that your temporal location _will become_ relevant to the preposition.", "group_id": 175, "id": 214596}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767463.3028269, "message": "@KuraFire: I believe in all prepositions 1/3 at all times except \"with.\" I believe in it 100% of the time.", "group_id": 175, "id": 216058}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768442.1216111, "message": "However, since you do not know which day you are being asked this question, your perception of current state versus previous state is irrelevant, while the effect that the event has on you is not irrelevant. If you are in T2, and you answer Heads, you are wrong.", "group_id": 175, "id": 216082}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767616.0929611, "message": "In regards to the likelihood of a proposition and your belief in said likelihood of a proposition being relative based on your temporal location (that is, your placement in time, as opposed to your placement in space, for those of you who have not yet read the article), the article commits a terrible mistake in assuming that the 1/2 and 1/3 that he was comparing are the same value. They're not.", "group_id": 175, "id": 216061}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767800.578944, "message": "The second value is the likelihood of knowing which event occurred to something external. The likelihood of the event before it happened is still a non-relative, binary value. The likelihood of knowing which event occurred to something external, on the other hand, has two potential influences.", "group_id": 175, "id": 216064}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767904.5826311, "message": "The primary of these two potential influences is the perception of current state versus previous state. The secondary of these two potential influences is the effect that the event has on the individual.", "group_id": 175, "id": 216066}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767964.9733379, "message": "Granted, one of these cannot be taken without the other, but the perception of the current state is the more important of the two, as the \"Sleeping Beauty Problem\" forces the individual with the belief to suspend natural state perception.", "group_id": 175, "id": 216068}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768525.284801, "message": "Once you are given the perception of current state, your perception immediately becomes relevant.", "group_id": 175, "id": 216083}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298767699.4865501, "message": "The first value is the likelihood of an event occurring to something external. The likelihood of the event is a non-relative, binary value, thus it is clearly 50%.", "group_id": 175, "id": 216063}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768032.666826, "message": "In in any case, let me skip the build up and just jump to the actual argument that I'm going to make that (regardless of the second value noted above), the first value remains 50%.", "group_id": 175, "id": 216071}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768376.177563, "message": "In the essay, Elga states that the credences of P(H1), P(T1), and P(T2) all are equal and thus should equal 1. This is, frankly, untrue. When asked, \"Which side of the coin was flipped?\" regardless of what you can deduce relative to your self, there are still only two possibilities in this scenario in an assumed \"fair\" system. Thus, the chance that the coin landed on one of the two sides is 1/2.", "group_id": 175, "id": 216079}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768584.6747811, "message": "Why? Because if you are told you are in T2 and not H1 or T1 (which is the same perception of current state), you know that Heads is an impossible answer, meaning there is 0% credence in that answer and 100% credence in the answer of \"Tails.\"", "group_id": 175, "id": 216087}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298768646.5559089, "message": "If you are told you are in either H1 or T1, regardless, your credence in the answer should be 50%, as it is again a binary system, as we have eliminated the effect of T2 due to having perception of the current state versus the previous state.", "group_id": 175, "id": 216089}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298769051.591969, "message": "tl,dr: The result of the coin flip is binary no matter what, and adding a third possibility looks like the same possibility as one of the two original possibilities does not change the fact that there are still only two possibilities.", "group_id": 175, "id": 216097}, {"user_id": 11619, "stars": [], "topic_id": 9248, "date_created": 1298815584.182658, "message": "The experiment seems to be dealing with a level of consciousness characterized by belief as opposed to a more practical appreciation of reality. Were I a subject of the experiment, I would awaken with a guess or a postulate, rather than a *belief* in one or the other of the possible outcomes. But starting from the assumption that the subject will believe one thing or another, a detailed analysis follows. I don't see how this experiment advances the purposes of philosophy toward the Good. At best, it seems to be an episode of disembodied logical investigation. Am I missing something?", "group_id": 175, "id": 217213}, {"user_id": 545, "stars": [], "topic_id": 9248, "date_created": 1298917615.534904, "message": "@pwf I would argue that logical investigation (we'll agree to disagree on the disembodied part) is a valid and gainful advancement of philosophy. \"The Good\" is not relevant for many types of philosophy, and often it isn't even the end goal for many of those who study philosophy.", "group_id": 175, "id": 227853}, {"user_id": 17417, "stars": [{"date_created": 1299176737.181426, "user_id": 545}], "topic_id": 9248, "date_created": 1299077306.4999061, "message": "This paper hypothesizes that polluting a set of posteriori data will lead to a false a priori assertion.  Shouldn't this be self evident?  The correct a priori assertion is that a coin has a 50% chance of landing on each side.  That assertion could be confirmed with posteriori data regarding awakenings in the sleeping beauty problem.  One awakening heads, two awakenings tails.  Over time the individual calculates how many times he was awakened once versus awakening twice and the assertion could be confirmed. But the subjects data set is intentionally tampered with, so of course a new assertion begins to emerge.", "group_id": 175, "id": 247308}, {"user_id": 17417, "stars": [], "topic_id": 9248, "date_created": 1299077352.8984909, "message": "This is no different than telling a child that the sun is blue and then asking them what color big bird is.  They'll say blue.  If you pollute the data set, the assertion will be incorrect.", "group_id": 175, "id": 247314}]