[{"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1313779973.743408, "message": "I am starting this thread to discuss using Dramatica to do improv.", "group_id": 11394, "id": 1912000}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1313781038.1027191, "message": "I'm in. I'm probably going to sound skeptical, but I think this is a good idea to explore.", "group_id": 11394, "id": 1912176}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1314055693.0353031, "message": "Did you know you can plug in the ones you want, and use dram to randomize the rest of them?", "group_id": 11394, "id": 1934987}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1313805971.5090089, "message": "The biggest challenge is going to be, actually, talking to others about it to get them to do the improv.  Maybe I should start with two others for the embroidery, and that way do a three person improv.  I guess the thing to do is to put out the embroidery idea onto our facebook interaction page, we just started.  Whoever answers, and/or takes part, would be interested.  Now for the smidgen of courage to come.", "group_id": 11394, "id": 1914578}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1313817184.6347079, "message": "I think I have nailed down where my doubt comes from. \n\nThe thing about dram is that it's very objective. But improvising is very subjective -- you are by definition inside the scene.", "group_id": 11394, "id": 1915614}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1313843700.3417029, "message": "I guess I am not thinking of a finished product for others to see. I am thinking about the process and how much fun it is to create. Every one has all the given circumstances and all the characters have their 4 dimensions at the ready to draw from as they r in the moment.  I know plays have been written this way so there could be a finished product. Each time a scene is improvised the best lines and events could be recorded and put together to make a finished story.", "group_id": 11394, "id": 1916641}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1313894624.2849891, "message": "Ah, now you get my point.  It would be fun to have the actors who did the improv do the film.  Then, again, I think back on a scene from Tootsie that two actors did as a learning/practice scene, the one with the tomato lines.  I wonder if we could come to that level of writing.  It was a brilliant piece to act from.  They were so funny", "group_id": 11394, "id": 1920230}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1313986120.0443349, "message": "I don't understand how Dramatica comes into this; really, why the actors have to know dram -- that's what I don't get.\n\nI get improvising a scene; I get improvising multiple scenes. I get unfolding an entire movie or play. Why do they have to know dram?", "group_id": 11394, "id": 1927346}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1313989705.062711, "message": "I am re-evaluating the premise.  I considered having them take part in creating the story embroidery to encourage them through a vested interest.  Now, I'm wondering if they would be docile and cooperative <G>.  I guess the fact that I would hand them a storyforming printout would necessitate some knowledge of the theory.  Perhaps, I could turn it into a story treatment via an import into screenwriter.  This is all very pie in the sky, to date.  I have to work up the courage to do the first one.", "group_id": 11394, "id": 1927629}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1313990748.2050929, "message": "I don't remember anyone saying the actors have to know Dramatica but would that be so wrong?  I guess because I am an actor and I like Dramatica I think it would be fun for everyone to participate in the creation of the story form.", "group_id": 11394, "id": 1927701}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1313990880.8750961, "message": "I have permission to shoot scenes in the public library, keeping the crew to five people, including the actors.  I thought to create a series of mysteries.  The mystery could use learning as the main somethingorother.  Or should I do knowledge, since the library is a quiet place, keeping the main quad in psychology rather than active physics?", "group_id": 11394, "id": 1927705}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1313993354.343708, "message": "My question is should I start with the issue or concern, first?  I guess this would be permissible to ask on the other group.", "group_id": 11394, "id": 1927853}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1314012406.0445931, "message": "I am not following, but I would have a fully developed storyform with all the characters fully developed and all the story points filled in which will give u at least 28 scenes(if I remember correctly). This way when you do the first scene you will know it is overall story signpost 1. you will know who (objective pov) what, where, when, why. And mike is right, the actors don't have to know anything about Dramatica if you've worked the storyform out.", "group_id": 11394, "id": 1928914}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1314023361.5520329, "message": "In writing the example about the \"overall signpost 1\" I see what Mike says about the actors wanting to play the scene Subjectively. It will take a directors hand to guide the scene from an objective POV.", "group_id": 11394, "id": 1930314}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314029092.969265, "message": "@sam_potter As I create my own story form, I have choices. First I chose good/success. Now, I want to either choose learning in concern, knowledge in issue, or knowledge in problem as the next choice in the story engine. Since the scenes will be in a library, that seems a fun choice on which to build a mystery. i have to decide which to choose next, concern, issue or problem.", "group_id": 11394, "id": 1931030}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1314033111.704006, "message": "Do you have an actual story that you want to tell, yet? If you do, let that be your guide. If you don't, then make an arbitrary choice (I'll do it for you, knowledge is issue) and improvize a storform as wel.", "group_id": 11394, "id": 1931689}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314048192.534296, "message": "Thanks, with issue taken care of, I'm off to the next one.  I have no story burning to be told.  This is only to create something to practice working with actors.", "group_id": 11394, "id": 1934009}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314065393.4093831, "message": "I enjoy pondering the story engine, too much.  I chose steadfast because I loved The Fugitive steadfast mood.  A MC domain of universe seemed appropriate for a mystery, and that gave me down to 4 storyforms.  A growth of start seemed to echo my own life of hanging out in the library in the early 70's, until I started \"living\".  So that has a personal touch.  \n\nA unique ability of fantasy seemed uncomfortable, until I realized that I could have some major clue or resolution to solve the mystery be in a fantasy book or section of the library.  Something Jules Verne would be public domain.  Cost of preconscious might give some difficulties, but a dividend of progress seemed to fit Carnegie's gift to the country of libraries, and maybe progress in everyone's life and solving the mystery.\n\nNow, I have to decide a problem and choose either process or result, to decide a focus of proven or unproven, and/or to decide a response of proven or unproven.  I assume deciding on the problem would be most important.", "group_id": 11394, "id": 1936760}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314065502.3985031, "message": "I guess I have a MC problem and solution of accurate and unaccurate choice, too.", "group_id": 11394, "id": 1936774}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314065544.5831239, "message": "Since a mystery is OS focused, I'll toy with that choice in the StoryGuide examples.", "group_id": 11394, "id": 1936784}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314066573.5658519, "message": "Here is the question:  Should I wait until I see if I have a man or woman actor MC before deciding on the mental sex, or should I just take the role to make sure that actor shows up for every shoot?", "group_id": 11394, "id": 1936964}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314066247.693563, "message": "I guess process as problem would be a good fit.  Now, to figure out something that would not offend anyone.  Oregon DOES have the highest actual unemployed rate, we hear <G>.", "group_id": 11394, "id": 1936902}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314067535.1641829, "message": "Maybe I should choose the holistic one, and if the actors drift off into a more linear one, that could work, since the storyform is identical for both. I have to remember this storyform, for that reason. There seems to be great possibilities, overall.", "group_id": 11394, "id": 1937111}, {"user_id": 7664, "stars": [], "topic_id": 44117, "date_created": 1314069832.2849059, "message": "\"a dividend of Progress seemed to fit Carnegie's gift...\"\n\nHow do you work this into the story? The more they stive for the goal, the more libraries they receive? I feel like you're linking things very metaphorically, and not practically -- not the way a story can use them.", "group_id": 11394, "id": 1937452}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314072749.504854, "message": "No, not practically, but a bit of cosmic benchmark encouragement <G>.  I never would have thought of it, but getting more libraries would be non-offensive.  Portland, Oregon's Multnomah Co. library system is #2 in the nation for use.  But it probably isn't possible, being too bulky of a progress.  Maybe the dead body had donated money for  somekind of new library, and getting it is part of proving someone innocent, or some such.  Thanks for something to think about.", "group_id": 11394, "id": 1937841}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1314106270.310432, "message": "@prish r u going to practice or just film from scratch? What is your goal? Is it the finished product or the process?", "group_id": 11394, "id": 1939695}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314114700.6145649, "message": "The goal is the finished product.  The reality is to see how far I can get.  I will be filming an improv at the least, meaning a little canon camcorder running in the back of the room.  Eventually, scenes will happen in the library.  How long the cosmic eventually takes is another matter.  \n\nThis forum has been a huge help.  Not having the actors take part in the storyforming seems the most practical way to go about it.  Maybe the thing to do is having one actor as an embroidery partner, but maybe more.  At least I might have one person on board, enthused.  Perhaps I could entice the actors into taking part by offering everyone an equal share in any money we would get if we sold an eventual script/idea.  I want to put that off until the final schedule push, and after everything is nailed down.  \n\nI have to mull over who would be most inclined for embroidery chit chats.", "group_id": 11394, "id": 1940674}, {"user_id": 37586, "stars": [], "topic_id": 44117, "date_created": 1314119835.2618959, "message": "@prish okay, so the script is the end product and the camera is the way to document the ideas and dialogue to be transcribed.  Have fun and good luck. Cannot wait to hear how it goes.", "group_id": 11394, "id": 1941680}, {"user_id": 39675, "stars": [], "topic_id": 44117, "date_created": 1314131478.333441, "message": "Actually, an improv film is the end product since my acting class experience is inspiring the whole endeavor.  A script might be the more practical and realistic end.  I am taking it a milestone at a time.  The next milestone is the embroidery.", "group_id": 11394, "id": 1943509}]