[{"user_id": 11626, "stars": [], "topic_id": 42472, "date_created": 1311320511.33921, "message": "BB Gun Causes Hospital Evacuation Hysteria\r\nSoCal Martial Law Alerts\r\nJuly 21, 2011\r\n\r\nWHITE RIVER JUNCTION, Vermont — Evacuation hysteria ensued when VA hospital staff attempted to remove a BB gun and a knife from a patient's bag.\r\n\r\nJohn Dugliss, a 60-year-old retired Navy veteran, was receiving treatment for an injured ankle at the White River Junction VA hospital when medical staff attempted to remove a BB gun and a knife from Dugliss' bag. Dugliss became distraught and barricaded himself in a room for 5 hours. He did not take any hostages.\r\n\r\nVermont State Police Captain Ray Keefe said, \"There was a firearm seen by personnel in the hospital, also a knife and pepper spray. The subject was asked to leave, but would not leave. He got into that room and barricaded himself.\"\r\n\r\nThe hospital wing was evacuated as SWAT Teams and state police responded to the scene with automatic rifles, helmets and other tactical gear.\r\n\r\nWhen Dugliss emerged from the room holding a knife and pepper spray, he was taken down by state police with bean bag bullets.\r\n\r\n\"The male emerged from the room, with pepper spray in one hand, and a knife in the other hand. At this point less than lethal wepaons were used on this person, and the subject was taken into custody,\" said Captain Keefe.\r\n\r\nDugliss was taken to a state hospital where he will undergo a psychiatric evaluation. He could face federal charges, because the incident took place in a federal building.\r\n\r\nhttp://www.meetup.com/SCMLA2/messages/boards/thread/13972921\r\n\r\nSOURCES:\r\n\r\nStandoff in Progress: Patient with Gun Prompts VA Hospital Evacuations\r\nhttp://www.allvoices.com/contributed-news/9741313-standoff-in-progress-patient-with-gun-prompts-va-hospital-evacuations\r\n\r\nPolice: Armed Veteran Arrested After Hospital Standoff\r\nhttp://www.wmur.com/news/28627554/detail.html\r\n\r\nPatient with gun prompts evacuations at VA hospital\r\nhttp://www.wcax.com/story/15125979/patient-with-gun-prompts-evacuations-at-va-hospital\r\n\r\nFive hour standoff at VA Hospital ends with minor injuries\r\nhttp://www.wcax.com/story/15127364/five-hour-standoff-at-va-hospital-ends-in-minor-injuries", "group_id": 3920, "id": 1696256}]