[{"user_id": 4149, "stars": [{"date_created": 1304951747.6049459, "user_id": 4149}], "topic_id": 34224, "date_created": 1304839704.1653581, "message": "Just search the app store there are a lot", "group_id": 97, "id": 956981}, {"user_id": 9108, "stars": [], "topic_id": 34224, "date_created": 1304866439.4073901, "message": "Does Google Voice work on the iPod Touch?", "group_id": 97, "id": 957858}, {"user_id": 12527, "stars": [], "topic_id": 34224, "date_created": 1304877897.4266191, "message": "I don't know if Google Voice has a native iOS app these days (they did, then it was taken down, might be back now?) but they have a web based version.", "group_id": 97, "id": 959033}, {"user_id": 12527, "stars": [{"date_created": 1304882730.9031999, "user_id": 9108}, {"date_created": 1304894632.8029521, "user_id": 18485}], "topic_id": 34224, "date_created": 1304877912.1334391, "message": "Google Voice is just an amazing product in general.", "group_id": 97, "id": 959035}, {"user_id": 4149, "stars": [], "topic_id": 34224, "date_created": 1304883562.2249119, "message": "The google voice app is meh it crashes a lot js and google voice as a while is great but the IOS app needs a lot of work just for loading and sending texts", "group_id": 97, "id": 959635}, {"user_id": 12346, "stars": [], "topic_id": 34224, "date_created": 1304889020.4816949, "message": "I recommend textfree with voice. Easier to use than google voice.", "group_id": 97, "id": 960671}, {"user_id": 20319, "stars": [], "topic_id": 34224, "date_created": 1304890188.1881599, "message": "Textfree is decent. Same with WhatsApp, a dollar. Give textie a try too.", "group_id": 97, "id": 960975}, {"user_id": 32259, "stars": [], "topic_id": 34224, "date_created": 1304946009.116138, "message": "I have google voice as two separate apps on my iPod Touch (4th gen with mic). The first app is the Google Voice native app which i use mostly for texting, checking my account's balance and even for placing call that i want redirected to my cel phone (in case im leaving the wifi area). The second app i have is Talkatone which integrates to google voice and allows you to make call directly from your ipod IF you have a mic. In my case I just use headphones and use the built in mic which I must say works amazing, if you dont have an integrated mic I guess you could use one of those handsfree headphones with mic and that should do the trick. I used to buy skype credits all the time to make call but the fact that google offers free calls to the US and cheaper rates to everywhere else is all the reason I needed to make the switch.", "group_id": 97, "id": 971119}, {"user_id": 4149, "stars": [], "topic_id": 34224, "date_created": 1304951894.6020279, "message": "@avillabon I wish talkatone ACTUALLY WORKED it is the worst written app, it crashes every 35secs on a call and there developers don't even listen when 10 people report it and I wouldn't give that app any business just based on the developers being jackasses I won't get it", "group_id": 97, "id": 972380}, {"user_id": 32259, "stars": [], "topic_id": 34224, "date_created": 1305575475.8942039, "message": "@italiano40 hmm.. That sucks man, it actually works flawlessly for me. As for \"giving them business\" I only PAY google for calls outside the US. Too bad it crashes for you, maybe I have an updated version where the issue is already fixed?", "group_id": 97, "id": 1074070}, {"user_id": 34718, "stars": [], "topic_id": 34224, "date_created": 1306849481.0684741, "message": "@thealanberman yup there's an official app now. However, I think talkatone is better", "group_id": 97, "id": 1237479}]