[{"user_id": 12688, "stars": [], "topic_id": 8353, "date_created": 1298479970.246727, "message": "I had to customize engine yard a bit to get things to work - pre/post deployment hooks or something.  We ended up not deploying to engineyard because we wanted more of the flexibility with using the straight Amazon services. We already had a setup working for slicehost so we had already gone through the pain of configuring capistrano and other tools - so moving to EY wasn't going to add as much value.  I have to admit I am a bit scared of \"magical\" tools like heroku and EY.", "group_id": 447, "id": 188657}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298479311.607244, "message": "I'm trying to decide whether EY worth the extra cost and the need to use different toolset (theirs vs. capistrano). What do you think? What do you use?", "group_id": 447, "id": 188546}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298480263.364161, "message": "@choxi and you're using Heroku?", "group_id": 447, "id": 188683}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298480414.3791821, "message": "@choxi I agree. But my team mates don't, so I think we will give EY a try", "group_id": 447, "id": 188707}, {"user_id": 10302, "stars": [], "topic_id": 8353, "date_created": 1298479943.962764, "message": "I'd definitely go with ey. been using it for the last 2 months and it was the best experience I had so far with a rails hosting.", "group_id": 447, "id": 188652}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298480161.0050759, "message": "@Porta what did you use before EY?", "group_id": 447, "id": 188675}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298480184.746197, "message": "@harshaw we're starting fresh so EY gives us some value.", "group_id": 447, "id": 188677}, {"user_id": 8875, "stars": [], "topic_id": 8353, "date_created": 1298480235.1297441, "message": "@harshaw my philosophy is to spend as little time as possible being a sysadmin so I would order my preferences Heroku > EY > EC2", "group_id": 447, "id": 188680}, {"user_id": 8875, "stars": [], "topic_id": 8353, "date_created": 1298480323.1064811, "message": "@arikfr yep, they have great support too if you ever run into problems. i'm sure it's a case by case decision depending on your application and infrastructure needs, but the fact that heroku gets rid of all those headaches for you is so worth it", "group_id": 447, "id": 188685}, {"user_id": 12688, "stars": [], "topic_id": 8353, "date_created": 1298480435.610606, "message": "my understand of heroku is that you share a VM without other customers.  THis may be ok in your situation (it wasn't in ours)", "group_id": 447, "id": 188711}, {"user_id": 10302, "stars": [], "topic_id": 8353, "date_created": 1298483663.4926591, "message": "@arikfr heroku (had a bad experience) and self hosted.", "group_id": 447, "id": 189181}, {"user_id": 1829, "stars": [], "topic_id": 8353, "date_created": 1298482949.619987, "message": "it depends on your requirements, of course, but i've had experience with both (running a social game that was a top-10 game on facebook at one point), and i suggest ec2... we were with ey for about a year, but left two years ago, because we felt like we were paying way too much for what we got and because their stack at the time was pretty inflexible compared to ec2.  they definitely had a nice/talented support crew (tho many have now gone on to greener pastures), but we just couldn't justify the price.  we've had smooth sailing on ec2 since then.  my two cents...", "group_id": 447, "id": 189035}, {"user_id": 6812, "stars": [], "topic_id": 8353, "date_created": 1298489429.056241, "message": "@jeremy1217 I didn't have a bad experience. it's @porta who had.", "group_id": 447, "id": 190205}, {"user_id": 14681, "stars": [], "topic_id": 8353, "date_created": 1298489330.0228601, "message": "@arikfr What was your bad experience wit heroku?   heroku offers dedicated option as well.", "group_id": 447, "id": 190190}, {"user_id": 11378, "stars": [], "topic_id": 8353, "date_created": 1298501915.918026, "message": "Nowdays just do sysadmin stuff for the fun in it...", "group_id": 447, "id": 192624}, {"user_id": 14954, "stars": [], "topic_id": 8353, "date_created": 1298532262.23698, "message": "Ec2 although rackspace cloud isn't too bad, just lacking a few critical features for my app", "group_id": 447, "id": 195877}, {"user_id": 9327, "stars": [], "topic_id": 8353, "date_created": 1298639040.296982, "message": "If you want to focus on your application and leave the sysadmin stuff to the experts go with EY.  But it depends on your experience and requirements.", "group_id": 447, "id": 207656}, {"user_id": 4219, "stars": [], "topic_id": 8353, "date_created": 1299117356.004055, "message": "why not go with bare metal servers and host with rackspace or some other rep. managed provider?", "group_id": 447, "id": 255849}, {"user_id": 6165, "stars": [], "topic_id": 8353, "date_created": 1301700085.6994519, "message": "I would start with Heroku. If your site outgrows it, switch to Engine Yard.", "group_id": 447, "id": 506705}, {"user_id": 5145, "stars": [], "topic_id": 8353, "date_created": 1301709335.3706379, "message": "ec2 feels like the cheapest option to me, and usually all my admins prefer having our own box, so that'd be my pick.", "group_id": 447, "id": 507198}, {"user_id": 26653, "stars": [], "topic_id": 8353, "date_created": 1301801922.7103291, "message": "Yeah, I use heroku for most things and then EC2 (I can sysadmin like a fiend though). That said, @drnic is at engine yard so if you can afford it, you can bet your ass it's a sweet environment for deploying rails apps to.", "group_id": 447, "id": 511500}]