[{"user_id": 41694, "stars": [], "topic_id": 46440, "date_created": 1318376959.1515999, "message": "First question: After reading Web-Based Distance Learning Technology: The Impacts of Web Module Length and Format, what do you want to know more about?  Particularly what they would change about the methods of the study to make it more directly relevant to the course that you're designing?", "group_id": 11791, "id": 2328389}, {"user_id": 41694, "stars": [], "topic_id": 46440, "date_created": 1318377102.9299209, "message": "Second question: How pertinent are those results to those who are teaching in the arts & humanities? Do you feel certain disciplines are much more difficult to teach using diagrams, photos, and other visuals? For example, how can we use effective visuals given the more abstract nature of the humanities?", "group_id": 11791, "id": 2328405}, {"user_id": 42159, "stars": [], "topic_id": 46440, "date_created": 1318440382.208343, "message": "I am not a big fan of quantative research but I do think they found out a bit of meaningful fact though it can be easily drawm through our common sense. Here's my suggestion for the improved methods. I wonder why they only chose engineering students none of whose learning style is 'textual'. The results might have been different if there had been some humanity students. Also, they measured 'the successful learning' by how much information the participant remembered, which is all about the short term memory. Above all, this research completely ignore the core factor of learning; the motivation. The participants were there to respond to certain contents in which they had no interests and engagement. They were seen as a passive 'receiver of the knowIege'. I believe 'motivation' factor can completely turn over the result. For example, 15 minutes or 25 minutes doesn't matter when I am interested in contents.   ", "group_id": 11791, "id": 2333364}, {"user_id": 42159, "stars": [{"date_created": 1318612629.1775789, "user_id": 41694}], "topic_id": 46440, "date_created": 1318441576.448087, "message": "Here's my personal strategy. Whenever I have to read some scholars' article, I always find thier picture first. I add his/her picture and the link to his/her website to my text summery. That way, I can understand and remember the article/names better as I am more engaged. I found it easier for me to think critically about the text and question back to the writer when they seem to be a same human like me.", "group_id": 11791, "id": 2333433}, {"user_id": 42159, "stars": [], "topic_id": 46440, "date_created": 1318441006.6960509, "message": "For second question, I do believe arts and humanity need visual aids. We tend to be too much textual. As we are basically dealing with abstract matters such as concepts and thoughts, there are bigger needs for diagram, mapping or pictures. For example, I had two AL800 level courses with a heavy reading load. While one course instructor requried us to draw our own map of all the readings, the other one only required a textual summary of each reading. The difference was clear at the end of the semester. I could connect and get the points at the first class. However, the other class, the scattered pieces of knowledge were everywhere and I am still not sure who's saying what and why some things matters where.", "group_id": 11791, "id": 2333403}, {"user_id": 41694, "stars": [], "topic_id": 46440, "date_created": 1318612636.7266021, "message": "That's a great idea, Kate.", "group_id": 11791, "id": 2347560}, {"user_id": 42190, "stars": [], "topic_id": 46440, "date_created": 1319078778.4862649, "message": "I agree, I feel like I often do a poor job when teaching philosophy of actually fleshing our thinkers out as actual people. We focus on the text and ideas, but not the author, and the context they were writing in (let alone pictures and visual cues). The addition of visual media for online courses could make this possible. Can you imagine links to readings being actual pictures of the authors? That would be great.", "group_id": 11791, "id": 2389537}, {"user_id": 42505, "stars": [], "topic_id": 46440, "date_created": 1319137684.7367971, "message": "I totally agree with the points made here.  However, I think there might be something to say for a more professional, less human presentation.  That's part of what makes APA articles great: they don't differentiate between gender in citation.  Furthermore, I like to judge the articles I read based on the ideas, and I think if I saw the author was a slob it would definitely affect my reading.  That said, academia isn't a bubble that shields us from the real world, and eventually you'd see someone in your area at conferences, speaking engagements, etc.  I'm just for trying to find a balance between giving a human face to material and maintaining that scholarly objectivity that is so well fostered by anonymity.", "group_id": 11791, "id": 2393996}, {"user_id": 42505, "stars": [], "topic_id": 46440, "date_created": 1319137976.7155621, "message": "One more thing: it's also really cool to have students map outcomes of novels by character.  Chart the characters, list their attributes, and list their final outcome in the novel.  It does a lot in order to help students understand what textual logic guides the narrative.", "group_id": 11791, "id": 2394060}, {"user_id": 42505, "stars": [], "topic_id": 46440, "date_created": 1319137825.0066121, "message": "In terms of mapping, I love mapping (and requiring students to map) poems.  It effectively highlights the situational dynamic and makes me (and students) more attuned to language use, punctuation, etc. in the particular situation.", "group_id": 11791, "id": 2394032}, {"user_id": 41694, "stars": [], "topic_id": 46440, "date_created": 1319468697.2730789, "message": "@grandcha This sounds like an interesting idea. I remember that when reading Cien Años de Soledad (One Hundred Years of Solitude) I keep a family tree as a guide through the book - the visual helped, especially because many of the characters in the family had very similar names.", "group_id": 11791, "id": 2421038}]