[{"user_id": 11626, "stars": [], "topic_id": 7614, "date_created": 1298194652.983119, "message": "85 per cent of all drugs produced in Afghanistan is being shipped aboard US aircraft. Foreign diplomats have stated that the United States military buy drugs from local Afghan drug lords who deal with field commanders overseeing eradication of drug production. The administration of President Hamid Karzai, including his two brothers, Kajum Karzai and Akhmed Vali Karzai, are involved in the CIA controlled narcotics trade – one of the main reasons why the U.S. installed Karzai as De facto president of Afghanistan.\r\n\r\n“The Americans are working hard to keep narco business flourishing in both countries,” says Mikhail Khazin, president of the consultancy firm Niakon. “They consistently destroy the local infrastructure, pushing the local population to look for illegal means of subsistence. And the CIA [Central Intelligence Agency] provides protection to drug trafficking.”\r\n\r\nU.S. freelance writer Dave Gibson recalled in an article published in the American Chronicle what a U.S. foreign intelligence official, speaking on the condition of anonymity, revealed of the CIA’s record of involvement with the international drug trade. The official said: “The CIA did almost the identical thing during the Vietnam War, which had catastrophic consequences – the increase in the heroin trade in the USA beginning in the 1970s is directly attributable to the CIA. The CIA has been complicit in the global drug trade for years, so I guess they just want to carry on their favourite business.”\r\n\r\nThe New York Times, May 20, 2001\r\n\r\nTaliban’s Ban On Poppy A Success, U.S. Aides Say\r\n\r\nUNITED NATIONS, May 18 — The first American narcotics experts to go to Afghanistan under Taliban rule have concluded that the movement’s ban on opium-poppy cultivation appears to have wiped out the world’s largest crop in less than a year, officials said today.\r\n\r\nThe American findings confirm earlier reports from the United Nations drug control program that Afghanistan, which supplied about three-quarters of the world’s opium and most of the heroin reaching Europe, had ended poppy planting in one season.\r\n\r\nUnder a U.S. and NATO occupation that wiped out Opium trade has been revived.\r\n\r\nReuters, Feb 19, 2009\r\n\r\nAfghan 2008 opium crop was second biggest: U.N. report\r\nhttp://presscore.ca/2011/wp-content/uploads/2010/12/Air_America.jpg\r\n\r\nAfghanistan’s opium harvest … 2008 … was … the second biggest on record, a United Nations body declared.\r\n\r\nWhile the area under cultivation was reduced by a fifth, better yields meant production dropped only 6 percent to 7,700 tons, after a record 8,200 tons in 2007, the U.N.’s International Narcotics Control Board said in its annual report.\r\n\r\nMore than seven years after the U.S.-led invasion, Afghanistan still grows more than 90 percent of the world’s illegal opium poppies, the source of heroin.\r\n\r\nNATO forces are not allowed to eradicate crops although NATO allies agreed … to allow their soldiers to carry out direct attacks on Afghan drug lords and laboratories.\r\n\r\nAfghan officials let drug traffickers operate with impunity and those who do target the opium trade risk their lives, the report said. Last year (2008), 78 officials trying to eradicate opium crops were killed, six times the toll in 2007.\r\n\r\nAir America Afghanistan\r\n\r\nAir America was an American passenger and cargo airline established in 1950 and covertly owned and operated by the Central Intelligence Agency’s (CIA) Special Activities Division from 1950 to 1976. It supplied and supported US covert operations in Southeast Asia during the Vietnam War.\r\n\r\nAir America transported opium and heroin on behalf of Hmong leader Vang Pao. This has been supported by former Laos CIA paramilitary Anthony Poshepny, former Air America pilots, U.S. diplomats, former DEA agents, Congressional oversight committees and other people involved in the war.\r\n\r\nUniversity of Georgia historian William M. Leary claims that this was done without the airline employees’ direct knowledge (except for those employees that said they did know about it), and that the airline itself did not trade in drugs (only transported them).\r\n\r\nAir America officially disbanded on June 30, 1976, and was later purchased by Evergreen International Airlines, which continues to provide support for U.S. covert operations.\r\n\r\nToday Air America has been revived by the CIA, this time using U.S. military aircraft to transport the illegal drugs out of Afghanistan and into the United States.\r\n\r\nhttp://presscore.ca/2011/?p=753", "group_id": 3920, "id": 152719}]