[{"user_id": 15288, "stars": [], "topic_id": 12539, "date_created": 1299908490.3496289, "message": "¿Usualmente que utilizan para programar, un IDE o un editor de texto? Por mi parte depende del lenguaje. Me siento más cómodo utilizando un IDE para Java o Flex, pero para PHP me parece innecesario (es como matar una hormiga con una bazuca).", "group_id": 4948, "id": 330351}, {"user_id": 15288, "stars": [], "topic_id": 12539, "date_created": 1299908618.9916041, "message": "En PHP y Javascript uso cualquier editor (Gedit, Vim, E-TextEditor o Notepad++)", "group_id": 4948, "id": 330359}, {"user_id": 20962, "stars": [], "topic_id": 12539, "date_created": 1299939851.984684, "message": "IDE, y para PHP prefiero NetBeans, el autocomplete es muy bueno. Las asistencias para Symfony y la posibilidad de hacerle debug a mi APP son un huge win!", "group_id": 4948, "id": 331983}, {"user_id": 2457, "stars": [], "topic_id": 12539, "date_created": 1299959871.57072, "message": "Si hacen development con PHP en la Mac, pueden intentar con MacGDBp que es una interface Cocoa para leer el output de la extensión xdebug. Me es bastante útil. El code completion se le puede habilitar al MacVim ya que si bien es cierto que PHP no necesita un IDE completo, los nombres de las funciones en las librerías principales no son consistentes y me cuesta un poco recordarlos a veces.", "group_id": 4948, "id": 335737}, {"user_id": 15632, "stars": [], "topic_id": 12539, "date_created": 1299999046.614176, "message": "emacs... es un editor? sí, es un ide? sí, puedes navegar? sí, puedes ver tu correo? sí, puedes twittear? sí, puedes invocar una shell? sí, necesitas algo más? no :)", "group_id": 4948, "id": 339391}, {"user_id": 8444, "stars": [], "topic_id": 12539, "date_created": 1300106488.4724369, "message": "vim cuando no uso coderbuddy ;)", "group_id": 4948, "id": 346743}, {"user_id": 5962, "stars": [], "topic_id": 12539, "date_created": 1300131021.690376, "message": "normalmente E-TextEditor tengo unos Bundles ahi que hacen mas rapido la escritura del asunto", "group_id": 4948, "id": 350096}]