[{"user_id": 11626, "stars": [], "topic_id": 43140, "date_created": 1312277521.8180721, "message": "Reports of Death Threats Against Jeff Mattox\n\nStuffed Suits\n\nAugust 1, 2011\n\nShortly after Jeff Mattox was singled out by Sheriff Jim Matthews of Kershaw County for the bizarre and apparently \"off the books crime\" of hitting the \"like\" button on Facebook.com, he was warned by a GOP official in another county that the situation was not to be taken lightly.  Mattox was warned that the sheriff was serious and that Mattox's life could be in danger. \n\nWell intentioned people often go over the top in such situations wishing to err on the side of caution when warning people.  They are able to remember or have read of other such conflicts that have ended in tragedy in the past.  Mattox reports that he took the advice under consideration and kept it in the back of his mind as he went about dealing with the strange case he found himself in: speech suppression and attack by a government official.\n\nThe past few days seem to have validated that earlier warning. The \"word on the street\" coming from Kershaw County as well as other sources (in the upstate) is that it is widely known that Jeff Mattox is being targeted for violence, including the potential for his being shot and killed. \n\nWhile there are some recorded instances of \"suicide by police\" lately where someone physically charges armed and ready police with a deadly weapon inviting a deadly response, historically there have also been some cases of outright murder by police.  Such instances of murder or assassination are, considering the number of law enforcement officials, relatively rare but they do happen on occasion. \n\nThe vast majority of people in law enforcement are very good and morally upright people who, at the very least, have good intentions.  They are, like the rest of us, only human and, no matter how angelic their character may be, they still make mistakes or are misled at times. \n\nWhen orders come from the top law enforcement official of a county regarding the use of extra force towards a single individual who has committed no crime nor indicated any violent propensity towards anyone, the chances of \"mistakes\" greatly increase.  In fact, one might easily describe the intentions of such \"extra force\" orders as being to \"set up\" a non-violent, law-abiding person for political assassination.\n\nAccording to sources claiming to have heard information from people close to the sheriff, he is warning people who have contact with Jeff Mattox to \"distance themselves\" from him. \n\nAnother source states that the sheriff is ordering his deputies to bring in extra back-up whenever there is a call dealing with Jeff Mattox.\n\nSo far, these warnings are being conveyed to Mattox by third parties. There are no reports of phone calls or statements made directly to Mattox at this time.\n\nRemember, the only reason Jeff Mattox is being persecuted outside the law is for his clicking the \"like\" button on an article (with an attention-getting misnomer for a title) discussing the many instances of governments killing their own citizens throughout history.\n\nMattox, it would seem, has been turned into \"public enemy number one\" by a self-aggrandizing county sheriff who's looking for dragons to slay.  Mattox is being described as an \"extremist\" and linked to terrorist groups by Sheriff Jim Matthews in newspaper interviews.  The effort is obviously to both create in the minds of the public a terrorist threat where none exists and to create a narrative to the situation so that the sheriff can be the \"hero\" at the end.  They are, in Mattox's words, attempting to \"marginalize and villainize\" a political opponent within the Kershaw County GOP.\n\nMattox has been railing for some time against the \"revenue neutral\" machine that Matthews has installed that increasingly generates more revenue by aggressive ticketing at traffic stops to supply the department with more money as needed to continually expand.  One citizen reports the latest plan being to increase their patrols of interstates with two recently acquired fully-loaded Dodge Chargers so that the county sheriff's department can \"compete\" with the highway patrol.\n\nJeff Mattox has also freely helped in advising individuals to get them cleared of tickets in court when they have been excessively fined. Apparently, Mattox has cost the sheriff's department some money and has otherwise been bringing unfavorable attention to the sheriff's actions.  \n\nJeff Mattox has committed no crime. He did not write the article that he clicked \"like\" on.  He did not even comment about the article on in a Facebook group that, strangely enough, the sheriff himself was a member of.\n\nWhile the surveillance of Mattox's action on Facebook.com was itself not much of a big deal--after all it was a public page--the severe reaction by the sheriff was a calculated, unnecessary, and bizarre plan designed to bring down the Sheriff's and KCGOP Chairman Chris Oviatt's political enemy.  Immediately after the Sheriff's hysterical outcry, Oviatt began the procedure to remove Mattox from his vice-chair position with the stamp of approval from SCGOP Chairman Chad Connelly.\n\nOviatt frequented the Kershaw County Patriots meetings and worked closely together with Mattox during the elections and precinct reorganization.  Matthews attended many meetings in order to cynically use the group for political gain benefiting his election campaign.  Now the two politicians' real motives are being revealed and it is not a pretty picture when political clout and official intimidation are being used to destroy a person outside the rule of written law.\n\nhttp://stuffedsuits.com/news/sc-politics/698-death-threats-against-jeff-mattox", "group_id": 3920, "id": 1773522}]