[{"user_id": 11626, "stars": [], "topic_id": 7607, "date_created": 1298191504.347677, "message": "http://i2.cdn.turner.com/money/2011/02/10/news/international/america_exports_weapons.fortune/jdam_missile.top.jpg\r\n\r\nBoeing's Joint Direct Attack Munition (JDAM) bomb, which is used to target surface threats and is used by 26 countries. By Mina Kimes, writerFebruary 11, 2011: 10:05 AM ET\r\n\r\nFORTUNE -- This time last year, Boeing's F-15 production line, which is housed in a beige, dreary building on the outskirts of Lambert-St. Louis International Airport, was on the verge of shutting down. The F-15 is an old jet, first designed in the 1970s to outmaneuver Soviet MiGs. It has long been surpassed by more advanced rivals, and the U.S. military hasn't bought a new one since 2001. When production slowed to a trickle a few years ago, a pair of orders from Korea and Singapore kept the line alive, barely, and it has been churning out about one F-15 a month since then. Local politicians fretted that Boeing would have to close the production line, eliminating hundreds of jobs and delivering a blow to the struggling regional economy.\r\n\r\nThen, last summer, rumors surfaced about a deal -- a big one. The workers at the plant followed the news online, where defense publications reported on the details of the sale. The would-be buyer, they learned, was Saudi Arabia, and the proposed order was massive -- 84 planes, as well as upgrades to older jets. In October the Department of Defense, which administers sales to foreign countries, finally announced an arms package worth some $60 billion, including 70 Apache attack helicopters, also made by Boeing (BA, Fortune 500), and the fleet of F-15s.\r\n\r\nIt was the biggest overseas arms sale in recent memory, and it extended the life of the production line through 2018. The F-15 may live even longer -- a Boeing executive says there are two other overseas buyers waiting in the wings. Dale Lauer, a 52-year-old flight mechanic, smiled slightly when I asked him what he thought about the news. \"People thought this program was dead a long time ago.\"\r\n\r\nFar from it. Thanks to a surge in overseas demand, the F-15 and other aging U.S. weapons systems are hotter than they've been in years. The Department of Defense last year told Congress of plans to sell up to $103 billion in weapons to overseas buyers, a staggering rise from an average of $13 billion a year between 1995 and 2005, according to Deutsche Bank analyst Myles Walton. Signed agreements have tripled since 2000.\r\n\r\nInteractive graphic: Up in arms\r\n\r\nAs defense giants like Boeing, Raytheon (RTN, Fortune 500), and Lockheed Martin (LMT, Fortune 500) increasingly seek to peddle their wares to well-financed (sometimes by the U.S.) international customers, they have a surprising ally: the President. \"Obama is much more favorably disposed to arms exports than any of the previous Democratic administrations,\" says Loren Thompson, a veteran defense consultant. Or, as Jeff Abramson, deputy director of the Arms Control Association, puts it: \"There's an Obama arms bazaar going on.\"\r\n\r\n0:00 /2:45Tiny spy planes, big business\r\n\r\nAdministration officials say the boom in arms exports is simply the result of healthy demand. Indeed, American-made arms are widely considered the best and most coveted weapons in the world. But the Obama team has hustled to pave the way for big sales like the Saudi deal; the President himself recently sought to secure a pending $4 billion aircraft deal with India. Obama is also backing a massive push to rewrite the rules that govern arms exports, a process that some say will reduce oversight of U.S. weapons sales.\r\n\r\nFor the administration, robust international arms sales advance domestic goals, like bolstering exports and supporting a defense workforce of more than 200,000. Weapons transfers are also a subtle yet potent form of diplomacy: By arming its allies, the U.S. can spread the burden of policing hot spots (the Middle East, the Korean peninsula). And arms exports give Obama's State and Defense departments tremendous negotiating clout with buyers.\r\n\r\nWho's buying what: 8 big arms deals\r\n\r\nBut critics contend that supplying some nations with advanced weaponry is a risky strategy, especially as the Middle East, which is teeming with American-made arms, crackles with the sparks of regime change. While the U.S. sells weapons only to its allies, power can shift quickly -- just look at Tunisia and Egypt. Even Saudi Arabia, with its 86-year-old monarch, could see a change in leadership. When friends become foes, arms exports become a liability. The government sold dozens of F-14 fighter jets to Iran in the 1970s before the Shah was deposed. Since then the U.S. has systematically destroyed F-14 parts to keep them out of Iran's hands.\r\n\r\nWeapons proliferation watchdogs expected the volume of exports to decline when Obama became President; instead the reverse has happened. Thompson pins the surge in large part on the recession. Production lines for Boeing's F-15, Harpoon missile, and Apache helicopter are sustained by exports, which support thousands of high-paying, highly skilled manufacturing jobs.\r\n\r\nBut Thompson also believes that the President has other motives for supporting foreign arms sales. \"It's about U.S. alliances, it's about maintaining jobs, and it's about America's broader role in the world -- and what you have to do to maintain that role.\"\r\n\r\nhttp://money.cnn.com/2011/02/10/news/international/america_exports_weapons.fortune/index.htm", "group_id": 3920, "id": 152509}]