[{"user_id": 33591, "stars": [], "topic_id": 35723, "date_created": 1305680441.622422, "message": "Hi!  I have a startup and am about to lock in my first customer.  I need ASAP to get a sales \"infrastructure\" in place -- i.e. an invoicing system, CRM, etc.  I was wondering if anyone had a \"checklist\" of sorts to make sure I don't miss out on anything when setting up all the various systems?  Also, I was wondering if anyone had any specific recommendations for companies to go with?  Thanks!", "group_id": 250, "id": 1090770}, {"user_id": 1381, "stars": [], "topic_id": 35723, "date_created": 1305688808.98469, "message": "*to", "group_id": 250, "id": 1092115}, {"user_id": 1381, "stars": [], "topic_id": 35723, "date_created": 1305688806.69751, "message": "We're using CapsuleCRM - free for 2 users. Fairly easy yo use", "group_id": 250, "id": 1092114}, {"user_id": 9321, "stars": [], "topic_id": 35723, "date_created": 1305731534.1140289, "message": "Take a look at Freshbooks for invoicing. They have some good options to get started and scale. As for CRM - what exactly do you need a CRM system for?", "group_id": 250, "id": 1098640}, {"user_id": 32436, "stars": [], "topic_id": 35723, "date_created": 1305750313.6573629, "message": "We use Highrise by 37signals.com and love it. Although there are more complex CRMs out there, it's easy to learn and easy to use. I believe it integrates with Freshbooks as well so you can avoid double-entry.", "group_id": 250, "id": 1102750}, {"user_id": 33591, "stars": [], "topic_id": 35723, "date_created": 1305754323.3974559, "message": "Thanks!  The CRM will be mainly to get off on the right foot with organizing sales leads/customers but will eventually evolve into a more comprehensive offering down the line.", "group_id": 250, "id": 1103489}, {"user_id": 22183, "stars": [], "topic_id": 35723, "date_created": 1305786808.62674, "message": "Not sure how fancy of a CRM that you need, but check out Zoho CRM as well.  Free for 3 users and there are 15 days free trial for pro and enterprise edition.", "group_id": 250, "id": 1108906}]