[{"user_id": 11626, "stars": [], "topic_id": 6308, "date_created": 1297845377.091512, "message": "The computer hackers' collective Anonymous has uncovered a proposal by a consortium of private contractors to attack and discredit WikiLeaks.\r\n\r\n \r\n\r\nLast week Anonymous volunteers broke into the servers of HB Gary Federal, a security company that sells investigative services to companies, and posted thousands of the firm's emails on to the internet.\r\n\r\n \r\n\r\nThe attack was in revenge for claims by the company's chief executive Aaron Barr that he had successfully infiltrated the shadowy cyber protest network and discovered details of its leadership and structure.\r\n\r\n \r\n\r\nHacktivists, journalists and bloggers have since pored over the emails and discovered what appears to be a proposal that was intended to be pitched to the Bank of America to sabotage WikiLeaks and discredit journalists who are sympathetic to the whistle-blowing website. Independent\r\n\r\n \r\n\r\nHIGHLIGHTS\r\n\r\nAaron Barr, the company's chief executive, was targeted by Anonymous following a newspaper interview in which he claimed to be able to expose senior members of the shadowy internet collective. Guardian\r\n\r\n \r\n\r\nA PowerPoint presentation claims that a trio of internet security companies - HB Gary Federal, Palantir Technologies and Berico Technologies - are already prepared to attack WikiLeaks which is rumored to be getting ready to release a cache of potentially embarrassing information on the Bank of America. Independent\r\n\r\n \r\n\r\nAnother document sent by HB Gary Federal to Hunton & Williams, the law firm which has represented the Bank of America, suggests ways to \"mitigate [the] effect of adversarial groups\" on the U.S. Chamber of Commerce for a fee of $2mn (£1.2mn(.\r\n\r\n \r\n\r\nThe Bank of America and the U.S. Chamber of Commerce have said that they had not known about the presentations, and that HB Gary Federal was never hired on their behalf. Berico Technologies and Palantir have also attempted to distance themselves from the leaked emails. Guardian\r\n\r\n \r\n\r\nFACTS & FIGURES\r\n\r\n \r\n\r\nWikileaks has bewildered Washington with a plethora of confidential diplomatic cables revealing the undiplomatic face of U.S. policy.\r\n\r\n \r\n\r\nWikileaks was founded by Julian Assange in 2006 with the motto of “keep governments open.” It describes its objectives as bringing “important news and information to the public.”\r\n\r\n \r\n\r\nWikileaks most important release is arguably a video showing U.S. troops aboard a helicopter opening fire on unarmed Iraqi civilians -- including Reuters cameramen.\r\n\r\n \r\n\r\nIn October 2010, Wikileaks released nearly 400,000 U.S. military reports about operations in Iraq. In July, it released more than 70,000 reports from the war in Afghanistan. CNN\r\n\r\n \r\n\r\nDiplomatic cables recently released by the whistle-blower website Wikileakes have revealed that the United States has been spying on NATO's secretary-general.\r\n\r\n \r\n\r\nAccording to classified State Department cables revealed by Wikileaks, the United States has expanded the role of American diplomats in collecting intelligence overseas and at the United Nations, ordering State Department personnel to gather the credit card and frequent-flier numbers, work schedules and other personal information of foreign dignitaries. NYT\r\n\r\nhttp://www.presstv.ir/usdetail/165394.html", "group_id": 3920, "id": 118272}]