[{"user_id": 13650, "stars": [], "topic_id": 36434, "date_created": 1306160172.564955, "message": "I can't remember anyone stating that they couldn't live without the \"Query System\". Anyone? I've tried to use it early on and found it  rather ponderous. Trust me I actually tried to answer everything in at least one story. Don't recall ever getting ONE filled out. And you can't really get \"full reports\" until the questions are answered. That raises a few questions <g>.", "group_id": 2515, "id": 1152880}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306161978.687216, "message": "I've never really worked out the difference between the Query System and the Story Guide. But I've never been through it all. I don't know if I am typical, but I tend to use just bits and pieces, usually kicking of with Quick Story, then something like the theme browser or plot progression to make the choices. Then the story engine if I'm not at 1 storyform.", "group_id": 2515, "id": 1153392}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306165097.5324669, "message": "I don't know how to do that...", "group_id": 2515, "id": 1153962}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306165201.9719379, "message": "Ah ok...", "group_id": 2515, "id": 1153975}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306165213.3668759, "message": "No, the theme browser.", "group_id": 2515, "id": 1153977}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306163665.903929, "message": "I use the story guide extensively, but usually just the section that is about the four throughlines.\n\nI think most of it is redundant (and repeated in other parts of the program) so we can find what works best for us. For me, that's the four throughline sections, and occassionally ALL DQS.", "group_id": 2515, "id": 1153731}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306164159.416923, "message": "The absolute killer feature for me is the theme browser. I like the overall view it gives, see the immediate effect on the other elements. I didn't really get Dramatica until I started using the theme browser to make choices.", "group_id": 2515, "id": 1153798}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306165184.1545441, "message": "I know!", "group_id": 2515, "id": 1153971}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306165192.7512479, "message": "???? Maybe I'm using the wrong terminology???", "group_id": 2515, "id": 1153972}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306165204.8935411, "message": "You mean the story engine?", "group_id": 2515, "id": 1153976}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306165346.3306429, "message": "Huh, well look at that...", "group_id": 2515, "id": 1153992}, {"user_id": 7645, "stars": [], "topic_id": 36434, "date_created": 1306168097.3701921, "message": "Consequently when I'm having trouble with a particular story point, like say a Precondition of Preconscious, I know exactly where to find it in the DQS and can read the contextual examples and associated material and figure out a good way to illustrate that point.", "group_id": 2515, "id": 1154323}, {"user_id": 33252, "stars": [], "topic_id": 36434, "date_created": 1306169788.043889, "message": "Loving the DQS to bits!!  but I'm facing a challenge though, can't seem to wrap my head around the differences/simillarities between: OS signposts & the OS concern. Also, their relationship to each other. I find the same OS concern (type) as signpost 2 - wondering if its not meant to be close to the end of the story, in signpost 4? - well, since the OS concern (type) automatically becomes the OS goal.", "group_id": 2515, "id": 1154524}, {"user_id": 7645, "stars": [], "topic_id": 36434, "date_created": 1306168016.3225279, "message": "If you're just starting out with Dramatica the Query System is wonderful. The first couple of stories I took through the entire 300+ questions and I really believed it added to and enriched my understanding of the theory.", "group_id": 2515, "id": 1154312}, {"user_id": 10814, "stars": [{"date_created": 1307179860.3047011, "user_id": 35158}], "topic_id": 36434, "date_created": 1306168096.2600219, "message": "The key to using the Theme Browser to make choices is the popup/drop down menu in the lower left part of the window above the definitions.  You must set the popup to a) show your story's settings, and b) allow storyforming choices.  THEN you'll understand what Mikeaja is talking about.", "group_id": 2515, "id": 1154322}, {"user_id": 7645, "stars": [], "topic_id": 36434, "date_created": 1306170001.6472969, "message": "The OS Concern is felt throughout the entire story and is the focus of everyone's energy. The individual Signposts examine that Concern in an order determined by your particular storyform. Sometimes the OS Concern will be Signpost 2, sometimes Signpost 1, etc. It all depends on what you're trying to say with your story.", "group_id": 2515, "id": 1154557}, {"user_id": 33252, "stars": [], "topic_id": 36434, "date_created": 1306171811.9101479, "message": "wow awesome insight, thanks fellows. There's an interesting relationship in rainman between: its OS problem,  OS concern, OS goal, & signpost 4 as exemplified in the story wizard, the following is found there. The \"OS PROBLEM = CONTROL\". - Control creates problems for the objective characters in various ways. Charlie struggles to control his business deal.....  \"OS CONCERN = OBTAINING\" - Charlie is after the quick buck with the car deal and the inheritance....       \"OS GOAL = OBTAINING\" - Everyone is concerned with Charlie's trying to obtain half of the inheritance.....       \"OS SIGNPOST 4 = OBTAINING\" - Charlie does not get half the inheritance for himself, but instead achieves a lasting bond with Raymond.", "group_id": 2515, "id": 1154829}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306171131.0575631, "message": "The thing I like about having the Concern separate from the Signposts is that you explore the concern from a bunch of angles. You're not just \"aiming at it\" like my tendency would be to do if it were always the last signpost.", "group_id": 2515, "id": 1154742}, {"user_id": 7645, "stars": [], "topic_id": 36434, "date_created": 1306170436.4918599, "message": "Sometimes the OS Concern will be that last Signpost, as in \"Rain Man\" or \"The Sixth Sense\", sometimes it will be the 3rd, as in \"Star Wars\". \"Braveheart\" has it in the first Signpost. \"Rain Man\" is the only Failure of the group, the rest are all Success stories. There really is no pattern, at least not one you can readily use without the program itself.", "group_id": 2515, "id": 1154646}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306268330.361382, "message": "I don't think Dramatica would work if you could do that. \n\nThe bit I like about the theme browser is that I can mess with it, knowing that I will be kept in the realms of Dramatica storyforming.", "group_id": 2515, "id": 1170179}, {"user_id": 13650, "stars": [], "topic_id": 36434, "date_created": 1306266896.5014141, "message": "Time out!\r\nChris you mentioned the \"key to using the Theme Browser\" .  I thought I knew what you meant until I \"tried\" to manipulate it.\r\nSet  to \"allow storyform changes\"\r\nBut once I've (already) arrived at ONE storyform I don't see any easy/real way to make changes. Yes, I see the pull downs  and can clear a choice but don't see a way to \"pick\" another element. \r\nSo all I get out of Theme Browser is a \"look\" at my  story elements as distrubuted by my story form.\r\nWhat is my feeble brain missing???", "group_id": 2515, "id": 1169962}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306268713.4701619, "message": "It's the same gotcha, over and over.", "group_id": 2515, "id": 1170216}, {"user_id": 13650, "stars": [], "topic_id": 36434, "date_created": 1306268206.2222381, "message": "so.... choices \"can't\" be made as Chris suggested IF there is one storyform already. Unfortunately, that still doesn't rule out \"feeble\" just that there are more \"gotchas.\" Thanks.", "group_id": 2515, "id": 1170167}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306267630.8911681, "message": "The theme browser, like any other part, only allows choices to be made that aren't fixed by the storyform. As with the other parts, to enable choices you made need to de-select something else. Maybe choices elsewhere (Resolve, Approach, etc) are also limiting those choices.", "group_id": 2515, "id": 1170073}, {"user_id": 30951, "stars": [], "topic_id": 36434, "date_created": 1306268448.392683, "message": "What I do like to do with the theme browser is, once I'm at one storyform, save it, start afresh, make choices from a different perspective, then compare the two. This is more a learning method perhaps than a useful writing one.", "group_id": 2515, "id": 1170188}, {"user_id": 10814, "stars": [], "topic_id": 36434, "date_created": 1306281461.2028301, "message": "Yes and no.  It is SOOO easy to make storyforming choices (technically speaking, not story-wise <g> ) that I recommend clearing the storyform by using the Clear Storyform menu command, then remaking choices in the theme browser.\n\nThe problem with being down to one storyform is that there are any number of ways to accomplish it.\n\nMy favorite way to work is to go to the Story Engine, make my dynamic choices, then go to the Theme Browser and make my structural choices.\n\nYou'll see it is easy to back out of choices when done this way.", "group_id": 2515, "id": 1172039}, {"user_id": 7664, "stars": [], "topic_id": 36434, "date_created": 1306329817.3389621, "message": "Dynamic Choices = Limit, Driver, Outcome, Judgment?", "group_id": 2515, "id": 1177695}, {"user_id": 10814, "stars": [], "topic_id": 36434, "date_created": 1306421343.9168589, "message": "And Resolve, Growth, Approach, and Mental Sex/Problem-solving Style", "group_id": 2515, "id": 1192594}, {"user_id": 35158, "stars": [], "topic_id": 36434, "date_created": 1307178396.5094941, "message": "\"I can't remember anyone stating that they couldn't live without the \"Query System\". Anyone?\" Yes! Me! I could never live without the Query System. Never done anything without it.", "group_id": 2515, "id": 1285197}, {"user_id": 13650, "stars": [], "topic_id": 36434, "date_created": 1307300590.2618101, "message": "So Sabine- do you fill it out completely? (before starting your writing, as you go, etc.)", "group_id": 2515, "id": 1294817}, {"user_id": 35158, "stars": [], "topic_id": 36434, "date_created": 1307339465.3636529, "message": "No, Gordon, no way! I'm using it to get down to one Storyform. Thinking about possible answers to questions the Story Engine does not ask – like for example the benchmarks or questions about the Subjective Throughline. While trying to know my story better I'm sometimes jotting down notes into the Signpost section. Sometimes I'm typing ideas into other boxes for not to forget what I've developed so far when I have to replace the Storyform for another one which now suits my more advanced story better.", "group_id": 2515, "id": 1300797}, {"user_id": 13650, "stars": [], "topic_id": 36434, "date_created": 1307351128.6267641, "message": "So you could  just as easily go to the \"Story Engine\" anf get your storyform. And then go to Theme Illustrating and have pretty much the same results, right?", "group_id": 2515, "id": 1301532}]