[{"user_id": 20026, "stars": [], "topic_id": 12467, "date_created": 1299878815.8917401, "message": "Specifically this post by Dave http://scripting.com/stories/2011/03/11/twittersNewDeveloperRoadma.html", "group_id": 95, "id": 327315}, {"user_id": 6643, "stars": [], "topic_id": 12467, "date_created": 1299884054.9309649, "message": "Don't think this is a huge problem. They have a right to maintain control over their platform, and this isn't at all draconian.", "group_id": 95, "id": 328386}, {"user_id": 11946, "stars": [{"date_created": 1300120943.7284629, "user_id": 960}], "topic_id": 12467, "date_created": 1299884892.817251, "message": "If someone wants a new platform - I suggest Apache Wave.", "group_id": 95, "id": 328570}, {"user_id": 14674, "stars": [], "topic_id": 12467, "date_created": 1299886398.8389289, "message": "@vega113 Got to admire their attempt, (and honestly, it needs to exist) but is not going to work.", "group_id": 95, "id": 328817}, {"user_id": 18530, "stars": [{"date_created": 1300120950.952091, "user_id": 960}], "topic_id": 12467, "date_created": 1299889571.1306469, "message": "Identica ftw: http://identi.ca/", "group_id": 95, "id": 329045}, {"user_id": 19858, "stars": [], "topic_id": 12467, "date_created": 1299889971.7562931, "message": "meh, they're just trying to control \"regular\" clients, so they can sell their own.", "group_id": 95, "id": 329057}, {"user_id": 719, "stars": [], "topic_id": 12467, "date_created": 1299902869.976372, "message": "Found #statusnet. I'll have a quiet poke about and see if there's any interest.", "group_id": 95, "id": 329925}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1299902692.274966, "message": "@micrypt Yeah, it definitely could use an overhaul. I mostly stick to updating via XMPP, email, and the API. It took no time at all for me to put together a quick PowerShell script for posting updates.", "group_id": 95, "id": 329917}, {"user_id": 719, "stars": [], "topic_id": 12467, "date_created": 1299902504.104229, "message": "Identi.ca could definitely use some sprucing up. Does anyone know the team in charge & if they welcome design input?", "group_id": 95, "id": 329914}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1299902014.929507, "message": "@hlfshell I enjoy identi.ca and I think it's a solid platform. It just doesn't have the same user base... not even close. I know a ton of people with Twitter accounts. I don't know anyone with an identi.ca account. Thus, it doesn't have the kind of interactivity that make microblogging a big draw for me.\n\nI just recently did away with my Twitter account, but these moves don't surprise me. A few weeks ago Twitter completely shut down UberTwitter, the most popular BlackBerry client,  for a few days and used the situation to shamelessly promote their own app. The whole situation just seemed dirty...", "group_id": 95, "id": 329894}, {"user_id": 719, "stars": [], "topic_id": 12467, "date_created": 1299904523.0385671, "message": "Not a peep so far. *shrug*", "group_id": 95, "id": 330055}, {"user_id": 20912, "stars": [], "topic_id": 12467, "date_created": 1299906236.907717, "message": "Monetization", "group_id": 95, "id": 330179}, {"user_id": 9233, "stars": [], "topic_id": 12467, "date_created": 1299915503.5084131, "message": "@micrypt That's what powers Identi.ca afaik! I've had an Identi.ca account since day 1 (actually, they don't even let you delete it) and, like other have said, it's not the technology: it's the ecosystem! And Twitter risks alienation if they keep going down this road... :/", "group_id": 95, "id": 330734}, {"user_id": 19422, "stars": [], "topic_id": 12467, "date_created": 1299930493.6537421, "message": "Well actually I'm beginning to wonder if Convore would not be more than enough for me...", "group_id": 95, "id": 331345}, {"user_id": 8327, "stars": [], "topic_id": 12467, "date_created": 1299931483.5802021, "message": "@davmendels Certainly cuts down on the inane drivel that seems to plague the majority of tweets!", "group_id": 95, "id": 331382}, {"user_id": 9018, "stars": [], "topic_id": 12467, "date_created": 1299937923.1997221, "message": "In August 2009 when Twitter sent me a C&D for MyTwitterButler (later known as MyPostButler) for giving end users access to the API in ways they never imagined (as far as i know i was the 2nd company ever that twitter threatened to sue and take to court)\n\nThen when they introduced Oauth (http://blog.collins.net.pr/2010/04/twitter-officially-sux.html) - the writing has been on the wall.\n\nIt was fun while it lasted but twitter has officially jumped the shark and it's now time to move on and ignore them.", "group_id": 95, "id": 331716}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1299945158.5417089, "message": "What's depressing is that I don't see this have an impact on most end-users. Most of the people I know use the official Twitter clients, anyway.", "group_id": 95, "id": 332868}, {"user_id": 9018, "stars": [], "topic_id": 12467, "date_created": 1299948417.4451039, "message": "@JohnFail lol you're kiddign right? the 3rd party community is what made twitter successful in the first place, stating point blank thanks but go away now is a slap in the face.", "group_id": 95, "id": 333448}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1299949078.176765, "message": "@deancollins I completely agree with you. I still remember when Twitter's web-page was actually painful to use and 3rd party clients were the only thing that made the system usable. But before I nuked my account, most people I know were using the web page and official Twitter applications. From the perspective of the average Twitter user, I really don't think this will be a big deal. The average user is already doing what Twitter wants.", "group_id": 95, "id": 333572}, {"user_id": 20848, "stars": [{"date_created": 1299974459.5109439, "user_id": 9108}], "topic_id": 12467, "date_created": 1299965101.4056931, "message": "I only hope people learn from this, when considering building a business that relies on a third party's proprietary \"ecosystem\" in the future.", "group_id": 95, "id": 336499}, {"user_id": 15480, "stars": [], "topic_id": 12467, "date_created": 1299978719.4367659, "message": "@JohnFail You realise that the Twitter iPhone app was actually Tweetie, developed my a 3rd party developer before Twitter bought it, right? Without third party developers Twitter would probably still be chasing the SMS thing (which is why you're limited to 140 characters).", "group_id": 95, "id": 338062}, {"user_id": 15480, "stars": [], "topic_id": 12467, "date_created": 1299985625.648253, "message": "@JohnFail I don't think the average twitter user is what makes twitter what it is, they're just consumers. I think it's the people that actually bring discussion and interesting content to twitter that matter, and I think they will notice. Without anything to hold their interest the regular users will stop reading, on the official client or otherwise.", "group_id": 95, "id": 338370}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1299980839.4113841, "message": "@PJ I'm well aware of that, though I'm not sure how that relates to my point. I'm not saying that 3rd party developers aren't important. I'm also not saying that what Twitter is doing to 3rd party developers is okay. I'm just saying that from the perspective of the average Twitter end-user, I don't think it will be a big deal since the majority of them are already using official Twitter apps.", "group_id": 95, "id": 338261}, {"user_id": 1992, "stars": [], "topic_id": 12467, "date_created": 1299985842.0169089, "message": "there was a time when you'd be right, but that time has passed", "group_id": 95, "id": 338391}, {"user_id": 1992, "stars": [{"date_created": 1300023788.730947, "user_id": 9108}], "topic_id": 12467, "date_created": 1299985786.7550211, "message": "@PJ but the average twitter user isn't following or interested in the developer community, and the movie stars, talking heads, etc., don't really care about Twitter's API decisions either.", "group_id": 95, "id": 338386}, {"user_id": 15480, "stars": [], "topic_id": 12467, "date_created": 1299986141.2331469, "message": "@KrakensDen I suppose I'm being optimistic. At least the devs will move somewhere else if they're burned one time too many by Twitter. We're a principled bunch in groups.", "group_id": 95, "id": 338425}, {"user_id": 737, "stars": [], "topic_id": 12467, "date_created": 1300007531.6238799, "message": "http://oonwoye.com/2011/03/13/dont-hate-twitter-we-just-need-an-alternative-part-1/", "group_id": 95, "id": 339711}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1300023927.3410151, "message": "@PJ While I agree that the users are what make Twitter interesting, I don't agree with your view that a lack of 3rd party clients will mean that there isn't \"anything to hold the interest of the regular users\". They will have the same discussions with the same followers they usually do. They just may be doing it via a different client if they're in the minority currently using a 3rd party app. Plenty of people made the same switch when UberTwitter was shut down a few weeks ago.", "group_id": 95, "id": 340924}, {"user_id": 11946, "stars": [], "topic_id": 12467, "date_created": 1300025594.2708211, "message": "@craigrood Apache Wave is a revolutionary platform that just pushes up definition of what can be done in browser. And it's free, open source and provides an extensive API. So it's already a kind of huge achievement. Will it work as a platform? IMHO definitely. Will it work in a sense of getting a traction? Not before 3rd party developers would realize what crazy extensions can be made for it. When that will happen? Who knows. But if someone looks for a platform of the future that is already here - I suggest take a look at Apache Wave.", "group_id": 95, "id": 341063}, {"user_id": 18795, "stars": [{"date_created": 1300764792.7818911, "user_id": 798}], "topic_id": 12467, "date_created": 1300041910.8645699, "message": "I don't see a problem here. Unless you have a compelling reason to have a different client (i.e. something like a Seesmic or Hootsuite)...twitter figured out a while ago that one of the barriers to entry is that regular users didn't know what client to pick. By narrowing the field of the basic clients, it helps grow their user base.", "group_id": 95, "id": 342407}, {"user_id": 9018, "stars": [], "topic_id": 12467, "date_created": 1300106672.7230511, "message": "@vega113 apache wave (or google wave) is a dog of a product. they screwed up soem basic fundamental requirements (couldnt be bothered rehashing them here but basically ability to monetise/license robots, ability to restrict code rights etc etc). Apache wave is not a replacement to Twitter.", "group_id": 95, "id": 346758}, {"user_id": 1992, "stars": [], "topic_id": 12467, "date_created": 1300128948.2625771, "message": "@PJ developers tend to be principled with their own projects, but you gotta pay the rent, and unsavory people will keep you in whiskey and your cat fed.", "group_id": 95, "id": 349850}, {"user_id": 1992, "stars": [], "topic_id": 12467, "date_created": 1300130124.757092, "message": "There's probably not a good way to say \"build what you want, but if you're building a vanilla twitter client, you're going to have compete with twitter proper and we will probably win.\"", "group_id": 95, "id": 349933}, {"user_id": 719, "stars": [], "topic_id": 12467, "date_created": 1300129917.119813, "message": "Some clarification from Ryan Sarver about creating Twitter clients > https://twitter.com/rsarver/status/47370374400323584. I fear the damage to developer trust is done already though.", "group_id": 95, "id": 349917}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1300153752.0446789, "message": "@KrakensDen Or, for developers of popular clients who are currently making their living from their product, that they should stop doing what they've been doing to pay their bills. It's not like Twitter is shutting down third-party clients, but this can't bode well for them.", "group_id": 95, "id": 352786}, {"user_id": 19798, "stars": [], "topic_id": 12467, "date_created": 1300176857.4848559, "message": "I think Twitter is destroying more than just their developer ecosystem with moves like Dickbar and hashbang URLs.", "group_id": 95, "id": 353939}, {"user_id": 6165, "stars": [{"date_created": 1300764820.3180349, "user_id": 798}], "topic_id": 12467, "date_created": 1300191141.0741661, "message": "I think the real problem is that Twitter is a website, not a protocol.  There needs to be a communications protocol for this type of service.  Does anyone know if XMPP is capable of supporting this or why it can't?", "group_id": 95, "id": 354964}, {"user_id": 11946, "stars": [], "topic_id": 12467, "date_created": 1300223146.61112, "message": "@JeffSelf I am not a XMPP expert, but the idea of XMPP is to allow independent servers to discover each other and inter-operate in a secure way. Twitter wants to stay the one and only server provider, so HTTP is just enough.", "group_id": 95, "id": 360179}, {"user_id": 11946, "stars": [], "topic_id": 12467, "date_created": 1300223264.8537581, "message": "@deancollins I think google wave was terminated before they had any chance.", "group_id": 95, "id": 360190}, {"user_id": 9108, "stars": [], "topic_id": 12467, "date_created": 1300230952.7602811, "message": "@JeffSelf Identi.ca supports XMPP. You can have updates from your friends pushed to it, and you can post new updates from it as well.", "group_id": 95, "id": 360985}, {"user_id": 9018, "stars": [], "topic_id": 12467, "date_created": 1300684671.8047099, "message": "@vega113 nope they had plenty of time, lots of bad architecture mistakes up front that should have been built into the beta release.", "group_id": 95, "id": 395506}, {"user_id": 11946, "stars": [], "topic_id": 12467, "date_created": 1300722054.2094221, "message": "@deancollins Well, I ll be glad if you can list the architecture mistakes, so they can be fixed.", "group_id": 95, "id": 399163}, {"user_id": 15929, "stars": [{"date_created": 1300764842.424329, "user_id": 798}, {"date_created": 1300765205.7361729, "user_id": 22109}], "topic_id": 12467, "date_created": 1300763893.9651799, "message": "for me, convore is what wave should have been. instead of you know, trying to reinvent emails", "group_id": 95, "id": 404695}, {"user_id": 6643, "stars": [], "topic_id": 12467, "date_created": 1300773492.087563, "message": "Twitter isn't evil, and they're not murdering developers, it's gonna be fine. http://pris.ma/cO", "group_id": 95, "id": 405106}, {"user_id": 23919, "stars": [], "topic_id": 12467, "date_created": 1300868888.2632849, "message": "Twitter is becoming irrelevant everyday so i think it will die with or without it's d", "group_id": 95, "id": 415427}, {"user_id": 24142, "stars": [], "topic_id": 12467, "date_created": 1300897065.004241, "message": "yeap", "group_id": 95, "id": 418522}]