[{"user_id": 9692, "stars": [{"date_created": 1300343921.9213059, "user_id": 22250}], "topic_id": 13331, "date_created": 1300278951.5668221, "message": "The FiveFingers are fun and create attention. I've used them frequently last season and liked them. The muscle ache in the calves is intense after the first few times - after all running on the forefoot takes more strength there. However I overdid it in a 10km race and actually got some hairline fractures in the mid-foot bones which stopped me from running for over two months. Can't be sure if it was the FF's \"fault\" but it is true that one needs to take it easy in the beginning when used to cushioned shoes.", "group_id": 5954, "id": 364885}, {"user_id": 9692, "stars": [], "topic_id": 13331, "date_created": 1300278695.373668, "message": "I an mot fully convinced that the \"barefoot running\" movement isn't a marketing ploy to sell a new type of overpriced schoes, but I went in a little and own both a pair of Vibram fiveFingers and now even Merrell's Trail glove.", "group_id": 5954, "id": 364852}, {"user_id": 9692, "stars": [], "topic_id": 13331, "date_created": 1300279184.5707109, "message": "I just bought the Trail Gloves because I wanted a pair with more grip on the sole, a little more protection on rough terrain and the possibility to have socks. After the first try, I like them. The contact to the ground is not as direct as in the FiveFingers, but the feet have enough leeway to do their thing. So I guess these will become my main running shoes this year.", "group_id": 5954, "id": 364942}, {"user_id": 22250, "stars": [], "topic_id": 13331, "date_created": 1300344057.0175719, "message": "@ivh I'm excited about getting some fivefingers soon! I'll be sure to break myself in gently though as your experience sounds scary.", "group_id": 5954, "id": 371981}, {"user_id": 22250, "stars": [], "topic_id": 13331, "date_created": 1300344101.8348551, "message": "Have you seen Christopher McDougall's TED talk? http://youtube.com/watch?v=b-iGZPtWXzE I found it really inspiring!", "group_id": 5954, "id": 371985}, {"user_id": 22250, "stars": [], "topic_id": 13331, "date_created": 1300344134.0405719, "message": "Haha! I've just noticed you posted it in the other thread :)", "group_id": 5954, "id": 371988}]