[{"user_id": 22913, "stars": [], "topic_id": 34107, "date_created": 1304738353.11291, "message": "Hola a todos, abrí este \"topic\" para proponer lo siguiente:\nUn foro abierto donde se les pregunte a los candidatos a la Gobernación de Boyacá ¿que piensan hacer para mejorar la inclusión DIGITAL en nuestro Departamento?, osea que se va a tratar temas puramente tecnológicos. ¿Que piensan Ustedes?", "group_id": 7153, "id": 948558}, {"user_id": 23166, "stars": [], "topic_id": 34107, "date_created": 1304947248.9123559, "message": "@rocabos Me parece maravillosa tu idea. Me atrevo a pensar que ninguno de los candidatos tiene claro el tema... si ni siquiera twittean con claridad...", "group_id": 7153, "id": 971405}, {"user_id": 17517, "stars": [], "topic_id": 34107, "date_created": 1304992417.1885669, "message": "@angiefotografa @rocabos muy buena iniciativa, tenemos que agendar esta idea para que los candidatos la conozcan y nos den tiempo de poder escucharlos, propongo que el día que los candidatos nos den el tiempo, hagamos un streaming en vivo y pues hacemos promoción con anticipación por varios medios para que conozcan la actividad y sea de gran audiencia.", "group_id": 7153, "id": 981910}, {"user_id": 22865, "stars": [], "topic_id": 34107, "date_created": 1305036606.811296, "message": "que se puede pensar de politica 2.0 si ni siquiera tienen claro como maneja las herramientas y su itilidad de manera individual es cuestion de cambio cultural pero en tunja es una cuestion en desarrollo", "group_id": 7153, "id": 989945}, {"user_id": 22913, "stars": [], "topic_id": 34107, "date_created": 1305084861.752821, "message": "Es cierto lo que dice @carlosmanet, pero ellos si utilizan estas tecnologías es por saben que esa una buena manera de llegar a los ciudadanos y sabrán lo elemental. Por otra parte (creo yo) que dentro de @TuiterosBoyacá no hay lugar para la \"política\", así que estamos hablando de algo meramente informativo y sobre todo para que desde ya el futuro Gobernador (que puede ser cualquiera de los futuros citados) se preocupe por mejorar la inclusión de nuevas y \"viejas\" tecnologias para el bien común.", "group_id": 7153, "id": 1000919}, {"user_id": 17517, "stars": [], "topic_id": 34107, "date_created": 1305126477.426621, "message": "Muy bien @rocabos me parece muy bien. Ya estamos buscando que nos contacten con los candidatos a la gobernación para comunicarles y expresarles su idea a ver si participan, tenemos que ponernos de acuerdo para encontrarnos en la ciudad de Tunja para ir a buscarlos, antes de que se pongan juiciosos con las campañas y después no nos paren bolas.", "group_id": 7153, "id": 1008729}, {"user_id": 22913, "stars": [], "topic_id": 34107, "date_created": 1305226827.458132, "message": "Si Señor @Javiersneider lo de proponer antes que se pongan juiciosos es buena idea, yo también me pondré en la tarea de buscar datos.", "group_id": 7153, "id": 1028149}, {"user_id": 17517, "stars": [], "topic_id": 34107, "date_created": 1309760184.3680921, "message": "Como vá don @rodribo con el tema de los datos de los señores candidatos? Hay una propuesta de la CBP de unirnos para hacer un foro, pero en ese caso si se hablaría de todo y no solo del tema tecnológico.", "group_id": 7153, "id": 1558106}, {"user_id": 22913, "stars": [], "topic_id": 34107, "date_created": 1309830750.6523981, "message": "Vamos avanzando en el tema. Aún falta recoger unos cuantos datos. No se, ¿Que opinan que sea más alla del tema tecnologico?", "group_id": 7153, "id": 1563667}]