[{"user_id": 11626, "stars": [], "topic_id": 6686, "date_created": 1297906267.295716, "message": "US defence group Raytheon says it wants to sell India a controversial \"pain gun\" it claims would be safer than rubber bullets in quelling unrest in the insurgency-racked country.\r\n\r\nThe Silent Guardian Protection System is billed by its makers as the 21st century equivalent of tear gas or water cannon -- a way to subdue rioters while inflicting minimal harm.\r\n\r\nThe US military withdrew the weapon last year from war-torn Afghanistan amid opposition from human rights activists worried about its safety. The US army has never commented on why it withdrew the system.\r\n\r\n\"We are meeting various elements of the Indian government, who are seeking information\" on the weapon, senior Raytheon executive George Svitak told AFP at India's largest airshow in Bangalore late on Friday.\r\n\r\nRaytheon says the weapon, which causes agonising pain but no lasting damage, would be less likely to cause injury than water cannon, tear gas or rubber bullets frequently used by Indian troops to break up unruly crowds.\r\n\r\nRaytheon has already sold the system, variously dubbed the \"pain gun\" or \"ray gun\", to unnamed government clients, said Svitak on the sidelines of the airshow slated to end Sunday that has drawn 675 international firms.\r\n\r\nIndia has been searching for better ways to control crowds after 114 people were killed last summer during anti-India street protests in restive Indian Kashmir, mainly by police bullets.\r\n\r\nThe weapon sends out beams of radiation that stimulate human nerve endings from a transmitter the size of a large TV screen mounted on the back of a truck.\r\n\r\nThe beam barely penetrates the skin, meaning it cannot cause visible or permanent injury, said Svitak. However, anyone in its path will feel an extremely painful sensation all over their body.\r\n\r\nIt can also be used to pinpoint individuals.\r\n\r\nIndian Premier Manmohan Singh recently told state police chiefs to deal with protesters humanely.\r\n\r\n\"We need to revisit crowd control measures to deal with public agitations with non-lethal, yet effective and more focused measures,\" Singh said, referring to use of excess force in Kashmir.\r\n\r\nhttp://www.rawstory.com/rs/2011/02/13/raytheon-offers-pain-gun-to-troubled-india", "group_id": 3920, "id": 128097}]