[{"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310981256.8520939, "message": "Hi there!", "group_id": 2515, "id": 1661241}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310981347.464582, "message": "My name is Alastair. I am a new member. I had written about 2/3 of a science fiction book, before i discovered Dramatica. i have spent the last 3 weeks doing nothing but reviewing what I've written and applying Dramatica to it. My question to this group is the following:", "group_id": 2515, "id": 1661246}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310981395.6846509, "message": "How do you know when you have too many ideas for one book? I might well be able to work all of them in, but I wonder if it might be too much...", "group_id": 2515, "id": 1661248}, {"user_id": 7712, "stars": [], "topic_id": 42205, "date_created": 1310984407.9111969, "message": "Personally, I don't believe that anyone can have too many ideas for one book, ever--because that's what trilogies and tetralogies are for.\n\nDramatica will help you narrow down your ideas, allowing you to use the one's that work best in the story... and if some of those ideas that don't fit into the current story are important, then consider plugging them into another Dramatica file for expansion into another book (making a series).\n\nYou may or may not be aware of this, but the default Dramatica setting is to allow only one story file to be open at a single time. That can be changed by going to File > Preferences > General Options > and checking Window Options (file menu can open multiple files).", "group_id": 2515, "id": 1661361}, {"user_id": 33839, "stars": [], "topic_id": 42205, "date_created": 1310989481.843152, "message": "I think it depends on what you mean by ideas.  Details isn't bad, but if you're referring to plot points or things that have to happen, you may get bogged down somewhat.  \n\nThat being said, don't try and make a square peg fit into a round hole.  I like to start backwards - I never start writing until I know how something more or less ends because that's where the meaning of your story is going to come from (especially in Dramatica terms such as failure/success, personal triumph, etc.).  \n\nOnce I know what the central conflict is (problem), then I try to build things organically around it.  Half the fun is not limiting the ideas that come into your head because those are like little explosions that set off other explosions and may lead to something bigger.\n\nBut at some point, you've got to consider yourself something of a sculptor and know what details you can, and can't, use and sculpt away accordingly.", "group_id": 2515, "id": 1661753}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310994749.32567, "message": "Plot points. To answer your question, yes I think I can round everything off nicely. My story has a few facets though, that while adding to the plot and", "group_id": 2515, "id": 1662190}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310995110.9266469, "message": "conclusion, are all involving different technology (that while believable in the framework of what I have written, my be asking a lot of the reader to accept that so many things are happening at once).                                                                                                                                          To clarify: the problem is not one of plot, but instead perhaps asking too much of my audience. I know that it's impossible to answer my question without a lot more detail. The reason that I chose to raise this question on this forum is that it allows me to refine what it is I'm asking. The problem is not that I have too many characters, or issues that are not resolved, it is that I'm afraid i might be asking too much of the reader to accept that so much is going on in such a short period of time.", "group_id": 2515, "id": 1662230}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1310997106.6017139, "message": "btw.   completely off topic, but does anyone know why this forum and facebook both have the very annoying procedure of starting a new entry every time you press return (enter)?", "group_id": 2515, "id": 1662587}, {"user_id": 33839, "stars": [], "topic_id": 42205, "date_created": 1310997057.820334, "message": "It sounds like you're dealing more with context, or defining the world in which your story takes place (establishing rules, locations, etc., all of which have, or should have, some bearing on the story itself).  \n\nIf that's the case, I would think you're going to have to make sure things are well defined and get as much pertinent information into the story up-front such as the basic essentials.  Other little details could be sprinkled about, but yeah, you don't necessarily want to overwhelm your reader.  \n\nI think the best science fiction is able to do this by making things seem/feel similar to how we understand things ourself, finding ways to reveal \"rules\" and whatnot in surprising ways rather than as exposition.  Something like Dark City comes to mind because at its core, it's very \"humanistic\" in the sense it defines what makes us humans.  The beginning of the story does a masterful job of pulling us into a new world that we recognize, along with events and elements of other genres - eventually broadening and revealing its true scope.", "group_id": 2515, "id": 1662577}, {"user_id": 36437, "stars": [], "topic_id": 42205, "date_created": 1310999883.66521, "message": "Convore's designed for snippets, kind of like twitter. Shift+enter should work, but I'm on my phone and only have the \"send\" option.", "group_id": 2515, "id": 1662976}, {"user_id": 10814, "stars": [], "topic_id": 42205, "date_created": 1311001452.9875219, "message": "It depends on the audience you have in mind.  Some readers like intricate stories with many facets and ideas.  The upside to complexity is that they can be rich, interesting, thought provoking experiences (e.g \"Hyperion\").  The downside is that these complex stories can require a lot from the audience.", "group_id": 2515, "id": 1663254}, {"user_id": 10814, "stars": [], "topic_id": 42205, "date_created": 1311001573.8734159, "message": "You job is to find the right balance for you and your audience.", "group_id": 2515, "id": 1663278}, {"user_id": 10814, "stars": [], "topic_id": 42205, "date_created": 1311001548.2650571, "message": "Some readers like more straight forward stories.  The upside is that they are easier to read (generally) and more along at a faster pace.  The downside is that they often are too simple to engage more sophisticated readers.", "group_id": 2515, "id": 1663269}, {"user_id": 38221, "stars": [], "topic_id": 42205, "date_created": 1311059054.552423, "message": "Okay. thanks guys. I think i will keep it as is for now. If when I show people the first draft, they think it is too much I can always simplify it later. What i was considering before was stretching it into 2 or more books, but that is getting a bit ahead of myself at this point I think.  I should write one before I start planning for more.", "group_id": 2515, "id": 1669593}, {"user_id": 7664, "stars": [], "topic_id": 42205, "date_created": 1311087026.819479, "message": "Do you like Sci-Fi? Have you read The Kraken? I've heard that criticized as \"too many ideas.\"", "group_id": 2515, "id": 1671596}]