[{"user_id": 7664, "stars": [], "topic_id": 13114, "date_created": 1300147353.777323, "message": "I'm not familiar with \"scene label\" but I would imagine that it's just a blurb describing what happens or the purpose of the scene.", "group_id": 2515, "id": 352163}, {"user_id": 7712, "stars": [], "topic_id": 13114, "date_created": 1300147853.634625, "message": "Movie Magic Screenwriter....", "group_id": 2515, "id": 352212}, {"user_id": 7664, "stars": [], "topic_id": 13114, "date_created": 1300147254.001008, "message": "MMS?", "group_id": 2515, "id": 352160}, {"user_id": 7712, "stars": [], "topic_id": 13114, "date_created": 1300147120.949053, "message": "I'm in my first college screenwriting class and we are using two books to learn screenplay writing: Story, by Robert McKee & The Screenwriter's Bible by David Trottier.\n\nFor our next assignment, we need to write a Step Outline (Trottier, pgs 115-117) for Act One, which is simply a numbered list of scenes followed by a short narrative describing the scene.\n\nI use MMS and am familiar with Scene Headings and how to number them. Using numbered Scene Headings will provide me the proper format for the assignment, but I also see a selection for Scene Label--and I don't find Scene Label indexed in Trottier's book.\n\nWhat is the Scene Label, and when is it used? ", "group_id": 2515, "id": 352152}, {"user_id": 7712, "stars": [], "topic_id": 13114, "date_created": 1300147886.3759861, "message": "(time for you to cross over to the other side....)", "group_id": 2515, "id": 352215}, {"user_id": 13650, "stars": [], "topic_id": 13114, "date_created": 1300148814.4744351, "message": "Shot in the dark but isn't a script really dealing with \"hard scenes\" such as interior exterior and TOD and content (ala MMS) while in DP we are thinking a bit broader- such as change in dynamics (between elements) but hey I'm trying to write a story <g>", "group_id": 2515, "id": 352294}, {"user_id": 10814, "stars": [], "topic_id": 13114, "date_created": 1300163834.8086679, "message": "I assume you are referring to \"scene label\" as it appears in Dramatica Pro.    The scene label is the word used when referring to \"scenes\" or \"chapters\".  It is not a screenwriting term.", "group_id": 2515, "id": 353463}, {"user_id": 7712, "stars": [], "topic_id": 13114, "date_created": 1300166213.1545219, "message": "Hi Chris, thanks. Actually, I'm referring to Movie Magic Screenwriter. I guess I've gone off topic by asking the question here (apologies to Jim and all). I'll make a post with a screenshot in the Screenplay.com forum. Thanks.", "group_id": 2515, "id": 353569}, {"user_id": 7645, "stars": [], "topic_id": 13114, "date_created": 1300208285.2032299, "message": "No worries. Questions about Screenwriter are probably better answered in the Write Bros forum - http://forums.screenplay.com/viewforum.php?f=11", "group_id": 2515, "id": 358564}]