[{"user_id": 1523, "stars": [], "topic_id": 2295, "date_created": 1297282318.325655, "message": "Sort of a branch from the singularity channel, but I just want to start a discussion to clarify somethign I've been wondering about.", "group_id": 175, "id": 54397}, {"user_id": 1523, "stars": [], "topic_id": 2295, "date_created": 1297282520.7642729, "message": "How can we define what it means to be truely human. Presumably one considers a human corpse, while formerly human, no longer so. At the same time, a super intelligent computer, capable of imitating human thought, not human. Most of us, through our self awareness, strongly identify with our bodies, but is that combination of our bodies with our minds, the only thing that defines the word?", "group_id": 175, "id": 54485}, {"user_id": 1661, "stars": [], "topic_id": 2295, "date_created": 1297289048.2732639, "message": "Where to start? @sunnymolini would you say that you can point out examples of \"human,\" and if so, then from that could you come up with a definition of human? Biological definition: 26 chromosomes corresponding to an explicit sequence of genes with room for variability to account for recessive and dominat traits... Heideggerian: the being in whom the question of being arises...", "group_id": 175, "id": 58555}, {"user_id": 997, "stars": [{"date_created": 1297470325.3859029, "user_id": 1661}], "topic_id": 2295, "date_created": 1297302007.1081791, "message": "re: Heidegger: http://en.wikipedia.org/wiki/Dasein", "group_id": 175, "id": 62488}, {"user_id": 1523, "stars": [], "topic_id": 2295, "date_created": 1297345278.3394101, "message": "@barce, I'm sure that any one of us could easily create a definition that might suffice for ourselves, I'm looking for a definition that can adequately work for the majority of usages. If one were to say that his humanity has been stripped from him, would he mean that someone has robbed him of his DNA? Are scientists who work on the human genome project necessarily Humanitarians?", "group_id": 175, "id": 69262}, {"user_id": 6381, "stars": [{"date_created": 1297470319.6395121, "user_id": 1661}], "topic_id": 2295, "date_created": 1297384078.420182, "message": "I would look up some of Peter singer's ethics, he makes a good definition with regards to rights", "group_id": 175, "id": 76531}, {"user_id": 1661, "stars": [], "topic_id": 2295, "date_created": 1297470302.9140971, "message": "@sunnymolini the mechanism of definition is at odds with *our* intuition of what is human if someone robbed of their DNA cannot be stripped of their humanity, if an objectification of the project that is the human genome project is not humanitarian. The definition of \"human\" versus the definition of human... both are potentialities of the [\"]human[\"].", "group_id": 175, "id": 84725}, {"user_id": 8060, "stars": [], "topic_id": 2295, "date_created": 1297826199.9526169, "message": "Is a fetus considered human? How about a fertilized egg?", "group_id": 175, "id": 117476}, {"user_id": 8060, "stars": [], "topic_id": 2295, "date_created": 1297826226.4051111, "message": "When does one become human?", "group_id": 175, "id": 117479}, {"user_id": 10087, "stars": [], "topic_id": 2295, "date_created": 1299870732.0292921, "message": "assuming normal development, that is", "group_id": 175, "id": 325707}, {"user_id": 10087, "stars": [], "topic_id": 2295, "date_created": 1299870685.934345, "message": "There is no clear point in time, of course, but for a definition we would have to choose one. I would say a fetus of twelve weeks old is a human, at least morphologically: http://www.pregnancy.org/fetaldevelopment/week-12", "group_id": 175, "id": 325705}]