[{"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982152.016135, "message": "La brigada digital es de todos, todas las propuestas son construidas por los voluntarios que la conforman y en ningún momento generan contractual compromiso alguno por parte del Ministerio. \n\nNo es para conseguir contratos.\n\nNo es para hacer campañas políticas.\n\n¡La #brigadadigital es de todos!", "group_id": 2696, "id": 234062}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982079.5506201, "message": "Principios de la Brigada Digital: Colaboración: entendido como el deber de facilitar el acceso a información pertinente y de calidad para facilitar la participación de cada miembtro de escuadrón.\nProactividad: entendido como la capacidad de cada persona y de cada escuadrón en si mismo de promover acciones en el marco de las temáticas correspondiente y de proponer a las instituciones que se articulan acciones que faciliten alcanzar los objetivos propuestos.\nArticulación: No trabajamos solos y no trabajamos en forma individual. La articulación entre instituciones, organizaciones, miembros de la brigada debe facilitar el trabajo en equipo.\nDinamización: Hagamos. Comuniquemos. Promovamos. En el marco de acción de cada escuadrón facilitar que más personas conozcan las actividades que se desarrollan y que se animen a involucrarse.  \nRespeto: Podemos tener nuestras diferencias, podemos tener diferentes formas de trabajo, pero ante todo somos un equipo... y como equipo podemos solucionar las divergencias y llegar a acuerdos. Trabajamos además con ritmos de otras organizaciones y tenemos que aprender a acoplar nuestros ritmos para ser eficientes.", "group_id": 2696, "id": 234053}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982268.006376, "message": "Organización interna de escuadrón: Cada Escuadrón tendrá una coordinación ejecutiva que se encargará de facilitar la articulación del trabajo mismo del escuadrón y de este con la Brigada. La coordinación dentro de la que se incluye el líder de escuadrón, está compuesta por un equipo de enlace, equipo de difusión, equipo de sistematización.\n\nEl papel y/o roles de la coordinación son de articulación más no de imposición o de dirección unilateral “sobre” el escuadrón. Quienes asuman estas responsabilidades deberán facilitar, articular y promover mecanismos de comunicación y/o herramientas de intercambio de información de tal forma que puedan recoger toda la información que produzca el escuadrón y en forma eficiente ponerla a disposición tanto de este equipo como del equipo de la Brigada y viceversa para que la toma de decisión sea fluida, articulada y se actúe en forma de nodos de manera pertinente con la claridad de los objetivos y fines de cada escuadrón y con el fin de fortalecer el trabajo general de la Brigada.", "group_id": 2696, "id": 234074}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982171.8569109, "message": "Los escuadrones de la Brigada Digital están organizados a partir de las dimensiones del plan Vive Digital: Infraestructura, servicios, usuarios, aplicaciones. PRIMERA TAREA conocer el plan http://vivedigital.gov.co/forum/. Estas cuatro dimensiones podrán subdividirse si se logran establecer equipos de coordinación de Escuadrón. \n\nAdicional a estas dimensiones se articularán escuadrones temáticos que por su pertinencia se estructuren alrededor de líneas que en el Plan Vive Digital no se asumían como temáticas individuales, pero por cuya importancia ante el desarrollo del Plan y de la situación social, económica, política, humanitaria, emerjan naturalmente.", "group_id": 2696, "id": 234065}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298981344.948755, "message": "¿Qué es la #BrigadaDigital? \nCiudadan@s con destrezas digitales, creatividad e imaginación, que se movilizan para promover el uso y apropiación de las TIC en Colombia", "group_id": 2696, "id": 234020}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298981431.218025, "message": "Para ver la presentación que se hizo en la primera reunión: http://www.slideshare.net/rosacrisparra/presentacin-de-la-primera-reunin-de-la-brigadadigital", "group_id": 2696, "id": 234028}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298981749.3339701, "message": "La Brigada Digital es una agrupación GENÉRICO en la cual se articulan Escuadrones-temáticos y Nodos-Territoriales. \n\nLa articulación en la Brigada depende de la facilitación que se logre entre MinTic, las demás entidades involucradas y la coordinación de cada escuadrón para promover flujos de comunicación efectivos que permitan que entre los diferentes escuadrones-nodos se dinamice información pertinente y oportuna.\n\nDe quienes coordinen cada escuadrón/nodo dependerá el que se faciliten herramientas de dinamización colectiva de información, de construcción colaborativa y del fortalecimiento y empoderamiento de quienes le conforman. Es competencia de MinTic acompañar a quienes por conocimiento y/o por liderazgo asumen la coordinación de escuadrones y nodos y debe propender por articular a través de ellos las acciones que les competan a cada uno (escuadrón/nodo). \n\nLos nodos territoriales se articularán a través de la estrategia de territorios digitales. Por esta razón un escuadrón podrá tener nodos regionales, incluso, en donde no hay nodos oficialmente establecidos pero un nodo no podrá actuar en forma independiente a un escuadrón temático. A la larga lo que se buscará es que en todos los nodos se encuentren líderes de escuadrón que se articulen en una gran red temática la cual a su vez se articula a la Brigada.", "group_id": 2696, "id": 234037}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982663.259413, "message": "En próximas semanas se presentará el sitio oficial de articulación de la Brigada. La plataforma facilitará la articulación por Escuadrón, por nodos y la dinamización de información y articulación con otras entidades y con público que aún no participa de la misma para promover que se incorporen.", "group_id": 2696, "id": 234101}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298982360.6156671, "message": "Minimos de escuadron: \n\nCompetencia técnica es necesario que el escuadrón se cualifique a partir de la información y el conocimiento que produzcan y compartan sus miembros. Esta competencia además debe servir para generar nodos internos de acompañamiento y de cualificación de la brigada. \n\nArticulación digital: Siendo parte de la brigada digital es necesario que cada escuadrón genere una estrategia de divulgación, de construcción colaborativa de conocimiento y de articulación de TIC tanto para la divulgación como para uso en el trabajo mismo del escuadrón. Por ej. Mapeos. \n\nArticulación local: el escuadrón debe tener capacidad de articularse con las autoridades locales de cada línea temática y estar en capacidad de llevar el conocimiento colectivo en dos vías, tanto de lo local a lo general como de lo general a lo particular. \n\nArticulación institucional: Teniendo presente que el vínculo coordinador está establecido con el MinTic/o la entidad correspondiente del sector es fundamental el trabajo de articulación que en su área temática desarrolle el escuadrón. Por lo tanto no solo es esencial una competencia técnica, sino que se requiere competencia social, política e institucional para facilitar el diálogo entre actores y en especial la articulación de la sociedad civil en forma organizada a los espacios institucionales para fortalecer ambas vías. \n\nCapacidad de gestión: la interrelación entre los mínimos facilitará la capacidad de autogestión propia del escuadrón la cual se debe observar en un avance significativo de articulación del escuadrón", "group_id": 2696, "id": 234079}, {"user_id": 13453, "stars": [], "topic_id": 9688, "date_created": 1298983610.4079151, "message": "Para propuestas de nuevos escuadrones importante ver su interrelación con http://vivedigital.gov.co/forum/ y comunicarse con @ClaudiaBerbeo para la articulación", "group_id": 2696, "id": 234177}]