[{"user_id": 29458, "stars": [], "topic_id": 21055, "date_created": 1303606853.246465, "message": "It seems like every few years new technology spawns new job titles that virtually anyone with hands on experience can qualify for, because universities aren't offering degrees in it, yet. What does someone need to know to be a successful Social Media Manager?", "group_id": 553, "id": 792468}, {"user_id": 4070, "stars": [{"date_created": 1303694131.7248609, "user_id": 29458}], "topic_id": 21055, "date_created": 1303616175.4318221, "message": "How to spam.", "group_id": 553, "id": 792823}, {"user_id": 27374, "stars": [], "topic_id": 21055, "date_created": 1303624494.2410409, "message": "@Jon looool :-)", "group_id": 553, "id": 792984}, {"user_id": 29458, "stars": [], "topic_id": 21055, "date_created": 1303694124.826858, "message": "Valid point! There are a lot of honest companies out there that inadvertently get labeled as spammers because they don’t respect people (I’d say followers, or users, but it’s really just not respecting people—isn’t it?). All the more reason for knowledgeable social media management. Right? How do you market without spamming in social media?", "group_id": 553, "id": 797723}, {"user_id": 4070, "stars": [{"date_created": 1303696959.2609291, "user_id": 30794}, {"date_created": 1303712573.3576751, "user_id": 27374}, {"date_created": 1306086442.8183739, "user_id": 416}], "topic_id": 21055, "date_created": 1303696903.128855, "message": "You make customer love an integrated part of product; you don't just hire some TweetDeck fiend to make you one of his or her 37 other Twitter accounts. The person reaching out should be someone with a direct stake in the goodness of the product or service.", "group_id": 553, "id": 797941}, {"user_id": 18485, "stars": [{"date_created": 1303696975.4308119, "user_id": 30794}, {"date_created": 1303712569.778532, "user_id": 27374}, {"date_created": 1306086441.9062951, "user_id": 416}], "topic_id": 21055, "date_created": 1303695451.755089, "message": "IMO the key is sharing original content that people care about.", "group_id": 553, "id": 797814}, {"user_id": 27374, "stars": [], "topic_id": 21055, "date_created": 1303712701.2247009, "message": "Absolutely agree, @JonMwords and @craigship The time of pushing and shouting people should be over with the social web, what's name says, what it is about: socialising.", "group_id": 553, "id": 800492}, {"user_id": 17882, "stars": [], "topic_id": 21055, "date_created": 1303807825.770148, "message": "In TV there is a trade off with ads, although they interrupt the programme that we really are interested in we tolerate them because they can provide entertainment value in themselves. Many companies/users of social media have yet to understand this and instead adopt a more hard sell approach and then wonder why they do not get the results they expected.", "group_id": 553, "id": 811887}, {"user_id": 31181, "stars": [], "topic_id": 21055, "date_created": 1303829967.4636209, "message": "\"Effective\" is a very relative term, when we speak of social media.  However, the base-competencies (for a business client) would include Facebook Fanpage, Twitter Presence, LinkedIn Profile, and YouTube Channel.  These build a \"Power Cluster\" and must be closely associated for a client.  The \"manager\" part requires that you keep the content current on a weekly basis.  Kate Buck Jr. has some excellent material on the subject of \"Social Media Manager.\"  Have fun, too!", "group_id": 553, "id": 815310}, {"user_id": 18485, "stars": [], "topic_id": 21055, "date_created": 1303832398.710402, "message": "@ambermac does a good job in her book Power Friending explaining all of this.", "group_id": 553, "id": 815746}, {"user_id": 416, "stars": [], "topic_id": 21055, "date_created": 1306086589.139487, "message": "@craigshipp Agreed. If original content is hard to produce, curating others' content can also work and even act as conversation starters for your social media community. There is too much noise so curation is way to get people to tune in to your social channels.", "group_id": 553, "id": 1142986}, {"user_id": 416, "stars": [], "topic_id": 21055, "date_created": 1306086412.56534, "message": "@michaelwalmsley You are right, most don't see social media as new media channels but simply new ways to blast messages.", "group_id": 553, "id": 1142981}, {"user_id": 29458, "stars": [], "topic_id": 21055, "date_created": 1306181898.0199471, "message": "It sounds like everyone is saying that the way to be a good Social Media Manager is to learn traditional pick-up-the-phone PR techniques. Actually connect with real people and develop relationships until the medium you use to connect no longer matters.", "group_id": 553, "id": 1156649}, {"user_id": 6914, "stars": [], "topic_id": 21055, "date_created": 1307772659.3226621, "message": "Well social media is just a new tool. The underlying principle is still the same - be where your customers are. If your customers are in SM, then get on it. \nTo be effective, a person must be willing to learn & explore. There are a TONS of successful case studies out there already, if u're willing to study and learn what makes it tick and what doesn't, u're halfway there! :)", "group_id": 553, "id": 1368823}]