[{"user_id": 24154, "stars": [], "topic_id": 18557, "date_created": 1302531651.59635, "message": "What did you learn? What did you think? This is a thread to discuss midwestUX 2011", "group_id": 345, "id": 624402}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302545391.961139, "message": "data driven dashboards talk, good talk for our insight translation folks, useful info, still think the harder issue/question is where the data is to get and analyze in the first place, one tweeter talked about sitting by the printer to see what people print, i liked that idea of figuring out what people are printing out for data/view etc", "group_id": 345, "id": 627354}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302544969.046747, "message": "Hmmm many thoughts, here is my initial gist.  Well produced, you guys did a great job.  Well attended and tweeted, lots of folks there, good attendance and lotta tweets.  Content was mixed but I tend to lean toward the future thinking/tech stuff more and this conf wasn't totally about that.  Presenters, some did better than others.  I would of liked to see more opinion engagement from audience members, didn't really see enough people do that in questions or in the tweets.  Keynoters were good and I even got to talk to a few of them afterwards, good stuff there.  Venue was decent.", "group_id": 345, "id": 627284}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302545445.61339, "message": "flip this lab, kinda of yawn one, most interesting part of the presentation was the crazy make cspan more interactive research they were doing, people wanted to know more about that than the point of their talk", "group_id": 345, "id": 627368}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302545299.14149, "message": "bit observations, saturday, track 1: donde esta, good talk but you can't help but wonder what innovations like the \"word lens\" and how translation technologies are getting so good so fast on whether or not we need universal symbols for stuff, if our future augmented reality viewfinder translators+eye implants are just gonna convert symbols and text on the fly anyways, too future crazy dan? sure, but again \"word lens\" like tech momentum + google translation empire isnt slowing down any time soon, could of been a fun discussion at the end of that talk", "group_id": 345, "id": 627335}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302545478.0662069, "message": "little people big challenges, probably the best talk i saw the whole weekend, should be saved and used at lextant for all kids research", "group_id": 345, "id": 627372}, {"user_id": 1125, "stars": [], "topic_id": 18557, "date_created": 1302545485.4099979, "message": "so i guess i learned a bit", "group_id": 345, "id": 627373}, {"user_id": 24154, "stars": [], "topic_id": 18557, "date_created": 1302547187.0937591, "message": "MidwestUX Report on JohnnyHolland.org: Day 1\nhttp://johnnyholland.org/2011/04/10/midwestux-report-day-1/", "group_id": 345, "id": 627752}, {"user_id": 24154, "stars": [], "topic_id": 18557, "date_created": 1302547150.8741951, "message": "MidwestUX Report on JohnnyHolland.org: Day 2\nhttp://johnnyholland.org/2011/04/11/midwestux-report-day-2/", "group_id": 345, "id": 627743}]