[{"user_id": 11626, "stars": [], "topic_id": 6725, "date_created": 1297913454.7363811, "message": "That’s Army Maj. Gen. Joseph Votel on the left.\r\n\r\nDo not expect to see his face again any time soon. An elite — and controversial — team of worldwide terrorist hunters just wouldn’t be the same if its leader were in the spotlight.\r\n\r\nThe Pentagon announced Wednesday afternoon that Votel will be the next commander of the Joint Special Operations Command, taking over from Adm. William McRaven and earning his third star. It’s a job that Votel has a lot of familiarity with: he used to be the command’s deputy leader before taking his current job as chief of staff for the U.S. Special Operations Command.\r\n\r\nPresident George W. Bush famously called JSOC, as it’s known, “awesome.” No surprises why: Its secretive operations include capturing and killing high-value terrorists and insurgents.\r\n\r\nUnder its most famous leader, Gen. Stanley McChrystal, it got its highest-profile kill in June 2006, when it iced Abu Musab al-Zarqawi, the leader of al-Qaeda in Iraq. It also ran the notorious detention center near the Baghdad airport, Camp Nama, where there were repeated allegations of torture.\r\n\r\nThe sign on the entrance? “NO BLOOD, NO FOUL,” according to The New York Times.\r\n\r\nJSOC has increasingly been the tip of the military’s spear. In Afghanistan, its commandos are the ones who kick in doors for the “night raids” on Afghan homes, especially in the South and East, that have angered Hamid Karzai but form a critical part of Gen. David Petraeus’ war plan.\r\n\r\nSometimes its operations go awry, as when an October 2010 rescue mission to free British aid worker Linda Norgrove from Taliban captivity ended up killing the hostage. The man U.S. Central Command tapped to investigate what went wrong? Joseph Votel.\r\n\r\nVotel also has a lot of familiarity with the Afghanistan-Pakistan border regions that consume a lot of JSOC’s time. Back in 2007, he was the deputy commander of Combined Joint Task Force 82, which operated along the border. That means unlike many commanders of the high-powered raiding unit, Votel has experience being a “landowner” — that is, a soldier who has to deal with an angered population after the raid team has packed up and moved out.\r\n\r\nHe’ll have to deal as well with a very tired Special Operations community — a problem Votel’s current boss, Adm. Eric Olson, identified last week in a speech. But JSOC doesn’t get breathers: It’s likely to expand operations in Yemen, Pakistan, Somalia and other parts of the world where the military wants terrorists dead without any fingerprints.\r\n\r\nAnd don’t expect Votel to give any press conferences about his work.\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/pentagons-secret-killers-get-a-new-leader", "group_id": 3920, "id": 129202}]