[{"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301377999.015662, "message": "Let's say youve been workin on your startup for some time. Now let's say you met another entrepreneur with an interesting idea who has something of an MVP. You like this other entrepreneur. Would you give up on your idea to work with them on theirs?", "group_id": 250, "id": 466604}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301378112.0389061, "message": "The reason I ask is because I'm looking for cofounders / first employees for my bootstrapped startup. Whenever I go to an entrepreneur event I just meet people who are doing their own startup. Perhaps those are the wrong places to look?", "group_id": 250, "id": 466619}, {"user_id": 22183, "stars": [], "topic_id": 15960, "date_created": 1301378768.23842, "message": "I think it all depends on the idea and how compatible you are with their vision and the person.", "group_id": 250, "id": 466678}, {"user_id": 26065, "stars": [{"date_created": 1301459578.3139811, "user_id": 224}, {"date_created": 1301472706.468488, "user_id": 24859}], "topic_id": 15960, "date_created": 1301403385.7287631, "message": "I think you need to be very careful how you present this. If I compare the title of your post and your explanation in the second one I get 2 completely different vibes. The title (work for) puts you in the \"yet another guy with an idea who wants me to work for free so he can get rich\" group where you definitely don't want to be in (see the quora posts on that topic ;). Mentioning the co-founder puts that into a much more favorable light. In general everything before either traction or funding should be considered founder or co-founder, and if your idea is really great and there is chemistry than this is something that people might consider.", "group_id": 250, "id": 469189}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301460476.9691341, "message": "Sorry. I wanted to edit the title but couldn't figure out how (plus it was typed in haste from my iPhone). I wanted to say \"Would you work WITH another unfunded entrepreneur?\" Although it may have been a Freudian slip. ;P", "group_id": 250, "id": 477463}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301460599.3153031, "message": "I know how you feel. As a veteran developer, I get that vibe all the time. However, I don't find myself completely agreeing with your final statement. I've spent a good part of the last year building a vision, company and product by myself. Let's say I wanted to work with some junior guys right out of school. You're saying that they are necessarily \"co-founders\"? I'm not saying a blanket \"no\" but I would have to give it some thought.", "group_id": 250, "id": 477491}, {"user_id": 26065, "stars": [], "topic_id": 15960, "date_created": 1301470353.926862, "message": "If you don't feel that they are good enough to be co-founders than you should continue looking. In the initial phases of any startup you need co-founders, not employees. From my experience small differences in the \"vibe\" of a startup define if you are ultimately successful or not. BTW, one solution for your problem might be to propose something like \"would you help me out with my startup if I help you with yours?\". A lot of people are willing to help out a couple of hours a week and there is a lot that can be accomplished as this is focused time. This is also a good screening process to figure out who talks and who does.", "group_id": 250, "id": 479351}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301530137.0977261, "message": "Lastly, I'm willing to help people but not to the point of distracting me from my startup. It's an interesting idea and definitely a way of seeing how well people work together. It just seems like a large investment and a slow way of filtering people.", "group_id": 250, "id": 486009}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301529973.2774799, "message": "Interesting. I respect your viewpoint but disagree on both points. Maybe it's semantics but someone who comes onboard after the vision has been defined and product has been designed isn't always a cofounder. And because they aren't, doesn't have bearing necessarily on what a company needs. In fact in the last startup I worked at, I knew the first employees (all my friends). They were not cofounders, but played a core part in the company. Perhaps there's a difference because they were funded. :)", "group_id": 250, "id": 485999}, {"user_id": 22729, "stars": [], "topic_id": 15960, "date_created": 1301530060.5822179, "message": "But I guess I dont' agree with your blanket statements. I think people of varying degrees of experience can be vital to a company without all of them being cofounders. That's not to say that they all don't have a signficant equity stake in a company. I guess I don't agree with this notion that everyone is a \"cofounder.\" I'd probably definte it situatoin by situation.", "group_id": 250, "id": 486003}, {"user_id": 26065, "stars": [], "topic_id": 15960, "date_created": 1301832941.3457651, "message": "Funding makes all the difference ;) Personally, after a lot of experience with startups both good and bad I believe that before you reach product / market fit you should not think about employees at all, instead focus on finding two good co-founders who you click with. 2 or 3 people with a shared vision and without distraction can achieve a lot these days.  On a second note there is no fast way of filtering people, finding the right ones is the most important aspect of any startup and also the most time-consuming and the most expensive in the long run.", "group_id": 250, "id": 514285}]