[{"user_id": 11626, "stars": [], "topic_id": 7700, "date_created": 1298236530.9527431, "message": "(NaturalNews) – The U.S. Department of Defense (DOD) has embarked on an unconventional new counter-terrorism program aimed at detecting bombs and other explosives. According to CBS 4 in Denver, Colo., DOD has given $8 million to Colorado State University (CSU) to grow plants that are capable of detecting dangerous weapons at places like airports, malls, and sports arenas.\r\n\r\nPublished in the journal PLoS ONE, the paper by CSU scientists outlining the research explains that through genetic modification, plants can be programmed to change color in the presence of various chemical contaminants like explosives. So instead of passengers having to be herded through invasive screening contraptions at airports, security agents could instead walk them through a pleasant, bomb-detecting garden, claim researchers.\r\n\r\n“If this plant would sense an explosive or an environmental pollutant, it would turn white,” explained CSU biology professor Dr. June Medford, who is leading the research. “They can detect multiple substances and they can turn different colors.”\r\n\r\nSince each plant can be programmed to detect a different substance, the marketability of the concept is widespread, according to researchers. If an average person wanted to detect the presence of radon or carbon monoxide in his or her home, for instance, he or she could purchase a custom-made plant designed specifically for such purposes.\r\n\r\nAt this point, the experimental plants take several hours to actually change color in the presence of chemicals, so they are not yet ready for commercial use. But with enough tweaking, the team claims the plants may eventually be quick enough to replace many common security protocols.\r\n\r\nScientists are also working to ensure that the bomb-sniffing plants in particular only change color in response to explosive chemicals, and not other chemicals like perfume scents. Medford says that it will likely be at least another five to seven years, though, before the technology will be ready for mainstream use.\r\n\r\nSources for this story include:\r\n\r\nhttp://denver.cbslocal.com/2011/01/26/csu-gets-grants-for-bomb-detecting-vegetation\r\nhttp://www.plosone.org/article/info:doi/10.1371/journal.pone.0016292;jsessionid=9E6895D8F62E08DA00CA29E1E6705A22.ambra02\r\n\r\nhttp://dprogram.net/2011/02/20/university-receives-government-grant-to-grow-bomb-sniffing-plants", "group_id": 3920, "id": 154768}]