[{"user_id": 30658, "stars": [], "topic_id": 37444, "date_created": 1308367829.6380391, "message": "I'm in the same boat, stuck with ip 3G.  Don't forget the new nexus due thxgiving", "group_id": 97, "id": 1424735}, {"user_id": 15929, "stars": [], "topic_id": 37444, "date_created": 1308372955.4042821, "message": "on 3GS, waiting for iPhone 5", "group_id": 97, "id": 1425068}, {"user_id": 20715, "stars": [], "topic_id": 37444, "date_created": 1308385285.044013, "message": "When's the best guess due date for iPhone 5?", "group_id": 97, "id": 1425519}, {"user_id": 4831, "stars": [], "topic_id": 37444, "date_created": 1308397893.0429311, "message": "The S2 looks like a pretty nice phone... IOS has never been for me, i hear around sept for the next iphone but ya know that's all bs untill apple says it's so", "group_id": 97, "id": 1426140}, {"user_id": 2726, "stars": [], "topic_id": 37444, "date_created": 1308414101.5643411, "message": "September. The fanboys are good at predicting. Will come with iOS 5", "group_id": 97, "id": 1427304}, {"user_id": 34462, "stars": [], "topic_id": 37444, "date_created": 1308416593.759228, "message": "I don't understand why anyone would consider a mobile device that wasn't open-source.  Proprietary software, surely, isn't trustworthy - and our most sensitive information passes through our hands and handhelds.  Plus, when you compare what Apple permits with what user-developers create, the software giant seems downright innovation-conservative!", "group_id": 97, "id": 1427454}, {"user_id": 15929, "stars": [{"date_created": 1308505038.9995761, "user_id": 34462}, {"date_created": 1308728317.593051, "user_id": 12641}], "topic_id": 37444, "date_created": 1308422214.9107399, "message": "\"Proprietary software, surely, isn't trustworthy - and our most sensitive information passes through our hands and handhelds.\" << On that note, you should disconnect your phone and internet access, your phone company and ISP are proprietary and have plenty more access than Apple does through a single device.", "group_id": 97, "id": 1427815}, {"user_id": 15929, "stars": [], "topic_id": 37444, "date_created": 1308423131.202167, "message": "for your 2nd point, IMO, limitation breeds innovation. e.g. the more innovative countries of the world in general are countries with lack of natural wealth. Plus, have you ever really try to develop for iOS, Android, or anything else? Again, IMO, among iOS, Android, and BlackBerry, Android is the toughest one to build for. BB is decent but nearly impossible to support 100% devices that are still in the market.", "group_id": 97, "id": 1427861}, {"user_id": 34462, "stars": [], "topic_id": 37444, "date_created": 1308505211.818763, "message": "' @unwrangle You're right that limits encourage creativity! Without a box, how can you think outside of it?", "group_id": 97, "id": 1432535}, {"user_id": 2726, "stars": [], "topic_id": 37444, "date_created": 1308969243.205821, "message": "There really is no completely open source option. I'd be all for a totally open source option but I don't see it happening closer to the hardware level anytime soon.", "group_id": 97, "id": 1482403}, {"user_id": 19238, "stars": [], "topic_id": 37444, "date_created": 1308982575.1862919, "message": "@brax4444 webOS?", "group_id": 97, "id": 1483043}, {"user_id": 2726, "stars": [{"date_created": 1309155518.938163, "user_id": 19238}, {"date_created": 1309304325.2268579, "user_id": 34462}], "topic_id": 37444, "date_created": 1309025061.079149, "message": "@NARKOZ WebOS: Proprietary OS running on top of a Linux kernel running on proprietary hardware. Parts of iOS are free and open source. Some parts aren't. Webkit is open source from Apple and that's a key part of WebOS and Android. Even if we had a totally open source mobile phone software stack from the kernel up, I don't know of any options below that which would be be free of proprietary technology including software but also hardware.", "group_id": 97, "id": 1485004}, {"user_id": 10453, "stars": [], "topic_id": 37444, "date_created": 1309028661.212189, "message": "I prefer open source software .. but the list of App's in the market on Apple Store is a lot and useful for me.. even if they arent free.. When android's app market will increase their applications like Apple store?.. =/", "group_id": 97, "id": 1485246}, {"user_id": 3224, "stars": [], "topic_id": 37444, "date_created": 1309067327.794816, "message": "iPhone. I prefer great quality products, no matter if they're open source or not. I work with and on open source stuff, but actually because they're great, not because they're open.", "group_id": 97, "id": 1487458}, {"user_id": 37074, "stars": [], "topic_id": 37444, "date_created": 1309196663.5877221, "message": "Galaxy S2 hand down,Great Hardware,Awesome Screen.Iphone 4 still is a year behind in terms of hardware and display quality", "group_id": 97, "id": 1497785}, {"user_id": 27026, "stars": [], "topic_id": 37444, "date_created": 1309247167.7888551, "message": "Waiting for iPhone 5", "group_id": 97, "id": 1504011}, {"user_id": 34462, "stars": [], "topic_id": 37444, "date_created": 1309304440.021364, "message": "@Josesordo I don't put much value in Apple's massive collection of colorful squares. I want to say \"If there isn't an open source option, it's not worth doing.\"", "group_id": 97, "id": 1512836}, {"user_id": 34462, "stars": [], "topic_id": 37444, "date_created": 1309304583.630908, "message": "@leonardo Meta-quality over quality. The proprietary methodology isn't sustainable. If people can't trust one another, we're not long for this world. =)", "group_id": 97, "id": 1512851}, {"user_id": 10453, "stars": [], "topic_id": 37444, "date_created": 1309451087.8689351, "message": "=/", "group_id": 97, "id": 1529386}, {"user_id": 34942, "stars": [], "topic_id": 37444, "date_created": 1309505294.2544119, "message": "I'd wait till the end of September and make a decision at that time (after getting some hands-on time with whatever options are available).", "group_id": 97, "id": 1538169}, {"user_id": 25673, "stars": [], "topic_id": 37444, "date_created": 1309626730.15871, "message": "Galaxy S2!", "group_id": 97, "id": 1548496}, {"user_id": 4831, "stars": [], "topic_id": 37444, "date_created": 1309752199.6616769, "message": "the S2 is going to be an awesome phone.. Though i am wondering what the next nexus will bring with it... (i cannot upgrade for a year i just got the EVO 3D it's awesome)", "group_id": 97, "id": 1557291}, {"user_id": 17124, "stars": [], "topic_id": 37444, "date_created": 1309774295.40466, "message": "So the question was, whether to buy a Galaxy S2 or iPhone 4 or wait for iPhone 5;\nI'd say buy either one, but only if you really need a new phone. In case you don't really need a new (smart)phone, don't buy anything! \nAt least until iPhone 5 is out. Even then I wouldn't be in a hurry, because the demand for the new iPhone will be insane, again, for the first few months. Let the earliest adopters trample on and flag the possible mines first.\n\nAs for the Samsung vs iPhone, I think it's purely a matter of taste and personal preferences. I don't think it's such a meaningful comparison to begin with, it's like comparing apples to oranges. Or choosing between a Windows computer or a Mac. A Windows machine is no substitute for a Mac for many, but many other people find them just fine. So choose whichever platform you fancy more. Or a n HP Pre 3, or a Blackberry.\n\nI for one will probably be using my iPhone 3GS even for yet another year or so, because it works just fine, still looks like new, and will run iOS 5, so I don't necessarily need a new phone. I for one will wait for iPhone 5 with no hurry whatsoever, or perhaps even HP Pre 3, if I feel like changing the brand and OS. Although I already have a number of iOS apps, so iPhone is likely to be the first choice. Android phones aren't really my cup of tea, nor are the few WP7 phones I've seen.  \nBut whatever floats your boat, and not anyone else's.", "group_id": 97, "id": 1558757}, {"user_id": 13501, "stars": [], "topic_id": 37444, "date_created": 1309946610.5407469, "message": "I am gonna getting SII tomorrow... don't get iPhone 4, wait for the whoppy choppy iPhone5 instead [edit] I am using 3GS now... so I have plenty of reasons for this (and my contract just expired)", "group_id": 97, "id": 1574266}]