[{"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318396139.2246959, "message": "Woz, gran ingeniero que se divierte con lo que hace y no le detienen los supuestos imposibles. Pero sin ojo pa los negocios.", "group_id": 965, "id": 2330447}, {"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318393776.627259, "message": "Tambien se vale nombrar a otros, como Jeff Bezzos o Larry y Sergey o Zuck.", "group_id": 965, "id": 2330195}, {"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318393827.857156, "message": "Personalmente no creo tener la visión y mucho menos el carisma de Steve, así que yo tomaría un camino un poco más a lo Bill Gates solo menos sucky.", "group_id": 965, "id": 2330199}, {"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318393725.5254121, "message": "Pregunta Hipótética: Si tuvieran que elegir un modelo de líder a quien seguir quien preferirían ser? Steve Jobs, que cree que tiene una visión clara del futuro y trabaja empecinadamente para moldear el futuro según su idea; o Bill Gates, que espera a ver un mercado prometedor y se lanza sin piedad a aniquilar a sus competidores con la fámosa técnica de Abrazar, Extender y Extinguir?", "group_id": 965, "id": 2330190}, {"user_id": 20536, "stars": [], "topic_id": 46447, "date_created": 1318395531.3541839, "message": "Yo preferiría tener de mentor a Steve Wozniak, siempre y cuando no me diga que entre a Dancing with the Stars", "group_id": 965, "id": 2330391}, {"user_id": 42144, "stars": [{"date_created": 1318422609.359971, "user_id": 37376}, {"date_created": 1318434876.288965, "user_id": 34039}, {"date_created": 1318435478.6413341, "user_id": 24160}], "topic_id": 46447, "date_created": 1318399153.1469181, "message": "1) Mark Shuttleworth. Porque a los 25 años vendió la empresa que fundó a los 21 años por más de 500 millones de dls, lo hizo desde Sudáfrica, no desde SV. De ahí en adelante sus emprendimientos han sido principalmente sociales. Además, el nombre de su firma de VC (HBD) es el mejor que ha existido y existirá para un VC (ver aquí que significa HBD: http://en.wikipedia.org/wiki/Here_be_dragons).\n\n2) Marc Fleury. Aquí explica varias de las razones por las que admiro a Marc (http://blog.linuxtoday.com/blog/2008/06/5-reasons-why-j.html). Lleva 4 años desaparecido de la industria y no creo que regrese, y creo que lo admiro todavía más por eso.\n\n3) Jeff Bezos. Una y otra vez le ha dado clases al mundo sobre como aprovechar la tecnología para habilitar nuevos modelos de negocio. Amazon ha sido pionera en muchos aspectos que hoy son stepping stone (compras en línea, advertising one-to-one, tablets, cloud computing). Y lo ha hecho de forma elegante. Con el único que ha tenido confrontación es con Apple y fue porque le pareció ridículo no poder llamarle \"App Store\" a su tienda, lo cual es una cuestión más de principios que de otra cosa. Además, me gusta mucho el speech que dio en Princeton (http://articles.businessinsider.com/2010-06-22/tech/30026156_1_airstream-puff-caravan-club)\n\n4) Tim O'Reilly. Porque su negocio se basa en que otras personas se desarrollen profesionalmente. Porque su industria y modelo de negocio sufrio una revolución y ha sabido manejarlo y mantenerse exitoso, abrazando el cambio. Porque los libros de O'Reilly son DRM free, lo cual me dice que le da el beneficio de la duda a sus clientes. Porque se involucra en temas que considera que son de beneficio para la sociedad. \n\n5) Derek Sivers. No es muy conocido y las biografías que hay sobre él en internet son muy breves. Habría que leer su libro, el cual recomiendo mucho (http://sivers.org/a)", "group_id": 965, "id": 2330721}, {"user_id": 37376, "stars": [], "topic_id": 46447, "date_created": 1318422783.908241, "message": "@pedrogk Excelente Top5! En cuanto a Steve y Bill, creo que todos sabemos lo que son, lo que no nos damos cuenta a simple vista es como sus esquemas comerciales y estrategias son de aplaudirse en ciertos momentos, pero llegan a un punto donde detienen el desarrollo y la democratización tecnológicos.", "group_id": 965, "id": 2331932}, {"user_id": 16337, "stars": [], "topic_id": 46447, "date_created": 1318430499.9114449, "message": "@pedrogk wow! No tenía en el radar algunos personajes de los que mencionas. Se pudiera a incluir a Marc Benioff, CEO de Salesforce, quien empezó con la onda cloud antes de que se convirtiera en buzzword", "group_id": 965, "id": 2332518}, {"user_id": 27909, "stars": [], "topic_id": 46447, "date_created": 1318432321.5758531, "message": "Steve Jobs creo la computadora personal como la conocemos (y luego la mato con el iPad y el iPhone), pero Bill Gates creo la industria de la PC como la conocemos (y si, el la creo, no se la quito a nadie) por lo que tuvo el mayor impacto en el mundo. Por esta razon mas los esfuerzos que esta haciendo ahora post-Microsoft (personalmente) lo pongo mas arriba (Ok, aunque ahora podemos argumentar que Steve Jobs creo las industrias de smartphone y dispositivos post-PC, asi que vamos de regreso al principio). Agregaria a Marc Benioff, Jeff Bezos y Marc Andreessen y quedan mis top 5.", "group_id": 965, "id": 2332672}, {"user_id": 24160, "stars": [], "topic_id": 46447, "date_created": 1318436780.4857991, "message": "Cómo a muchos otros, tanto Jobs como Gates me inspiran por sus aciertos y de pronto me aterran por sus defectos. Aún así, creo que me identifico más con Steve Jobs. Sin embargo, mi modelo de líder es Sir Richard Branson. Me gusta la forma en la que encuentra oportunidades de negocio por todos lados y toma riesgos enormes para probar si puede capitalizar la oportunidad. También me gusta su enfoque en la experiencia humana como el eje de todo lo que hace. Les recomiendo muchísimo su autobiografía titulada \"Losing my virginity\" (http://amzn.com/0307720748)", "group_id": 965, "id": 2333068}, {"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318452835.502878, "message": "@pedrogk +1 a Derek Sivers. Acabo de leer su libro y lo admiro.", "group_id": 965, "id": 2334457}, {"user_id": 2946, "stars": [], "topic_id": 46447, "date_created": 1318453048.207197, "message": "Howard Schultz está tambien en mi top 10. Eso de tomar una tiendita hipster de café y convertirla en la cadena de cafeterías mas grande del mundo es un gran acierto.", "group_id": 965, "id": 2334472}, {"user_id": 25716, "stars": [], "topic_id": 46447, "date_created": 1318632429.4446001, "message": "@cesarsalazar +1 para Branson. El es un caracter muy interesante, y historia increible", "group_id": 965, "id": 2349817}]