[{"user_id": 15784, "stars": [], "topic_id": 8979, "date_created": 1298611563.877954, "message": "Maybe it's just my perception, but when Steve Jobs took to the mic last year and announced to everyone that Flash was gonna steal your women and harm your babies, i think he did a considerable amount of damage to our industry. It's tough to sort out the Steve factor from the recession aftershocks. How much havoc do you think Jobs wrought? On the service side, can clients still be convinced that Flash is a viable option over HTML 5 and other competing technologies?", "group_id": 4419, "id": 206074}, {"user_id": 15691, "stars": [], "topic_id": 8979, "date_created": 1298613301.5730391, "message": "Are you being serious? Nothing has changed in the flash industry because as a result of Steve Jobs / Apple. Flash games are played primarily on the computer and not on mobile devices.  It's not like the dying Arcade industry is hurting anyone anywhere else. The recession had little or no effect on the industry too. For the past few years numbers have been better than ever before. HTML 5 isn't a threat to flash in it's current state. It can't be distributed easily, and it's not nearly as powerful. If there's something to be scared of it's unity, but Flash and Unity can easily co-exist.", "group_id": 4419, "id": 206223}, {"user_id": 15766, "stars": [], "topic_id": 8979, "date_created": 1298617571.115762, "message": "Flash is king at the moment. With Molehill on the cusp of release, I don't see HTML5 catching up performance wise. Unity is a wonderful development environment but currently lacks an impressive install base, we are just starting to see the Unity plug-in being adopted by some game portals. People will probably start doing more web site development in HTML5 but game development wise, Unity and possibly Silverlite might be edging in on Flash's game market over the next few years.", "group_id": 4419, "id": 206405}, {"user_id": 15702, "stars": [], "topic_id": 8979, "date_created": 1298618489.651835, "message": "html5 is great for streaming video and little else. It isn't going to hurt the game industry. so to answer your question, \"no\"", "group_id": 4419, "id": 206445}, {"user_id": 15901, "stars": [], "topic_id": 8979, "date_created": 1298621315.7045851, "message": "Many have tried to kill flash, but they've made it only stronger. I'm only worried for Unity though, as its spread continuosly grows.", "group_id": 4419, "id": 206558}, {"user_id": 15743, "stars": [], "topic_id": 8979, "date_created": 1298652281.792614, "message": "Heck no! Flash still dominates the web, HTML5 is still a beta at best, and Adobe AIR is allowing developers to rock their source code on mobile devices like Android and iOS. Flash = 1 development platform that can publish to desktop, web & mobile. Flash is here to stay!", "group_id": 4419, "id": 209448}, {"user_id": 16104, "stars": [{"date_created": 1298682669.190892, "user_id": 1}], "topic_id": 8979, "date_created": 1298682651.326653, "message": "Who's Steafe Jobbs?", "group_id": 4419, "id": 212344}]