[{"user_id": 36337, "stars": [], "topic_id": 40701, "date_created": 1309340585.1165891, "message": "My question may seem quite easy for you guys but what do you think is the best way to associate accounts (let's say from gmail, twitter and google) if people have different email adresses ?", "group_id": 5196, "id": 1515960}, {"user_id": 36337, "stars": [], "topic_id": 40701, "date_created": 1309340657.911469, "message": "Also, how do you manage to ask for password before account is created (or do you just ask when user is redirect, and in this case how do you know what social network the request is coming from since Twitter for exemple does not give the same data as Fb)", "group_id": 5196, "id": 1515971}, {"user_id": 20656, "stars": [], "topic_id": 40701, "date_created": 1309372954.2450061, "message": "I guess you want automatic association, and sadly there's no way to ensure it will work what ever the steps you take, that's why the app provides a set of /associate/ URLs that let you associate more accounts to the currently logged in user.", "group_id": 5196, "id": 1519892}, {"user_id": 20656, "stars": [], "topic_id": 40701, "date_created": 1309373147.996047, "message": "To know which was the last network used, you can check the value stored in the session under the key \"social_auth_last_login_backend\". You can override the key name defining the setting  SOCIAL_AUTH_LAST_LOGIN.", "group_id": 5196, "id": 1519945}, {"user_id": 20656, "stars": [], "topic_id": 40701, "date_created": 1309373009.9582851, "message": "To request custom password, I would suggest a custom page and use SOCIAL_AUTH_NEW_USER_REDIRECT_URL setting to redirect newly created users to that page.", "group_id": 5196, "id": 1519908}, {"user_id": 36337, "stars": [], "topic_id": 40701, "date_created": 1309378411.4747109, "message": "Thanks for the reply ! As mentionned in another thread i tried the NEW_USER_REDIRECT but it didn't seem to work since the user is not redirected (maybe - probably- i'm doing something but i can't see what)", "group_id": 5196, "id": 1521294}, {"user_id": 20831, "stars": [], "topic_id": 40701, "date_created": 1309702038.6002271, "message": "@apavillet  @omab  Created an issue with this on Github, seems to be an issue for a few of us https://github.com/omab/django-social-auth/issues/98", "group_id": 5196, "id": 1552154}, {"user_id": 20656, "stars": [], "topic_id": 40701, "date_created": 1309722328.0417659, "message": "I've closed that issue a few minutes ago, all should be ok now.", "group_id": 5196, "id": 1553703}]