[{"user_id": 2282, "stars": [], "topic_id": 2442, "date_created": 1297285814.6710939, "message": "You can do a saved search for a hashtag on Twitter.com (yes people still use that site)", "group_id": 553, "id": 56485}, {"user_id": 1638, "stars": [], "topic_id": 2442, "date_created": 1297285285.3820691, "message": "Lets discuss ways of tracking, using, knowing what the heck that hashtag on Twitter is all about. wthashtag.com, tweetchat.com, tools to search by hash tag, if it's about Twitter hashtags it's fair game.", "group_id": 553, "id": 56147}, {"user_id": 1638, "stars": [], "topic_id": 2442, "date_created": 1297287114.5506229, "message": "@christheisen agreed! I have several setup myself. Good tip!", "group_id": 553, "id": 57144}, {"user_id": 3604, "stars": [], "topic_id": 2442, "date_created": 1297303473.5095, "message": "The trend re: hashtags seems to be toward completely BS hashtags that no one would ever actually search for. It's now often used as a metacomment on the tweet itself. I find that really annoying myself, but it's tough fighting the tides.", "group_id": 553, "id": 62951}, {"user_id": 1638, "stars": [], "topic_id": 2442, "date_created": 1297305396.0120361, "message": "@adriancrook That is certainly true and I have been guilty of it at times myself. There are some very useful usages though as well. One is the proliferation of twitter chats such as #blogchat, #SocialChat, etc. Another common use is for location #FortWayne or hobby/category #togs (for photographers). #CatchYourDriftThough", "group_id": 553, "id": 63554}, {"user_id": 4875, "stars": [], "topic_id": 2442, "date_created": 1297412887.562814, "message": "there are often topics of interest included in the trending topics from Indonesia, so that the Indonesian people looking for what is written by others about the topic. sometimes there tweet using hashtag but some are not. we can use the \"search\" on Twitter to find tweets that do not use hashtag.", "group_id": 553, "id": 79122}, {"user_id": 9108, "stars": [], "topic_id": 2442, "date_created": 1297737584.8203011, "message": "@adriancrook I completely agree that while hashtags can be used meaningfully, they are commonly wasted. Most of the time I see hashtags that no one else would even think to use, let alone actually try searching for.", "group_id": 553, "id": 108872}]