[{"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297958573.623018, "message": "Guideline #1:  Do not suck.", "group_id": 2810, "id": 132628}, {"user_id": 13130, "stars": [{"date_created": 1297959502.3073471, "user_id": 8579}], "topic_id": 6965, "date_created": 1297958595.8131411, "message": "Guideline #2:  If you like it, pay for it or promote it.", "group_id": 2810, "id": 132634}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297958752.712863, "message": "Guideline #3:  The word \"site\" implies something two-dimensional, and doesn't adequately describe Featurism. Featurism is an internet node.", "group_id": 2810, "id": 132642}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297958825.8915081, "message": "Guideline #3:  \"Node\" means a publication, a collection, an archive, a way of sharing information and communicating, a community of intellectual and technological affinities.", "group_id": 2810, "id": 132651}, {"user_id": 13130, "stars": [{"date_created": 1297959575.762615, "user_id": 8579}], "topic_id": 6965, "date_created": 1297958890.1742029, "message": "Guideline #4:  Labor has value. You should be compensated for your work. You own your labor.", "group_id": 2810, "id": 132655}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297959929.6688709, "message": "I never know what messages we're replying to. But everything you say here sounds good to me.", "group_id": 2810, "id": 132781}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960291.952019, "message": "What I hear you saying is that, leaving aside the features and intent, the tone/ethic of Featurism will not be modeled on 4Chan.", "group_id": 2810, "id": 132866}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297959967.985867, "message": "I know, the reply sucks!  But I love the immediacy.", "group_id": 2810, "id": 132794}, {"user_id": 13130, "stars": [{"date_created": 1297959574.500258, "user_id": 8579}], "topic_id": 6965, "date_created": 1297959248.7355299, "message": "Guideline #5:  Distinctions between media -- text, sound, image, moving image -- were useful when the means of reproducing those media were distinct. This is no longer the case. Perpetuating these distinctions means letting the structure of old technologies to dictate thinking about new technologies. Featurism is media -- \"multi-media\" is implied. We use whatever technology we need to say what we have to say. And we'll invent that technology if we need to.", "group_id": 2810, "id": 132675}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297959566.5580361, "message": "@duncanmurrell I actually think \"Community\" is becoming the way to describe this sort of thing. Featurism is basically a house organ for the Featurism community, which right now is you, me, and a few other people who might be interested.", "group_id": 2810, "id": 132696}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960615.1134269, "message": "However, there should be room for a \"Black People Featurism\", etc.", "group_id": 2810, "id": 132918}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960624.2067931, "message": "If that's what the community wants.", "group_id": 2810, "id": 132919}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297959755.533545, "message": "@duncanmurrell  Compensation should be publicly stated and very clear. There can be discretionary bonuses for famous writers, etc., but there is so much secrecy about $$ in writing that it'll be fun to invert that and see how much trouble it causes. Perhaps a shared, collective dispersal of funds--I.e. writers are paid a set amount and the community can chip in more as we go along. And writers should be willing to get involved with the community; it's actually part of the payment, is this introduction service to people who will likely invite you to speak, retweet you, etc.", "group_id": 2810, "id": 132723}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960704.6941199, "message": "Moderators and editing is an issue we need to discuss.", "group_id": 2810, "id": 132924}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960821.6528721, "message": "Oh, totally. People can explore that stuff all they want. It can be used to discuss both ways that diff. cultures use stuff to their own ends, or to talk about oppression. I'm all for, say, a serious discussion of \"rapeproofing\" technologies, or ways that slaves were controlled. But in that case the moderator's job is easy--IT'S ABOUT FEATURES. If someone starts explaining hegemonic/paternal rape culture, and someone else starts saying, in hipster-ironic mode, \"they were asking for it!\" it's straightforward to swoop in and erase that stuff while driving people back to the focus.", "group_id": 2810, "id": 132936}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297959821.4172871, "message": "A big one: Rape/racist humor, even if ironic, is officially not funny here. It's just always a huge damned distraction and derail.", "group_id": 2810, "id": 132750}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960182.816241, "message": "Compensation:  I like the idea of being really open about it. I suspect that the more people realize that it's right, and even possible, to be paid to write online, more people will demand it. But it won't happen until being paid becomes more common. We should work to monetize creative work online, and to reduce the number of people getting paid to stand between creator and consumer.", "group_id": 2810, "id": 132829}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960210.536088, "message": "Pondering women's v. men's technologies.", "group_id": 2810, "id": 132832}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960220.793546, "message": "To that end, this thing has to be inclusive to a stupid level. Not so much because of some affirmative-action goals (I mean and sure, I don't want this thing to look like me; it should look like people) but because technology is happening all over the place and features arise when cultural norms interact with new technologies--i.e. \"Black People Twitter.\" If it's not more inclusive than a typical nerd blog then it's a total failure.", "group_id": 2810, "id": 132834}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960432.8520839, "message": "Hah! No, not 4Chan. Although I find them fascinating. But even the most lefty/progressive communities fall into various conversational traps about subjects like rape and race. Even if everyone is being earnest, it's just this conversational tarpit and it's not really the sort of thing you can fix about our culture via, like, a messageboard.", "group_id": 2810, "id": 132886}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297959937.496707, "message": "Also, \"women's\" technologies are as important as \"men's\" technologies. Drawing that gender line is nonsense in the first place, of course, but basically, if we're going to talk about how people self-organize, share information and patterns online and knit together, or the social structure of a 19th-century New England textile mill, that's just as important as talking about how adolescent boys like to play videogames online. This goes for all sorts of people. One person's Eames chair is the next person's Shillelagh is the next person's knitting needles.", "group_id": 2810, "id": 132784}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960329.695488, "message": "Naked pictures, yes, but only of solid-state circuits.", "group_id": 2810, "id": 132872}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960882.8785501, "message": "Self-regulation over all. I plan to be a SUPER-involved poster as much as moderator, so I think that will help.", "group_id": 2810, "id": 132943}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960949.925365, "message": "Oh no, absolutely. It's another kind of editing. You have a style guide, but the real work of it is done by skilled practitioners who take it seriously.", "group_id": 2810, "id": 132951}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961006.2605009, "message": "Wait, I'm treating this like chat.", "group_id": 2810, "id": 132957}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961009.1389329, "message": "Nevermind.", "group_id": 2810, "id": 132958}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960452.4172039, "message": "God, this thing would be SUPER useful for doing interviews with people, in a more conversational way.", "group_id": 2810, "id": 132891}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960668.483187, "message": "Yeah, Convore is working for me. The trouble with doing interviews is you'd have to get people signed up. Maybe it will be adopted more widely some day. But the signup was super easy.", "group_id": 2810, "id": 132922}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960909.13167, "message": "The problem with moderation is that it's hard to set up a great set of rules for how a site will be moderated. Every single situation seems to be an exception. But if we can all agree that moderation is an art, not a science, I think it can work.", "group_id": 2810, "id": 132947}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297961042.2890861, "message": "Yes, that's interesting. I'm about to run out and realized that I was about to write \"about to run out to a meeting; ttyl\", which is exactly NOT the pt. of this thing.", "group_id": 2810, "id": 132959}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961151.833802, "message": "ttyl", "group_id": 2810, "id": 132967}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961153.4902959, "message": "ha", "group_id": 2810, "id": 132969}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960485.362596, "message": "Well, I'm an advisor to Readability, so we can hook into that API and get them to help us, I'm sure. I think the thing is that everything keeps flowing into a communal pot--PayPal, etc--and flowing out to writers, as salaries, and so forth. People who get involved need to feel an ABSOLUTE sense of responsibility and ownership. Like, THEY ARE the site.", "group_id": 2810, "id": 132899}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960576.7041221, "message": "That kind of \"stupid inclusiveness\" (and I understand what you mean) can't be achieved by enforcing inclusiveness from the top, as you say, though that's a good way to get it jumpstarted. Featurism, ultimately, has to be so flexible and useful that it's inclusive by adoption. People themselves decide to make Featurism inclusive by including themselves.", "group_id": 2810, "id": 132911}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960816.3395729, "message": "It seems to me that the best moderated sites are the ones that develop an informal group constitution (\"this is how we do things, this is what's acceptable; this is what's not\") and the moderators generally let the group self-regulate itself, only stepping in to emphasize the constitution of the group when someone has stepped too far out of line and the community members are having a hard time reigning them in.", "group_id": 2810, "id": 132934}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297960859.6801231, "message": "Yes, true.", "group_id": 2810, "id": 132941}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960970.7429259, "message": "I like the idea of Featurism as the \"house organ\" of the Featurism community. That's a smart way of thinking about it.", "group_id": 2810, "id": 132953}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297960982.4210401, "message": "Did you hear Biz Stone on Fresh Air last night?", "group_id": 2810, "id": 132954}, {"user_id": 8579, "stars": [], "topic_id": 6965, "date_created": 1297961077.6556129, "message": "Perfect use-case for the bookmarklet, though. I could be capturing thoughts about this site as we write. Hmmmmmmmm.", "group_id": 2810, "id": 132963}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961121.481509, "message": "I was going to say:  A conversation like this goes on too long, and as a reference it becomes nearly useless, or at least a pain in the ass to index.", "group_id": 2810, "id": 132966}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961157.7589121, "message": "shit, i'm doing it again", "group_id": 2810, "id": 132970}, {"user_id": 13130, "stars": [], "topic_id": 6965, "date_created": 1297961160.022922, "message": "stop it", "group_id": 2810, "id": 132971}]