[{"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1297900008.524137, "message": "Collectd is an awesome framework for writing distributed monitoring plugins, and graphite looks like a really nice UI/storage system. Anyone tried crosslinking them?", "group_id": 351, "id": 126625}, {"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1297900029.1116259, "message": "I found a little node.js script that claims to do it, but I don't see why it shouldn't just be a collectd output plugin in Python", "group_id": 351, "id": 126631}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306187343.836134, "message": "You ever find a good solution here? There seem to be a number of collectd => graphite plugins out there at this point in time but I've not tested any of them yet (not even 100% sure I will be using Graphite instead of some RRDtool based grapher)", "group_id": 351, "id": 1157552}, {"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1306188079.4049189, "message": "@bitprophet https://github.com/indygreg/collectd-carbon is what someone referred me to, haven't tried it yet though (moving jobs tends to throw off those kinds of plans :)", "group_id": 351, "id": 1157678}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306197567.904484, "message": "(And Graphite still seems a lot nicer than the RRD based graphers I can find like drraw...still need to get familiar with it though.)", "group_id": 351, "id": 1159497}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306197515.183306, "message": "Oh yes, that's true isn't it :)", "group_id": 351, "id": 1159493}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306197537.7406499, "message": "And that plugin is on my list, but thanks anyway", "group_id": 351, "id": 1159494}, {"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1306208063.808274, "message": "Yep, I just need some more free time to build an alerting system to sit on top of collectd so I can forget about nagios forever.", "group_id": 351, "id": 1161234}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306251629.2467461, "message": "I mean I could definitely see room for a middleweight competitor that chops out all the extra complexity Nagios requires to support seriously large installations -- might make handling small-to-medium networks a lot easier.", "group_id": 351, "id": 1167227}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306251712.554651, "message": "Its web UI still needs work, but I haven't looked around yet for what I assume must be some community add-ons which suck less. Even in 2008 there was at least some CGI reskins out there", "group_id": 351, "id": 1167253}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306251583.3443539, "message": "@coderanger Hah! I don't find Nagios to be *that* awful, but perhaps that's Stockholm syndrome talking.", "group_id": 351, "id": 1167205}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306251679.0787849, "message": "But in terms of power/flexibility and focus on alerting and nothing but, Nagios doesn't seem to have any real competition, everything else wants to be a holistic alerting-and-graphing-and-inventory-management kitchen sink", "group_id": 351, "id": 1167244}, {"user_id": 10, "stars": [], "topic_id": 6638, "date_created": 1306254529.8879631, "message": "which is why systems like OpenNMS are gaining popularity", "group_id": 351, "id": 1167645}, {"user_id": 10, "stars": [], "topic_id": 6638, "date_created": 1306254496.2678239, "message": "@bitprophet that's because teams want to go to one place for alerting, graphing, monitoring, and data collection. Teams don't want disparate systems that don't integrate well. Sure you might have \"best of breed\" but the breeds don't always intermix.", "group_id": 351, "id": 1167640}, {"user_id": 10, "stars": [], "topic_id": 6638, "date_created": 1306263419.7215419, "message": "so, I don't really see what Graphite buys you over a RRD-based system. It just seems like \"We were in school/unemployed when everyone else already solved this, so here's our stab at it.\"", "group_id": 351, "id": 1169286}, {"user_id": 10, "stars": [], "topic_id": 6638, "date_created": 1306263386.3794041, "message": "From the Graphite FAQ: From an I/O perspective, under load Graphite performs lots of tiny I/O operations on lots of different files very rapidly. This is because each distinct metric sent to Graphite is stored in its own database file, similar to how many tools (drraw, Cacti, Centreon, etc) built on top of RRD work. In fact, Graphite originally did use RRD for storage until fundamental limitations arose that required a new storage engine.", "group_id": 351, "id": 1169279}, {"user_id": 10, "stars": [], "topic_id": 6638, "date_created": 1306263435.9124889, "message": "OpenTSDB seems much better than graphite", "group_id": 351, "id": 1169288}, {"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1306267230.961365, "message": "@bitprophet My problem is more having to duplicate configuration of metrics all over the place.", "group_id": 351, "id": 1170022}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306284496.635715, "message": "@diq I totally understand the appeal of the fully baked stack approach, but then you sacrifice a lot of flexibility and are at the mercy of whatever big system you've chosen. And inevitably they fall short in some area. I looked at all the big setups (OpenNMS, Zabbix, Zenoss, etc etc) and they all had shortcomings that I found irritating; thus taking a stab at the self-integration approach", "group_id": 351, "id": 1172344}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306284646.1148269, "message": "@coderanger How so? While I haven't gotten to this point in the experiment yet, my hope is to use a nagios-graphite plugin to get data out of Graphite/carbon into Nagios, and thus Nagios' config is solely concerned with alerting. With a good config management system writing out the configs for Nagios + collectd + carbon I'm assuming it should become less painful to add/change a specific metric across all 3", "group_id": 351, "id": 1172373}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306284570.6556029, "message": "@diq And Graphite's main draw for me is the graphing itself, which seems pretty powerful, the closest I've seen in a non-integrated system is an in-progress redesign of the Ganglia webUI (which is my 2nd choice if mashing collectd and graphite together doesn't go well)", "group_id": 351, "id": 1172358}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306284705.492367, "message": "I was able to effect a similar pain-removing setup along a system level at my last job, where I had an app which could enter a single system's info/attributes and out would pop Nagios + Bacula + etc configs", "group_id": 351, "id": 1172377}, {"user_id": 1736, "stars": [], "topic_id": 6638, "date_created": 1306289841.894275, "message": "@bitprophet That works I suppose, but I've heard mixed reports of various other \"pipe another system's data into nagios\" (notably cacti+nagios seems to equal pain).", "group_id": 351, "id": 1173016}, {"user_id": 5863, "stars": [], "topic_id": 6638, "date_created": 1306614747.923691, "message": "Cacti takes the approach of wanting to do everything itself though. Ganglia works superbly with nagios because it also focuses on one domain", "group_id": 351, "id": 1213907}, {"user_id": 4156, "stars": [], "topic_id": 6638, "date_created": 1306634251.309376, "message": "@garethr That is the approach I am currently exploring -- trying to use tools which display a tight focus and interface them together. collectd + graphite seems promising so far, and while I've not yet tried the \"graphite/carbon => nagios\" side of things, I am familiar with Nagios so am not super worried.", "group_id": 351, "id": 1215735}]