[{"user_id": 11626, "stars": [], "topic_id": 40764, "date_created": 1309377942.450367, "message": "“The law does not pretend to punish everything that is dishonest. That would seriously interfere with business.” -Clarence S. Darrow\n\nDave Hodges\nFarm Wars\nJune 29, 2011\n\nIt’s been labeled the worst environmental disaster in world history, and rightfully so, because the British Petroleum (BP) oil spill in the Gulf of Mexico is like the nightmarish gift that keeps on giving.\n\nOn April 20, 2010, the Macondo well blew out resulting in the loss of 11 lives, sank the Deepwater Horizon drilling rig and spilled an estimated five million barrels of crude oil into the Gulf of Mexico. BP’s swath of destruction has included the decimation of the welfare, livelihoods, health and futures of tens of millions of Gulf Coast residents, not to mention the destruction of the fragile ecology in the Gulf of Mexico.\n\nThis is first of a multi-part series which answer questions in five specific areas related to the oil spill with regard to the actions of BP, its corporate Gulf Coast partners and the federal government before, during and after the catastrophe. These areas of inquiry include the following:\n\n    (1) Has BP made full restitution to the oil spill victims?\n\n    (2) Has BP’s actions, as a result of the attempted clean up following the oil spill, resulted in serious health concerns for untold numbers of Gulf Coast residents and is United States government and the main stream media complicit in covering up the scope and the magnitude of these health effects?\n\n    (3) Has BP, as it claims, cleaned up their environmental mess, or, are there very serious implications to the environment which have largely been left unaddressed by both BP and various agencies of the United States government which will have longstanding and very serious implications to the Gulf Coast?\n\n    (4) Did BP and its Gulf Coast corporate partners have, at minimum, foreknowledge of the impending disaster and subsequently acted in concert with one another in order to dramatically increase their financial bottom line which enabled them to profit at the expense of health, wealth and welfare of the region’s population?\n\n    (5) Did BP, Halliburton, Transocean, Boots & Coots as well as various agencies of the United States government (i.e., The Army Corps of Engineers) conspire to eventually depopulate the Gulf in order to create a monolithic oil refinery free enterprise zone which would require the eradication of the shrimp industry and the eventual relocation of Gulf Coast residents living along the shoreline?\n\nThe BP Propaganda Machine\n\nFollowing the Gulf oil spill, there was a collective mainstream media frenzy of the oil spill which focused on four primary areas (1) The reported helplessness of BP’s efforts to stop the leak; (2) Interviews with BP officials in which they repeatedly vowed to repair the ecology and compensate the victims; (3) Federal agency officials which continually and completely denied any threat to Gulf Coast residents as a result of the oil spill and the resulting intervention procedures; and, (4) BP’s incessant public service announcements in which the oil giant would feature one of their “average” employees professing to being a “local” in which they vowed, on behalf of BP, “to not leave until we make it right.”\n\n    A d v e r t i s e m e n t\n\nDespite the voluminous coverage of the oil spill by the mainstream media, the range of coverage was very narrow. The Coast Guard promptly established no fly zones over much of the impacted beach areas and the oil spill area itself [1]. Reporters were restricted to what they could cover in the beach areas and were threatened with arrest if they strayed into “forbidden zones.” This prompted an on air emotional tirade regarding the undue restrictions on media’s coverage by CNN’s Anderson Cooper [2]. Nor was there any meaningful coverage of Halliburton applying the highly controversial dispersants. However, there was plenty of media coverage of President Obama walking the beaches and eating the local shrimp in a thinly veiled effort, on the part of the government and BP in promoting the notion that all is well [2].\n\nIs all well in the Gulf today? According to BP’s Youtube channel, BP has made complete restitution to the victims of the oil spill and all is indeed well and the American public should be willing to move on to other issues and forget about the Gulf. BP’s Youtube video channel does make a compelling case that the Gulf is well on its way to a full recovery. Bryan and Brooke Zar, the owners of Restaurant des Families located in Crown Point Louisiana, claim that BP restored their restaurant to a level of profitability just in time for the 2011 spring break vacation period and that “the beaches are again clean” [3]. Another claim of full compensation by BP was made by Mike Blanchard, a shrimper from Chauvin, Louisiana, whose family who has fished the Gulf for generations’. Blanchard praises BP’s actions as he recouped his losses through BP’s response programs and that his fellow Gulf Coast fishermen were also fully compensated and BP has indeed “made it right” [4]. BP’s Youtube channel also features Rick Scali as describes his return to profitability as his vacation rental home business in Destin, Florida, had fallen upon tough times as a result of the oil spill. Scali claims that BP made his rental business whole when he showed BP the rental cancellation slips and was promptly paid for his losses by BP and today all, is again, well [5].There you have it, all is well on the Gulf Coast Front, or so it would seem.\n\nA Different Story\n\nThere are other voices, albeit quieter voices, outside of the mainstream media and the BP propaganda machine, which tell a far different side of BP’s efforts “to make it right.” Consider the case of Empire, Louisiana fisherman, Elmer Rogers, as he presents his story which differs considerable from the BP and U.S. government media spin, when at a local Town Hall meeting in Lafitte, LA., recorded by WWLT TV, from New Orleans, he pleaded with BP’s front man for Gulf compensation, Ken Feinberg, to help him when Rogers referenced his stalled claim he presented to BP for the loss of his fishing business; “I’m not asking for the world, I’m just asking for something to live on, man. That’s all I’m asking for. At Thanksgiving, I was under review. My kids barely ate. I barely ate. Christmas came. My child is 13 years old. She got nothing. You know what she woke up to? No water in the house, and no power. What you want me to do? Get on my knees and beg for it?” When at this point, Rogers dropped to his knees and said, “Look, I’m here, I’m on my knees for it. I need my money sir, to live. [6]\n\nI dare anyone to watch the aforementioned video and not be moved to tears. I dare anybody to not watch Feinberg’s insensitive response to Rogers and not be filled with rage. And I dare anyone to read part two of this series as the stories of people like Kindra Arnesen (7, 8, 9, 10, 11, 12) are unveiled.\n\n(Annie DeRiso contributed to this article)\n\nReferences\n(1) BP’s Photo Blockade of the Gulf Oil Spill. May, 26, 2010. Newsweek Magazine. http://www.newsweek.com/2010/05/26/the-missing-oil-spill-photos.html\n\n(2) Coast Guard bans reporters from oil cleanup sites. June 27, 2011. Raw Story. http://www.oilspillnews.net/oil-spill-clean-up/coast-guard-bans-reporters-from-oil-cleanup-sites-raw-story/\n\n(3) (BP) Voices from the Gulf: Louisiana Restaurant Owners http://www.youtube.com/watch?v=vbqjOiCJEGM&feature=channel_video_title\n\n(4) (BP) Voices from the Gulf: Louisiana Shrimper (Mike Blanchard, a shrimper from Chauvin, Louisiana).http://www.youtube.com/watch?v=YNq6vW-9_Nc&NR=1\n\n(5) (BP) Voices from the Gulf: Florida Business Owners (Rick Scali and wife manage vacation rental homes in Destin, FL.) http://www.youtube.com/watch?v=JL6ooGCMlSs&feature=relmfu\n\n(6) “Man on Knees Begs Feinberg for Help” WWLTV News, New Orleans, LA. http://www.wwltv.com/news/Man-On-Knees-Begs-Ken-Feinberg-For-Help-113304209.html\n\n(7) Dave Hodges interviews Kindra Arnesen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part One). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=co3cNUgrL8k\n\n(8) Dave Hodges interviews Kindra Arnesen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part Two). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=EoOGuO1eOT4\n\n(9) Dave Hodges interviews Kindra Arne about the ongoing Gulf crisis sen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part Three). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=hujs0kq9n-0\n\n(10) Dave Hodges interviews Kindra Arnesen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part Four). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=6AOLD5Mo3_M\n\n(11) Dave Hodges interviews Kindra Arnesen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part Five). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=T_dN08dsST4\n\n(12) Dave Hodges interviews Kindra Arnesen and Vickie Perrin about the ongoing Gulf crisis. The Common Sense Show with Dave Hodges (Part Six). Republic Broadcasting Network. January 30, 2011. http://www.youtube.com/watch?v=-mDpgzXM7rc", "group_id": 3920, "id": 1521171}, {"user_id": 11626, "stars": [], "topic_id": 40764, "date_created": 1309377953.5536051, "message": "http://farmwars.info/?p=6345", "group_id": 3920, "id": 1521173}]