[{"user_id": 11626, "stars": [], "topic_id": 7739, "date_created": 1298250848.8910971, "message": "With their lights flashing and their sirens blaring, New Haven police officers drove up to City Hall on Thursday, Feb. 17, got out of their vehicles and started chanting \"Bring Them Back!\" in response to 16 layoffs recently announced by the city\r\n\r\nhttp://www.ctpost.com/mediaManager/?controllerName=image&action=get&id=581705&width=628&height=471\r\n\r\nNEW HAVEN -- New Haven police officers are letting Mayor John DeStefano know that they're not happy with the recent layoffs.\r\n\r\nAbout 16 police officers that were laid off Wednesday night. More layoffs are expected as the city tries to deal with a multi-million dollar deficit.\r\n\r\nWith their lights flashing and their sirens blaring, the police officers drove up to City Hall, got out of their vehicles and started chanting \"Bring Them Back!\". They were also calling for DeStefano to come out.\r\n\r\nPictures sent to WTNH-TV via the station's Report It feature show some of the police officers marching through the city streets from the police station to City Hall. Another Report It photo shows the police officers blocking traffic on Church Street.\r\n\r\nAngelo Mauriello was of the police officers who found out last night that he had to turn in his gun and badge today at 10 a.m. .\r\n\r\n\"You work so hard, it's not easy doing this job, and then you get a phone call it's sad to hear,\" he said.\r\n\r\nNews of the layoffs last night came just as police were responding to a double shooting at a Dunkin' Donuts store on Derby Avenue. Union President Sergeant Louis Cavaliere calls the layoffs a \"disgusting embarrassment\" and is suggesting that city residents arm themselves to ensure order in spite of the depleted police force.\r\n\r\n\"We have five shootings in 19 hours -- it's dangerous in this city, it's dangerous for us, it's dangerous for the citizens. I don't know how you can say you're just gonna lay cops off,\" said Anthony Zona, Treasurer, New Haven Police Union.\r\n\r\nZona also wonders why Chief Police Frank Limon has been noticeably absent from this whole process. \"He should have been down here with us, he should have got ahead of this, he should have supported us, he should have gone to the mayor,\" he said.\r\n\r\nOnce at City Hall, union leadership went up to talk with DeStefano, but no word yet what exactly transpired.\r\n\r\nIn a 3 p.m. press conference, DeStefano said a total of 82 more city positions will be eliminated. The mayor also called Cavaliere's suggestion that residents arm themselves \"irresponsible.\"\r\n\r\nhttp://www.ctpost.com/default/article/Union-leader-suggests-residents-take-up-arms-in-1017738.php", "group_id": 3920, "id": 155464}]