[{"user_id": 34949, "stars": [], "topic_id": 37810, "date_created": 1307015573.6674991, "message": "I suppose I might as well make a start, then.\n\nI'm guessing whoever's reading this is signed up to receive emails about the NAHVALR project. So far we've had some short stories, a request to make some voice recordings and, now, a link to this discussion group. First thing I noticed: member robertvoor's profile leads us here: http://legrandsociety.com/\n\nThis thread is for sharing ideas/tracing developments regarding the project.\n\nI wonder what all of this will amount to.\n\n- R.", "group_id": 9056, "id": 1265645}, {"user_id": 34960, "stars": [], "topic_id": 37810, "date_created": 1307019668.7587991, "message": "Weighing in. I've got, oh, maybe a few dozen ideas as to what this might all be about, most of them absurd. Worried it's going to turn into ghost hunting: making things out of what was never there to begin with. Maybe that's the idea?", "group_id": 9056, "id": 1266224}, {"user_id": 34962, "stars": [], "topic_id": 37810, "date_created": 1307020957.47334, "message": "I honestly have not a single idea to where this is going to go, but I can see where are coming from with the idea of \"making things out of what was never there to begin with\". Also leading to that blog is a cool idea to where things could be going as well.", "group_id": 9056, "id": 1266569}, {"user_id": 34973, "stars": [], "topic_id": 37810, "date_created": 1307026878.4843631, "message": "Googling Robert Voor gets nowhere- seems there's a fellow who's the boss of ACME on LinkedIn, but other than that nothing interesting. Found this, though, upon looking for anything on that interesting quote from the blog: http://www.webpages.uidaho.edu/humanities/PDF/Ask%20the%20Cattle.pdf", "group_id": 9056, "id": 1267807}, {"user_id": 34973, "stars": [], "topic_id": 37810, "date_created": 1307025838.437212, "message": "I get the feeling this may be a digital version of said game.", "group_id": 9056, "id": 1267598}, {"user_id": 34973, "stars": [], "topic_id": 37810, "date_created": 1307025826.3445251, "message": "There's this game that people play called the story game, where people ask yes or no questions about a story a storymaster has supposedly made up, and this person answers them so the audience gets an idea of what the story may be, question by question. The curveball is that there is no story to begin with: questions that end in vowels are always answered with \"yes\", while consonants answered with \"no\", and 'y's answered with \"maybe\".", "group_id": 9056, "id": 1267594}, {"user_id": 34949, "stars": [], "topic_id": 37810, "date_created": 1307030577.23438, "message": "I'm pretty sure Voor's a fictional character - he finds his way into the concepts behind Have a Nice Life, Giles Corey and Nahvalr. Also, great find, Geisteskrank. Literature, history and art is pretty significant in all of this, needless to say. As are, err, owls.", "group_id": 9056, "id": 1268304}, {"user_id": 34990, "stars": [], "topic_id": 37810, "date_created": 1307032011.3728549, "message": "There's a picture of Dan Barrett somewhere -- I think it was for an interview -- of him with a bag over his head. The caption calls it a \"Voors Head Device.\"", "group_id": 9056, "id": 1268497}, {"user_id": 34990, "stars": [], "topic_id": 37810, "date_created": 1307032266.5935531, "message": "Also, I found additional e-mails dated from before the project was announced: http://us1.campaign-archive2.com/home/?u=d3ad05e75dc3a0adf6f3243d1&id=7db5946ed4  There's some additional backstory there.", "group_id": 9056, "id": 1268551}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1307037823.0989151, "message": "No, those emails were send out. The project (better; the page where you can fill in your email address) was announced a month - maybe two - ago.", "group_id": 9056, "id": 1269318}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1307038242.7786801, "message": "Also; I don't think Mr. 'Voor' is fictional (or at least not completely). Not everything is on the internet (yet?). But it's true that he is the main concept behind the trilogy (HaNL - Nahvalr - Giles Corey). legrandsociety.com was a good find, probably another \"chapter\" in this hunt/quest/society... That being said, I think this is more like the EL scavenger hunt, but with more interaction (?) - Only for the true EL fans and the people that love these kind of things.", "group_id": 9056, "id": 1269434}, {"user_id": 35004, "stars": [], "topic_id": 37810, "date_created": 1307038913.253958, "message": "Yes, all of those emails have been sent out after the project was announced.", "group_id": 9056, "id": 1269590}, {"user_id": 35004, "stars": [], "topic_id": 37810, "date_created": 1307039387.378264, "message": "I can't help but agree that this is something of a scavenger hunt. In the latest message, it was said that \"just because you have not received an email does not mean the project is not continuing elsewhere\". Clearly, D is leaving a bread crumb trail of a story. Where this comes into play in the album loses me.\nRight now, I only see the story we are all following as a context to the music that's being produced, like the story of Antiochus to Deathconsciousness. Whether it will evolve into this story altering the actual production of the music, I don't know.", "group_id": 9056, "id": 1269683}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1307039672.989984, "message": "The Nahvalr album was a \"open source\" album - everyone could send soundfiles which would later be edited & used in the album. I assume some sort the same thing is planned for this project. A second Nahvalr album - Dan mentioned working on a concept for a new album and showed a sketch/drawing (with an owl!).", "group_id": 9056, "id": 1269729}, {"user_id": 35004, "stars": [], "topic_id": 37810, "date_created": 1307040659.606214, "message": "Yeah, I suppose the stories he's sent are a context to keep in mind for any sound that we produce for the album. I guess I was considering more if it went beyond just context, or mindset. Will we be continuing the stories with what we produce, or will we just be using motifs from the stories in what we produce, directly referencing bits of them? I'm not worried about it, at all. I'm sure it'll all become (relatively) clear when the time comes. Just curious and excited about the project.", "group_id": 9056, "id": 1269939}, {"user_id": 35033, "stars": [], "topic_id": 37810, "date_created": 1307056243.128598, "message": "Very excited, like an ARG in which we are an integral part of. I haven't read the blog yet however. Currently waiting patiently for Giles Corey to draw some connections, which I am certain there will be.", "group_id": 9056, "id": 1272560}, {"user_id": 34949, "stars": [], "topic_id": 37810, "date_created": 1307138921.587527, "message": "Not much has been revealed about the Giles Corey book, but Dan did say it would shed some light on Voor. I think the clues/instructions will go beyond the emails in that way. Some of us will pick up on things others won't etc. Depends how closely you look into Enemies List-related stuff/how much of a nerd/fanboy you are.", "group_id": 9056, "id": 1281714}, {"user_id": 35160, "stars": [], "topic_id": 37810, "date_created": 1307168458.4578841, "message": "when are we gonna make the black metal mang?", "group_id": 9056, "id": 1284731}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1307182052.0721371, "message": "And here's our confirmation; Are the pages from the scavenger hunt still available? I heard about it just as it was finishing and only read a little of it, not thinking to archive them. Very intricate and intriguing. Also, do you think you'll do something similar again?\n\nYes, and yes. The last.fm thread does a fairly good job of documenting it, but it's all still up there. As for similar things, the current Nahvalr project is similar in some ways. - From the EL Formspring; http://www.formspring.me/enemieslist", "group_id": 9056, "id": 1285390}, {"user_id": 35033, "stars": [], "topic_id": 37810, "date_created": 1307214208.6797221, "message": "I asked that :3 does anyone know the URL of the scavenger hunt pages? the last.fm thread is gone and I didn't save them.", "group_id": 9056, "id": 1288102}, {"user_id": 35033, "stars": [], "topic_id": 37810, "date_created": 1307265712.3103831, "message": "naw dan was confused by the missing thread as well.", "group_id": 9056, "id": 1292391}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1307265495.8291459, "message": "Hah. No idea, I don't have it, I read/followed it back in the day, and I don't know why the thread is gone. Maybe another puzzle piece? Or is this just going to far?", "group_id": 9056, "id": 1292382}, {"user_id": 34949, "stars": [], "topic_id": 37810, "date_created": 1307355522.055371, "message": "Maybe we're supposed to wait for Robert Voor to intervene on this thread. It'll be the poor man's \"Waiting for Godot\".", "group_id": 9056, "id": 1301798}, {"user_id": 35033, "stars": [], "topic_id": 37810, "date_created": 1307437840.5603919, "message": "my google fu has not failed me\nhttp://www.enemieslist.net/specialsecretprize/hidden%20tracks/\nthe website from the previous scavenger hunt. read up. this + giles corey + legrand society.", "group_id": 9056, "id": 1318519}, {"user_id": 35033, "stars": [], "topic_id": 37810, "date_created": 1307438058.9730539, "message": "if you've ever played around with web directories or remember the scavenger hunt you can get here http://www.enemieslist.net/specialsecretprize/hidden%20tracks/data/ fairly easily. I'll look through and see if there's anything pertinent.", "group_id": 9056, "id": 1318544}, {"user_id": 35564, "stars": [], "topic_id": 37810, "date_created": 1307496778.037482, "message": "for ease: http://www.mediafire.com/?79642xn11jwcdoa", "group_id": 9056, "id": 1331854}, {"user_id": 35564, "stars": [], "topic_id": 37810, "date_created": 1307496800.7087331, "message": "though navigating the actual directory is quite rewarding.", "group_id": 9056, "id": 1331860}, {"user_id": 34973, "stars": [], "topic_id": 37810, "date_created": 1307926298.98262, "message": "Absolutely incredible, really. The whole experience.", "group_id": 9056, "id": 1376674}, {"user_id": 34950, "stars": [], "topic_id": 37810, "date_created": 1308386845.07568, "message": "So, everyone has heard the Giles Corey album and read the book? This reveals almost everything around the mysterious figure that is Robert Voor.", "group_id": 9056, "id": 1425554}]