[{"user_id": 11637, "stars": [], "topic_id": 6210, "date_created": 1297808689.7833059, "message": "more stolen money poorly spent", "group_id": 3920, "id": 116062}, {"user_id": 11626, "stars": [], "topic_id": 6210, "date_created": 1297808349.8716869, "message": "For some time now the CIA has been making investments in technology focused on defensive systems to prevent cyber threats, as well as offensive capabilities to launch cyber attacks and collect cyber intelligence. This is one of the CIA’s top three priorities within their current strategic plan looking out five years.\r\n\r\nThese are just a few of the numerous government wide initiatives to increase cyber capabilities across all agencies. These focus mainly on those who are responsible for protecting critical infrastructure within the United States like the Department of Homeland Security and the National Security Agency. Those who have reviewed this plan all concur, that technology and technological capabilities combine to become the key focus of the CIA’s strategic plan.\r\n\r\nInside officials said that the agency would substantively increase the technology budget by tens of millions of dollars. The same insiders said that technology provides advanced capabilities that increase the effectiveness and efficiency of intelligence collection, as well as increasing the ease with which covert operations can establish more credible covers.\r\n\r\nIn addition, the new technology will increase the collaborative capabilities of the CIA which is now a critical success factor for the organization. Some members of the intelligence community and experts in the field have expressed concern about the integrity of the new tech solutions given that many of the components that make up our technology capabilities come from foreign sources. “We need to bring hi-tech manufacturing back inside the United States,” said a source.\r\n\r\nThis is one of the reasons why Technolytics increased the intelligence technology market estimates back in June of 2009 to tens of billions of dollars.", "group_id": 3920, "id": 116010}, {"user_id": 11626, "stars": [], "topic_id": 6210, "date_created": 1297808367.334619, "message": "http://defensetech.org/2010/05/20/cia-boosting-cyber-war-capabilities/", "group_id": 3920, "id": 116014}]