[{"user_id": 15780, "stars": [], "topic_id": 8883, "date_created": 1298586857.661983, "message": "What is going on in the negotiations between the league and the players association? What do you think each side will come away with as a \"win\" in this deal, and where are they drawing the line?", "group_id": 533, "id": 203031}, {"user_id": 14339, "stars": [], "topic_id": 8883, "date_created": 1298905249.2584519, "message": "I just hope they play this season! Contracts with labour unions have to be worked out every few years, i think this is just a normal process.", "group_id": 533, "id": 226043}, {"user_id": 15780, "stars": [], "topic_id": 8883, "date_created": 1299004774.26227, "message": "Yeah, i think the difference here is that there is an exorbitant amount of profits to allocate going forward.", "group_id": 533, "id": 236772}, {"user_id": 15780, "stars": [], "topic_id": 8883, "date_created": 1299004879.2122049, "message": "AND that amount of money still stands to increase if they add two regular season games, which is a bit of scandal since health issues are a hot button topic after the last couple seasons.", "group_id": 533, "id": 236793}, {"user_id": 14339, "stars": [], "topic_id": 8883, "date_created": 1299226764.540946, "message": "Adding two more games? That is a terrible idea, the season is already long. 16 games is a good number that has worked for a long time. I hate that business mentality of always needing to be able to squeeze every last drop out of something.", "group_id": 533, "id": 267816}, {"user_id": 17550, "stars": [], "topic_id": 8883, "date_created": 1299342152.3332319, "message": "I agree that adding 2 more games is a terrible idea. It would shorten a player's professional lifespan. Football is a tough sport.", "group_id": 533, "id": 276629}, {"user_id": 15780, "stars": [], "topic_id": 8883, "date_created": 1299344175.3261051, "message": "Not only that, which is obviously very important... It really takes the meaning out of the rest of the games to a certain degree.  One of the things I love about football is that every game matters... and each team always tries to show up for it.  This doesn't happen at all in in the MLB or NBA. too many games means there are throw aways and the mentality shifts to \"lets just win as many as we can.\"", "group_id": 533, "id": 276721}, {"user_id": 1277, "stars": [], "topic_id": 8883, "date_created": 1299526918.9662499, "message": "Agreed. Starting the season 0-2 will most likely mean you will not reach the Super Bowl. But we all know why they want the additional games... TV revenue.", "group_id": 533, "id": 290105}, {"user_id": 15780, "stars": [], "topic_id": 8883, "date_created": 1299702732.5452571, "message": "Agreed. It's going to be hard to see what term/ideas the owners/league has for adding two games and still maintaining its stance on improving player mental and physical safety.", "group_id": 533, "id": 308091}]