[{"user_id": 24154, "stars": [], "topic_id": 17390, "date_created": 1302014959.0182481, "message": "This one is for Katie. When is Learnability more important than Usability on UXBooth:\nhttp://www.uxbooth.com/blog/when-is-learnability-more-important-than-usability/ \n\nexcerpt:\nIs it ok to ask your users to learn your interface? As UI design is maturing and the web is becoming a more advanced land of complex interfaces is it now unreasonable for every feature to be instantly usable? Touch devices have also entered the mainstream and added a multitude of interactions that UI designers can lean on.\n\nSo, how do you know when it is ok to hide features and ask your audience to learn your application? Is ‘learnability’ now more important than usability?", "group_id": 345, "id": 541727}, {"user_id": 2730, "stars": [], "topic_id": 17390, "date_created": 1302027400.9863329, "message": "My recent lunchroom gave participants about a minute to explore a menu on their own before performing a task. I think it made a big difference in the perceived ease of use, and more closely mimics the real life scenario - you're going to fuss about with your display in the car before you go driving off. \n\nAfter they performed some tasks, I had them do it again and tell me if any tasks were easier, or if some were still tricky to figure out. Overall, easy tasks were still easy, hidden items were easier to find, and a difficult hierarchy structure was still difficult.", "group_id": 345, "id": 544132}, {"user_id": 5612, "stars": [], "topic_id": 17390, "date_created": 1302025999.270277, "message": "Very interesting Eric - and the timing is great too. Our client has just asked me about testing the learnability of their voice recognition system. They know initial usability will probably be low, and they want to know if the system is learnable. I'm doing several tasks, collecting ratings half way through and at the end, and asking participants if they feel they've learned it, would they try to learn it, etc. I think if participants see benefits in it, they will spend more time trying to learn it. However, if the benefits are not great enough, they will probably continue to use the touch screen and not the voice recognition system. It will be interesting to see the results.", "group_id": 345, "id": 543807}, {"user_id": 2730, "stars": [], "topic_id": 17390, "date_created": 1302029675.8837399, "message": "And apparently my brain-clone is the first to comment on the uxbooth article... check it!", "group_id": 345, "id": 544691}, {"user_id": 2730, "stars": [], "topic_id": 17390, "date_created": 1302029325.535217, "message": "Also: a majority of my design work here at Lextant has involved complex information systems and highly detailed and information-dense experiences. Some even involve extensive training as a part of overall work process (think radiology, 911 call centers, etc). \n\nWhile we have always tried our hardest to create intuitive and usable experiences in these complex environments, there is still some some learning and training to be expected in most cases. \n\nThe examples in the article are mostly consumer-facing, and any time this question/topic comes up I get a little frustrated b/c it completely ignores more complex systems. There is a significant financial, responsibility, and emotional investment made in these systems that are used to get work done, and that are used 8 hours a day or more. \n\nBut still, rads and dispatchers can't just switch to an easier to use product b/c they are frustrated with their current solution. \n\nI'm not sure where I'm going with this, but I think it is important to distinguish consumer-facing systems from more complex information-dense systems. \n\nsorry for the rant :)", "group_id": 345, "id": 544605}]