[{"user_id": 25737, "stars": [], "topic_id": 46530, "date_created": 1318569937.2960689, "message": "Señores les presento Bahux.com, es una iniciativa que tenemos un grupo de desarrolladores para Shopping Cart con soluciones de pago integradas en un plataforma de servicios, esperamos recibir sus comentarios, consejos y quejas", "group_id": 965, "id": 2344707}, {"user_id": 2946, "stars": [], "topic_id": 46530, "date_created": 1318583845.433815, "message": "clickable: http://bahux.com/", "group_id": 965, "id": 2345382}, {"user_id": 29866, "stars": [], "topic_id": 46530, "date_created": 1318590520.5014031, "message": "@ferso Eres de Mérida? Bahux creo que signifca \"cuanto?\" en maya, cierto? ya me apunte para recibir el acceso a la BETA, un saludo!", "group_id": 965, "id": 2345624}, {"user_id": 25737, "stars": [], "topic_id": 46530, "date_created": 1318602184.395031, "message": "En efecto es Maya y significa \"cuanto?\" o \"cuanto es?\",  y no no soy de Mérida aunque me gusta mucho la ciudad. Gracias por registrarte @josuegio, mientras estamos trabajando para presentarlo en noviembre, saludos.", "group_id": 965, "id": 2346377}, {"user_id": 19720, "stars": [], "topic_id": 46530, "date_created": 1318610857.1985731, "message": "@ferso te recomiendo que le mandes a @dfect tu sitio para que lo ponga en www.earlyadopters.mx y generes tus primeros usuarios.", "group_id": 965, "id": 2347271}, {"user_id": 34786, "stars": [], "topic_id": 46530, "date_created": 1318918382.900068, "message": "Muy buena idea ! Yo he estado buscando una solucion mexicana para tiendas (lo complicado como programador son los pagos), mis alternativas hasta el momento son Shopify y Magento.\n\nYa envíe mi mail para el beta, espero poder recomendarlos pronto ! =P", "group_id": 965, "id": 2374480}, {"user_id": 42145, "stars": [], "topic_id": 46530, "date_created": 1319006407.7261469, "message": "Quien es el bueno en Maya :) Donde puedo encontrar un diccionario o algo asi. Recientemente he leido de nuestra herencia prehispanica y me senti muy orgulloso de esa raices y es una buenisima idea retomar eso para nombrar nuestros productos/servicios o empresas. Felicidades por la iniciativa de Bahux!", "group_id": 965, "id": 2383242}, {"user_id": 25737, "stars": [], "topic_id": 46530, "date_created": 1319044944.3103421, "message": "Gracias por los comentarios, estamos my contentos por recibir sus consejos, les darémos informes en cuanto tengamos algo que mostrar, saludos", "group_id": 965, "id": 2385747}, {"user_id": 3665, "stars": [], "topic_id": 46530, "date_created": 1319090613.9298799, "message": "¿Cuál es el diferenciador de Bahux contra Shopify o Etsy?", "group_id": 965, "id": 2390348}, {"user_id": 25737, "stars": [], "topic_id": 46530, "date_created": 1319103744.552959, "message": "Quizás sea el soporte para los retos que enfrenta una empresa / persona en LATAM para iniciar una tienda online como por ejemplo no invertir tanto, o tal vez solo será el soporte en español. Shopify, Goodsie, tiene un mercado global, pero en Latam muchas empresas / personas estan colgadas en Mercado Libre ;)", "group_id": 965, "id": 2390792}, {"user_id": 10406, "stars": [], "topic_id": 46530, "date_created": 1319118431.941128, "message": "Creo que la pregunta de @Krator es muy interesante pues menciona a 2 grandes del mercado, no solo por su tamaño sino por su modelo de negocio. Por un lado shopify el competidor directo pero con alcance global y años de experiencia en el ramo y por el otro lado, el mejor ejemplo de un modelo de negocio centralizado como etsy, donde un e-marketplace centraliza el flujo de usuario a nivel regional lo cual le da la oportunidad de focalizar su marketing y estrategias de conversión a un solo sitio. Crees que el soporte en español sea la única ventaja competitiva?", "group_id": 965, "id": 2391744}, {"user_id": 2946, "stars": [], "topic_id": 46530, "date_created": 1319141668.4040489, "message": "Creo que lo que @Ferso dice es que no busca tanto competir con Shopify (tiendas hermosas, super flexibles, globales) sino con Mercado Libre (pequeñas operaciones que solo necesitan un escaparate bien visible). O me equivoco?", "group_id": 965, "id": 2394650}, {"user_id": 25737, "stars": [{"date_created": 1319178232.5120001, "user_id": 10406}, {"date_created": 1319354863.4003539, "user_id": 24172}], "topic_id": 46530, "date_created": 1319153630.4414351, "message": "Exacto! @soska, nosotros planteamos la solución más a micronegocios que no tienen forma de invertir tanto o que no tienen un equipo tecnico en todo caso para agencias que les piden tiendas online. Para todos aquellos que ponen una gran cantidad de productos en venta en sitios como mercado libre y no tienen la flexibilidad de manejarlo de forma elegante ", "group_id": 965, "id": 2396133}, {"user_id": 42688, "stars": [], "topic_id": 46530, "date_created": 1319498109.8912289, "message": "Checa http://vendder.com/ yo lo uso en un sitio y esta bastante bien!  Ya me registre para probar Bahux, mucha suerte!", "group_id": 965, "id": 2424726}, {"user_id": 19720, "stars": [], "topic_id": 46530, "date_created": 1319565194.687371, "message": "@ferso de hecho Vendder es brasileño, creo que @woakin tiene razón en que les deberías de seguir la pista....", "group_id": 965, "id": 2430823}, {"user_id": 42688, "stars": [], "topic_id": 46530, "date_created": 1319578760.5636449, "message": "Tiendas como Liverpool y El Palacio de Hierro no tienen en cuenta la experiencia del usuario al diseñar sus sitios. Sus paginas son horribles y complicadas! Creo que invertir en un diseñador web bueno que sepa de UX seria un gran paso!", "group_id": 965, "id": 2432680}]