[{"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1299480302.473314, "message": "NSFW, TWIP, TNT. Note: TNT is based on format, not content.", "group_id": 5074, "id": 285934}, {"user_id": 17124, "stars": [], "topic_id": 11239, "date_created": 1299489499.4358981, "message": "It's hard to say. When I look at the list of all available shows in the Leoverse, I see that there are quite a few of shows I have never seen. So it's hard to tell if I'd like them or not. From those I have at least stumbled upon as reruns or random visits in the TWiT Live site, I suppose Windows Weekly and, say TWiL might be two of those. Not that those shows are particularly bad, I'm just not that interested in those subjects. Which usually leads to quick boredom.", "group_id": 5074, "id": 286425}, {"user_id": 17693, "stars": [], "topic_id": 11239, "date_created": 1299507503.8630199, "message": "Definitely NSFW. I like all the co-hosts, but as a show, it has nothing to do with my tastes. TWiL, but only because, again, that's not what interests me, but I agree that it's a needed show on TWiT.tv. I wouldn't mind having a short segment of \"TWiL\" on TWiT, when the news or topic being discussed, needed some (real ;)) experts on the matter. ...and, the 3rd one, maybe FourCast... although I confess that this is much more entertaining than NSFW and I'm only mentioning it here because I needed a 3rd and... it's not really about knowledge or news, so...", "group_id": 5074, "id": 287735}, {"user_id": 17937, "stars": [], "topic_id": 11239, "date_created": 1299511919.269907, "message": "The issue with TWiL is that its all out of studio", "group_id": 5074, "id": 288269}, {"user_id": 15929, "stars": [], "topic_id": 11239, "date_created": 1299519714.9227509, "message": "anything with dr. kiki in it... nothing against her, i just don't see the point of her shows", "group_id": 5074, "id": 289102}, {"user_id": 19223, "stars": [], "topic_id": 11239, "date_created": 1299523530.7716379, "message": "@unwrangle Yes, Science is dumb, anything that is not shiny gadgets is a frivolous waste of time.  I agree.  Synthetic Biology!!! how is that ever going to effect my daily life.  The iPad 2 has a NEW CAMERA! and is minutely thinner! Now thats important.", "group_id": 5074, "id": 289600}, {"user_id": 16841, "stars": [], "topic_id": 11239, "date_created": 1299531624.907234, "message": "What's odd (in addition to what I posted above), is that I am a die hard Microsoft user yet I enjoy MacBreak more than WW.  Just my opinion!", "group_id": 5074, "id": 291089}, {"user_id": 17937, "stars": [], "topic_id": 11239, "date_created": 1299531171.508862, "message": "Ouch", "group_id": 5074, "id": 290984}, {"user_id": 16841, "stars": [], "topic_id": 11239, "date_created": 1299531594.203918, "message": "I haven't watched all of them, but TWiL just isn't my cup of tea, nor is green tech today (altho that appears to be the best produced).  Windows Weekly is probably the one that I would *like* to enjoy, but can't seem to.  I don't know exactly what it is about it, there is a bit of negativity in it, and it seems to turn into a Microsoft love-fest from Paul with Leo not having much to say.", "group_id": 5074, "id": 291084}, {"user_id": 15929, "stars": [], "topic_id": 11239, "date_created": 1299552501.590378, "message": "@Ford_Prefect2nd wow, brilliant jump from 'not caring' to 'dumb'... i bet you're very proud of yourself today :)", "group_id": 5074, "id": 293091}, {"user_id": 17527, "stars": [], "topic_id": 11239, "date_created": 1299590056.1417201, "message": "there is not much really. I recently subscribed to all of TWIT show", "group_id": 5074, "id": 295815}, {"user_id": 17097, "stars": [], "topic_id": 11239, "date_created": 1299595414.1012621, "message": "I own no Apple products so I could \"least favorite\" two shows right off, but since that would be more for relevance than quality reasons for me, I'll give them a pass. The big fail show is already gone. (Hint: Not a tech, sci., food, parenting or rowboat show). I'll leave it there as this thread is going nowhere good- just troll bait if you ask me. In fact, this is my Least Favorite TWiT topic by far.", "group_id": 5074, "id": 296434}, {"user_id": 15929, "stars": [], "topic_id": 11239, "date_created": 1299598160.06709, "message": "@twitizen is it twif?", "group_id": 5074, "id": 296751}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300004419.7420011, "message": "Twitzen, I didn't start this topic for it to be troll bait. Loyal viewers have opinions and disappointments. It's just as important to know what doesn't work as much as what does.", "group_id": 5074, "id": 339593}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300004647.0035679, "message": "unwrangle didn't start the noise or the offensive. I happen to agree with him/her. Unfortunately, his/her honest comment attracted an offensive, not a defensive. Some people overreact and so the noise gets louder. It's unwarranted, but it happens.", "group_id": 5074, "id": 339595}, {"user_id": 17555, "stars": [], "topic_id": 11239, "date_created": 1300008407.5109611, "message": "NSFW - I like Brian but and I like Scam School on Rev3 but NSFW no!!!!", "group_id": 5074, "id": 339748}, {"user_id": 16859, "stars": [], "topic_id": 11239, "date_created": 1300039546.800324, "message": "Hard to say least, favorite, but not hot on the list\nGreen Tech Today, Dr. Kiki's Science Hour, Futures in Biotech probably,\nThis week in computer hardware, Triangulation\n", "group_id": 5074, "id": 342079}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300112700.337908, "message": "Brian Brushwood is a talented guy. Hard working too. But I wish that he would move on to the next level and shed his NSFW skin.", "group_id": 5074, "id": 347589}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300112866.167186, "message": "@Hatebaddesign I agree with you 100%. THat's why I don't watch TWIT on Thursdays...except iPad Today.", "group_id": 5074, "id": 347604}, {"user_id": 17912, "stars": [], "topic_id": 11239, "date_created": 1300318667.1392651, "message": "I find it very difficult to listen to TWiLaw and Futures in Biotech. Even when the topic is interesting, both shows are a massive undertaking. Same with TWiCH — I don't think I've ever made it past ten minutes before it gets too nerdy even for me.", "group_id": 5074, "id": 370063}, {"user_id": 16859, "stars": [], "topic_id": 11239, "date_created": 1300334234.5465591, "message": "TWIL is usually ok for me, though sometimes they have someone on who breathes heavy in the mike when he is not supposed to be speaking, and nobody calls him on it - drives me up the wall :)", "group_id": 5074, "id": 371396}, {"user_id": 22028, "stars": [], "topic_id": 11239, "date_created": 1300351863.450902, "message": "I quite like the Science hour - really struggled with Maxwell's House when it was on. Ray Maxwell is obviously a smart, talented, interesting guy, but he just drones too much for me.", "group_id": 5074, "id": 372441}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300363407.6355929, "message": "I tried watching TWIL a few times but always found myself drifting off. it's not an easy topic to make interesting. however, personable participants would help, as would better camera quality. it sometimes looks more like dorm chat than a real show.", "group_id": 5074, "id": 373107}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300364673.286762, "message": "<oops!> just reread my last post. too many \"delivery\" references. sorry for the bad grammer. what i meant to say is... \"slow, monotone speech = Ambien-like results\" :)", "group_id": 5074, "id": 373234}, {"user_id": 17584, "stars": [], "topic_id": 11239, "date_created": 1300363694.447938, "message": "@benoliver999... i agree with you about Maxwell. knowledgable guy, but his delivery is lacking. At first, i thought it might be because he's from/in V.C./canada, but it's not. it's the speed, or lack thereof, of his delivery that is the key to his delivery.", "group_id": 5074, "id": 373145}, {"user_id": 22453, "stars": [], "topic_id": 11239, "date_created": 1300378054.1577711, "message": "My favorite show is iPad today followed by Twit", "group_id": 5074, "id": 375161}, {"user_id": 17124, "stars": [], "topic_id": 11239, "date_created": 1300387290.688714, "message": "^^ Or could it be the short attention span of the listener, instead of the slow delivery of the speaker? ;p\n\n^ This is about the least favourite shows, @kyserboy.\n\nI for one want to compliment Dr.Kiki as a great show host, even if you wouldn't like the science stuff. I do/did watch/listen to the shows occassionally, and I liked the way Kiki handled the interviews, asking relevant questions and better still, (unlike Leo), never interrupted the speaking guest. I also sort of miss the Kiki giggle, :) now that she's mostly off the \"air\" taking care of Nano. Some of the science topics were quite fascinating, some were/are a bit more boring, but it would be a shame if all those science shows were to be canned. Ray's allegedly slow speech didn't really bother me, either.\nPerhaps some of the least popular shows could be combined, somehow.", "group_id": 5074, "id": 376514}]