[{"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318376730.674397, "message": "First question: After reading Web-Based Distance Learning Technology: The Impacts of Web Module Length and Format, what do you want to know more about?  Particularly what they would change about the methods of the study to make it more directly relevant to the course that you're designing?", "group_id": 11791, "id": 2328368}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318376862.1753449, "message": "Second question: How pertinent are those results to those who are teaching in the arts & humanities? Do you feel certain disciplines are much more difficult to teach using diagrams, photos, and other visuals? For example, how can we use effective visuals given the more abstract nature of the humanities?", "group_id": 11791, "id": 2328381}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318437026.2265561, "message": "I agree that F2F is expensive/valuable - coming from a language learning and teaching background, it's hard for me to even imagine a fully online course sometimes. In those cases, teachers generally try to have students use the target language in speaking and listening activities in class and then have reading and writing at home. Sounds like you're thinking of something similar.", "group_id": 11791, "id": 2333087}, {"user_id": 42142, "stars": [], "topic_id": 46438, "date_created": 1318436136.1972089, "message": "I met with the faculty members who are directly invested in turning Tech Writing into an online or hybrid course. What I'm most concerned with now (after meeting with all three faculty, and also reading \"The Impacts\") is students completing modules/units, regardless of the length of the module or video (I know this is important, too). One faculty member said that he noticed that work which was assigned at the end of the week students would simply not complete. He said it didn't matter how long the units were, that the idea of \"out of sight, out of mind\" seemed to play out. I'm not sure if this is wholly relevant to this reading (lol) but I wanted to share it with the group!", "group_id": 11791, "id": 2333007}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318436555.4467289, "message": "@elizabethkeller I think that's a great question - how do we ensure completion? I think in my course, at least, we're assuming that a certain amount might be skimmed/skipped, but we'll have some check-in assessments for the readings and the tasks/discussions will be based on other materials.", "group_id": 11791, "id": 2333047}, {"user_id": 42142, "stars": [], "topic_id": 46438, "date_created": 1318436906.4924841, "message": "The way Tech Writing has been taught f2f or online before has been largely constructed around group or team projects, which is a great way to teach these writing concepts. Maybe in my hybrid/blended course I could do \"homework\" things during class time and \"content\" or \"lecture\" type things online? Hmmmmm! That might work! In fact, now that I think about it, a lot of writing intensive classes do just this because f2f time is economically expensive :)", "group_id": 11791, "id": 2333079}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318522225.399647, "message": "That's definitely a difficult question. When I was in K-5 settings, it was unthinkable to allow students to fall behind, for a variety of reasons. However, in higher education, students are adults who can make informed choices based on their understanding of the consequences. This means that if we've supported their learning and made it clear what the consequences are (through a clear syllabus and conversations with the class), then students choosing not to keep up with the work should be allowed to experience failure.", "group_id": 11791, "id": 2340148}, {"user_id": 42142, "stars": [], "topic_id": 46438, "date_created": 1318521059.7835219, "message": "I've beent thinking more about my question. At what point do I just let my students fall behind or even fail? As a new teacher, it's hard to even say that.", "group_id": 11791, "id": 2340033}, {"user_id": 41585, "stars": [], "topic_id": 46438, "date_created": 1318522692.8457329, "message": "Beth - I think your question is one that has no right answer, obviously. I think the true question is: if students are falling behind, why? If, after careful consideration, you determine that they've had ample opportunity to complete their modules, then I think it's fair game to let natural selection take its course. But, if you have any hint that pacing may be an issue -- or something of that ilk -- it may be beneficial to probe the situation.  I think there is a very fine and often nebulous line between helpful prodding and mother-henning. I don't think it's useful for anyone if you breath down someone's neck re: assignments. But, by the same token, it could be a communication/technical breakdown that's leading to these problems and prodding could help.", "group_id": 11791, "id": 2340172}, {"user_id": 41585, "stars": [], "topic_id": 46438, "date_created": 1318522782.6531439, "message": "Right now, I'm working w/Deb to think about course structure (I know, a little behind the eight ball), and we've determined that, because this course will be offered in the summer, three modules of three weeks each might be best. Because each module is built around a 5 page essay, time became an important determining factor.", "group_id": 11791, "id": 2340184}, {"user_id": 42142, "stars": [], "topic_id": 46438, "date_created": 1318526111.5928559, "message": "Hey Scott--thanks for the reply. It'll be good to keep that in mind. I think I could easily assess this by having students fill out surveys every so often.", "group_id": 11791, "id": 2340559}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318591029.556958, "message": "I agree. How do people feel this issue fits in with visual design? Could something about our design motivate or deter students from completing modules? Would you ask about that on a survey?", "group_id": 11791, "id": 2345640}, {"user_id": 42142, "stars": [{"date_created": 1318608458.9820459, "user_id": 41694}], "topic_id": 46438, "date_created": 1318598959.534549, "message": "I would ask students about that. And I'd also ask about other aspects of design (like visual, and also audio features, interactivity, etc.) I think it's important that the visual works with the content, and if that means simple and clean then so be it! :)", "group_id": 11791, "id": 2346088}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612256.154541, "message": "we'll reflect on that in our blog entry.", "group_id": 11791, "id": 2347471}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318611879.9644179, "message": "I'm a big fan of simple and clean, too. Also, I don't like having to scroll too much - I would prefer things divided into easy-to-manage chunks.", "group_id": 11791, "id": 2347399}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612240.156142, "message": "Yes, that was probably the issue here. Scott sent invites to everyone, and I just assumed that people would confirm them.", "group_id": 11791, "id": 2347467}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612248.741719, "message": "We should have planned better . . .", "group_id": 11791, "id": 2347469}, {"user_id": 42226, "stars": [], "topic_id": 46438, "date_created": 1318612178.9478359, "message": "Erin, it looks like we are the only online!! Also only 6 members (3 are you, Kate and I) have registered. Oh well, this can probably be discussed in next weeks class.", "group_id": 11791, "id": 2347448}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612973.337126, "message": "Yeah, I made an erroneous assumption.", "group_id": 11791, "id": 2347630}, {"user_id": 42226, "stars": [], "topic_id": 46438, "date_created": 1318612415.2783, "message": "There was definitely a problem yesterday because when I clicked onto the link that you included in the email it came up saying that there was a problem so come back later.....it didn't happen today. I honestly don't think that is the exclusive reason why but it may be one.", "group_id": 11791, "id": 2347506}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612584.5401449, "message": "I thought because we talked about Convore in class everyone would have activated their account.", "group_id": 11791, "id": 2347551}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1318612553.51454, "message": "I feel that my goal wasn't met for reasons I should have taken into account.", "group_id": 11791, "id": 2347537}, {"user_id": 42226, "stars": [], "topic_id": 46438, "date_created": 1318612867.754164, "message": "I think we didn't actually say we would use it (I think) but that it was an option to use.", "group_id": 11791, "id": 2347599}, {"user_id": 42226, "stars": [], "topic_id": 46438, "date_created": 1318613153.0475979, "message": "This is what this course is all about - learning or discovering what does work and what doesn't work. Hi,Kate it looks like you are online", "group_id": 11791, "id": 2347651}, {"user_id": 41585, "stars": [], "topic_id": 46438, "date_created": 1318900522.483094, "message": "I like clean design too. When we read that blog about Steve Jobs, I couldn't help but think about how foundational simplicity was to the work he did at Apple. When we're talking about learning (which is hard enough as it is) in online environments, I think simplicity always has to be at the top of our priority lists. Simplicity, however, doesn't have to mean sacrificing content or functionality. Rather, as is evidenced in Jobs' work, it is about highlighting and making manifest things that are most important in the user experience. Take for instance the slides produced by Bill Gates and Jobs. What makes Jobs' better is the fact that he's able to isolate what's most important and make it unavoidable. Sometimes when we're designing, we've just got to make things unavoidable.", "group_id": 11791, "id": 2372457}, {"user_id": 41694, "stars": [], "topic_id": 46438, "date_created": 1319468860.662828, "message": "@miketardiff I like that you say that he makes what's important \"unavoidable.\" I guess I'm implicitly working off that idea as I design my Angel pages - I want a clean, straightforward design where anything necessary or important is obvious and unavoidable.", "group_id": 11791, "id": 2421054}]