[{"user_id": 36525, "stars": [], "topic_id": 41008, "date_created": 1309592455.890676, "message": "I thought of one question I wanted to ask that didn't involve any hackery.  One of the types of characters I've recently been most impressed by is the type of character who has two layers.  This kind of character has a facade of outwardly acting one way, but inwardly thinking and feeling a different way.  For example a character who outwardly demonstrates a superiority complex about one aspect of themselves, but inwardly has an inferiority complex about a different aspect of themselves.  Or a character who outwardly acts like they really like something, but inwardly detests that thing (or vice versa).  How would you construct this type of character in Dramatica?  Would you look for them to have a particular relationship between their Issue and their Unique Ability or Critical Flaw, or anything like that?", "group_id": 2515, "id": 1547305}, {"user_id": 36525, "stars": [], "topic_id": 41008, "date_created": 1309625263.951786, "message": "Or, maybe one personality layer is in the MC throughline while the other is in the SS or OS?", "group_id": 2515, "id": 1548413}, {"user_id": 33839, "stars": [], "topic_id": 41008, "date_created": 1309627219.0908091, "message": "I've written stories dealing with the issue, but I'm still learning my Dramatica so I probably wouldn't be much help with that regard.", "group_id": 2515, "id": 1548536}, {"user_id": 33839, "stars": [], "topic_id": 41008, "date_created": 1309627120.3087511, "message": "I don't think I'm rightly qualified to give an answer in Dramatica terms, other than I don't believe your second message is the answer - unless you're talking about a movie like Identity which where everything takes place in the MC's head.", "group_id": 2515, "id": 1548525}, {"user_id": 33839, "stars": [], "topic_id": 41008, "date_created": 1309628416.8211949, "message": "Perhaps some questions that will help:  is the character's behavior something they actually realize they're doing (consciously), or is it a product of subconscious activity, such as a defense mechanism?  \n\nA couple of Hitchcock films, Vertigo and Psycho, deal with two characters who demonstrate both:  Norman's keeping the facade of mother being alive is done subconsciously because of guilt whereas in Vertigo, Judy purposely keeps up a false facade of being innocent the more and more Scottie makes her over back into Madeline.  \n\nOne could also say Scottie himself has a bit of a facade, most definitely tied to a critical flaw (I'm too lazy to look up what specifically it would translate to, but obsession).  He's obsessed with Madeline, or more specifically, the \"notion\" of who and what \"Madeline\" was/is/represented.  His falling for Judy is more subconscious/internal to his obsession - even when he gets Judy to dress and dye her hair like Madeline, she's STILL not Madeline enough.  So no matter how outwardly he is in his appearance towards Judy, it's all driven by his obsession of Madeline... and what makes it fascinating is Judy knows this but goes along ----> creating her facade.  While she tries to portray the self confidence of Madeline to draw Scottie once the twist is revealed, we know that internally, she's really insecure (why else would she allow herself to be made over into another woman?).", "group_id": 2515, "id": 1548658}, {"user_id": 7664, "stars": [], "topic_id": 41008, "date_created": 1309633833.1924319, "message": "I have a couple of thoughts.\n\nOne, I think it matters if the character what objective or subjective role the character plays. And, if the story is success or failure.", "group_id": 2515, "id": 1549153}, {"user_id": 7664, "stars": [], "topic_id": 41008, "date_created": 1309634409.393585, "message": "That said, I think putting Denial in a key position.\n\nIt's also possible that building up conflicts in their methodology, evaluation, purpose, etc. could give them the personality you are looking for.\n\nI'm curious if you think a character with a facade (in the IC or MC position) is necessarily a BE-er.", "group_id": 2515, "id": 1549189}, {"user_id": 36525, "stars": [], "topic_id": 41008, "date_created": 1309640040.3357921, "message": "And no, I don't necessarily think a character with a facade would be a be-er.", "group_id": 2515, "id": 1549479}, {"user_id": 36525, "stars": [], "topic_id": 41008, "date_created": 1309639894.5729079, "message": "@JBarker I was thinking the character would be doing it consciously - like they consciously judge their inner feelings to be unacceptable or disadvantageous or unwanted by people around them so they act the opposite.  Hmm, that almost makes it sound like it's part of the symptom/response, except it's not particularly related to the plot.\n\n@MikeDerk Let's say the story is success, although I'd like an explanation of why you think that matters because I'm not immediately seeing it.  Objective or subjective role... how about an IC protagonist who is the MC's love interest?", "group_id": 2515, "id": 1549468}, {"user_id": 10814, "stars": [], "topic_id": 41008, "date_created": 1309710312.334933, "message": "Imagine a relatively simple character made up of Conscience and Prevent/Avoid.  He'd be recommending the \"right\" things everyone should do, all the while working to stop the effort to achieve the story goal.", "group_id": 2515, "id": 1552767}, {"user_id": 10814, "stars": [], "topic_id": 41008, "date_created": 1309710414.515727, "message": "Also, I think if you look at the Symptom and Response versus the Problem and Solution (MC or IC), you could see the public effort vs. the real source of drive, of which the character probably would not be aware.", "group_id": 2515, "id": 1552773}, {"user_id": 10814, "stars": [{"date_created": 1309733741.656131, "user_id": 7645}, {"date_created": 1312293476.5148571, "user_id": 35141}], "topic_id": 41008, "date_created": 1309710503.9923429, "message": "I think the dichotomy is best explained by the role as an OS character as compared to the personal perspective and issues of a subjective character.  In that context, the difference between the two seems natural and can be explored fully.", "group_id": 2515, "id": 1552777}, {"user_id": 7664, "stars": [], "topic_id": 41008, "date_created": 1309837107.818192, "message": "And, while I think your second post seems like maybe a hack of Dramatica, it's intriguing. And this is why I like questions like this. Because it could work.\n\nAlso, I think being able to see @Chris_Huntley's comment that it could be \"Conscious + Prevent/Avoid\" is a great way to see those things in a new light.", "group_id": 2515, "id": 1564511}, {"user_id": 7664, "stars": [], "topic_id": 41008, "date_created": 1309836998.472805, "message": "@sunandshadow I would love to answer your question, but my own thinking has progressed over the past few days.\n\nThe idea had been... if an IC's Unique Ability was Denial -- in that they denied what they what they really wanted -- and they succeeded in influencing the MC (resulting in a Change, resulting in a Successful OS outcome) because the MC firmed up on what they wanted (as in, they got tired of dealing with a person deluding themselves)... that's one thing.  But if Denial was their Critical Flaw, then their self-delusion interferes with affecting the MC... along those lines...\n\nBut, that all seems a bit like \"first draft thinking\".\n\nI had come to a similar thing to one of Chris's comments: that you might just be talking about the difference between a symptom and a problem -- in certain stories anyway.", "group_id": 2515, "id": 1564488}]