[{"user_id": 5844, "stars": [], "topic_id": 11504, "date_created": 1299604098.0422859, "message": "I read a lot of fanfics and original fics online. I also write but am at a standstill. Does anyone else read video game fanfics/write and if so, what do you write and read or would like to recommend for what game?", "group_id": 857, "id": 297539}, {"user_id": 5844, "stars": [], "topic_id": 11504, "date_created": 1299604354.5504179, "message": "Final Fantasy 8: Fire and Ice by altol                                                                                         Final Fantasy 8: A Second Chance by Viginti Duo                                                                        Final Fantasy 10-2: Rikku's Story by JoeyStar                                                                                There's a few other FF fics I've read, quite a few, but people have deleted them over the years. However, I'm wondering about fics from other games. It would actually probably make me want to buy other games besides the ones I already own.", "group_id": 857, "id": 297569}, {"user_id": 2941, "stars": [], "topic_id": 11504, "date_created": 1299938429.3646359, "message": "I've never read any, but it might be cool if they're done well. I can only imagine that there are tons of crappy ones from middle schoolers. As for which games I think would be interesting. . . maybe MK if it's real and gritty like that short a while back or another fighting game that makes a cool elaboration on a character. Star Ocean could be really cool too. Hmm, not sure what else right now, maybe I'll think of more possibilities later.", "group_id": 857, "id": 331774}, {"user_id": 2941, "stars": [], "topic_id": 11504, "date_created": 1299939154.251894, "message": "Oh, and on a side note slightly related to this, sorta. New webseries based on Dragon Age 2 with Felicia Day coming this summer, I think?", "group_id": 857, "id": 331841}, {"user_id": 5844, "stars": [], "topic_id": 11504, "date_created": 1300139715.8095169, "message": "lol which star ocean? i don't think there's much on it. yeah, but it's easy to tell which stories are made from middle school kids - they often write their summaries with bad grammar and texting lingo", "group_id": 857, "id": 351389}, {"user_id": 2941, "stars": [], "topic_id": 11504, "date_created": 1300158224.1800179, "message": "Well, I've only played the newer ones: Till the End of Time and Last Hope. I think the world has definite possibility for stories. Though, I've heard the earlier games are much better story/character wise.", "group_id": 857, "id": 353104}]