[{"user_id": 11626, "stars": [], "topic_id": 21576, "date_created": 1303885218.623564, "message": "http://www.guardian.co.uk/environment/2011/apr/26/chernobyl-radioactive-fires-global-danger\r\n\r\n\r\n\r\nForest fires around Chernobyl could release radiation, scientists warn\r\nConsortium says $13.5m is needed to improve firefighting and monitoring in radiation-soaked plantations around station\r\nPatrick Evans in Chernobyl\r\nThe Guardian\r\n\r\nApril 26, 2011\r\n \r\nEngineers measure radiation in the forests around Chernobyl's decommissioned station. Photograph: Tatyana Zenkovich/EPA\r\n\r\nA consortium of Ukrainian and international scientists is making an urgent call for a $13.5m (£8.28m) programme to prevent potentially catastrophic wildfires inside the exclusion zone surrounding Chernobyl's ruined nuclear power plant.\r\n\r\nThe fear is that fires in the zone could release clouds of radioactive particles that are, at the moment, locked up in trees, held mainly in the needles and bark of Scots pines.\r\n\r\nThe consortium says an automated fire detection and monitoring system and new firefighting and forestry equipment are needed to guarantee safe management of Chernobyl's forests.\r\n\r\nSince 1992, six years after the nuclear accident at the Ukrainian power plant which released large quantities of radioactive contamination into the atmosphere, there have been more than 1,000 wildfires inside the Chernobyl exclusion zone (CEZ), the 18-mile radius ring around the plant where access restrictions apply.\r\n\r\nIf there is a catastrophic or \"crown\" fire (a high-intensity wildfire affecting a large part of the CEZ) radionuclides could be dispersed over a wide area; a big fire could send radioactivity as far as Britain.\r\n\r\nA £3.98m plan for \"basic emergency measures\" has been approved by scientists from the National University of Life and Environmental Sciences of Ukraine, Yale University and the UN Global Fire Monitoring Centre. The Ukrainian government has not fully endorsed the proposal but if it is adopted it could need at least £4.29m more in international funding and technical support, say the scientists.\r\n\r\nFirefighters tackling woodland fires near Chernobyl lack monitoring as well as equipment. Jakov Kalynik, a firefighter at Parishev station, about nine miles from the ruined plant, said: \"I know when I am fighting a fire on radioactively contaminated ground – you get the heat just like an ordinary fire, but you get a tingling sensation too, like pins jumping all over your body. I don't know how bad it is for me, there's no medical testing afterwards, we just go and wash.\"\r\n\r\nIn March, Chernobyl Forestry Enterprise, a state forestry firm, was \"low on fuel\" and firefighters had to resort to using a horse and cart to fetch water. \"Some equipment, like caterpillar trucks, just sits here,\" said Pyotr Kova, deputy head of Lubyanka fire station district.\r\n\r\nDmytro Melnychuk, rector of the national university, said: \"Strontium-90, plutonium, and americium-241 are all extremely susceptible to upward atmospheric migration and dispersal via heat from fires. They create problems for firefighters and others who breathe them in. Radioactive smoke landing on crops … even 150km or more from the fire can create such concentrations of radiation in food it will be harmful to eat. Our studies, together with Yale University, have shown it is imperative we take measures to control the radiation [in] Chernobyl's forests.\"\r\n\r\nForest accounts for about 60% of the CEZ's 260,000 hectares (642,200 acres). The plantations soak up radiation and prevent its spread to groundwater.\r\n\r\nSergiy Zibtsev, associate professor at the Kiev Institute of Forestry and Landscape Park Management, said: \"Smoke from fires in 2003 … at the former nuclear test site at Semipalatinsk [Kazakhstan] was detected as far off as Canada, so the potential for wildfires to spread radioactivity from Chernobyl is a problem the international community has to take seriously.\"\r\n\r\nChernobyl's current firefighting protection system includes watchtower lookouts triangulating wildfires sites by radio. \"The system is effective but very slow,\" said Boris Danilenko, head of Chernobyl Forestry Enterprise. \"By the time a wildfire is big enough to see through summer heat haze it is typically half an acre in size.\"", "group_id": 3920, "id": 822479}]