[{"user_id": 8579, "stars": [], "topic_id": 4886, "date_created": 1297609635.246757, "message": "About what a publication about technology might look like if you built it Web-first, taking what was awesome about print and moving forward.", "group_id": 2810, "id": 91378}, {"user_id": 8579, "stars": [{"date_created": 1297955100.684948, "user_id": 8579}], "topic_id": 4886, "date_created": 1297609650.7865851, "message": "Here are some core principles:\n- Plan for the community first, before we even try to plan sections/features/etc. Identify who they are, how to reach them, and what we're going to give them in exchange for their participation.\n\n  - We should probably have a place for open discussion--a blog, basically. Post links, talk, get to be friends.\n\n  - I would like a shared, collaborative database of FEATURES, even if it's entirely my baby.\n    I've taken a few passes at designing this/coding it, and so I'd need to finish it.\n\n  - Hierarchy--roles, titles--should be used sparingly in the organization, humbly, and in the interest of quality.\n\n  - Editor/moderators should have very clear rules of conduct, publicly documented.\n\n  - Being a teacher is more important than being a boss. Document PROCESS and lessons, ESPECIALLY mistakes.\n\n- The magazine should be an emergent property of the community. A way to reward/sustain the people willing to do the most work. Right now the community is you, me, my wife, my documents of incorporation, and a few dozen people who will contribute and support us. I am a shy person but I believe that the discussion is important, so I'll do the work to help organize people around ideas.\n\n- The more visual the better. I almost want it to basically be a stream of visuals that draw you into text.\n\nI'd say my next step is to build a prototype of the community software and to start the blog. Getting shit on screen is what matters; otherwise I won't ever figure out how I'm going to fit this into my life.", "group_id": 2810, "id": 91379}, {"user_id": 8579, "stars": [], "topic_id": 4886, "date_created": 1297954575.8833649, "message": "So I was thinking about building this community. And I realized it needs to work WITH the web and other information spaces. That is, there needs to be a \"Featurism\" bookmark that you can use when you're on the web that pop up a very simple couple of boxes that help people annotate a given web page with a feature. There should also be an incredibly easy way to upload/annotate IMAGES. (This necessitates DMCA takedown stuff on my part, of course.)", "group_id": 2810, "id": 132219}, {"user_id": 8579, "stars": [{"date_created": 1297956590.7858579, "user_id": 13130}], "topic_id": 4886, "date_created": 1297954688.0548501, "message": "I'd also say that seeding the community--even paying bounties!--would be incredibly valuable. It's got to be accessible to all, very open.", "group_id": 2810, "id": 132231}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297956844.078089, "message": "Are we talking about, for instance, the fact that I've fallen in love with the various instapaper-type features, and bookmarklets? And that there are some features of Broadcastr, which I just signed into yesterday, that I think are new and awesome, and some that suck? Are we going to also have a database of features that suck?", "group_id": 2810, "id": 132490}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297956771.7354441, "message": "@ftrain I need a little more explanation of what a features database would be, and what it would look like.", "group_id": 2810, "id": 132475}, {"user_id": 8579, "stars": [], "topic_id": 4886, "date_created": 1297955524.5584891, "message": "I think the #1 task maybe is to build the little tool that lets ME (and Duncan, and whoever else) keep track of features and technologies that interest me as I browse the web. I.e. a bookmarking service that helps us achieve a particular editorial job. It'll make reading, say, BLDGBLOG or Engadget way more focused--in general it will help me in my larger reading, give me a way to focus and contribute and turn the web into a better place for me as a reader--I'm not aimlessly browsing Wikipedia, I'm cataloging our technoculture! So I should get a dumb prototype of this built ASAP and then play with it for a few weeks. Asking people to go somewhere and fill out a form is a bad idea; asking them to think about your task because it might help them organize their thinking--well, this is what every writer really wants, right? To change thinking and define patterns, and then have people act upon those patterns, challenge them, etc? Forms on the web always have editorial functions.", "group_id": 2810, "id": 132346}, {"user_id": 8579, "stars": [], "topic_id": 4886, "date_created": 1297957150.1420031, "message": "Yes! We are going to have that. I think a big toggle or a way to favorite features.", "group_id": 2810, "id": 132523}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297956573.2746789, "message": "@ftrain Yes.", "group_id": 2810, "id": 132458}, {"user_id": 8579, "stars": [], "topic_id": 4886, "date_created": 1297958511.3193259, "message": "Use the Reeder app to follow all your feeds. It's in beta--it embeds Readability as a native view.", "group_id": 2810, "id": 132623}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297956659.255692, "message": "@duncanmurrell OK, that was supposed to be in reply to a specific point of ftrain's above. Anyway, seeding and bounties sound good, smart.", "group_id": 2810, "id": 132463}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297958429.5482349, "message": "I don't know how this relates to featurism, but I would pay real money for a browser or app that allowed me to skip lightly around the internet without ever seeing an ad or a frame. In other words, I wish my Instapaper app could navigate the web for me. I would pay real money for that; $100 a year, at least. Readability is almost there, and I'll probably pay for that soon. But what I really want is to never have to think about ads and frames and whiz-bang bullshit and banners and pop-ups ever again. I don't want to even have to think, \"I should turn on Readability now.\" I just want Readability (or something like it) to take it all away. (Configurable by me, obvs.)  I realize I'm being silly, but a boy can dream.", "group_id": 2810, "id": 132617}, {"user_id": 13130, "stars": [], "topic_id": 4886, "date_created": 1297959356.191041, "message": "Nice!", "group_id": 2810, "id": 132683}]