[{"user_id": 11626, "stars": [], "topic_id": 8990, "date_created": 1298615811.0171199, "message": "Danger Room What's Next in National Security\r\nPrevious post\r\nNext post\r\nCIA Spy Sparks Conspiracy-Palooza\r\n\r\n    * By Adam Rawnsley Email Author\r\n    * February 24, 2011  | \r\n    * 9:43 am  | \r\n    * Categories: Spies, Secrecy and Surveillance\r\n    *\r\n\r\nAl-Qaeda’s nuclear arms dealer? The top recruiter for the Pakistani Taliban? A terrorist “mastermind?” These are just some of the explanations that have been picked up by the Pakistani press ever since Raymond Davis, an employee of the U.S. embassy in Pakistan, shot two Pakistani men he claimed were menacing him on the streets of Lahore.\r\n\r\nThe nature of Davis’ work — now acknowledged to be on contract for the CIA — and the prolonged vacuum of information regarding it has invited in a host of outlandish theories to fill the void.\r\n\r\nEarly on in the Davis affair, The European Union Times, an online news site printed a transparently silly story about Davis running weapons of mass destruction for al-Qaeda.  You see, a Russian intelligence report indicated that Davis had documents detailing U.S. shipments of”nuclear fissile material” and “biological agents” to al-Qaeda for the purpose of starting a world war that would restore the American economy to global dominance. Absurd as it is, the story has since been picked up by Pakistan’s The Nation, as well as by Pakistani journalists on press listservs and Twitter.\r\n\r\nThe narrative of the U.S. colluding with terrorists to attack Pakistan was later taken up by the Express Tribune , which ran a story claiming that Davis had gone rogue on the U.S. and started working for the Pakistani Taliban. “Davis was instrumental in recruiting young people from Punjab for the Taliban to fuel the bloody insurgency,” according to an anonymous senior police official from Punjab quoted in the story. The source called Davis’ arrest a “blessing in disguise” because he was suspected of “masterminding terrorist activities in Lahore and other parts of Punjab.”\r\n\r\nIn support of the allegations, the Tribune quotes more anonymous sources claiming Davis’ cell phone records indicate he was in contact with members of the Pakistani Taliban the Lashkar-e-Jhangvi, another Pakistani terrorist group.\r\n\r\nOf course, those phone records, if valid, could also be the hallmarks of someone spying on, rather than recruiting for, Pakistani terrorist groups, as the CIA now claims was Davis’ job.\r\n\r\nBut the choice of interpretation speaks to a deep distrust among the Pakistani public of the United States and its covert war in the country. Last week, Pakistani sources claimed (fairly dubiously) that the Davis shootings were responsible for a month-long halt in drone strikes. Now, as Pakistan’s intelligence service warns of a “split” with the CIA over the incident, all eyes are again looking to see whether the already tense relationship will buckle under the weight of public outrage, distrust and the rumors that help fuel it.\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/cia-spy-sparks-conspiracy-palooza", "group_id": 3920, "id": 206374}]