[{"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306222204.467571, "message": "Nicole is lending some books to @Chuckademis30 about dream interpretation. Two things: 1. What dreams have you had that you believe to be of God and how'd it turn out. 2. Do you think that dreams are set in their interpretation. Like Snake in dream = Jelly beans in life?", "group_id": 9787, "id": 1162997}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306222248.3476939, "message": "Disclaimer: I have not read the books yet and am more wondering about it. Do these books say this? If they do how is it any different to the book of Sin = Disease?", "group_id": 9787, "id": 1162998}, {"user_id": 32888, "stars": [], "topic_id": 36550, "date_created": 1306227192.9530411, "message": "It confuses me where people get the information for this, and for things like spiritual warfare and purging demons and possession... \n\nand cleansing households... all the hyper spiritual stuff that people claim to know about and can do as if it's a standard routine thing? where do they find instructions for the routine?", "group_id": 9787, "id": 1163937}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306227343.93262, "message": "@LintonCaldecott That is what I wonder. How do they get the \"symbology\" of a dream? Do all people associate the same things? Does God always use the same patterns? If a dream is from God and He wants you to know something will He not tell you or send someone that can?", "group_id": 9787, "id": 1163958}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306227576.465102, "message": "Is the book the same as someone being sent to interpret or what is the thinking here? Ties up maybe to prayer? If we have this clear open channel to speak to and hear from God, can we not have a dream and just ask him to explain it? Why would He not or is that something we just don't question? It is supposed to be vague and we're supposed to seek?", "group_id": 9787, "id": 1164000}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306227617.754746, "message": "Part of the package sort of thing?", "group_id": 9787, "id": 1164007}, {"user_id": 32888, "stars": [], "topic_id": 36550, "date_created": 1306227649.960114, "message": "Well, Joseph had dreams for himself, but he knew what they meant... but others dreamt and needed Joseph to interpret.", "group_id": 9787, "id": 1164018}, {"user_id": 32888, "stars": [], "topic_id": 36550, "date_created": 1306227408.75616, "message": "he did, he got someone to write a book.", "group_id": 9787, "id": 1163971}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306228953.3333859, "message": "@LintonCaldecott Yes. Question is more; is a set book with set definitions a way to interpret dreams? Maybe I need to read the books to see what they say about getting an interpretation? Seems to me that when God is talking someone knows? Like Joseph could interpret his own and those around him? Seems pretty pointless for God to give someone a dream and no answer as to what it's about.", "group_id": 9787, "id": 1164336}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306241820.1048989, "message": "Who has had dreams they believe to be spiritual, positive or negative? I have lots of dreams, but not many that I would say are directly spiritual", "group_id": 9787, "id": 1165422}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306242295.302506, "message": "Here's an example of a spiritual one that occurred just the other night. I believe fully that it was a direct spiritual attack, so if you have trouble with believing this sort of thing maybe don't get upset... So the dream goes like this. I don't remember every detail, but this is what I remember. It was one of those dreams where you think you've woken up. I could see all my flat and I was in bed and for some reason I thought my flatmate had sleep walked and was lying on my bed because it felt like someone was lying on me. I told him to go back to bed and he got up and went upstairs. Weird bit here. I got up to check if he was ok and there was hair all over the apartment. Like you get after a haircut. I looked up the stairs, he was not there and didn't respond so I went back to bed. Next thing I felt something in my bed again and this time it was just a weight, pressure on me holding me down and with it came a sudden huge sense of fear. All I could do was cry out to Jesus, seriously. My breath came in gasps I could hard speak, but I cried out to Jesus over and over until I awoke. The fear remained though. I got right to praying and then pulled out my bible for some comfort. Seriously scary encounter!", "group_id": 9787, "id": 1165513}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306242149.2479329, "message": "@Chuckademis30 What are your thoughts? Experiences?", "group_id": 9787, "id": 1165484}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306241769.713212, "message": "Joesph made it very clear that it was God that interpreted the dreams to him. I don't believe there is a formula.", "group_id": 9787, "id": 1165417}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306241930.44016, "message": "@pevans_om I still need to read these books but if they claim certain dream objects = certain life realities, would you say it's not legit?", "group_id": 9787, "id": 1165441}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306242389.984901, "message": "@penkin I don't know about formulas. My experience is that God works in His own ways and they are pretty mysterious. I don't agree with the idea of simple dream interpretation by formulae. That's a very 'modern' way of thinking and belies the complexity of the spiritual world", "group_id": 9787, "id": 1165532}, {"user_id": 32891, "stars": [], "topic_id": 36550, "date_created": 1306311258.459332, "message": "I'd have to agree with the no set formula thing.. It's a biblical concept too though so I'm not ruling it out. During (& just before) the worst of my money / job / visa issues I had 2 dreams that I feel were from God & they were of great comfort during that time.. They weren't particularly symbolic or anything & it was pretty straight forward interpreting them..", "group_id": 9787, "id": 1175721}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306311755.17202, "message": "@EdwinGarden I have also had some straightforward dreams that I believe were from God. The information given to me in those dreams proved to be accurate and I had a huge \"sense\" that they were not any normal dreams.", "group_id": 9787, "id": 1175776}, {"user_id": 33006, "stars": [], "topic_id": 36550, "date_created": 1306317875.94469, "message": "@pevans_om ie had those before", "group_id": 9787, "id": 1176285}, {"user_id": 33006, "stars": [], "topic_id": 36550, "date_created": 1306317934.9103451, "message": "@pevans_om why cant you edit previous messages...anyway. Ive had that 'oppressive' type experience before. Although it wasn't a dream, i was wide awake, but couldnt move and have fear etc etc...", "group_id": 9787, "id": 1176289}, {"user_id": 33006, "stars": [], "topic_id": 36550, "date_created": 1306317948.1458211, "message": "so maybe not technically for this discussion.", "group_id": 9787, "id": 1176290}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306343506.9225831, "message": "Can some of the formula people explain what it means when your house has loads of cut hair lying around?", "group_id": 9787, "id": 1181008}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306346425.7810681, "message": "@pevans_om It's time for a hair cut or possibly time to clean up? Seriously though, let me have a look through these books @Chuckademis30 was gonna lend (who knows when he plans on getting them?). I'll get back to you.", "group_id": 9787, "id": 1181649}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306346912.247679, "message": "The first one I pull out is \"Dream Talk\" - http://www.kalahari.net/books/Dream-Talk/632/32991211.aspx - There is nothing about hair but they say dust relates to confusion.\n\nDisclaimer: No single interpretation for for any one symbol will hold true in every dream.", "group_id": 9787, "id": 1181731}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306347358.5536921, "message": "The second one is \"Understanding the Dreams you Dream\" - http://www.kalahari.net/books/Understanding-the-Dreams-You-Dream/632/642396.aspx - Nothing about dust or hair but they have friend. Friend reveals something about yourself. Look for something similar like trade, hair, eye colour, initials, character...\n\nDisclaimer: This book seems to take a piece like Friend and then associate it to a single verse. The top used 1 Samuel 15:8 \"He captured Agag the king of the Amalekites alive, and utterly destroyed all the people with the edge of the sword.\" Then they say he symbolically spared himself so that is why a friend in dreams points out something about you.", "group_id": 9787, "id": 1181829}, {"user_id": 32900, "stars": [], "topic_id": 36550, "date_created": 1306349799.9350281, "message": "@penkin wow that last bit is a real stretch!", "group_id": 9787, "id": 1182740}, {"user_id": 13817, "stars": [], "topic_id": 36550, "date_created": 1306351938.1893511, "message": "@pevans_om I must admit I have not read the whole book so maybe they try explain what they mean when they give these symbols. Still don't see any way they could makes sense of what they're trying to say though.", "group_id": 9787, "id": 1183267}]