[{"user_id": 8361, "stars": [], "topic_id": 33088, "date_created": 1304284962.70946, "message": "Hi guys. It's a dumb question, but I've never been to the US before. Is one supposed to leave a tip at a fast food restaurant? Especially when there's no boxes for tips?", "group_id": 614, "id": 878028}, {"user_id": 1736, "stars": [], "topic_id": 33088, "date_created": 1304287951.5339379, "message": "A lot of the bigger chains have policies against it. If there isn't a jar on the counter it is probably because they aren't allowed to accept them.", "group_id": 614, "id": 878346}, {"user_id": 1175, "stars": [], "topic_id": 33088, "date_created": 1304391938.7436409, "message": "My rule is that unless they bring the receipt to your table, you don't need to tip", "group_id": 614, "id": 892856}, {"user_id": 27184, "stars": [{"date_created": 1308910004.724004, "user_id": 7056}], "topic_id": 33088, "date_created": 1304558712.7098711, "message": "No need to leave a tip if you are just ordering at the counter and pick ip the food there as well", "group_id": 614, "id": 922001}, {"user_id": 346, "stars": [], "topic_id": 33088, "date_created": 1304593394.647521, "message": "To make it very explicit: if there isn't table service, look for a Tips jar/box. If there isn't one, you don't need to tip.", "group_id": 614, "id": 927501}, {"user_id": 12709, "stars": [], "topic_id": 33088, "date_created": 1304657753.5574851, "message": "growing up in UK / AU, tipping (and also sales taxes) confuses the hell out of me. In Australia, the general rule is that the price on the menu (or in sales taxes, the price on shelf) is what you pay. We only really tip if the food or service is amazing.\nHaving to work out what 10-20% of your bill is and then add that on top is just annoying.\nI get that the minimum wage is a lot lower there & that people get most of their pay from tips, but from the foreign customer point-of-view it's just backwards.", "group_id": 614, "id": 938419}, {"user_id": 22183, "stars": [], "topic_id": 33088, "date_created": 1304708436.688174, "message": "Well, in Australia isn't all restaurant staffs on salary and not on minimum wages + tips?", "group_id": 614, "id": 944943}, {"user_id": 12709, "stars": [], "topic_id": 33088, "date_created": 1304942245.2429769, "message": "yes, I believe they're paid an okay rate per hour. plus I think our minimum wage might be higher, because we don't do the tips thing. but I don't know, it still seems weird. why don't they just save everyone the headache & increase the waiter's wage?", "group_id": 614, "id": 970683}, {"user_id": 13999, "stars": [], "topic_id": 33088, "date_created": 1305447799.3383701, "message": "What puzzles me about tipping in the US is that it's not really tipping, it's more of them taking. On more than one occasion I will pay for my meal or taxi ride and they just keep the change. In the UK/AU you will ALWAYS get your change unless you tell them to keep it when you hand them your money. I think this needs to be addressed in the US as tips should only be given to those who treat you well, it is called a \"tip\" after all.", "group_id": 614, "id": 1058546}, {"user_id": 4156, "stars": [], "topic_id": 33088, "date_created": 1305478040.570245, "message": "@awfy I live here (and have lived in multiple parts of the country) and I've never had anybody keep the change without me telling them \"keep the change\". *shrug*", "group_id": 614, "id": 1060830}, {"user_id": 20138, "stars": [], "topic_id": 33088, "date_created": 1306777647.6059151, "message": "Dont tip. Its not required by law.", "group_id": 614, "id": 1229430}, {"user_id": 8, "stars": [{"date_created": 1306830151.093539, "user_id": 1736}], "topic_id": 33088, "date_created": 1306781470.910234, "message": "Don't be a dick. It's also not required by law.", "group_id": 614, "id": 1229952}, {"user_id": 7056, "stars": [], "topic_id": 33088, "date_created": 1308910019.8169611, "message": "@coderanger true", "group_id": 614, "id": 1475516}, {"user_id": 12709, "stars": [], "topic_id": 33088, "date_created": 1309305888.2335999, "message": "I've been over here in SF for a few weeks now. It kind of takes a bit of getting used to, but once you do, it's almost normal. That's not to say that life wouldn't be easier if everything was factored in to the bill though.\nThe other thing is, I have no idea what you should tip for & what you shouldn't.\nSo far, I understand you tip for bars / restaurants & taxis, and that you don't tip for fast food places as they're not providing a service as such. But I'm totally confused with things like haircuts, etc? do you tip, do you not tip?\nThere totally needs to be a rule system spelt out for foreigners ;p", "group_id": 614, "id": 1513003}, {"user_id": 4156, "stars": [], "topic_id": 33088, "date_created": 1309731723.0244939, "message": "Delivery guys also get tips, and that also fits: they probably spent at least a few minutes driving/bicycling from the last customer to my place.", "group_id": 614, "id": 1554620}, {"user_id": 4156, "stars": [], "topic_id": 33088, "date_created": 1309731681.2316899, "message": "Haircuts == tip. My rule is basically \"if an individual spent more than a few minutes attending to me specifically, they get a tip\". Thus, taxi drivers, waitstaff (incl bartenders), barbers, all get tips, but fast food/takeout/other cashier type positions usually don't.", "group_id": 614, "id": 1554615}, {"user_id": 4156, "stars": [], "topic_id": 33088, "date_created": 1309731829.1706491, "message": "Also: I routinely empty my pockets of spare change [or just the change from the transaction] into tip jars, so even the \"no tip\" positions often do get some of my hard earned cash, just not multiple dollars' worth of tips like the others.", "group_id": 614, "id": 1554628}]