[{"user_id": 35323, "stars": [], "topic_id": 38616, "date_created": 1307540629.9149139, "message": "Aladdin is definitely my all time favourite cartoon movie. Recently I started to think about it in Dramatica terms and it's much harder than I expected - surprisingly complex for a cartoon. \nMy plan is to start with the four Throughlines, four MC and story questions - just like in the Terminator thread. \nIs anyone in? :)", "group_id": 2515, "id": 1337212}, {"user_id": 7664, "stars": [], "topic_id": 38616, "date_created": 1307554313.222065, "message": "I don't know the movie well enough, sorry.", "group_id": 2515, "id": 1339531}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1307647941.6321361, "message": "id be up for this, i love Aladdin but haven't seen it in awhile. will rewatch early next week.", "group_id": 2515, "id": 1352883}, {"user_id": 35323, "stars": [], "topic_id": 38616, "date_created": 1307652630.4644849, "message": "@krantz: I also plan to rewatch it. I guess there's no point doing it alone so I guess I'll wait for you to join, krantz - or anybody who's willing to contribute.", "group_id": 2515, "id": 1353625}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308102181.1968541, "message": "OK finally got some time freed up, going to watch tomorrow and then will be ready to rock", "group_id": 2515, "id": 1396704}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308244944.350801, "message": "1st thought: Aladdin still rules.", "group_id": 2515, "id": 1412142}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308246389.4659281, "message": "MC = Aladdin, IC = Genie. Beyond that the only things I am super confident in right now: MC Resolve=change, MC Judgment=good, MC approach=Doer MC problem-solving = logical. I think... the OS goal = Aladdin marrying Princess Jasmine. And I think the OST = Activity (searching for the lamp, courting the princess, stopping Jafar), MCT = Situation (Aladdin thinks he needs to be a prince to win her heart), SS = Manipulation (Genie needs Aladdin to set him free, Aladdin thinks he needs Genie to win the princess), ICT = Fixed Attitude (Genie helps show Aladdin he needs to stop pretending he's someone he's not)", "group_id": 2515, "id": 1412260}, {"user_id": 7712, "stars": [], "topic_id": 38616, "date_created": 1308250678.4144521, "message": "I've looked on Netflix for the movie... what year? The dvd's  (for the various years) are not available on Netflix yet, but this is one I'm interested in watching and discussing.", "group_id": 2515, "id": 1412732}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308251937.0139811, "message": "1992", "group_id": 2515, "id": 1412911}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308260373.634011, "message": "@krantz, those sound good, though I wonder if Jasmine might be a better IC.", "group_id": 2515, "id": 1413953}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308513123.789922, "message": "i keep thinking about the throughlines and while i'm pretty sure my original thoughts are correct, i wonder why exactly the OST isn't Situation and the MCT isn't Activity (this would make SS = Fixed Attitude and ICT = Manipulation). Reason being that re: the OST, all the characters seem to be constantly concerned with their situation (Aladdin is unhappy being a street rat, Jasmine is unhappy being trapped inside the palace and forced to marry, Jafar isn't happy being vizier and wants the lamp). I'm sure this just stems from me not understanding the nuances of the 4 classes yet but i'm curious what others think. Novbert where you at!!!", "group_id": 2515, "id": 1433047}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308512694.888051, "message": "i don't think Jasmine is the IC, they don't really differ on POV and it doesn't seem to me like her role in the story really pressures Aladdin to change his or her beliefs -- whereas Genie definitely does do this. also, in the final minutes when Jasmine chooses Aladdin he says \"call me Al\" -- Genie's nickname for him", "group_id": 2515, "id": 1433021}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308516209.0497789, "message": "There is a specific scene I'm thinking of, where Aladdin and Jasmine are sitting next to each other, both speaking about their own problems and they both come to the conclusion that they feel \"trapped\" -- saying it at the same exact time. It always struck me as a \"You and I\" moment sometimes present in MC/IC interactions. I would think the Genie would be a strong candidate for Guardian in the OS.", "group_id": 2515, "id": 1433228}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308516338.4489391, "message": "Re: domains, I think you were right originally. Thinking back to that scene again they're both trapped, or \"stuck\", which is usually a good indicator of Situation and Fixed Attitude.", "group_id": 2515, "id": 1433238}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308516396.6426959, "message": "As far as Aladdin and Jasmine not differing on POV, it's not so much that they don't see eye to eye but rather that the problematic perspective offered by the IC challenges the MC to see their own justifications in a different light.", "group_id": 2515, "id": 1433239}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308669542.8719809, "message": "Hmm. But isn't part of being the IC being the character who is figuratively shouting at the MC \"change course, your approach is wrong!\"? Genie is periodically encouraging/imploring Aladdin to be himself. I think part of that is because he's the archetypal Guardian in the OS, but it's also because they're involved in the Manipulation story (Genie needs Aladdin to be himself because Aladdin is the only one who would ever set him free, Aladdin needs to stop pretending he's someone else in order to win Jasmine's heart)", "group_id": 2515, "id": 1449289}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308669760.7913809, "message": "now this has me curious what the throughlines would look like if Jasmine were the IC...", "group_id": 2515, "id": 1449327}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308674701.6724861, "message": "The IC could be shouting at the MC, but sometimes it's just enough that the MC recognizes some part of themselves in the other person.", "group_id": 2515, "id": 1449855}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308674688.5646579, "message": "There could be a hand-off that occurs between the two, but it would seem to me that the heart of the story lies within the relationship between Jasmine and Aladdin (magic carpet ride and so on). I'm working completely off of memory, so I could be wrong. I used to watch it practically daily when I was a student - Eric Goldberg's animation of the genie is a tour de force -- but that was a long long time ago!", "group_id": 2515, "id": 1449854}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308925137.104943, "message": "sigh... made a case for why Jasmine isn't the IC and Genie is a much better choice but don't have it in me to rewrite now... anyhow -- I was also curious about the M/I issue and MC Problem. For the M/I issue the choices are Rationalization, Commitment, Responsibility, Obligation. I'd choose Commitment (Aladdin is committed to being a prince, and it's the realization that this commitment must be broken that constitutes his change and leads to Genie's freedom). The MC Problem = pursuit?", "group_id": 2515, "id": 1476644}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308924774.664736, "message": "w3iuyr2quihq2u i just wrote a ton of posts and they disappeared! :(", "group_id": 2515, "id": 1476587}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308925323.8410289, "message": "cliffs: Jasmine/Aladdin's story is about Aladdin's dogged pursuit of Jasmine (incorrectly, until his relationship w Genie forces him to change). Their bond stems from them seeing themselves inside each other. The whole movie is about how it's not what's on the outside, but what is inside that counts (this is symbolized in so many ways: the lamp, Aladdin, Jafar, Jasmine, Cave of Wonders, etc). The story also places great value on being free to make your own choices.", "group_id": 2515, "id": 1476657}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308925478.094512, "message": "Through the whole story, Aladdin is always looking at things on a surface level. What he sees always = what is true. It's only when he first acquires the lamp and realizes there is an all powerful being living INSIDE a boring old lamp that he starts to realize he may be wrong.", "group_id": 2515, "id": 1476668}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308933038.493515, "message": "Sry about that - Convore is in Beta and it seems like they've been having some trouble over the past 24 hours. In the meantime, copy and paste is your friend!", "group_id": 2515, "id": 1477660}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308933172.2522819, "message": "it would be great if you could muster up the energy to restate your argument about why Jasmine is not the IC. I would be interested in reading what you have to say. If the story places great value on being free to make your own choices, doesn't Jasmine represent an alternative approach to dealing with that issue?", "group_id": 2515, "id": 1477678}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308942906.639596, "message": "Aladdin/Genie's relationship drives the whole story. It's there even before the actual story starts, when an Arabian merchant shows us the lamp, states the theme and prepares us for the story of “a young man, like this lamp, that was more than what he seemed... a diamond in the rough.”", "group_id": 2515, "id": 1479127}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308943531.4224041, "message": "more re: Jasmine's story feeling like the heart... I think \"A Whole New World\" kills it (in a good way, pwnage, home run). It helps us see the happy ending possibility and makes us REALLY want Aladdin to lay the smack down on Jafar", "group_id": 2515, "id": 1479244}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308942611.1228349, "message": "I wouldn't say Jasmine represents an alternative approach... her function is more in helping to reinforce Genie's argument (as audience we see what she wants and know Genie is right... but in-story Aladdin just continually fails to realize this). It's only through his/Genie's story that he's able to make key realizations and the final choice to set Genie free that the story can end, imo.", "group_id": 2515, "id": 1479076}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308942770.1311131, "message": "I think the reason Aladdin/Jasmine's story feels like the heart is that their being together is the OS goal. It's reinforced all the time, when they're not together, even the timelock is related to it.", "group_id": 2515, "id": 1479104}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308942996.3655961, "message": "When Aladdin first thinks about what to wish for, he asks Genie what he would wish for. “Freedom. Greater than all the magic, all the treasure...” Genie explains the only way he can ever have that is if his master wishes it so. Aladdin immediately says “I’ll do it.” The solution to his problem is here -- it’s only in the end when Aladdin defeats Jafar as Aladdin and not Ali, and chooses to set Genie free (he tells Jasmine “I love you... but I gotta stop pretending I’m someone I’m not) that the story is over. Aladdin is at peace with himself, and as a result of his heroics the Sultan amends the law and he is able to marry Princess Jasmine.", "group_id": 2515, "id": 1479142}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308943100.358393, "message": "also -- Aladdin repeatedly questions himself because of the Genie. He argues with the Genie over what Jasmine wants: Genie tells him to be himself, Aladdin says “No way!” and continues to act like Prince Ali. After Aladdin reveals Jafar’s deception the Sultan tells him “You will be Sultan! Exactly what this kingdom needs! A man of unimpeachable moral character” and Aladdin realizes that's true about the outside but not the inside. This leads into a scene between Aladdin and Genie where Genie congratulates him and Aladdin exclaims “I’m sorry Genie. I can’t. They wanna make Prince Ali Sultan!... the only reason they want me is because of you!” Immediately after he tells Genie this he starts to feel bad and finally says “Genie is right. I gotta tell them the truth.”", "group_id": 2515, "id": 1479159}, {"user_id": 7645, "stars": [], "topic_id": 38616, "date_created": 1308960556.5465009, "message": "ok, well put. I'm gonna have to watch it again, I don't remember the timelock at all.", "group_id": 2515, "id": 1481615}, {"user_id": 35369, "stars": [], "topic_id": 38616, "date_created": 1308963297.703975, "message": "the timelock = in a few days (i think it's 3), according to the law, Jasmine will have to choose a suitor", "group_id": 2515, "id": 1481872}]