[{"user_id": 24590, "stars": [], "topic_id": 35858, "date_created": 1305749409.4189279, "message": "what do you say to people who accost you with information on how there's no way to survive without animal protein? I guess this is slightly more of a rant than question, it is just annoying. I think that line from Skinny Bitch sums it up, \"no one has ever died from protein deficiency!\" it's not as though their concerns are coming from a heartfelt place, it seems like they  are really angry that I don't eat meat. I can't be alone here, how do you all deal?", "group_id": 7210, "id": 1102591}, {"user_id": 24568, "stars": [], "topic_id": 35858, "date_created": 1305772423.918267, "message": "I simply say \"It seems to be working for me.\"  Don't feel like you have to be the \"vegan\" spokesperson to every person you encounter.  For me, the longer I've gone veg (over 3 years now) the less people hassle me about it.  If someone is genuinely interested they will not begin the conversation in an attacking manner.", "group_id": 7210, "id": 1106441}, {"user_id": 22946, "stars": [], "topic_id": 35858, "date_created": 1306170454.6624551, "message": "when I want to be snarky, any someone asks me where I get my protein I ask them where they get my fiber... but when i'm trying to be more agreeable, I point out on how their are entire cultures of people who eat little to no meat at all, and that those cultures have people who live the longest and are the most healthful without the disease we have in America.", "group_id": 7210, "id": 1154648}, {"user_id": 22946, "stars": [], "topic_id": 35858, "date_created": 1306170531.3922861, "message": "where they get their* fiber :)", "group_id": 7210, "id": 1154655}, {"user_id": 42626, "stars": [], "topic_id": 35858, "date_created": 1319682086.8512199, "message": "I find when I get accosted by people like that, they are actually fishing for information because they feel conflicted about their own diet choices. This is not always the case, let's face it - the world is full of jerks - but I usually respond to \"Where do you get your protein?\" with \" Lots of places! Were you wondering about something more specific?\" Also, do NOT underestimate the power of vegan food at an office potluck! I was able to convert a co-worker to meatless mondays through the power of vegan cupcakes and soy chorizo. If people can see that vegan food looks like normal food (surprise!) they tend to not be so scared about something that is different and are more curious. I get compliments on how my lunches look so much more exciting and tastier than my co-workers' meat based lunches. Hang in there!", "group_id": 7210, "id": 2443443}]