[{"user_id": 30494, "stars": [], "topic_id": 44644, "date_created": 1314659232.9647141, "message": "I experience the same thing you describe on IE.", "group_id": 236, "id": 1997428}, {"user_id": 40406, "stars": [], "topic_id": 44644, "date_created": 1314658643.9059851, "message": "Here's the scoop - I am QA'ing a browser app and I cannot get it to work in Internet Explorer. I was hoping someone here could shed some light on this for me.\nHere's what I have - 1) The app installs into Windows as a program, which seems to be what it should do. 2) The app shows up as a 'listed add-on' in Internet Explorer's add-ons 3) The app does not trigger / fire, when navigating through web pages as expected. (BTW the app works fine on Chrome.) 4) Through inspecting webpage elements, I do not see any evidence that the app is even loading in the background on any webpages, and definitely not popping up as expected. 5) On Internet Explorer 9, when I look at the details of the add-ons installed, it tells me that this browser app loads / is loaded (usually around 1.5 - 2.5 seconds, but I do not see any evidence of this happening). 6) Tested on Internet Explorer 6 , 7 and 9.\n\nDoes anyone have any ideas on how to troubleshoot what is happening with the app? Or steps I can take to troubleshoot this further to help point the developer of the app in the right direction as to why it is not working?", "group_id": 236, "id": 1997384}, {"user_id": 31361, "stars": [], "topic_id": 44644, "date_created": 1314841864.055057, "message": "Kynetx dudes, any hope for this? Us FOKers need this.", "group_id": 236, "id": 2016638}, {"user_id": 763, "stars": [], "topic_id": 44644, "date_created": 1314979926.0270891, "message": "If tags are being planted, but the app is not firing, create a hello world rule using a simple notify to verify that basic rules are running.", "group_id": 236, "id": 2029979}, {"user_id": 763, "stars": [], "topic_id": 44644, "date_created": 1314979807.76542, "message": "The IE factory BX works by planting script tags into the DOM of the page. Be careful to inspect the page, not view source. If the tags are not being planted, then there is a problem with the BX: Note that * domains in the dispatch will not work in IE, so you must specify the domain you wish to fire on.", "group_id": 236, "id": 2029967}, {"user_id": 763, "stars": [], "topic_id": 44644, "date_created": 1314979953.8365929, "message": "Now that I think about it, the most likely cause of your IE problems is using a * domain in your dispatch block. Check that first.", "group_id": 236, "id": 2029984}, {"user_id": 30494, "stars": [], "topic_id": 44644, "date_created": 1315062799.1721079, "message": "is there a workaround to get \"*\" working ?", "group_id": 236, "id": 2037196}, {"user_id": 30494, "stars": [], "topic_id": 44644, "date_created": 1315062760.15398, "message": "specifying a domain in dispatch solved the problem for me", "group_id": 236, "id": 2037191}, {"user_id": 37659, "stars": [], "topic_id": 44644, "date_created": 1315316279.7106669, "message": "so, for the moment, Kynetx IE extensions do not support dispatching a ruleset on all domains, right?", "group_id": 236, "id": 2059237}, {"user_id": 763, "stars": [], "topic_id": 44644, "date_created": 1315348055.2186329, "message": "@davidbjames Correct. You must list the domains you want to fire on.", "group_id": 236, "id": 2062601}, {"user_id": 763, "stars": [], "topic_id": 44644, "date_created": 1315348069.1901619, "message": "@loic There isn't a workaround, unless you want to modify the extension.", "group_id": 236, "id": 2062604}, {"user_id": 31361, "stars": [], "topic_id": 44644, "date_created": 1316686336.2613249, "message": "I have a simple hello world app (notify Hello World when the domain is hit). However, the rule only fires when coming from a different domain to the specified domain. If you refresh the page, the ruleset doesn't fire. Odd! I remember this working.", "group_id": 236, "id": 2187870}]