[{"user_id": 3952, "stars": [], "topic_id": 10095, "date_created": 1299075225.3472421, "message": "So I know that it's been a few weeks now that Convore has been released and I'm curious to know what some of the numbers are (as far as traffic is concerned)? Also, I see that the Python community, or a subsection of it, has really embraced Convore, but not as many in other languages (Ruby, JavaScript, etc). Do you think that's because Convore was built in Django? Thoughts anyone?", "group_id": 95, "id": 247047}, {"user_id": 14674, "stars": [], "topic_id": 10095, "date_created": 1299079800.2959509, "message": "http://media.eflorenzano.com/dropbox/twitarmy.png @ericflo posted this in the TWiT group", "group_id": 95, "id": 247795}, {"user_id": 1116, "stars": [], "topic_id": 10095, "date_created": 1299079470.1271441, "message": "Because it was written in Django may be a part. It also might be that they aren't aware of convore and haven't tried it.", "group_id": 95, "id": 247725}, {"user_id": 15929, "stars": [], "topic_id": 10095, "date_created": 1299085512.0159919, "message": "it's chicken and egg thing right? or rome wasn't built overnight? either way, i bet even stackoverflow had to start somewhere...", "group_id": 95, "id": 248820}, {"user_id": 3409, "stars": [{"date_created": 1299177284.8991361, "user_id": 4375}], "topic_id": 10095, "date_created": 1299137602.1579909, "message": "@unwrangle Actually, StackOverflow started with two major bloggers blogging about it, giving it huge amounts of traffic right from the start.", "group_id": 95, "id": 258824}, {"user_id": 15929, "stars": [], "topic_id": 10095, "date_created": 1299147136.3905971, "message": "@edanm regardless, OP should give convore some time for other communities to join the convorsation ;)", "group_id": 95, "id": 259374}, {"user_id": 18426, "stars": [{"date_created": 1299180002.064306, "user_id": 6004}], "topic_id": 10095, "date_created": 1299176026.116081, "message": "Is it really about the traffic or the quality of it?", "group_id": 95, "id": 261926}, {"user_id": 3952, "stars": [], "topic_id": 10095, "date_created": 1299203097.683465, "message": "@kingsidharth I agree it's all about quality. But in order to have (total) quality, you have to have representatives from different viewpoints. Surrounding the community with \"yes\" men isn't the way to go... for example, I <3 Python, but I also <3 Ruby, JavaScript, etc. It's just kind of repetitive listening to people say the same thing over and over again.", "group_id": 95, "id": 265565}]