[{"user_id": 2694, "stars": [], "topic_id": 20194, "date_created": 1303159329.4598091, "message": "I was a big fan of Mike Montiero's \"F*ck You, Pay Me\" from Creative Mornings SF. He and his lawyer said some things every design professional should know by heart. http://vimeo.com/22053820", "group_id": 629, "id": 730842}, {"user_id": 6718, "stars": [], "topic_id": 20194, "date_created": 1303183860.5439179, "message": "Definitely love Mike's message in the video. I mostly recommend anything by Dan Benjamin and 5by5. Actually getting away from uncle Leo's stuff just because I rarely find anything of value besides gossip", "group_id": 629, "id": 735899}, {"user_id": 26450, "stars": [], "topic_id": 20194, "date_created": 1303202608.318929, "message": "I enjoyed that video a lot too. I'd love to see more of the Creative Mornings SF talks (haven't looked for them yet). TED talks are usually very interesting and I also enjoy anything by 37signals (they have a podcast, but there's a lot of other good stuff on YouTube too). Lately I've also really been into the RSAnimate videos on YouTube - definitely worth checking out.", "group_id": 629, "id": 739230}, {"user_id": 1797, "stars": [], "topic_id": 20194, "date_created": 1303213941.8457551, "message": "I second 5by5, and the Big Web Show with Zeldman in particular. Dig through those archives... Also, http://boagworld.com is no longer an active show, but it was pretty good for several years. Their archive is worth looking into as well.", "group_id": 629, "id": 739906}, {"user_id": 2694, "stars": [], "topic_id": 20194, "date_created": 1303235686.8511119, "message": "Speaking of 5by5, gotta recommend Back To Work with Dan Benjamin and Merlin Mann. http://5by5.tv/b2w Multiple kicks in the ass weekly.", "group_id": 629, "id": 744467}, {"user_id": 2841, "stars": [], "topic_id": 20194, "date_created": 1304030909.0764551, "message": "I put in a request to the guys at 5by5 to give us a \"best of\" gallery of their videos. I want to watch everything after watching the first few shows. Mike_FTW has a regular show on there too from what he's tweeted. Hopefully they give us a list of \"most viewed\" or \"highest rated\" soon so we can cut to the best stuff first.", "group_id": 629, "id": 848093}]