[{"user_id": 20744, "stars": [], "topic_id": 41921, "date_created": 1310642232.9572489, "message": "Very grateful this Quora topic exists: http://www.quora.com/Tech-Startups/Which-UK-bank-should-I-use-to-set-up-our-first-business-current-account\n\n... But still leaves me with a lot of questions. The problem I've had in the past with HSBC is their statements don't go back to Day 1, their website is slow and unwebby, and iirc older statements were provided as PDFs.\n\nWhat's nasty is there's really no way to find out before you take the plunge.", "group_id": 10793, "id": 1636206}, {"user_id": 38058, "stars": [], "topic_id": 41921, "date_created": 1310648451.157232, "message": "Posted my longer answer to the Quora topic, but Cater Allen were pretty good for me (no fees, interest on in-credit balances - in fact the interest used to cover my accountant's fees)", "group_id": 10793, "id": 1636679}, {"user_id": 20744, "stars": [], "topic_id": 41921, "date_created": 1310657816.790628, "message": "Thanks Tim. What was the online experience like?", "group_id": 10793, "id": 1637853}, {"user_id": 38058, "stars": [], "topic_id": 41921, "date_created": 1310663274.6798761, "message": "It was a few years ago and to be honest I rarely bothered (only a few transactions a month), my accountant was a specialist for IT service co's tho and recommended them as that way they could pull all the bank figures together I seem to recall.Santander gets pretty poor reviews on service, but Cater Allen is sort of their private banking arm,", "group_id": 10793, "id": 1638579}, {"user_id": 38863, "stars": [], "topic_id": 41921, "date_created": 1311847636.075815, "message": "In fact, we should redesign HSBC's online business banking experience.. I want exported data, gRaphael visuals, mobile app, the lot!", "group_id": 10793, "id": 1737833}, {"user_id": 38863, "stars": [], "topic_id": 41921, "date_created": 1311847448.736362, "message": "I'm with HSBC, but  I hear you - their online business banking experience takes me back to 1999!", "group_id": 10793, "id": 1737816}, {"user_id": 20744, "stars": [], "topic_id": 41921, "date_created": 1312179626.56568, "message": "GreaseMonkey would be one way to do it, pretty neat for tweaking legacy UIs", "group_id": 10793, "id": 1763512}]