[{"user_id": 5091, "stars": [], "topic_id": 38092, "date_created": 1307201818.2366221, "message": "http://sein-cal.co.cc/ \n\nThis is our first web application. It is a no-frills implementation of the Seinfeld Calendar, and aids in improving productivity by helping form habits.\n\nWe (two of us) started with it 5 days ago. With a bit of Python background, we decided to go at it with Django. The process was in itself a learning experience with remote collaboration, learning and using git to manage the code, and using App Engine with Django. All for the first time.\n\nFeedback welcome.", "group_id": 81, "id": 1286704}, {"user_id": 15940, "stars": [], "topic_id": 38092, "date_created": 1307266934.224226, "message": "looks like nice bro", "group_id": 81, "id": 1292414}, {"user_id": 35281, "stars": [], "topic_id": 38092, "date_created": 1307315486.2705691, "message": "very well done in 5 days, impressive !!!", "group_id": 81, "id": 1297378}, {"user_id": 11663, "stars": [], "topic_id": 38092, "date_created": 1307486547.50526, "message": "well done. you managed to make the entire year fit nicely into a single page. some ideas... since the map is branded as seinfeld's cal, i'd ditch the harry potter hogwart's map reference and make the green button say something like: \"I completed my task today.\" or \"I completed my task today woohoo!\" you don't really need the other button because if you didn't finish the task that day, you just don't check it off. again, to stick with the seinfeld theme, a red x icon would be better for the days where the task was completed and then just leaving the square blank for days missed. oh, and you could have a big counter at the top with days completed and days missed from the creation of the cal to the current date. hope that's helpful :)", "group_id": 81, "id": 1329680}, {"user_id": 11663, "stars": [], "topic_id": 38092, "date_created": 1307486603.5972941, "message": "btw, did you use django-nonrel?", "group_id": 81, "id": 1329701}, {"user_id": 1127, "stars": [], "topic_id": 38092, "date_created": 1307490745.638273, "message": "@bryanlanders can you even use that on appengine?", "group_id": 81, "id": 1330907}, {"user_id": 4976, "stars": [], "topic_id": 38092, "date_created": 1307513759.2582021, "message": "Hello, I'm the co-dev on this app.\n@bryanlanders We used django-nonrel. Seemed to be the best bet for running Django on App Engine.\nAs for the two buttons on that popup, the other one's something of a 'Cancel' button that you can click on if you're just trying the app out, the idea being that a person shouldn't be able to 'reset' a particular day once it's been clicked. So it's also something of a reminder for you to be sure before you click 'yes' for a particular day. How does that sound?", "group_id": 81, "id": 1334356}, {"user_id": 11663, "stars": [], "topic_id": 38092, "date_created": 1307557298.790735, "message": "@zeeg yup: http://code.google.com/appengine/articles/django-nonrel.html. i've been messing with that as a way to not lock apps into the GAE datastore and be easily portable. it's all a bit awkward though since you have to have the modified django version as well as a number of dependencies in your GAE app files, but it does work.\n\n@vdugar what you described here sounds good... you could have the buttons reflect that...for instance, maybe there's only one button that at first says, \"i have completed my task today\" and then changes to, \"i didn't complete my task today\" (like the way follow/unfollow and like/unlike buttons work).\n\nyou know, thinking about it a moment longer, i just realized you could even make this simpler by ditching the buttons and popup altogether and just having a red x toggle show/hide on the square when clicked! that might better simulate the real world experience (and joy) of using a marker to x out a day on a paper calendar, right?", "group_id": 81, "id": 1340060}]