[{"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1305792356.56583, "message": "Also ich  habe HTML CSS JS PHP SQL mit Zertifikat erlernt und wollte fragen ob hier wer ein Projekt hat oder eins starten will damit ich von jemand anderem neues lernen kann. =) Ich bin da relativ offen worum das Projekt handelt.   MFG LocXar", "group_id": 3315, "id": 1109344}, {"user_id": 13568, "stars": [], "topic_id": 35921, "date_created": 1305960185.9754889, "message": "Hallo, ich will tatsächlich ein Projekt starten. Ich weiß jedoch nicht, ob ich dir etwas beibringen kann, denn ich bin auch noch nicht so lange dabei. Aber wir könnten je beide voneinander lernen und mit dem Projekt wachsen, wenn du Interesse hast. Gruß", "group_id": 3315, "id": 1132960}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306105050.5172701, "message": "Gerne was hast du den bist jetzt im kopf als projekt und was kannst du bis jetzt ?", "group_id": 3315, "id": 1145114}, {"user_id": 31957, "stars": [], "topic_id": 35921, "date_created": 1306178131.6256199, "message": "An Ideen ist kein Mangel. Bin Entwickler aus Hamburg und plane gerade etwas. Wäre interessant von euch zu hören.", "group_id": 3315, "id": 1155974}, {"user_id": 13568, "stars": [], "topic_id": 35921, "date_created": 1306209226.1644421, "message": "@LocXar Ich habe mehrere Ideen, so z. B. ein Statistiktool mit Daten, die über eine API eines anderen Services abgefragt werden. Oder eine Enzyklopädie eines bestimmten Themengebietes mit angeschlossenem Forum.", "group_id": 3315, "id": 1161387}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306223193.0761001, "message": "@j7d6 dann erzähl mal grob was du für ideen hast. MfG Patrick", "group_id": 3315, "id": 1163117}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306223112.581269, "message": "@marco_simon statistiktool welcher art? also wozu wird es verwendet? und Welches themen gebiet würde dir den wegen der Enzyklopädie vorschweben?", "group_id": 3315, "id": 1163108}, {"user_id": 13568, "stars": [], "topic_id": 35921, "date_created": 1306268092.6176791, "message": "@LocXar Es sollen diverse Statistiken für Last.fm-User über ihre Musikgewohnheiten, Vergleichenmit ihren Freunden (bei last.fm) usw. sein. Und die Enzyklopädie (mir ist kein passenderer Begriff eingefallen) hat als Thema Autos – mir schwebt da eine umfassende Sammlung aller Hersteller und Modelle, sagen wir der letzten 40 Jahre, vor, mit technischen Daten, Bildern, kuriosen Fakten etc. Natürlich ist das eine große, sehr langwierge Sache, aber ich habe bisher noch nichts in der Richtung gefunden.", "group_id": 3315, "id": 1170149}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306401931.8554261, "message": "mh also die auto enzyklopädie hört sich recht einfach an.", "group_id": 3315, "id": 1190392}, {"user_id": 13568, "stars": [], "topic_id": 35921, "date_created": 1306567275.756336, "message": "@LocXar Entschuldige die späte Antwort, ich hatte extrem viel zu tun die vergangenen Tage. Ich weiß nicht, ob es einfach wird. Da gibt es schon eine Menge Dinge, über die man sich vorher Gedanken machen muss, um dann z.B. ein sinnvolles, skalierbares Datenbankdesign zu schaffen. Die ganze Enzyklopädie soll ja sowohl detailliert und umfrangreich als auch intuitiv benutzbar sein. Auch an Mehrsprachigkeit habe ich gedacht usw. Wenn also jemand Interesse hat, daran mitzuwirken, ist er/sie jedenfalls herzlich Willkommen. Um das Statistiktool mache ich mir viel weniger Sorgen, das könnte ich auch alleine stemmen, wenn ich nur mal anfangen würde. Aber mit mehreren Leuten machen solche Projekte grundsätzlich einfach mehr Spaß ...", "group_id": 3315, "id": 1211595}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306738775.6688149, "message": "also bei der enzyklopädie wäre ich gerne dabei ^^", "group_id": 3315, "id": 1224886}, {"user_id": 13568, "stars": [], "topic_id": 35921, "date_created": 1306777850.6524911, "message": "@LocXar Hey, das hört sich doch gut an :) Ich stelle mal meine bisherigen Ideen schriftlich zusammen und melde mich in den nächsten Tagen bei dir. Gruß – Marco", "group_id": 3315, "id": 1229468}, {"user_id": 30098, "stars": [], "topic_id": 35921, "date_created": 1306911449.6789041, "message": "@marco_simon ok =)", "group_id": 3315, "id": 1250762}]