[{"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299274367.461216, "message": "I am also looking for projects which have a fork that supports Python 3. Projects that have Python 3 support in version control but just have not done a release yet are also useful to know about.", "group_id": 292, "id": 273023}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299274329.8060551, "message": "If you look at http://pypi.python.org/pypi?:action=browse&c=533&show=all you will see a list of projects known to support Python 3 on PyPI. Problem is that the list relies on the trove classifier for Python 3 being set which some projects (e.g., docutils) have not set for whatever reason. Help me find projects that made this mistake by checking against http://py3ksupport.appspot.com/ (e.g., http://py3ksupport.appspot.com/pypi/docutils states that docutils supports Python 3).", "group_id": 292, "id": 273011}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299274414.886378, "message": "I have already done the obvious ones that I know of, but I am sure I am missing some. Critical ones that are those shown on the front page of http://py3ksupport.appspot.com/", "group_id": 292, "id": 273048}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299275654.8261499, "message": "@briancurtin is it complete support, or just getting there?", "group_id": 292, "id": 273290}, {"user_id": 1289, "stars": [], "topic_id": 10897, "date_created": 1299274870.561003, "message": "matplotlib has a py3k branch and the Cape Town Python Users group are sprinting tomorrow to continue that port", "group_id": 292, "id": 273198}, {"user_id": 1289, "stars": [], "topic_id": 10897, "date_created": 1299274828.279289, "message": "I had a feeling this was what your secret project would be. Will definitely keep an eye on this.", "group_id": 292, "id": 273169}, {"user_id": 1289, "stars": [], "topic_id": 10897, "date_created": 1299275855.139565, "message": "@brettcannon - not sure what the true status is (running or not). i'll ask the CTPUG guys after the weekend where it's at", "group_id": 292, "id": 273320}, {"user_id": 2863, "stars": [{"date_created": 1299283206.297049, "user_id": 1289}], "topic_id": 10897, "date_created": 1299277424.778625, "message": "Blog post on the website, what I am trying to accomplish, etc.: http://sayspy.blogspot.com/2011/03/secret-site-goes-live-python-3-support.html", "group_id": 292, "id": 273452}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299285661.2634821, "message": "Setuptools-git is basically wrapping a subprocess call, and so AFAICT only three print statements need to have parentheses added in order for it to work with Python 3. I have emailed Yannick Gingras, maintainer of setuptools-git, suggesting that he add the parens and post an update to PyPI. As setuptools-git is at #35 on the list by largest no. of downloads, it seems like very low hanging fruit.", "group_id": 292, "id": 274243}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299285349.0184939, "message": "Brett, I am working on forks of pip, virtualenv and virtualenvwrapper. Unlike other forks, I am aiming to have a single codebase for Python 2.x and 3.x - otherwise, too much effort will be expended in maintaining two codebases and periodically synchronising them. I have looked at virtualenv3 (Brandon Rhodes' fork) and virtualenv5 (Holger Krekel's fork) but as far as I can tell my fork is the most up to date, working with both Python 3.2 and py3k trunk. My summary of the current status is on this post: http://groups.google.com/group/python-virtualenv/msg/99b983d2dbc89bb8 and pip tests mostly run successfully (11 failures out of 101, but then pip trunk is failing 4 tests, and a few of the failing tests in my fork are down to setuptools_git not having a Python 3 compatible version on PyPI.", "group_id": 292, "id": 274206}, {"user_id": 15977, "stars": [], "topic_id": 10897, "date_created": 1299342672.997479, "message": "configobj has a port to python 3 on bitbucket", "group_id": 292, "id": 276653}, {"user_id": 15977, "stars": [], "topic_id": 10897, "date_created": 1299342720.490871, "message": "@brettcannon https://bitbucket.org/zubin71/configobj-py3/overview", "group_id": 292, "id": 276657}, {"user_id": 19380, "stars": [], "topic_id": 10897, "date_created": 1299523962.191036, "message": "I don't think it is accurate to say virtualenv supports Python 3. virtualenv5 is more of a hack, and I've had a few problems using it (we build packages in PyPI for 2.6 thru 3.2). virtualenv needs to *officially* support Python 3.", "group_id": 292, "id": 289670}, {"user_id": 19380, "stars": [], "topic_id": 10897, "date_created": 1299523689.199337, "message": "FWIW, here is our (PyPM) list of overrides for py3k packages not marked so on PyPI: https://gist.github.com/858968", "group_id": 292, "id": 289634}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299538603.6431701, "message": "@vsajip let me know when the forks pass all their tests and I will mention them as appropriate", "group_id": 292, "id": 292264}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299538424.864825, "message": "@srid Thanks for the PyPM details; I will look at it when I have a chance. As for virtualenv5 vs. some official port, Ian Bicking is handing off maintenance of essentially all of his Python projects so who knows what the status of those will be for a while. But I had multiple people tell me independently they use virtualenv5 so I went ahead and listed it. Did you file a bug report for your issues? I have been told the dev is active.", "group_id": 292, "id": 292248}, {"user_id": 2863, "stars": [], "topic_id": 10897, "date_created": 1299538520.682075, "message": "@voidspace thanks; I updated configobj.", "group_id": 292, "id": 292258}, {"user_id": 15977, "stars": [], "topic_id": 10897, "date_created": 1299539000.6848719, "message": "@brettcannon ta :-)", "group_id": 292, "id": 292310}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299572811.9427209, "message": "@srid: I'd be grateful if you'd try the fork (and give feedback) at https://bitbucket.org/vinay.sajip/virtualenv - this has working support for Python including 3.2 and 3.3/trunk.", "group_id": 292, "id": 294932}, {"user_id": 214, "stars": [], "topic_id": 10897, "date_created": 1299594835.3361299, "message": "@vsajip I think simplejson was pretty much just a random package chosen for those tests, you can safely replace it with any other package and get those tests passing.", "group_id": 292, "id": 296330}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299595392.796268, "message": "@carljm: I'm sorry I can't be at PyCon! Have a good conference. I'll see about replacing simplejson in the tests.", "group_id": 292, "id": 296427}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299594409.8488469, "message": "@brettcannon I've done some more work on my pip and virtualenv forks, and now all relevant tests pass under both Python 3.2 and 3.3 (trunk). There are 98 tests run under Python 3.x, but 102 under Python 2.x. The missing tests are:\n\n1. \"Test installing current directory (.) into usersite using setuptools\". This test is specifically using setuptools rather than distribute, and since setuptools itself is not Python 3.x compatible there's no point running this test.\n\n2. \"Some tests of freeze, first we have to install some stuff.\" This is not implemented because it installs simplejson, which is not Python 3 compatible.\n3. \"Test installing from a requirements file.\" This is not implemented because it installs simplejson, which is not Python 3 compatible.\n4. \"Test installing from multiple nested requirements files.\" This is not implemented because it installs simplejson, which is not Python 3 compatible.\n\nNote that I had to make changes to distribute (to set up an entry point for 3.2, and to fix a shortcoming in setuptools-git, which is not quite Python-3 compatible yet, though it now installs cleanly) and I also ran a local PyPI-like mirror because some tests \"easy_install virtualenv\", which would otherwise fetch an incompatible version from PyPI. Some other minor changes to the tests_cache folder contents also had to be made. Nonetheless, I think this represents a fairly good test of pip under Python 3, and seems to compare favourably with pip's own CI tests at http://ci.cloudsilverlining.org/view/pip/ (though I've not searched to see which repository those tests check things out of).\n\nAll relevant forks are accessible via https://bitbucket.org/vinay.sajip/ and I will try to help anyone who wants to try and reproduce these results, which are at https://gist.github.com/852552", "group_id": 292, "id": 296283}, {"user_id": 214, "stars": [], "topic_id": 10897, "date_created": 1299594803.536834, "message": "@vsajip Thanks for working on this! Will you be at PyCon?", "group_id": 292, "id": 296326}, {"user_id": 3354, "stars": [], "topic_id": 10897, "date_created": 1299596871.4578731, "message": "When are virtualenv and virtualenvwrapper going to run properly on Windows? Or do they already, and I just can't install stuff?", "group_id": 292, "id": 296603}, {"user_id": 5701, "stars": [], "topic_id": 10897, "date_created": 1299598165.009496, "message": "One annoying thing about the \"Programming Language\" classifiers is the ambiguity about whether they indicate the implementation language of the project or the language the project can be used with.  The existence of things like \"Programming Language :: Cython\" suggests the classifiers are really for the implementation language.  On the other hand, people seem to strongly want to use them to learn what language the project can be used with.", "group_id": 292, "id": 296752}, {"user_id": 1289, "stars": [], "topic_id": 10897, "date_created": 1299597577.0125949, "message": "350 Python 3 projects on PyPI now - http://dev.pocoo.org/~gbrandl/py3.html -- I wonder what the number would be if every project was properly classified.", "group_id": 292, "id": 296724}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299598090.137996, "message": "@holdenweb: I'm not sure what problems you're having with virtualenv on Windows. have you posted any issues? Re virtualenvwrapper - it's Linux/Unix-specific, for Windows I would suggest using Powershell and the port to it of virtualenvwrapper, which lives at https://bitbucket.org/guillermooo/virtualenvwrapper/", "group_id": 292, "id": 296747}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299632484.0028341, "message": "@carljm I see from Brett's comment above that Ian Bicking is handing off maintenance of his Python projects - do you know who will be looking after maintenance of pip / virtualenv?", "group_id": 292, "id": 300834}, {"user_id": 18858, "stars": [{"date_created": 1299635505.635375, "user_id": 9229}], "topic_id": 10897, "date_created": 1299632228.632257, "message": "@brettcannon @carljm Now pip/virtualenv forks pass all 100 tests (2 skipped - nos. 1 and 2 above) on Python 3.2 and 3.3 - I've updated the gist with the latest results. Tests have been run only on Ubuntu so far.", "group_id": 292, "id": 300815}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299632358.004647, "message": "@carljm Test #2 is still skipped because it uses a recent version of INITools which gives syntax errors with Python 3.2. In other tests I replaced simplejson with anyjson. Not sure what to replace INITools with - I'll leave that till later.", "group_id": 292, "id": 300824}, {"user_id": 214, "stars": [], "topic_id": 10897, "date_created": 1299634110.7642391, "message": "@vsajip Yes. It will be myself, Jannis Leidel, and Brian Rosner. (And INITools is also just \"any old package,\" it can be replaced as well as long as the sense of the test is maintained).", "group_id": 292, "id": 300916}, {"user_id": 9229, "stars": [], "topic_id": 10897, "date_created": 1299635492.3391089, "message": "hey @brettcannon I'd love to see a version of your list with all the zope/plone stuff omitted, since there's tons of those packages and apart from zc.buildout and zope.interface none of them are really used outside of Zope/Plone...", "group_id": 292, "id": 300979}, {"user_id": 3354, "stars": [], "topic_id": 10897, "date_created": 1299652462.734458, "message": "@vsajip Thinking about it, the issue I had was indeed with virtualenvwrapper on Windows, thanks. Not an issue now I am a Mac user ;-)", "group_id": 292, "id": 302325}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299658819.5881341, "message": "@carljm: Re replacing INITools in that pip test - I'd like not to change the test radically, but it's absurdly hard to find a Python 3 project which uses Subversion - everything seems to be using hg or git these days! Also, what's the situation on Windows? According to http://ci.cloudsilverlining.org/view/pip/ all Windows builds seem to be broken. A smoke test of creating a virtualenv with my fork causes SandboxViolations (in easy_install, so it might be a distribute issue).", "group_id": 292, "id": 302675}, {"user_id": 18858, "stars": [], "topic_id": 10897, "date_created": 1299660095.1174381, "message": "@carljm: I also notice that INITools seems not to be \"just any old package\" - there's special code to create a repo for it in tests/local_repos.py. All in all, it's probably less work to modify INITools 0.3.x so that it doesn't raise exceptions when installed under Python 3, than to do anything else :-)", "group_id": 292, "id": 302756}, {"user_id": 214, "stars": [], "topic_id": 10897, "date_created": 1299684758.751013, "message": "@vsajip Ah yes, I forgot that in last years gsoc we created local versions of those repositories to avoid network access. You're probably right.", "group_id": 292, "id": 306134}, {"user_id": 214, "stars": [], "topic_id": 10897, "date_created": 1299684983.923347, "message": "@vsajip I need to look into the windows ci builds, I think they are breaking due to spurious temp-file / disk-space issues. That said, its been awhile since I ran pip tests on windows, they could be broken otherwise. Hoping to dig into this at pycon.", "group_id": 292, "id": 306187}, {"user_id": 19380, "stars": [], "topic_id": 10897, "date_created": 1300300250.4147861, "message": "@vsajip Good job on the port! I can successfully run it on OSX and Python 3.2. If I come across any issues while testing on other platforms, I'll report them in the BitBucket issue tracker.", "group_id": 292, "id": 368411}]