[{"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303392998.2383709, "message": "AwayHereWeGo.co (Travel/Group Deal site focused on family/group travel of 3 or more people)", "group_id": 9134, "id": 770020}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303392932.50366, "message": "I really like this idea ;)... Start Up Community Stand Up!", "group_id": 9134, "id": 770013}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303393214.921593, "message": "HowLowCanYouGo.co (User can shop for new and used items, and compare prices side by side from retailer sites like Amazon, Ebay, Walmart against individuals selling items on sites like Craig's list.)", "group_id": 9134, "id": 770064}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303429759.3141699, "message": "@Mpressme What is the purpose of the 3 or more angle on the AwayHereWeGo.co?", "group_id": 9134, "id": 776714}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303490292.046237, "message": "mobile configuration / advanced stats built-in/", "group_id": 9134, "id": 782800}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303490239.6481349, "message": "vbout.co is an identity/vcard/onepage profile / embeddable in widgets", "group_id": 9134, "id": 782784}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303496034.4139781, "message": "@vbout so what is the purpose of this? Web presence? Online business card?", "group_id": 9134, "id": 783640}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303504077.2099359, "message": "@ahurst... the main idea is to provide an Expedia type of travel booking experience in addition to a Groupon/JettSetter daily or group deal, whereas the content is specifically for families or groups, so I guess there are 2 angels.", "group_id": 9134, "id": 784683}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303521087.850105, "message": "@Mpressme So JettSetter for families? I think there could be a really good upside to that.", "group_id": 9134, "id": 786484}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303521386.181097, "message": "bump a phone is step 2 of the project, we are not creating a social network,! we are expanding the scope of a normal business card!", "group_id": 9134, "id": 786520}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303521434.782259, "message": "if you have a new business and a lot to say, what is the best way to do that?", "group_id": 9134, "id": 786527}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303520833.7073369, "message": "@ahurst Everyone wants a personal profile, whether it is an about.me or google profiles! also everyone wants a business card,  and everyone has business cards of preferred contacts. what if there was a way you can make your business cards digital with the abitlity to show not only contact info, but also some of the works you have done, your social contacts, etc..... you can use this for many purposes and the customization+designs we implementing are very attractive.", "group_id": 9134, "id": 786462}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303521035.3745539, "message": "@vbout sounds interesting. I don't want you to give to much away, but I am trying to guess at the use case? Am I going to be at a party and give someone a piece of paper with a link? Am I going to email someone with my link? Bump a phone? I am interested in the competitive advantage over a FB page, Linkedin and the like. Just trying to make you think.", "group_id": 9134, "id": 786479}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303522287.08599, "message": "@vbout Boothshare.co - As an exhibitor, trade shows can be extremely costly to attend. Fees mount up quickly and for small companies it is merely a pipe dream to be able to attend a show. Not anymore. Boothshare.co provides a way for companies both large and small to share a booth at a trade show.", "group_id": 9134, "id": 786662}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303521770.976315, "message": "at the end of the day, exchanging business cards is an indirect way of getting into a person's life, whether you have that card in your waller or on your desk! . We want to make that interaction cooler and more presentable.", "group_id": 9134, "id": 786566}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303521796.93366, "message": "@ahurst So what is your idea?", "group_id": 9134, "id": 786567}, {"user_id": 29765, "stars": [], "topic_id": 20626, "date_created": 1303571364.4148049, "message": "studybits.co : facebook meets blackboard meets cramster", "group_id": 9134, "id": 789438}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303571217.4437909, "message": "@ahurst so how does the technicality of this work? will the trade show allow you to have 2 businesses per booth? both parties have to sign the contract or just one person? what about all the perks that comes with that such stand rentals chairs, etc? will those expenses be shared? ", "group_id": 9134, "id": 789429}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303591025.483268, "message": "@ahurst thanks I think so. Being a mom myself I just thought it would be a great advantage if I could search for trips (besides Disney World) that were age appropriate for my twin boys. The Groupon clones are such a win-win platform... why not... although I would still build out the travel platform as well. Besides the name is kinda clever don't you think?", "group_id": 9134, "id": 791003}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303591431.408145, "message": "@ahurst I've been a witness to booth purchasing nightmares so I do understand how splitting the expense of that could be useful, but I'd like to know a little bit more about it.", "group_id": 9134, "id": 791071}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303648569.1620381, "message": "@Mpressme I like the idea have 3 kids myself it is harder to find/arrange family vacations outside of Disney and Seaworld. I am not to wild about the name kinda long and I have to look at it every time to know exactly what it is. But the idea is something I think could work really well.", "group_id": 9134, "id": 794433}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303648419.9485459, "message": "@vbout a little background - I have been working in the trade show space for a bit over 8 years. I work with both the decorators, show organizers and the exhibitors. I am very familiar with the entire process and how all the intricate details work. I don't want to give away to much of the business model, but all your questions have been addressed and we have ways we are solving those problems. It is a pretty complex problem when you look at it from the 10,000 ft view.", "group_id": 9134, "id": 794420}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303648461.955358, "message": "@siteforbiz do you have any examples? What pain point are you trying to alleviate?", "group_id": 9134, "id": 794424}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303648643.5219891, "message": "@Mpressme as we get more items developed and more of the site built out I will be a bit more transparent with exactly how we are solving the pain point of trade show exhibition.", "group_id": 9134, "id": 794437}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303694315.8824401, "message": "@ahurst maybe your right... something silly like gobyebye.co would have been better... I'm thinking to hard lol. I'll see what else I can come up with because the concept is defiantly winning.", "group_id": 9134, "id": 797732}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303736649.2198639, "message": "@Mpressme remember to always make sure there is the possibility to also purchase the .com I know #twist is evangelizing the .co but if you noticed none of them have a consumer product with anything other than a .com. Com is still the standard and will be for a while (unless you are a more mobile platform) I would definitely make sure .com is a possible purchase no matter what you do.", "group_id": 9134, "id": 803011}, {"user_id": 29769, "stars": [], "topic_id": 20626, "date_created": 1303738044.294863, "message": "@ahurst thx, your right ;)", "group_id": 9134, "id": 803171}, {"user_id": 30265, "stars": [], "topic_id": 20626, "date_created": 1303766045.3114991, "message": "@ahurst Any expectations of when boothshare will be live?", "group_id": 9134, "id": 807395}, {"user_id": 29765, "stars": [], "topic_id": 20626, "date_created": 1303766205.7047329, "message": "@ahurst you can go to the site, it is up now couple of weeksin and trying to clean up some small tasks. We are trying to address the issue of students having no ways to archive their hard worked on homework/papers and others to benefit from them, then the pains teachers have to deal with when it comes to creating classes and connecting with students in a web 2.0 fashion", "group_id": 9134, "id": 807414}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1303842648.9347301, "message": "@vbout launch date is set for mid-summer.", "group_id": 9134, "id": 817443}, {"user_id": 32097, "stars": [], "topic_id": 20626, "date_created": 1304452119.8116939, "message": "http://HelpJapan.co", "group_id": 9134, "id": 902341}, {"user_id": 25690, "stars": [], "topic_id": 20626, "date_created": 1304454435.292969, "message": "@creativecommunications What are you trying to do?", "group_id": 9134, "id": 902887}]