[{"user_id": 1924, "stars": [], "topic_id": 19283, "date_created": 1302726064.0605519, "message": "https://sugru.com/ is an interested material that is pliable then hardens.  A catch is that it's got a 6 month shelf life. I've been enjoying their newsletter and hacks listing, but never quite inspired to bite.  An order of ~$50 gets free shipping.  Anyone interested in a group order?", "group_id": 8728, "id": 671136}, {"user_id": 29251, "stars": [], "topic_id": 19283, "date_created": 1302737951.8031521, "message": "To me the interesting part is that they say it's flexible when cured.  I googled it to see if it was usable for mold making and turned up this homemade alternative: http://www.instructables.com/id/How-To-Make-Your-Own-Sugru-Substitute/     I'd suggest reading all the comments before trying it since they seemed helpful.", "group_id": 8728, "id": 673818}, {"user_id": 29251, "stars": [], "topic_id": 19283, "date_created": 1302992104.628325, "message": "As for the Oogoo, Sugru substitute.  Made that today and while it's rather nifty stuff, I'd likely only do it again if I needed a large quantity.  I tried a 1 part cornstarch to 3 parts caulk mix and it took a very long time to get to a usable consistency, next time I'd try closer to a 1 to 2 mix.  When you're to touch it, make sure gloves are kept well cornstarched because it's diabolically sticky.  Rapids Dollar Tree has packs of little 3\" to 4\" glass bowls in the dish section that worked well for mixing:  http://www.dollartree.com/kitchen-tableware/cooking-supplies/Kitchen-Gadgets-and-Tools/Glass-Bowls/213c273c380p80706/index.pro", "group_id": 8728, "id": 713686}, {"user_id": 29251, "stars": [], "topic_id": 19283, "date_created": 1302991757.471724, "message": "I'd be in for a Sugru goup buy.", "group_id": 8728, "id": 713668}, {"user_id": 29165, "stars": [], "topic_id": 19283, "date_created": 1302996754.9146481, "message": "Never tried sugru so count me in, I gotta try it.", "group_id": 8728, "id": 713994}]