[{"user_id": 15260, "stars": [], "topic_id": 9539, "date_created": 1298910673.596941, "message": "Alejandro Cortes O. @OkimXD . Diseñador grafico en proceso - Actualmente laboro en el Call Center de #EtbCo.", "group_id": 2696, "id": 226934}, {"user_id": 13447, "stars": [], "topic_id": 9539, "date_created": 1298911065.411756, "message": "Alfonso Valega. @avalonzero. Ingeniero de Sistemas y Diseñador Multimedia. Actualmente desempleado.", "group_id": 2696, "id": 227032}, {"user_id": 16485, "stars": [], "topic_id": 9539, "date_created": 1298911239.4328671, "message": "jose de jesus prieto @GARRAPATUDO estudiante de admin empresas trabajo en seguridad privada", "group_id": 2696, "id": 227061}, {"user_id": 16483, "stars": [], "topic_id": 9539, "date_created": 1298911725.202688, "message": "Jorge Duarte Alvarez @piris  Ingeniero de sistema, me desempeño como diseñador web y productor multimedia en la Universidad Autonoma de Bucaramanga en el departamento de @unabvirtual. Tambien me ocupo en el montaje de cursos en linea en plataformas Blackboard y WebCT. Amante y evangelista de servicios web y la electrónica de consumo.", "group_id": 2696, "id": 227144}, {"user_id": 16473, "stars": [], "topic_id": 9539, "date_created": 1298913891.501513, "message": "Eduardo Chavarro @echavarro , Ing en Telecomunicaciones, vivo y trabajo en Bogotá, soy empleado público. Fanático de la seguridad informática y las TIC, estudié en Ciudad Bolivar y me gusta apoyar este sector de la Capital Colombiana.", "group_id": 2696, "id": 227490}, {"user_id": 15260, "stars": [], "topic_id": 9539, "date_created": 1298922092.518127, "message": "Muchachos, los inivtamos a llenar el formulario de identificación http://goo.gl/frcW2", "group_id": 2696, "id": 228524}, {"user_id": 16482, "stars": [], "topic_id": 9539, "date_created": 1298922558.9274039, "message": "Listo, ya llené el formulario, de todas formas se colocan datos acá?", "group_id": 2696, "id": 228590}, {"user_id": 16500, "stars": [], "topic_id": 9539, "date_created": 1298924253.731245, "message": "KAMIAN: Camilo Andrés Suárez, Arquitecto de la Pontificia Universidad Javeriana, consultor en desarrollo de proyectos de arquitectura virtual y NTICs, investigador en comunicación digital, cultura digital, arquitectura y ciudades digitales y pedagogía.", "group_id": 2696, "id": 228990}, {"user_id": 15260, "stars": [], "topic_id": 9539, "date_created": 1298927533.477978, "message": "@auramavega Si es bueno para ampliar la info, el formulario es mas para tener datos puntuales.", "group_id": 2696, "id": 229570}, {"user_id": 16482, "stars": [], "topic_id": 9539, "date_created": 1298928054.743372, "message": "Aura Ma. Vega Stavro, cartagenera que vive en Bogotá hace casi 11 años. Soy Diseñadora Gráfica egresada de la Tadeo, Esp. en Diseño Multimedia de la Nacional, actualmente cursando la MA. en Diseño y Creación Interactiva de la U. de Caldas. He trabajado principalmente en empresas que desarrollan web y multimedia. Actualmente soy docente de cátedra en la Tadeo y hago algunos trabajos como freelance.", "group_id": 2696, "id": 229648}, {"user_id": 16555, "stars": [], "topic_id": 9539, "date_created": 1298935276.6481221, "message": "Angélica Carbonell, @Angelique_C Comunicadora Social, trabajo en Compartel del Ministerio TIC como encargada de Comunicaciones y Prensa ;)", "group_id": 2696, "id": 230235}, {"user_id": 13416, "stars": [], "topic_id": 9539, "date_created": 1298942700.792491, "message": "Daniel Julián Cárdenas @mobixconsulting -> Me defino como arquitecto e ingeniero de sistemas inteligentes", "group_id": 2696, "id": 230716}, {"user_id": 16645, "stars": [], "topic_id": 9539, "date_created": 1298986131.2550681, "message": "HOLA  MALU..EXCELENTE TENRTE ACA", "group_id": 2696, "id": 234443}, {"user_id": 16645, "stars": [], "topic_id": 9539, "date_created": 1298984143.666455, "message": "julio mauricio rojas @juliomauricio soy gerente de mtic en la secretaria de educacion de duitama, coordinador del grupo de investigacion mticduitama y lider del rpoyecto facebook con estudiantes y docentes de duitama", "group_id": 2696, "id": 234193}, {"user_id": 16651, "stars": [], "topic_id": 9539, "date_created": 1298985717.472645, "message": "Hola", "group_id": 2696, "id": 234344}, {"user_id": 16651, "stars": [], "topic_id": 9539, "date_created": 1298985816.107017, "message": "AnaMilenaPalencia, docente del Area de Tecnologia e Informatica. Magister en Tecnologias aplicadas a la educacion, docente de la univesidad de cordoba y cooinvestigadora del grupo EDUPMEDIA.", "group_id": 2696, "id": 234367}, {"user_id": 16649, "stars": [], "topic_id": 9539, "date_created": 1298985892.2699561, "message": "Maria Lucia Franco Ingeniera de Sistemas, Gerente de MTIC de la Secretaría de Educación de Montería @mlfrancoe", "group_id": 2696, "id": 234394}, {"user_id": 16653, "stars": [], "topic_id": 9539, "date_created": 1298986911.395931, "message": "Diego Guevara @yeyog, ex periodista digital en RCN Radio y El Espectador, entre otros; área de contenidos y estrategias web en la agencia PR de Google en Colombia y coordinador de la estrategia de HP a final de año en redes sociales para latam. Creador de www.elblogdelosperiodistas.com", "group_id": 2696, "id": 234545}, {"user_id": 15483, "stars": [], "topic_id": 9539, "date_created": 1298992047.2293019, "message": "Juan David Correa Toro @juandacorrea http://bit.ly/juandacorrea", "group_id": 2696, "id": 235393}, {"user_id": 16649, "stars": [], "topic_id": 9539, "date_created": 1298994343.7848771, "message": "Hola Julio, rico de verdad que podamos apoyar este tipo de iniciativas desde lo que hacemos en las Secretarías de educación", "group_id": 2696, "id": 235763}, {"user_id": 16706, "stars": [], "topic_id": 9539, "date_created": 1298997612.7489929, "message": "Manuel mauricio muñoz: soy estudiante de la licenciatura en comunicación e informática educativas de la Universidad Tecnológica de Pereira, , fui monitor durante tres semestre de univitual, monitor de investigaciones  relacionadas con la cibercultura durante dos semestres. actualmente estoy en décimo realizando mi trabajo de grado en una investigación aplicada.", "group_id": 2696, "id": 236187}, {"user_id": 16717, "stars": [], "topic_id": 9539, "date_created": 1298999838.5279801, "message": "Soy docente de Informática estudiante de maestria en TIC, con muchos deseos de aprender de cada uno de ustedes compañeros de aprendizaje.", "group_id": 2696, "id": 236313}, {"user_id": 16723, "stars": [], "topic_id": 9539, "date_created": 1299002435.0363431, "message": "Hola! Ing. Sistemas (Desarrollando mi proyecto de grado), muy interesada en participar en la articulación de la academia con la #brigadadigital. Trabajo en Cuazart Studios: diseño y desarrollo de videojuegos - industria 100% colombiana!!! @Cuazart", "group_id": 2696, "id": 236472}, {"user_id": 16710, "stars": [], "topic_id": 9539, "date_created": 1299002691.2156589, "message": "Ing. electrónico que ha trabajado con proveedores de telecomunicaciones, en la academia y con seguridad, actualmente consultor independiente.  Promotor del capítulo colombiano de la Wikimedia Foundation entre otros proyectos de voluntariado digital.", "group_id": 2696, "id": 236490}, {"user_id": 16652, "stars": [], "topic_id": 9539, "date_created": 1299006502.5739601, "message": "Carlos Martínez Mogollón, Lic. Informática y Medios, adelantando estudios en Maestría en Educación. Trabajando como Profesional Especializado en el área de Conertura del Ministerio de Educación Nacional.", "group_id": 2696, "id": 237079}, {"user_id": 15483, "stars": [], "topic_id": 9539, "date_created": 1299016340.5406041, "message": "@juandacorrea escuadrón @redsalvavidas.  Ingeniero Administrador de la Universidad Nacional, Especialista en desarrollo de Software de la Universidad EAFIT. Socio fundador y gerente de Nodrizza Network S.A. Emprendedor empedernido, investigador por pasión, inquieto con todo lo 2.0, y ahora movido profundamente por la pregunta ¿cómo las nuevas tecnologías pueden ayudar a salvar vidas y aliviar el sufrimiento humano? http://bit.ly/juandacorrea", "group_id": 2696, "id": 239383}, {"user_id": 17223, "stars": [], "topic_id": 9539, "date_created": 1299019776.1819539, "message": "Hola a todos soy @kathygamez, barranquillera viviendo en Santa marta hace mas de 5 años, trabajando por esta linda ciudad (algo olvidada) evangelizando cada vez que se puede sobre el buen uso de las TIC, Analista de sistemas, Diseñadora gráfica en proceso, me desempeño en coordinación de Sistemas de Gestión de la Calidad en el sector salud y consultorías independientes relacionadas con las TIC, creadora de www.santamartaviva.com", "group_id": 2696, "id": 241048}, {"user_id": 17395, "stars": [], "topic_id": 9539, "date_created": 1299022994.1469901, "message": "Hola! Soy JUancri Barrera Navarro Candidato a Magister en Tecnología Educativa y Medios Innovadores para la Educación.\nCandidato a Máster en Dirección y Gestión de Centros Educativos en el Nuevo Entorno Digital. \nEspecialista Gerencia Empresarial.\nLicenciado en Informática Educativa y Medios Audiovisuales.", "group_id": 2696, "id": 241992}, {"user_id": 17466, "stars": [], "topic_id": 9539, "date_created": 1299035837.8712709, "message": "Vanessa Villa Lombana, Licenciada en Informática y Medios Audiovisuales, actualmente docente del programa Computadores para Educar y Universidad de Antioquia.", "group_id": 2696, "id": 242916}, {"user_id": 17517, "stars": [], "topic_id": 9539, "date_created": 1299043340.35132, "message": "Hola, soy @javiersneider Comunicador Social y Periodista, inclusor digital, trabajo en el tema con la educación de la provincia del Tundama en Boyacá, coordinador de @tuiterosboyaca, trabajando en temas de inclusión digital y TICs con algunas alcaldías del departamento, en especial, (Corrales, Floresta)", "group_id": 2696, "id": 243676}, {"user_id": 17771, "stars": [], "topic_id": 9539, "date_created": 1299082865.0100839, "message": "Hola a todos, soy Juliana Uribe, @JuliUR, ingeniería industrial y magíster en ingeniería industrial. Hasta hace poco, docente universitaria. Siempre interesada en aprender y apoyar iniciativas que generen impactos positivos en la sociedad.", "group_id": 2696, "id": 248345}, {"user_id": 16465, "stars": [], "topic_id": 9539, "date_created": 1299086432.2286389, "message": "Hola soy Amilde Frías @amifrias, Comunicadora social-periodista, barranquillera, pero radicada en Bogotá. Periodista del sector TIC durante 4 años en Cintel y anteriormente trabajando en agencias de PR con empresas de tecnología, manejando prensa de eventos de tecnología. Ex reportera de El Tiempo. Ahora trabajo como free lance, escribiendo artículos de diferentes temas. Interesada en q podamos hacer enlaces para q las personas mejoren su perfil profesional, encontrando mejores fuentes de empleo o con actividades de emprendimiento #twitteratonjobs. También interesada en q cada día seamos mejores personas, ayudando a la sociedad a tener mejores valores.", "group_id": 2696, "id": 248998}, {"user_id": 17917, "stars": [], "topic_id": 9539, "date_created": 1299099964.4114881, "message": "Hola todos, soy Joanna Prieto, antes que nada, soy mamá de dos chiquis ya no tan chiquis, inspiradora y emprendedora, incansable con la carreta educativa, me gusta el ping pong aunque poco tiempo pa' ello ;) . Devuelta al país después de experimentar en el exterior, atraída por la pasión que llevo por Colombia. Soy profesional en Lenguas modernas con énfasis en traducción y comunicación organizacional, especialista en gestión humana y dllo organizacional, máster en Dirección de comunicaciones otro poco de diplomas en temas de gerencia, educación y tecnologías. Mas info en Linkedin. les dejo mi blog para que me conozcan un poco más www.aulajoannaprieto.blogspot.com. Manos a la obra! un placer conocerlos. ;)", "group_id": 2696, "id": 252834}, {"user_id": 16482, "stars": [], "topic_id": 9539, "date_created": 1299154702.6964869, "message": "Se me había olvidado colocar mi user de twitter @auramavega", "group_id": 2696, "id": 259770}, {"user_id": 18976, "stars": [], "topic_id": 9539, "date_created": 1299348055.0371051, "message": "Hola, soy Natalia Andrea Beltran @NandreaBeltran, ing de sistemas, estudiante especialización en seguridad de la información, actualmente empleada, analista de seguridad de la información, apasionada por el ciberespacio, buscando ventajas en web 2.0 y me encantaría hacer parte de #brigadadigital. Cuéntenme en que puedo colaborar.", "group_id": 2696, "id": 277003}, {"user_id": 15260, "stars": [], "topic_id": 9539, "date_created": 1299348155.3397541, "message": "@nandrea https://convore.com/brigadadigital/escuadron-bienvenida/ pasate por aca un rato y enterate mas de la #BrigadaDigital", "group_id": 2696, "id": 277014}, {"user_id": 18844, "stars": [], "topic_id": 9539, "date_created": 1299928866.3054481, "message": "Hola!!", "group_id": 2696, "id": 331244}, {"user_id": 18844, "stars": [], "topic_id": 9539, "date_created": 1299928882.369019, "message": "No veo nada acerca del escuadrón #prosperidad... Quienes estamos, cuando empezamos a trabajar en esto... opiniones, sugerencias, etc.", "group_id": 2696, "id": 331245}, {"user_id": 19193, "stars": [], "topic_id": 9539, "date_created": 1299943120.76353, "message": "Hola! soy Maria Fernanda, fisioterapeuta, especialista en docencia Universitaria y actualmente Erasmus Mundus en Salud Pública. Estoy en Copenhagen pero pronto estaré de regreso a Colombia. Me parece super interesante el proyecto y me gustaría colaborar en lo que pueda. @maffe21 Saludos", "group_id": 2696, "id": 332661}, {"user_id": 18844, "stars": [], "topic_id": 9539, "date_created": 1300050675.0790391, "message": "Tenemos un  escuadrón pro-defensa de la mujer o \"Contra el maltrato a la mujer\"?", "group_id": 2696, "id": 343567}, {"user_id": 16500, "stars": [], "topic_id": 9539, "date_created": 1300118695.0188811, "message": "sip, las #geekgirls", "group_id": 2696, "id": 348692}, {"user_id": 26055, "stars": [], "topic_id": 9539, "date_created": 1301322985.4272571, "message": "Nelson Bolaños @noslenb9  soy comunicador social, vivo en Popayán Cauca, estoy buscando empleo, tengo mi énfasis en comunicación organizacional, me agrada lo relacionado con la producción  y postproducción en animación, vídeo y fotografía.", "group_id": 2696, "id": 458180}, {"user_id": 26055, "stars": [], "topic_id": 9539, "date_created": 1301323083.8894789, "message": "soy nuevo en este espacio me gustaría saber de que se trata, y claro soy un fanático por las tecnologías de la información, en especial en edición,", "group_id": 2696, "id": 458192}, {"user_id": 26132, "stars": [], "topic_id": 9539, "date_created": 1301339848.3717239, "message": "@pablogog Soy ingeniero de sistemas de la universidad tecnológica de Pereira, recién egresado por cierto!!! Pueden buscarme por el twitter como @pablogog o por el gtalk como juanwalker@gmail.com para cualquier acercamiento :-) . Me  interesan muchos los temas que tengan que ver con salud,la educación,el desarrollo sostenible y la tecnología misma.", "group_id": 2696, "id": 461116}, {"user_id": 26153, "stars": [], "topic_id": 9539, "date_created": 1301345201.415221, "message": "Mi nombre es Juan Carlos Pachón. Estudié Licenciatura en Fisica en la UPN, trabajé como docente por mas de 6 años. Hoy en día me gano la vida con el oficio de la familia, tengo una empresa que produce souvenirs en cuero (Ver http://ioke.com.co ). Desde hace 10 años pertenezco al Movimiento Ciudadano por la Noviolencia en Colombia, actualmente soy el responsable de gestión de las redes sociales. Tengo un diplomado en Cultura de Paz (javeriana), uno en Noviolencia (Uniminuto) he sido entrenado en ADN ( accion directa noviolenta ). Mi comunidad de práctica en la actualidad en el área de las TIC es Open Street Map, una plataforma open source de gestión de Información Geográfica.", "group_id": 2696, "id": 462022}, {"user_id": 26146, "stars": [], "topic_id": 9539, "date_created": 1301352907.174576, "message": "Soy Carol Gutiérrez colombo-venezolana @carolisethgut Ingeniera de Sistemas y especialista en Planificación Gerencial con 6 años de experiencia en docencia. Ejerciendo en Venezuela con IBM como facilitadora de nuevas tecnologías y asesora de proyectos de la empresa Dolzzeta-Pasotini. Hoy de vuelta en Colombia desde la UDES en la facultad de Ingenierías, perteneciendo en el Comité de Autoevaluación para el programa de postgrado Especialización en Gerencia de Empresas, bajo la dirección de la Oficina de Aseguramiento de la Calidad. Orgullosamente Docente TIC llevamos a cabo el twitteraton y telemaraton en pro damnificados de Gramalote afectados por la ola invernal de Norte de Santander.", "group_id": 2696, "id": 462924}, {"user_id": 24374, "stars": [], "topic_id": 9539, "date_created": 1301503357.858521, "message": "Soy Lucrecia Palladino @lucrecialeah estudiante de publicidad, y organizadora de eventos, soy de cordoba, argentina y desempleada! Increible las personas q hay en este grupo!", "group_id": 2696, "id": 482929}, {"user_id": 26906, "stars": [], "topic_id": 9539, "date_created": 1301596916.6037021, "message": "hola a todos", "group_id": 2696, "id": 494632}, {"user_id": 26243, "stars": [], "topic_id": 9539, "date_created": 1301595950.7486651, "message": "Salu2, mi nombre Patricia Londoño, @patricialondono Ingeniera de Sistemas y Directora del Departamento de Informática de la Alcaldía Municipal de Tuluá.", "group_id": 2696, "id": 494522}, {"user_id": 20513, "stars": [], "topic_id": 9539, "date_created": 1301579759.421607, "message": "Buen día. Me llamo Adrián Esteban Rodriguez Álvarez. Un abrazo desde la ciudad de Medellín. Mi Twiiter: @directorseiton. Profesional en Ciencia y Tecnología de Alimentos de la Universidad de Antioquia, con un diplomado de formación de formadores en empredimiento con la Comunidad Autónoma De Madrid; Diplomado en Uso de herramientas de la web 2.0 para educación. Actualmente desarrollo dos labores: (1)Facilitador de ambientes virtuales de aprendizaje con al Fundación Universitaria Católica del Norte (2) Fundador y director ejecutivo de la Comunidad Seiton: http://www.comunidadseiton.org ; comunidad del conocimiento en donde empresarios y profesionales de la industria de alimentos usamos la web para difundir ideas y fortalecer los procesos empresariales en esta actividad. Actuamente se desarrolla un programa de formación virtual para las unidades de emprendimiento ubicadas en la ciudad de Medellín, buscando fortalecer el uso de las Tic´s en sus procesos de acompañamiento a emprendedores. Cuenten conmigo en todo lo que tenga que ver con emprendimiento. Hobbies: Cocinar, escuchar buena música, tertulia", "group_id": 2696, "id": 491958}, {"user_id": 20876, "stars": [], "topic_id": 9539, "date_created": 1301622761.5110519, "message": "Aura Mercedes Bautista Poveda @aumebapo, Directora de Núcleo Educativo de la Provincia de Tundama, Boyacá; responsable de orientar la educación en 18 Instituciones Educativas Oficiales y 16 Privadas, en las cuales se pretende desarrollar proyectos innovadores utilizando las Tic. Interesada en promover el I Encuentro de Edublog en la Provincia, el 21 de octubre de 2011, en el municipio de Corrales.", "group_id": 2696, "id": 498455}, {"user_id": 26161, "stars": [], "topic_id": 9539, "date_created": 1301772125.5398419, "message": "Mi nombre es Miguel Yáñez, @migueayb, Ingeniero de Sistemas y Computación de la Universidad de los Andes. He sido consultor en seguridad de la información, consultor de Arquitectura Orientada a Servicios (SOA), y profesor universitario en el Politécnico Grancolombiano. En este momento estoy cercano a salir del país por razones laborales, pero mientras esté acá cuenten conmigo", "group_id": 2696, "id": 509925}, {"user_id": 28086, "stars": [], "topic_id": 9539, "date_created": 1302232347.5383401, "message": "Alexander Leon Bernal, ingeniero industrial (en realidad la he practicado muy poco xD), trabajo en un pequeño negocio de plásticos, me gusta aprender y compartir información sobre tecnología y videojuegos, y algunas opiniones de lo que se percibe en la \"surrealidad\" nacional. Estaré pendiente a lo que pueda colaborar. twitter @alexbot78.", "group_id": 2696, "id": 584826}, {"user_id": 17472, "stars": [], "topic_id": 9539, "date_created": 1304409702.3367169, "message": "Buenas!!! mi nombre es Jorge Alvarado @g_orge, soy creador multimedia profesor en la universidad de la salle.", "group_id": 2696, "id": 895201}, {"user_id": 31085, "stars": [], "topic_id": 9539, "date_created": 1304428977.389405, "message": "hola buenos días yo soy reeenuevecita @yuyanas soy Copy Creativa.", "group_id": 2696, "id": 897755}, {"user_id": 16500, "stars": [], "topic_id": 9539, "date_created": 1307208318.8847449, "message": "¿como es eso de Copy creativa? suena interesante!", "group_id": 2696, "id": 1287443}, {"user_id": 35571, "stars": [], "topic_id": 9539, "date_created": 1307500388.0930171, "message": "@yuyanas Ey, qué rico que te hayas unido. Es genial. Ojalá sea una excusa para reunirnos de nuevo.\n\nSoy @Danielripe y soy creativo publicitario.", "group_id": 2696, "id": 1332301}, {"user_id": 31085, "stars": [], "topic_id": 9539, "date_created": 1307540548.2431431, "message": "Hola @Danielripe !!!!  :D que chévere verte por acá. Weeeeeeeee estoy en #enTicConfio pero eso no se mueve pa naaaaaaaaaaaaa!!!  (Saludos @KAIMAN)", "group_id": 2696, "id": 1337177}]