[{"user_id": 13453, "stars": [], "topic_id": 9684, "date_created": 1298980778.5784011, "message": "Líder: @yeyog\nObjetivos: Promover la reflexión continua entorno a las posibilidades y riesgos en Internet, relacionados con:\n•\tPornografía infantil\n•\tCiberdelincuencia\n•\tPrivacidad\n•\tProtección de menores\n•\tCiberadicción\n•\tReclutamiento forzado\n•\tExplotación sexual\nActividades: Campaña de difusión de las recomendaciones de seguridad online, privacidad y protección de menores en línea y buen uso de la Red. \nGrupos de discusión papás y docentes 2.0 (Identificar e involucrar comunidades existentes e identificar ideas).\nSocialización líneas de ayuda.\nEnlace MinTic - ViveDigital: Elizabeth Rivera", "group_id": 2696, "id": 233952}, {"user_id": 17462, "stars": [], "topic_id": 9684, "date_created": 1299037085.1777, "message": "Dispuesta a colaborar! Además me gustaría saber si hay pensadas actividades directas con niños y adolescentes...", "group_id": 2696, "id": 243051}, {"user_id": 18166, "stars": [], "topic_id": 9684, "date_created": 1299118177.7450089, "message": "Me apunto al igual q @LibelulaDigital. Que se debe hacer?", "group_id": 2696, "id": 256029}, {"user_id": 17517, "stars": [], "topic_id": 9684, "date_created": 1299210966.420841, "message": "Hola a todos, Quiero comentarles que en el departamento de Boyacá estamos realizando con el grupo #tuiterosboyaca una campaña en las Intituciones Educativas de las provincias del Tundama y Sugamuxi, para que los estudiantes y docentes conozcan los riesgos que pueden afectarlos (los citados por rosáceos en el primer post), esperemos poder compartirles la experiencia que hemos tenido.", "group_id": 2696, "id": 266377}, {"user_id": 17517, "stars": [], "topic_id": 9684, "date_created": 1299211040.6279881, "message": "*(rosáceos => lo correcto - rosacris).", "group_id": 2696, "id": 266381}, {"user_id": 22042, "stars": [], "topic_id": 9684, "date_created": 1300568777.9727581, "message": "La responsabilidad del adecuado manejo de la información es de cada internauta, que hay que hacer?, espero que me envien la invitacion para el documento compartido. exitos a todos.", "group_id": 2696, "id": 389533}, {"user_id": 22042, "stars": [], "topic_id": 9684, "date_created": 1300568848.0458131, "message": "Muchachos, que les parece si trabajamos en las instituciones educativas? el manoteo digital es una cosa seria", "group_id": 2696, "id": 389536}, {"user_id": 26161, "stars": [], "topic_id": 9684, "date_created": 1301557892.418776, "message": "Este escuadrón me parece muy interesante, es difícil llegar al público objetivo, en lo posible debería lograr distribuirse información a través de colegios, de pronto @joannaprieto nos puede ayudar con eso", "group_id": 2696, "id": 489946}, {"user_id": 31085, "stars": [], "topic_id": 9684, "date_created": 1305148656.543334, "message": "Hola soy nueva en el escuadrón, me parece bien  hacer algo en las instituciones, pero me parece aún mejor enseñarles a los jóvenes a estrategia de \"Trucos en las redes\" la privacidad de su información ¿Cómo ocultar datos a desconocidos etc... y cómo descubrir a una persona indeseable en éste caso peligrosa.", "group_id": 2696, "id": 1014605}, {"user_id": 17517, "stars": [], "topic_id": 9684, "date_created": 1308409514.735534, "message": "@tuiterosboyaca realiza en #boyaca jornadas de inclusión digital en instituciones educativas, sobre uso adecuado de redes sociales, tips de uso, experiencias de otros jóvenes, buen ejemplo a seguir, además cualquier cosa @tuiterosboyaca están disponibles para colaborar en lo que el escuadrón determine.", "group_id": 2696, "id": 1427068}, {"user_id": 22865, "stars": [], "topic_id": 9684, "date_created": 1308622784.34342, "message": "no olviden incluir a poblacion en situacion de discapacidad en los talleres para ademas tener en cuenta tecnologia y software adaptado una cosa es pedagogia en redes sociales y otra distinta hacerlo para personas con discapacidad", "group_id": 2696, "id": 1444351}]