[{"user_id": 214, "stars": [], "topic_id": 39763, "date_created": 1308461561.6513691, "message": "In this case there's no issue with a delay, because the changes were all CSS and HTML.", "group_id": 2873, "id": 1430404}, {"user_id": 214, "stars": [], "topic_id": 39763, "date_created": 1308461230.780874, "message": "I did an epio upload, and everything seemed to work just fine -- but it's been ten or fifteen minutes, and I seem to still be getting the previous code served from myapp.ep.io. I also noticed looking at the console output that there's no gunicorn startup output following the \"new code deployed\" message. Is this an indication of something that needs kicking on the backend, or more likely my own PEBKAC somewhere?", "group_id": 2873, "id": 1430375}, {"user_id": 214, "stars": [], "topic_id": 39763, "date_created": 1308461618.9995589, "message": "But I'm thinking that if this were to happen e.g. on a deploy that included a database migration, it could result in downtime, since the old code might not work with the migrated database.", "group_id": 2873, "id": 1430410}, {"user_id": 214, "stars": [], "topic_id": 39763, "date_created": 1308461674.3498869, "message": "So as action item, I'm wondering if my deploy script (which currently just always runs \"epio django migrate\" after the upload ought to be split into two steps, and if there's any simple automated way I could check to verify that the switchover to the new code has actually been made, before running the db migrations.", "group_id": 2873, "id": 1430414}, {"user_id": 1081, "stars": [], "topic_id": 39763, "date_created": 1308463832.0640891, "message": "I've been having the same issues ... quite strange, i feel there's some sort of caching of the code going on ... lets wait and see what @andrewgodwin says", "group_id": 2873, "id": 1430464}, {"user_id": 1772, "stars": [], "topic_id": 39763, "date_created": 1308466457.164319, "message": "I have seen the same — the \"coordinator\" probably has halted and needs a kick from @andrewgodwin", "group_id": 2873, "id": 1430557}, {"user_id": 25736, "stars": [], "topic_id": 39763, "date_created": 1308466627.2037239, "message": "I had the same issue two days ago and it was solved. Didn't try since..", "group_id": 2873, "id": 1430568}, {"user_id": 30953, "stars": [], "topic_id": 39763, "date_created": 1308467045.8355241, "message": "Same problem here. Also, suspending and restarting the app from the dashboard has no effect, the app just keeps running.", "group_id": 2873, "id": 1430584}, {"user_id": 33392, "stars": [], "topic_id": 39763, "date_created": 1308473574.2058589, "message": "Same problem", "group_id": 2873, "id": 1430734}, {"user_id": 8740, "stars": [], "topic_id": 39763, "date_created": 1308474300.3121991, "message": "Alright, fixed now - there's something in the mainloop of the coordinator that keeps getting stuck. I'll add a forced timeout to hopefully resolve that while we're still testing the new backend.", "group_id": 2873, "id": 1430755}, {"user_id": 214, "stars": [], "topic_id": 39763, "date_created": 1308612521.8782411, "message": "@andrewgodwin Is it fair for an epio upload script to generally assume that the live switchover should happen pretty much immediately when the upload is complete? Or is there a possible delay window I should be taking into account, even when everything is working correctly?", "group_id": 2873, "id": 1443470}, {"user_id": 21184, "stars": [], "topic_id": 39763, "date_created": 1308640883.702832, "message": "@carljm No, currently you can't assume that. That topic was discussed in more detail than I should quote here in https://convore.com/epio/deployment-questions/ several days ago", "group_id": 2873, "id": 1446333}, {"user_id": 8740, "stars": [], "topic_id": 39763, "date_created": 1308642939.2592161, "message": "To comment further on the delay windiw - we're working to reduce it to around 5 seconds, after which we'll hang inciming requests until the new servers are ready.", "group_id": 2873, "id": 1446439}]