[{"user_id": 4831, "stars": [], "topic_id": 12366, "date_created": 1299861275.4417319, "message": "Who is your favorite doctor? Favorite episode? and or Season?", "group_id": 11, "id": 324074}, {"user_id": 17610, "stars": [], "topic_id": 12366, "date_created": 1299865680.3372829, "message": "I'm a fan!  My favorite New Who Doctors are Nine and Eleven, Christopher Eccleston and Matt Smith, respectively.  My favorite Classic Who Doctor is Tom Baker.", "group_id": 11, "id": 325133}, {"user_id": 6202, "stars": [], "topic_id": 12366, "date_created": 1299865732.369899, "message": "I enjoyed the Donna season. I like David Tennant, but I also like Matt Smith. Tom Baker is also another favorite doctor of mine. I am totally excited for the upcoming season. My favorite episode is Blink, but I also like The Girl in the Fireplace. The most recent Christmas special was also really good.", "group_id": 11, "id": 325150}, {"user_id": 17610, "stars": [], "topic_id": 12366, "date_created": 1299865839.380985, "message": "The season that just finished blew me away. The stories, the acting, the jokes - I absolutely loved it.", "group_id": 11, "id": 325155}, {"user_id": 17610, "stars": [], "topic_id": 12366, "date_created": 1299865872.0329821, "message": "@sumpygump Donna is definitely my favorite companion. She was awesome!", "group_id": 11, "id": 325158}, {"user_id": 13904, "stars": [], "topic_id": 12366, "date_created": 1299870412.9167359, "message": "My favourite doctor is David Tennant, and my favourite episode is probably the episode where he regenerates.", "group_id": 11, "id": 325685}, {"user_id": 4831, "stars": [], "topic_id": 12366, "date_created": 1299939239.795419, "message": "I think I am between Matt and David and agree that Tom was an awesome classic, I am surprised to her Chris. He was short lived as a Doctor that most of the people I know dont think of him. Rose was my favorite companion, but I also had a crush on her lol. It's difficult for me to pick a favorite episode or season (and I asked the question lol)", "group_id": 11, "id": 331855}, {"user_id": 21398, "stars": [], "topic_id": 12366, "date_created": 1300080151.658534, "message": "Rose favorite companion liked the show when she saved her dad and messsed time up", "group_id": 11, "id": 345099}, {"user_id": 1034, "stars": [], "topic_id": 12366, "date_created": 1300120176.960309, "message": "Favourite Doctor is either Matt Smith or David Tennant. Christopher Ecclestone was pretty good and you could definitely see his character develop over the series. Favourite episode, probably either Blink, Doomsday or the last half an hour or so of The End of Time.", "group_id": 11, "id": 348907}, {"user_id": 33872, "stars": [], "topic_id": 12366, "date_created": 1305986079.1222301, "message": "Favourite doctor is definitely Matt Smith, although all from the 2005 series are fantastic. Favourite companion: Donna. Brought a whole new dynamic to the show, finally taking it away from all the romance stuff.", "group_id": 11, "id": 1133967}, {"user_id": 15423, "stars": [], "topic_id": 12366, "date_created": 1306052713.782985, "message": "Favorite doctor is definitely David Tennant.  Holy crap I am super surprised by all the people loving Donna.  I HATED her.  Most of my friend who like Who hated her too.  My  favorite companion was Rose by far.  She was the most competent and courageous in my opinion.  Plus the Doctor fell in love with her.  That takes character.  Favorite episodes are probably The Shakespeare Code and The Satan Pit.   It also needs to be noted that River Song is a phenomenal character.", "group_id": 11, "id": 1140460}, {"user_id": 32854, "stars": [], "topic_id": 12366, "date_created": 1306097461.2783239, "message": "By the end of this series I think my fave is probably gonna be Smith, and best ep The Doctors Wife, Blink or the Empty Child", "group_id": 11, "id": 1144045}, {"user_id": 32854, "stars": [], "topic_id": 12366, "date_created": 1306097501.7893479, "message": "Prurient favourit being Eccleston. tennant was also damn good though, no hating here. :)", "group_id": 11, "id": 1144050}, {"user_id": 21759, "stars": [], "topic_id": 12366, "date_created": 1306121111.7761791, "message": "I like the 3 doctors equally. Favorite episodes are Blink, The empty child/The doctor dances. I don't like Martha as a companion, I find her crush to the doctor so annoying that I didn't get to enjoy season 3 (I know Blink is from that but they weren't really shown much in that episode lol). Favorite companion would be Donna, I didn't like her (at first) in the runaway bride but she was amazing in season 4.", "group_id": 11, "id": 1147865}, {"user_id": 32854, "stars": [], "topic_id": 12366, "date_created": 1306129873.8210461, "message": "I'd agree with that, she got a lot better when they fleshed out her character more. Also remembered another good ep was the Tennant one where Mr Blue Sky is playing throughout? Can't remember te name though.", "group_id": 11, "id": 1148775}, {"user_id": 36698, "stars": [], "topic_id": 12366, "date_created": 1308923662.5113721, "message": "Also I really enjoyed the doctors wife! I thought it was a very unusual idea was fun. It reminded you that the tardis is far more than a time \"machine\".", "group_id": 11, "id": 1476454}, {"user_id": 36698, "stars": [], "topic_id": 12366, "date_created": 1308923501.199465, "message": "Donna is by far the best companion of the doc!!", "group_id": 11, "id": 1476434}, {"user_id": 38092, "stars": [], "topic_id": 12366, "date_created": 1310690616.0173621, "message": "Is there a way to view episodes online?  I can never catch it when it's on.", "group_id": 11, "id": 1641536}]