[{"user_id": 7645, "stars": [], "topic_id": 7130, "date_created": 1297987265.8112791, "message": "Hah! I didn't even see that, you're right...", "group_id": 2515, "id": 138028}, {"user_id": 7645, "stars": [], "topic_id": 7130, "date_created": 1297986710.6420331, "message": "It seems crazy to me to not introduce the Antagonist until the second act, but if its for a school assignment I guess that would be a different case", "group_id": 2515, "id": 137899}, {"user_id": 7712, "stars": [], "topic_id": 7130, "date_created": 1297986577.501364, "message": "In my Screenwriting class, we are to create a brief synopsis of a 3-act screenplay. The outline that we are to use is: \n\nAct One: Introduce the protagonist, antagonist and the problem (Thesis)\nAct Two: Introduce the antagonist and key conflict (Antithesis)\nAct Three: Introduce the final crisis and resolution (Synthesis)\n\nI would like to ask those of you with more experience (both with screenplays and Dramatica) how you might reconstruct this 3-act summary to fit within the 4-act structure of Dramatica?\n\nI'm aware of the comparisons material located here http://www.dramatica.com/theory/articles/index.htm.\n\nIn some ways, I think that my question seems like a \"no-brainer,\" but I've been looking at the mapping within the Short Story, Novel, and Screenplay templates that come with Dramatica and find it interesting.\n\nAs far as this type of assignment is concerned, I've simply plugged the outline into the respective Journey and written the summary around that, so accomplishing the task is no sweat. But I would like to hear feedback from others with experience as to how they might approach it as that may help me find the answers to other non-specific questions forming in my head.\n\nThanks,\nBuck", "group_id": 2515, "id": 137881}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1297987053.5707321, "message": "You have accidentally introduced the antagonist twice, in the first and second act.", "group_id": 2515, "id": 137963}, {"user_id": 7712, "stars": [], "topic_id": 7130, "date_created": 1297987375.9467111, "message": "I copied it from the syllabus. As far as first impressions are concerned, this instructor has made a good first impression onto me. I may be wrong, but I think this person may be my instructor (I've asked by e-mail and am awaiting confirmation): http://www.imdb.com/name/nm0098286/", "group_id": 2515, "id": 138059}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1297987762.7992959, "message": "So... the syllabus is wrong?", "group_id": 2515, "id": 138108}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1297993016.195313, "message": "I don't understand how anyone can be introduced twice, that's all. Going past that, how did you write it up?", "group_id": 2515, "id": 138791}, {"user_id": 7712, "stars": [], "topic_id": 7130, "date_created": 1297992115.942039, "message": "I don't understand your question because I did not create the outline steps. I copied them from the syllabus. Select, copy, paste. That's it.", "group_id": 2515, "id": 138660}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1297990596.728179, "message": "At any rate, would you mind sharing how you wrote this up?", "group_id": 2515, "id": 138457}, {"user_id": 7712, "stars": [], "topic_id": 7130, "date_created": 1297993928.137218, "message": "Oh, I see what you are asking. I followed step one and introduced the contagonist instead of the antagonist, followed step two and introduced the antagonist, and then followed step three.\n\nAnother reason I am asking the original question is because of a major writing project of mine. I've mentioned in the former chat (and maybe the Screenplay forum) that I'm writing three trilogies. I know from Dramatica theory that quads fit within quads, so I'm beginning to think that rather than write three trilogies, I should write four tetrologies.\n\nIf I expand the project to four tetrologies, then each set could fit within its own signpost, which means that independently, each book would be a complete story, each tetrology would be a complete story, and all 12 books would be their own story as well.", "group_id": 2515, "id": 138884}, {"user_id": 7712, "stars": [], "topic_id": 7130, "date_created": 1297994152.1216929, "message": "(and Mike, I'm reading Shardik.)", "group_id": 2515, "id": 138908}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1298000553.169498, "message": "That sounds like an interesting project. I wouldn't necessarily change your plan just because of the \"math\" of dramatica -- dramatica will support however you want to tell your story. I know things fit into quads, but it's just a decision they had to make when programming the software. You could just as easily say that stories breakdown into three journeys.", "group_id": 2515, "id": 139641}, {"user_id": 7664, "stars": [], "topic_id": 7130, "date_created": 1298000686.6670859, "message": "I think if I were to do your assignment, I would do something like this: \n1) Introduce the protagonist, his flaw, his goal and the person who wants to stop him.\n2) I'd have his flaw (as symptom) be revealed as false, and show his Problem\n3) I'd show the problem that can only be resolved by accepting or denying the Solution.", "group_id": 2515, "id": 139651}]