[{"user_id": 3413, "stars": [], "topic_id": 9139, "date_created": 1298667709.7264371, "message": "Just a place to briefly post about what you're working on and who you are looking for to help with it.", "group_id": 4984, "id": 211253}, {"user_id": 11589, "stars": [], "topic_id": 9139, "date_created": 1298668085.5810349, "message": "Cheers. A web tool to negotiate lower prices for the things you purchase online. I'm looking for someone to build/program the back-end for something like this.", "group_id": 4984, "id": 211315}, {"user_id": 8668, "stars": [], "topic_id": 9139, "date_created": 1298691800.6571071, "message": "Maybe you could tell us a little more about where you are with it?", "group_id": 4984, "id": 212711}, {"user_id": 3595, "stars": [], "topic_id": 9139, "date_created": 1298692175.709918, "message": "I", "group_id": 4984, "id": 212731}, {"user_id": 8668, "stars": [], "topic_id": 9139, "date_created": 1298691853.6605461, "message": "Are there any other skill gaps you need to fill to move ahead with this? What skills do you have on board already?", "group_id": 4984, "id": 212714}, {"user_id": 3595, "stars": [], "topic_id": 9139, "date_created": 1298692173.900444, "message": "I'm working on an online trading card game where players are scientists and inventors instead of knights and dragons.", "group_id": 4984, "id": 212730}, {"user_id": 3595, "stars": [], "topic_id": 9139, "date_created": 1298692320.2521689, "message": "I've coded a game engine and part of the website.  I need graphic design and illustration skills", "group_id": 4984, "id": 212736}, {"user_id": 15255, "stars": [], "topic_id": 9139, "date_created": 1298715286.703162, "message": "Hi pepdek, in which language are you working with? Do you already have a pricing model? I was wondering about something similar.", "group_id": 4984, "id": 213623}, {"user_id": 6310, "stars": [], "topic_id": 9139, "date_created": 1298734794.3412631, "message": "I'm working on the relaunch of androidsnippets.com, and could need feedback and help from people with design skills! (The preview is here: http://android-snippets.appspot.com) Anyone interested, please get in touch! :)", "group_id": 4984, "id": 214445}, {"user_id": 11589, "stars": [], "topic_id": 9139, "date_created": 1298754064.4352889, "message": "@zoFrex Here is where i'm at: I've got the space nailed down. I know there is an opportunity to shake up e-commerce and disrupt the selling/buying of items at fixed prices. Here are the skill gaps missing from my team: I need a programmer. I've talked to a few advisors of mine and they suggest looking into Rails. I know this can be a powerful tool but do not feel my time is best spent learning it. Here is what I've got so far: I do the selling/biz development (2-3 years of domain experience). I've got a friend/web designer who I've worked with in the past to the to front end design and U/I (10 years experience).", "group_id": 4984, "id": 215620}, {"user_id": 11589, "stars": [], "topic_id": 9139, "date_created": 1298754479.3594601, "message": "@viandante I'm looking into Rails but I'm a business guy. My time would be better spent elsewhere. As far as pricing models; I see so many options could fit. Free to the buyer & charge the seller a fixed rate or dollar amount per purchase. Vise-versa. Or provide the platform and charge per store. Add a gaming layer and virtual currency. White-label it and charge for per product line/e-commerce website. Its too early to settle on a model. I just need to build it first & worry about the pricing later.", "group_id": 4984, "id": 215662}, {"user_id": 15255, "stars": [], "topic_id": 9139, "date_created": 1298840312.7011311, "message": "@pepdek, have you had a look into spree? I didn't manage to make it work, it looks like this could be a solution for you.", "group_id": 4984, "id": 220681}, {"user_id": 3413, "stars": [], "topic_id": 9139, "date_created": 1298928476.9663169, "message": "I've been working on an enterprise software for the restaurant delivery service industry. It lets companies manage all of their orders, drivers, routing, customer contacts, online/offline ordering, payment transactions, etc. Quite the big endeavor, and it's going on 6 months of development now.", "group_id": 4984, "id": 229672}, {"user_id": 2067, "stars": [], "topic_id": 9139, "date_created": 1299884001.137677, "message": "I'm working on thelbb.com, a college only networking website. Learn more: https://convore.com/hacker-news/developer-wanted-for-founding-team/", "group_id": 4984, "id": 328376}]