[{"user_id": 15369, "stars": [], "topic_id": 10480, "date_created": 1299151835.579483, "message": "My name is Michael Rose (http://www.twitter.com/michaelrose) and I've been inspired to create a Content Strategy Convore after an amazing Brighton Content Strategy Meetup last night -- (http://j.mp/BrightonContentStrategyTwitterList) last night. \n\nTwitter is great for connecting and a forum/wiki seems like overkill — a Convore feels like a great middle ground, it feels like Twitter but has the ongoing feel of a forum. I'm hoping people will join and add great links to Checklists, Templates, Best Blogs, Best Practice, etc. etc.", "group_id": 1409, "id": 259634}, {"user_id": 27898, "stars": [], "topic_id": 10480, "date_created": 1302188438.2437601, "message": "My name is digby - www.twitter.com/dogby52\n\nThis 'convore' looks pretty cool, haven't seen one before, it does look like the only big thing missing is a docs thing under recent topics on the left. \n\nGood work.\n\n(even if there are only 3 people using it)", "group_id": 1409, "id": 576091}, {"user_id": 27900, "stars": [], "topic_id": 10480, "date_created": 1302189558.18402, "message": "Hello, I'm Chris Harding and I'm a Content Manager who does all like copywritin and stuffs.\nYou can find me at the Brighton Content Strategy meetings, or on Twitter @The_Kraken (as I have a healthy interest in Cephalopoda).", "group_id": 1409, "id": 576304}, {"user_id": 28744, "stars": [], "topic_id": 10480, "date_created": 1302533738.3524621, "message": "What have I learnt about Convore so far? Be careful when you press Enter while posting to a a thread. Anyway, thanks for setting this up Michael, looks very handy.", "group_id": 1409, "id": 624844}, {"user_id": 28744, "stars": [], "topic_id": 10480, "date_created": 1302533567.167793, "message": "My name is Charlie Peverett, @cpev on Twitter, and I work as a content strategist at iCrossing.", "group_id": 1409, "id": 624813}, {"user_id": 28752, "stars": [], "topic_id": 10480, "date_created": 1304501115.093677, "message": "Raul here: best web copy is less copy.", "group_id": 1409, "id": 911245}, {"user_id": 29303, "stars": [], "topic_id": 10480, "date_created": 1304589137.3284709, "message": "Hello I'm Tamsin Hemingray but also Tamsin Bishton (it's complicated) and I'm content director at iCrossing UK. I'm @tamsinbishton on Twitter (but be warned I do tweet a load of not very relevant to content strategy stuff). I haven't made it to a Brighton CS meetup yet but hoping to in June. Been doing online content stuff since about 1996 and still haven't got bored yet. Not so keen on the marketing but what are you gonna do? :-)", "group_id": 1409, "id": 927192}]