[{"user_id": 7664, "stars": [], "topic_id": 43273, "date_created": 1312438239.3444159, "message": "I'm working on a short story about a character who is a perfectionist, and it's ruined his life. \r\n\r\nSo, in general terms, Problem = Perfectionism.", "group_id": 2515, "id": 1791336}, {"user_id": 7664, "stars": [], "topic_id": 43273, "date_created": 1312438350.3131721, "message": "I thought, hey, I bet \"Accurate\" or \"Non-accurate\" is going to be his Dramatica Problem.\r\n\r\nOr, his symptom...\r\n\r\nI have trouble predicting where something is going to go -- Problem or Symptom -- when I'm beginning to brainstorm an idea. \r\n\r\nAre there questions you all ask yourselves about your MC to suss that kind of thing out, or am I on my own here?", "group_id": 2515, "id": 1791340}, {"user_id": 37586, "stars": [], "topic_id": 43273, "date_created": 1312443116.38661, "message": "@MikeDerk  Did you read Jim Hulls reply to my inquiry about his process in the BttF thread about 14 hours  ago at the time of this message?  In that post he states when one of the throughline sings to him (my words) He picks a concern and checks that dynamic in the other throughlines, and so on,\n TO QUOTE JIM HULL, \"Knowing that Marty was a Steadfast character I knew this connection implied that Control and Uncontrolled would be the Symptom and Response. The only question was determining which was which. I felt like Marty was more driven by Hinder then Help - people get in his way and it really raises the hairs on his neck! Selecting that picked Avoidance for OS and IC Problem and I loved that. The Pursuit Solution works particularly well, especially when you think of them heading to the future in the end.\"  \n\nAs for me I was making the mistake of jumping right to the goal and would flounder all over the place.  I love the DUG podcasts.  I learn something new and valuable every time I listen.  Even if the story is not fresh in my mind or I haven't seen it yet.  I have been using the 12 questions.  I think I am going to start skipping 'start' and 'stop' and 'option' v. 'time' lock. Unless I am in love with some idea that determines those.  It's late. I'm rambling...", "group_id": 2515, "id": 1791547}, {"user_id": 37586, "stars": [], "topic_id": 43273, "date_created": 1312443216.907598, "message": "Don't you want to pick a throughline for the perfectionist character like Fixed Attitude first? Are short stories different?", "group_id": 2515, "id": 1791552}, {"user_id": 37586, "stars": [], "topic_id": 43273, "date_created": 1312443726.8248291, "message": "What about Reappraisal as the perfectionists issue?  As a perfectionist he/she is constantly reappraising to make sure it's perfect.  (OCD)  and the character problem could be non-acceptance with acceptance as the solution and the symptom would be  deduction or induction. Certainty is the problem or all the possibilities are the problem.", "group_id": 2515, "id": 1791566}, {"user_id": 33839, "stars": [], "topic_id": 43273, "date_created": 1312467893.400336, "message": "If I were writing that type of story as you described, the first things I would be doing while brainstorming is asking HOW did it ruin his life.  I think you have to define that part because that clarifies the problem.  \n\nIt's kind of like doing a causal analysis where you take an event and analyze it while being careful to distinguish between problems and symptoms; a symptom of high fever, for instance, could cause a person to take any number of actions - none of which may solve the actual problem. \n\nSo, perhaps thinking of it in that light may help:  a problem usually has one definite solution.  A symptom may have many.  The pairing of symptoms together usually helps clarify what the actual problem is.", "group_id": 2515, "id": 1793061}, {"user_id": 38285, "stars": [], "topic_id": 43273, "date_created": 1312477906.153939, "message": "I've been writing a story where the Impact Character is a perfectionist and it's ruining his life. His throughline is Fixed Attitude and the problem is Control. He's stoic and very systematic. In his introduction, he stands in front of a mirror, glassy eyed, focused on his own reflection. The funny thing was that I didn't choose the problem of Control myself. Dramatica predicted it based on my input. What's even funnier, I started this story before discovering Dramatica. I knew nothing about Impact Characters or Throughlines. I just felt that my Main Character, who was in a sticky situation, needed a relationship with this perfectionist.", "group_id": 2515, "id": 1794705}, {"user_id": 7664, "stars": [], "topic_id": 43273, "date_created": 1312571149.933449, "message": "Thanks everyone.", "group_id": 2515, "id": 1804454}]