[{"user_id": 7380, "stars": [], "topic_id": 11474, "date_created": 1299583179.490581, "message": "I've been making an app and have found some of the feedback to be a bit frustrating.  Here is a summary of the more annoying parts:  http://www.youtube.com/watch?v=2WdW1qOF9S4&feature=channel_video_title", "group_id": 95, "id": 295555}, {"user_id": 671, "stars": [], "topic_id": 11474, "date_created": 1299589597.2481439, "message": "cute.  I think many of us have faced this at one point or another.", "group_id": 95, "id": 295786}, {"user_id": 15929, "stars": [], "topic_id": 11474, "date_created": 1299593883.811286, "message": "or it's just a feedback from someone who doesn't have the heart to tell you that it sucked?", "group_id": 95, "id": 296205}, {"user_id": 15929, "stars": [], "topic_id": 11474, "date_created": 1299593852.616811, "message": "unless it followed by a 'but', 'however', or 'what if...', I don't think \"I like your idea\" counts as a feedback...", "group_id": 95, "id": 296203}, {"user_id": 8501, "stars": [], "topic_id": 11474, "date_created": 1299595697.8745041, "message": "That was both depressing and therapeutic. I clicked 'About' on Holono and think I found your inspiration... Stephanie: \"I love the idea of Holono! Brilliant!\" You: \"Thanks! You should try it out!\" I disagree with the premise of your avatar's objection. Your target audience is practically everyone. The problem is you've created the 10 millionth social network and we are all jaded. To build traction in this space requires a monumentally mind-blowing visual argument and orgasmic user experience. (Well maybe just shy of that.) Like many social networks, Holono has huge potential -- if you're willing to spend hours and hours in Firebug tweaking pixels and refining the message. Your HeelBlazer project image is an absolute riot! But I wouldn't know that if I hadn't clicked on the cropped picture. To garner the interest of crowds I think you have to curate just a bit more these details of the user experience. I'm rooting for you. Good luck on Holono.", "group_id": 95, "id": 296465}]