[{"user_id": 37741, "stars": [], "topic_id": 42238, "date_created": 1311025950.4566741, "message": "Que opinan banda: ¿Existe en mexico la cultura \"co-working\"? ¿Es posible que estas comunidades virtuales sustituyan el intercambio de experiencia que sucederia en los espacios de co-working, o aun existe un valor añadido de estar en el mismo espacio fisico con gente con otras experiencias?", "group_id": 965, "id": 1666981}, {"user_id": 6541, "stars": [], "topic_id": 42238, "date_created": 1311033102.60305, "message": "Prefiero los hackerspaces que los coworkspaces me parece el ambiente menos formal en un hackerspace y más aventurero que los co-workspaces. Dudo que el valor añadido que comentas se pierda con el uso de comunidades virtuales, de hecho hay retroalimentacion de las 2 formas y se complementan.", "group_id": 965, "id": 1667584}, {"user_id": 12133, "stars": [], "topic_id": 42238, "date_created": 1311088685.396832, "message": "listos ? claro esta el telmexhub hackerroom en la ciudad de mexico y otros en gdl", "group_id": 965, "id": 1671818}, {"user_id": 2946, "stars": [], "topic_id": 42238, "date_created": 1311142793.4858689, "message": "Me gusta la idea en concepto. me gusta mucho. Por otro lado, amo trabajar solo.", "group_id": 965, "id": 1679048}, {"user_id": 37741, "stars": [], "topic_id": 42238, "date_created": 1311180518.6097879, "message": "\nYo diria que el Telmexhub no es un buen ejemplo de un espacio de coworking, es mas bien un Foro de technologia y educacion extracurricular.  Yo mas bien me pregunto si hay ventures y negocios que aprovecharian este tipo de espacios_", "group_id": 965, "id": 1682425}, {"user_id": 29472, "stars": [], "topic_id": 42238, "date_created": 1311202541.936511, "message": "un hackerspace es vital!!!!! si se enviara la convocatoria o invitaciones especiales a todos los developers / creativos / g33ks que se pueda de diversas industrias se podría generar interesantes proyectos productos del ocio colectivo.", "group_id": 965, "id": 1685492}, {"user_id": 6541, "stars": [], "topic_id": 42238, "date_created": 1311211539.7447109, "message": "@psyrax eso no es necesario, quien quiera lo busca y lo hace", "group_id": 965, "id": 1686346}, {"user_id": 6541, "stars": [], "topic_id": 42238, "date_created": 1311219500.1008201, "message": "@cesarsalazar eso pasa en diferentes entornos, por ejemplo en el software libre Ahi estan las personas que les interesa aportar por más evangelizacion se haga no hay garantia de que los evangelizados aporten. Lo veo igual aqui, por más que se pongan las herramientas y se les insista a los programadores/diseñadores/negocios que saquen proyectos si no tienen las ganas no se puede hacer mucho.", "group_id": 965, "id": 1686998}, {"user_id": 24160, "stars": [], "topic_id": 42238, "date_created": 1311218461.409219, "message": "@jyr Estoy en desacuerdo. Hay que salir a buscar a la gente, como con cualquier iniciativa que queramos promover.", "group_id": 965, "id": 1686944}, {"user_id": 29866, "stars": [], "topic_id": 42238, "date_created": 1311220462.1641021, "message": "@cesarsalazar Totalmente de acuerdo, no hay \"empresas\" de un solo emprendedor, hay \"proyectos\" de un solo emprendedor,  pero deberiamos de dejar de llamarlos proyectos para comenzar a pensar en empresas y estas necesitan de gente y creo que los coworkspaces no son \"vitales\" para tal finalidad, pero si una interesante iniciativa que puede ayudarnos a conocer gente con la que se comparte al menos un interés, ser \"emprededor\" en cualquier rama.  @jyr La gente que le interesa esto, busca estos lugares a quienes no, no te los vas a encontrar allí. Yo \"desafortunadamente\" estoy en Cancún y aquí aun no hay este tipo de iniciativas, sino me gustaría poder participar.", "group_id": 965, "id": 1687061}, {"user_id": 6541, "stars": [], "topic_id": 42238, "date_created": 1311221050.8577459, "message": "@josuegio Depende de la empresa/proyecto al principio lo puedes sacar remotamente pero llegara el momento que hasta tendras que ir te a vivir a un hackerspace como el HackerHub!", "group_id": 965, "id": 1687095}, {"user_id": 29866, "stars": [], "topic_id": 42238, "date_created": 1311221151.797755, "message": "@jyr Si, antes de que se convierta en una empresa es posible, pero para serlo inclusive en México si quieres conformar una sociedad, persona moral, requieres de más de una persona. :)", "group_id": 965, "id": 1687105}, {"user_id": 29472, "stars": [], "topic_id": 42238, "date_created": 1311263640.396991, "message": "@jyr Aun así el hackerspace tiene una gran ventaja que me haría entrar a uno. Hardware, mucho. No todos por espacio y presupuesto podemos tener un gran taller.", "group_id": 965, "id": 1690531}]