[{"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299662887.5204239, "message": "@OoTheNigerian I must confess I would have reservations with working with a Nigerian co-founder on a project, for example", "group_id": 95, "id": 302964}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663245.851671, "message": "but there were a lot of elements that seemed to be culturally ingrained and not very nice... sexism, bribery, an attitude that wealth gotten through hard work isn't as good as that easily gained", "group_id": 95, "id": 302998}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299662821.9397299, "message": "Don't most Nigerian 419 scam emails originate from Norway or somewhere weird like that?", "group_id": 95, "id": 302958}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663110.9848959, "message": "@OoTheNigerian I used to work for Halliburton on the Bonny Island project", "group_id": 95, "id": 302981}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663684.1080229, "message": "I am not an oil man! 1) I left, 2) it was gas :P This is a difficult issue because I want to judge everyone as individuals but at the same time, sometimes generalisations are a useful shortcut - for example, PayPal probably are reducing fraud by blocking Nigeria. That puts everyone in an uncomfortable position, really - either ignore an oppurtunity to protect your users, or be racist. Which is \"right\"?", "group_id": 95, "id": 303073}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663920.2152979, "message": "@OoTheNigerian I'll check it out later (at work). What's the skinny on bribery and corruption these days?", "group_id": 95, "id": 303104}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663978.4726441, "message": "I will hold  you to it.", "group_id": 95, "id": 303112}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299662580.649879, "message": "http://news.ycombinator.com/item?id=2304335", "group_id": 95, "id": 302921}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663293.2187009, "message": "I'd love to hear your perspective on those issues though", "group_id": 95, "id": 303001}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663951.893115, "message": "same like in any country.", "group_id": 95, "id": 303108}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663134.1778021, "message": "probably not the healthiest way to learn about Nigeria", "group_id": 95, "id": 302986}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299662957.6270871, "message": "sad you feel that way.", "group_id": 95, "id": 302970}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663089.658936, "message": "@ZoFreX why if I may ask?", "group_id": 95, "id": 302977}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299663259.6041639, "message": "And from a co-founder perspective, the phones were out all the damn time! :P", "group_id": 95, "id": 302999}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663448.0818851, "message": "@ZoFreX you are an oil man :), The oil story is like the slave story. We destroy ourselves with the help of the 'white man'", "group_id": 95, "id": 303043}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663821.5171871, "message": "you see. i think this video will give you the perfect answer http://www.youtube.com/watch?v=D9Ihs241zeg", "group_id": 95, "id": 303093}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663971.4144249, "message": "Do try to check out that video. it articulates it so well.", "group_id": 95, "id": 303111}, {"user_id": 737, "stars": [], "topic_id": 11660, "date_created": 1299663984.588007, "message": "I have to run now bro!", "group_id": 95, "id": 303114}, {"user_id": 719, "stars": [{"date_created": 1299680998.1446609, "user_id": 831}], "topic_id": 11660, "date_created": 1299676737.257745, "message": "While we can complain and fuss about incidents like this one, I doubt there's much to gain. I don't expect there'll be a significant change in public opinion till there is a sufficient number of  positive stories to counterbalance the negativity.\n\nLess than a decade ago, when most people thought about \"China\", the first thought that popped into their heads was probably \"cheap counterfeit goods\". It's clear that things have changed since then. \n\nUntil we have a balance of positive stories, I fear we're stuck with this. Time to get moving and add to the positive stories about Nigerians.", "group_id": 95, "id": 304259}, {"user_id": 719, "stars": [], "topic_id": 11660, "date_created": 1299676957.9484379, "message": "Those are \"my\" thoughts. :)", "group_id": 95, "id": 304292}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299681444.9240291, "message": "What I consider racism is rarely stereotypes, but rather someone who is not willing to reconsider stereotypes when dealing with an individual.  As such, I think @ZoFreX's attitude a bit more dangerous than that of the original joker, because he has indicated how his stereotype might affect dealing with individuals.  OTOH, @ZoFreX is here, engaged int he conversation, and so I guess I don't believe him :)  I do believe that he has an open mind, and if he had to deal with a Nigerian in business, the stereotypes might come to his mind at first, but he would eventually rise to see the individual.", "group_id": 95, "id": 304926}, {"user_id": 831, "stars": [{"date_created": 1299681643.133749, "user_id": 719}], "topic_id": 11660, "date_created": 1299681206.442862, "message": "@micrypt I agree, but I must say I'd put it even more strongly.  I'm the first person in the room ever to crack a Nigerian scammer joke.  My philosophy has always been that intent is paramount.  The comment ultimately behind this thread does not seem to me to have bene malicious against Nigerians. It was just an off-hand raising of a stereotype.  I have no problem with stereotypes.  We Nigerians have plenty of our own stereotypes about outsiders, for example.  It's just how people work.", "group_id": 95, "id": 304888}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299682112.038981, "message": "But I'll also speak for myself.  I've founded 2 companies in the U.S. Fourthought in 1997 and Zepheira in 2006. I'm no fly-by-night entrepreneur. I've worked with good partners in both cases, and worked hard to make those partnerships work out. I'm still very close friends with all my Fourthought co-founders (there were four of us) even though after 9 years I decided my ambitions were taking me elsewhere. That friendship endures because despite any disputes, I never violated their trust.  At the same time, I'm very ambitions. I only graduated with my B.Sc. in Engineering in 1994, but I had no intention of working for someone else very long.", "group_id": 95, "id": 305085}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299681539.4523959, "message": "My very, very non-P.C. essay about intent being the utter test when dealing with stereotypes, especially in Humor: \"Tongue of Warcraft, Part One—Taboo Words\" http://www.thenervousbreakdown.com/uogbuji/2009/06/tongue-of-warcraft-part-one%E2%80%94taboo-words/", "group_id": 95, "id": 304949}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299681559.6661561, "message": "But I think I must give warning again that it might be a pretty raw read ;)", "group_id": 95, "id": 304955}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299681779.915195, "message": "@ZoFreX I will just say to you that my own stereotype of Nigerians is that they are very ambitious, and in some that does manifest in a get-rich-quick attitude, but in many that manifests in hard work and eagerness for self-improvement.  I've known many dishonest Nigerians, but for each of those, I know ten Nigerians who have worked their way into professional excellence in engineering, medicine, law, arts & culture, and yes, even (honest) business.", "group_id": 95, "id": 305009}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299681885.34092, "message": "Some sectors certainly attract more of the unscrupulous.  If you lived on a country that was unfortunately swimming in crude oil (our damned curse, I tell you.  I wish we didn't have a drop of the stuff) and you had a mind to get rich quickly, a natural gas project in Bonny would probably be your first destination.  Thus I suspect you've seen just waves and waves of the worst of us, so I can sympathize.", "group_id": 95, "id": 305046}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299709561.5390129, "message": "@uche I think you should read my comment on the HN thread", "group_id": 95, "id": 309024}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299709658.5344541, "message": "also, my image of Nigerians is mostly based on companies we contracted out there - we had lots of trouble with the workers no matter what race they were", "group_id": 95, "id": 309031}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299709796.8222229, "message": "I try hard to judge everyone as an individual, but when you're dealing with lots of people, and statistical probabilities, it's hard to ignore that *some* stereotypes can help you reach a judgement - /on average/. But stereotypes can be very dangerous if applied incorrectly, such as to individuals.", "group_id": 95, "id": 309052}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299709907.8296831, "message": "I agree with some of the posters in the HN thread, that the best way to transform people's values is to build a new reputation and get it out there. If Nigerians are a hard-working people, then get that in people's faces. I suspect many, such as @OoTheNigerian hesitate to declare their nationality due to how people will perceive them, so perhaps there are many successful awesome Nigerians out there that aren't \"declaring\"", "group_id": 95, "id": 309066}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299736146.005121, "message": "@ZoFreX based on your response I'm, not sure you gathered the nuance of my comment.  But then again that's OK.", "group_id": 95, "id": 311268}, {"user_id": 831, "stars": [], "topic_id": 11660, "date_created": 1299736357.202373, "message": "I'm not at all worried about the reputation of Nigerians.  We seem to do very well (at least abroad) regardless of all that.  So I'm not looking for any grand solutions to stereotypes.  Everyone gets stereotyped, and we just muddle through and sort it out.  BTW It's very strange to hear you to say that someone with a handle of \"@OoTheNigerian\" is hesitating to declare their nationality.  For my part I'm the person who can rarely get through 10 sentences upon meeting someone new without mentioning I'm Nigerian, so yeah, I guess we don't see the same trend there.  But again, that's OK.", "group_id": 95, "id": 311290}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299798952.8281081, "message": "Oh, I  said that because I read some of his blog, and he talks about that there", "group_id": 95, "id": 317497}, {"user_id": 719, "stars": [], "topic_id": 11660, "date_created": 1299800046.7887909, "message": "@ZoFreX That's interesting. I've found the tech industry comparatively open-minded (regarding stereotypes) in contrast to what my peers say about other fields.\n\nPerhaps I don't stick my head out enough to bump into bigotry...", "group_id": 95, "id": 317602}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299847468.316843, "message": "I would say the opposite, many people I've met in tech are extremely close-minded", "group_id": 95, "id": 321654}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299847479.890485, "message": "Would we still be arguing over PHP and Ruby on Rails if they weren't", "group_id": 95, "id": 321656}, {"user_id": 719, "stars": [], "topic_id": 11660, "date_created": 1299849513.1632271, "message": "I suspect we're too busy arguing over PHP & Ruby on Rails to care about racial/national stereotypes. :P", "group_id": 95, "id": 321990}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299852354.1058891, "message": "I think there's a fair bit of stereotyping that goes on... I could mention some fairly notable hackers that continually denigrate jews, for example, and dare I mention sexism? :P maybe there's less outright racism but I don't think techies are any more open minded overall, to be honest", "group_id": 95, "id": 322309}, {"user_id": 8327, "stars": [], "topic_id": 11660, "date_created": 1299876272.044698, "message": "Seems to me the majority of techies have strong opinions (on a great many things, languages and stereotypes included), but are often very open to be reasoned with, if you can show them why they're wrong, or even better, why you're right, relatively few attempt to fly in the face of well reasoned logic backed by some modicum of evidence", "group_id": 95, "id": 326820}, {"user_id": 8668, "stars": [], "topic_id": 11660, "date_created": 1299889393.719569, "message": "well, there is a sample bias... I'm young, most developers I've met until now were young and hot-headed!", "group_id": 95, "id": 329038}, {"user_id": 15929, "stars": [], "topic_id": 11660, "date_created": 1299892228.9484129, "message": "developers tend to get defensive when their ideals are attacked, one of the best case for this is wordpress vs some premium theme provider on GPL. the way Matt kept his calm was amazing. if it was me, I'd smack the guy", "group_id": 95, "id": 329340}, {"user_id": 20138, "stars": [], "topic_id": 11660, "date_created": 1299992978.2137921, "message": "Deal with it.", "group_id": 95, "id": 339000}]