[{"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305002143.87396, "message": "Hi everyone, and welcome to the Teh Pwn Gaming community Convore group! It may be tempting to jump right in, but please take a moment to familiarize yourself with the Community Rules and Guidelines below.", "group_id": 857, "id": 984347}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305002571.4082611, "message": "INFRACTIONS will be issued for actions listed below. A post that results in an infraction will be deleted, and you will receive a private message informing you of the infraction and what you did to earn it. Each infraction will last for 60 days. If at any time your account has more than three infractions, you will be suspended until your infraction total becomes less than three.", "group_id": 857, "id": 984441}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305003605.6760321, "message": "1. Spam - A spam post adds nothing to the conversation. Such a post will only incur an infraction if one of the following is true: (a.) The post is in the company of multiple spam posts by the same author. (b.) The post represents willful intent to act as a nuisance to the community.", "group_id": 857, "id": 984859}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305003617.0022659, "message": "2. Harassment - A harassing post may consits of, but isn't limited to, sexism, racism, libelous or derogatory statements, and other forms of ill-mannered text. Infractions may also be issued for harassing content in private messages if a complaint is issued to a moderator. If you wouldn't say it to someone sitting across from you, don't say it here.", "group_id": 857, "id": 984868}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305009381.9528749, "message": "BANNINGS will occur very rarely, if at all. They will be issued only under severe circumstances involving a user (a.) with multiple suspensions, (b.) who has tried to evade suspensions or banning through use of another account, or (c.) who has scammed, hurt, cheated, or otherwise harmed another member of this community.", "group_id": 857, "id": 985935}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305008574.6029961, "message": "3. Hotlinking - A hotlink is a link directly to an image hosted by a site other than www.tehpwngaming.com or by a dedicated image-sharing website (such as imgur.com). Hotlinking is bad practice because it leeches bandwidth from other sites without providing traffic. Please re-host images or link to the original article.", "group_id": 857, "id": 985832}, {"user_id": 3963, "stars": [], "topic_id": 32748, "date_created": 1305009375.7163539, "message": "AUTOMATIC SUSPENSIONS will be issued for the following actions: Posting of malicious links (no shock sites, no malicious code), advertising, posting or linking inappropriate material, making direct threats, illegal activity (keep filesharing elsewhere), and posting for banned or suspended members. Treat automatic suspensions as though you had received three infractions all at once.", "group_id": 857, "id": 985933}]