[{"user_id": 42630, "stars": [], "topic_id": 48259, "date_created": 1322626546.892118, "message": "Okay who has their new copy?  (strokes my book cover and breathes in the new page/print smell)  I am so excited (claps like a little girl)", "group_id": 11977, "id": 2669522}, {"user_id": 42833, "stars": [], "topic_id": 48259, "date_created": 1322649953.9683011, "message": "I'm waiting for the big guy in red... I've spent too much lately and am it'll be part of my Christmas... but I can't wait!", "group_id": 11977, "id": 2670745}, {"user_id": 43766, "stars": [], "topic_id": 48259, "date_created": 1322666638.70051, "message": "@KarenneLyn I had pre-ordered a copy of Lindsay’s new cookbook over 2 months back, but walmart hadn’t released their supply early like amazon. A few days ago Lindsay contacted walmart about pushing their release date sooner which did take place! Only problem now I had to cancel out my previous order and re-order in order to get my copy sooner. So now I am waiting on my refund which I should have gotten by now in order to place a new order. *sigh*", "group_id": 11977, "id": 2671848}, {"user_id": 43766, "stars": [], "topic_id": 48259, "date_created": 1322666746.7418759, "message": "@scrappyshel Receiving Lindsay’s cookbook is a great x-mas gift! Like yourself I can’t wait to get my hands on a copy!", "group_id": 11977, "id": 2671852}, {"user_id": 42615, "stars": [], "topic_id": 48259, "date_created": 1322673385.883033, "message": "I already received it, but still haven't make a recipe. It's in my list for this week though...I'm dying to try the rum cake!", "group_id": 11977, "id": 2672316}, {"user_id": 44185, "stars": [], "topic_id": 48259, "date_created": 1323358108.9257081, "message": "I have the new copy and I have made lots of meals from it already", "group_id": 11977, "id": 2723313}, {"user_id": 42791, "stars": [], "topic_id": 48259, "date_created": 1323618690.670435, "message": "I have the new book.  I have made the Sweet Potato Dal twice.  The second time I put in a little bit too much red pepper for my husband's taste.  This will be a repeat meal for us, probably at least once a month for the two of us.  I can also make this for myself on some of the occasions when I cook a meal with meat for my husband.  He's 100% vegan up through lunch, and 50% vegan at supper time.  He is actually being very nice about eating new things.", "group_id": 11977, "id": 2739501}]