[{"user_id": 11626, "stars": [], "topic_id": 42442, "date_created": 1311276457.0391431, "message": "Legions Of Biometric Face Scanning Cameras To Be Installed At Heathrow Airport Within Weeks\r\nPrisonplanet.com \r\nJuly 21, 2011\r\n\r\n[img]http://infowars.net/pictures/oct08/201008scanner.jpg[/img]\r\n\r\nIn addition to full body scanners and enhanced grope downs, the latest big brother nightmare to hit airports comes in the form of biometric facial recognition cameras, set to be rolled out in terminals at London’s Heathrow Airport in September.\r\n\r\nAfter an eighteen month trial, the Aurora Imaging Recognition (AIR) biometric system with enhanced image infrared cameras has been approved for use in the airport at terminals 1 and 5, reports the London Evening Standard.\r\n\r\nHeathrow Skyport describes the process that travelers will have to undergo after the system is adopted:\r\n\r\n[quote]    Passengers are enrolled into the system and the biometric photo is linked with the boarding pass number on entry into the common user lounge, otherwise known as the departure lounge, at the first security check point.\r\n\r\n    Each passenger is then verified against their previous enrolment when the airside area before heading towards their departure gate.\r\n\r\n    It has the ability to identify people from a distance of 40cm to one metre, meaning that personal space is not imposed upon, and has been designed for people of different heights, including wheelchair users and children.[/quote]\r\n\r\nTests conducted by the independent airport operator BAA and the UK Border Agency found that each face scan takes approximately 4-5 seconds.\r\n\r\nThere is no indication that anyone will be allowed to opt out of the procedure, meaning that for all travelers it will be compulsory to have a face scan and be added to the database in order to fly out of the terminal.\r\n\r\nThe justification for the system is to prevent passengers swapping tickets in the departure lounge, potentially allowing an international passenger to fly domestically, thus bypassing immigration checks.\r\n\r\nThe operators also say that the system will “help identify potential terrorists”, however it is not clear how this is possible given that they also claim that all data collected will be stored for up to 24 hours and then destroyed.\r\n\r\nIt is exactly this kind of loose justification and the bandying about of the word “terrorism” to sell nothing more than pure security theatre that has led to such a rampant backlash against the TSA takeover in the US.\r\n\r\nThe British government has been moving toward the use of such systems for some time. Three years ago we reported that passport control officers at UK airports were to be phased out in favour of the biometric cameras.\r\n\r\nIt was then revealed two months later that Interpol, the International Criminal Police Organization, wishes to integrate a facial database with its already existing fingerprint and DNA databases.\r\n\r\nThe organization, is planning to expand its role into the mass screening of passengers moving around the world by creating a face recognition database to catch wanted suspects, reported the London Guardian at the time.\r\n\r\nSuch a database will hold the records of every citizen who has ever traveled in and out of virtually every country in the world, representing intelligence agency style bulk interception of information.\r\n\r\nWe have previously noted that the vast array of databases currently being employed by intelligence agencies, government and law enforcement agencies worldwide were designed to be linked together in a system which will tie in the management and control of all facets of life for citizens to one central hub.\r\n\r\n2008 saw the announcement of a vast intelligence program to establish a global biometric database known as “Server in the Sky” that will collate and provide an ” International Information Consortium” with access to the biometric measurements and personal information of citizens across the globe in the name of fighting the “war on terror”.\r\n\r\nAs reported by the London Guardian, the long term plan is being formulated by the FBI with the cooperation of the home offices and law enforcement agencies of American allies. The technology is being supplied by the US defense company Northrop Grumman.\r\n\r\nFurthermore, the use of such technology, as we have already seen, will not be limited to the passport control office.\r\n\r\nA 2007 British government report muted an extensive upgrade to cctv systems all across the country to incorporate facial scanning technology. The report suggested a central database of every camera and a network allowing access to it could be beneficial.\r\n\r\nIn the US there are several schemes that use Facial Recognition Technology in conjunction with Federal agencies, tying the technology to traditional documents such as drivers licenses, passports and credit cards.\r\n\r\nA biometric face recognition system has already been approved in China and is expected to be used at airports, customs entrances, banks, post offices, residential areas and other public places in the near future.\r\n\r\nOther proposals include placing the cameras in every seat on aircraft and installing software to try and automatically detect terrorists or other dangers caused by passengers.\r\n\r\nWe are assured that cigarette vending machines will employ the technology in order to enforce smoking laws. Similarly, supermarkets in the UK have already started trialing the technology with the justification being a crackdown on underage drinking.\r\n\r\nIn Japan facial scanning cameras are being installed in train and bus stations to replace tickets in a move to make the individual features of the face a “unique bar code” as part of an antiterrorism and anticrime initiative.\r\n\r\nPolice in Tokyo are also asking home and shop owners to mount the cameras outside their properties. “Police investigating an incident in the neighborhood would have access to these images.” according to reports.\r\n\r\nCell phones and computers are now also being produced with face scanning cameras, and even facebook has now integrated facial recognition software.\r\n\r\nThe prospect of the technology being so widely used was recently even critisized by Google Executive Chairman Eric Schmidt. A prominent Bilderberger and a man who once said that internet users should have no expectation of privacy, Schmidt said  “Show us 14 photos of yourself and we can identify who you are,” before warning governments of adopting any “foolish” legislation that would see facial recognition technology become a part of everyday life.\r\n\r\nhttp://www.infowars.com/legions-of-biometric-face-scanning-cameras-to-be-installed-at-heathrow-airport-within-weeks", "group_id": 3920, "id": 1691705}]