[{"user_id": 11626, "stars": [], "topic_id": 6730, "date_created": 1297914944.6261251, "message": "In an effort to streamline the design and build process for manufacturing military vehicles, the Defense Advanced Research Projects Agency (DARPA) is enlisting the “power of the crowd”. Through the Experimental Crowd-derived Combat-support Vehicle (XC2V) Design Challenge, which asks entrants to conceptualize a vehicle body design for combat reconnaissance and combat delivery & evacuation, the agency is looking to pick the brains of not only armed service members and engineers, but also members of the public and others that usually have no way to contribute to military design.\r\n\r\nThe challenge is being conducted with Local Motors, a Phoenix-based company that lets a community of car designers and engineers collaborate on designing cars, which can then be bought and built in regional micro-factories. Local Motors’ first “open source” production vehicle is the Rally Fighter, which was developed in 2008 using a crowd-sourced process. The XC2V design submissions must be based on the lightweight, tubular steel chassis and the General Motors LS3 V8 powertrain found in that vehicle.\r\n\r\nBudding designers must also devise a vehicle that meets two mission sets – combat delivery and evacuation and combat reconnaissance. To meet the requirements of combat delivery and evacuation missions, the judges will be looking for flexible vehicle body designs that allow supplies, people and equipment to be transported around a potentially hostile battlefield in the quickest and most efficient way possible.\r\n\r\nMeanwhile, in terms of combat reconnaissance, the vehicle must also be light and fast with the capability to mount sighting systems on the exterior and space inside to stow items such as camouflage and ammunition so it is easily accessible.\r\n\r\nTo help make the mission requirements easier to understand for those without a military background, DARPA has provided four different fictitious scenarios that illustrate how the vehicle might be used in different missions. DARPA and Local Motors will also provide feedback to competitors as submissions are received\r\n\r\nLocal Motors is accepting design submissions until March 3, 2011, which can be as simple as a sketch on a piece of paper or as detailed as a 3D CAD file. However, the submission must include a profile view, front/rear/Combo view and top (half or full) view.\r\n\r\nOnce the submissions are assessed, those that meet the competition requirements will be put to a vote on March 3 to 10, with anybody able to cast their vote on the designs, meaning that not only the designs, but the winner that is being crowd-derived.\r\n\r\nThird place will be awarded US$1,000, second place $1,500, while first place will take home $7,500 and will get to see their vision become a reality as soon as June when a fully functional concept vehicle based on the winning design is due to be ready.\r\n\r\nEntrants must be over 18 with full competition details and entry guidelines available at Local Motors’ website.\r\n\r\nhttp://www.gizmag.com/darpa-xc2v-design-challenge/17863/?utm_source=Gizmag+Subscribers&amp;utm_campaign=efcaf89bee-UA-2235360-4&amp;utm_medium=email", "group_id": 3920, "id": 129286}]