[{"user_id": 831, "stars": [], "topic_id": 7598, "date_created": 1298183477.5762501, "message": "Later today the boys take the short trip to Leyton to take on the Orient at Brisbane Road. They just need to work as hard as they did against Barca and put the game to bed early.  Of course easier said than done and it's only human to play down to the opposition.", "group_id": 858, "id": 152421}, {"user_id": 831, "stars": [], "topic_id": 7598, "date_created": 1298255553.7810581, "message": "I bet Almunia let that goal in because he knew it was the only way he was going to get another game for us this season (barring injury) ;)", "group_id": 858, "id": 155621}, {"user_id": 831, "stars": [], "topic_id": 7598, "date_created": 1298255520.081223, "message": "Oh yaaaay!  Another fixture!  Just what we had in mind!  *sigh*", "group_id": 858, "id": 155620}, {"user_id": 14322, "stars": [], "topic_id": 7598, "date_created": 1298279161.317502, "message": "Most probably. Still well done to Orient! They will go a good way to helping their future with the replay!", "group_id": 858, "id": 157283}, {"user_id": 831, "stars": [], "topic_id": 7598, "date_created": 1298311677.488188, "message": "Damien, strongly agree. I do honestly feel really good for them. The Olympic Stadium mess threatens their future, and this might go a little way to helping. One more game is a small price for Arsenal to pay to help a neighbor. And I'm not worried about fixture congestion because it's this same lot who will be playing the replay, and not the first team. If anything I expect Eboué to come in for Sagna and Diaby (if healthy) for Song.  Besides Squillaci, Denilson, Rosicky & Almunia who've had a miserable season, the rest have been able stand-ins for injured/suspended first-teamers and the group as a whole just needs to play themselves into form that befits their talent.  LO at The Emirates is another opportunity.", "group_id": 858, "id": 160311}, {"user_id": 14322, "stars": [], "topic_id": 7598, "date_created": 1298321527.6315131, "message": "Yeah. I feel the same. No reason the same team can't do the job back at home. Still, let's hope we have the Carling Cup under our belt by then.", "group_id": 858, "id": 168612}, {"user_id": 831, "stars": [], "topic_id": 7598, "date_created": 1298323092.4137859, "message": "No doubt! Plenty of bad blood between us and Brum Ceetuh after that bad-natured last league game. They will try to brutalize their way to the CC and we'll just have to stand up to them.", "group_id": 858, "id": 170043}, {"user_id": 3722, "stars": [], "topic_id": 7598, "date_created": 1298325972.1144249, "message": "If we win the tie then we get Man U next leg so I can only hope that the boys aren't looking beyond this game to that one. As you guys have said though let's take care of Sunday first.", "group_id": 858, "id": 172141}]