[{"user_id": 16761, "stars": [], "topic_id": 9792, "date_created": 1299014097.2341721, "message": "Cuales son las características del aprendizaje invisible?", "group_id": 5349, "id": 238751}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299079380.961127, "message": "Aprender lo que necesitas de forma rutinaria y de forma natural", "group_id": 5349, "id": 247717}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299080965.2174749, "message": "Cuando se aprende inconscientemente o por iniciativa propia se genera un aprendizaje significativo y es más fácil aprender", "group_id": 5349, "id": 248032}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299079227.4157169, "message": "No estoy muy de acuerdo, por lo que frente al conocimiento, las dudas es mejor escuchar las soluciones con un ente que lo explique de manera humana", "group_id": 5349, "id": 247686}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299078848.2945349, "message": "potencian educacion individual, es decir se aprende mas en lo que se quiere sin mucho efuerzo!", "group_id": 5349, "id": 247612}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299080632.688431, "message": "el aprendizage educativo, es el camino a una utilizacion adecuada de la tecnologia y su aprobechamiento, tiene unas limitantes pero todo esta en hacer un buen uso de los espacion y las herramientas. se dice que se aprende un poco mas en la casa, utilizando la web, que en aula de clases por la limitante", "group_id": 5349, "id": 247964}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299081013.2138879, "message": "estoy de acuerdo.", "group_id": 5349, "id": 248043}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299081941.9789441, "message": "¿cambia la forma de como se educa que se enseña o sigue igual?", "group_id": 5349, "id": 248216}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299081398.4037199, "message": "El obligar a una persona a obtener un conocimiento sobre algo que no quiere lo vuelve apático a ese tema y aunque le encuentre alguna utilidad siempre mostrará una actitud indiferente momento de trabajarlo. Eso se da mucho en la educación básica", "group_id": 5349, "id": 248104}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299080990.768615, "message": "se aprende sin notarlo o darse cuenta y el conocimiento adquirido de esta forma no se hace mecanico, es decir no se aprende obligado o por una nota se aprende por que se quiere y hay un interes de esta manera el conocimiento o lo aprendido se hace mas solido", "group_id": 5349, "id": 248035}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299081965.309459, "message": "No es que se deban quitar las materias que a uno no le gusta solo mostrarles la utilidad y abrir la curiosidad de cada estudiante", "group_id": 5349, "id": 248217}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299081968.6928191, "message": "¿Será mejor dejar el aprendizaje en  manos de cada quien y que cada persona trate de sacar a delante el potencial  de sus destrezas?", "group_id": 5349, "id": 248219}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299082190.9814911, "message": "Creo que hace falta una mayor competencia interdisciplinar de las tecnologías en todas las materias", "group_id": 5349, "id": 248269}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299081791.9032121, "message": "Pero la educación básica hace una base para lo que se viene en la foramción academica, ya sea matemáticas, física o química, aunque no deja de ser un tabu para muchas personas", "group_id": 5349, "id": 248191}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299082061.3574691, "message": "se tiene un concepto claro de lo que se debe enseñar para que las personas tengan una concptualizacion y vision del uso adecuado y los beneficios para su vida que le ofrece la tecnologia ...", "group_id": 5349, "id": 248240}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299082078.755842, "message": "En nuestro país nunca cambia nada así las teorías pedagógicas se cansen de demostrar que como as viene realizando uno es la mejor manera", "group_id": 5349, "id": 248244}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299082727.1684649, "message": "Igual.. en Colombia se vive en un constante cambio de las leyes educativas lo que desde una perspectiva academica no seria lo mejor, aunque estas leyes son creadas para \"mejorar la educación\"", "group_id": 5349, "id": 248330}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299082081.4796951, "message": "Es dificil sacar las destrezas de cada persona en un mundo tan distractor", "group_id": 5349, "id": 248246}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299082577.8604751, "message": "Nunca estara de sobra una persona que te indique cual es la mejor forma o si eso est abien o no pero esa persona solo debe ser una guia que te ayuda en tu aprendizaje no tiene qeu ser un amo el cual te ordena lo que debes hacer y como lo debes hacer", "group_id": 5349, "id": 248315}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299082176.305593, "message": "la primera educacion debe ser orientadora y facilitadora, no te puede calificar por lo que no sabes, debe encontrar tu potencial y orientarte en lo que cada uno es fuerte y eso debe estar evidenciado en la educacion superior!", "group_id": 5349, "id": 248264}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299082190.3940859, "message": "Lo mejor seria una educación formativa antes de la media vocacional (9 a 11) de ahi en adelanet puede que funcione lo de las destrezas", "group_id": 5349, "id": 248268}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299082305.7983241, "message": "no se puede obligar nunka a una persona a aprender lo que no se quiere o lo que no se considera para cada individuo nesesario, por eso la web es muy diversa y libre en el contenido y lo que cada uno usa de ella", "group_id": 5349, "id": 248287}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299082386.0216889, "message": "pero como toda información si no la sabes utilizar y aprender de ella es imposible crear una formacion a partir de eso \"nadie nace sabiedolo todo\"", "group_id": 5349, "id": 248296}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299082614.3145311, "message": "me parece bien y que tal .......hay que cambiar el concepto de educacion, donde hay que aprenderse todo lo que ya se tiene en la web, en lo que se tiene a la mano con las herramientas informaticas, que beneficios y problemas causa esto?", "group_id": 5349, "id": 248318}, {"user_id": 16383, "stars": [], "topic_id": 9792, "date_created": 1299083399.905555, "message": "Existen tabú en la mayoría de los docentes que piensan que aprender es cosa de niños, que el tener terminar una carrera hace que ya no debamos aprender y que todo lo nuevo que sale es solo para los jóvenes cuando el aprendizaje es de toda la vida", "group_id": 5349, "id": 248405}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299083074.763155, "message": "las leyes pueden cambiar, pero que hacen los maestros para cambiar!? lo aceptan o se oponen,", "group_id": 5349, "id": 248374}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299083232.44538, "message": "lo aceptan porque no les conviene ir en contra del gobierno, además hay un sueldo y un puesto de por medio", "group_id": 5349, "id": 248392}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299083277.289222, "message": "Los antiguos maestros no vana cambiar ya sea porqeu no quieren o porque les es imposible para ellos de un momento a otro cambiar todo lo que han echo por tanto tiempo", "group_id": 5349, "id": 248398}, {"user_id": 16761, "stars": [], "topic_id": 9792, "date_created": 1299083994.5887661, "message": "Si Ansaca, lamentablemente ese Tabù està aunque no en todos los profes si en la mayoria, muchas veces ven en las TIC enemigos, y no se dan cuenta de que debemos hacerlas realmente nuestras aliadas en la educaciòn y potenciarlas significativamente en el aprendizaje durante TODA LA VIDA...", "group_id": 5349, "id": 248501}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299083969.251976, "message": "ok, muy bien ... tenemos el proposito de cambiar y aun tenemos lastimosamente profesores en informatica te tienen mucho conocimiento pero son apaticos al cambio y al uso e incorporacion de toda esta nueva revolucion informatica incluso a estas alturas del partido por asi desirlo! estan de acuerdo o ..", "group_id": 5349, "id": 248496}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299083991.650116, "message": "Sip es claramente un concepto de profesores que están cobijados por la ley de las primas y esas cosas; en realidad al terminar la carrera es cuando aprendes a extrapolar todos esos conocimientos aprendidos en tantos años", "group_id": 5349, "id": 248500}, {"user_id": 17653, "stars": [], "topic_id": 9792, "date_created": 1299085060.056484, "message": "las herramientas que dices ya están el problema es que los gobiernos de los paices tercermundistas den aval para implementarlos", "group_id": 5349, "id": 248738}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299084996.197814, "message": "la educacion que este \"in line\" no puede conpetir en este mundo globalizado. el reto es cambir e integrar la nuevas herramientas informaticas en todos los usos posibles que se puedan dar y sacar el mayor beneficio y probecho de ello", "group_id": 5349, "id": 248722}, {"user_id": 17656, "stars": [], "topic_id": 9792, "date_created": 1299085333.9289651, "message": "no nos favorece ....es el iva una limitante para la masificacion dela tecnologia en la educacion y el precio de la intetnet aun es muy costoso para  los colombianos, la pirateria aun que mala para las grandes corporaciones y enpresas buena para la educacion en los paises del ultimo mundo!", "group_id": 5349, "id": 248789}, {"user_id": 17659, "stars": [], "topic_id": 9792, "date_created": 1299085212.554003, "message": "Cuando estas tecnologìas sean utilizadas aca en los paises desarrollados serán obsoletas eso es sierto pero se tiene que hacer el cambio y la idea no es utilizar lo mas novedoso si no lo mas utíl para la enseñanza", "group_id": 5349, "id": 248760}]