[{"user_id": 36043, "stars": [], "topic_id": 42233, "date_created": 1311021068.135586, "message": "For those who have one, is it worth looking into? IIRC, there is limited backwards compatibility in the Vita.", "group_id": 9493, "id": 1666364}, {"user_id": 25703, "stars": [], "topic_id": 42233, "date_created": 1311021213.8408599, "message": "I think that's probably the best way to go about it, buy it cheap, with the handful of titles that you want, but with no illusions that you're likely to ever buy games for it again.\n\nPersonally, with the promise of re-releasing PSP games on the PS3, I'm holding out. Once the GoW Origins pack hits PS3, all I want from the PSP are Crisis Core and LittleBigPlanet.", "group_id": 9493, "id": 1666391}, {"user_id": 36043, "stars": [], "topic_id": 42233, "date_created": 1311021024.8924561, "message": "I've noticed you can pick up a PSP with bundled games for around R1,500 now, and after I had a good 30 mins playing on my brothers one, I was thinking it might be worth buying for the exclusives like MGS Peace Walker, P3P, Valkyria Chronicles, God of War, etc. The games are also now dirt cheap.", "group_id": 9493, "id": 1666359}, {"user_id": 33318, "stars": [], "topic_id": 42233, "date_created": 1311025399.0566249, "message": "The PSP has some great exclusives, but the titles are severely limited. I think of it as the Gamecube if this past generation. At R1500 for a bundle I'd go for it. Was playing it over the weekend and surprisingly thought that it's really dated... It's weird holding a mobile piece of technology in your hand without a touch screen.", "group_id": 9493, "id": 1666914}, {"user_id": 35617, "stars": [], "topic_id": 42233, "date_created": 1311057608.833142, "message": "At that price, yeah I'd say it'll be worth it. Just don't forget about Persona 2: Innocent Sin and Zettai Hero Project.", "group_id": 9493, "id": 1669514}, {"user_id": 36043, "stars": [], "topic_id": 42233, "date_created": 1311064495.4436851, "message": "Just checked the Vita, and it supports PSP game only via downloads from the PS store, which renders all bought UMD's useless a la PSP Go, which irritates me.\n\nPerhaps it would be best to grab a PSP, the 8 or so 'must-have' games, and leave it at that.\n\nWhat is being rereleased on PS3?", "group_id": 9493, "id": 1669874}, {"user_id": 25703, "stars": [], "topic_id": 42233, "date_created": 1311064676.514401, "message": "*shrugs*\n\nI don't think they announced specific titles.", "group_id": 9493, "id": 1669893}, {"user_id": 36043, "stars": [], "topic_id": 42233, "date_created": 1311064849.0244219, "message": "I recently discovered Power Stone is on the PSP, and thats probably one of my all time favourite fighters. also, a friend of mine was looking for someone to do Peace Walker with (apparently single player is near-literally impossible).", "group_id": 9493, "id": 1669900}, {"user_id": 36043, "stars": [], "topic_id": 42233, "date_created": 1311064857.4029479, "message": "Thanks for the input (damn the lack of edit button)", "group_id": 9493, "id": 1669901}, {"user_id": 31866, "stars": [], "topic_id": 42233, "date_created": 1311072169.90241, "message": "I still absolutely love the PSP. If you're a Nippon Ichi fan, you owe it to yourself to own one. Half Minute Hero, the Disgaeas, Zettai Hero, Prinny etc. are all great. I don't think the console gets nearly enough credit as it deserves. And then there's Monster Hunter, and I'll leave it at that.", "group_id": 9493, "id": 1670265}]