[{"user_id": 18601, "stars": [], "topic_id": 47515, "date_created": 1320512243.426131, "message": "Today I'm honing my research on ketogenic diets as a potential therapy\nfor brain injury from strokes to provide a good friend who recently had\na minor stroke some \"food for thought.\"\n\nhttp://www.ncbi.nlm.nih.gov/pmc/articles/PMC2367001/\n\n\"... there is evidence from uncontrolled clinical trials and studies\nin animal models that the ketogenic diet can provide symptomatic\nand disease-modifying activity in a broad range of neurodegenerative\ndisorders including Alzheimer’s disease and Parkinson’s disease,\nand may also be protective in traumatic brain injury and stroke. \"\ndjfroofy less than a minute ago\n", "group_id": 8855, "id": 2512457}, {"user_id": 18601, "stars": [], "topic_id": 47515, "date_created": 1320512526.8461659, "message": "http://www.sciencedirect.com/science/article/pii/S0306452206016617", "group_id": 8855, "id": 2512498}, {"user_id": 18601, "stars": [], "topic_id": 47515, "date_created": 1320512310.6843481, "message": "http://stroke.ahajournals.org/content/15/2/319.abstract\n\n\n\"Our interest in brain ketone metabolism developed when we tried to\nidentify procedures which might en- hance the tolerance of mice for\nhypoxia. We initially observed that under a variety of conditions mice\ncon- sistently survived longer when the blood ketone levels were above\nnormal.5\"7 In contrast to these initial de- scriptive experiments the\nexperiments presented here were designed to test the hypothesis that the\nbrain will utilize ketones in addition to glucose, during condi- tions\nof reduced oxygen availability. If it can be shown in vitro that, during\nreduced oxygen availability, the brain's CO2 production is maintained\nat a higher level, in the presence of ketones, then in the absence of\nketones, it could help support the idea that increased tolerance for\nhypoxia in vivd^1 may be attributed to the supplemental energy produced\nby this ketone metabo- lism.\"\n", "group_id": 8855, "id": 2512466}, {"user_id": 18601, "stars": [], "topic_id": 47515, "date_created": 1320512547.0128651, "message": "\"Previous studies have suggested that the ketogenic diet may reduce free radical levels in the brain. Thus, one possibility is that ketones may mediate neuroprotection through antioxidant activity. In the present study, we examined the effects of the ketones β-hydroxybutyrate and acetoacetate on acutely dissociated rat neocortical neurons subjected to glutamate excitotoxicity using cellular electrophysiological and single-cell fluorescence imaging techniques. Further, we explored the effects of ketones on acutely isolated mitochondria exposed to high levels of calcium. A combination of β-hydroxybutyrate and acetoacetate (1 mM each) decreased neuronal death and prevented changes in neuronal membrane properties induced by 10 μM glutamate. Ketones also significantly decreased mitochondrial production of reactive oxygen species and the associated excitotoxic changes by increasing NADH oxidation in the mitochondrial respiratory chain, but did not affect levels of the endogenous antioxidant glutathione.\"", "group_id": 8855, "id": 2512501}, {"user_id": 12142, "stars": [], "topic_id": 47515, "date_created": 1320988015.428077, "message": "Hericium erinaceus has some interesting little hormones.", "group_id": 8855, "id": 2551284}]