[{"user_id": 16271, "stars": [], "topic_id": 11191, "date_created": 1299457357.0651979, "message": "This topic automatically created via wp-convore for http://www.michaelridley.info/2011/03/06/wp-convore-wordpress-plugin-released/", "group_id": 5444, "id": 282730}, {"user_id": 16271, "stars": [], "topic_id": 11191, "date_created": 1299457788.405189, "message": "@ericflo I put up some screen shots in case you don't have WordPress and want to see what the admin interface looks like :)", "group_id": 5444, "id": 282813}, {"user_id": 1, "stars": [], "topic_id": 11191, "date_created": 1299458080.426367, "message": "Nice :)", "group_id": 5444, "id": 282910}, {"user_id": 1, "stars": [], "topic_id": 11191, "date_created": 1299457384.0476789, "message": "Woot!", "group_id": 5444, "id": 282738}, {"user_id": 16271, "stars": [], "topic_id": 11191, "date_created": 1299458338.661885, "message": "@ericflo Thanks.  There's lots of options but they have sane defaults and I prefer having the ability to customize.  Especially with something like WordPress where you really don't know what the end use case is going to be since it's such a broad platform.", "group_id": 5444, "id": 282955}, {"user_id": 19171, "stars": [], "topic_id": 11191, "date_created": 1299459742.4047811, "message": "Very nice. I might need to re-install WordPress on my site. Will the plugin port to Drupal, or is there a Drupal Plugin for Convore?", "group_id": 5444, "id": 283194}, {"user_id": 16271, "stars": [], "topic_id": 11191, "date_created": 1299466048.8421819, "message": "@promethh I haven't looked at Drupal plugins in probably a year or more, so I can't say for certain off hand but I think in general the answer is no not really.  I mean both systems are PHP and some of the code could be reused but the backend architectures are quite different.  I thought about making a Drupal plugin but it really would be almost starting from scratch so I'm not sure I have the time for it.", "group_id": 5444, "id": 283617}, {"user_id": 15156, "stars": [{"date_created": 1299738427.9846611, "user_id": 16271}], "topic_id": 11191, "date_created": 1299705661.176276, "message": "@promethh , far as i know, there isn't any 'module' (drupal jargon for 'plugin') contributed yet.  And no you cannot simply port to drupal. You'd have to drupalise it... in short, lots of work. And it's not just the backend architecture being different, but all the abstractions and wrappers of the drupal api are totally different from wordpress.", "group_id": 5444, "id": 308479}, {"user_id": 16271, "stars": [], "topic_id": 11191, "date_created": 1299738462.0140951, "message": "@aubede Yeah if I were super bored I'd port it but as you say it's a lot of work.  And I've thought of another project I think I want to work on, so I probably won't.  Unless someone wants to pay me cash money, which I am not holding my breath on :-)", "group_id": 5444, "id": 311415}]