[{"user_id": 7645, "stars": [], "topic_id": 39516, "date_created": 1308197746.6632309, "message": "Isn't one more objective (Value) and the other subjective (Worth).", "group_id": 2515, "id": 1407248}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308197409.0795989, "message": "I'm taking a page from @ScreenwritingScreenwriter's playbook, and asking about a specific elemental pair.\n\nI just don't get Value & Worth. I do in theory, but the definitions throw me off.\n\nValue: \"...Learning to see items and actions not just for their intrinsic Value, but for their conditional Value is a strong thematic message.\" Huh? Isn't this worth?\n\nWorth, I get. It's Value that I really don't get. It's seems totally context dependent, but it's not? Or it is?", "group_id": 2515, "id": 1407197}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308198002.546669, "message": "That's what I want to be true, but the definition for Value immediately undermines the objectivity of the definition with this: \"However, no one really thinks completely objectively so there is always a degree of personal preference included in a determination of Value. Difficulties arise when a character neglects the personal worth someone else may or may not find in something of specific value.\"\n\nIn fact, the whole definition seems like it's anti-objective.", "group_id": 2515, "id": 1407266}, {"user_id": 7645, "stars": [], "topic_id": 39516, "date_created": 1308200680.8969409, "message": "Yeah I don't think the definition undermines it. In the example of the boss and the candy bar, the boss is looking at the value of the candy from the outside. The conditional value is the value an object has based on the condition of someone else finding worth in it. So yes there is personal bias in looking at Value, but that just warps it's usefulness.  The Worth of an object is an entirely different thing.", "group_id": 2515, "id": 1407540}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308215609.83617, "message": "But looking at it from the outside means that there isn't an objective measure, and someone else finding worth in it, means that its value changes with someone else's subjective take.", "group_id": 2515, "id": 1408699}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308234307.763813, "message": "However, if every character is determining their own Value of something, how is that not actually Worth?", "group_id": 2515, "id": 1410507}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308234244.906451, "message": "This is just like the UA of Dream in The Terminator: it's Reese's reality, but it is her Dream. A fully objective POV will lead us astray.", "group_id": 2515, "id": 1410492}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308234106.9311669, "message": "I think I've found my error, sort of. When determining value, it's not the omniscient POV we want to come from, but the perspective if the domain or character.", "group_id": 2515, "id": 1410454}, {"user_id": 7645, "stars": [], "topic_id": 39516, "date_created": 1308242716.8936069, "message": "Because they're evaluating the Value of something (in relation to everything else), rather than the Worth of something (in relation to them)", "group_id": 2515, "id": 1411780}, {"user_id": 7664, "stars": [], "topic_id": 39516, "date_created": 1308243181.8307641, "message": "Bingo. Thanks.", "group_id": 2515, "id": 1411815}]