[{"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308849197.1671529, "message": "The way I was looking at it, the IC (Dick) wants something of Connor, but doesn't know how to go about getting it (skill).  He knows what Connor needs to do - he just can't find a way to get him to listen because Connor is avoiding/repressing.  The MC (McVie) then learns his planned approach is what Connor is actually doing - and it won't work.  So he changes because of Dick's stance - you need to love yourself for who you are, which means coming clean with manipulating other people.  By doing this, in court, McVie is able to get Connor to see how he's been manipulating people to cover up his own insecurities which are different than McVie's.", "group_id": 2515, "id": 1468125}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308848599.883317, "message": "Wow, weird, I was going over some notes last night and came across Chris's description of the concept of negative reflection characters during the analysis of Michael Clayton. Was going to share it here, but then started doing other things. If you're interested I could post it later tonight...that of course doesn't answer your question (thinking...)", "group_id": 2515, "id": 1468009}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308849589.9042001, "message": "Could it be that you have a Concern of Becoming and a Benchmark of Being? The Benchmark represented by the role, or persona Dick takes throughout the story? The more he effuses that persona the more McVie and Connor become concerned with changing themselves.", "group_id": 2515, "id": 1468230}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308849707.1358359, "message": "That solution, learning to love/accept yourself as you are, is something that impacts all the characters in the story in different ways as each deals with their own perceived shortcomings by using/manipulating.  They're not accepting themselves as they are, therefore, I had the OS as being situation --> fantasy.  The situation being, the economy.  Everybody's lost their sense of who they were because they're unemployed or on the verge of being so, therefore they have a fantasy of being someone else... which leads to manipulating.", "group_id": 2515, "id": 1468251}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308848107.8045709, "message": "Following up with discussion last week with @jimhull, I've started to go through the 1st draft of the script I've completed and wasn't sure if I had two stories or not.  The idea of the negative reflection the MC (McVIe) experiences against another character was interesting because it wasn't necessarily the IC.  Going through the book from the beginning and applying it to the script, I've come to the conclusion that this character (Connor) is most definitely not the IC.", "group_id": 2515, "id": 1467926}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308848787.68454, "message": "In short, I guess I'm asking is can a solution to one problem be the same for another problem?  I haven't figured out what Connor's problem would be defined per Dramatica yet (I haven't sat down to map it), but they appear closely related, yet stem from totally different circumstances.  And not to say this would be representative of a complete storyform.  Yes, that would be great if you could post it later - I was trying to find more information on the concept when you mentioned it last week.", "group_id": 2515, "id": 1468051}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308849557.9723079, "message": "I'm guessing that you are writing a Psychology Overall Story, but it is only an approximation based on what I've read here. Actually, I started writing this before your last comment, and now I *really* think you have an OS Psychology story.", "group_id": 2515, "id": 1468221}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308848376.121407, "message": "The IC is actually a third character (Dick) who gets the MC to see where he's wrong (with Psychology/Manipulation/Being/Desire) - this being something relevant to everyone else in the story.  Question is, if the MC via the act of changing his approach changes someone else (Connor, the antagonist), does this remain one single story, or should I be looking to see if there's a second story here where Connor is the MC and McVie his IC?  Connor is McVie's negative reflection, but ends up changing as well.", "group_id": 2515, "id": 1467970}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308848965.383301, "message": "Do you know your MC and IC problem and solution yet? speaking of McVie and Dick", "group_id": 2515, "id": 1468090}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308849463.8264079, "message": "I haven't worked through the dramatica definition of the solution yet.  I figured I'd try and learn this best by going through what I just wrote and seeing if I view it through Dramatica's theory.  The answer might be something that comes up while I go through this, I'm not sure, but I figured I'd ask before I got too far into it because I don't want to think it's something that should be explored if there's no plausibility to it.", "group_id": 2515, "id": 1468191}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308849574.7879751, "message": "Besides the manipulations occurring everyone, you mentioned that Dick's being is relevant to everyone in the story, but it could also be an OS of Psych. because you have more than one central character \"changing\". OS Stories of Becoming can explore a group of characters transforming, yet still have the MC/IC dynamic present elsewhere. Four Weddings and A Funeral has everyone nervous about committing and they all \"change\", but the MC has his own skepticism about marriage to deal with.", "group_id": 2515, "id": 1468226}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308849881.4256561, "message": "Yeah, this totally sounds like a Being or Becoming OS Story. In reference to your first question I'm thinking you don't need more than one storyform.  It seems like you're exploring the problems of people being what they aren't, rather than the problems of being stuck in a declining economy. If the economy rebounds (OS Goal of Progress in your present storyform) would that resolve the characters problems? Seems like that is more setting than storyform.", "group_id": 2515, "id": 1468278}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308850507.4020591, "message": "farce=OS Psychology", "group_id": 2515, "id": 1468377}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308850375.364151, "message": "So McVie sees that negative reflection in Connor in a sense - not that he's gay himself, but that by you can't run away from your problems.  McVie himself has low-self esteem... Both see themselves as failures in their father's eyes.", "group_id": 2515, "id": 1468344}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308850530.684927, "message": "and McVie is stuck in a dead-end town = MC Situation", "group_id": 2515, "id": 1468382}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308850725.1877789, "message": "That makes sense.  I think I was looking at the situation as being something that impacts everyone (since they all end up more or less using one another for their own personal gain - but that falls into manipulating, too)", "group_id": 2515, "id": 1468414}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308850304.6084239, "message": "I don't think the economy rebounding would solve the problem, no.  McVie's goal is he wants to leave the dead-end town and go to Hollywood and be rich and famous.  But he's stuck - the situation being his unemployment is about to run out and he's essentially broke and fallen behind payments.  That's a motive for him wanting to leave, too - he gets a final notice.  He realizes, via Dick's explanation of Connor's issue, that Connor himself is rich and famous, but seeking anonymity in a small town - not because he's a bust of a former NFL draft pick, but because he's gay (which lead to him being a bust because his methods in college to conceal who he really was didn't work in the pros).", "group_id": 2515, "id": 1468338}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308850511.680624, "message": "more often than not", "group_id": 2515, "id": 1468378}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308850497.3752539, "message": "Keep in mind this is a farce, too... but obviously between all the farce elements of multiple disguises, mistaken identities, gross-out gags, this is the heart/meaning of the story that impacts everyone else.", "group_id": 2515, "id": 1468371}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308851694.3540881, "message": "Eh, even saying \"antagonist\" seems a bit weird with regard to those two characters (McVie/Connor).  All of McVie's friends end up antagonist to his desire to leave.  Connor actually helps motivate his desire - he's not diametrically opposed, per say, in that regard... that's why I was perhaps thinking if there were two stories.  Hmmm... The key here is McVie's ex, Penelope, is who Connor is now using.  But she comes up missing and they both think each other is responsible in some way which ties into McVie's plan, creating a fake \"lost\" footage short.  In that sense, McVie becomes antagonistic to McVie's goal of false facade: he's settled with three women out of court for sexual assault charges, which were bogus.  He just paid them to say that, so everybody else would think he's straight.  But now that there's a girl missing... he's become a \"cooperative\" suspect while McVie has gone into disguise.", "group_id": 2515, "id": 1468641}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308852853.3759501, "message": "sry for the delay - got pulled away...", "group_id": 2515, "id": 1468909}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308851310.224613, "message": "Ok, looking down through the types to variations, I think that fits very well since  a lot, if not, all of those variations are present.  So I'll stick with one story form.  Any examples off the top of your head (or anyone else if they want to chime in) where there's a change MC/protagonist (hero) who in turn changes the antagonist?", "group_id": 2515, "id": 1468534}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308853021.1458449, "message": "ok - completely convinced your OS is in Psychology", "group_id": 2515, "id": 1468964}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308854148.601512, "message": "maybe nail down what the OS Goal is now that you have the context that it is most likely in that Domain? probably whatever McVie hopes to accomplish through his manipulations -- his plan (Conceptualizing), put one over on everyone else (Being), become straight (Becoming) -- whatever he is pursuing, then you can figure out who the antagonist is", "group_id": 2515, "id": 1469198}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308854224.2167621, "message": "Just took the dog for a walk and cleared my head.  Don't know what I was thinking, but Connor is obviously diametrically opposed to McVie's goal to leave town.  Both are suspects, but Connor reported the missing person after seeing McVie climb out his window which forces McVie into adopting another persona since he has no means to leave town (his car was repossessed).  So, one story-form, OS in Psychology.  Thanks - look forward to your notes on the negative reflection concept whenever you get the chance to post them.", "group_id": 2515, "id": 1469210}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308854337.0739591, "message": "aweome, will do", "group_id": 2515, "id": 1469219}, {"user_id": 7645, "stars": [], "topic_id": 40245, "date_created": 1308882040.0993569, "message": "Ok - here's the reference to my notes with the audio trimmed from the podcast - http://storyfanatic.com/notes/an-echo-of-the-main-character", "group_id": 2515, "id": 1473592}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308883986.9611399, "message": "That's exactly it, Jim.  Thanks for posting that!  I can see where Chris is struggling with what to call it - I wouldn't want to use Ghost as a term (mostly because I'm very familiar with Truby's use of the term having worked with his theory over the last six years or so).  Plus, Ghost is typically referencing the past whereas this is future, like a future-self.", "group_id": 2515, "id": 1473817}, {"user_id": 33839, "stars": [], "topic_id": 40245, "date_created": 1308884872.1759491, "message": "It's not exactly what Truby would call a self-revelation (he doesn't make a distinction of a future/possible self), but it certainly encompasses the elements as he defines the term.  And in this context, there has to be that element of sudden self-awareness.  I wish I could think of some examples off the top of my head, but that's exactly what I have going on in my story: what the MC seeks as a solution to his problem is proven not to be the answer by someone who already embodies those elements (thematically, it's like the MC discovering the grass isn't always greener on the other side before actually experiencing the other side - realizing it's all a matter of perspective as someone is running away from what he's wanting to run toward).", "group_id": 2515, "id": 1473910}]