[{"user_id": 3963, "stars": [], "topic_id": 35573, "date_created": 1305586432.395246, "message": "This article marks the first editorial posted on our site, as well as the first repeat appearance of a writer. As our writing staff begins to come together, I'd love to hear your opinions on the article content and layout. Thoughts can be sent to lanedavis.csl@gmail.com", "group_id": 857, "id": 1075852}, {"user_id": 3963, "stars": [], "topic_id": 35573, "date_created": 1305586177.326052, "message": "Jake Tessem writes Fr3nzy, a piece designed to catch you up with the recent Modern Warfare 3 news and offer analysis on the big questions. Read it here: http://tehpwngaming.com/index.php?option=com_content&view=article&id=100%3Atrue-life&catid=47%3Alast-added-tutorilas&Itemid=56", "group_id": 857, "id": 1075811}, {"user_id": 3315, "stars": [], "topic_id": 35573, "date_created": 1305589166.805552, "message": "So I agree that game play needs to change.  But that requires them to change a whole lot more than Activision will be comfortable with.", "group_id": 857, "id": 1076129}, {"user_id": 3315, "stars": [], "topic_id": 35573, "date_created": 1305589094.850667, "message": "New perks and maps will not change game play enough to make this truly worthwhile.  \n\n-Bring back lean.  Makes cover 100x more important, and makes the game more tactical by punishing people for blindly running around guns blazing.\n\n-ffs, give the guns more recoil.  Regardless of realism, making the guns require skill to control in a game like this means a few things, the most important being a higher skill ceiling.  Look at how BC2 did weapons, as well as the first and second Call of Duty games.\n\n-Make health regenerate at least 3 times a slow.  Or just give us health bars back.  Punish players for making bad choices, don't pat them on the back ad say \"it's ok Jimmy, try again\".  Make them seek cover or let them die from a shot to the toe.", "group_id": 857, "id": 1076126}, {"user_id": 3740, "stars": [], "topic_id": 35573, "date_created": 1305606484.7518589, "message": "Thank you Lane for posting and editing my articles!", "group_id": 857, "id": 1078913}, {"user_id": 4027, "stars": [], "topic_id": 35573, "date_created": 1305642993.6788919, "message": "It would be awesome to see lean come back, I remember using that in the old CoD games. You really were punished for running around like a jackass...", "group_id": 857, "id": 1083584}, {"user_id": 2649, "stars": [], "topic_id": 35573, "date_created": 1305718277.7349119, "message": "so sad those videos were \"leaked\" they looked so silly.", "group_id": 857, "id": 1096167}, {"user_id": 3740, "stars": [], "topic_id": 35573, "date_created": 1305764211.1220829, "message": "the videos weren't leaked.  They were released by Activision.  The info found on kotaku was the \"leaked\" info,", "group_id": 857, "id": 1104904}]