[{"user_id": 7664, "stars": [], "topic_id": 17720, "date_created": 1302143294.124918, "message": "We all know that the MC and OC are in three throughlines. But, what is the Dramatica take on other characters who are in multiple throughlines?\n\nIf someone is the Emotion character in the OS, say -- in my case, the MC's mother -- but is someone the MC can turn to in the MC throughline, then do they also share the problems/symptoms of that throughline? (I'm assuming yes.)\n\nWhat else?", "group_id": 2515, "id": 568575}, {"user_id": 7669, "stars": [], "topic_id": 17720, "date_created": 1302153200.177326, "message": "Simply, they have a role in relation to the Story Goal, and they have a role in illuminating the MC's personal issues.  Most likely it would shake out in separate scenes, but sometimes you have \"multi-appreciational moments\" where multiple throughlines get invoked in the same scene.", "group_id": 2515, "id": 571784}, {"user_id": 7669, "stars": [], "topic_id": 17720, "date_created": 1302151915.0498691, "message": "To the extent that a character, such as a parent, can be considered part of the MC throughline (without being the Obstacle/Impact Character, and separate from whatever Objective role they may have), it's not really accurate to say that they \"share the problems/symptoms of that throughline\", but they may in some way be a REFLECTION of the problems or symptoms of the MC, or any other part of that throughline.  The elements of the MC throughline really belong to that one person and that person alone; however another character may be useful in illuminating aspects of the MC's nature -- particularly a parent who is crucial to shaping the MC's worldview.", "group_id": 2515, "id": 571500}, {"user_id": 7664, "stars": [], "topic_id": 17720, "date_created": 1302152581.8969419, "message": "Well put. Where I'm coming from is this: Chris mentioned a few weeks back that there could be characters that one only encounters in the MC throughline (and are not part of the OS), and that they would be shaped by the settings in the MC throughline. \n\nSo, if one character is part of both, how does that shake out?", "group_id": 2515, "id": 571644}, {"user_id": 7664, "stars": [], "topic_id": 17720, "date_created": 1302153302.337445, "message": "okay.", "group_id": 2515, "id": 571961}]