[{"user_id": 11626, "stars": [], "topic_id": 8991, "date_created": 1298616248.7998481, "message": "MADISON, Wis. – Wisconsin state troopers were dispatched Thursday to the doorsteps of some of the AWOL Democratic senators in hopes of finding at least one who would come back to allow a vote on a measure to curb the power of public-employee unions.\r\n\r\nThe stepped-up tactic ordered by the Republican head of the Senate came amid reports that at least a few of the missing senators were returning home at night to pick up clothes, food and other necessities, before rejoining their colleagues in Illinois.\r\n\r\nMeanwhile, the state Assembly appeared close to voting on the bill after more than two days of filibustering.\r\n\r\nDemocrats agreed before dawn Thursday to limit the remaining number of amendments they offer and the time they devote to each one. Nearly 12 hours after the agreement was announced, they were still debating the measure that Gov. Scott Walker insists is necessary to ease the state's budget woes and avoid mass layoffs.\r\n\r\nDemocrats urged Republicans to accept a compromise that would keep collective bargaining intact.\r\n\r\n\"We all know there is an impasse. There is one person who can end this impasse and that is Gov. Walker,\" said Democratic Assembly Leader Peter Barca as debate reached its 53rd hour. \"This state has never been more divided in the last 25 years. ... It's the governor's job to unify the state.\"\r\n\r\nBut Republicans summarily rejected every Democratic amendment in the marathon session, which unfolded as grand political theater. Exhausted lawmakers limped around the chamber, rubbing their eyes and yawning as Wednesday night dragged into Thursday.\r\n\r\nAround midnight, Rep. Dean Kaufert, a Republican from Neenah, accused Democrats of putting on a show for the protesters. Democrats leaped up and started shouting.\r\n\r\n\"I'm sorry if democracy is a little inconvenient, and you had to stay up two nights in a row,\" Pocan said. \"Is this inconvenient? Hell, yeah, it's inconvenient! But we're going to be heard!\"\r\n\r\nDemocrats, who are in the minority, don't have the votes to stop the bill once the vote occurs.\r\n\r\nBut even after the bill passes the Assembly, it cannot become law until it also passes the Senate, where action has been stymied by the absence of the Democrats. At least one of them needs to be there in order for Republicans to take up the bill since the GOP is one seat short of having a quorum.\r\n\r\nThe Senate convened at 7 a.m. Thursday just long enough to take a roll call, which allows for the sergeant at arms staff to go to missing lawmakers' homes with police.\r\n\r\nTroopers went to multiple homes but left after finding no one home, said Sergeant at Arms Ted Blazel.\r\n\r\nWisconsin law does not allow police to arrest the lawmakers, but Fitzgerald said he hoped the show of authority would pressure them to return. He would not say how many Democrats were being targeted, but said it was more than one.\r\n\r\n\"Every night we hear about some that are coming back home,\" Fitzgerald said. Whether to send police out again is a day-by-day decision, he said.\r\n\r\nDemocratic Sen. Jon Erpenbach, who was in the Chicago area, said all 14 senators remained outside of Wisconsin on Thursday morning and would not return until Republican Gov. Scott Walker was willing to compromise.\r\n\r\n\"It's not so much the Democrats holding things up,\" Erpenbach said. \"It's really a matter of Gov. Walker holding things up.\"\r\n\r\nWalker released a column Thursday praising the Assembly for moving toward a vote and renewing his call for Senate Democrats to come back. He said that he's always willing to \"cooperate and communicate\" with Democrats, but only if they return to Madison.\r\n\r\nWalker has repeatedly warned that if the budget bill does not pass by Friday, the state will miss a deadline to refinance $165 million of debt and will be forced to start issuing layoff notices next week.\r\n\r\nWhile Walker is trying to increase the pressure to act, the deadlines may not be quite as strict as he says.\r\n\r\nThe nonpartisan Legislative Fiscal Bureau said in a memo sent to lawmakers earlier this week that the debt refinancing could be pushed as late as Tuesday in order to achieve the savings Walker is seeking.\r\n\r\nThe governor is trying to balance a projected $137 million budget shortfall by July.\r\n\r\nBased on a similar refinancing in 2004, about two weeks are needed after the bill becomes law to complete the refinancing, which means if the bill is adopted by the middle of next week, the state can still meet a March 16 deadline, the Fiscal Bureau said.\r\n\r\nWalker has suggested the deadline is actually Friday in order to pressure lawmakers to act on the bill, which has drawn tens of thousands of protesters to the Capitol. The rallies reached a high of 68,000 people on Feb. 19 and hundreds have stayed overnight.\r\n\r\nFitzgerald said the real deadline is \"up in the air.\"\r\n\r\n\"Everything's in place, it's ready to go,\" he said. \"It just needs to be finalized.\"\r\n\r\nWerwie said the governor was \"uncomfortable with the time frame for refinancing if the bill passes after Friday.\"\r\n\r\nWalker also threatened to start sending layoff notices to up to 1,500 state workers next week if the bill isn't passed, arguing he has no other choice to deal with the shortfall. He has not said who would be targeted.\r\n\r\nSchool districts have already started sending out preliminary layoff notices in case they are needed later.\r\n\r\nThe battle over labor rights has been heating up across the country, as new Republican majorities tackle budget deficits in several states. The GOP efforts have sparked huge protests from unions and their supporters and led Democrats in Wisconsin and Indiana to flee their states to block major legislation.\r\n\r\nWisconsin's measure would forbid most government workers from collectively bargaining for wage increases beyond the rate of inflation. It also would require public workers to pay more toward their pensions and health insurance. Police and firefighters would be exempt.\r\n\r\nIn Ohio, a similar proposal in a Senate committee drew thousands of protesters to the Statehouse, just as in Wisconsin.\r\n\r\nIndiana Democrats successfully blocked a Republican bill that would have prohibited union membership from being a condition of employment by leaving the state Tuesday. They remained in Illinois in hopes of derailing other parts of Republican Gov. Mitch Daniels' agenda, including restrictions on collective bargaining by teachers.\r\n\r\nAnd in Oklahoma, a Republican-controlled House committee narrowly approved legislation Wednesday to repeal collective-bargaining rights for municipal workers in the state's 13 largest cities. \r\n\r\nhttp://news.yahoo.com/s/ap/20110224/ap_on_re_us/us_wisconsin_budget_unions;_ylt=AmULwQccN52gyOLXEEk.YMN1EcF_;_ylu=X3oDMTNlZDM0ZTFsBGFzc2V0A2FwLzIwMTEwMjI0L3VzX3dpc2NvbnNpbl9idWRnZXRfdW5pb25zBGNjb2RlA21wX2VjXzhfMTAEY3BvcwM5BHBvcwM5BHNlYwN5bl90b3Bfc3RvcmllcwRzbGsDdHJvb3BlcnNzZW50", "group_id": 3920, "id": 206376}]