[{"user_id": 1, "stars": [], "topic_id": 11579, "date_created": 1299624454.0222931, "message": "Any tips, what to do, what not to do?", "group_id": 4075, "id": 300260}, {"user_id": 1, "stars": [{"date_created": 1299627055.3622739, "user_id": 155}, {"date_created": 1299627881.0470901, "user_id": 1661}, {"date_created": 1299631417.769964, "user_id": 83}], "topic_id": 11579, "date_created": 1299624483.2300041, "message": "One person told me \"if you see someone you need to talk to, talk to them *right then* because chances are you won't see them again\"", "group_id": 4075, "id": 300262}, {"user_id": 1, "stars": [], "topic_id": 11579, "date_created": 1299624440.597132, "message": "This year will be my first SXSW", "group_id": 4075, "id": 300259}, {"user_id": 155, "stars": [], "topic_id": 11579, "date_created": 1299627166.8021941, "message": "comfortable shoes would be a good plan, pack everything for the whole day in a bag, dont count on going home to your hotel during the day, events and happenings just carry you along so you may think you will have downtime but unless you actively decide to go back you wont :)", "group_id": 4075, "id": 300474}, {"user_id": 1661, "stars": [{"date_created": 1299654717.4440229, "user_id": 1}], "topic_id": 11579, "date_created": 1299627872.4160831, "message": "What not to do? 3 things not to do: 1. Do not get offended or insulted. You might think somebody offended your honor or something when just like you, they are so busy meeting people, dealing with being mobbed by way too many people. 2. Do not drink to excess. It's fun to do sometimes, but ya, pictures of you puking like it was your first week of college is not fun. 3. Do not go to parties where everyone is invited. I am not a snob. It's a safety issue. The places will be packed beyond reasonable safety numbers. Stick with parties put on by hosts where they care about crowd control, safety, and you. :-)", "group_id": 4075, "id": 300529}, {"user_id": 19716, "stars": [], "topic_id": 11579, "date_created": 1299628461.412885, "message": "I am going on a budget, so the freely accessible parties are the only one's I'll be able to go to. Maybe If I could start saving for next year right after SXSW closes then I can do it next year :)", "group_id": 4075, "id": 300581}, {"user_id": 19252, "stars": [], "topic_id": 11579, "date_created": 1299636910.543596, "message": "book your room on airbnb.  I agree with @barce on the drinking to excess (in public).  If you have a company that you want to pitch to someone do the work before hand and have a prepared presentation hand off with you to give them.  Hallway pitches get you hallway consideration.  If you are in private beta, don't make someone you are trying to sell go to the site and wait for the email conformation.  Provide them with a link that works.", "group_id": 4075, "id": 301049}, {"user_id": 19252, "stars": [{"date_created": 1299804537.555125, "user_id": 1661}], "topic_id": 11579, "date_created": 1299636987.016566, "message": "and above all don't be so busy building your future that you miss the moment.  sxsw is fun! Enjoy, laugh, smile, learn, be present.", "group_id": 4075, "id": 301057}, {"user_id": 2, "stars": [], "topic_id": 11579, "date_created": 1299639383.9553721, "message": "@ericflo I like to bring healthy snacks in my laptop bag in case I get too busy to break for lunch!", "group_id": 4075, "id": 301235}, {"user_id": 12049, "stars": [{"date_created": 1299659972.5007219, "user_id": 1}], "topic_id": 11579, "date_created": 1299659964.1119649, "message": "@ericflo this: http://schedule.sxsw.com/events/event_IAP8384", "group_id": 4075, "id": 302749}, {"user_id": 12049, "stars": [{"date_created": 1299674298.698384, "user_id": 2}, {"date_created": 1299688241.423496, "user_id": 15639}, {"date_created": 1299803295.4666171, "user_id": 1661}], "topic_id": 11579, "date_created": 1299659937.1744051, "message": "if you've got an Interactive badge, make sure you go to the \"How to Rawk Out at SXSW Interactive\" panel. it's the perfect starting point for n00bs. light hearted & hilarious advice by seasoned veterans who are not yet 100% jaded.", "group_id": 4075, "id": 302748}, {"user_id": 26577, "stars": [], "topic_id": 11579, "date_created": 1301508052.6043501, "message": "@leah Check out http://snackandmunch.com - You can get your monthly supply of snacks to munch on at work! Use the coupon code \"2BUCKS\" for $2 off!", "group_id": 4075, "id": 483531}]