[{"user_id": 15288, "stars": [], "topic_id": 8924, "date_created": 1298592603.912153, "message": "¿Cómo trabajan ustedes en casa o el trabajo? ¿Con uno o dos monitores? Yo en el trabajo tengo dos de 19\" y en casa uno de 22\". Realmente estoy pensando en comprarme otro para la casa.", "group_id": 4948, "id": 204250}, {"user_id": 2457, "stars": [], "topic_id": 8924, "date_created": 1298592683.207067, "message": "Nunca he trabajado con dos monitores la verdad... Ahorita mismo trabajo con un monitor en cada máquina y sí siento que hará diferencia si compro 2 monitores", "group_id": 4948, "id": 204261}, {"user_id": 15632, "stars": [], "topic_id": 8924, "date_created": 1298592919.638612, "message": "eso va ligado a una o dos tarjetas de video cierto? yo es que no tengo PCIs libres :p", "group_id": 4948, "id": 204291}, {"user_id": 15632, "stars": [], "topic_id": 8924, "date_created": 1298593211.8602009, "message": "@mopx i3 en el trabajo, phenom II en casa, la de casa solo 1 salida, la del trabajo tiene 1 análoga y una digital... pero mi monitor va solo en análogo... Integrada, como no juego con que sea compatible con vesa voy bien ;)", "group_id": 4948, "id": 204345}, {"user_id": 2052, "stars": [], "topic_id": 8924, "date_created": 1298593014.2705121, "message": "@pako la mayoría de las tarjetas de hoy dia, tienen 2 salidas de video. me huele a que usas una pentium ;)", "group_id": 4948, "id": 204308}, {"user_id": 15839, "stars": [], "topic_id": 8924, "date_created": 1298597175.315804, "message": "2 monitores en el trabajo. 2 computadoras en casa. Trabajar con dos monitores me resulta sabroso.", "group_id": 4948, "id": 204801}, {"user_id": 5962, "stars": [], "topic_id": 8924, "date_created": 1298611473.3596981, "message": "Cuando usas 2 monitores!! se te hace tal habito que te sientes mal luego trabajar con 1, uso 2 monitores desde el 99...Pero misteriosamente usar 2 monitores para algunas personas es como tan raro , que te ven como si fueras un NERD .. jaja y la pregunta clasica \"Usas 2 computadora a la vez\" DAHH!!", "group_id": 4948, "id": 206066}, {"user_id": 15630, "stars": [], "topic_id": 8924, "date_created": 1298644380.492254, "message": "Si usas tu pc pa navegar internet y postiar en facebook/twitter un monitor te sirve. Pero si tu computadora es tu herramienta de trabajo, no tienes excusa. Menos de 3500 pixeles horizontales y falta espacio.", "group_id": 4948, "id": 208071}, {"user_id": 2457, "stars": [], "topic_id": 8924, "date_created": 1298644677.714215, "message": "@jivanov Me siento mal ya. Tendré que comprar un monitor externo pa la iMac. :D", "group_id": 4948, "id": 208116}, {"user_id": 15739, "stars": [], "topic_id": 8924, "date_created": 1298647328.2365921, "message": "2 en el trabajo y uno en casa y también estoy pensando en comprar otro pa la casa :D", "group_id": 4948, "id": 208530}, {"user_id": 15614, "stars": [], "topic_id": 8924, "date_created": 1298646974.1922541, "message": "Me setup idea serian dos monitores de 24\" pero con resolición 1900x1200 y uno de los dos verticales, antes estaba parecido con una combinación 22/24 y era muy comodo pero como ahora desarrollo desde la laptop uso el de 24\" 1900x1200 que ya no se consiguen ahora todo son 1080p :( y el de la laptop \"15. Los Apple cinema display se ven cool pero creo que es demasiado espacio para un programador en una pantalla, mejor te organizas con dos, dejele esos a los diseñadores y de edicion de pelicula :P", "group_id": 4948, "id": 208491}]