[{"user_id": 11626, "stars": [], "topic_id": 43687, "date_created": 1313136835.1910629, "message": "FALSE FLAG FRIDAY 8/12/11\n\nWelcome to the \"False Flag Friday\" edition of SCMLA's News Digest!\n\n\nNYPD forms new social media unit to mine Facebook and Twitter for mayhem\nNew York Daily News\nAugust 12, 2011\n\nThe NYPD has formed a new unit to track troublemakers who announce plans or brag about their crimes on Twitter, MySpace and Facebook. Newly named Assistant Commissioner Kevin O'Connor, one of the department's online and gang gurus, has been put in charge of the new juvenile justice unit. He and his staff will mine social media, looking for info about troublesome house parties, gang showdowns and other potential mayhem, sources said. London rioters have been using Twitter and BlackBerry messages to choose targets for looting or burning - and to alert one another about police positions.\nhttp://www.nydailynews.com/ny_local/2011/08/10/2011-08-10_nypd_forms_new_social_media_unit_to_mine_facebook_and_twitter_for_mayhem.html\n\nUK planning draconian powers to shut phone messaging and social networks in times of civil disorder\nIndependent\nAugust 12, 2011\n\nMinisters and the security services are planning draconian powers to shut down or disrupt mobile phone messaging services and social networks in times of civil disorder. Downing Street sources said they were considering the \"moral and technical\" questions of how to grant new powers blocking all mobile communications to prevent rioters organising through websites such as Twitter and the BlackBerry Messenger service. Mr Cameron, promising yesterday to do \"whatever it takes\" to restore order, outlined a series of new security measures, which included: Consider further powers of curfew. Investigate using the Army to free up police for \"frontline\" duties. Give individual police officers the power to force people to remove scarves, hoods or masks covering their faces or be arrested... The Government will also consult former New York Police commissioner Bill Bratton on further measures to tackle gang culture.\nhttp://www.independent.co.uk/news/uk/crime/camerons-law-pm-planning-crackdown-on-rioters-2336308.html\n\nClarke airs suspicions over Sept. 11 intel failures\nWashington Post\nAugust 11, 2011\n\nRichard Clarke, who served in two administrations as a White House counter-terrorism adviser, said he now suspects the CIA hid its knowledge that two of the Sept. 11 hijackers had entered the United States because the agency had tried – and failed – to recruit them as informants. ..Clarke says it is \"the only conceivable reason that I've been able to come up with\" to explain why the CIA failed to inform the FBI or the White House of the would-be hijackers presence. Clarke goes on to say he believes \"there was a high-level decision in the CIA ordering people not to share information,\" all but pointing a finger at the CIA Director at the time, George J. Tenet.\nhttp://www.washingtonpost.com/blogs/checkpoint-washington/post/clarke-airs-suspicions-over-sept-11-intelligence-failures/2011/08/11/gIQAx33K9I_blog.html\n\nWhite House denies leaking classified info for bin Laden raid film\nReuters\nAugust 11, 2011\n\nMoviemakers producing a film about the U.S. special forces raid that killed Osama bin Laden are getting help from the Pentagon, but the Obama administration dismissed concerns on Wednesday that classified information has been divulged. The film, focusing on one of President Barack Obama’s key successes in office, is due to be released in October 2012, less than a month before the election in which the Democrat is seeking a second term. Republican Peter King, chairman of the House of Representatives Homeland Security Committee, called on Tuesday for an investigation into contacts between the administration and the filmmakers. King questioned whether special operations methods had been compromised. “The claims are ridiculous,” White House spokesman Jay Carney told a White House briefing.\nhttp://www.infowars.com/white-house-denies-leaking-classified-info-for-bin-laden-raid-film\n\nFeds Send Terrorist Hand-out to Military Surplus Stores\nInfowars.com\nAugust 11, 2011\n\nThe feds are at it again. Now they want military surplus store owners and employees to rat out their customers. The hand-out below was distributed in Colorado. Government hand-outs like this are nothing new. However, this time around the government is targeting “survivalists.” People who purchase MREs (Meals Ready to Eat) might be terrorists, especially if they make “suspicious comments regarding anti-US, radical theology (sic) vague or cryptic warnings that suggest or appear to endorse the use of violence in support of a cause.” According to the hand-out, you might be with white al-Qaeda if you purchase high capacity magazines or rifle tripods, weatherized ammunition, flashlights, gas masks, night vision devices, especially if you buy them “bulk,” that is if you buy more than one of each. The hand-out suggests stores “require valid ID from all new customers” and ask questions, presumably to find out if they are with al-Qaeda (or defend the Constitution too adamantly). Of course, this rat-on-your-customers policy is doomed to failure. Business owners understand customers value their privacy and don’t like to be carded to do business and asked all kinds of inappropriate questions. If they want to stay in business, they will leave their customers alone – and ignore this silly government hand-out. For now – until the next false flag terror attack – the feds are not requiring business owners to inform on their customers.\nhttp://www.infowars.com/feds-send-terrorist-hand-out-to-military-surplus-stores\n\nRep. Peter King: Pentagon, CIA must investigate Obama and death of Osama bin Laden movie\nNew York  Daily News\nAugust 10, 2011\n\nRep. Pete King (R-NY) knocked President Obama over reports he green-lighted unprecedented access of the Navy SEALs crew who killed Osama bin Laden to Hollywood filmmakers. Director Kathryn Bigelow and screenwriter Mark Boal, who made 2008's Iraq war drama \"The Hurt Locker,\" are behind the planned picture of the risky May raid. The movie is scheduled for release on Oct. 12, 2012. King, chairman of the House Homeland Security Committee, has demanded that Pentagon and CIA inspectors general investigate their access.\nhttp://www.nydailynews.com/news/politics/2011/08/10/2011-08-10_rep_peter_king_pentagon_cia_must_investigate_obama_and_osama_bin_laden.html\n\nClaim: Youths Offered Money To Start Riots\nViolence in Leicester after “journalists” tried to pay off kids, according to Tweets\nInfowars.com\nAugust 10, 2011\n\nAs massive unrest plaguing the United Kingdom spread from London to other cities last night, claims emerged that individuals calling themselves journalists were offering to pay youths to start riots, suggesting an effort to provocateur some of the violence. According to Tweets sent by people who were in the city of Leicester last night trying to secure their communities, kids were being told to cause mayhem in return for cash. Leicester was hit by violence later that night, as youths attacked buildings in the city center.\nhttp://www.infowars.com/claim-youths-offered-money-to-start-riots\n\nMark Duggan did not shoot at police, says IPCC\nGuardian\nAugust 9, 2011\n\nMark Duggan, whose shooting by police sparked London's riots, did not fire a shot at police officers before they killed him, the Independent Police Complaints Commission said on Tuesday. Releasing the initial findings of ballistics tests, the police watchdog said a CO19 firearms officer fired two bullets, and that a bullet that lodged in a police radio was \"consistent with being fired from a police gun\". One theory, not confirmed by the IPCC, is that the bullet became lodged in the radio from a ricochet or after passing through Duggan.\nhttp://www.guardian.co.uk/uk/2011/aug/09/mark-duggan-police-ipcc\n\nDHS Funds Real-time Spy Cams on SF Buses\nInfowars.com\nAugust 9, 2011\n\nThe Department of Homeland Security will fund an effort by San Francisco to install real-time video cameras on 358 city buses, according to the San Francisco Chronicle. The existing system, installed a decade ago, stores footage on tape located on each vehicle. The new surveillance system will use a wireless network “that will enable SFMTA personnel to view, download and store the captured video images wirelessly and view them in real-time or through the Internet.” According to city documents, “the new system will provide real-time viewing of images, inside and outside the bus, by law enforcement officers, emergency responders and other authorized personnel on a real-time basis from a distance of about 500 yards in case the bus is hijacked and used for terrorism activities.”\nhttp://www.infowars.com/dhs-funds-real-time-spy-cams-on-sf-buses\n\nDangerous Levels Of Background Radiation Recorded In Rain In Oklahoma City\nThe Intel Hub\nAugust 9, 2011\n\nA local citizen in Oklahoma City has recorded what the Geiger counter called dangerous levels of background radiation. This comes a week after the announcement that levels of radiation spewing from the Fukushima Nuclear Power Plant are higher then ever. NRC corruption and nuclear power plant safety in general has also been heavily scrutinized in the last few months. While more tests are obviously needed to identify a 100% conclusive radiation level, the fact that it even went to a high enough level to be labeled dangerous in one test is startling enough in itself. YouTube Description FromUser FirebyNight: Rain stopped long enough to go outside and see what came down in the rain. Got rain sample from top of plastic trash bin. Started raining again toward the end of the video. I had to stop and get out of it. You can come to your own conclusion of what is going on in this video.\nhttp://theintelhub.com/2011/08/09/dangerous-levels-of-background-radiation-recorded-in-rain-in-oklahoma-city\n\nJackie Kennedy Believed Lyndon B Johnson Killed JFK As Evidence Of Johnson’s Complicity Continues To Mount\nThe Intel Hub\nAugust 8, 2011\n\nFormer First Lady Jackie Kennedy believed Lyndon Baines Johnson and a cabal of Texas tycoons had a hand in the assassination of her husband. These revelations, first reported by The Daily Mail, were apparently secretly recorded just months after the JFK assassination. Famed historian Arthur Schlesinger Jnr recorded the secret tapes which had been sealed in a vault at the Kennedy Library in Boston ever since. This new evidence further strengthens the testimony and evidence that is already available that points to Johnson’s involvement in the Dallas assassination of JFK. In 2007 notorious CIA agent E. Howard Hunt released a book that suggested that LBJ was involved in the murder.\nhttp://theintelhub.com/2011/08/08/jackie-kennedy-believed-lyndon-johnson-killed-jfk-as-evidence-of-johnson-complicity-continues-to-mount\n\nScotland Yard Hunting Tweeters Who 'Incite Violence'\nThe Sun\nAugust 8, 2011\n\nTWITTER users who incite violence on the social networking site could face arrest following two nights of rioting and looting in London, a top police chief said today. Scotland Yard's Deputy Assistant Commissioner Stephen Kavanagh confirmed that officers were looking at the website as part of investigations into criminal behaviour. And acting Commissioner Tim Godwin pledged a robust response to some of the \"pure criminality\" seen in recent days. Amid speculation that police could have done more to contain trouble, Mr Godwin said he was immensely proud to be a Scotland Yard officer. He went on to praise the \"sheer bravery\" of officers who were injured during the clashes. Meanwhile, Mr Kavanagh added that police patrols will be stepped up again tonight, with many officers voluntarily scrapping scheduled leave. He also said that opportunist rioters over the past two nights are believed to be aged from their mid-teens upwards. He branded last night's wave of looting \"disgusting behaviour\" that was \"ripping apart people's livelihoods and businesses\" and vowed to bring \"speedy justice\".\nhttp://www.thesun.co.uk/sol/homepage/news/3740301/Riot-Tweeters-face-arrest.html\n\nPakistan TV Report Contradicts US Claim of Bin Laden’s Death\nInfowars.com\nAugust 8, 2011\n\nIn my recent article, “Creating Evidence Where There Is None,” about the alleged killing of Osama bin Laden by a commando team of US Seals in Abbottabad, Pakistan, I provided a link to a Pakistani National TV interview with Muhammad Bashir, who lives next door to the alleged “compound” of Osama bin Laden. I described the story that Bashir gave of the “attack” and its enormous difference from the one told by the US government. In Bashair’s account, every member of the landing party and anyone brought from the house died when the helicopter exploded on lift-off. I wrote that a qualified person could easily provide a translation of the interview, but that no American print or TV news organization had investigated Bashir’s account. An attorney with a British Master of Laws degree in international law and diplomacy, who was born in Pakistan, provided the translation below. He writes: “I have no problem with being identified as the translator, but would prefer to remain anonymous.”\nhttp://www.infowars.com/pakistan-tv-report-contradicts-us-claim-of-bin-ladens-death\n\nLondon riots: Bullet found lodged in police radio was force issue bullet\nDaily Mail\nAugust 7, 2011\n\n(London riots: Bullet found lodged in police radio was force issue bullet --Claims bullet found in police radio was issued by the force --Scotland Yard faces criticism over its readiness for the riots, despite repeated warnings.) London endured a second night of violence last night as questions were raised about the shooting by police of a suspected gangster. A mob of 200 anarchists smashed their way into shops and lobbed concrete slabs at police cars following Saturday's riot in Tottenham. And in a dramatic development, the killing of Mark Duggan came under fresh scrutiny. There were claims that a bullet found lodged in a police radio was a force issue bullet, meaning Duggan had not fired on officers as police suggested.\nhttp://www.dailymail.co.uk/news/article-2023554/Tottenham-riot-2011-London-lockdown-David-Cameron-flies-home.html\n\nAmerica's black day: Bin Laden hit team troops shot out of sky by Taliban\nAugust 6, 2011 by legitgov\nShareThis\n\n(31 dead after rocket-propelled grenade destroys Chinook helicopter --News comes as USA loses gold-plated AAA credit rating --Deadliest single incident since Afghan war began in 2001) More than 20 US Navy Seals from the elite unit that killed Osama Bin Laden have died after their helicopter was shot down by insurgents in Afghanistan. They were among 31 American Special Forces troops and seven Afghan soldiers who were killed when a rocket-propelled grenade destroyed their Chinook helicopter. The terrible development came on the day when Americans were absorbing the shock news that for the first time in its history the United States had lost its gold-plated AAA credit rating.\nhttp://www.dailymail.co.uk/news/article-2023277/Americas-black-day-Bin-Laden-hit-team-troops-shot-sky-Taliban.html\n\nSEAL Unit Supposedly Responsible for Osama Hit Killed in Copter Crash\nInfowars.com\nAugust 6, 2011\n\nSoon after it was announced – without evidence – that Navy SEALs had killed Osama bin Laden, the corporate media derisively coined a new term for skeptics – “deathers,” a word with about as much originality as “birthers” and “truthers.” CNN said the “deathers” have replaced the “birthers” as the new conspiracy lunatics. It specifically singled out Alex Jones, who said the Osama assassination was a hoax. \"My friends, this is a complete and total hoax,” Alex said, and then asked: \"Where is the body?\" The corporate media said his body was deep-sixed at sea. Few if any corporate media “journalists” (script-readers) pointed out that this explanation was a totally absurd cover story. Few dared examine why the story changed several times. \nhttp://www.infowars.com/seal-unit-supposedly-responsible-for-osama-hit-killed-in-copter-crash", "group_id": 3920, "id": 1855597}]