[{"user_id": 38285, "stars": [], "topic_id": 43753, "date_created": 1313257920.975683, "message": "Are action driven stories generally more cinematic than decision driven stories?", "group_id": 2515, "id": 1864915}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313265158.4623661, "message": "Not necessarily.  The Godfather is an decision driven story, as is The Verdict.  Both of those are cinematic.  I think what makes a movie cinematic is the vision of the director, cinematographer, and others involved in visualizing the script.  \n\nCertainly, action-driven stories may seem to be more readily cinematic because motion pictures are MOVING.  But the camera can move just as much as the subject matter.", "group_id": 2515, "id": 1865456}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313265228.5750301, "message": "Also, action-driven just means that actions drive decisions.  Conversely, decision-driven stories have decisions driving actions.  The BOTH contain actions and decisions.", "group_id": 2515, "id": 1865459}, {"user_id": 33839, "stars": [], "topic_id": 43753, "date_created": 1313272885.6808701, "message": "I do often wonder if today's pictures are less \"cinematic\" though, regardless (removing CGI from the equation).  When FFC started making films, he wasn't all that far removed from silent movies when the story had to be communicated visually (at least in comparison to today's filmmakers, many of which I wonder have even watched a full silent movie before).", "group_id": 2515, "id": 1865925}, {"user_id": 33839, "stars": [], "topic_id": 43753, "date_created": 1313273238.5887821, "message": "I also wondered the other day while my nephew was watching Sponge Bob Square Pants, how much the quick-editing of the story might be contributing to the rise of ADD in children.   It really does feel like the whole world is just speeding up, everything moving forward at a quicker pace.", "group_id": 2515, "id": 1865948}, {"user_id": 7664, "stars": [], "topic_id": 43753, "date_created": 1313286985.7091279, "message": "@JBarker tl;dr", "group_id": 2515, "id": 1866954}, {"user_id": 38285, "stars": [], "topic_id": 43753, "date_created": 1313360444.356528, "message": "@Chris_Huntley OK. Great. Some people have told me that using the verb \"decide\" in your logline is a big mistake because it tells potential readers that the screenplay isn't cinematic -- i.e. it's rubbish!!! The argument goes \"you can't show decisions\". Is this one of those silly notions victims of Syd Field and Robert McKee spread around?  :D", "group_id": 2515, "id": 1871609}, {"user_id": 7664, "stars": [], "topic_id": 43753, "date_created": 1313378177.284627, "message": "@Ville  12 Angry Men.... Cinematic?", "group_id": 2515, "id": 1873501}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313385069.5812869, "message": "It is tough to show decisions, but you can show the behavior associated with decisions.\n\nFilm is a visual medium.  You should use visual imagery to describe your story in order to MAKE it cinematic.", "group_id": 2515, "id": 1873955}, {"user_id": 38285, "stars": [], "topic_id": 43753, "date_created": 1313494369.946068, "message": "@MikeDerk Haven't seen 12 Angry Men. Is it a decision-driven story? I've seen Twelve Monkeys, though.", "group_id": 2515, "id": 1882907}, {"user_id": 39675, "stars": [], "topic_id": 43753, "date_created": 1313513226.6142991, "message": "The Henry Fonda character does decide to vote non-guilty because he felt the jury should, at least, discuss the case.  The non-guilty vote does begin the story proper for the audience, imho.  The film is a character actor trip for the fans, similar to Transformers 3 in that regard, and it seems more a play than 'cinematic'.  This gets me to thinking about Transformers 3, which I loved, and the possibility it is a decision-based storyform.  The visuals in 12 Angry Men is their growing anger, with the angry confrontation at the end of the jury room scenarios.  Oh, Chris has answered before I posted this.  Thank the Dramatica Muses that he thinks it is a decision story, too.", "group_id": 2515, "id": 1884794}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313512929.6626151, "message": "Twelve Angry Men is about a jury stuck in the jury room until a decision is made.  I'd call it a decision story.  And probably an OS of Situation too.", "group_id": 2515, "id": 1884775}, {"user_id": 7664, "stars": [], "topic_id": 43753, "date_created": 1313522222.7197089, "message": "I'd say Twelve Angry Men is about as cinematic as it can be. Lumet uses lenses and framing to enhance the drama, etc. But it is still barely cinematic.", "group_id": 2515, "id": 1885819}, {"user_id": 38500, "stars": [], "topic_id": 43753, "date_created": 1313538400.5808761, "message": "Just to be a devil's advocate here: even in Twelve Angry Men, wasn't an action the inciting incident, namely the action of the defendant at some point in the back story? Or is that structurally not significant because the defendant is not really a character in the story? Or, do we need to look at Henry Fonda's decision as the inciting incident?", "group_id": 2515, "id": 1887446}, {"user_id": 38500, "stars": [], "topic_id": 43753, "date_created": 1313540336.4329, "message": "I just added it to my NetFlix queue... haven't seen it myself in a long time.", "group_id": 2515, "id": 1887608}, {"user_id": 7664, "stars": [], "topic_id": 43753, "date_created": 1313539777.690167, "message": "The last one seems the most relevant, but I haven't seen the movie in a while.", "group_id": 2515, "id": 1887563}, {"user_id": 7664, "stars": [], "topic_id": 43753, "date_created": 1313539759.3279121, "message": "I've been thinking about this too. My notes:\n-- The decision to charge this kid starts the story.\n-- The action of the trial starts the story.\n-- The Decision of Henry Fonda just to discuss the trial starts the story.", "group_id": 2515, "id": 1887560}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313595071.1662149, "message": "The story is not about the defendant.  The story is about the jurors charged with determining the defendant's guilt or innocence based on the evidence provided during the trial, or to be more accurate whether there is enough evidence to find him guilty or not guilty.", "group_id": 2515, "id": 1893224}, {"user_id": 38285, "stars": [], "topic_id": 43753, "date_created": 1313684894.163213, "message": "Does the story Driver have anything to do with genre conventions? For example, are action movies generally action-driven? Would a decision-driven action movie feel unconventional?", "group_id": 2515, "id": 1902649}, {"user_id": 10814, "stars": [], "topic_id": 43753, "date_created": 1313768292.8406751, "message": "My guess is that a lot of crime movies are decision-driven.  From our example files, the following are Decision stories:  The Wild Bunch, Taxi Driver, Reservoir Dogs, Platoon, Lawrence of Arabia, The Godfather, The Fugitive, Chinatown, Casablanca, and Body Heat.  Even Avatar seems to be a decision-driven story (Jake's decision to take over his twins 'job' makes the whole story happen, etc.).", "group_id": 2515, "id": 1910599}, {"user_id": 39675, "stars": [], "topic_id": 43753, "date_created": 1313807871.6391189, "message": "Remembering Lawrence of Arabia in theaters during my youth, I can say that decision stories are riveting while action movies are cruising, as we are along for the ride.  I understand why some list has Lawrence of Arabia as the #1 spectacle of all time.  Decision is not a hamper to cinematic qualities, if we use Lawrence of Arabia as an example.  \n\nMaybe cinematic is a crew issue, poor guys.  They are very emotional and vocal about details during a shoot, that's for sure, at least in my limited experience.  I can understand why, if cinematic results rest on their shoulders.", "group_id": 2515, "id": 1914791}]