[{"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299858033.437114, "message": "Who (do you see ) is the IC in Maltese Falcon and what is his/her/its archetype?", "group_id": 2515, "id": 323305}, {"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299860673.3196239, "message": "For fun here are all of the characters:    \n\nSame Spade\nMiles Archer\nMiss Wonderly\nFloyd Thursby\nTom Polhaus\nLt. Dundy\nIva Archer\nEffie Perrine\nBrigid O'Shaughnessy \nJoel Cairo\nWilmer Cook\nCasper Gutman\nCaptain Jacobi\nun-named drugged girl", "group_id": 2515, "id": 323957}, {"user_id": 7645, "stars": [], "topic_id": 12336, "date_created": 1299863890.7706349, "message": "Of course, just discovered my shortlinks don't work with the new upgrade to my site, so try this instead: http://storyfanatic.com/articles/story-analysis/the-maltese-falcon-analysis", "group_id": 2515, "id": 324838}, {"user_id": 7645, "stars": [], "topic_id": 12336, "date_created": 1299863856.6295631, "message": "Hey mp, Maltese Falcon is not a complete story so you're going to have a hard time identifying an Impact Character. There is no Subjective Story (Relationship Throughline) to speak of. If you want to read more you can check out my post following our analysis in the Dramatica Users Group here - http://storyfanatic.com/sa/1166", "group_id": 2515, "id": 324835}, {"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299871117.53004, "message": "I just read through the link you referred to- interesting reading. You focus on the Bogart movie version rather than the Cortez (1931) movie which is closer to what Hammett wrote the book has  Sam sleep with Brigid,  he turns her over to the police; Effie doesn't want anything to do with him  because he turned Brigid in, AND the book ends with Effie announcing, that Iva has come to the office. (Some scholars use these three women (Chapter 3 is actually titled \"Three women\") as the fates or as the three-headed goddess- maiden/mother/crone. I do think (as was mentioned on the page you cited) that MF (the Hammett story included) is incomplete.", "group_id": 2515, "id": 325737}, {"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299871331.176012, "message": "Perhaps after thinking about other mentions on the page cited I'll open a topic for MF. BTW, from a cultural point I'm positive there is a lot the movie audience cannot fathom about the \"message\" that Hammett might have been trying to tell in his story.", "group_id": 2515, "id": 325773}, {"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299871219.888535, "message": "In addition, I think the Bogart movie has the imprint of Houston all over it to the point that this movie is \"Houston's vehicle for characters not for story.\" Again, my opinion.", "group_id": 2515, "id": 325752}, {"user_id": 7664, "stars": [], "topic_id": 12336, "date_created": 1299872138.5771339, "message": "My take on the message is that Hammett believed we could never get what we wanted, hence, when they find the MF, it's a fake. \n\nOn a different note, the first movie I tried to dissect was incomplete too. It was worth digging into, but after a while, you have to move on.", "group_id": 2515, "id": 325984}, {"user_id": 13650, "stars": [], "topic_id": 12336, "date_created": 1299876727.360743, "message": "Some have suggested it is his reflection of the geo-political events going on in the world at the time too. Others a reflection of his \"anarchist's reflection on Nationalism through the lens of the depression- No wonder folks would rather see Bogart <g> BTW, your take on the message is related to what Bogart said, right?", "group_id": 2515, "id": 326905}, {"user_id": 7664, "stars": [], "topic_id": 12336, "date_created": 1299891383.4778571, "message": "I don't recall why I think that.", "group_id": 2515, "id": 329203}]