[{"user_id": 30951, "stars": [], "topic_id": 39776, "date_created": 1308487930.8101251, "message": "Was on TV last night. Thought I'd watch it as I knew there was a storyform. Not so keen on the film though - not really my thing. I decided to storyform as it was on, then compare my notes afterwards with the Dramatica one.\n\nMy first reaction to the MC and IC was that both were in internal domains. But that can't be done in Dramatica of course. So I worked on it, and decided the IC struggle was more internal than the MC.\n\nWhen I compared, I was completely wrong. The IC was in Situation. I didn't get it, kept going back trying to work out how the IC was in a Situation.", "group_id": 2515, "id": 1431238}, {"user_id": 30951, "stars": [], "topic_id": 39776, "date_created": 1308488202.711401, "message": "We have William (Hugh Grant) as MC, and Anna (Julia Roberts) as IC.\n\nThen the light came on. I think I know what I did wrong, and want to check that. I was looking at the IC's internal struggle, where I should have been looking at the IC's position as it effects the MC. Is that right?\n\nTherefore, am I right to say that Situation could be the IC domain because it is the fact that the IC is famous, in need of love, and in London that starts the MC's conflict? In other words, the IC's fame, needs and being there is the Situation presented to the MC?", "group_id": 2515, "id": 1431267}, {"user_id": 10814, "stars": [], "topic_id": 39776, "date_created": 1308500513.0651219, "message": "Bingo.", "group_id": 2515, "id": 1432145}, {"user_id": 7645, "stars": [], "topic_id": 39776, "date_created": 1308499074.0467639, "message": "Completely.", "group_id": 2515, "id": 1432074}, {"user_id": 30951, "stars": [], "topic_id": 39776, "date_created": 1308500021.203454, "message": "Thanks", "group_id": 2515, "id": 1432124}, {"user_id": 10814, "stars": [], "topic_id": 39776, "date_created": 1308500347.879066, "message": "Bingo.", "group_id": 2515, "id": 1432136}, {"user_id": 30951, "stars": [], "topic_id": 39776, "date_created": 1308502521.5556519, "message": "I was right, AND I won Bingo? Nice! ;)   (actually, you said bingo, which means you won...... doh!).", "group_id": 2515, "id": 1432356}]