[{"user_id": 24859, "stars": [{"date_created": 1305958306.267679, "user_id": 24859}], "topic_id": 36196, "date_created": 1305938345.6712999, "message": "Hello fellow entrepreneurs! I'm building something awesome for you!", "group_id": 250, "id": 1131481}, {"user_id": 24859, "stars": [{"date_created": 1313459687.25122, "user_id": 39672}], "topic_id": 36196, "date_created": 1305938385.86781, "message": "It's called Organism and our prelaunch website and beta signups are at www.groworganism.com", "group_id": 250, "id": 1131482}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1305985580.6331079, "message": "Organism's number one goal is to empower entrepreneurs and innovators by catalyzing entrepreneurial collaboration. We believe that by centralizing where we meet, critique, collaborate, grow our teams, and even find the resources to build our startups, we can be more successful than ever, and get awesome ideas to market!", "group_id": 250, "id": 1133934}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1305988120.708936, "message": "The irony here is that if Organism existed today we (as novice entrepreneurs) would have a much easier time, and be able to benefit from: a kickass entrepreneurial community, curated content vital to an entrepreneur's education, collaboration and networking tools to create and empower teams, expert advice and a critique and development platform. With novice entrepreneurs having such a high fail rate, Organism could make the difference.", "group_id": 250, "id": 1134202}, {"user_id": 21360, "stars": [{"date_created": 1306046873.375349, "user_id": 24859}], "topic_id": 36196, "date_created": 1306019245.53339, "message": "It would help if you added some of your own credentials, number of \"team\" supporters you have, where you are located, and what benefits you plan to acquire from your own website.  If you are entry level, just be honest and state how you would learn and teach as you go.  No harm in brainstorming in groups to come up with ideas, but people want corporate backing and angel investors with networking know how.  What can you offer?", "group_id": 250, "id": 1138519}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1306078399.1300111, "message": "@Energypanacea Thanks for asking! Here is the data about Organism that you asked for. I'll make sure to include it in future writeups.  Again, thanks\n\nCredentials - Seven high-schools, a GED and a bunch of miscellaneous college credits doesn't a glowing set of credentials make.  However, I'm a tireless networker, a skilled negotiator and a proven salesman.  My co-founder is a baddass designer, with his BFA from Massart.  We are both new entrepreneurs and yes, we  will be learning on the job, and pivoting as we go. In many ways though, this is actually an asset, as we can help other new entrepreneurs and designers by relation our experiences to theirs and giving examples from Organism's growth. Also, we're working on bringing in expert entrepreneurs and mentors to add another resource to the community, and hopefully we can learn from them too!\n\nNumber of supporters- We've had a wide range of supporters: a mentorship from Dan Morris (Director of strategy and development at EA entertainment) as well as the World Bank (we were granted $1000, through the UrgentEvoke.com seed competition).  Most recently, I've also won a mentorship with Dave McClure, founder of 500 startups.  A more \"in house\" supporter is our amazing advisor Reuben Katz (@rekats, entrepreneur and angel investor with 6x startup experience) who is helping us network and find opportunities is Boston, Philly, and NY.\n\nLocation- We're based in Boston (though we've been a decentralized team for a year, in MA and NC, I will be moving to Boston within two weeks)\n\nBenefits-  If I understand the question correctly,  to mean how will I benefit from Organism, the only benefit I'm focused on is building an awesome tool for entrepreneurs.  Everything else is an aside.  (If I've misunderstood, please rephrase and I'll reanswer)", "group_id": 250, "id": 1142432}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1306392780.133101, "message": "I just changed the topic title to what could be an awesome tagline, what do you think?", "group_id": 250, "id": 1189125}, {"user_id": 14894, "stars": [], "topic_id": 36196, "date_created": 1306418678.971447, "message": "It's an interesting tagline but I don't get it. I don't understand the significance or relevance and if the relevance isn't obvious then it doesn't work", "group_id": 250, "id": 1192026}, {"user_id": 21360, "stars": [], "topic_id": 36196, "date_created": 1307146000.8058319, "message": "@GabrielMtn Your credentials are fine.  Like I stated you can get far with an honest disclosure of your services.  I have been away for a few weeks.  I honestly don't like the tagline.  Maybe try: We grow your company to live.  It is more relevant.  Good luck.", "group_id": 250, "id": 1283069}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1307295144.5595839, "message": "@Energypanacea Thanks for getting back with me!", "group_id": 250, "id": 1294315}, {"user_id": 34673, "stars": [], "topic_id": 36196, "date_created": 1307414823.441783, "message": "I agree with theguywithatie. I also think your ideas deserve more clarity.", "group_id": 250, "id": 1316239}, {"user_id": 35521, "stars": [], "topic_id": 36196, "date_created": 1307475025.2652619, "message": "hi", "group_id": 250, "id": 1326670}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1307542470.6802571, "message": "I really appreciate the feedback guys!", "group_id": 250, "id": 1337467}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1307542590.625843, "message": "@ltrain hello!", "group_id": 250, "id": 1337480}, {"user_id": 5928, "stars": [], "topic_id": 36196, "date_created": 1307549211.662003, "message": "is it a niche social network for new web/mobile entrepreneurs?", "group_id": 250, "id": 1338821}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1307603549.650682, "message": "Well, that is certainly a big part of the startup community, but I really think that entrepreneurship happens in lots of areas, so I would hesitate to say that it is for mobile/web only.  Also, I think that web tools can empower existing enterprises and B&M quite well, so we'd love to help them too", "group_id": 250, "id": 1347021}, {"user_id": 27734, "stars": [], "topic_id": 36196, "date_created": 1308223897.757077, "message": "@GabrielMtn: nice presentation for comments. And want to suggest on blog part, try increasing entries.", "group_id": 250, "id": 1409181}, {"user_id": 24859, "stars": [], "topic_id": 36196, "date_created": 1308261063.9563861, "message": "Thanks! We are definitely moving toward that", "group_id": 250, "id": 1414048}, {"user_id": 38447, "stars": [{"date_created": 1311212380.0334599, "user_id": 6624}], "topic_id": 36196, "date_created": 1311210867.800653, "message": "I'm in Tempe, AZ and I've been brainstorming with fellow entrepreneurs on this very thing. I've been to S.C.O.R.E meetings, networking events, etc. I always feel I'm being talked AT.  Yes its great hearing how you made your company succeed.  Now show me how to make MINE.  And it's always the same content: Here's how to write a business plan, Here's why you should be an Entrepreneur, Here's some books I'm reading and you should too...Blah Blah Blah. We know how to write the plan, we all read Think and Grow Rich before we were driving, we don't need to know why we should be entrepreneurs, we just are.  You don't tell Jesus why he should be a Christian. What I'm looking to create is an environment where viable ACTION is the focus! Need $10,000 in startup funding? Let's get your idea in our network and get you the funding in a week. Looking for a partner? Here's an in-person introduction to another entrepreneur also looking for a partner. Need information on importing a product? Let's have lunch with so-and-so because they are already importing. Need an website?  Well here's the name of the guy I use. Oh, you need that few hundred dollars for your tiny operation?  Well here's a list of free tools you can use to create one yourself. Take Ted.com, eHarmony, Craigslist, your local coffee shop, and smash them all together with content just for entrepreneurs.  THAT\"S what we need. We need a platform where everyday we are thinking, \"Wow that was an amazing conversation/meeting/webconference/daydream.  Now let me go do this thing and that thing TODAY because I know WHAT I should do next, I know WHY I should do it next and most importantly I know HOW to do it now.\"  We need an environment where a successful Entrepreneur is giving something of VALUE to another Entrepreneur and it's something that actionable NOW.  That is what I and my friends are attempting to put together here in Tempe.  What do you think of that?", "group_id": 250, "id": 1686280}, {"user_id": 13735, "stars": [], "topic_id": 36196, "date_created": 1311241092.6536081, "message": "Yikes! Way over my head right now. Is it an online network to help new entrepreneurs succeed? Or is it a physical meetup type networking event? Funding is no longer a selling point is it? If I need a developer I can just drop into any of the hacker communities online and start assessing anybody that's interested, designers a happily updating their graphic resumes on Dribbble multiple times a day. The un-sexy areas of entrepreneurship are where I need help. You make no mention of my insurance responsibilities or how to take care of my sales tax across international borders. Can you build a single network that can connect entrepreneurs to industry experts, how many industries can you possibly have covered?", "group_id": 250, "id": 1688000}]