[{"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310379590.617007, "message": "Also, are you monitoring \"server not responding\" errors? I've poked it a few times over the weekend, and thought that maybe you'd get an email to tell you that something's wrong. If not, might be worth setting up..", "group_id": 2873, "id": 1610700}, {"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310379373.292119, "message": "I've got three sites running on epio, two are fine since the migration. But my little \"toy\" project (which I mostly wrote to try out epio's Redis support) just refuses to work.", "group_id": 2873, "id": 1610683}, {"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310379396.5237491, "message": "The app is markdup.ep.io - it currently hangs for ages and eventually shows \"Server not responding\"", "group_id": 2873, "id": 1610686}, {"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310379468.2797689, "message": "As I said, this is in no way a critical app, but it might be useful to figure out what's going on..", "group_id": 2873, "id": 1610694}, {"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310379429.7123721, "message": "If I try to re-upload it, the epio command-line client hangs at \"ep.io: Uploading to storage\" and never gets any further.", "group_id": 2873, "id": 1610690}, {"user_id": 8740, "stars": [], "topic_id": 41634, "date_created": 1310416384.5118561, "message": "@j4mie Hmm, we had that with another app after the migration (including the hanging upload) - I've removed the app image for that app, so if you could upload another one, and then try after that, it would be great", "group_id": 2873, "id": 1615098}, {"user_id": 8740, "stars": [], "topic_id": 41634, "date_created": 1310416419.3091669, "message": "and while we do actually log the server errors, we haven't been looking at them the last few days, since the weekend was full of small errors we were hurredly trying to fix", "group_id": 2873, "id": 1615106}, {"user_id": 5980, "stars": [], "topic_id": 41634, "date_created": 1310456385.8460841, "message": "OK.. the command-line client still seems to be behaving a bit oddly (it hung for about five minutes on \"installing package redis\" but eventually it worked, and the app is up and running again. Cheers!", "group_id": 2873, "id": 1618482}, {"user_id": 8740, "stars": [], "topic_id": 41634, "date_created": 1310463789.4503779, "message": "Yeah, we're seeing large wait times on package installs for no apparent reason (it's not disk I/O, CPU or network), so apologies for that, but we'll have it fixed soon, hopefully", "group_id": 2873, "id": 1618916}]