[{"user_id": 29866, "stars": [], "topic_id": 38388, "date_created": 1307403588.642276, "message": "GetAround.com es modelo P2P de autos que ha sonado mucho últimamente en USA, funciona de una forma sencilla, como todas las grandes ideas, \"Yo particular pongo en renta mi auto\" Otro particular ingresa y selecciona el auto que le gusta para rentarlo por algunas horas. Tienen alianzas con empresas aseguradoras que se encargan de brindar un seguro a los autos de GetAround, ademas de un \"Kit\" que permite que el auto pueda ser monitoreado en caso de robo y ademas el uso de app para poner en renta o para rentar el auto, su más grande compitor Zipcar.com tiene cerca de 8000 autos inscritos y ellos llegaron en sus primeros días de lanzamiento a los 1500 autos. Es el \"Airbnb de los autos\" por tanto imagino que cobran una comision por brindar el servicio. El modelo he visto que se ha replicado en España con : http://movomovo.com", "group_id": 965, "id": 1314465}, {"user_id": 26089, "stars": [], "topic_id": 38388, "date_created": 1307404642.8646309, "message": "En airbnb, vi que no todos los mexicanos ponian en renta sus habitaciones. ¿Quiénes serían las personas que sí pondrían en renta su auto?", "group_id": 965, "id": 1314574}, {"user_id": 24160, "stars": [], "topic_id": 38388, "date_created": 1307405230.091439, "message": "Dependiendo del modelo de garantías y de autenticación yo estaría dispuesto a rentar mi auto (si lo tuviera) ;)", "group_id": 965, "id": 1314657}, {"user_id": 9432, "stars": [], "topic_id": 38388, "date_created": 1307606155.715385, "message": "Si resuelves el problema del robo de autos primero o convences a una aseguradora que cubra el costo de los autos desmantelados o desaparecidos si debe jalar sin broncas", "group_id": 965, "id": 1347247}, {"user_id": 12133, "stars": [], "topic_id": 38388, "date_created": 1307629218.823365, "message": "una startups mexicano resolacionado con autos es aventones.com", "group_id": 965, "id": 1350431}, {"user_id": 26638, "stars": [], "topic_id": 38388, "date_created": 1307628490.334456, "message": "Tal vez en ciertas ciudades, pero en el DF lo dudo, a menos que hubiera muy fuerte inversión de ventas y reclutamiento, y está también el tema los permisos, ya me los imagino tratando de obligarte a tener placas de taxi (con su elevado costo) en cada auto inscrito", "group_id": 965, "id": 1350354}, {"user_id": 29866, "stars": [], "topic_id": 38388, "date_created": 1307667790.622277, "message": "Aventones.com maneja otro modelo, ese lo había visto hace un par de años en Alemania, funciona allí desde hace mucho, pero la sociedad esta en otro nivel. Creo que los planteamientos que nos ponemos son los más complicados en un país como el nuestro. Otra cosa que pensaba es en los \"Autorobos\", creo que es un modelo muy bueno, pero solo funcionaria en algunas ciudades o tal vez haciendo algo como lo que hace \"movomovo.com\" y su \"Social Trust Rank\".", "group_id": 965, "id": 1356555}]