[{"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311709937.501864, "message": "Basically what I want my sign in workflow to do is to sign in person into my app through Google, and then log them out of Google but stay logged into my app, and redirect back to my app.", "group_id": 5196, "id": 1725829}, {"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311709864.715723, "message": "How do I log a user out of the social-auth provider? e.g., for Google, redirect to a google.com web page that removes google.com session cookie, and then redirect back to a specified url? I need to do this without actually logging out of my app.", "group_id": 5196, "id": 1725824}, {"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311713947.1303871, "message": "So it looks like the app needs to use the pape extension in the openid module to set max_auth_age. Any example code?", "group_id": 5196, "id": 1726263}, {"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311710485.7861421, "message": "After looking further, I see that openid does not support logout from provider, although Google and Yahoo have their own mechanism. What I need then is a way to set a very short age on the length of provider login, regardless of age for local login.", "group_id": 5196, "id": 1725897}, {"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311858393.82055, "message": "I figured out the solution. In social_auth.backends.__init__.py, in the OpenIdAuth.setup_request method, add the following code immediately before returning the openid_request:\n\n        if openid_request.endpoint.supportsType(pape.Request.ns_uri):\n            pape_request = pape.Request()\n            pape_request.parseExtensionArgs({'max_auth_age': '0'}, False)\n\n            openid_request.addExtension(pape_request)", "group_id": 5196, "id": 1738828}, {"user_id": 36639, "stars": [], "topic_id": 42754, "date_created": 1311858535.4922681, "message": "And also add to the top of the file:\nfrom openid.extensions.draft import pape5 as pape\n\nI noticed that even though max_auth_age is 0, it still takes around 20 seconds or so to take effect in Google. That is, after 5-10 seconds, Google won't ask for password, but after approx 20 seconds it will.\n\nI also plan to add functionality to set max_auth_Age based on the view's preference. For example, I have a particular view that is very security-sensitive for which I want the user to enter password every time, but other views are not so sensitive.", "group_id": 5196, "id": 1738863}]