[{"user_id": 21246, "stars": [], "topic_id": 12850, "date_created": 1300041486.410368, "message": "Is wasn't that long ago when we were not dependent on foreign oil.  You didn't need cars to get around. In the early twentieth century, longer distance urban transportation was provided by railroads.  Commuter rail is part of an city's public transport; it provides faster services to outer suburbs and neighboring towns and villages. Trains stop at all stations, that are located to serve a smaller suburban or town center. The stations often being combined with shuttle bus or park and ride  systems at each station. Frequency may be up to several times per hour, and commuter rail systems may either be part of the national railway, or operated by local transit agencies.", "group_id": 6715, "id": 342363}, {"user_id": 21246, "stars": [], "topic_id": 12850, "date_created": 1300268940.048542, "message": "In many cities around the world, streetcars provide important in-town transportation services.  Whether they are the old-time trolleys like there are in New Orleans, or the modern light-rail vehicles like the ones in Baltimore, they provide an important part of moving people around a city.  They are almost all electric.  That means power to move the vehicles is generated from a central source and transmitted by wires or conduit to the individual streetcars.  Using this method means that emissions from the power generating plant can be scrubbed clean before hitting the atmosphere.  Think about it.  A power plant that is stationary can have a maximum amount of emission cleaning equipment on it.  An automobile on the street has very little in the way of air-purifying equipment.  You wouldn't stand behind a car and breathe exhaust fumes.  Then, why do we allow millions of cars to pollute our atmosphere?  Electric streetcars have no emissions.  It makes a lot of sense to put a lot of electric trolleys in the streets and make it super-convenient for people to take public transportation.  Get rid of automobiles, put in streetcars.", "group_id": 6715, "id": 363974}, {"user_id": 21246, "stars": [], "topic_id": 12850, "date_created": 1301099526.9658711, "message": "Straddle-beam monorails have the potential for some of the fastest and safest transportation available.  Their placement between opposing lanes of Interstate Highways is logical.  A straddle-beam structure can be supported by a series of single concrete piers that can fit in a narrow right-of-way located between road surfaces.  Running down corridors already established by Interstate Highways, straddle-beam monorails can take a lot of the traffic density off of freeways.  On average, there are about 1.2 persons per automobile during the commuter rush-hour.  A monorail train set of cars can easily carry 120 people (and more).  Move the decimal point two places and a single monorail train set can help remove 100 cars from the highway.  Operating at a safe 2 minute headway between monorail trains, that's 3,000 cars pulled off the highway in each direction.  That can be up to 6,000 cars pulled off the highway every hour of traffic peak periods.  With three hours in the morning and three hours in the evening of peak density traffic, that's 18,000 cars in the morning and 18,000 cars in the evening that are not using foreign oil.  That's 36,000 cars that are not polluting the atmosphere.  That 18,000 cars that do not need to be parked.  These figures are conservative.  It's easy to see that the benefits to commuters are enormous.  Corridors like Frederick, Maryland to Washington DC and to Baltimore offer tremendous potential for high-speed straddle-beam monorails.  A triangle route service could help alleviate the notoriously bad traffic situations encountered in the beltways.  There are many places in these United States that could be helped by straddle-beam monorails.", "group_id": 6715, "id": 443622}]