[{"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305646247.8643889, "message": "What religious actions of the church interfere with the witness of the church?", "group_id": 9787, "id": 1084312}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305646562.599762, "message": "1) Superiority complex\nIn the last century churches developed a perspective that somehow Christians were better than everyone else. People in church were perfect. I know many modern churches attempt to combat this view these days, but the direct offshoot of this is that non-believers look at any mistakes Christians make as evidence that we are wrong. This remains a major issue especially in Islamic countries.\nWorse, it seems that even the efforts to break from this view result in the view perpetuating. I watched a video at our church, which I've mentioned, where various people talked about how great their church was. It was all arty style ala Nooma videos. Slick and neat. The talked about how their church was loving and not judgemental and all these things. But the people were unreal - all clean and together and soft spoken, wise and blessed. Now, sure this can result from meeting Jesus, but I couldn't help thinking that there was nothing there for a poor lost sinner to connect with. They were all too perfect still :/", "group_id": 9787, "id": 1084345}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305646763.425071, "message": "2) Argumentative Christianity\nThis stems from a desire to be right and prove non-Christians wrong. The simplest example is to put a 6000-year-old earth creationist opposite a non-believing evolutionist. The creationist will go to great lengths to prove the evolutionist is wrong. And totally destroy any witness to that person. Why do we always need to be right? it's usually on debatable issues anyway that have limited proof. But we will fight tooth and nail to prove our rightness. This is not the path of humility. God doesn't need us to defend Him. He needs us to love people no matter what the believe or do!", "group_id": 9787, "id": 1084355}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305646255.6799209, "message": "I'll start with 2 examples", "group_id": 9787, "id": 1084314}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305654112.273947, "message": "@pevans_om I'm not too against what you call \"Argumentative Christianity\". I think it can be healthy and constructive. I have had many wrong views on God, Christ, love and have come to a better understanding from a constructive conversation with other Christians. Sort of what we have going here at Convore.\n\nSure it can be taken to an extreme where you have fools saying that if you're not a young earther then you're not Christians. Or not in any debatable topic position the same as them for that matter. But that can be tackled in it's own constructive conversation.", "group_id": 9787, "id": 1085452}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305654955.944083, "message": "@pevans_om Another note on the \"Argumentative Christianity\"... I have never seen it as a defense for God. It is me making a defense for my hope (1 Peter 3:15). I also find it helps me solidify what and why I believe. It edifies me when proof is given for the things the Bible claims.\n\nI think there is a weakness when you are asked why you believe X (which seems like hocus pocus to say an atheist) and you cannot give a reason. Because I always thought that? Cause my teacher says so? Cause my church says so?\n\nPersonally I don't really care about the age of the earth. That debate has never tickled my fancy though :)", "group_id": 9787, "id": 1085597}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305654450.92715, "message": "@pevans_om I think sometimes I am guilty of a \"Superiority complex\". Especially when I am having a \"Constructive Conversation\" with an atheist. Sometimes I feel like I am talking to a brink and I think the person is a fool for not understanding the way I understand. For not making the right choice.\n\nI do get reminded though that I was that fool. I was against God. I was sinful. I was dead. And only through the Grace of God am I saved not because of anything I could offer. Not because I was super smart. Not because I understood.", "group_id": 9787, "id": 1085538}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305663967.72155, "message": "The argumentative christianity that is wrong (I think, and which I think Paul means?) is the idea that if you win the debate centred around e.g. evolution. as if christianity depended on a old or young earth creation...  If you can just argue the person into believing 6000 year old earth, that will save their souls!\n\nArguing, or debating within christian fellowships is healthy as long as it's done properly... \n\nI don't think I suffer from superiority complex, I mean, not specifically because I am a christian... Of course generally i am, but not BECAUSE i am christian, just because.\n\nThe nooma style slick Christianity looks very much like Scientology recruitment dvd's... Only they seem to make more money and keep more people.", "group_id": 9787, "id": 1087753}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305664152.0906651, "message": "3) Not living in light of saving grace. The traditional witness of the grace received, Romans 12 type thing, because of the grace extended to us by Christ, offering our lives as living sacrifices. That sometimes gets subverted by the whole superiority complex maybe? \n\nIt's almost like a israelite idea that we are now somehow morally superior to non christians by design. I am in the club and clean and you are not, and i can't touch you, because you will make me unclean.", "group_id": 9787, "id": 1087800}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305704319.5447409, "message": "A further note on 2) which seemed to be missed is the attitude. The desire to prove my perspective is right at all costs", "group_id": 9787, "id": 1094203}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305704830.0377679, "message": "4) Christian activities and sub-culture \nToo often Christians create an 'exclusive club' type feel. We have our own set of 'Christian' everything. Christian music, Christian books, even Christian movies these days. Now there's nothing patently wrong with any of these, but we seem to be creating a Christian culture to the exclusion of the world. We want to keep ourselves away from 'secular' activities with those dirty sinners just in case we get tainted. As Dr Richard Beck says, \"By the way, God is over there. Yes, with those people.\" (It's closely related to 1 & 3 really)", "group_id": 9787, "id": 1094335}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305704256.015075, "message": "@penkin  @LintonCaldecott You both are missing the point for number 2. The topic is what things damage our witness. So I'm not talking about Christian debating Christian. I'm talking about how we deal with non-believers! \nSo the point is to look at traditions or attitudes that negatively affect our ability to reach others with God's love.", "group_id": 9787, "id": 1094181}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305704355.056771, "message": "@LintonCaldecott 3) is very similar to what I was thinking about with 1)", "group_id": 9787, "id": 1094208}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305733776.5904789, "message": "But I will try think hard. My brain does not store much :(", "group_id": 9787, "id": 1099349}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305733754.51437, "message": "heh... I seem to have no opinion on \"Religious Interference\" :) Sorry. Maybe I'll allow my brain to spend a few cycles on it.\n\nI think it may be because I don't deal with any of these often enough. Never argued with someone about something non-essential that told me i was going to hell or anything like that. Never had a non-believer tell me that our \"sub-culture\" made him/her feel out.", "group_id": 9787, "id": 1099344}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305745660.2427011, "message": "@pevans_om... I don't think I missed the point, I was essentially expanding on what you meant, \"proving my argument at all costs because that is the point, win an argument, win the soul!\"...", "group_id": 9787, "id": 1101724}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305748174.3027561, "message": "@pevans_om you can engage with non christians without compromising yourself with activities of dubious value. For each it may be different, the ex wild clubber should maybe stay away from clubs... Or pub hopper keep away from pubs, as an example. Jesus socialized with all kinds, doesn't mean he participated in their activities. But I do agree with the idea that building walls to protect ourselves can end in exclusive style hyper moralism. Engaging with people on their world view and challenging it requires knowing what it is,  which can be learned through the secular media. Which makes my question about the whole 'entertainment' thing more complicated.", "group_id": 9787, "id": 1102432}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305783752.946537, "message": "@LintonCaldecott I am not sure if others think that arguing their point wins souls. How I understand it it is to answer objections.", "group_id": 9787, "id": 1108552}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305783942.967099, "message": "me. Sometimes i argue like that.", "group_id": 9787, "id": 1108578}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305783985.0891769, "message": "Thats better :) So now we can talk about your experience and why you'd be like that? How you try overcome it?", "group_id": 9787, "id": 1108586}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305783850.4528849, "message": "http://www.youtube.com/watch?v=PySzv2RxwdM", "group_id": 9787, "id": 1108565}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305783918.9739051, "message": "Who are these people though? Sometimes I feel we are to vague here? Like there is this huge problem with no solutions?", "group_id": 9787, "id": 1108573}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305783870.431623, "message": "you are talking about what you do, Paul is talking about what is an interference to the witness. which is to argue and win the argument at all costs. I just said that it is almost as if the argument is the POINT... rather than drawing people to Christ.", "group_id": 9787, "id": 1108568}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305785750.4999471, "message": "http://www.youtube.com/watch?v=oJjLlJb1wE0", "group_id": 9787, "id": 1108814}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305795090.3810489, "message": "@LintonCaldecott That's a good explanation. Thanks :) Think I'll use that video the next time this comes up. That's pretty much how I see and understand the role of apologetics.", "group_id": 9787, "id": 1109625}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305796687.805485, "message": " I would like to highlight these things because all too often we do things because they are tradition or because they are popular 'christian' culture and we do not appreciate how people outside the church perceive them and how they negatively impact the image of God for these people.", "group_id": 9787, "id": 1109797}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305796783.1993189, "message": "A more concrete example: Because of the American claim to be a Christian nation and the related portrayal of Hollywood movies, people in Turkey believe that Christians all get drunk, are promiscuous and intolerant. It's a terrible obstacle to the witness in that country!", "group_id": 9787, "id": 1109804}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305796931.856647, "message": "Please note: These aren't necessarily anything any of us or our own churches are involved in. It's more an attempt to analyse the greater Christian community and try to identify areas that cause issue in the hope that we can avoid them ourselves. I wouldn't go so far as to think we could actually solve these issues on a global scale :)", "group_id": 9787, "id": 1109817}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305796623.3134511, "message": "I know these can be a bit vague. Perhaps I am exposed to this a lot more because of directly working in a more evangelically focussed position. I often get to see the fallout of these things I've mentioned. People disillusioned with God because of a failing of the 'church'. @LintonCaldecott mentioned people disillusioned by Rhema in another thread.  Maybe he can expand on some of the reasons for that disillusionment here.", "group_id": 9787, "id": 1109791}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1305879707.8200581, "message": "5) Stupid viral emails promising joy/love/peace/blessing if you pass on the feel good message to X people. Also the email questions your faith/Christian conviction if you don't.", "group_id": 9787, "id": 1122603}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305880717.60885, "message": "@penkin Ja good one. Add to that Facebook 'post this on your wall if...\" posts", "group_id": 9787, "id": 1122804}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1305880734.431457, "message": "6) I love Jesus or fish stickers on the back of your car :)", "group_id": 9787, "id": 1122810}, {"user_id": 32888, "stars": [], "topic_id": 35658, "date_created": 1305897501.395947, "message": "'It takes a REAL man to follow Jesus' stickers.", "group_id": 9787, "id": 1125377}, {"user_id": 13817, "stars": [], "topic_id": 35658, "date_created": 1306227045.8278141, "message": "7) The email about laminin molecule and how it looks like a cross... BAM! Shows how amazing our God is, He even designed this molecule like a cross. Ummmm not so much: http://www.snopes.com/glurge/laminin.asp http://www.expose.therootofallproblems.com/wp-content/media/2010/12/laminin.png", "group_id": 9787, "id": 1163898}, {"user_id": 32900, "stars": [], "topic_id": 35658, "date_created": 1306241631.9472001, "message": "@penkin Ja, I think the same about the cross in the nebula....pfff...seriously man! You can see shape associations anywhere if you look.", "group_id": 9787, "id": 1165401}]