[{"user_id": 8781, "stars": [], "topic_id": 45348, "date_created": 1316089680.8842111, "message": "I'm Tom and I work for 383 Project in the Jewellery Quarter, I do bits of backend and frontend web dev in PHP and occasionally ruby, what about you?", "group_id": 11647, "id": 2133448}, {"user_id": 8781, "stars": [], "topic_id": 45348, "date_created": 1316089618.247138, "message": "There's always people I never get to speak to at HydraHack so thought this would be a good place to introduce yourselves.", "group_id": 11647, "id": 2133440}, {"user_id": 41047, "stars": [], "topic_id": 45348, "date_created": 1316092326.9206631, "message": "Woo - I'm Omar, I work for Foxsoft in Tamworth - I dabble in everything really, but working as a Rails and PostgreSQL developer", "group_id": 11647, "id": 2133639}, {"user_id": 41059, "stars": [], "topic_id": 45348, "date_created": 1316100763.325666, "message": "I'm Michael, I work for myself as a freelance developer and designer. I'm working for a PR company at the moment building a website for them (hence why I haven't come to the last hydrahack). Usually use Wordpress, but now getting in to the swing of Symfony2.", "group_id": 11647, "id": 2134656}, {"user_id": 41057, "stars": [], "topic_id": 45348, "date_created": 1316100509.244662, "message": "Hey, I'm Iain, I work for Sync Studios which is in the Jewellery Quarter, I mainly write restful api's for mobile applications in PHP, and occasionally I get to work on front end stuff. As a hobby I'm writing a game using Javascript, I know, I know, Its the 2011 version PHP Framework spam, but someone has too :P", "group_id": 11647, "id": 2134621}, {"user_id": 41048, "stars": [], "topic_id": 45348, "date_created": 1316101321.508548, "message": "I'm Andy, I also work for 383 Project in Jewellery Quarter. Working on frontend and backend, mainly with WordPress. Also develop iOS apps such as Magic Bean an iOS app for Beanstalkapp.", "group_id": 11647, "id": 2134739}, {"user_id": 41082, "stars": [], "topic_id": 45348, "date_created": 1316162344.489002, "message": "I'm Noel and I'm apparently the face of HydraHack 0.6 (along with Antonio)", "group_id": 11647, "id": 2141256}, {"user_id": 41082, "stars": [], "topic_id": 45348, "date_created": 1316176393.8803329, "message": "More usefully: Right now I'm doing quite a bit of work using Scala, which is a nice language that runs on the JVM. I'm very interested in machine learning, as those of you who know about Myna (http://mynaweb.com/) already know. I also work in Python, PHP, and Ruby from time to time, and dabble in more esoteric languages.", "group_id": 11647, "id": 2141939}]