[{"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304357887.617491, "message": "@awfy What means \"help you find someone who can help you\". Them put you in contact with a lawyer expert of immigrations, or what else?", "group_id": 95, "id": 886472}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304357485.9171331, "message": "If I incorporate the company there, how can I stay in USA for many years or immigrate there?", "group_id": 95, "id": 886362}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304357554.7622321, "message": "By now I'm finalist in one of the American incubator, but one problem for my selection is how I'll be able to stay there with my company... The incubator is not really able to help me", "group_id": 95, "id": 886383}, {"user_id": 2597, "stars": [{"date_created": 1304522788.379714, "user_id": 769}], "topic_id": 33215, "date_created": 1304357444.907572, "message": "apply to incubators such as YC, TechStars, AngelPad.... if you can get in, they'll help you out with visa issues. Good luck!", "group_id": 95, "id": 886353}, {"user_id": 13999, "stars": [], "topic_id": 33215, "date_created": 1304357742.080512, "message": "@equinox YC doesn't really offer help with VISA issues, they can help you find someone who can help you but that's about it.", "group_id": 95, "id": 886440}, {"user_id": 13999, "stars": [], "topic_id": 33215, "date_created": 1304357954.0264809, "message": "@ccarnino I think they can give you advice on who you can speak to in order to make the process easier for you. They recommend simply speaking to the other founders who have moved from outside of the US as well, as they obviously have first hand experience of the whole thing.", "group_id": 95, "id": 886486}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304358773.6718681, "message": "@awfy Understood. I'll try to seek foreign YC founders to ask for their experice ;)", "group_id": 95, "id": 886580}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359519.618933, "message": "If you live in an eligible country and you find investors in your own country you can move with an E2 visa", "group_id": 95, "id": 886757}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359419.610534, "message": "Here are a couple of options: 1. Marry a us citizen (but not in california :))", "group_id": 95, "id": 886732}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359443.1795039, "message": "Take part in the green card lottery, if you are citizen of an eligible country", "group_id": 95, "id": 886737}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359492.4330471, "message": "create a us company, work for that company in your home country and then transfer with an L1 or 2 visa. Will probably not work though", "group_id": 95, "id": 886749}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359549.743479, "message": "if you have 500k ready to invest you can go for an eb-5 visa. :P", "group_id": 95, "id": 886765}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359583.32339, "message": "you can also try to apply for the extra ordinary abilities visa, but that one is very hard to get, will most likely not apply to you", "group_id": 95, "id": 886772}, {"user_id": 13999, "stars": [{"date_created": 1304376516.253973, "user_id": 31823}], "topic_id": 33215, "date_created": 1304359661.6494961, "message": "Best advice really is to get yourself a Visa lawyer who understands all this far greater than you will. I know that @olivercameron has been through all of this before and has horror stories to go with it :P", "group_id": 95, "id": 886798}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359602.9385209, "message": "you can try to get hired by a us company, and if you are eligible you can go for an HB-1. Not easy", "group_id": 95, "id": 886779}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304359723.233567, "message": "Well, the funny thing about us visa lawyer is that most of them are pretty clueless themselves. Finding the right one is a challenge by itself. A lot of horror stories at this end too...", "group_id": 95, "id": 886815}, {"user_id": 2597, "stars": [], "topic_id": 33215, "date_created": 1304361345.9500661, "message": "@awfy at least that's a start =)", "group_id": 95, "id": 887246}, {"user_id": 13999, "stars": [], "topic_id": 33215, "date_created": 1304360886.9092269, "message": "Biggest problem we're facing is finding someone who will rent to people on the Visa Waiver program.", "group_id": 95, "id": 887124}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304361122.713695, "message": "yeah, that can be tough. I rented the first time from a real estate broker who was on business in Tuscon for a couple of months, that was a luck coincidence. The second time I went for one of those corporate apartments, way overpriced, but they rent out to everybody who can demonstrate that he has cash. Wait till you try to buy a car.... :P", "group_id": 95, "id": 887189}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304361192.4314051, "message": "Most importantly you need to get your credit history up and running. Get yourself 2 secured credit cards, BoA does them, not sure which other bank, and use them (up to 30% of the spending limit).", "group_id": 95, "id": 887206}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304364881.8752179, "message": "(Depression...)", "group_id": 95, "id": 888161}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304364872.265573, "message": "Oh man it's really a disaster...", "group_id": 95, "id": 888157}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304364927.4658821, "message": "There's no way, to be in US, base the company there, get a US investor and get a fucking visa? No way?", "group_id": 95, "id": 888174}, {"user_id": 25716, "stars": [], "topic_id": 33215, "date_created": 1304365528.970464, "message": "Sounds insane", "group_id": 95, "id": 888343}, {"user_id": 28007, "stars": [], "topic_id": 33215, "date_created": 1304365928.7659891, "message": "Get in, launch, fly to mexico, Canada or the Bahamas every 3 months and file with a good lawyer for papers.", "group_id": 95, "id": 888440}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304367436.318465, "message": "ccarnio it's tough, but doable. As diegotwix pointed out the tourist visa goes a long way, it allows you to establish a company and everything that is necessary, but it does not allow you to work for the company as an employee. there is also the B visa, if I recall correctly, which is basically a 6 month visa. Be prepared to fly a lot though :)", "group_id": 95, "id": 888838}, {"user_id": 31823, "stars": [], "topic_id": 33215, "date_created": 1304376610.337496, "message": "Moving a startup from anywhere to the USA is an absolutely miserable experience, but totally worth it. The biggest piece of advice, that @awfy mentioned above, is to get an immigration lawyer. You will have a much better chance of being accepted if you have investment already, or lots of revenue. Feel free to email me for more advice (oliver@taptivate.com).", "group_id": 95, "id": 890562}, {"user_id": 12133, "stars": [], "topic_id": 33215, "date_created": 1304378063.6749229, "message": "are you hear about startupchile.org the contry give you 40,000 USD for your stay 6months.", "group_id": 95, "id": 890693}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304407531.0709741, "message": "Tnx all for the support", "group_id": 95, "id": 894989}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304407632.3724239, "message": "By now I've found a lawyer that help you with this stuff (that is really expansive, $170 just to an information call...) and they doesn't grantee the visa. Do you know some other lawyer with good feedback", "group_id": 95, "id": 894999}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304407635.6529689, "message": "?", "group_id": 95, "id": 895000}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304407702.2440691, "message": "@zodman Yes, I know, but my market is US, so I prefer to go there", "group_id": 95, "id": 895006}, {"user_id": 1901, "stars": [{"date_created": 1305740705.4290509, "user_id": 22804}], "topic_id": 33215, "date_created": 1304487106.496278, "message": "We're from Europe and we've had no problems coming here. Get a B1/B2 US visa. It allows to be in US and seek venture capital, but not manage business. Since you applied for incubator, this is just a preparation stage for making a business. When you get series A investment, you can then employ yourself and apply for H1B temporary work visa or get L1/L2 visa. Read carefully the US visa rules so you will be able to successfully navigate questions from consul. It helps if you have a job at home and a proof (money) that you will be able to sustain yourself in US. There is no problem for foreigners to set up a Delaware company in US.", "group_id": 95, "id": 908735}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304503784.0028341, "message": "@tantadruj Tnx! By now we're going to request the B1, but we've not strong relations with the Italy (no homes, cars, etc). We have just the University that we've not finished (also if this year we're not subscribed, 'cause we're working on our startup) and a motorcycle. Also not much money... I hope to demonstrate that I really will come back home to my family", "group_id": 95, "id": 911457}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304503796.096354, "message": "I hope it will be enough...", "group_id": 95, "id": 911459}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304520521.3870089, "message": "ccarnino: This is actually a good point, if you have to argue: You have to finish university back at home. The fear that US immigration has is that you don't go back home before the Visa expires.", "group_id": 95, "id": 913620}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304521969.23207, "message": "ok great!", "group_id": 95, "id": 913890}, {"user_id": 9018, "stars": [], "topic_id": 33215, "date_created": 1304536584.913322, "message": "@martin_sunset  your L1 comment is false. This wont work (L1's are only issued to large international corporations).", "group_id": 95, "id": 918028}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304681456.4240401, "message": "@deancollins blanket L1 visas are only issued to large corporations, individual ones work for smaller companies as well, as long as they have a real office in the home country. I know people personally who got their L1's with less than 25 employees.", "group_id": 95, "id": 940662}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304684377.06863, "message": "@martin_sunset Not suitable for a startup, so...", "group_id": 95, "id": 941298}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1304687539.2467821, "message": "@ccarnino actually it is. A lot of startups have been founded outside the US; then opened an office in the US", "group_id": 95, "id": 941858}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304690194.826154, "message": "Right. It's not suitable for us", "group_id": 95, "id": 942190}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1304690197.898639, "message": ":)", "group_id": 95, "id": 942191}, {"user_id": 12963, "stars": [], "topic_id": 33215, "date_created": 1305677444.436224, "message": "Stay where you are and create a truly compelling app.  Not compelling?  Then sure, go to the USA or elsewhere and seek funding.", "group_id": 95, "id": 1090245}, {"user_id": 1692, "stars": [], "topic_id": 33215, "date_created": 1305703684.3324549, "message": "Adding to that, i actually know a guy from Italy who was involved with HackFwd as a Referrer who could maybe take a look at your idea and connect you with the right people. I could also refer you to HackFwd if that is a program that would suit you and i like your concept ;)", "group_id": 95, "id": 1094108}, {"user_id": 1692, "stars": [{"date_created": 1305715051.798409, "user_id": 15141}], "topic_id": 33215, "date_created": 1305703272.565176, "message": "@ccarnino Question is, why do you need to be in the US so badly ? There are Investors and Startups programs in Europe aswell. Actually i run a startup out of germany and we could win Hackfwd.com (similar to YC) as our investors. Until now it has been an awesome experience.", "group_id": 95, "id": 1094046}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1305721756.5392649, "message": "I don't like the startup scene of Italy (also the Italian referral for HackFwd). Everybody is able to talk, but there are really few people who are really involved in creating/investing in something. Primary 'cause in the Italian culture, the young are not a resource to bet on, but just a resource to exploit...", "group_id": 95, "id": 1096412}, {"user_id": 5136, "stars": [], "topic_id": 33215, "date_created": 1305721856.7852581, "message": "I want to head in US, 'cause it's a bigger market for our product. I know that's it is possible also in Europe, but I just want to be in an environment that helps me, 'cause there are a lot of problem in the Entrepreneurial environment, so I'd like to be somewhere that I can give the best", "group_id": 95, "id": 1096423}, {"user_id": 26065, "stars": [], "topic_id": 33215, "date_created": 1305731239.9964421, "message": "@arnewieding so many reasons. It is a different game in the US. Access to capital is much easier, valuations are higher, people understand and appreciate the concept of stock options, you have tech friendly markets for early adopters, which is especially relevant for mobile startups, you meet the people that matter much easier by just attending meetings like hackers and founders, you can actually show up the next day when you get a call from a VC,... The list goes on. I have founded companies (the largest had 45 employees) in Europe and frankly I would never ever do it again.", "group_id": 95, "id": 1098545}]