[{"user_id": 12843, "stars": [], "topic_id": 6826, "date_created": 1297929943.891072, "message": "I also plan to hook logging into Sentry - one question is how should developers expect to get log messages? django-debug-toolbar? StreamHandler + runserver?", "group_id": 81, "id": 129987}, {"user_id": 1127, "stars": [{"date_created": 1297932286.736407, "user_id": 1}, {"date_created": 1297951587.63112, "user_id": 1126}], "topic_id": 6826, "date_created": 1297932204.214083, "message": "We use django-devserver (also written by myself) which adds threading and has some hooks for better output in the terminal. I guess I've never seen very useful log messages (could be that we're just not in the practice of using it in debug fashion)", "group_id": 81, "id": 130115}, {"user_id": 927, "stars": [{"date_created": 1297958232.3474801, "user_id": 2588}], "topic_id": 6826, "date_created": 1297947346.557364, "message": "One good way to get in that habit is to use logging as the only means of messaging in your console apps (management commands, etc) as it tends to sharpen the focus on consistent formatting, levels, etc.", "group_id": 81, "id": 131297}, {"user_id": 927, "stars": [], "topic_id": 6826, "date_created": 1297947282.92998, "message": "I use this in my by dev_settings.py to get console logging cave-man simple: https://gist.github.com/c4700c5007d008952952. Echoing what David said, however, the most useful messages I see are usually the ones which we've written into various low-level frameworks as many authors aren't in the habit of logging operationally-useful messages.", "group_id": 81, "id": 131288}, {"user_id": 13327, "stars": [], "topic_id": 6826, "date_created": 1297979040.7929089, "message": "I just added django-sentry to a few of my projects. The only reason I did so was that I was getting sick of getting blasted with tons of emails when something goes wrong. Now I can point my co-workers to /sentry and we can all see wtf is going on.", "group_id": 81, "id": 136353}, {"user_id": 13327, "stars": [{"date_created": 1297986547.903712, "user_id": 141}], "topic_id": 6826, "date_created": 1297979131.8054841, "message": "That said, that's all i've used it for. I haven't added my own logging support, anywhere... Can someone shed some light on this? What are some good examples on how to make sentry more useful?", "group_id": 81, "id": 136354}, {"user_id": 7376, "stars": [], "topic_id": 6826, "date_created": 1297980399.4804871, "message": "At scripps we started sending ellington emails to a gmail address and I added a \"In-Reply-To\" header that looked like this: django.models.places.PlaceDoesNotExist:/opt/local/btop_bundle/django/core/meta/__init__.py:899", "group_id": 81, "id": 136631}, {"user_id": 7376, "stars": [], "topic_id": 6826, "date_created": 1297980436.5942121, "message": "the In-Reply-To Header made gmail group the emails by exception type and location it was raised.", "group_id": 81, "id": 136649}]