[{"user_id": 4581, "stars": [], "topic_id": 15625, "date_created": 1301238818.721859, "message": "I'm in a team working on a web-based platform, and we want to make sure we're building the \"right product\".", "group_id": 250, "id": 451359}, {"user_id": 4581, "stars": [], "topic_id": 15625, "date_created": 1301238898.8074901, "message": "It's got some similarities to other services, but there are also significant differences.  We're struggling to validate that it's something people will use (But we think it's cool!).", "group_id": 250, "id": 451367}, {"user_id": 4581, "stars": [], "topic_id": 15625, "date_created": 1301238983.7154231, "message": "So the question remains:  How do we find out if someone would want to use this?  Just ask people? Build it first? Combination of those?  Something else?", "group_id": 250, "id": 451376}, {"user_id": 22627, "stars": [], "topic_id": 15625, "date_created": 1301251402.791127, "message": "Sharing since the begin. Share your Alpha service with your friends and with your friend's friends. Share with us, if you wish. This is the only way :-)", "group_id": 250, "id": 452374}, {"user_id": 224, "stars": [{"date_created": 1301430934.028311, "user_id": 26373}], "topic_id": 15625, "date_created": 1301255648.1649621, "message": "Build the minimal functional product that addresses the use cases/problem statements of the target customers/market and get some real people to try it... if they can use it to actually do something useful, then it's valid", "group_id": 250, "id": 452520}, {"user_id": 6688, "stars": [{"date_created": 1301282559.363045, "user_id": 4581}], "topic_id": 15625, "date_created": 1301269099.351881, "message": "Also; you may find that those conversations may lead to new product ideas (or variations on the product you were thinking of building)", "group_id": 250, "id": 453439}, {"user_id": 6688, "stars": [{"date_created": 1301282697.2977901, "user_id": 1}, {"date_created": 1301282707.6816609, "user_id": 4581}], "topic_id": 15625, "date_created": 1301269030.0432401, "message": "Before you build, it's worth cold-calling a couple of potential customers and gauging interest. If your description of your problem doesn't generate some interest, you know you're on the wrong track.", "group_id": 250, "id": 453437}, {"user_id": 21360, "stars": [], "topic_id": 15625, "date_created": 1301269704.0783031, "message": "@djchall Great advice.  With a minimal functional product you can get your potential customers to use the service and they can make tweaks in the products design.  If you email them updates on advice you used, you will make them emotionally connected to your product.  Get them to commit early to orders and that will help fund your final product.", "group_id": 250, "id": 453482}, {"user_id": 4581, "stars": [], "topic_id": 15625, "date_created": 1301282655.9040949, "message": "@freakboy3742 We've been talking to a number of folks, and there seems to be a lot of interest, but each conversation has lead to numerous divergent ideas.  We're having a problem picking which MVP to build!  :)", "group_id": 250, "id": 454517}, {"user_id": 7172, "stars": [], "topic_id": 15625, "date_created": 1301294849.1312001, "message": "@bkmontgomery submit your site to alphalist.co where a community will help you gain validity that your product is needed or not. Also submit it to startuplist and BetaCandy.com for visibility and opportunity. Any questions about them, just ask :)", "group_id": 250, "id": 455760}, {"user_id": 25414, "stars": [], "topic_id": 15625, "date_created": 1301319157.383188, "message": "Once you have done your Market research, you should have a realistic vision of where you want to go. Listen to the potentials - but don't let these early customers/potentials pull you in all directions. Be focused.", "group_id": 250, "id": 457781}, {"user_id": 24838, "stars": [{"date_created": 1301379291.5963399, "user_id": 4581}], "topic_id": 15625, "date_created": 1301325273.010736, "message": "Lots of good suggestions here.  I think the primary things are:  retain your focus on meeting customer needs, share early and iterate functionality based on those interactions, and avoid shiny object syndrome - don't bounce around a lot with the ideas.", "group_id": 250, "id": 458527}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331525.03297, "message": "the reason to talk to customers/potential users is to understand problem statements", "group_id": 250, "id": 459820}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331746.652859, "message": "especially the Chapter 35, which is an interview with Xobni CEO Jeff Bonforte, where he talks about his idea of the \"Emotional Adoption Curve\"", "group_id": 250, "id": 459871}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331831.063751, "message": "for example: xobni solves the problem of how to manage an email in-box... if you've heard people talk about how overwhelmed they are by email, or fulminating against Outlook (or gmail, or Apple Mail) you know there is a lot of anger and frustration in that area", "group_id": 250, "id": 459892}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331512.107404, "message": "@bkmontgomery listen to your customers, but don't get too caught up in their ideas", "group_id": 250, "id": 459811}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331530.0996001, "message": "not to get ideas on what to build", "group_id": 250, "id": 459822}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331692.7248631, "message": "There aren't a lot of great books in this area, but one I can recommend is Marty Cagan's \"Inspired: How to Create Products Customers Love\"", "group_id": 250, "id": 459865}, {"user_id": 224, "stars": [], "topic_id": 15625, "date_created": 1301331776.4836299, "message": "the gist of which is that very successful products tend to solve a problem statement that has a high emotional weight", "group_id": 250, "id": 459878}, {"user_id": 22729, "stars": [{"date_created": 1301379390.6120491, "user_id": 4581}], "topic_id": 15625, "date_created": 1301376987.0323341, "message": "I recommend Business Model Generation by (osterwalder?). It provides some great exercises in trying to model your business idea. It forces you to think through the different parts of your idea. By doing this, it will probably help you decide which idea to pursue.", "group_id": 250, "id": 466556}, {"user_id": 22729, "stars": [], "topic_id": 15625, "date_created": 1301377046.512167, "message": "Secondly, do some prototyping. There are a number of good tools out there that help you prototype. I wish I spent more time at this stage.", "group_id": 250, "id": 466558}, {"user_id": 22729, "stars": [], "topic_id": 15625, "date_created": 1301377110.98364, "message": "Lastly, take your bare feature set and cut it in half. Reason being that things always take twice as long and you never really need as many features as you think. Also have a fierce debate over what is really needed.", "group_id": 250, "id": 466561}, {"user_id": 4581, "stars": [{"date_created": 1301460825.868613, "user_id": 22729}], "topic_id": 15625, "date_created": 1301379420.399615, "message": "@freshfunk I'm actually reading through this book now, and I've found it to be a great resource!", "group_id": 250, "id": 466767}, {"user_id": 23304, "stars": [], "topic_id": 15625, "date_created": 1301401225.1090209, "message": "@freshfunk do you use optimize.Ly to prototype or A/b best?", "group_id": 250, "id": 469008}, {"user_id": 23304, "stars": [], "topic_id": 15625, "date_created": 1301401129.355356, "message": "This is great advice for building a product that is incremental, but not as easy for disruptive products.  Putting up the MVP for market testing and iterating fast is better than just using alphalist or similar services b/c you will never cross the chasm with only early adopters", "group_id": 250, "id": 468998}, {"user_id": 23304, "stars": [], "topic_id": 15625, "date_created": 1301401299.9205811, "message": "Remember the difference between the bleeding edge and mainstream adoption", "group_id": 250, "id": 469011}]