[{"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571009.6208489, "message": "This is a thread to respond to a long response in \"MC Concern, ebbs and flows\" that goes OT", "group_id": 2515, "id": 199735}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571246.706955, "message": "This could also be highly personalized -- if the OS is Physics (say) and they are doing something like \"getting someone elected to office\" or \"building a time machine\" then all of that activity is the OS, and this guy's personal hang-up about his dad is private, or at least, uniquely his.", "group_id": 2515, "id": 199813}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571030.2460289, "message": "1. In your first example “the clear up dad's conviction” I'm not sure I erven see that as a “true” MC Concern. I see that as more of a “OS Concern” . My understanding is that the MC concern is more private. Unless I've really misunderstood something. Clarification anyone?", "group_id": 2515, "id": 199741}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571275.1362269, "message": "2. As for your “comment” about benchmark “measures how strong something is” again that is not my understanding of “benchmark. My understanding of “benchmark” is (I looked it mentions “measuring stick”) . For me the “measuring stick is simply showing the points of change not the speed at which we (MC) reaches those points or the force of the change. Again, clarification anyone.", "group_id": 2515, "id": 199827}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571647.989466, "message": "This may have been a poor use of words on my part. Let's look at a football game -- you're 7 points behind. It's the first quarter. Well, you have a long time to score. Pressure is low. Now, it's the fourth quarter, 2 minutes left. You are seven points behind. Pressure is high. The benchmark (time remaining) tells you how much pressure those 7 points can exert. In other words, how \"strong\" those 7 points are.", "group_id": 2515, "id": 199926}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571773.927371, "message": "4. I will suggest here that your example doesn't touch on the underlying MC Concern (as you conveyed it) because we don't get a sense of “why” you really don't want her to marry. - bad experience with mob in the past/ her by the mob/connection with the mob/fear of the mob because of something you did etc. Again, my understanding is that the MC Concern must me personal/private.", "group_id": 2515, "id": 199948}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571176.8806491, "message": "I have to guess that you see this as \"not an MC Concern\" because it seems un-emotional. I'm going to put this into the Situation Domain because I said the Benchmark was \"The Past\", which forces this. \n\nThis could be highly emotional. Do you want people thinking your dad is a killer? That you're the son of a killer?", "group_id": 2515, "id": 199783}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571673.542654, "message": "3. If the interest is about “ the forces that affect the thing we are measuring.” then I think we're in another area. Is this the IC or the OS arena? I suspect it falls more towared the IC.", "group_id": 2515, "id": 199931}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298571728.5462379, "message": "Every throughline goes through changes and is affected by forces.", "group_id": 2515, "id": 199938}, {"user_id": 7664, "stars": [], "topic_id": 8804, "date_created": 1298572041.8917761, "message": "Yes, it's not as \"specific\" as \"he's missing a leg.\" But it's an example. Roll with it.", "group_id": 2515, "id": 200028}, {"user_id": 10814, "stars": [], "topic_id": 8804, "date_created": 1298572891.912782, "message": "Concerns are generalized.  In order to understand the \"why\" of an inequity, if you want more specificity you must move closer to the problem element.\n\nThe reason there are four levels of resolution in evaluating an inequity (domain, concern, issue, problem) is because we can understand inequities as different magnitudes.  As the saying goes, \"He can't see the forest for the trees,\" that indicates someone looking at specifics (e.g. Issues or Problems) and does not understand the larger context (e.g. Concerns or Domains).  \n\nThere is value looking to the specific AND the general when trying to discover the best way to resolve an inequity.  For example, if you look at the problems you may not realize that you're not looking at the problem in the right domain.", "group_id": 2515, "id": 200170}]