[{"user_id": 8644, "stars": [], "topic_id": 12314, "date_created": 1299849939.8993821, "message": "Is there any documentation which explains all the different variables you can use to do your own scrreners, calculations etc? Some of them are obvious but others not so", "group_id": 5165, "id": 322035}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1299938299.3522329, "message": "We are working on tutorials and full documentation.  In the meantime, I am happy to answer questions on any specific sets of variables.", "group_id": 5165, "id": 331764}, {"user_id": 8644, "stars": [], "topic_id": 12314, "date_created": 1300010331.469955, "message": "Hi, thanks for your answer. I'm particularly interested in all the 10 year magnitudes you can find under growth. What are the differences among the different concepts: CAGR, Growth, Momentum, Trend, Volatility...", "group_id": 5165, "id": 339858}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1300149778.2399189, "message": "Trend growth involves plotting the values on a log-linear chart relative to time and observing the slope.", "group_id": 5165, "id": 352388}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1300149609.9857049, "message": "CAGR is the compound annual growth rate (if it is 5 year, then (5 year ago value) * (1+CAGR) ^ 5 = (most recent year value)", "group_id": 5165, "id": 352370}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1300149835.280524, "message": "From the data documentation: \"Trend Momentum is derived for the most recent period by subtracting the log linear Estimated index value (in index value units) from the Actual index value and divide by the Estimated index value to derive a % deviation. Subtract from the most recent period % deviation the % deviation of the prior period. Express this difference in % deviation as a percentage.\"", "group_id": 5165, "id": 352397}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1300149879.5548551, "message": "From the data documentation: \"Trend Volatility is derived by subtract the log linear Estimated index value (in index value units) from the Actual index value and divide by the Estimated index value to derive a % deviation. Repeat this for each observation and average the “absolute” results to derive a % Mean Absolute Deviation. Express this result as a percentage.\"", "group_id": 5165, "id": 352399}, {"user_id": 16120, "stars": [], "topic_id": 12314, "date_created": 1300149909.1374121, "message": "I, personally, have never used momentum or volatility :-).", "group_id": 5165, "id": 352403}]