[{"user_id": 1, "stars": [], "topic_id": 19667, "date_created": 1302887000.104768, "message": "Help!", "group_id": 8925, "id": 702710}, {"user_id": 1, "stars": [], "topic_id": 19667, "date_created": 1302886998.90294, "message": "I can't decide whether to hold off on watching the show until I read the books, or do the opposite.", "group_id": 8925, "id": 702709}, {"user_id": 16171, "stars": [], "topic_id": 19667, "date_created": 1302887489.2711971, "message": "Maybe read them parallel to watching? ;-)", "group_id": 8925, "id": 702816}, {"user_id": 16171, "stars": [], "topic_id": 19667, "date_created": 1302887468.0591929, "message": "Hard to tell before the show has aired, but the books are awesome, so if you can — read them!", "group_id": 8925, "id": 702809}, {"user_id": 16171, "stars": [], "topic_id": 19667, "date_created": 1302889187.3534169, "message": "Some of the TV critics that have also read the books said that the show isn't able to show some of the more complex emotional development in the characters. Since the book is told from a number of characters points of view, I suppose the perspective of the narrative must be quite different.", "group_id": 8925, "id": 703050}, {"user_id": 2691, "stars": [{"date_created": 1302888950.332063, "user_id": 1}], "topic_id": 19667, "date_created": 1302888944.5490971, "message": "Obviously the books are going to be able to provide considerably more detail than the show can.  Already in the 15 minute preview I noticed some minor changes that they no doubt had to make due to time constraints.", "group_id": 8925, "id": 703036}, {"user_id": 2576, "stars": [], "topic_id": 19667, "date_created": 1302890371.610287, "message": "I'd go with the suggestion from @samuellinde and read before each episode. :-)", "group_id": 8925, "id": 703423}, {"user_id": 17897, "stars": [{"date_created": 1302890549.8257101, "user_id": 1}], "topic_id": 19667, "date_created": 1302890238.0917921, "message": "@ericflo don't read the books. You'll probably be disappointed by the series. So watch the series and then enjoy the books afterwards.", "group_id": 8925, "id": 703394}, {"user_id": 2576, "stars": [], "topic_id": 19667, "date_created": 1302890309.98158, "message": "I'd read the books (and already have). The series will be awesome, but still pale in comparison. You end up loosing the same tension once you know what's going to happen (IMHO).", "group_id": 8925, "id": 703408}, {"user_id": 17897, "stars": [], "topic_id": 19667, "date_created": 1302890261.7873869, "message": "I'm usually disappointed by the movies to a book.", "group_id": 8925, "id": 703398}, {"user_id": 25, "stars": [], "topic_id": 19667, "date_created": 1302891224.4664569, "message": "It's a heckuva lot of reading, though. I thought it took a while to get unto the books, to grasp the whole scope of the stories, so from that aspect watching the series first I think will add to the reading experience whenever you can get to it.", "group_id": 8925, "id": 703668}, {"user_id": 31184, "stars": [], "topic_id": 19667, "date_created": 1303831342.310209, "message": "The books are fantastic. While the HBO series demonstrates promise, it misses one of the unique features of the book: chapters that focus exclusively on one character's perspective of events. This alone gives you much richer insight into the characters than HBO's show will, and as a reader moving into the HBO series, it's satisfying having read about the characters first.", "group_id": 8925, "id": 815588}, {"user_id": 25703, "stars": [], "topic_id": 19667, "date_created": 1304268337.1576011, "message": "adsworth is mad: The show is an incredible adaptation so far.", "group_id": 8925, "id": 876531}, {"user_id": 25703, "stars": [], "topic_id": 19667, "date_created": 1304268414.60148, "message": "That said, books are obviously a more significant investment than TV shows ... but if you're much of a reader, I'd definitely recommend you read the books first. The narrative and characterisation is obviously richer than you can plausibly do with film/TV. Heck, there's no harm in doing both concurrently, you'll be ahead of the show in no time, and it'll still be fresh in your mind when the episodes air.", "group_id": 8925, "id": 876538}, {"user_id": 31852, "stars": [], "topic_id": 19667, "date_created": 1304271824.7239311, "message": "Which is what I'm doing - I started reading the books a couple of weeks before the show started airing. I'm up to book 4, and it's amazing, but I've also been extremely impressed with the show. Despite knowing exactly what's going to happen in the series, I still find myself anxiously awaiting each new episode.", "group_id": 8925, "id": 876891}, {"user_id": 17897, "stars": [], "topic_id": 19667, "date_created": 1304272904.5060129, "message": "@Neilan I usually am disappointed by the movies to a book, but I do watch them. I just can't resist.\nMy main problem with the Game of Thrones series is that I _can't_ watch it since I'm from Germany. :(", "group_id": 8925, "id": 876985}, {"user_id": 25703, "stars": [], "topic_id": 19667, "date_created": 1304274325.575021, "message": "There's as much annoyance in the US, as there's no way to watch it yet without being both a cable and HBO subscriber - not even through any pay online or on-demand service.", "group_id": 8925, "id": 877074}, {"user_id": 25703, "stars": [], "topic_id": 19667, "date_created": 1304274401.9889231, "message": "I guess that's pretty much just HBO's business model though. Having previously lived in South Africa though, I guess we ended up getting HBO shows on our local channels eventually? Seeing as it's being broadcast on Sky in the UK (I think), I'd guess German channels will pick it up in time ... if that's any solace. :\\", "group_id": 8925, "id": 877081}, {"user_id": 8649, "stars": [], "topic_id": 19667, "date_created": 1307026892.8845429, "message": "Can't you just torrent the thing and buy the DVDs later?", "group_id": 8925, "id": 1267810}, {"user_id": 8649, "stars": [{"date_created": 1307033153.067225, "user_id": 2}], "topic_id": 19667, "date_created": 1307026996.8647699, "message": "I had this exact same question (books or show first) but it's handily resolved by the fact that I don't have the time to read the books right now.  And starting with the show/movie isn't always bad; I was first introduced to Harry Potter when the movie first came out, and then I promptly devoured the books that had been written up to that point.", "group_id": 8925, "id": 1267824}, {"user_id": 25703, "stars": [], "topic_id": 19667, "date_created": 1307035388.925549, "message": "No reason not to do both. I mean, the show's off air for another year in three weeks.", "group_id": 8925, "id": 1268867}, {"user_id": 31883, "stars": [], "topic_id": 19667, "date_created": 1307034538.003963, "message": "I think the shows are well-written enough that it won't make a big difference which you do first", "group_id": 8925, "id": 1268781}, {"user_id": 31883, "stars": [], "topic_id": 19667, "date_created": 1307038595.2301259, "message": "sure. bleh, another year :(", "group_id": 8925, "id": 1269523}, {"user_id": 37188, "stars": [], "topic_id": 19667, "date_created": 1309325670.545125, "message": "Why not both?", "group_id": 8925, "id": 1515076}, {"user_id": 26037, "stars": [], "topic_id": 19667, "date_created": 1311894765.4212489, "message": "I am starting the second book soon. Absolutely amazing.", "group_id": 8925, "id": 1743189}, {"user_id": 13618, "stars": [], "topic_id": 19667, "date_created": 1319500880.9849939, "message": "Books.. always..", "group_id": 8925, "id": 2425043}, {"user_id": 43107, "stars": [], "topic_id": 19667, "date_created": 1320426886.5049739, "message": "Read the books. The show does not do them justice.", "group_id": 8925, "id": 2506651}, {"user_id": 30905, "stars": [], "topic_id": 19667, "date_created": 1320867475.489476, "message": "I might be a little late to the party but here's my two cents. I started reading the book and by some strange coincidence, the first episode exactly covered the chapters I finished. Though I enjoyed the show a little, I was too busy keeping track of all the minor differences from the book to the show. This really took a lot of joy out of the show. Then I stopped reading the book, and finished watching the series. I enjoyed the show much better this way. As you can probably tell by now, I am a sucker for detail. Now, reading the book is still enjoyable because of all the finer details like the characters, back story etc. But if you are unlike me and  lose interest if you know the plot, I would recommend reading the book first even though, that might totally ruin the show.", "group_id": 8925, "id": 2541109}, {"user_id": 43431, "stars": [], "topic_id": 19667, "date_created": 1321116107.8943739, "message": "Read the entire series first. Really my only gripe are the choices for some of the actors. Cat looked nothing like I imagined or they described.", "group_id": 8925, "id": 2559723}]