[{"user_id": 37659, "stars": [], "topic_id": 43108, "date_created": 1312222841.5843251, "message": "$K.fn.jquery returns \"1.4.2.kobj\". Any reason it's so outdated? jQuery is at 1.6.2 currently. Will this be updated soon? Is there any way I can control the version?", "group_id": 236, "id": 1768366}, {"user_id": 27020, "stars": [], "topic_id": 43108, "date_created": 1312486335.2569361, "message": "@davidbjames we are currently reviewing this and it is on our list to upgrade jquery it's just a matter of priorities", "group_id": 236, "id": 1796038}, {"user_id": 27020, "stars": [], "topic_id": 43108, "date_created": 1312486349.8777249, "message": "@davidbjames is there something specific you're interested in with the newer version?", "group_id": 236, "id": 1796040}, {"user_id": 37659, "stars": [], "topic_id": 43108, "date_created": 1312560427.7534549, "message": "Since jQuery is the preferred Javascript library used by Kynetx (with it's isolated $K namespace), I would think keeping it current would be a high priority, not just a matter for discussion. Yes, there are several features that our Javascript uses or will likely use. Problem is, now I'm in position where I need to hack jQuery 1.6 to namespace it for my own needs so it doesn't conflict with other jQuery instances (making a potential 3 instances including the Kynetx one).", "group_id": 236, "id": 1803037}, {"user_id": 30559, "stars": [], "topic_id": 43108, "date_created": 1312563897.147099, "message": "Try using jquery 1.6 and namespacing it with your own reference.  I am sure it will work and it won't be very difficult.", "group_id": 236, "id": 1803439}, {"user_id": 37659, "stars": [], "topic_id": 43108, "date_created": 1312567991.0727229, "message": "I'm going to give that a try. One thought for the Kynetx people is to allow the developer to select their jQuery version either in the ruleset or globally in the developer interface. This will insulate current devs from possible breakage, while at the same time providing a path for those who need to remain current.", "group_id": 236, "id": 1804008}, {"user_id": 30559, "stars": [], "topic_id": 43108, "date_created": 1312583069.986021, "message": "The kynetx environment depends on several javascript libraries.  Most of these libraries depend on jquery.  If we upgrade jquery one of these libraries could break.  Keeping jquery up to date is a priority but also keeping  all of the app's working is a high priority.  Here is a link on how to load jquery in that I really enjoy. http://edoism.orcutt.org/2010/08/using-facebox-jquery-plugin-with-kynetx.html", "group_id": 236, "id": 1806036}, {"user_id": 37659, "stars": [], "topic_id": 43108, "date_created": 1312804615.0511391, "message": "Sounds good. I'll probably proceed with a variation of Ed's technique. Thanks for the heads-up.", "group_id": 236, "id": 1820544}]