[{"user_id": 25852, "stars": [], "topic_id": 42608, "date_created": 1311573247.115803, "message": "Would love some feedback", "group_id": 250, "id": 1713850}, {"user_id": 25852, "stars": [], "topic_id": 42608, "date_created": 1311573256.0003431, "message": "http://www.tekiki.com/cher/40-Chinnovate-Premium-Webinar-Series", "group_id": 250, "id": 1713852}, {"user_id": 25852, "stars": [], "topic_id": 42608, "date_created": 1311573243.185638, "message": "Hi there, we released a new product to give online interactions the same networking benefits as in-person interactions. We envision this as a great way to discover professional relationships and connections at webinars, podcasts, and other virtual events.", "group_id": 250, "id": 1713848}, {"user_id": 4149, "stars": [], "topic_id": 42608, "date_created": 1311575183.95157, "message": "Somethings i can see there is a tech theme for now, you should add in github login, since i would pref people there see my work, also i am kinda confused, like i see everyone's profile and the little chat box, i think those should be switched make the chatbox bigger and also add private messaging so i can connect them first without giving them full access to one of those social networking sites, also this maybe a racial idea, but since it looks to be more of chat add IRC support that would be cool probably too crazy for that site but worth a shot", "group_id": 250, "id": 1713947}, {"user_id": 13735, "stars": [], "topic_id": 42608, "date_created": 1311785759.8522129, "message": "Definately I would prefer to see the chat front and center. Not sure how close to your aim for this I am but I immediatly thought how this could work for those people looking to form \"startup\" teams in an online enviroment (something that is really difficult right now). Rooms could be created around specific markets or problems for people with specific domain knowledge, developers and designers to chat and get to know each others way of thinking whilst discussing problems and solutions in that market. Just thinking out loud.", "group_id": 250, "id": 1732527}]