[{"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917471.062108, "message": "\"Then, turning to his disciples, Jesus said, “That is why I tell you not to worry about everyday life—whether you have enough food to eat or enough clothes to wear. For life is more than food, and your body more than clothing. Look at the ravens. They don’t plant or harvest or store food in barns, for God feeds them. And you are far more valuable to him than any birds! Can all your worries add a single moment to your life? And if worry can’t accomplish a little thing like that, what’s the use of worrying over bigger things?\n “Look at the lilies and how they grow. They don’t work or make their clothing, yet Solomon in all his glory was not dressed as beautifully as they are. And if God cares so wonderfully for flowers that are here today and thrown into the fire tomorrow, he will certainly care for you. Why do you have so little faith?\n\n “And don’t be concerned about what to eat and what to drink. Don’t worry about such things. These things dominate the thoughts of unbelievers all over the world, but your Father already knows your needs. Seek the Kingdom of God above all else, and he will give you everything you need.\" Luke 12:22-31 (NLT)", "group_id": 9787, "id": 1251358}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917831.2339981, "message": "Go!", "group_id": 9787, "id": 1251394}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917290.2019131, "message": "In the interests of stimulating more than just popular topic debates I'm going to begin with some scripture and then as specific questions for everyone to answer. Here are two related scriptures dealing with Faith", "group_id": 9787, "id": 1251340}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917823.6169491, "message": "Questions:\nWhy is it necessary to call in the elders when you are sick?\nWhat happens when healing doesn't? (according to this translation healing WILL happen, so how do we explain praying without healing happening)\nDo you confess you sins to each other? And pray with each other for forgiveness? How does this hold true in churches where we have silent times of confession?\nHow much faith do you have in your prayers being answered?\nHow much faith do you demonstrate in your lifestyle?\nHow much time do you spend each day worrying?\nHow do we 'Seek the Kingdom of God\"? What does this mean?", "group_id": 9787, "id": 1251393}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917387.149174, "message": "\"Are any of you suffering hardships? You should pray. Are any of you happy? You should sing praises. Are any of you sick? You should call for the elders of the church to come and pray over you, anointing you with oil in the name of the Lord. Such a prayer offered in faith will heal the sick, and the Lord will make you well. And if you have committed any sins, you will be forgiven.\n Confess your sins to each other and pray for each other so that you may be healed. The earnest prayer of a righteous person has great power and produces wonderful results. Elijah was as human as we are, and yet when he prayed earnestly that no rain would fall, none fell for three and a half years! Then, when he prayed again, the sky sent down rain and the earth began to yield its crops.\" James 5:13-18 (NLT)", "group_id": 9787, "id": 1251347}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1306917589.2052259, "message": "The second one we know well. I'm using the NLT so that we can break the habits of good old NIV thinking.", "group_id": 9787, "id": 1251372}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1306961877.084228, "message": "Maybe the elders make the gathering an official church thing, where 2 or 3 are gathered in Jesus name... perhaps the authenticate the Christianity of the thing... pretty weak I know. Maybe that is the basis for the catholic's insistence that the priesthood should do everything official... forgiving people, exorcisms and the like.\nFurther questions on the elder's praying for you thing. It says \"And if you have committed any sins, you will be forgiven.\" what's THAT all about? Prayer from someone else, and your sins are forgiven?\n\nWhat happens when healing doesn't? That one I always struggle with. The prayers of a righteous man availeth much... when my prayers don't seem to do anything, sometimes i start to wonder about my confession of faith.\n\nThose community driven things are awesome, pity we don't do them. We don't do them because we have perhaps lost trust in the community. I confess some sins and all of a sudden I am a pariah. So we don't share with the fellowship our struggles, they don't pray for us, we hide the sins.. the sins start to gnaw away at our foundations... etc etc snow ball of DEATH.\n\nSometimes I pray so smoothly and with such confidence, it's like I couldn't conceive of no answer... or rather, whether or not there will be an answer doesn't cross my mind... it's just a conversation or a request like I would make to anyone... Some other times it's like I am praying to a totem pole... platitudes like \"there is always an answer. Yes, No and Wait\" make me want to spontaneously bleed on people. Then that starts to stress me out completely, thinking I am performing magic rites and rain dances to get the vending machine God to spit out my requested brand of answer. So, the long answer of how much faith I have for answers to prayer... absolutely variable.\n\nHow much faith do I demonstrate... sheesh. I have medical aid, credit cards, retirement money, all kinds of dissability insurances... I hedge my bets when it comes to speaking with those close to me (theologically, evangelically)... I would say my life is not a show piece for faithful living.\n\nI don't worry too much, sometimes I get overwhelmed, most times not.\n\nFor me, seeking the Kingdom of God is about finding out how we can make it more apparent now! The kingdom of God is about the end, after the end times... etc. But it is VERY much about here and now as well! If I am obedient to the will of God, that's me living in the kingdom. If it becomes too much about \"saving souls\" then we lose contact with reality and life. The hobo/tribesman/unemployed single with kids has needs now, requirements now... Showing love to that individual by praying the prayer with them, handing over a cheap new testament with psalms and proverbs and then moving on to allow them to starve or freeze leaves a lot to be desired. Doesn't look much like love at all.", "group_id": 9787, "id": 1258510}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1307017496.8227451, "message": "anyone else? or is this going to remain a 3 way conversation?", "group_id": 9787, "id": 1265825}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1307017414.0534451, "message": "The only thought I have re Elders being present when praying for healing is that this is such a sensitive topic. Perhaps the presence of elders is meant to deter people from getting abusive about lack of faith? But then it says 'will heal the sick' which some might take to mean guaranteed healing (and some people do think like that). For James it seems simple. Have faith and your prayer will be answered, whatever you ask.", "group_id": 9787, "id": 1265807}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1307084986.11479, "message": "Why is it necessary to call in the elders when you are sick?\n\nI'm guessing elders could possibly mean they are seasoned in some sense? Gifted? So they may stand more firm than a group of Christian newbies babbling and not really understanding what they're doing. Possibly bringing some baggage with them in their \"healing ceremonies\"?\n\n\nWhat happens when healing doesn't? (according to this translation healing WILL happen, so how do we explain praying without healing happening)\n\nThis is a huge personal hangup for me and one of my gripes against the gifts. I just don't see it happening. At least not in the power I expect to see them. There are a lot of things I am told; 1. I need t grow into it, 2. I don't have the faith needed. I suspect 2. is the more likely. I am very questioning. Especially when someone tells me about their healing experience I look for all the possible ways that it is not legit.\n\n\nDo you confess you sins to each other? And pray with each other for forgiveness? How does this hold true in churches where we have silent times of confession?\n\nI do. I tell anyone that will listen to me and sometimes anyone that won't. I know I have sin and I have no issue sharing it. Don't get me wrong. I am ashamed of how I mess up and how often it seems to happen, I just don't think it's right to keep it in me. i need to tell others how I sin, why, when, and trust them to help me. I also share difficult sins I have with Nicole and we pray through it.\n\n\nHow much faith do you have in your prayers being answered?\n\nI have not given this much thought. I suppose the way I think is that God will do with my prayers what He will do. Never really wonder why He's not doing what I want Him to do. It is however something to ponder over.\n\n\nHow much faith do you demonstrate in your lifestyle?\n\nI have all the same as @LintonCaldecott but not sure that means I have no faith or am not living in faith. I think it's a problem if all those things get in the way of living generously? Does Proverbs not say something about a wise man saves for the future? I'll have to look it up (my awesome knowledge of the scriptures fails me). Granted a person with less has to exercise their reliance on God a lot more than someone that has all life's comforts. I constantly think/pray in my mind; \"I am so blessed, please let me never become hard and not be generous. Help me love with what I have. Help me stand firm if You take it away.\" I worry that I will love what I have more than God.\n\n\nHow much time do you spend each day worrying?\n\nJeepers, no freakin' idea. I suppose I worry, I am human after all. What's important to me is what I do with that worry. When I have work deadlines like I have now, I worry if I will make it. If the work I produce in the time will be good enough. So i worry, but I also pray about it. Nicole is awesome in that space. She is a great reminder to me to pray pray pray.\n\n\nHow do we 'Seek the Kingdom of God\"? What does this mean?\n\nThe way I understand that (these days at least) is to seek the truth. All truth leads to God. So I want to live in that truth which conversely effects how I live. Not 100% there and possibly will never be in this life but I try as hard as I can. I fail.", "group_id": 9787, "id": 1275422}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1307183994.847095, "message": "On healing and elders. I wonder if it has to do with discernment. I believe discernment is a big factor in healing, because we need to discern whether the persons healing is in Gods plan... Eg: Jesus at the pool only healed 1 person although the pool was historically always surrounded by hopeful sick people waiting for the water to stir. Although Jesus many it doesn't really say he healed all - and the healings tended to have a purpose beyond physical healing. So perhaps the elders are considered those with discernment.", "group_id": 9787, "id": 1285533}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1307184168.935374, "message": "Let's focus on two areas here:\nWhat does a lifestyle of faith look according to scripture?\nand\nWhat does it mean to 'Seek the Kingdom of God'? (Which I think will require us first to understand what the Kingdom of God is?)", "group_id": 9787, "id": 1285538}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1307184300.6473, "message": "I'll try look up some scriptures on the first one this weekend. Things that come to mind is a parable Jesus told about building without planning, then the well known ones about worry as above, and also how the early church chose to live as recorded in Acts. OT would be a look at Israel in the desert maybe. What else?", "group_id": 9787, "id": 1285541}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308044593.4463511, "message": "@pevans_om I take it there was no looking up. I'll see what I can get on the \"Kingdom of God\" if you're still interested.", "group_id": 9787, "id": 1389339}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308052740.9762599, "message": "@penkin I started looking but then the silence here became deafening and I had to leave", "group_id": 9787, "id": 1390301}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308054177.6031971, "message": "I was looking for something I had jotted down about the kingdom of God... from one of my subjects. it was very interesting.. now it's gone", "group_id": 9787, "id": 1390368}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308053993.608448, "message": "@pevans_om heh, I hear that! or I don't?", "group_id": 9787, "id": 1390358}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308054294.492584, "message": "@LintonCaldecott How convenient!", "group_id": 9787, "id": 1390376}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308570328.369559, "message": "@LintonCaldecott Did you find your notes?  @pevans_om did you get time to check into this?", "group_id": 9787, "id": 1437796}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308595400.5677929, "message": "@penkin sorry, I've been very lazy with this!", "group_id": 9787, "id": 1441194}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308600016.490283, "message": "Then there is an interesting exersize, the following list of scriptures (i have made it in easy lazymans form) http://www.biblegateway.com/passage/?search=Mark%201:15,%201:16-20,%202:13-17,%203:13-19,%203:31-35,%206:30-44,%206:45-52,%208:14-21,%2013:9-13,%209:38-41,%209:33-37,%2010:28-31,%2010:35-45%20&version=ESV have something to do with either the basileia or discipleship. As an exersize, read each verse and consider what it is saying about this kingdom and our response...", "group_id": 9787, "id": 1441979}, {"user_id": 32888, "stars": [{"date_created": 1308654758.430274, "user_id": 13817}], "topic_id": 37649, "date_created": 1308599853.178339, "message": "Ok, notes. I totally cheated this time and didn't re-write what I had done a while back while studying this stuff, I scanned this in and OCR'd it. It is a lot, but it has much pertinence to the topic of the kingdom and discipleship and faith.\n\nbasileia and discipleship these themes are closely related. \nthe basileia, even if elusive, provides a vision, an ethic, and a practice for those of us who want to be\ndisciples.\nBasileia, a Greek New Testament term, is usually translated as God’s\n'kingdom'. It could be translated as ‘rule’, or the place where God’s active reign is found. But\nit’s really about a lifestyle instead of a place, state or empire.\nThe Old Testament roots of the theme of basileia lie in the idea of Israel\nbeing a theocracy, i.e. a state or country ruled directly by God. lsrael’s\nmission was to be a light to the Gentiles, with a vision that Zion would\nultimately be a home for all nations. Here, the reign of Yahweh is\nassociated with justice, wholeness of nature, abundance, joy, and peace.\nIt is a time when suffering and war will come to an end.\nThe Synoptic Gospels present basileia as the key theme of Jesus’\nteaching. It is something that can be experienced in the present- even if\nonly partially- as well as something that will come with the fullness of\ntime. lt is perhaps because of the Johannine and Pauline writings that\nwe focus so much on the person of Jesus in our worship, sometimes to\nthe extent that we forget that Jesus proclaimed the basileia and not\nhimself.\n\nWe can get some idea of what Jesus means by basileia by looking at:\n•\tthree special categories of people — the only groups of whom Jesus\n•\tsaid the basileia is theirs already\n•\tsome images of it provided in various parables\nl've chosen episodes where Jesus makes comparisons which would\nhave shocked, and in some cases, amused his audience. They are\nillustrations close to their experience — but you should also consider how\ndifferent segments of an audience would respond. We’ve got used to\nreading these episodes in the Bible where they have been embedded in\nthe narrative framework created by the Gospel writers. So sometimes it's\nvery difficult for us to imagine being in an audience hearing these stories\nfor the first time. Perhaps we’ve become too comfortable in the ways we\nread these texts. \n\n1.\tThe basileia is for children. \n(Mark 9:35-7, but notice context from 33 on; 10:13-16)\nThis suggests that the basileia is for the humble and vulnerable. But it\ngoes a little further than that. In Mediterranean society at the time of\nJesus children had little standing. Thus, Jesus is posing a deliberate\nchallenge to the disciples. Normally, for the disciples, and probably for\nus adults as well, we wouldn’t like being called a child. But this ls\nwhom Jesus says the basileia is for.\n2.\tThe basileia is for the destitute: ‘BIessed are the ptochoi’.\n(Luke 6:20 and Matthew 5:3)  \nUsually, ‘ptochoi” is translated as ‘poor’. However, the usual word ln\nGreek for ‘poor’ is ‘penes’, which refers to those who, unlike the\nextremely wealthy, have to work to live. lt includes those who work as\nservants or as labourers in the households or on the estates of the\nsmall aristocratic class. lt also includes the peasant farming family\nwho has access to land but struggles to make a living from it. A\n‘Ptochoi”, meaning ‘one who crouches’, actually means ‘beggar’.\nUnlike the ‘poor', the ‘beggar’ lives on the margins of society — a\nhomeless wanderer without work and without a family to depend on.\nIn other words, the basileia is for the destitute, those who stand\noutside the relationships that govern family and labour for those who\nhave a social and economic place, however small, in society.\n3.\tThe basileia is for those who are persecuted for their\nrighteousness. (Matthew 5:10)\nRead in conjunction with the Old Testament, this refers to those who\nare persecuted because of their commitment to justice. Those in\npower, at the receiving end of prophetic criticism, would act against\nthose who questioned them. ‘\n\nSo, this is who the basileia is for, and next we look at what the basileia is described as being.\n\n4.\tThe basileia is like a weed.\n(Mark 4:30-32 = Matthew 13:31-2; Luke13:18-19 = Matthew 13: 31-\n32. Matthew 13:24-30 + interpretation in 36-43a)\nThere are two parables where the basileia is compared to dangerous\nplants, the mustard tree (or bush) and darnel —— although we might not\nhave thought of it in this way.\nMany of us will have heard ministers preaching as follows: ‘The\nmustard tree has very small seeds. But from this small seed grows a\nmighty tree.’ However, in Israel’s view a mighty tree would be the\ncedar of Lebanon. \n'The point...is not just that the mustard plant starts as a\nproverbially small seed and grows into a shrub of three or\nfour feet, or even higher, it is that it tends to take over\nwhere it is not wanted, that it tends to get out of control,\nand that it tends to attract birds within cultivated areas\nwhere they are not particularly desired; And that, said\nJesus, was what the Kingdom was like: not like the mighty\ncedar of Lebanon and not quite like a common weed, like a\npungent shrub with dangerous takeover (i.e. invasive)\nproperties. Something you would want in only small and\ncarefully controlled doses - if you could control it.‘\nThe second story concerns the way in which darnel, a poisonous plant\nthat looks very much like wheat, grows naturally in wheat fields. The\nproblem for the rich landowner is how to separate the wheat from the\ndarnel. In wet years this problem is worse than in dryer years because the\ndarnel grows more prolifically. The point of this story seems to be that the\nlandowner and those (servants and labourers) who work the estates are\nstuck with this problem, just as they are stuck with the basileia.\nPresumably, the landless poor would have enjoyed the point of this tale.\n5.\tThe basileia is like leaven.\n(Luke 3:20-1 = Matthew 13:33)\nThis is the last example l’ll offer. Why would this story offend? Well,\nwomen were subject to purity codes within Jewish law, and so was\nleaven - it was regarded as unclean and had to be cleared out of the\nhousehold for the duration of the Passover. At the time of Jesus\nleaven was made by women by placing a piece of fermenting bread in\na dark place so that the cells of the yeast fungus would develop further\nin the bread. Then, small quantities of this leaven would be placed\ninside the dough before new bread was baked. What Jesus appears to\nhave been saying is that the basileia is associated with women and\nleaven, both of which were regulated by the religious code of the time.\nBoth are natural and normal, but society feels uncomfortable. There is\na fear that women and leaven may be corrupting. So, the basileia is\nhidden within society or the world much as leaven is hidden in dough.\nFrom here it acts on and brings about a fundamental change - just as\nthe bread rises.\nThus, in the first three illustrations, the basileia confronts us with God’s\nelusive presence. The stories about it and how we can receive it remind\nus that it is not through any merit of our own. indeed they illustrate how\nGod’s love reaches out to those who are most vulnerable, those ‘who\ncome to God’s presence with empty hands.’ ln\nthe set of images that follow the basileia is presented as something that\nis contagious and invasive, that infects its surroundings. lt cannot be\ncontrolled. ln fact, it discomforts us with its vision that places those on\nthe margins in our societies at its very centre. its ability to destabilise our\nsense of reality and undermine sets of relationships which we take as\nnormal can be quite terrifying. lt often seems that we can only cope with\nsmall doses of it. Perhaps this is why we so often ignore the economic,\nsocial, and political nature of the claims of God on our lives. We find\nthem too radical, too egalitarian, too inclusive. Perhaps this is why we\nsometimes hasten to insist that small encounters with the basileia are\nenough, that this is all we can expect, that it’s future coming in all its\nfullness is in the hands of God.\n\nBut the challenge of the basileia is not only that it presents us with a\nvision of how things could be. lt shows us how things are in the basiliea.\nAnd, if we wish to live faithfully, then we need to live like this as well. So,\neven as it critiques our lives against its realities, it provides us with a\nsocial ethic and a social practice that we are called to follow. For many\nbiblical and theological scholars, this requires us to shift our concern for\n‘right teaching’ (orthodoxy) to ‘right practice’ (orthopraxis).\nThus, in CRE, we need to be aware that we are educating people to\nparticipate in the basileia —— it is both the means and the ends of our\ndiscipleship. Some themes which we need to be aware of include:\n1. The basileia breaks into our lives as kairos, decisive moments that\nrequire decisions that have profound implications for our lives. The\ncall to discipleship doesn’t happen only once — each moment of kairos\ncalls us to make that decision again and again as we consider how to\nrespond faithfully to new situations.\n2. The implication of this first point is that our conversion (metanoia) is\nparticipative and ongoing. It happens in community (koinonia) and it\nrequires service (diakonia). lt is, in fact, our constant conversion\ntowards both God and neighbour; my love for God fails when I fail to\nlove my neighbour. And everyone, including those l see as enemies,\nare my neighbours.\n3. But these social consequences of the basileia need to be extended\nbeyond a concern for people and society. The critical question is: Am\nI striving to live in love, justice, and peace with the whole of creation?\n4. One final point. The Church (ecclesia) exists for the sake of the\nbasileia, and not the other way around. This subordination of the\nchurch to the basileia means that we have to remember that God is at\nwork outside of the Church as well. Indeed, in terms of our faith, God\nis at work throughout the whole of creation. So, salvation is not the\nmonopololy of Christians or the Church —— others are able to perform\nacts of loving service towards their neighbours without thought of\nreward. And, our own perspective is limited. We cannot claim to know\nthe mind of God and we don’t fully understand just how God is at work\nin the world.\n\nOne way of gaining insight into discipleship is to use the Gospel of Mark.\nHere, the author’s narrative strategy seems to have been that we learn\nabout discipleship by seeing how hard it is. Thus, the disciples tend to be\nshown in a poor light- they are slow to understand, squabble among\nthemselves, and are jealous of the success of others. The way they are\nportrayed in the gospel raises interesting questions:\n• How did the Markan community see itself in relation to Jesus’\ndisciples? .\n• How do we understand our relation to this gospel and to the\ndisciples?\n• Are we among those who understand or among those who don’t?\n• We might laugh at them — but what about ourselves? Don’t we do\nsimilar things?\n\nBasileia calls us out of our comfort zones, shows us the\ninjustice in our lives and societies, and the brokeness of creation at the\nsame time it makes available to us a vision of how things can (and\nwhich faith insists, ultimately will) be different and a set of practices by\nwhich we can, even if only in small ways, anticipate and live out this\ndifference in our lives. We need to be aware of the ‘signs’ around us\nsometimes they call us to loving action on behalf of our neighbour or\ncreation; at others, they allow a glimpse of the presence and peace of\nGod.", "group_id": 9787, "id": 1441912}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308599886.6615591, "message": "ok, the above does have a few of my notes, but i'd say 90% is TEE's", "group_id": 9787, "id": 1441933}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308648238.5797091, "message": "so going backwards.....what does that all say about seeking the Kingdom of God?", "group_id": 9787, "id": 1446856}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308648324.2031381, "message": "sjoe. there is quite a bit in there about seeking the kingdom... the end bit for instance", "group_id": 9787, "id": 1446859}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308649616.5502391, "message": "Its something infectious that belongs to people treated like they have an infection :)", "group_id": 9787, "id": 1446930}, {"user_id": 32900, "stars": [{"date_created": 1308651414.966907, "user_id": 13817}], "topic_id": 37649, "date_created": 1308648987.82267, "message": "I like the correlation of the kingdom to something that permeates and affects everything around it. The mustard bush, yeast, etc. Infectious people is what we should be. Kinda like Wall-e!", "group_id": 9787, "id": 1446903}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308651691.24244, "message": "So what would we say for those that seek the Kingdom here and now in things like riches and blessings? I suppose the other side is also true for those that seek poverty to come closer?", "group_id": 9787, "id": 1447024}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308652387.5279341, "message": "\"How difficult it will be for those who have wealth to enter the kingdom of God!\"", "group_id": 9787, "id": 1447062}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308653925.223387, "message": "\"The wealth of the wise is their crown, but the folly of fools yields folly.\"", "group_id": 9787, "id": 1447178}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308652837.775754, "message": "\"With people it is impossible, but not with God; for all things are possible with God.\"", "group_id": 9787, "id": 1447086}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654521.948925, "message": "I figure I should get my butt into gear and actually read the whole bible :-/ Which I am chewing through. Gets tough though. So many distractions.", "group_id": 9787, "id": 1447220}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654744.6149819, "message": "@pevans_om Cool. Look forward to it.", "group_id": 9787, "id": 1447237}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308655173.4400711, "message": "So back to the topic at hand. I'm not sure I get what \"Seeking the Kingdom of God is\"?", "group_id": 9787, "id": 1447260}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654171.022903, "message": "hehe... I'm just messing around. I thought we were taking little pieces of scripture and pasting them here :P", "group_id": 9787, "id": 1447192}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308653800.569026, "message": "\"Do not lay up for yourselves treasures on earth, where moth and rust destroy and where thieves break in and steal, but lay up for yourselves treasures in heaven, where neither moth nor rust destroys and where thieves do not break in and steal. For where your treasure is, there your heart will be also.\"", "group_id": 9787, "id": 1447165}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308654174.909313, "message": "\"A rich man’s wealth is his strong city;the poverty of the poor is their ruin.\"", "group_id": 9787, "id": 1447193}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308654180.5263579, "message": "proverbs can get confusing", "group_id": 9787, "id": 1447194}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308654349.432662, "message": "example:\nWhoever is slothful will not roast his game,but the diligent man will get precious wealth.\n\nand\n\nDo not toil to acquire wealth; be discerning enough to desist.\n\nwhut?", "group_id": 9787, "id": 1447207}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308655219.997844, "message": "a diligent man will get precious wealth but doesn't toil to acquire it. that's not a contradiction. the result of dilligency is wealth, as long as wealth is not the focus of the effort.", "group_id": 9787, "id": 1447266}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308654131.194901, "message": "@penkin ah...but exactly what is the wealth of the wise?", "group_id": 9787, "id": 1447190}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654195.297749, "message": "@pevans_om for sure.", "group_id": 9787, "id": 1447195}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654453.003104, "message": "@pevans_om heh... yeah. See I have not been through the Bible completely so i have nt seen all this. There is some famous atheist that has a chart that he published recently (maybe Sam Harris) with all the \"contradictions\" of the bible.", "group_id": 9787, "id": 1447210}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308654472.094497, "message": "I have not attempted to go through it yet", "group_id": 9787, "id": 1447212}, {"user_id": 32900, "stars": [{"date_created": 1308654735.3107121, "user_id": 13817}], "topic_id": 37649, "date_created": 1308654703.602901, "message": "Off-topic here: Proverbs is a giant contradiction, but needs to be read in conjunction with Ecclesiastes and Song of Solomon. Then it makes an interesting study of the life of the wisest and richest king of Israel. Then the apparent conflict in proverbs is revealed in the conflict of the author and his eventual discovery in Ecclesiastes that everything is vane, or useless, or worthless. - without God of course...", "group_id": 9787, "id": 1447234}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308655347.235462, "message": "I'm also not sure what faith is. How you strengthen it? My current thoughts are that as we rely on God, read the bible... we know Him more and have more faith in Him? Also does not the bible say that God grants us faith?", "group_id": 9787, "id": 1447274}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308656953.4024191, "message": "i think practising a lifestyle of faith increases our faith? relying on God more and as he proves his faithfulness our faith strengthens. sometimes that's difficult to see though.", "group_id": 9787, "id": 1447370}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308658873.5318539, "message": "@LintonCaldecott Any practical examples?", "group_id": 9787, "id": 1447606}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308660441.751102, "message": "Harder than it may seem. We're not just talking about the OT 10 commandments here. We're talking about Jesus command to Love God and Love our neighbour. That requires action and sacrifice.", "group_id": 9787, "id": 1447763}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308660376.960511, "message": "\"If you love me, you will keep my commandments.\"", "group_id": 9787, "id": 1447757}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308660093.802834, "message": "well, by necessity they have been in many positions where if God was not faithful in some way they would be in a heap of trouble. I think that's one reason Charles has the faith he has... It's not just about provision though, i guess part of identifying how we can be faithful or step out in faith (i don't know whether i am a fan of that phrase...) is to see where we are told God will be faithful, or how he will be faithful.", "group_id": 9787, "id": 1447734}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308659844.3873971, "message": "So i must live like Paul and Charles?", "group_id": 9787, "id": 1447712}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308660903.169996, "message": "@pevans_om Yeah, that's what confuses me I think. Cause it seems there is a gift that God grants faith? Let me look for it and see the context maybe?", "group_id": 9787, "id": 1447846}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308661270.4349539, "message": "\"Now faith is being sure of what we hope for and certain of what we do not see,\" (Heb. 11:1)", "group_id": 9787, "id": 1447900}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308660526.484107, "message": "The seeking the kingdom analogy is similar to a good citizen and a bad citizen. A good citizen seeks area's in which he can be of some good, a bad citizen will sit back and with for good to happen to him, and complain if it doesn't. He'll probably not even vote to increase the influence of those he \"supports\" and then moan when they don't do anything.", "group_id": 9787, "id": 1447785}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308659789.7119341, "message": "paul evans, charles matthews.", "group_id": 9787, "id": 1447706}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308661619.6484971, "message": "@pevans_om please don't say that word... it derails us :)", "group_id": 9787, "id": 1447996}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308660619.1382191, "message": "that could get your head chopped off as a night... so it's risky", "group_id": 9787, "id": 1447801}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308660618.731514, "message": "so, to extend the citizen or knight analogy into exersizing faith, it's about seeking area's where the king might wish his influence to be spread... and doing what you can to aid that.", "group_id": 9787, "id": 1447800}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308660287.2452559, "message": "For me, to seek the kingdom of God is to seek the things of God. Follow His commands. Love Him. Love others. In action more than in words.\n\nAn analogy would be a knight of the realm. To seek his kings kingdom would be to seek to obey his king and do whatever he can to expand that kingdom in his area of influence.", "group_id": 9787, "id": 1447743}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308660539.138123, "message": "As to faith. I'm confused about scripture reference to faith being given to us. My own experience is this: Exercise faith and it will grow. And exercising faith requires risk!", "group_id": 9787, "id": 1447789}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308661344.851253, "message": "@penkin Yes...it's in Romans I think.\n\nThe issue I think relates to the Jewish understanding of God and His will. You have nothing that is not given of God. So if you have great faith it is because God gave it to you. Relates to that whole election issue.", "group_id": 9787, "id": 1447908}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308661132.22156, "message": "Something to chew on so long ...  \"So then faith comes by hearing, and hearing by the word of God\" (Rom. 10:17)", "group_id": 9787, "id": 1447886}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308682696.5521791, "message": "Read from Hebrews 10:38 through Hebrews 11 up to Hebrews 12:3. The events and individuals written about in Hebrews 11 are written with respect to \n\n\"Heb 10:38  but my righteous one shall live by faith, and if he shrinks back, my soul has no pleasure in him.\" \nHeb 10:39  But we are not of those who shrink back and are destroyed, but of those who have faith and preserve their souls. \" \n\nThe author then goes on to write about all these faithful ones, and ends with \n\n\"Heb 11:39  And all these, though commended through their faith, did not receive what was promised, \nHeb 11:40  since God had provided something better for us, that apart from us they should not be made perfect. Heb 12:1  Therefore, since we are surrounded by so great a cloud of witnesses, let us also lay aside every weight, and sin which clings so closely, and let us run with endurance the race that is set before us, \nHeb 12:2  looking to Jesus, the founder and perfecter of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God. \nHeb 12:3  Consider him who endured from sinners such hostility against himself, so that you may not grow weary or fainthearted. \"\n\nThe author is concerned with pistis (faith) being about the work God has done and will do, the promise of salvation for us through his work on the cross. \n\n\nI don't really have a conclusion for this, or a specific purpose in bringing it up really... It relates to the verse in Romans about hearing and hearing by the word of God that @penkin brought up. The purpose of hearing by the word of God is salvation, that is what Paul is talking about, the good news. \nThis in turn relates to the passage in mark and matthew(?) with the great work(s) that Jesus didn't do because of their lack of faith. Lack of faith in God's promise, which is Jesus...", "group_id": 9787, "id": 1450929}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308693195.7521989, "message": "@penkin here's an interesting passage relating to how we seek the kingdom of God...\n\n\nCol 3:1  If then you have been raised with Christ, seek the things that are above, where Christ is, seated at the right hand of God. \nCol 3:2  Set your minds on things that are above, not on things that are on earth. \nCol 3:3  For you have died, and your life is hidden with Christ in God. \nCol 3:4  When Christ who is your life appears, then you also will appear with him in glory. \nCol 3:5  Put to death therefore what is earthly in you: sexual immorality, impurity, passion, evil desire, and covetousness, which is idolatry. \nCol 3:6  On account of these the wrath of God is coming. \nCol 3:7  In these you too once walked, when you were living in them. \nCol 3:8  But now you must put them all away: anger, wrath, malice, slander, and obscene talk from your mouth. \nCol 3:9  Do not lie to one another, seeing that you have put off the old self with its practices \nCol 3:10  and have put on the new self, which is being renewed in knowledge after the image of its creator. \nCol 3:11  Here there is not Greek and Jew, circumcised and uncircumcised, barbarian, Scythian, slave, free; but Christ is all, and in all. \nCol 3:12  Put on then, as God's chosen ones, holy and beloved, compassionate hearts, kindness, humility, meekness, and patience, \nCol 3:13  bearing with one another and, if one has a complaint against another, forgiving each other; as the Lord has forgiven you, so you also must forgive. \nCol 3:14  And above all these put on love, which binds everything together in perfect harmony.", "group_id": 9787, "id": 1452670}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308723098.909884, "message": "@LintonCaldecott cool. Thanks.", "group_id": 9787, "id": 1455020}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308773432.6352191, "message": "The thing that keeps coming up that I want to look at is this idea of growing your faith. It seems to come up a lot and I am wondering if it is an idea we have come up with in the way we characterize faith. I'ma see if I can find biblical texts to support this or if Faith is Faith.\n\nI know the Bible talks about a saving faith and a non saving faith. Faith is as good as what you put it in. Put your faith an apple and you will not be saved. Put you faith in Jesus and you will be.\n\nThere is some concept of Ascentia and Fiducia. Something about a mere mental accent (Ascentia) vs fully believing and trusting in X (Fiducia).\n\nAnyway, was talking to someone the other day and they thought that faith was faith. That we are granted by God and it's not something that you can strengthen. The idea seems foreign to me but that may be just because that is how I have been taught. Does the Bible support a growing faith? One that I can actively cultivate?", "group_id": 9787, "id": 1459793}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308773451.4326341, "message": "Stupid text wrapping :(", "group_id": 9787, "id": 1459796}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308828795.5624399, "message": "@pevans_om Then consider the story of faith like a mustard seed. How can Jesus complain about the disciples lacking faith if faith is something only given by God? It makes no sense!", "group_id": 9787, "id": 1465213}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308829674.1674099, "message": "@penkin which is why @pevans_om says it makes no sense for Jesus to complain about faith...", "group_id": 9787, "id": 1465265}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308828704.5528059, "message": "@penkin 2 Thes 1:3\nWe ought always to give thanks to God for you, brothers, as is right, because your faith is growing abundantly, and the love of every one of you for one another is increasing.", "group_id": 9787, "id": 1465212}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829816.4475629, "message": "@LintonCaldecott I'm not excluding that possibility?", "group_id": 9787, "id": 1465275}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829369.9123371, "message": "@pevans_om Romans 12:3 \"For through the grace given to me I say to everyone among you not to think more highly of himself than he ought to think; but to think so as to have sound judgment, as God has allotted to each a measure of faith.\"\n\nIt's meaningless to throw around verses. We need to make sense of it all. Does God maybe give faith that we then cultivate? Or does God grant faith in some instances and in others He expects us to grow it?", "group_id": 9787, "id": 1465236}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829641.8744149, "message": "So either we can grow what we are given? Or we just use what we are given and that is called growth? Cause I could have a measure of faith that I never use. So maybe if I tent toward using it I have \"grown\" in what I was given?", "group_id": 9787, "id": 1465262}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829562.7394531, "message": "@pevans_om Ephesians 2:8-9 also seems to suggest that faith is a gift? \"For by grace you have been saved through faith; and that not of yourselves, it is the gift of God; not as a result of works, so that no one may boast.\"", "group_id": 9787, "id": 1465250}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308829672.73125, "message": "@penkin  @pevans_om, do we think that there are two kinds of faith? saving faith and operating as a christian faith?", "group_id": 9787, "id": 1465263}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308829835.7316041, "message": "heh. that's very diplomatic.", "group_id": 9787, "id": 1465277}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829864.0923381, "message": "@LintonCaldecott Sorry. What I mean is, can we maybe put that together biblically?", "group_id": 9787, "id": 1465284}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308829674.689079, "message": "If the disciples didnt understand it is their fault, but if they did, then it was God giving them the faith?", "group_id": 9787, "id": 1465266}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308829714.2553999, "message": "anyway, the question remains is \"saving faith\" the same as the faith we have as described in Romans 12, for example. I.E. the faith that makes us operate as christians.", "group_id": 9787, "id": 1465268}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829921.102072, "message": "@pevans_om thinking loud here... and then typing :P", "group_id": 9787, "id": 1465293}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308829845.903898, "message": "@pevans_om with regards to 2 Thes 1:3, are they not thanking God because He has increased their measure?", "group_id": 9787, "id": 1465278}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308830111.6531911, "message": "That thinking is a little non calvinist though, it implies that we have a hand in the matter. (not that i mean that's a bad thing, but i know there are those here that get uncomfortable with non calvinist thinking hehehe)", "group_id": 9787, "id": 1465320}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308830370.8847201, "message": "@penkin so far, only with the verses we've stitched together. Perhaps it's similar to the trinity, not specified but a doctrine that grew with understanding.", "group_id": 9787, "id": 1465346}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308830035.2585559, "message": "God can grow the faith of the believers, but it requires a responsiveness from us... We act in the little faith we have, and God increases it? If we do not act in that little faith, then it doesn't get grown", "group_id": 9787, "id": 1465316}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308830273.140017, "message": "@LintonCaldecott I think that's similar to what I was saying above. Can it be backed?", "group_id": 9787, "id": 1465340}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308831669.9542699, "message": "But then Jesus being upset still makes little sense because he tells them that they have little faith, and then tells them if THEY just had a little more faith things would be different. Emphasis seems to be on the failure by the disciples in showing faith...", "group_id": 9787, "id": 1465427}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308830270.987752, "message": "More interesting verses, in Luke 22:32 Jesus prays from Simon's faith to not fail. Does that mean He is asking the Father then to sustain and keep that faith strong. Else I think He would simply tell Simon to make sure his faith says strong possibly?", "group_id": 9787, "id": 1465334}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308831943.942476, "message": "@LintonCaldecott Could it be that they were not Looking to God for their faith? I suppose that's a stretch? Somehow we need to make sense of it all.", "group_id": 9787, "id": 1465444}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308831526.3653231, "message": "You know the Bible talks about be Holy for I Am Holy? Even though we know the Bible teaches that we cannot. Maybe that is why Jesus shows upsettedness? Not because we can build up our faith muscles but just  to prove a point that we cannot. That we need to rely on God even for our faith.", "group_id": 9787, "id": 1465410}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308831968.7971849, "message": "@LintonCaldecott Sure. Maybe they were not looking to God for their faith? Is that a stretch? I suppose we cannot tie up every end?", "group_id": 9787, "id": 1465451}, {"user_id": 32888, "stars": [], "topic_id": 37649, "date_created": 1308832054.1103151, "message": "@penkin Well, what would the disciples looking to faith look like. In the story where they display a lack of faith and Jesus is disappointed and asks them if they did not just see him feed two batches of thousands of people. That kind of supports your point.", "group_id": 9787, "id": 1465456}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308832717.5153699, "message": "@penkin That Ephesians quote I've always understood as salvation being the gift....not the faith", "group_id": 9787, "id": 1465535}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308833030.405164, "message": "Again I'll say this.....\nWhat we are dealing with is the Jewish understanding of God. Everything we have is from God. So that includes our faith, which can grow, but if it grows it is also from God and God allowing it to grow, but it grows through acting on our existing faith\n\nIt really does all make sense!", "group_id": 9787, "id": 1465603}, {"user_id": 13817, "stars": [], "topic_id": 37649, "date_created": 1308840044.0229051, "message": "@pevans_om Not sure I know what you mean here? Seems to me you're saying they are wrong and our western thoughts of what we want God to be is correct. Is the Bible not like the Bible is cause that is how God wants it? Does not God reveal Himself the way He is whether we get it or not?", "group_id": 9787, "id": 1466626}, {"user_id": 32900, "stars": [], "topic_id": 37649, "date_created": 1308851406.4295321, "message": "@penkin Not at all. I think the biblical authors are right. I think WE struggle to understand these things because our modern science focussed thinking expects too much logic and needs to explain everything and feels there is something wrong when we encounter an apparent paradox (like election and free will)", "group_id": 9787, "id": 1468570}]