[{"user_id": 39881, "stars": [], "topic_id": 44116, "date_created": 1313779552.2836871, "message": "We have continued to be unsuccessful with eggs, regardless of what they are being fed.  I am beginning to wonder if chicken is just not a good thing to feed those with severe protein intolerance/allergy because of the grain in their feed.  We simply cant range a chicken enough to NOT feed A grain of some kind.  Thoughts?", "group_id": 11398, "id": 1911936}, {"user_id": 39939, "stars": [], "topic_id": 44116, "date_created": 1313780228.6350961, "message": "After having success with the wild chicken in Trinidad I think it is possible. It would just involve us having a lot of land for them to roam and a lot of money to feed them other things. Question would be \"Is it worth it to do this?\" For our family if it is something the kids can eat then the answers is yes, but we need the resources to be able to do it.", "group_id": 11398, "id": 1912059}, {"user_id": 39890, "stars": [], "topic_id": 44116, "date_created": 1313781380.643415, "message": "Just curious if Dr. N has any thoughts on that?", "group_id": 11398, "id": 1912211}, {"user_id": 39939, "stars": [], "topic_id": 44116, "date_created": 1313781933.2652459, "message": "As Nichole had said before she will most likely say avoid animals fed grain until some healing has taken place then later on it may not be an issue any more.", "group_id": 11398, "id": 1912281}, {"user_id": 39881, "stars": [], "topic_id": 44116, "date_created": 1313783709.2817571, "message": "I asked her specifically about corn and soy free meat, and she said yes to avoid it.  She mentioned corn remaining in the meat, but I didnt ask her specifically about all grain.  I am just wondering if in severe cases there will still be a reaction.  But now that I think about it, it is probably tied to two things: 1 - each individual response.  Like Ellie did not have APT response to wheat but Hayleigh did, and 2 - if they were exposed to it before starting GAPS.  ??", "group_id": 11398, "id": 1912443}]