[{"user_id": 38225, "stars": [{"date_created": 1325236851.633327, "user_id": 41763}], "topic_id": 48980, "date_created": 1325221418.957829, "message": "In light of the lack of recent updates, in the spirit of fellowship I offer all my fellow Convorians this token of good intentions.\n\nThis is something I've been working on recently for the project. Due to the demand from fans for more narrative, we've been attempting to tell the story of Riven's demise from other points of view. As an optional extra to the original game, at certain points of the game the player will leave the Stranger's perspective to focus on another character somewhere else, to see other elements of the story unfold.\n\nThese newer sequences will be done with a much more modern style of gameplay when compared to the original. We've been working on the loading screens, or 'bridges' between these sections. Here is a taste of the first, occurring when the player is incapacitated after solving the Moiety puzzle.\n\n(Spoilers)\nhttp://www.youtube.com/watch?v=8xwDewuZIK8", "group_id": 11772, "id": 2748495}, {"user_id": 38225, "stars": [], "topic_id": 48980, "date_created": 1325221864.677521, "message": "If you can, watch it at 720p. Easier to make out the details.", "group_id": 11772, "id": 2748496}, {"user_id": 41763, "stars": [], "topic_id": 48980, "date_created": 1325236848.4618969, "message": "Very good.", "group_id": 11772, "id": 2748558}, {"user_id": 41709, "stars": [], "topic_id": 48980, "date_created": 1325256354.0000341, "message": "What is the point? (not trying to be condescending, just asking :D)", "group_id": 11772, "id": 2748652}, {"user_id": 41709, "stars": [{"date_created": 1325314701.162118, "user_id": 38225}], "topic_id": 48980, "date_created": 1325256534.002645, "message": " Don't worry this is just joke - Just noticed this. =D", "group_id": 11772, "id": 2748653}, {"user_id": 38225, "stars": [], "topic_id": 48980, "date_created": 1325315988.119525, "message": "@Ahlisendar Well, I'd just finished Uni for the year and I wanted to spend a few days making something small before I got back to all of the large scale projects going on (SE being one of them). Additionally, I always thought Riven could do well to be more like Call of Duty.\n\nDoes there have to be a point? :p", "group_id": 11772, "id": 2748859}, {"user_id": 41709, "stars": [], "topic_id": 48980, "date_created": 1325373604.5146351, "message": "Of course there doesn't! ;) But sometimes it can be interesting to know if someone thinks there is a point to something, and what they think it is.", "group_id": 11772, "id": 2749649}]