[{"user_id": 4219, "stars": [], "topic_id": 34549, "date_created": 1305035029.729279, "message": "say the task that processes a queue goes down for hours/days, when you bring it back up, it could cause your users to get tee'd off i.e. if they suddendly get 20 emails in their inbox", "group_id": 81, "id": 989459}, {"user_id": 4219, "stars": [], "topic_id": 34549, "date_created": 1305035069.3982129, "message": "it would be great if one could somehow scan all items, then summarize them or send out a single notice if there are multiple items in the queue that have to email a user for some reason.", "group_id": 81, "id": 989469}, {"user_id": 4219, "stars": [], "topic_id": 34549, "date_created": 1305035149.8427849, "message": "so looking for ideas on how to write smart code that during task queue hangups, when things go back online, a application doesn't overload a user with notification emails (or whatever) b/c the queue task wasn't running and now when it comes online it is going through each one and processing it (in this case sending out an email)", "group_id": 81, "id": 989482}, {"user_id": 15195, "stars": [], "topic_id": 34549, "date_created": 1305035461.467495, "message": "Rather than sending emails when your tasks are complete, create a Notification object, and periodically check for Notifications, if there are any, bundle them into a single email. Optionally only send if the last notification was created less than X minutes ago, incase you’re creating Notifications very rapidly (e.g. after a “hangup”).", "group_id": 81, "id": 989543}, {"user_id": 13325, "stars": [], "topic_id": 34549, "date_created": 1305037001.117713, "message": "Has this really been a problem for you? Seems like a solution looking for a problem.", "group_id": 81, "id": 990100}, {"user_id": 15195, "stars": [], "topic_id": 34549, "date_created": 1305038206.843852, "message": "@emperorcezar not something I’ve ever done, but I can imagine having to do it.", "group_id": 81, "id": 990541}, {"user_id": 4219, "stars": [], "topic_id": 34549, "date_created": 1305043999.9285431, "message": "i've seen a website have this issue b4", "group_id": 81, "id": 992066}, {"user_id": 1147, "stars": [], "topic_id": 34549, "date_created": 1305046975.6004729, "message": "I don't think queue inspection is an unusual problem and it's not just during site hangups. You can create a task on an event, without really wanting to inspect at that time if the event happened before. When the task is being processed, you will want to inspect the queue for others and either group them together or discard dupes. This can happen with errors, emails but can also happen for reports. Imagine a single report triggered by 3 different users, you want the report to run once and then notify those 3 users that it's ready. This isn't the only use case... That said, it's probably a bit niche anyway :)", "group_id": 81, "id": 992946}]