[{"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311491584.193522, "message": "I'm using MySQL, which I run in a ramdisk. I've noticed a huge speed decrease in my test runs. I'm not sure if MySQL is to blame or mysql-python or some other I/O issue. I created this topic to see if anyone else might be experiencing this. Any ideas?", "group_id": 81, "id": 1709122}, {"user_id": 25337, "stars": [], "topic_id": 42564, "date_created": 1311599255.8714421, "message": "@mkelley33, I think I'm seeing this too (on a disk-based MySQL setup). I generally haven't seen the performance improvements that have been touted with Lion, and that seems to be common with folks who've upgraded from SL rather than doing a clean install. I'm planning to do a clean install at the weekend - I'll report back with results.", "group_id": 81, "id": 1715084}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311615234.9873991, "message": "@danfairs thanks! I look forward to hear your results.", "group_id": 81, "id": 1716935}, {"user_id": 35281, "stars": [], "topic_id": 42564, "date_created": 1311669558.6650679, "message": "I used leopard, had the same issue. Then I had snow leopard on my machine, had the same issue. Now I run my test on sqlite3 to speed up. So I don't think it is OS to blame. It is something to do with MySQL or mysql-python.", "group_id": 81, "id": 1721680}, {"user_id": 3580, "stars": [], "topic_id": 42564, "date_created": 1311690134.1907239, "message": "K.. This is un-scientific, and I use SQLite for my unit tests.. but I saw this thread and ran a suite before upgrading.. after the upgrade the suite runs very similar (actually clocked in 5-10% faster)", "group_id": 81, "id": 1723395}, {"user_id": 25337, "stars": [], "topic_id": 42564, "date_created": 1311713471.4546649, "message": "@mkelley33 Certainly sqlite is the quickest test backends. Unfortunately lots of our tests require MySQL. Splitting them up so only those that require MySQL actually use it is on my to do list, as is running an in-memory database.", "group_id": 81, "id": 1726219}, {"user_id": 25337, "stars": [], "topic_id": 42564, "date_created": 1311713326.0199029, "message": "On a related note, I blogged a while back about some techniques you can use to speed up MySQL test runs: http://www.stereoplex.com/blog/speeding-up-django-unit-test-runs-with-mysql", "group_id": 81, "id": 1726204}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311728165.6936359, "message": "@danfairs I read your blog some time ago. Great information. I'm the guy named \"Michaux Kelley\" that posted a comment about how to run MySQL in a ramdisk :)", "group_id": 81, "id": 1727731}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311728062.465807, "message": "@phill I'm not sure what you mean about this being unscientific. Much like @danfairs some of the tests in my suite require MySQL, which precludes using SQLite; however, I've written a script that puts MySQL in ramdisk. Doing so made it possible achieve speeds very near to that of SQLite. Since upgrading to Lion my tests take more than four times as long to run. Snow Leopard and Leopard used to be blazingly fast.", "group_id": 81, "id": 1727728}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311728544.690279, "message": "@mmrs151 I hope its not the OS fault entirely. I love Lion except this annoying problem, which didn't appear at all for me under Leopard or Snow Leopard. MySQL might not be to blame either, rather the intent of this post is gather whether or not other users have encountered the same issue. If no one else running MySQL in a ramdisk notices this problem, then the fault surely lies with me, my configuration, or some other variable affecting the speed of the unit/integration tests.", "group_id": 81, "id": 1727766}, {"user_id": 3580, "stars": [], "topic_id": 42564, "date_created": 1311736765.7535319, "message": "@mkelley33 By unscientific I mean that I picked one of my test suites (randomly) and ran it once on each version. Not an interesting-enough sample size :)", "group_id": 81, "id": 1728479}, {"user_id": 35281, "stars": [], "topic_id": 42564, "date_created": 1311757181.6976781, "message": "@mkelley33 I guess you are right. I would love to know the workaround for it in this conversation.", "group_id": 81, "id": 1729845}, {"user_id": 25337, "stars": [], "topic_id": 42564, "date_created": 1311789480.6336291, "message": "@mkelley33 Ah! Yes, thanks for your comment. :)", "group_id": 81, "id": 1733096}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1311856478.462923, "message": "@phill oh how I wish the tests in the product I'm working on weren't so coupled to MySQL! SQLite speed boost for test run would be oh so nice right now :)", "group_id": 81, "id": 1738466}, {"user_id": 15343, "stars": [], "topic_id": 42564, "date_created": 1312398384.4298849, "message": "Just an update: the slow down I experienced was due in part to a networking issue, but was resolved by adding ``::1 localhost`` to /etc/hosts file. I found the source of the slowdown thanks to ``cProfile`` in the Python Profilers. Thanks @pmclanahan for pointing me to the solution.", "group_id": 81, "id": 1786804}, {"user_id": 43642, "stars": [], "topic_id": 42564, "date_created": 1321619857.6032619, "message": "dont use local sites with names *.local (ex.local or test.local) - it's related to bonjour and makes sites very slow", "group_id": 81, "id": 2594563}]