[{"user_id": 14057, "stars": [], "topic_id": 13980, "date_created": 1300559113.410588, "message": "I'm currently learning Puppet, and I wonder where its scope stops and an application tool one (like Fabric) starts?", "group_id": 2079, "id": 389038}, {"user_id": 14057, "stars": [], "topic_id": 13980, "date_created": 1300559207.3974049, "message": "For example: Puppet installs/configures Nginx and actually Fabric deploy my Django app, installing a supervisord conf file to manage my gunicorn process. Is this the correct way to do it, or do you make it another way? Where is *your* cursor between these two types of tools?", "group_id": 2079, "id": 389042}, {"user_id": 14057, "stars": [], "topic_id": 13980, "date_created": 1300562179.0110669, "message": "update: Puppet install Nginx, but does it configure the virtual host, or is this done another way (with Fabric for example)?", "group_id": 2079, "id": 389195}, {"user_id": 14057, "stars": [], "topic_id": 13980, "date_created": 1300569289.8287821, "message": "it seems logical, even if code deployment may need server (apache/nginx or in my case gunicorn) restart so your fabric script still needs to 'know' how the server is handled", "group_id": 2079, "id": 389556}, {"user_id": 5863, "stars": [], "topic_id": 13980, "date_created": 1300568830.7556379, "message": "My rationale is that this way puppet running in daemon mode will make sure things like virtualhost files and the like don't get out of sync with what's in the puppet master, say from adhoc changes", "group_id": 2079, "id": 389535}, {"user_id": 5863, "stars": [], "topic_id": 13980, "date_created": 1300568756.7823501, "message": "Good question. I keep things like virtualhost configs or any system level stuff in puppet/chef. And then use fabric for pushing out code or running adhoc commands, including potentially telling puppet to run on the client.", "group_id": 2079, "id": 389532}, {"user_id": 14057, "stars": [], "topic_id": 13980, "date_created": 1300569321.5867059, "message": "and puppet configuration and deployment script needs to be done in sync", "group_id": 2079, "id": 389558}]