[{"user_id": 11626, "stars": [], "topic_id": 6325, "date_created": 1297849422.220464, "message": "Top U.S. intelligence officials have raised concerns about the growing vulnerability the United States faces from cyberwarfare threats and malicious computer activity that CIA Director Leon Panetta said \"represents the battleground for the future.\"\r\n\r\n\"The potential for the next Pearl Harbor could very well be a cyber-attack,\" he testified on Capitol Hill Thursday before the House Permanent Select Committee on Intelligence.\r\n\r\nDirector of National Intelligence James Clapper also appeared, telling the committee, \"This threat is increasing in scope and scale, and its impact is difficult to overstate.\"\r\n\r\nThere are roughly 60,000 new malicious computer programs identified each day, Clapper said, citing industry estimates.\r\n\r\n\"Some of these are what we define as advanced, persistent threats, which are difficult to detect and counter,\" Clapper said.\r\n\r\nPanetta told the committee, \"This is a real national security threat that we have to pay attention to. I know there are a lot of aspects to it.\r\n\r\n\"The Internet, the cyber-arena ... is a vastly growing area of information that can be used and abused in a number of ways.\" U.S. officials and computer security experts have faced a wide array of diverse and growing computer threats in the past several years, including attempted infiltrations of Defense Department computers, high-profile companies being hacked and the data breach and related cyber-attacks involving Wikileaks.\r\n\r\nIn particular:\r\n\r\nThe Pentagon disclosed last summer that in 2008 \"malicious code\" from a flash drive ended up on classified and unclassified systems of U.S. Central Command, which oversees the war efforts in Afghanistan and Iraq.\r\n\r\nEntities in China were behind a highly sophisticated hacking of Google and more than 30 other companies in late 2009 that went undetected until January 2010. The hacking of Google's network was intended to gain access to the e-mail accounts of human rights activists in China.\r\n\r\nTelecommunications companies in China displayed false computer data that rerouted about 15 percent of the world's online traffic last April through Chinese Internet servers for about 17 minutes, affecting NASA, the U.S. Senate, the four branches of the military, the office of the Secretary of Defense and a number of Fortune 500 companies.\r\n\r\nhttp://abcnews.go.com/News/cia-director-leon-panetta-warns-cyber-pearl-harbor/story?id=12888905", "group_id": 3920, "id": 118588}]