[{"user_id": 11626, "stars": [], "topic_id": 40885, "date_created": 1309476640.9309051, "message": "Hacker claims to cripple Al Quaeda Internet comms\r\nGMA News\r\n06/30/2011\r\n\r\nA hacker has reportedly crippled the Web communications of the Al-Qaeda international terrorist network, a US-based television network reported Thursday (Manila time).\r\n\r\nNBC News quoted terrorism expert Evan Kohlmann as saying that the hackers managed to disrupt Al-Qaeda's flow of videos and communiqués.\r\n\r\n\"Al-Qaida's online communications have been temporarily crippled, and it does not have a single trusted distribution channel available on the Internet,\" said Kohlmann, of Flashpoint Global Partners.\r\n\r\nWhile he did not speculate in the NBC report who the attackers were, Kohlmann said the attack \"appears to bear the telltale fingerprints of government-sponsored hackers.\"\r\n\r\nHe added the attack appeared \"well-coordinated and involved the use of an unusual cocktail of relatively sophisticated techniques.\"\r\n\r\nIt may take the terrorist network \"at least several days\" to get their Internet communication back on track, he said.\r\n\r\nThe NBC report said Al-Qaeda's Internet communications suffered a similar hacker attack last year.\r\n\r\nLast June 2, the United Kingdom's The Telegraph reported a hack by British intelligence operatives disrupted the terrorist network's website.\r\n\r\nWould-be bombers downloading a recipe for making bombs from a suspected Al Qaeda online magazine may end up making cupcakes instead, it reported.\r\n\r\nThe Telegraph report said that British intelligence MI6 operatives who hacked into the site also removed articles by slain leader Osama bin Laden.\r\n\r\n\"When followers tried to download the 67-page colour magazine, instead of instructions about how to 'Make a bomb in the Kitchen of your Mom' by 'The AQ Chef' they were greeted with garbled computer code,\" the report said.\r\n\r\nThe \"code\" was actually a web page of recipes for “The Best Cupcakes in America\", published by the Ellen DeGeneres chat show.\r\n\r\nIt even included a recipe for Mojito and Rocky Road Cupcakes, the report said.\r\n\r\nBoth recipes replaced the original magazine's recipe for a pipe bomb, which The Telegraph reported as using \"sugar, match heads and a miniature lightbulb attached to a timer.\"\r\n\r\nAlso removed by the cyber attack were articles by bin Laden, his deputy Ayman al-Zawahiri and a piece called “What to expect in Jihad.\"\r\n\r\nThe report said British and US intelligence planned separate attacks after learning that the magazine was about to be issued in June last year.\r\n\r\nAccording to the Daily Telegraph story, British intelligence continued to target online outlets publishing the magazine because it is \"viewed as such a powerful propaganda tool.\"\r\n\r\nIt said the magazine is produced by radical preacher Anwar al-Awlaki, a leader of Al Qaeda in the Arabian Peninsula and his associate Samir Khan.\r\n\r\nAl-Awlaki and Khan are thought to be in Yemen, and associated with radicals connected to Rajib Karim, a British resident jailed for 30 years in March for plotting to smuggle a bomb onto a trans-Atlantic aircraft. — TJD, GMA News\r\n\r\nhttp://www.gmanews.tv/story/224895/technology/hacker-claims-to-cripple-al-quaeda-internet-comms", "group_id": 3920, "id": 1535114}]