[{"user_id": 27283, "stars": [{"date_created": 1304396877.7337279, "user_id": 1982}], "topic_id": 33332, "date_created": 1304384090.690834, "message": "I believe I have found an ideal way to deal with dependencies when developing python web applications. The idea is to set up a private PyPI server and mirror all your packages from there. I have written a script that utilizes pip to do this: http://ssutch.org/requisite and a guide that shows how easy it is to get up and running with your own copy of PyPI: http://ssutch.org/chishop-epio Tell me what you think.", "group_id": 292, "id": 891456}, {"user_id": 9229, "stars": [], "topic_id": 33332, "date_created": 1304403989.4238579, "message": "Oh, and apache isn't really necessary. \"python -m SimpleHTTPServer\" in the cached files directory will do :-)", "group_id": 292, "id": 894760}, {"user_id": 9229, "stars": [], "topic_id": 33332, "date_created": 1304403923.295049, "message": "Where I work we have a simple proxy that we use when performing our first installation with pip. It stores off the downloaded files which we move to a directory that Apache can serve. We then point pip at that apache directory for all subsequent installations. Easy as pie. I should write this up...", "group_id": 292, "id": 894759}, {"user_id": 18985, "stars": [], "topic_id": 33332, "date_created": 1304430500.5971889, "message": "I keep each package in HG, use hgwebdir to serve up all those repos, then each package in my requirements.txt file points at those (using \"-e hg+http://...\")", "group_id": 292, "id": 898058}, {"user_id": 27283, "stars": [], "topic_id": 33332, "date_created": 1304451261.884079, "message": "@r1chardj0n3s you should indeed write this up.", "group_id": 292, "id": 902184}, {"user_id": 4383, "stars": [], "topic_id": 33332, "date_created": 1304575370.4655721, "message": "I have situations where setting up pypi servers is pretty annoying and cost prohibitive. We would have to set up a pypi server for each customer and project. It would be a nightmare managing all of that.", "group_id": 292, "id": 924943}, {"user_id": 4383, "stars": [], "topic_id": 33332, "date_created": 1304575444.4115419, "message": "And what happens when dependencies change? Does your deploy script update your pypi installation automatically or do you need to update it manually? I would like to be able to update requirements.txt and not really worry about much else.", "group_id": 292, "id": 924963}, {"user_id": 27283, "stars": [], "topic_id": 33332, "date_created": 1304665160.8153231, "message": "@ianmlewis that's what requisite is supposed to accomplish.", "group_id": 292, "id": 939198}, {"user_id": 27283, "stars": [], "topic_id": 33332, "date_created": 1304665188.6950951, "message": "@ianmlewis it probably wouldn't work great for your situation, however.", "group_id": 292, "id": 939202}]