[{"user_id": 9108, "stars": [], "topic_id": 33329, "date_created": 1304383767.0098259, "message": "I'm curious if any Ubuntu users out there have strong feelings regarding Unity. I'm still undecided. Sometimes it's handy but other times I get the feeling that the normal menus are just a lot easier. I think it'll take a bit more use before I can really decide how I feel.", "group_id": 1042, "id": 891399}, {"user_id": 6202, "stars": [], "topic_id": 33329, "date_created": 1304387085.762496, "message": "I think it is the worst user interface I have ever used. I gave it a chance, too. I used it on my netbook for about a month. I switched back to Gnome.", "group_id": 1042, "id": 891882}, {"user_id": 9108, "stars": [], "topic_id": 33329, "date_created": 1304418067.779639, "message": "I think my biggest gripe so far is that it's difficult to find the items which normally live under the System menu. I normally use Alt + F2 to launch my day-to-day software. If I don't remember the name of something I only occasionally use from the System menu to type it, though, looking through the whole list of installed applications can be irritating.", "group_id": 1042, "id": 896282}, {"user_id": 9108, "stars": [], "topic_id": 33329, "date_created": 1306289026.0974641, "message": "I actually just installed Fedora 15 on another laptop and I have to say that despite seeming similar from screenshots, Gnome 3 is leaps and bounds better than Unity. Overall it just runs much more smoothly and is far easier to use. Whereas in Ubuntu I went back to running some older version of Gnome, I can see myself being happy with the default Fedora setup.", "group_id": 1042, "id": 1172882}, {"user_id": 35999, "stars": [], "topic_id": 33329, "date_created": 1311512327.7455809, "message": "@JohnFail but the Fedora package manager is the slowest I've ever tried.", "group_id": 1042, "id": 1709697}, {"user_id": 22687, "stars": [], "topic_id": 33329, "date_created": 1311792169.67875, "message": "@fredovich Do you mean Yum? Cause I find this very fast.", "group_id": 1042, "id": 1733334}, {"user_id": 35999, "stars": [], "topic_id": 33329, "date_created": 1311797047.151927, "message": "Maybe, but pacman from Arch is the fastest. I think Im more familiarized with it..", "group_id": 1042, "id": 1733877}]