[{"user_id": 12133, "stars": [], "topic_id": 39451, "date_created": 1308149742.2448089, "message": "acabo de leer en fayerwayer http://www.fayerwayer.com/2011/06/chile-peta-una-tienda-de-hardware-imaginaria-fw-startups/", "group_id": 965, "id": 1401155}, {"user_id": 12133, "stars": [], "topic_id": 39451, "date_created": 1308149778.5666151, "message": "basicamente es un sitio web q se conecta con los dealers de hardware y actualiza sus precios de acuerdo al dolar", "group_id": 965, "id": 1401165}, {"user_id": 12133, "stars": [], "topic_id": 39451, "date_created": 1308149799.111361, "message": "su modelo de negocios aqui: http://www.peta.cl/modelo", "group_id": 965, "id": 1401170}, {"user_id": 12133, "stars": [], "topic_id": 39451, "date_created": 1308149803.4462531, "message": "posible replicarlo aqui ?¿", "group_id": 965, "id": 1401173}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1308151290.537462, "message": "Tan es replicable que nosotros lo hacemos ja pero usamos mercado libre como intermediario aun y somos distribuidores de un solo mayorista, obviamente la gestion es el problema por tanta actualización que hay que hacer pero los beneficios son todos los de no tener stock y reducir costos y también precios cuando hay ofertas del mayorista", "group_id": 965, "id": 1401471}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1308151280.5737231, "message": "wow ya me ganaron mi modelo de negocio :) eso es mm similar a lo que queria hacer pero mas complejo, lastima que no puedo ejecutar aun y estoy empezando por lo basico. Pero definitivamente yo soy de los que creo que si se puede replicar", "group_id": 965, "id": 1401469}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1308151725.0575681, "message": "La verdad me da gusto que ya haya alguién más que tiene una idea \"rara\" como nosotros y la haya ejecutado, personalmente incentiva un poco más la confianza de seguir teniendo la visión que tenemos y un dia esperamos lograr ejecutar como lo pensamos :)", "group_id": 965, "id": 1401571}, {"user_id": 12133, "stars": [], "topic_id": 39451, "date_created": 1308154162.6655281, "message": "@keoz yo eh comprado en Yucatan productos de hardware a bellmicro. Y toda la tienda es mayorista osea tienes que tener un registro con ellos para que te puedan vender. ¿ Es posible que el mayorista envie al cliente final como en el paso 3?. Yo creo que esa no es trabajo del mayorista (bellmicro). De echo pienso que el paso 3 no existe. Si no que el minorista es el que envia. Que opinas ?¿", "group_id": 965, "id": 1401971}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1308154844.7309451, "message": "@zodman seguramente no todos los mayoristas lo hacen pero si gestionan logistica desde su portal solo les dices que lo envien a la dirección del cliente, ingram lo hace y de hecho es un \"envio a usuario final\" eso deberian hacer todos :)", "group_id": 965, "id": 1402051}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1308155439.8126521, "message": "Ahora la cuestión es que no es automatico, si tu compras en peta.cl por ejemplo me imagino que no es directamente al mayorista, no es como un broker entre el stock del mayorista y el cliente o que le lleguen los pedidos al mayorista, eso seria algo que estaria interesante de hacer pero implica cambiar muchas cosas. Si lo hacen manual no creo sea muy costoso tener alguien que procese los pedidos en el sitio y genere los pedidos ya al mayorista :)", "group_id": 965, "id": 1402159}, {"user_id": 36952, "stars": [], "topic_id": 39451, "date_created": 1309388385.937727, "message": "Este modelo de negocio se llama Dropship y muchas tiendas en internet asi lo usan.", "group_id": 965, "id": 1522705}, {"user_id": 13545, "stars": [], "topic_id": 39451, "date_created": 1309399583.997937, "message": "Les paso un link de AppSumo sobre un producto relacionado: http://appsumo.com/behind-the-scenes-of-a-muse/", "group_id": 965, "id": 1524482}, {"user_id": 26088, "stars": [], "topic_id": 39451, "date_created": 1309392818.9542949, "message": "@JoseJimenez ah que bien entonces si tiene un nombre definido y es bien usado :) yo lo que quiero hacer es que a través de algo esos wholesalers expongan sus catalogos para que distribuidores autorizados puedan venderlos directamente a ecommerce (eliminando revisar y publicar productos de sus catalogos \"manualmente\" ) y a mas de 1, estandarizando tal vez algunas cosas y empezando con algunos cuantos", "group_id": 965, "id": 1523407}]