[{"user_id": 11626, "stars": [], "topic_id": 8695, "date_created": 1298531037.4694021, "message": "The Air Force’s new stealth bomber might do more than just drop bombs, top generals said in recent days. The so-called “Long-Range Strike” plane — likely to be designated B-3 — could also carry bunker-busting, rocket-boosted munitions, high-powered lasers for self-defense and datalinks, and consoles for controlling radar-evading drones.\r\n\r\nThese add-ons, described by Air Force generals Philip Breedlove, William Fraser and David Scott, are meant to make the new bomber more lethal and harder to shoot down, even in the face of rapidly-modernizing air defenses such as China’s. “The purpose of this aircraft is to survive in an Anti-Access Area Denial environment,”Scott said, using the latest Pentagon term for defended airspace.\r\n\r\nTo that end, the bomber’s lasers might zap incoming missiles and fighters; the drones could fly ahead to scout and disable air-defense radars; the bunker-busters should ensure the bomber can actually destroy the enemy’s facilities once it breaks through the defenses.\r\n\r\nWith just $3.7 billion budgeted over the next five years to develop the bomber, lasers, bunker-busters, and drone-controls might seem unaffordable. And risky, considering the Air Force has said it must stick with “proven” technologies to keep the new bomber on-budget.\r\n\r\nIn fact, the bomber and its enhancements could be surprisingly far along the development process. The airframe itself might already be flying in prototype form, according to an investigation by ace reporter Bill Sweetman. Each of the add-on capabilities already exists, too, though not all in the same aircraft.\r\n\r\nFor years, the Air Force has been working on a chemical laser installed in the fuselage of a 747 freighter and fired from a turret mounted to the airliner’s nose. The Airborne Laser was originally meant for a combat role intercepting ballistic missiles, but in 2009 Secretary of Defense Robert Gates downgraded it to a strictly test asset, citing its high cost, short firing range and vulnerability. Future military lasers will dispense with the chemicals in favor of solid crystals, potentially making them much smaller, safer and more reliable. That’s the kind of laser we can expect to see on the new bomber.\r\n\r\nBunker-busting bombs have been around since World War II. In their modern form, they date back to the 1991 Gulf War. Today’s 5,000-pound GBU-28 bunker-buster can be carried by the F-15E and by bombers. For more deeply-buried targets, the Pentagon is working on the 30,000-pound Massive Ordnance Penetrator, which is so big only the B-2 and B-52 can haul it.\r\n\r\nTo save on cost, the new bomber will be smaller and therefore carry less ordnance than the B-2. MOP probably won’t fit. Noting that penetrating-capability is a function of mass and velocity, the Air Force Research Laboratories is working on a rocket-boosted bunker-buster that would be a fraction of the MOP’s size while being just as lethal against underground targets.\r\n\r\nDrone controls might seem the most futuristic of the new bomber’s enhancements, but in many ways they’re the farthest along in development. Boeing is installing datalinks and consoles for robot-control in its new “Block III” Apache helicopters. Last fall, the Air Force demonstrated it could control Scan Eagle drones from inside an airborne E-3 radar plane.\r\n\r\nAnd in 2009, the Air Force started fitting B-52s and F-16s with the Raytheon-built Miniature Air-Launched Decoy, a missile-size drone that can spoof or jam enemy radars. The current decoy model is autonomous — you fire it and forget about it — but Raytheon has offered to install a datalink allowing the decoy to “talk” to the launching plane. Refined a bit further, the same technology could be applied to the new bomber’s scout drones.\r\n\r\nIt’s not clear if these scout drone will be new designs or something already in service. Our money’s on an existing drone. In any event, there will be two different scout bots associated with the new bomber, according to Breedlove. These “utility infielders,” as Breedlove called them, must be “very stealthy” and capable of a range of missions, from radar-jamming to network-hacking and spying.\r\n\r\nIn an event, the add-ons don’t all have to be ready before the bomber’s scheduled debut in the mid-2020s. The Air Force wants to field the 100-or-so bombers in “spirals” — that is, small batches of increasing sophistication. The first models might not have bunker-busters, lasers or drone controls. Those systems would be inserted as soon as they’re ready — and as soon as the Air Force can afford them.\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/northrop_grumman_NGB_bomber_1-660x440.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/new-stealth-bomber-could-control-drones-fire-lasers-bust-bunkers/", "group_id": 3920, "id": 195855}]