[{"user_id": 12722, "stars": [], "topic_id": 16339, "date_created": 1301522830.4241631, "message": "Not enough skin.", "group_id": 11, "id": 485370}, {"user_id": 25705, "stars": [], "topic_id": 16339, "date_created": 1301522264.501435, "message": "http://www.bleedingcool.com/2011/03/30/wonder-woman-set-pics-show-a-good-look-of-adrianne-palicki-in-a-new-improved-costume/", "group_id": 11, "id": 485343}, {"user_id": 6202, "stars": [], "topic_id": 16339, "date_created": 1301541618.7724299, "message": "I think the colors are too saturated. It just looks ugly.", "group_id": 11, "id": 487473}, {"user_id": 15929, "stars": [], "topic_id": 16339, "date_created": 1301550419.0298929, "message": "like  a cheap halloween costume... but this is just snaps. I'll wait for the screen capture.", "group_id": 11, "id": 488859}, {"user_id": 15929, "stars": [], "topic_id": 16339, "date_created": 1301550520.943861, "message": "however, the cast worries me. remind me too much of the remake of Bionic Woman. she doesn't look like someone who can kick some ass.", "group_id": 11, "id": 488882}, {"user_id": 21759, "stars": [], "topic_id": 16339, "date_created": 1301550754.157815, "message": "It looks too shiny and cheap.", "group_id": 11, "id": 488954}, {"user_id": 26001, "stars": [], "topic_id": 16339, "date_created": 1301556273.7670629, "message": "Overall, it's a pretty good adaptation. If I HAD to nitpick; I'd say that the buckle and top of the bustier are too busy. And there's a marked absence of the color white in her traditional red, white, blue and gold color scheme.", "group_id": 11, "id": 489697}, {"user_id": 25, "stars": [], "topic_id": 16339, "date_created": 1301578929.4349589, "message": "http://www.npr.org/blogs/monkeysee/2011/03/31/134986690/dear-wonder-woman-you-will-get-arrested-if-you-fight-crime-in-that-top?sc=fb&cc=fp", "group_id": 11, "id": 491773}, {"user_id": 25705, "stars": [], "topic_id": 16339, "date_created": 1301594849.9751551, "message": "@Anneflo http://geekwhisperin.wordpress.com/2009/01/20/wonder-woman-the-super-secret-kinky-origin-of-a-feminist-icon/", "group_id": 11, "id": 494310}, {"user_id": 4149, "stars": [{"date_created": 1309102466.8116751, "user_id": 36785}], "topic_id": 16339, "date_created": 1301600802.4427431, "message": "http://www.myromancestory.com/myBlog/uploaded_images/Wonder-Woman-Lynda-Carter-725710.jpeg i think they should have just keep it retro, stop reinventing the wheel just saying", "group_id": 11, "id": 495198}, {"user_id": 26017, "stars": [], "topic_id": 16339, "date_created": 1301601901.0514779, "message": "How do we go from less coverage to more in current times?", "group_id": 11, "id": 495435}, {"user_id": 25705, "stars": [], "topic_id": 16339, "date_created": 1301602773.4057381, "message": "@dustdaughter I agree. I don't believe Kelley is the guy to make this show.", "group_id": 11, "id": 495673}, {"user_id": 4149, "stars": [], "topic_id": 16339, "date_created": 1301602178.666172, "message": "@normyd idk it is crazy seriously who knows @dustdaughter i hope not but i feel it will have that faith", "group_id": 11, "id": 495498}, {"user_id": 17610, "stars": [{"date_created": 1301602731.722883, "user_id": 25705}], "topic_id": 16339, "date_created": 1301602028.1077631, "message": "I'm scared this remake is going to suck hard like the new Bionic Woman did.  I am not a fan of  David E. Kelley.  I hate the way he writes women.  And I highly doubt he'll be faithful to the established comic character at all.  I'm going to watch so I can be an informed hater.", "group_id": 11, "id": 495458}, {"user_id": 25, "stars": [{"date_created": 1301594799.8400531, "user_id": 25705}], "topic_id": 16339, "date_created": 1301578921.0572231, "message": "From Linda Holmes, NPR: My sentiments exactly. \"Nevertheless, lady, these are not clothes for butt-kicking. They are clothes for high-kicking, specifically in a Rockettes Christmas show where you and sixty other women just like you are playing the part of an entire shipment of Wonder Woman Barbies that Santa had to throw away because they were deemed too naughty for the kids on the \"nice\" list.\n\nTell me the truth, Wonder: If I asked you to participate in a 50-yard dash, and it were you against someone you really wanted to be beat, is there any possibility you would say to me, \"Sure, let me run inside and get my red plastic bustier that sucks me in like Scarlett O'Hara and supports fully 30 percent of my natural blessings?\" THERE IS NO SUCH POSSIBILITY. You would not do yoga in that top. You would not run to catch a bus in that top, unless you crossed your arms over your chest the whole way there.\"", "group_id": 11, "id": 491771}, {"user_id": 25, "stars": [], "topic_id": 16339, "date_created": 1301600596.3064229, "message": "That was a great, fascinating article! But none of that changes what I think about this current costume. Fine, have a hot bodice on the crime-fighting costume, but this one barely covers her nipples! Once again, referring to the NPR post by Linda Holmes: \"There was a time when nobody understood that women could be good at fighting and also hot. There was a time when functionality had to take a back seat to fashion, and this is when your star-spangled undies were invented, you see. There was a time when you couldn't have it both ways. But now you can!...I am all for you being gorgeous. I am all for you embracing your right to be a sex bomb and a crime fighter at the same time, but that doesn't mean a strapless corset made of plastic. Not only can you not use your lasso in that outfit, you can't raise your arm to hail a taxi in that outfit.\"", "group_id": 11, "id": 495160}, {"user_id": 26001, "stars": [], "topic_id": 16339, "date_created": 1301610327.9291689, "message": "@normyd At least partially, I think we have Janet Jackdon and a certain wardrobe malfunction to thank for that.", "group_id": 11, "id": 497191}]