[{"user_id": 40166, "stars": [], "topic_id": 44504, "date_created": 1314375982.7015719, "message": "I'm really impressed with how AWESOME this Django-Social-Auth project is. Way better than what I was using before. The problem I'm having is that I'm requesting the extra 'email' permission in the scope, and it shows the initial popup for Basic Information, then goes to a second screen for approving Email, then redirects back to the application. Is there a way to include the email permission on the first step that asks for basic information access?", "group_id": 5196, "id": 1969260}, {"user_id": 40166, "stars": [], "topic_id": 44504, "date_created": 1314376794.469214, "message": "OK, so I figured out a way... Instead of using FACEBOOK_EXTENDED_PERMISSIONS = ('email',) in my settings.py file, I added perms=\"email\" to my fb:login-button. I'm using OAuth2 so I got an error message from facebook that said perms is now called scope, so when I switched it up to scope=\"email\" it works. Is Django-Social-Auth designed to be used with Facebook's OAuth2?", "group_id": 5196, "id": 1969310}, {"user_id": 20656, "stars": [], "topic_id": 44504, "date_created": 1314402399.1901851, "message": "Not yet, didn't knew that they had OAuth2 support, I'll take a look and provide the backend soon. Raised https://github.com/omab/django-social-auth/issues/134 to track it.", "group_id": 5196, "id": 1971618}, {"user_id": 40166, "stars": [], "topic_id": 44504, "date_created": 1314555141.1874199, "message": "@omab awesome, thanks! The current version seems to work fine even when telling facebook it's OAuth2 when I send with the FB.init request per the instructions on http://developers.facebook.com/docs/reference/javascript/", "group_id": 5196, "id": 1985105}, {"user_id": 15183, "stars": [], "topic_id": 44504, "date_created": 1315257740.0806589, "message": "I've just read: http://facebook-python-library.docs-library.appspot.com/facebook-python/examples/oauth.html Isn't it exactly the way django-social-auth works? Do I need to use JS SDK for anything?", "group_id": 5196, "id": 2053315}, {"user_id": 20656, "stars": [], "topic_id": 44504, "date_created": 1315411493.9006779, "message": "@restless_being, django-social-auth implements Facebook OAuth system and it will be quite similar with other implementations around, you don't need the JS SDK at all for authentication/authorization.", "group_id": 5196, "id": 2068617}]