[{"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302100801.702446, "message": "Fundamental este espacio!!", "group_id": 2696, "id": 559888}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302101674.6381409, "message": "Muchas Gracias Viejo Elkin.  La idea es que aquí demos un debate con mucha altura, trayendo todos los argumentos que nos ayuden a identificar los puntos débiles del planteamiento legal y así realizar un verdadero aporte a la sociedad", "group_id": 2696, "id": 560066}, {"user_id": 8142, "stars": [{"date_created": 1302156348.248147, "user_id": 13453}], "topic_id": 17611, "date_created": 1302100664.6185081, "message": "Estamos creando este espacio para la socializacion del Proyecto de Ley “Por el cual se regula las responsabilidad por las infracciones al derecho de autor y los derechos conexos en Internet”", "group_id": 2696, "id": 559875}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302100882.2078309, "message": "Adjunto texto del proyecto de ley, e invito a todos a iniciar una productiva discusion sobre el tema.\nhttp://www.mij.gov.co/Ministerio/Library/Resource/Documents/ProyectosAgendaLegistaliva/Derechos%20de%20Autor%20en%20Internet1680.pdf", "group_id": 2696, "id": 559898}, {"user_id": 18486, "stars": [], "topic_id": 17611, "date_created": 1302101486.1158881, "message": "Saludos amigos,m me uno a la discusión que de igual manera etsamos teniendo desde otros espacios frente a este Proyecto que es agresivo frente a los derechos en la red, nosotros desde el Partido Pirata Colombiano estamos en el estudio detallado del proyecto y esperamos poder intercambiar y actuar conjuntamente con otros colectivos del país interesados en el tema", "group_id": 2696, "id": 560017}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302102072.0081899, "message": "Nuestro amigo Francisco Javier Roldán, de la fundación País del Conocimiento, aporta los siguientes vínculos para contextualizar el debate:   (1.  http://www.youtube.com/watch?v=5YIlTKNrzQQ , 2. http://www.youtube.com/watch?v=hZAcTNFzF-s ; 3. http://www.youtube.com/watch?v=DDKpGePm7EY , 4. http://www.youtube.com/watch?v=mzluIZW41u4 , 5. http://www.youtube.com/watch?v=mSzulDyYO4g )", "group_id": 2696, "id": 560138}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302115778.1218801, "message": "Este video también me a parecido muy bueno para ambientar este tipo de debates: http://www.ted.com/talks/johanna_blakley_lessons_from_fashion_s_free_culture.html?utm_source=newsletter_weekly_2010-05-25&utm_campaign=newsletter_weekly&utm_medium=email", "group_id": 2696, "id": 562934}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302115494.1489179, "message": "Nutriendo el marco de referencia, comparto este libro \"Manual del CopyLeft\" http://www.unia.es/component/option,com_booklibrary/task,view/id,7/Itemid,457/", "group_id": 2696, "id": 562850}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302115679.640542, "message": "Este es otro documento que puede aportar visiones alternativas muy bien sustentadas: Manual para la Creatividad Sostenible en la era digital http://fcforum.net/files/sustainable-creativity/Fcf_Manual-cast_1-0.pdf", "group_id": 2696, "id": 562899}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302119206.1066401, "message": "Debemos definir un #hashtag para canalizar el debate en twitter", "group_id": 2696, "id": 563972}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122714.913197, "message": "3. Realizar un nuevo diagnóstico, y plantee nuevas rutas de solución", "group_id": 2696, "id": 565085}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122871.6505311, "message": "HIPÓTESIS: si el modelo permanece y no migra sistemática e inteligentemente (enfocado en los problemas) la brecha que nos separa de los países que tienen la solución a sus problemas y los que no la tienen se mantendrá necesariamente, porque una sociedad que no comparta el conocimiento no genera inteligencias colectivas que puedan solucionar sus problemas.", "group_id": 2696, "id": 565110}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122584.420368, "message": "Se plantea la siguiente metodología para abordar este debate, discusión,...construcción colectiva.", "group_id": 2696, "id": 565067}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122604.535218, "message": "1. Rediseñar, replantear nuevas tesis e hipótesis al respecto.", "group_id": 2696, "id": 565070}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122615.195962, "message": "siendo esta la principal, que debemos revaluar:", "group_id": 2696, "id": 565072}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122617.3736441, "message": "\"...Hoy parece incuestionable fomentar una actitud que valore al conocimiento, el científico y tecnológico en particular, como lo que es: un factor determinante del tipo y de la calidad de los bienes y servicios que produce una sociedad. Tampoco caben dudas sobre la necesidad de fomentar un clima propicio para las creaciones que desarrollen valores culturales. Sobre lo que pueden existir dudas es sobre la conveniencia de considerar que las creaciones intelectuales son objeto de un tratamiento equivalente al que se da a la propiedad privada de bienes materiales\". Propiedad privada: derecho a gozar y a disponer, con EXCLUSIVIDAD, de un bien, sea este material o inmaterial...\"", "group_id": 2696, "id": 565073}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122665.0780439, "message": "no sólo a la fecha (2011) sino teniendo en cuenta las características evolutivas de la sociedad actual", "group_id": 2696, "id": 565081}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122637.925735, "message": "2. Debemos realizar una lectura lo más cercana a la realidad de la problemática", "group_id": 2696, "id": 565076}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122796.59375, "message": "TESIS: \"Hoy parece incuestionable fomentar una actitud que valore el compartir el conocimiento, el científico y tecnológico en particular, como lo que es: un factor determinante para solucionar los problemas que genera una sociedad. Tampoco caben dudas sobre la necesidad de fomentar un clima propicio para que la actitud de compartir el conocimiento desarrolle valores culturales. Sobre lo que pueden existir dudas es sobre la conveniencia que el modelo arriba mencionado permanezca como la solución a los problemas que afronta la sociedad actual y futura\".", "group_id": 2696, "id": 565098}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302122754.4805579, "message": "Apotando en el escenario número 1:", "group_id": 2696, "id": 565091}, {"user_id": 26153, "stars": [], "topic_id": 17611, "date_created": 1302126080.444119, "message": "Seguimos con la vieja y maniquea costumbre de criminalizar para intentar educar.", "group_id": 2696, "id": 565624}, {"user_id": 13416, "stars": [{"date_created": 1302156398.9459829, "user_id": 13453}], "topic_id": 17611, "date_created": 1302129665.0525861, "message": "En el copyright hablamos de prohibiciones, en el copyleft de libertades", "group_id": 2696, "id": 565928}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302130095.1287079, "message": "Complementando el planteamiento inicial....de la wikipedia.", "group_id": 2696, "id": 565966}, {"user_id": 17223, "stars": [], "topic_id": 17611, "date_created": 1302130436.5741169, "message": "Quien se supone que asesoró a lleras para que saliera con esta nueva \"ley\"? #yopregunto es importante que  se tenga en cuenta que Colombia aún no cuenta con un desarrolo o cultura digital consolidada como para que ya quieran salir con estos proyectos de ley...", "group_id": 2696, "id": 566013}, {"user_id": 27797, "stars": [{"date_created": 1302156425.2861879, "user_id": 13453}], "topic_id": 17611, "date_created": 1302130489.7011321, "message": "Creo que no podemos sacar conclusiones antes de tiempo: se sabía que tarde o temprano nos iba a tocar una ley de derechos de autor actualizada al mundo de Internet.Ahora lo importante es aprovechar estos espacios de socialización para que la ley sea lo más equilibrada para todos los jugadores, y lo menos nociva para el desarrollo de Internet.", "group_id": 2696, "id": 566021}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302130097.2700591, "message": "\" El conocimiento ha estado presente desde los principios de la humanidad conforme la evolución del mismo hemos avanzado como especie. El conocimiento y la libertad están estrechamente conectados ya que el humano:Aprende, enseña y hace uso de sus conocimientos en la medida de la libertad que tenga para hacerlo. Hasta hace pocas décadas el conocimiento era patrimonio de la humanidad, y existía libertad de uso y acceso al mismo. Con la aparición de límites artificiales como las patentes y los derechos de autor entre otros (mal denominados en conjunto propiedad intelectual), el conocimiento perdió esta característica. En la actualidad, mientras que el avance de la tecnología por lograr una sociedad digitalizada y conectada brinda al conocimiento humano nuevas posibilidades de crecimiento, estos límites artificiales están restringiendo la posibilidad de aprovechar éste potencial.\"", "group_id": 2696, "id": 565967}, {"user_id": 25252, "stars": [], "topic_id": 17611, "date_created": 1302130388.785152, "message": "La criminalización debe ser contra los vendores y distribuidores de pirateria, no contra el usuario corriente que algun dia escucha una canción, le gusta y la descarga a su pc, sin animo de lucro, solo con el animo de entretenerse.", "group_id": 2696, "id": 566001}, {"user_id": 25252, "stars": [], "topic_id": 17611, "date_created": 1302130593.653043, "message": "solo basta con recordar esta noticia: \"Colombia: Visitas a sitios porno causan caída de internet en el Congreso\" http://www.fayerwayer.com/2010/12/colombia-visitas-a-sitios-porno-causan-caida-de-internet-en-el-congreso/", "group_id": 2696, "id": 566043}, {"user_id": 12272, "stars": [], "topic_id": 17611, "date_created": 1302130408.8752539, "message": "Esto es peor que la ley SINDE de España, ¿que se puede hacer para evitar que la implementen?", "group_id": 2696, "id": 566008}, {"user_id": 12272, "stars": [], "topic_id": 17611, "date_created": 1302130795.0368071, "message": "En vez de meter a los Nule en prisión, se dedican a perseguir a los internautas y a restringir la libertad de uso del Internet, ¿quien fue ese honorable senador?", "group_id": 2696, "id": 566058}, {"user_id": 17223, "stars": [], "topic_id": 17611, "date_created": 1302130525.359345, "message": "Ah y si... que lance la primera piedra quien nunca ha compartido  algo que tenga derechos de autor.. creo que no se salva ni los mismos que están proponiendo esto.", "group_id": 2696, "id": 566030}, {"user_id": 27805, "stars": [], "topic_id": 17611, "date_created": 1302137011.9641881, "message": "En el artículo 5 literal e dice que no habrá penalización si los proveedores ISP : No interfieren en las medidas tecnológicas de protección y de gestión de derechos de obrasprotegidas. ¿ a qué medidas tecnológicas se refieren? #chuzadas en internet?", "group_id": 2696, "id": 567256}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302140944.3074579, "message": "Los #hashtags que estan trinando son: #leylleras #hadopicolombia", "group_id": 2696, "id": 567879}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302141566.9052041, "message": "#leylleras #hadopicolombia #leyhadopi #leylleras #hadopicolombia #leyhadopi #leylleras #hadopicolombia #leyhadopi #leylleras #hadopicolombia", "group_id": 2696, "id": 568021}, {"user_id": 23699, "stars": [], "topic_id": 17611, "date_created": 1302142955.027997, "message": "con  esta ley lo que buscan es esconder una de las embarradas del gobierno #leylleras", "group_id": 2696, "id": 568459}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302143768.83548, "message": "¿embarradas del gobierno?, podría ser más explícito por favor.", "group_id": 2696, "id": 568805}, {"user_id": 27797, "stars": [{"date_created": 1302156465.701205, "user_id": 13453}], "topic_id": 17611, "date_created": 1302147204.8058491, "message": "Celebro todas las iniciativas que busquen generar discusión, pero no deben partir de preconceptos o suposiciones. Creo que es prematuro crear el hashtag #hadopicolombia...", "group_id": 2696, "id": 570456}, {"user_id": 17223, "stars": [], "topic_id": 17611, "date_created": 1302177010.2132511, "message": "El documento es algo confuso, es muy generalizado lo que nos deja a la gran mayoria como delincuentes informáticos, lo unico que aparentemente es claro es que existe una penalización si se ha recibido la denuncia por parte del dueño de los derechos, obviamente existen empresas detrás de esto como Microsoft pero esto es algo porque lo ellos hace rato vienen peleando al igual que muchas otras, ahora bien, pensemos en la realidad y nuestro contexto. esto es colombia...el pais de las leyes muertas o donde más se aplica la ley del embudo.. cuantas leyes no han sido aprobadas y realmente no se cumplen? seguramente ésta será una de ellas en caso de ser aprobada...", "group_id": 2696, "id": 574515}, {"user_id": 18486, "stars": [], "topic_id": 17611, "date_created": 1302187800.0304849, "message": "Dada las leyes que están buscando restringir y controlar la posibilidad de libre circulación de la información y de controlar internet, debemos Defender la Neutralidad en la red, el libre compartir y los Derechos Fundamentales de los ciudadanos.\n\nLa invitación es que en Todas las ciudades de América Latina en cualquier espacio que se desee y especialmente dentro del Evento Flisol 2011, hagamos un flashmod de unos 5 min a las 3PM (GMT -5) donde no concentremos todos y por medio de nuestros equipos de Computo, equipos móviles con bluetooht o cualquier medio digital, compartamos nuestros archivos y demostremos que el \"Compartir es Legal\" y es un derecho fundamental de la Humanidad.\n\nÚnete a este magno Evento, divúlgalo en tu localidad, reporta la actividad en twitter , facebook y youtube con el tag #CompartirEsLegal , sube los videos de esta actividad a la red y compártelo para demostrar que defendemos el Derecho de Compartir que todos tenemos\n\nEn Medellín lo haremos en el Museo de Antioquia en el Flisol 2011\n\nRecuerda Reportar tu ciudad en twitter, identica y facebook con el tag #CompartirEsLegal http://www.facebook.com/event.php?eid=154194347976710", "group_id": 2696, "id": 575921}, {"user_id": 18486, "stars": [], "topic_id": 17611, "date_created": 1302187759.6036539, "message": "FlashMob \"Compartir es Legal\"", "group_id": 2696, "id": 575909}, {"user_id": 18486, "stars": [], "topic_id": 17611, "date_created": 1302187755.208132, "message": "FlashMob \"Compartir es Legal\"", "group_id": 2696, "id": 575906}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302191347.96136, "message": "La Dirección Nacional de Derechos de Autor, abrió una plataforma para el debate de la #leylleras utilizando una plataforma libre (Wordpress) http://derechodeautor.wordpress.com/2011/04/06/este-proyecto-no-regula-el-intercambio-de-archivos-entre-usuarios-en-redes-p2p-2/ ¿Paradoja o Esperanza? el tiempo lo dirá todo", "group_id": 2696, "id": 576570}, {"user_id": 13447, "stars": [], "topic_id": 17611, "date_created": 1302192261.72223, "message": "El proyecto de Vargas Lleras es muy general y es muy ambiguo. Esa ambigüedad es lo que permitiría el violar la privacidad de nosotros como internautas. ", "group_id": 2696, "id": 576728}, {"user_id": 16500, "stars": [], "topic_id": 17611, "date_created": 1302195325.037329, "message": "@Jartack De acuerdo contigo, cuando el estado adopte una actitud efectiva contra verdadero negocio de la piratería (sí, esos que pululan en los Sanandresitos, en las universidades y muy descaradamente en Unilago frente a la Policía), puede empezar siquiera a pensar en leyes como la que están proponiendo. Es un mito que las descargas en internet han dañado la industria, al contrarío, la han potenciado enormemente!, que viva el P2P, el compartir!, y que combatan a las mafias de la piratería en Colombia, no a los usuarios!", "group_id": 2696, "id": 577341}, {"user_id": 19754, "stars": [], "topic_id": 17611, "date_created": 1302196348.2178569, "message": "@MauricioJaramil de acuerdo contigo mauricio, no saquemos conclusiones antes de tiempo, aprovechemos para opinar con criterio y como usuarios sin rencores polìticos estùpidos, vamos construyendo... de eso se trata estar en red :).", "group_id": 2696, "id": 577477}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302195049.45561, "message": "Buen artículo que provee puntos de vista muy valiosos para este debate: http://segundaplana.co/2011/04/nueva-ley-propone-carcel-a-piratas-en-colombia/#more-168", "group_id": 2696, "id": 577272}, {"user_id": 19754, "stars": [{"date_created": 1302210462.2584181, "user_id": 13453}], "topic_id": 17611, "date_created": 1302196218.253998, "message": "Yo estoy de acuerdo con que el proyecto es ambiguo, y que se debe modificar, pero de ahí a que ya demos por sentado que nos vamos a la cárcel por una descarga me parece algo extremo, tal vez no entienda mucho de los términos del \"acta\" como se denomina, pero está en nosotros que se puedan hacer esos ajustes y determinar claramente qué es un \"delito\" y que no, para no limitar nuestra expresión en la red. Los sigo leyendo pues me parece interesante ver diferentes puntos de vista y tratar de acomodar un poco mis ideas. Estoy bastante interesada en el tema y pienso que es constructivo lo que se hace si se dan argumentos como el link que compartió @juandacorrea y otros de calidad que he visto por allí. Un abrazo!.", "group_id": 2696, "id": 577444}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302197033.6719649, "message": "Se abre otro espacio de debate (para aportar ideas cortas) http://www.google.com/moderator/#15/e=6b6ed&t=6b6ed.40", "group_id": 2696, "id": 577610}, {"user_id": 27920, "stars": [], "topic_id": 17611, "date_created": 1302197089.566792, "message": "Participen también acá. Ya tenemos un senador de nuestro lado y está usando este enlace para recoger ideas https://www.google.com/moderator/#15/e=6b6ed&t=6b6ed.40&o=10", "group_id": 2696, "id": 577622}, {"user_id": 27933, "stars": [{"date_created": 1302201092.7828231, "user_id": 27933}], "topic_id": 17611, "date_created": 1302200981.4696879, "message": "No me explico por que razón las personas están tan molestas con la propuesta del doctor @german_vargas. Si una persona de bien quiere una canción LA COMPRA, si quiere una película, la COMPRA o LA ALQUILA, igual como debe ser con software, libros, juegos y cualquier tipo de contenido digital. Cualquier tipo de acción diferente es ROBAR. Los colombianos somo muy extraños, nos encanta ROBAR y saltarnos la ley por la galleta, y nos encanta luchar por nuestros intereses criminales camuflándolos de derechos, pero... ay de que otro nos haga lo que nos gusta hacer! ahí si lloriqueamos. Por si lo olvidan los débiles mentales que se sienten más indignados, el TERRORISMO que tanto afecta al país se financia en todo tipo de actividades criminales, siendo la piratería una de ellas. Al combatirla con el máximo rigor de la ley, garantizamos no sólo cortar de raíz ésta ruta de financiación, sino instaurar una cultura de legalidad, donde paguemos lo que corresponde por lo que queremos consumir. Para mí, y para muchos ciudadanos de bien, defender la \"Libertad en Internet\" es un sinónimo más de LIBERTAD PARA ROBAR. En Internet abunda el contenido legalmente gratuito, como software GPL, contenido bajo licencia de Creative Commons y similares que podemos compartir con la conciencia limpia. Así que antes de correr a rezongar por la propaganda barata de los carteles de la piratería y la ilegalidad, deténganse a pensar si les gustaría que la gente se ROBE lo que por derecho les pertenece... la puerta se mece en ambas direcciones, LADRONES!!!!", "group_id": 2696, "id": 578391}, {"user_id": 27921, "stars": [], "topic_id": 17611, "date_created": 1302201274.50264, "message": "@mtrocas El problema es que hay ciertas entidades que no roban porque hacen uso de excepciones y limitaciones del derecho de autor. ¿Podría decirse que una biblioteca es una ladrona porque permite el acceso al conocimiento? Hay personas que necesitan acceso a la información y no pueden comprarla, pero pueden  acceder a ella legalmente. Creo que en esos espacios el debate se debe hilar más fino.", "group_id": 2696, "id": 578433}, {"user_id": 27933, "stars": [], "topic_id": 17611, "date_created": 1302201792.9027989, "message": "@hiperterminal \"¿Podría decirse que una biblioteca es una ladrona porque permite el acceso al conocimiento?\" es el típico argumento de las organizaciones que defienden la piratería. Por si lo olvidaba, las bibliotecas reciben material legalmente adquirido o donado, sin representar perjuicios para quien emite el contenido. Por otra parte, creo que es importante clarificar que es \"necesidad\". Acaso la gente \"necesita\" una canción? o un juego? creo que no. Y muchas casas de software tiene licencias de aprendizaje, gratuitas. Es duro abrir los ojos a la realidad de la legalidad cuando uno puede bajar gratis algo por lo que una persona honesta paga con el fruto de su trabajo. Finalmente, No tener con qué pagar por contenido digital NO JUSTIFICA EL ROBO, o la gente tendría permitido robar comida de los supermercados si tuviera hambre y pudiera comprobar que no tiene como pagar por ella (y le recuerdo que la gente si NECESITA comida para vivir). Así que no doblemos los argumentos a favor de nuestros intereses turbios, por favor.", "group_id": 2696, "id": 578505}, {"user_id": 27921, "stars": [], "topic_id": 17611, "date_created": 1302203674.4895, "message": "@juandacorrea Entonces la cosa es llegar al equilibrio de la ley.", "group_id": 2696, "id": 578784}, {"user_id": 27921, "stars": [], "topic_id": 17611, "date_created": 1302203344.570436, "message": "@mtrocas ¡Exacto! Tu mismo lo has dicho, es material que ha sido legítimamente adquirido, pero lo ponen a disposición de una gran cantidad de personas (¿Podría considerarse publicación? Ojo: La publicación es un derecho patrimonial del autor, así como sacar contenidos de circulación y en este caso la biblioteca, por la excepción se lo está \"saltando\").", "group_id": 2696, "id": 578731}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302203570.947963, "message": "@mtrocas @hiperterminal recuerdo que cuando se crearon las bibliotecas públicas, el debate también se dió, tratando de prohibirlas.  Afortunadamente para muchos el modelo, en dónde se puede compartir, sin lesionar los intereses de los productores copyright, perdura hasta nuestros tiempos.", "group_id": 2696, "id": 578765}, {"user_id": 27921, "stars": [], "topic_id": 17611, "date_created": 1302203522.5453601, "message": "@mtrocas La gente si puede llegar a necesitar una canción o un juego. ¿Qué hay de una entidad que usa este contenido con fines educativos? Tal vez no tengamos una necesidad fisiológica como el hambre, pero puedes tener necesidad de conocimiento. Necesidades diferentes, pero necesidades al fin y al cabo. Mi \"interés turbio\" como lo llamas es clarificar lo que es una ISP. Al parecer la ley no lo define y no me queda claro si al publicar un enlace me convierto en una ISP, según esta ley.", "group_id": 2696, "id": 578761}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302203305.4088111, "message": "@mtrocas te pido el favor que revises los argumentos que está planteando @mobixconsulting en este foro de debate. Consideremos fundamental aportar miradas alternativas del asunto, ópticas diversas, que ayudarán a nutrir este importante debate. Fundamental proteger lo que el autor decida que se debe proteger, pero este no debe ser el modelo dogmático. Hay modelos alternativos que deberían tener cabida en la ley.  También es muy pertinente la reflexión, hasta donde la ley, que muy seguramente tiene un espíritu en pro de la legalidad, va a punir con sus planteamientos el acto de \"compartir\" que es de naturaleza muy diversa y por lo tanto compleja en internet.", "group_id": 2696, "id": 578720}, {"user_id": 27991, "stars": [], "topic_id": 17611, "date_created": 1302204637.2612381, "message": "Las consecuencias de la violación de los derechhos de autor se reflejan en la piratería, totalmente de acuerdo y deberían sancionarse, creo que a nadie le gusta que le copien o le roben su trabajo, pero no a costa del sacrificio de tu privacidad, todos tenemos derecho a tener una vida privada y no vivir  una censura permanente de contenidos, además no se puede permitir el desbalance de la red, no se puede permitir que espacios neutrales se conviertan en salones tipo Gran Hermano. Además estas leyes dejan ver un gobierno que nos mira a todos como criminales, donde todos somos culpables hasta que se demuestre lo contrario.", "group_id": 2696, "id": 579046}, {"user_id": 27991, "stars": [], "topic_id": 17611, "date_created": 1302205172.6898561, "message": "No se debe sacrificar el derecho a la privacidad que tenemos todos los Colombianos por el beneficio de unos pocos, ese no es un argumento válido en el siglo 21, que se debe castigar la piratería es cierto pero no es un \"precio pequeño\" perder la libertad que garantiza la internet @mtrocas. Que te observen y que te esculquen no te hace libre.", "group_id": 2696, "id": 579158}, {"user_id": 27933, "stars": [], "topic_id": 17611, "date_created": 1302204855.87659, "message": "@hiperterminal @juandacorrea Creo que no hay duda de que los contenidos que se han hecho libres por libre consentimiento del autor están exentos de toda regulación, y naturalmente toda regla tiene su excepción, pero como siempre ha sido el caso, siempre que una persona tiene un interés particular, lo quiere enmarcar como un derecho, y al defender la libertad irrestricta a la distribución de contenidos digitales, estamos promoviendo de forma implícita el derecho a disponer de contenidos que requieren de una transacción comercial para su uso. El autor está en todo su derecho de exigir la compensación económica que quiera por el uso de sus contenido digital, de la misma manera que es libre de distribuirlo gratuitamente.  y con respecto a la duda de @hiperterminal un Internet service provider (ISP) es toda organización que le vende el servicio de conexión a Internet, y naturalmente ellos son la primera línea de defensa entre los proveedores de contenido y los ladrones que quieren apropiarse de aquello por lo que los demás deben pagar. Las leyes son la segunda línea de defensa, y si la gente debe perder su derecho a usar Internet o ir a la cárcel, es un precio pequeño para proteger a la gente que invierte tiempo, recursos y talento en producir aquello por lo que espera una compensación.", "group_id": 2696, "id": 579078}, {"user_id": 13416, "stars": [], "topic_id": 17611, "date_created": 1302209873.388438, "message": "Buen análisis de @MauricioJaramil http://www.enter.co/internet/18-preguntas-y-respuestas-sobre-el-proyecto-antipirateria-en-colombia/", "group_id": 2696, "id": 580530}, {"user_id": 13453, "stars": [], "topic_id": 17611, "date_created": 1302210612.1403129, "message": "Recomiendo la nota de @radnalcolombia esta mañana en entrevista con @carobotero especialmente que da buenas luces para entender la materia. La entrevista al Director de @derechosdeautor da la otra mirada, sin embargo no es muy buena la participación de Juan Carlos Monroy http://radionacionaldecolombia.gov.co/index.php?option=com_topcontent&view=article&id=16731:polemica-por-ley-lleras-de-derechos-de-autor-en-internet&catid=1:noticias", "group_id": 2696, "id": 580721}, {"user_id": 28063, "stars": [], "topic_id": 17611, "date_created": 1302219711.633014, "message": "articulo recomendado donde Jurado, que es un productor de ideas, un escritor que vive de su pluma, habla sobre las alternativas digitales para el modelo de mercadeo actual que se cae a pedazos y que el lobby de la cultura quiere no dejar morir a toda costa \nhttp://alt1040.com/2011/01/la-pirateria-no-existe\nseguramente algunos de uds ya lo hayan leído, yo lo leí hace algunos meses pero esta completamente metido en el contexto de lo que estamos viviendo hoy, y lo mas interesante es que viene del lado de un creador (que supuestamente es el gremio mas afectados con la piratería)", "group_id": 2696, "id": 582430}, {"user_id": 28086, "stars": [], "topic_id": 17611, "date_created": 1302223809.3936329, "message": "me parece importante que se hable sobre definiciones para: compartir, publicar, lucro. son necesarias para que la ley no tenga ambiguedades. al igual que hay que aclarar que no se puede violar la privacidad de internautas. ", "group_id": 2696, "id": 582845}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302232041.3981509, "message": "No hay excusa para arriesgar la privacidad de los ciudadanos.", "group_id": 2696, "id": 584760}, {"user_id": 13447, "stars": [], "topic_id": 17611, "date_created": 1302236995.212255, "message": "El gran detalle y en el cual se debe hacer énfasis es en el fijar los limites de la ley, porque por más buena fe que se quiera controlar la piratería no se debe atentar contra la privacidad de los usuarios. La ambigüedad en algunos puntos de ese proyecto de ley es lo que realmente asusta a muchos, sobre eso es importante tener un consenso general con representación de todos los estamentos de la sociedad y no menos importante el fomentar dentro de la sociedad sistemas alternativos para compartir información como las licencias Creative Commons.", "group_id": 2696, "id": 585905}, {"user_id": 26274, "stars": [], "topic_id": 17611, "date_created": 1302263557.692004, "message": "Interesante la Ley, pero miremola con la lupa. En otros países sólo ha servido para proteger los intereses de las multinacionales.", "group_id": 2696, "id": 588803}, {"user_id": 26274, "stars": [], "topic_id": 17611, "date_created": 1302263615.9302189, "message": "En españa se llama Ley Sinde y en Francia Hadoi", "group_id": 2696, "id": 588810}, {"user_id": 26274, "stars": [], "topic_id": 17611, "date_created": 1302263649.481591, "message": "de acuerdo con Enrique, se estaria violado la privacidad de las personas, pero aún si, invito a que leamos el PDF de la Ley", "group_id": 2696, "id": 588814}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302273441.792325, "message": "@juandacorrea @EnriqueSalazar  me preocupa el Articulo 15 donde se da vía libre al acceso de la información confidencial de lo usuarios, un \"supuesto\" en Colombia puede ser cualquiera, y si al final no es culpable??? donde queda mi privacidad???. Es como si te violaran para ver si eres virgen.", "group_id": 2696, "id": 590722}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302275279.3180571, "message": "Soy yo, o no he leido a nadie en esta discusion a favor de la Ley? Seria bueno para el debate.", "group_id": 2696, "id": 591255}, {"user_id": 15483, "stars": [{"date_created": 1302286253.948338, "user_id": 13453}], "topic_id": 17611, "date_created": 1302274356.472898, "message": "Recomiendo la lectura detenida de este artículo: http://www.baquia.com/posts/nota-enter-la-digitalizacion-arma-de-doble-filo-para-los-contenidos Aporta muchas ópticas al presente debate", "group_id": 2696, "id": 591012}, {"user_id": 21732, "stars": [{"date_created": 1302275492.964319, "user_id": 26274}, {"date_created": 1302286240.23752, "user_id": 13453}], "topic_id": 17611, "date_created": 1302273546.1093669, "message": "http://goo.gl/QCfik adjunto la ley de Chile, donde se regula la propiedad intelectual sin necesidad de restringir contenidos ni violación de la privacidad.", "group_id": 2696, "id": 590746}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302275820.6866829, "message": "@EnriqueSalazar creo que el inconveniente de la ley es mezclar propiedad intelectual con métodos para sustraer información confidencial de los usuarios y métodos de censura de contenidos, da vía libre a muchas cosas", "group_id": 2696, "id": 591439}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302277523.170562, "message": "En este punto, y viendo las discusiones, deberian reescribir la Ley usando un lenguaje mas claro, favoreciendo la presuncion de inocencia, y quedandose solo con las denuncias y sin dejar espacio para la utilizacion de metodos invasivos a la privacidad para buscar infracciones. Despues de eso continuar con el debate, asi hasta que tengamos una Ley con consenso.", "group_id": 2696, "id": 591875}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302275348.812273, "message": "De todas formas me gusta lo civilizado de la discusion hasta ahora (almenos aqui).", "group_id": 2696, "id": 591280}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302275588.8010399, "message": "Yo invité a @lucasarnau al parche, pero parece ser que no aceptó la invitación.  Dejo constancia", "group_id": 2696, "id": 591358}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302276963.276736, "message": "Otro punto, es que un material no deberia ser removido por la simple denuncia. Creo que afecta la presuncion de inocencia y daria pie a una caza de brujas. El materia obviamente debe ser removido cuando una orden judicial lo ordene. Otro asunto es desarrollar un aparato judicial rapido para este analisis.", "group_id": 2696, "id": 591774}, {"user_id": 26946, "stars": [{"date_created": 1302286276.0234809, "user_id": 13453}], "topic_id": 17611, "date_created": 1302281830.841701, "message": "Después de haber leído el Proyecto de Ley, es cierto lo que dice Enrique del lenguaje, no sólo debería ser más claro, sino evitar las ambigüedades. Por ejemplo, utilizar el término caching con sólo el significado que usan en el Art. 1, me parece incorrecto.", "group_id": 2696, "id": 592734}, {"user_id": 26946, "stars": [{"date_created": 1302295904.400651, "user_id": 13453}], "topic_id": 17611, "date_created": 1302284620.04863, "message": "Leyendo el debate en la página de derechos de autor y hay varios puntos para discutir. Por ejemplo, si ya existen leyes contra la piratería ¿porqué encuentras en juzgados software pirata? ¿No serían estos mismos jueces los que judicializarían a los posibles infractores? Alguien bajó de internet este software, alguien lo instaló y lo están usando. ¿Sería posible asegurar que en ninguna alcaldía, gobernación, notaría, el congreso, en la casa de algún funcionario público hay software pirata?", "group_id": 2696, "id": 593367}, {"user_id": 26946, "stars": [], "topic_id": 17611, "date_created": 1302284679.072113, "message": "@WolfMneo Esas son las ambigüedades que tiene la ley.", "group_id": 2696, "id": 593377}, {"user_id": 26946, "stars": [{"date_created": 1302286285.0417171, "user_id": 13453}], "topic_id": 17611, "date_created": 1302282821.24896, "message": "¿Cuántos recursos se necesitarían para hacer una persecución virtual de uno o varios de los posibles infractores? ¿No podrán estos posibles infractores esconderse bajo distintas ubicaciones y enredar a otros que no tienen que ver? Además, antes de llegar al presunto culpable ¿no quedaría la información confidencial de mucha gente expuesta? Corrijanme por favor si estoy equivocada.", "group_id": 2696, "id": 592968}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302283322.3907311, "message": "@eli_Santi ahi esta mi punto, totalmente de acuerdo, y que si son inocentes ??? ya la confidencialidad se violó.", "group_id": 2696, "id": 593105}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302284508.475481, "message": "Pregunta: Si tengo una web con vínculos compartiendo música almacenada en rapidshare, megaupload, etc; tanto el hosting de mi pagina como el de las que alojan los contenidos están en países donde no aplican están leyes, además yo no subí el archivo, y esto solo lo hago por compartir, por lo tanto no me lucro de el hecho de publicar el enlace. En este caso como aplica la ley???", "group_id": 2696, "id": 593347}, {"user_id": 26946, "stars": [], "topic_id": 17611, "date_created": 1302285562.480444, "message": ":D Es la idea.", "group_id": 2696, "id": 593603}, {"user_id": 26946, "stars": [], "topic_id": 17611, "date_created": 1302284896.8561931, "message": "¿A cuántos jueces les van a enseñar sobre el mundo virtual y todas sus implicaciones para que puedan tomar las decisiones \"correctas\"?", "group_id": 2696, "id": 593430}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1302284687.8935261, "message": "Otro punto a analizar es que este tipo de leyes traslada, lo que en cientos de industrias es responsabilidad de la industria misma (velar por el cumplimiento de los contratos que suscriben con sus usuarios), a una responsabilidad del sistema judicial y policivo, lo cual no es otra cosa que crear una subvención oculta a su modelo de negocio.  Si quieren entender la dinámica de esta práctica recomiendo la lectura de: http://www.baquia.com/posts/nota-enter-la-digitalizacion-arma-de-doble-filo-para-los-contenidos para entender las dinámicas que subyacen a esta polémica, y los costos que tendría que asumir una sociedad en favor de unos pocos, con intereses muy puntuales (muy seguramente meramente económicos)", "group_id": 2696, "id": 593380}, {"user_id": 15483, "stars": [{"date_created": 1302295915.99, "user_id": 13453}], "topic_id": 17611, "date_created": 1302285427.8170619, "message": "@eli_santi, muy valiosos tus comentarios.  Muchas gracias por enriquecer este debate", "group_id": 2696, "id": 593572}, {"user_id": 15483, "stars": [{"date_created": 1302295925.857594, "user_id": 13453}], "topic_id": 17611, "date_created": 1302285981.997674, "message": "Tengo un mensaje para los señores artistas, individuos que tercian fuertemente en esta polémica.  El modelo #Copyright es precisamente eso, un modelo, que para muchos se ha convertido en un paradigma, y que infortunadamente es altamente incompatible con los principios y fundamentos de internet (http://internetrightsandprinciples.org/node/403).  La buena noticia para ellos es que existen modelos altamente compatibles con internet, y que han sido incorporados por gigantescas industrias que pueden denominarse \"culturales\", de manera creativa y mucho más compatible con los principios que rigen la red.  A los artistas los invito a visitar y analizar estos dos recursos: http://www.ted.com/talks/johanna_blakley_lessons_from_fashion_s_free_culture.html?utm_source=newsletter_weekly_2010-05-25&utm_campaign=newsletter_weekly&utm_medium=email http://fcforum.net/files/sustainable-creativity/Fcf_Manual-cast_1-0.pdf, con el ánimo que puedan entender que hay territorios en donde los cuales se puede librar la batalla con mucho mejores resultados.", "group_id": 2696, "id": 593716}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302290118.827538, "message": "@juandacorrea que buen aporte", "group_id": 2696, "id": 594791}, {"user_id": 16500, "stars": [], "topic_id": 17611, "date_created": 1302290981.7602091, "message": "Pienso que la inconsistencia mas grande que tiene esta ley es que se crea para atacar supuestamente la piratería desde internet, a través de los proveedores, pero, la piratería no actua en internet, actua en las calles, ese es el verdadero canal de distribución, y ya existen leyes que penalizan eso y las autoridades, el gobierno ni la ciudadanía las hacen valer, por lo tanto, si en verdad quisieran atacar la piratería, deberían hacerlo en la calle, no en nuestros hogares. En segundo lugar: ¿que pasa cuando se restringe la libre distribución de un producto?, exacto! se encarece, lo que harán es que los piratas callejeros, ganen mas plata, pues a mas riesgo, mayor es el costo, y al no existir canales mas exitosos de distribución, la piratería, la verdadera piratería gana!", "group_id": 2696, "id": 595034}, {"user_id": 16485, "stars": [], "topic_id": 17611, "date_created": 1302290372.062932, "message": "he leido la propuesta de la ley, y convierte a las compañias proveedoras de servicios de internet en policias de la red, dentro de un marco amplio de accion con criterios subjetivos se acaba la libertad en el mundo 2.0, al leer esto me recuerda la pelicula \"la vida de los otros\"", "group_id": 2696, "id": 594872}, {"user_id": 13447, "stars": [], "topic_id": 17611, "date_created": 1302291654.309701, "message": "Estoy de acuerdo con algunas cosas que dicen. Un problema grave es que se queda a merced de un sistema judicial ineficiente y que la presunción de culpa seria la nota predominante, porque no es posible que por una sospecha que muchas veces sea infundada se ordene el acceder a datos privados de los internautas.", "group_id": 2696, "id": 595161}, {"user_id": 28256, "stars": [], "topic_id": 17611, "date_created": 1302297771.941576, "message": "Quisiera pedir la ampliación sobre, cuando desde un blog o paginas de facebook se realizan enlaces a videos, material en PDF, artículos de periódicos y revistas, que pueden o no estar bajo las estrictas y variadas normas de copy right, cual es mi situación como usuario ante esta ley, puedo o no usar enlaces para usar como referencias de mis opiniones y post del blog? o para compartir con mis amigos desde facebook y otras redes sociales?", "group_id": 2696, "id": 596136}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302299328.113306, "message": "Por favor, para mantener la calidad que hemos llevado hasta ahora en este espacio, lean los aportes y documentos referenciados hasta el momento desde el inicio (alla bien arriba), para que tengan claro el contenido de la Ley", "group_id": 2696, "id": 596402}, {"user_id": 28251, "stars": [], "topic_id": 17611, "date_created": 1302298040.499681, "message": "Por el momento solo un comentario: exigencia del TLC.", "group_id": 2696, "id": 596187}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302299343.7174261, "message": "y las posiciones de los que han participado hasta el momento.", "group_id": 2696, "id": 596404}, {"user_id": 28086, "stars": [], "topic_id": 17611, "date_created": 1302306930.1455901, "message": "http://twitcam.livestream.com/4fgqx no se cuanto dura grabada, pero este es el link de la twitcam hecha por @eltiempocom sobre la #leylleras. con participación del representante de la dirección de derechos de autor y otro representante de creative commons.", "group_id": 2696, "id": 597752}, {"user_id": 28503, "stars": [{"date_created": 1302464213.2664039, "user_id": 28086}, {"date_created": 1302480864.9547429, "user_id": 8142}, {"date_created": 1302608841.2985229, "user_id": 13453}], "topic_id": 17611, "date_created": 1302427358.7770121, "message": "Hay que tener en cuenta la Ley del PND (que ya pasó primer debate) y que en el artículo 52 (pág 28 http://bit.ly/dGnla0) dice claramente que los ISP “no podrán bloquear, interferir, discriminar, ni restringir el derecho de cualquier usuario de Internet, para utilizar, enviar, recibir u ofrecer cualquier contenido, aplicación o servicio lícito a través de Internet”.", "group_id": 2696, "id": 608563}, {"user_id": 8142, "stars": [], "topic_id": 17611, "date_created": 1302480873.027895, "message": "@dianaparrasilva excelente!", "group_id": 2696, "id": 615902}, {"user_id": 28251, "stars": [], "topic_id": 17611, "date_created": 1302635602.5402889, "message": "Si bien este espacio es para la discusión de una Ley que no será la primera ni la última de este tipo, quiero llamar la atención a los Foristas del aporte de @jundacorrea que no sólo termina en los Derechos y Principios del Internet http://internetrightsandprinciples.org/", "group_id": 2696, "id": 647783}, {"user_id": 28251, "stars": [], "topic_id": 17611, "date_created": 1302636304.1821029, "message": "Si no en un proceso de defensa de los mismos (coalición) el cual tiene discusiones importantes sobre el tema. Es importante estar atento a sus actividades, me parece que plantean la discusión en un escenario de importancia sin par para las futuras generaciones: Internet como \"espacio donde todos pueden expresar su opinión, adquirir conocimientos, generar ideas y no sólo la información, el ejercicio de su derecho a criticar, discutir, participar en la vida política más amplia\", es decir, el ciberespacio como escenario de disputa de poder entre sociedad civil, empresas y Estados. El llamado es para estemos atentos, generemos redes y deliberemos según nuestra conciencia.", "group_id": 2696, "id": 648012}, {"user_id": 21732, "stars": [], "topic_id": 17611, "date_created": 1302714028.4315159, "message": "Interesante este articulo aporta desde el punto de vista legal http://goo.gl/QCLC0", "group_id": 2696, "id": 667566}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1303240902.7406399, "message": "Comparto con ustedes este pequeño artículo y charla TED sobre el tema: http://knowledgefactory.tv/2011/04/19/%C2%BFla-leylleras-pone-en-peligro-expresiones-y-valores-culturales-aqui-algunas-respuestas/", "group_id": 2696, "id": 745537}, {"user_id": 27921, "stars": [], "topic_id": 17611, "date_created": 1303457804.1354721, "message": "@mtrocas Me diste tu definición de ISP, el problema es que el proyecto de ley tiene una definición diferente. Artículo 1. No son sólo quienes venden el acceso, según la ley", "group_id": 2696, "id": 779729}, {"user_id": 16500, "stars": [], "topic_id": 17611, "date_created": 1303574836.9488249, "message": "Importante es bajo que marco y con que finalidad se propone la #leylleras.\r\n1. No es una ley que lucha contra la piratería (ese ejercicio se da en las calles, no en internet, y es una pelea que el gobierno va perdiendo), es una ley que busca el control de contenidos en internet.\r\n2 ¿porque se propone entonces esta ley? R. Es una EXIGENCIA del gobierno de los ESTADOS UNIDOS para firmar el TLC, he ahí que se pasara un apresurado borrador y que en este momento la ley este incompleta y poco precisa (lo que es muy peligroso, pues puede llegar a permitir que prácticamente te \"chuzen\" tu conexión sin orden judicial, esto es MUY grave", "group_id": 2696, "id": 789676}, {"user_id": 29517, "stars": [], "topic_id": 17611, "date_created": 1303911266.4181659, "message": "estoy de acuerdo contigo, es que no sé como van a controlar el derecho de autor en internet sin hacer monitoreo sobre los datos que viajan por la red? más aún, si el servicio de hoy en dia es pésimo, imaginense la carga operativa!, no es consistente con el hecho que se quiere que el internet este al acceso de todos... deberían proponer algo más inteligente, hay otras maneras!! cosas que por ejemplo hace itunes, spotify y otros.", "group_id": 2696, "id": 825936}, {"user_id": 15483, "stars": [], "topic_id": 17611, "date_created": 1303915406.827955, "message": "Les comparto el artículo que publiqué recientemente en Enter.co sobre este importante debate: http://www.enter.co/otros/la-transformacion-de-la-industria-cultural-primer-debate-sobre-leylleras/comment-page-1/#comment-8850", "group_id": 2696, "id": 826641}]