[{"user_id": 11626, "stars": [], "topic_id": 42974, "date_created": 1311987125.2152541, "message": "Sheriff, Police on High Alert After GOP Chair \"Likes\" Anti-Tyranny Article on Facebook\r\nSoCal Martial Law Alerts\r\nJuly 29, 2011\r\n\r\nKERSHAW COUNTY, South Carolina — Sheriff Jim Matthews and Elgin Chief of Police, Harold Brown, have placed their officers on high alert after Kershaw County Republican Party Co-Chairman, Jeff Mattox, \"Liked\" an article on Facebook.com — a popular social-networking website.\r\n\r\nChief Brown said, \"We take this very seriously.”\r\n\r\nCamden Chief of Police, Joe Floyd, said that he would \"reinforce\" his officers' \"training\" and \"provide a united front along with the sheriff and chief.\"\r\n\r\nhttp://photos2.meetupstatic.com/photos/event/3/1/b/1/event_43932721.jpeg\r\n\r\nThe article, entitled \"When Should You Shoot A Cop,” is an opinion piece written by Larken Rose and made a reasoned argument for resisting state-sponsored tyranny when there is no other option left. Rose cited historical examples such as: \"Stalin ... Lenin ... Chairman Mao ... Hitler ... Pol Pot, or any number of other tyrants in history.\"\r\n\r\n\"In an ideal world, cops would do nothing except protect people from thieves and attackers, in which case shooting a cop would never be justified,\" Rose said in the article.\r\n\r\n\"When Should You Shoot A Cop” was originally posted on the CopBlock.org website and Marlene Motley, who is a member of Kershaw County Patriots (KCP), reposted the link to KCP's Facebook page with the caveat: \"Please, Read the article before you comment.\"\r\n\r\nMattox, who is also a member of KCP, came along afterwards and clicked the \"Like\" button that accompanies all posts on Facebook. Mattox did not leave a comment on the article, but later said in a telephone interview with the local Chronicle-Independent newspaper, \"I support [Rose's] right to say what he's saying. He does have some good points. Although we don’t advocate shooting cops, it does create a discussion.\"\r\n\r\nMattox stated in an interview with WISTV 10 that he didn't even remember clicking the \"Like\" button on Rose's article.\r\n\r\nWhether he remembers it or not, Mattox's act of \"liking\" the post on KCP's Facebook page — a page which Sheriff Matthews is apparently monitoring — caused Sheriff Matthews to be \"irritated\" and to characterize the post as \"hateful\" and \"irresponsible,\" even though the article itself was not written by anyone associated with KCP and Sheriff Matthews did not ask any KCP members for their opinion of the article, or their rationale for posting it.\r\n\r\n\"If Matthews had a problem with the article he could have contacted me,\" said Motley, the KCP member who posted the CopBlock link. \"I had thought about not posting, but felt the article made a valid point.\"\r\n\r\nRather than speak to any KCP members, Sheriff Matthews told his officers “that there is a group in this county that is reading stuff that says it’s OK to shoot a cop... That article does suggest that, at certain times, it’s OK to shoot a cop.”\r\n\r\nHere's what Rose actually said about \"certain times\" in his article:\r\n\r\n\"To get a little perspective, try watching a documentary or two about some of the atrocities committed by [tyrannical] regimes... Pause the film when the jackboots are about to herd innocent people into cattle cars, or gun them down as they stand on the edge of a ditch, and THEN ask yourself the question, 'When should you shoot a cop?'\"\r\n\r\n\"I was disappointed in the reaction to the article by law enforcement,\" said Motley. \"Anyone who took the time to read the article would realize that, unless there was tyranny at the hands of law enforcement, the article was not advocating going about shooting police officers.\"\r\n\r\nAware of the provocative nature of his title, \"When Should You Shoot A Cop,\" Rose opened his article:\r\n\r\n\"That question, even without an answer, makes most 'law-abiding taxpayers' go into knee-jerk conniptions... In doing so, they also inadvertently demonstrate why so much of human history has been plagued by tyranny and oppression.\"\r\n\r\nSpeaking of \"knee-jerk conniptions,\" the \"Liking\"-an-anti-tyranny-article controversy was strong enough to cause Kershaw County Republican Party Co-Chairman, Chris Oviatt, to ask Mattox to resign from the chairmanship position that they both share. And this despite the fact that Oviatt is also a member of the same patriot group, KCP, that sparked the alleged controversy in the first place.\r\n\r\nWhen Mattox refused to resign voluntarily, Oviatt took matters into his own hands and began a move to eliminate Mattox's Co-Chairman position completely, even though GOP bylaws do not appear to allow it.\r\n\r\n\"We've always encouraged our members and officers to have their opinions, but when you talk about doing harm to somebody, that is the line, because that doesn't represent values of the Republican Party,\" Oviatt said.\r\n\r\nIn a similar vein and without any evidence, Sheriff Matthews attempted to publicly conflate KCP with a murderous anti-government extremist group called the Sovereign Citizens, which is currently under investigation by the FBI:\r\n\r\n“I don’t know if they’re aligned with the Sovereign Citizen movement,” said Sheriff Matthews when asked about the connection to KCP by the Chronicle-Independent. \"I don’t know if they all have the same membership rolls, but they certainly seem to hang together.”\r\n\r\nMattox categorically denied any connection to Sovereign Citizens: \"We’re not affiliated with them in any way.”\r\n\r\nSheriff Matthews also characterized KCP as \"ultra right wing ... extremist\" without explanation and \"[wondered] what they are doing that they want to isolate themselves from any law enforcement intervention.\"\r\n\r\nSheriff Matthews ran for office on the Republican Party ticket and regularly attended Kershaw County Republican Party meetings until after his election. He then voluntarily isolated himself from the GOP meetings, because, according to him, KCP \"hijacked the meetings.\"\r\n\r\nhttp://photos3.meetupstatic.com/photos/event/3/4/7/7/event_43933431.jpeg\r\nSheriff Matthews' Facebook profile page. He is a member of Kershaw County Patriots.\r\n\r\nOn April 7, 2009, the Department of Homeland Security (DHS) issued a document to federal, state, local and tribal law enforcement entitled: \"Rightwing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment.\"\r\n\r\nThe document divides “rightwing terrorists” into two categories: “adherents that are primarily hate-oriented (based on hatred of particular religious, racial or ethnic groups), and those that are mainly antigovernment, rejecting federal authority in favor of state or local authority, or rejecting government authority entirely.\"\r\n\r\nDHS maintains a Fusion Center in South Carolina under the auspices of the South Carolina Law Enforcement Division. One of the main purposes of fusion centers is to disseminate federally-generated intelligence materials to local agencies. In return, DHS collects massive amounts of information on ordinary citizens due to being allowed access to local databases.\r\n\r\nFusion centers have also been known to infiltrate local activist groups, as was the case with the Olympia Port Militarization Resistance, an antiwar group located in Washington state. Wikileaks.org released a document showing that domestic \"Army Fusion Cells\" coordinate with local law enforcement to collect information on local activists.\r\n\r\nSheriff Matthews' current law enforcement position, his federal Drug Enforcement Administration background, his \"hateful\" and \"ultra right wing ... extremist\" rhetoric and his monitoring of the Kershaw County Patriot group appear to be the \"smoking guns\" connecting him to the South Carolina Fusion Center and the types of operations that fusion centers are known to carry out against the American people?\r\n\r\nMattox released a statment on July 28, 2011 in which he called for the immediate resignation of Sheriff Matthews.\r\n\r\n\"Sheriff Jim Matthews has unfairly and illogically compared me to extremists and criminals. He has acted in such a manner as to portray me as a threat to the citizens of this county,\" said Mattox in his statement. \"Sheriff Jim Matthews has abused his office and I am demanding now ... that he resign from the office of sheriff for his shameful and disgraceful efforts to destroy one solitary man on the most ridiculous pretense imaginable.\"\r\n\r\nMattox also called for the immediate resignations of Co-Chairman Oviatt and South Carolina Republican Party Chairman Chad Connelly for their complicity in attacking his character and for Connelly's silence on \"the matter of the Lt. Governor.\"\r\n\r\n\"If they cannot arrest me,\" Mattox said, \"then why do they expend so much effort to publicly malign me by using the power and prestige of their offices to, in the most outlandish and bizarre behavior I have ever witnessed, falsely accuse me of being a terrorist or worse?\"\r\n\r\nMeanwhile, in a classic case of attacking the messengers instead of the message, Larken Rose's offer to defend his article goes unheeded:\r\n\r\n\"I would love to have a public discussion with the Sheriff who claims the article is 'irresponsible' and 'hateful.' Instead of suiting up for battle, maybe we can have a rational discussion, instead. I'd prefer an exchange of words to an exchange of bullets any day. So how about it, Mr. Sheriff?\"\r\n\r\n\r\n\r\nKershaw County Sheriff's Office\r\nSheriff Jim Matthews\r\n803-425-1512\r\nkcso@kershaw.sc.gov\r\n\r\nElgin Police Department\r\nChief Harold Brown\r\n803-438-9917\r\n803-425-1512\r\nchief@elginpolice.org\r\n\r\nCamden City Police Department\r\nChief Joe Floyd\r\n803-425-6035\r\n\r\n\r\nLINKS:\r\n\r\nKershaw County Patriots Facebook page\r\nhttp://www.facebook.com/groups/kcpatriots\r\n\r\nSheriff Jim Matthews Facebook page\r\nhttp://www.facebook.com/jmatthewspi\r\n\r\nWhen Should You Shoot A Cop\r\nhttp://www.copblock.org/5475/when-should-you-shoot-a-cop\r\n\r\nSheriff, chiefs warn officers after Web post\r\nhttp://www.chronicle-independent.com/archives/7817\r\n\r\nPoliticos Attacked for ‘Liking’ CopBlock.org Post\r\nhttp://www.copblock.org/6374/politicos-attacked-for-liking-copblock-org-post\r\n\r\nS.C. Police on Alert After Political Activist \"Liked\" Article on Facebook\r\nhttp://www.activistpost.com/2011/07/sc-police-on-alert-after-political.html#more\r\n\r\nSouth Carolina GOP County Co-Chair ‘Likes’ Cop Killing on Facebook\r\nhttp://wonkette.com/450012/south-carolina-gop-county-co-chair-likes-cop-killing-on-facebook#respond\r\n\r\nThe Cowards of Kershaw County\r\nhttp://stuffedsuits.com/news/sc-politics/689-cowards-of-kershaw-county\r\n\r\nGOP leader asked to resign after discussing \"when to shoot a cop\"\r\nhttp://www.wistv.com/story/15152529/gop-leader-asked-to-resign-after-discussing-when-to-shoot-a-cop\r\n\r\nJeff Mattox Calls for Resignations of Kershaw Co. Sheriff, KCGOP & SCGOP Chairs\r\nhttp://stuffedsuits.com/news/sc-politics/690-jeff-mattox-statement-press-release\r\n\r\nSecret DHS Doc Predicts Violence in Response to New Gun Restrictions\r\nhttp://www.infowars.com/secret-dhs-doc-predicts-violence-in-response-to-new-gun-restrictions\r\n\r\nSouth Carolina Fusion Center (Component of the South Carolina Law Enforcement Division)\r\nhttp://www.sled.sc.gov/SCIICContact.aspx?MenuID=ContactInformation\r\n\r\nRightwing Extremism: Current Economic and Political Climate Fueling Resurgence in Radicalization and Recruitment\r\nhttp://www.scribd.com/doc/24840936/H-R-404-Rightwing-Extremism\r\n\r\nIntelligence Fusion Centers\r\nhttp://publicintelligence.net/intelligence-fusion-centers\r\n\r\nSpying on anti-war protesters: US Army Concept of Operations for Police Intelligence Operations\r\nhttp://www.wikileaks.org/wiki/Spying_on_anti-war_protesters:_US_Army_Concept_of_Operations_for_Police_Intelligence_Operations%2C_4_Mar_2009", "group_id": 3920, "id": 1752008}]