[{"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301382321.8824949, "message": "On a related topic, I'm starting to look at sourcing development hardware for some RoR dev, and I love working on my macbook but would like to get something with some real power and am wary of the price tag of a 17\" macbook.  As I missed the meetup on dev tools I'm curious to hear various opinions on dev'ing on mac vs linux.", "group_id": 4606, "id": 467302}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301382222.045084, "message": "http://developers.slashdot.org/story/11/03/28/2149206/Why-Mac-OS-X-Is-Unsuitable-For-Web-Development", "group_id": 4606, "id": 467289}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301382221.3288479, "message": "In case anyone didn't see this on slashdot:", "group_id": 4606, "id": 467288}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301412298.908896, "message": "At least I think it was gedit. Anyhow, Aptana 3.0 beta wasn't THAT bad, but it had some glaring flaws. The git integration was just ridiculous and didn't work properly at all. gedit had some pretty decent plugins actually (you could go and download a huge pack that modifies gedit into a pretty good coding editor) but it still lacked some stuff that I just found to be annoying (I can't think of any of the issues off the top of my head).", "group_id": 4606, "id": 469985}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301412492.77127, "message": "HOWEVER, I found I ran into wayyyy less problems in Ubuntu. Stuff just \"worked\". Installing and compiling gems was easy peasy. RVM worked flawless (but I guess it does on Mac also)", "group_id": 4606, "id": 470022}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301412557.71593, "message": "I just hijacked your thread and went into Windows vrs Ubuntu for dev'ing. Whoops..", "group_id": 4606, "id": 470026}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301412192.2794361, "message": "I tried making the leap to Ubuntu. I found Ubuntu to be pretty clunky (but that could've been my old school laptop, but I can run Windows XP perfectly fine..). My biggest warning would be that the editors that I attempted to use blew chunks. I'm not a VIM guy so I tried to reach out and get some other tools that would make my life easier (Aptana and gEdit mostly).", "group_id": 4606, "id": 469970}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301412356.7812729, "message": "I ended blowing it away and for Ruby + Rails I'm using Ruby Mine which has awesome functionality, but i find the GUI is clunky. It also annoys me because the support for just stand alone Ruby projects seems to suck.", "group_id": 4606, "id": 470000}, {"user_id": 21846, "stars": [], "topic_id": 15972, "date_created": 1301416323.1391959, "message": "I think it is a silly argument, assuming that all types of web development are the same. No, not everyone uses Textmate. No, not everyone will have the same deployment-production needs. *shrug*", "group_id": 4606, "id": 470628}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301417730.4700971, "message": "Everyone on slash basically destroyed him. I think he came off a bit too strong.", "group_id": 4606, "id": 470743}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301419595.413424, "message": "I'm confused why the post was linked on slashdot.  He's basically ranting, there's unprofessional language throughout, and as many people pointed out his arguments aren't sound.", "group_id": 4606, "id": 470897}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301419681.3603699, "message": "If I make the switch to linux I think I'll be going the vim route.  I'd class myself as a beginner in vim; I can navigate and use some of the built-in commands (d,y,p) but there's allot I'd need to pick-up to be effective.", "group_id": 4606, "id": 470902}, {"user_id": 13919, "stars": [], "topic_id": 15972, "date_created": 1301431115.5427029, "message": "I've been using Ubuntu full time for the last two years and have generally had a very positive experience. The team does a good job integrating the different software, and making sure everything works simply. It's great running the same software on my box as on the server. I use vim for my development and have been very happy. Paying the $24 bucks for PeepCode's vim screencasts is well worth the money, and I wish I'd found them when I first switched to Rails development with vim. Otherwise, I've got no real complaints.", "group_id": 4606, "id": 472228}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301429049.654686, "message": "Also I'm curious what distro's people are using.  My default choice is Ubuntu because it saves me alot of the headaches of getting an install functional, but I'm open minded.", "group_id": 4606, "id": 471978}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301429605.2084069, "message": "That being said, our current infrastructure here is all centos which I'm regretting", "group_id": 4606, "id": 472050}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301429631.816371, "message": "mainly because a lot of the chef recipes assume ubuntu", "group_id": 4606, "id": 472056}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301429586.995615, "message": "I go with ubuntu when I can.", "group_id": 4606, "id": 472048}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1301429324.591471, "message": "The Ubuntu Software Center thing was pretty damn slick. It was like an app store for Ubuntu.", "group_id": 4606, "id": 472017}, {"user_id": 21846, "stars": [], "topic_id": 15972, "date_created": 1301430441.378932, "message": "+1 Ubuntu. We use it on the production side, our shared test machines, and a few desktops around the office.", "group_id": 4606, "id": 472168}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301782438.1445401, "message": "::back from here", "group_id": 4606, "id": 510637}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301782360.0444241, "message": ":just testing the irc gateway here", "group_id": 4606, "id": 510632}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301782379.9688711, "message": "back from here", "group_id": 4606, "id": 510635}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301782407.4240999, "message": ":back from here", "group_id": 4606, "id": 510636}, {"user_id": 21834, "stars": [], "topic_id": 15972, "date_created": 1301782375.063139, "message": ":another test", "group_id": 4606, "id": 510634}, {"user_id": 21814, "stars": [], "topic_id": 15972, "date_created": 1301966056.420655, "message": "I run a 15\" MacBook Pro with 8GB of RAM. It's great for Rails development. I also use TextMate as my code editor. If you're already on a Mac, I'd recommend staying.", "group_id": 4606, "id": 531769}, {"user_id": 21845, "stars": [], "topic_id": 15972, "date_created": 1301971063.082865, "message": "+1 to Ubuntu.  Now I just have to force myself to use Vim more.", "group_id": 4606, "id": 532661}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1301976034.1699071, "message": "been using vim for the past week and quickly falling for it.  it's possible I could be as fast in textmate, but vim seems to force me into using the hotkeys whereas I can be too lazy in textmate.", "group_id": 4606, "id": 534258}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1302279128.3249969, "message": "I've been using Komodo Edit 6.0 lately. It's pretty good, directories on the side, ruby syntax highlighting, pretty lightweight. Only downfall is that I can't seem to figure out how to open multiple instances of it (it's gotta be somewhere, I just haven't looked hard enough).", "group_id": 4606, "id": 592185}, {"user_id": 22052, "stars": [], "topic_id": 15972, "date_created": 1302803966.4835989, "message": "I figured I'd try using redcar (while I'm trying out every dev studio in the universe for Ruby). It's actually pretty good. Really feels like textmate (or Aptana Studio Beta 3) which is good. Functionality is still pretty limited though. Some of the stuff just doesn't seem to work for me like the test runner, but whatever. It'll do for now. No tab completion (unless the text/variable/method has been already called on the page).", "group_id": 4606, "id": 687912}, {"user_id": 21846, "stars": [{"date_created": 1303263553.592082, "user_id": 13919}], "topic_id": 15972, "date_created": 1303262102.7502511, "message": "@benzittlau are you using vim in the console or through something like mvim? This git repo has a great starting point for vim configuration defaults, and handy plugins: https://github.com/carlhuda/janus", "group_id": 4606, "id": 749406}, {"user_id": 21842, "stars": [], "topic_id": 15972, "date_created": 1303317244.320142, "message": "I'm using mvim, and used akita's configuration as a base, though I've drifted from it somewhat at this point: http://akitaonrails.com/2009/01/04/rails-on-vim-in-english", "group_id": 4606, "id": 756802}]