[{"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1298943303.168653, "message": "I go to Google and search 'lifestyle business\" and there are no paid links. I go to my Adwords account to bid on the keyword and Google informs me that the minimum bid is $1 -- I'm the only advertiser. Is this price fixing?", "group_id": 250, "id": 230777}, {"user_id": 1116, "stars": [], "topic_id": 9608, "date_created": 1298944071.4297669, "message": "Sounds like to me its a minimum bid.", "group_id": 250, "id": 230853}, {"user_id": 1116, "stars": [], "topic_id": 9608, "date_created": 1298944099.67536, "message": "@nickgassmann hah jinx.", "group_id": 250, "id": 230858}, {"user_id": 2841, "stars": [], "topic_id": 9608, "date_created": 1298944069.3506579, "message": "They're not allowed to set a base price for keyword/ad placement on their own site?", "group_id": 250, "id": 230851}, {"user_id": 218, "stars": [{"date_created": 1299086342.341846, "user_id": 805}], "topic_id": 9608, "date_created": 1298943757.5967889, "message": "price fixing would indicate that they are colluding with someone else to drive the price up, which doesn't seem to be happening?", "group_id": 250, "id": 230818}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1298943946.2400589, "message": "Got it... should have cited the Sherman Act: The Sherman Act made agreements \"in restraint of trade\" illegal. It also made it a crime to \"monopolize, or attempt to monopolize … any part of the trade or commerce.\"", "group_id": 250, "id": 230835}, {"user_id": 2841, "stars": [], "topic_id": 9608, "date_created": 1298944110.581239, "message": ":D", "group_id": 250, "id": 230862}, {"user_id": 13194, "stars": [], "topic_id": 9608, "date_created": 1298958174.6911421, "message": "Are you sure it's not a \"first page bid\" price? If so, it's not required to bid it, it's just recommended. In the end, your actual cost per click will be lower.", "group_id": 250, "id": 232144}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1298981761.848381, "message": "I did bid lower, but it is the principle of being the only bidder and being hit with a high minimum bid, seems unethical.", "group_id": 250, "id": 234038}, {"user_id": 17523, "stars": [], "topic_id": 9608, "date_created": 1299288269.1779931, "message": "It's not a minimal bid. It's an estimated minimum bid to get on the front page, and it can be as random as Google wants it to be. I set my bid to 10 cents and maybe even that's a little high.", "group_id": 250, "id": 274494}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1299329119.657033, "message": "@dmitri... If I am the only bidder, why would it take $1 to get \"first page\" listing? Don't you find that unethical? What if you checked into a hotel and they told you there were no rooms left, but if you were willing to pay more, they could get you in, when if fact the hotel is EMPTY.", "group_id": 250, "id": 276149}, {"user_id": 1381, "stars": [], "topic_id": 9608, "date_created": 1299339234.474699, "message": "@gicleeguru I think you're WAY off base. It's like you're going to a hotel that is empty, you want a room, but they tell you a price that's higher than you like. Not selling inventory is an option for hotels and for Google. They may believe that bids below a certain price aren't worth the distraction to the user.", "group_id": 250, "id": 276445}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1299427346.18853, "message": "But google is saying in order for me to get a first page listing, I must bid $1 minimum. It is an outright lie. You will not have a sustainable business if it is based on deception.", "group_id": 250, "id": 280532}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1299428333.0070961, "message": "In the hotel analogy, I stated the hotel is claiming there are no rooms, when in fact the hotel is empty. Google is saying in order to get first page, I must bid $1, when I am the only bidder. I would like to hear from other Adwords users to see what they run into.", "group_id": 250, "id": 280626}, {"user_id": 218, "stars": [], "topic_id": 9608, "date_created": 1299431789.0706699, "message": "@gicleeguru I don't think you need to worry about if Google's business model is sustainable ;)", "group_id": 250, "id": 280988}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1299463129.186352, "message": "@justnilly, I guess that's why they can be unethical and deceptive. I stand by my comment that a deceptive business practice is not sustainable.", "group_id": 250, "id": 283401}, {"user_id": 1381, "stars": [], "topic_id": 9608, "date_created": 1299477974.841429, "message": "@gicleeguru Just because you don't like their minimum price doesn't mean they're cheating.", "group_id": 250, "id": 285840}, {"user_id": 14546, "stars": [], "topic_id": 9608, "date_created": 1299587127.9497719, "message": "rk, are you an Adwords user?", "group_id": 250, "id": 295666}, {"user_id": 1381, "stars": [], "topic_id": 9608, "date_created": 1299610302.1636691, "message": "@gicleeguru Occasionally. More frequent user of Facebook Ads, which similarly doesn't always give me the price I want and chooses to show some of their content instead if my ads.", "group_id": 250, "id": 298413}, {"user_id": 9018, "stars": [], "topic_id": 9608, "date_created": 1299871554.4955649, "message": "What i've found pretty successfull is reciprocal banner ad swaps. Basically i run 14 live sports chat websites (www.LiveChatConcepts.com/Sites) \nWhereas we normally charge $1CPM for anyone to display ads on our sites we'll sign agreements to swap 100,000 ads with almost anyone then extend the contracts after that based on performance.\nThey display our ads, we display their ads and google gets nothing :)", "group_id": 250, "id": 325824}]