[{"user_id": 11626, "stars": [], "topic_id": 6528, "date_created": 1297890787.09548, "message": "See Also: Google’s Revolution Factory – Alliance of Youth Movements: Color Revolution 2.0\r\nIn 2008, the Alliance of Youth Movements held its inaugural summit in New York City. Attending this summit was a combination of State Department staff, Council on Foreign Relations members, former National Security staff, Department of Homeland Security advisers, and a myriad of representatives from American corporations and mass media organizations including AT&T, Google, Facebook, NBC, ABC, CBS, CNN, MSNBC, and MTV.\r\n\r\nThe war has already begun, total war is a possibility.\r\n\r\nTony Cartalucci\r\nLand Destroyer\r\nFebruary 13, 2011\r\n\r\nWhile the corporate owned media has the plebeians arguing over whether or not Iran should have nuclear weapons or if it intends to commit genocide against the Jews (the largest population of Jews in the Middle East outside of Israel actually resides in Iran), the debate is already over, and the war has already quietly begun. Before it began, however, someone meticulously meted out the details of how it would unfold. That “someone” is the mega-corporate backed Brookings Institute.\r\n\r\nBackground\r\n\r\n“Which Path to Persia?” was written in 2009 by the Brookings Institute as a blueprint for confronting Iran. Within the opening pages of the report, acknowledgments are given to the Smith Richardson Foundation, upon which Zbigniew Brzezinski sits as an acting governor.\r\n\r\nThe Smith Richardson Foundation funds a bizarre myriad of globalist pet projects including studies on geoengineering, nation building, meddling in the Caucasus region, and even studies, as of 2009, to develop methods to support “indigenous democratic political movements and transitions” in Poland, Egypt, Cuba, Nepal, Haiti, Vietnam, Cambodia, Zimbabwe, and Burma. Also acknowledged by the report is the Crown Family Foundation out of Chicago.\r\n\r\nThe Brookings Institute itself is a creation of the notorious globalist funding arms including the Carnegie Corporation, the Rockefeller Foundation and the Ford Foundation, all who recently had been involved in the fake “Ground Zero Mosque” controversy. Today, Brookings boasts a full complement of support and funding from America’s biggest corporations. Upon the Brookings Institute’s board of trustees one will find a collection of corporate leaders from Goldman Sachs, the Carlyle Group, the insurance industry, Pepsi (CFR), Alcoa (CFR), and various CFR affiliated consulting firms like McKinsey & Company.\r\n\r\nFull details can be found within the pages of their 2010 annual report here.\r\n\r\nhttp://www.brookings.edu/%7E/media/Files/about/annualreport/2010/2010_complete.pdf\r\n\r\nTo say Brookings is of big-business, by big-business and for big-business is a serious understatement. This is crucial to keep in mind as we examine their designs toward Iran and consider the terrible cost every single option they are considering has towards everyone but, unsurprisingly, their own bottom-lines.\r\n\r\nMotivations Should be Obvious\r\n\r\nWe must look into the minds of those that shape US foreign policy and sweep aside the distracting rhetoric they feed us. US foreign policy is shaped by organizations like the Brookings Institute which consist of members of the largest corporations and banks on earth. These corporations are not only disinterested in security, but thrive on the war and conflict insecurity breeds. (See “War is a Racket” and Eisenhower’s Warning.)\r\n\r\nIran not only possesses massive oil reserves and an economic, political, and militarily strategic location in relation to Russia and China, it also boasts a population of 76 million. This is a large population that if left sovereign and independent can viably compete against the West’s degenerate casino economy, or if invaded and corrupted, can become 76 million more consumerist human cattle.\r\n\r\nThe sheer scale of the military options considered by Brookings’ strategy would be a boom alone for the defense contractors that sponsor it, whether the operation was a success or not. The incentive to domineer over Iran is quite obvious and only made more attractive from a corporate American point of view when considering all the risks of such domineering are completely “socialized,” from the dead troops, to the broke tax payers. No matter how insane the following report may sound, keep in mind, “they have nothing to lose.”\r\n\r\nThe globalists run think-tanks all over the world like Brookings where their policy wonks generate an immense amount of strategic doctrine. This doctrine then converges to form a general consensus. Knowing the details of this doctrine beforehand can give us clues as to what to look for on the geopolitical chessboard as their gambits play out.\r\n\r\nGreen revolutions, resigning admirals, bizarre troop build-ups in Afghanistan and Iraq, terrorist attacks within Iran, and high profile assassinations all make sense if you are aware of the playbook they are working from. The hyped and very fake “war on terror” being ratcheted up on the home-front is also a telling and alarming sign, perhaps the most alarming of all.\r\n\r\nPage 1: Bottom Line\r\n\r\nWith frank honesty, the report opens by declaring Iran a confounding nation that undermines America’s interests and influence in the Middle East. Not once is it mentioned that the Islamic Republic poses any direct threat to the security of the United States itself. In fact, Iran is described as a nation intentionally avoiding provocations that would justify military operations to be conducted against it.\r\n\r\nIran’s motivations are listed as being ideological, nationalistic, and security driven – very understandable considering the nations to its east and west are currently occupied by invading armies. This is the crux of the issue, where it’s America’s interests in the region, not security, that motivate it to meddle in Iran’s sovereignty, and is a theme that repeats itself throughout the 156 page report.\r\n\r\nPage 11: The Nuclear Non-Threat\r\n\r\nThe report concedes that Iran’s leadership may be aggressive, but not reckless. The possession of nuclear weapons would be used as an absolute last resort, considering American and even Israeli nuclear deterrence capabilities. Even weapons ending up in the hands of non-state actors is considered highly unlikely by the report.\r\n\r\nSimilar reports out of RAND note that Iran has had chemical weapons in its inventory for decades, and other reports from RAND describe the strict control elite military units exercise over these weapons, making it unlikely they would end up in the hands of “terrorists.” The fact that Iran’s extensive chemical weapon stockpile has yet to be disseminated into the hands of non-state actors, along with the fact that these same elite units would in turn handle any Iranian nuclear weapons, lends further evidence to this conclusion.\r\n\r\nBrookings notes on page 24, that the real threat is not the deployment of these weapons, but rather the deterrence they present, allowing Iran to counter US influence in the region without the fear of an American invasion. In other words, the playing field would become level and America may be forced to recognize Iran’s national sovereignty in regards to its own regional interests.\r\n\r\nPage 23: Persuasion\r\n\r\nThe first option on the table is a means to coerce the Iranian government, without regime change, through crippling sanctions verses incentives. The incentives, in turn, seem more a relief from American imposed torment than anything of actual substance.\r\n\r\nOne incentive in particular is very telling. Brookings suggests “security guarantees” from an American invasion to address the very real concerns that would motivate Iran to construct nuclear weapons in the first place. Brookings notes that concrete action would would be needed by the US in order to fulfill this incentive, including drawing down US forces in the Middle East, a concession Brookings itself admits is highly unlikely over the next several decades.\r\n\r\nBrookings interjects at this point, a brazen admission that under no circumstance should the US grant Iran a position of dominance nor should there be any ambiguity about what the US sees as Iran’s role in the region. It is most likely postures like this that have driven Iran to such extremes to protect itself, its interests, and its very sovereignty.\r\n\r\nThis option of “persuasion” appears to have already played out and failed, both in drawing concessions from Iran through meaningless offers and at marshaling the international support needed to make additional sanctions effective.\r\n\r\nPage 65: Total War\r\n\r\nIndeed a conventional war with Iran is currently impossible. The globalists at the Brookings Institute acknowledge that. What is worrying is that they believe it would not be impossible if only America was presented with the “proper” provocations. Brookings’ experts go on to say that Washington could take “certain actions” to ensure such provocations took place.\r\n\r\nFurthermore, Brookings states that Iran has already gone through extreme measures specifically not to react to American provocations, raising the specter that provocations may take the shape of a staged event instead, should full-scale invasion be sought.\r\n\r\nThis is where the tireless efforts of 9/11 Truth have paid off and now stand between the American people and a costly, unprecedented war. They have at the very least made the term “false flag” mainstream, raising the stakes exponentially for anyone attempting to stage provocations.\r\n\r\nPage 103: Supporting a Color Revolution\r\n\r\nHailed as the “most obvious and palatable method” of bringing about the Iranian government’s demise, Brookings suggests fostering a popular revolution. It brazenly admits the role of the “civil society organizations” in accomplishing this and suggests massive increases in funding for subversive activities in Iran.\r\n\r\nOf course the United States has already passed the Iran Freedom Support Act, directly funding Iranian opposition groups inside of Iran with the explicit objective of overthrowing the current government. The passage of the act was followed by the 2009 “green revolution,” which Iranian security forces were able to put down.\r\n\r\nCurrently, the “green revolution” in Iran is gearing up again. The US State Department and corporate sponsored Movements.org has been following and supporting the US-backed Iranian uprisings since the beginning. Iranian-American Cameran Ashraf, described as a senior fellow at Movements.org, participated in the 2009 event. Movements.org featured on their front page recently, information on the upcoming “green” revolution set to feed off the US backed overthrow of the Mubarak regime in Egypt.\r\n\r\nIndeed this option is currently being pursued. Brookings specifically mentions threatening Iran with instability as a means to leverage concessions from the government. It goes on to explicitly call for the promotion of unrest within Iran’s borders, and when coupled with the crippling sanctions Iran is already under, constitutes an overt act of war as pointed out numerous times by Congressman Ron Paul.\r\n\r\nBrookings also suggests the use of military force in conjunction with their staged color revolutions, recognizing Iran’s well developed internal security apparatus. This was not done in 2009, but should be considered and looked out for each time the “green” revolutionaries come out into the streets.\r\n\r\nPage 113: Supporting Real Terrorism\r\n\r\nDespite the shameless bravado displayed throughout the entire report, no section is as shocking as the one titled “Inspiring an Insurgency.” Brookings is outright advocating the funding, training, and triggering of a a full-blown armed insurgency. The report specifically mentions Ahvazi Arab separatists, which would later be the subject of Seymour Hersh’s “Preparing the Battlefield” where he exposes the option as already being set in motion within Iran.\r\n\r\nKurds in the north, and Baluch rebels near Pakistan in the east are also mentioned as potential receipients of US aid in conducting their campaigns of armed terror against the Iranian people. The CIA is selected to handle supplies and training, while Brookings suggests that options for more direct military support also be considered.\r\n\r\nIn their subsection, “Finding a Proxy,” Brookings describes how the use of ethnic tensions could fuel unrest. It laments the fact that many ethnic minorities still hold nationalism as a priority along with their fellow Persians. And despite being on America’s official terrorist list for having previously killed US military men, the Mujahedin-e Khalq (MEK) are given ample consideration within Brookings’ report.\r\n\r\nIn their subsection, “Finding a Conduit and Safe Haven,” Brookings describes various methods of harboring their stable of US funded terrorists within the nations currently occupied by US troops and how to ferry them in and out of Iran between operations.\r\n\r\nPage 145: Bringing it all Together\r\n\r\nBrookings suggests that no single option is meant to stand alone. It suggests that options be pursued concurrently. Apparently Brookings’ advice has been taken to heart as we have seen in the news, from Seymour Hersh’s reports of covert US-backed terrorists, to the overtly staged “green” revolutions, to the sabotage and assassinations plaguing Iran’s nuclear program.\r\n\r\nWhile it is quite obvious that many of Brookings’ policies are being carried out verbatim, what is most alarming is what’s suggested next should these combined ploys fail.\r\n\r\nFrom the report itself, page 150:\r\n\r\n“A policy determined to overthrow the government of Iran might very well include plans for a full-scale invasion as a contingency for extreme circumstances. Certainly, if various forms of covert and overt support simply failed to produce the desired effect, a president determined to produce regime change in Iran might consider an invasion as the only other way to achieve that end.\r\n\r\nMoreover, the United States would have to expect Iran to fight back against American regime change operations, as it has in the past. Although the Iranians typically have been careful to avoid crossing American red lines, they certainly could miscalculate, and it is entirely possible that their retaliation for U.S. regime change activities would appear to Americans as having crossed just such a threshold.\r\n\r\nFor example, if Iran retaliated with a major terrorist attack that killed large numbers of people or a terrorist attack involving WMDs—especially on U.S. soil—Washington might decide that an invasion was the only way to deal with such a dangerous Iranian regime.\r\n\r\nIndeed, for this same reason, efforts to promote regime change in Iran might be intended by the U.S. government as deliberate provocations to try to goad the Iranians into an excessive response that might then justify an American invasion.”\r\n\r\nConsidering Operation Northwoods, the falsified Gulf of Tonkin event, the myriad of lies that brought us into war with Iraq and Afghanistan, not the least of which was 9/11 itself, it is truly a frightening specter to think about what might come next.\r\n\r\nWe already see the absurd security apparatus being put into place across America and the various declarations by European leaders that “multiculturalism” has failed, setting the stage for a “clash of civilizations.” There is also an uptick in rhetoric by American leaders warning of an impending terrorist attack. It is not beyond the realm of possibility that the US might attempt to provide their own “provocation” for war in the Iranians’ stead.\r\n\r\nFinal Thoughts\r\n\r\nIt is quite obvious Brookings’ suggestions and their execution are detrimental to all involved, from our brave but gravely misled troops, to the tax payers fleeced by underwriting the war, to the decimated Iranian people. Boycotting the very corporations sponsoring this policy undermines their self-serving objectives regardless of the means by which they try to accomplish them. Their very ability to fund studies like this, let alone carry them out is a direct result of our daily patronizing of their mega-corporations. Raising awareness that corporate interests, not security concerns, are the prime motivations for conflict with Iran is also essential in convincing citizens of both countries to step back from the brink.\r\n\r\nIn this world today, events seem astronomically bigger than any one of us. We feel there is no certainty we can succeed against such odds. What is essential to understand though, is that while acting does not guarantee success, not acting most certainly guarantees defeat. Follow the brave example of 9/11 Truth and other activists in the growing alternative media – fight against the manufactured consensus by adding yourself to a consensus on truth.\r\n\r\nTo read the entire Brookings Institute report, “Which Path to Persia?” click here.\r\n\r\nhttp://www.brookings.edu/%7E/media/files/rc/papers/2009/06_iran_strategy/06_iran_strategy.pdf\r\n\r\nhttp://www.infowars.com/brookings-which-path-to-persia", "group_id": 3920, "id": 124447}]