[{"user_id": 11626, "stars": [], "topic_id": 8987, "date_created": 1298615105.5338261, "message": "Aides to a prominent general are insisting that their boss didn’t run a psychological operation on members of Congress. But the e-mails they provided to Danger Room to back up their denials appear to reinforce the initial charges: that Lt. Gen. William Caldwell IV, head of training in Afghanistan, used propaganda personnel to “spin” visiting U.S. Senators.\r\n\r\nIt’s a potentially serious offense. If Caldwell did order the operation, it could violate a decades-old law called the Smith-Mundt Act, which forbids the government from targeting propaganda at American citizens. Caldwell’s boss, Gen. David Petraeus, announced on Thursday that he’ll investigate the “facts and circumstances” of a potentially improper use of information operations.\r\n\r\nThe accusations come from Lt. Col. Michael Holmes, the leader of an information operations unit in Afghanistan, who tells Rolling Stone that Caldwell’s staff retaliated against him after he balked at their efforts to use him to influence American dignitaries.\r\n\r\nOne of Caldwell’s aides says that Holmes wasn’t acting in an “Information Operations,” or “IO,” capacity when dealing with the visiting legislators. Holmes may have been trained in psychological operations. But, at the time, Holmes was functioning as a garden-variety staff officer for Caldwell. According to the aide, they prepared some briefing books and talking points in advance of the dignitaries’ visits — nothing more, nothing less.\r\n\r\n“Conducting research on important issues for individual VIP visitors to tailor talking points and connect with their interests and concerns is not IO. I guarantee all senior commanders have staff performing this kind of work. It’s merely being prepared and doing your homework,” the aide e-mails.\r\n\r\nAccording to this version of events, only after Holmes found himself in hot water in an investigation did he run to Hastings with a story of a propaganda-happy Caldwell.\r\n\r\nBut internal e-mails from Caldwell’s command, known as NATO Training Mission-Afghanistan (NTM-A), show that Holmes routinely worked on information operations for the general.\r\n\r\nFirst, a disclosure: Both Michael Hastings, the author of the Rolling Stone piece, and Caldwell are longtime friends of this blog.\r\n\r\nAccording to Hastings’ piece, Caldwell asked Holmes for information on visiting legislators that a quick googling could retrieve: voting records, pet issues and “pressure points we could use to leverage the delegation for more funds [and] more people,” Holmes recounted to Hastings — the Afghanistan training effort still needs more training and personnel. Holmes initially cooperated. But in mid-March 2010, according to an NTM-A timeline obtained by Danger Room, Holmes “expressed concern” that the tasking was an “illegal” psychological operation.\r\n\r\nThat prompted Caldwell’s chief of staff, Col. Joseph Buche, to investigate. On March 30, an NTM-A lawyer determined “evidence” that Holmes and a subordinate, Maj. Laural Levine, were in an “inappropriate relationship” in which they wore civilian clothes and drank alcohol off-base, in violation of a military restriction on boozing it up in Afghanistan. The investigation had a new target.\r\n\r\nIn the e-mails reviewed by Danger Room, Holmes defends his trips off base in civilian clothing as necessary to conduct information operations. One e-mail from May 10, 2010, refers to a documentary NTM-A wanted to make about “community policing.” Referring to the documentary as the work of an IOTF — Information Operations Task Force — Holmes says that for the film to be persuasive, “there should be no open military presence either on film, or in the area during the shooting.” That means getting the men in “sportscoats and chinos” and the women in headscarves. In his e-mail signature, Holmes refers to himself as chief of an “IO FST” — an Information Operations Field Support Team.\r\n\r\nA different e-mail explains that the Afghan government also sought to get U.S. military personnel in civilian garb, so they’d be less conspicuous. On May 4, 2010, a State Department official affirmed that a spokesman for President Hamid Karzai wanted U.S. forces at a Kabul media center to “strive to be in civilian clothing whenever possible.”\r\n\r\nJack Kem, Caldwell’s top civilian deputy, balked at having military personnel in civvies, for fear that their “concealed weapons” would be legally problematic if the service members were captured. Holmes continued to argue in his defense that he was asked to wear civilian clothes at weekly meetings with an Information Operations Task Force.\r\n\r\nUltimately, Holmes departed Afghanistan in September, after calling the inquiry into his civilian clothing a “kangaroo court.” He now runs a consulting firm specializing in “strategic communications” — another cousin of propaganda — in Texas, according to the firm’s Facebook page.\r\n\r\nThe clothing issue is less important than what it shows: that Holmes was indeed working on information operations for Caldwell. Caldwell’s staff argues that Holmes wasn’t working on information ops when he was dealing with U.S. senators or congressmen. But Caldwell’s aide conceded that he can’t document that claim.\r\n\r\nUltimately, it’ll for Petraeus to determine. But in Holmes’ case, the already-blurry lines between spin and propaganda got muddied by having an information operations officer involved in congressional glad-handing. Psychological operations are supposed to muddle the messages of foreign enemies or disrupt their communications. (Think the Air Force’s Commando Solo spy plane, which can disrupt an adversary’s broadcasts and replace them with pro-U.S. propaganda.)\r\n\r\nBut many a commander has lamented that messages from insurgents can chip away at domestic U.S. support for a war, while American hearts and minds aren’t supposed to be targeted by the U.S. military. In reality, the military has workarounds. Every single military command wants to influence Congress to protect their budgets, missions and turf. Sponsored trips to tour the war zones for legislators, think-tankers and even journalists are coordinated events to put the best spin possible on the war effort. Is that spin or propaganda?\r\n\r\nThe distinction is supposed to be enforced by staffing — that is, keeping the information operations folk out of the public-relations game. “It is a pretty big old red line,” says Bob Mackey, a retired Army officer with intelligence experience; Smith-Mundt is supposed to block the military from even using “truthful IO” on Americans. Petraeus will have to determine if Holmes’ involvement in Caldwell’s congressional outreach maintained that bulwark or eroded it.\r\n\r\nFor what it’s worth, one of the targets of the alleged psy-ops campaign, Sen. Carl Levin, is calling no harm, no foul. Levin’s long been an advocate of boosting training for the Afghan security forces so U.S. troops can withdraw. “I have never needed any convincing on this point,” he said in a statement. He expressed confidence that “the chain of command will review any allegation that information operations have been improperly used in Afghanistan.”\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/army.mil-30761-2009-02-19-190236.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/did-a-top-general-run-psyops-on-senators/?utm_source=co2hog", "group_id": 3920, "id": 206360}]