[{"user_id": 11626, "stars": [], "topic_id": 6702, "date_created": 1297909364.030364, "message": "Dressed in black and carrying assault rifles, members of a local multi-jurisdiction police unit burst into a dark home in Ogden, Utah, one night in September shouting, \"Police! Search warrant!\"\r\n\r\nA video of the incident made by the Weber-Morgan counties Narcotics Strike Force and the federal Drug Enforcement Agency shows a man suddenly appearing in a hallway holding a shiny object that an officer thought was a sword, but was really a golf club, according to Weber County Attorney Dee Smith.\r\n\r\nIn the instant he appeared, the video shows, three shots rang out and the man, Todd Blair, 45, fell to the floor, dead.\r\n\r\nThe Ogden incident was among a growing number of no-knock police raids last year, a tactic that has grown in use from 2,000 to 3,000 raids a year in the mid-1980s, to 70,000 to 80,000 annually, says Peter Kraska, a professor of criminal justice at Eastern Kentucky University who tracks the issue.\r\n\r\nThat increase has raised questions about the tactic, including whether the surprise element poses an unnecessary threat to people whose residences are invaded.\r\n\r\nJudges can issue no-knock warrants when they believe the element of surprise could help officers avoid danger or keep people from destroying evidence, Kraska says.\r\n\r\nCritics say the no-knock tactic gives residents — some innocent — seconds to decide if they face a police raid or a home invasion.\r\n\r\nAt times, particularly in drug cases, police make their case for no-knock search warrants based on faulty information from unreliable informants, says Ezekiel Edwards, an attorney for the American Civil Liberties Union.\r\n\r\n\"That's just going to increase invasions of privacy and tragic harm to both residents and officers,\" he says.\r\n\r\nIn the Odgen incident, Sgt. Troy Burnett was found to have handled the situation appropriately, Smith says. \"This was a split-second decision. He acted according to his training.\"\r\n\r\nArlean Blair, mother of the man who was shot, says her son posed no threat to officers. \"They could have used rubber bullets. They could have used spray,\" she says.\r\n\r\nBill Johnson, executive director of the National Association of Police Organizations, says the onus for the increase in no-knock cases is on the judges who authorize such warrants.\r\n\r\nThe law holds that police should knock and announce themselves, except in special circumstances and when they have approval from a magistrate, says Miller Shealy, assistant law professor at the Charleston School of Law in South Carolina.\r\n\r\nThey don't need a no-knock warrant if changing circumstances give them reason to barge in, he says.\r\n\r\nhttp://www.usatoday.com/news/nation/2011-02-14-noknock14_ST_N.htm", "group_id": 3920, "id": 128662}]