[{"user_id": 2946, "stars": [], "topic_id": 46361, "date_created": 1318136741.753679, "message": "Señores. Antes que nada les pido una disculpa porque por cuestiones de chamba me desaparecí del mapa y dejé caer este foro. Pero vamos a echarle ganas y que empiece de nueva cuenta el movimiento. Que les parece?", "group_id": 965, "id": 2309472}, {"user_id": 2946, "stars": [], "topic_id": 46361, "date_created": 1318136801.4275551, "message": "Podemos hacer como cuando regresan los escolapios de vacaciones y platicar que hemos hecho los últimos, no se, dos meses. Yo empiezo:", "group_id": 965, "id": 2309476}, {"user_id": 2946, "stars": [], "topic_id": 46361, "date_created": 1318136989.0964789, "message": "Los últimos meses los pasé programando / diseñando la plataforma de publicidad para Onswipe. Good stuff. Algo de PHP obviamente, pero tambien me ha tocado jugar con Node.js y la plataforma de AWS de Amazon. Mucho HTML5, mucho CSS3. Viviendo en el fúturo básicamente. Y ustedes?", "group_id": 965, "id": 2309487}, {"user_id": 19720, "stars": [], "topic_id": 46361, "date_created": 1318262640.767956, "message": "desde hace como 2 meses este foro ha estado muy muy muerto", "group_id": 965, "id": 2318857}, {"user_id": 19720, "stars": [], "topic_id": 46361, "date_created": 1318262614.8792169, "message": "@soska creo que para reactivar esto tendríamos que: 1) proponer algunos tópicos interesantes, 2) empezar a twitear, y hacer \"publicidad\" en otros medios de los tópicos para que la gente vuelva a venir.", "group_id": 965, "id": 2318855}, {"user_id": 30391, "stars": [], "topic_id": 46361, "date_created": 1318314828.4130459, "message": "Agree. Yo no programo, estoy del otro lado del start-up.", "group_id": 965, "id": 2323247}, {"user_id": 30391, "stars": [], "topic_id": 46361, "date_created": 1318315036.9203911, "message": "Y para los que estén en Guadalajara: Tal vez les interese: www.congresored.com.mx", "group_id": 965, "id": 2323258}, {"user_id": 2946, "stars": [{"date_created": 1318571467.6028831, "user_id": 3665}], "topic_id": 46361, "date_created": 1318453248.6660089, "message": "@cesarsalazar betadf se ve increible. Hasta hace que se me antoje ir al DF.", "group_id": 965, "id": 2334501}, {"user_id": 3665, "stars": [], "topic_id": 46361, "date_created": 1318403553.4408929, "message": "Yo le sigo: Tuve la oportunidad de emprender de forma segura(sin arriesgar a la familia) y renuncié a masFusion. Empezamos con Piki.mx, pero nos movimos a otro startup: http://unbounce.com/menthora. MItad del equipo esta en \"Build or Die\" de TechBa en Silicon Valley y la otra en GDL.", "group_id": 965, "id": 2330927}, {"user_id": 3665, "stars": [{"date_created": 1318530233.9343221, "user_id": 29866}], "topic_id": 46361, "date_created": 1318407118.400532, "message": "URL buena: http://unbouncepages.com/menthora/", "group_id": 965, "id": 2331131}, {"user_id": 24160, "stars": [], "topic_id": 46361, "date_created": 1318435753.909996, "message": "Uhuu, estamos de vuelta!!! Pues yo en \"mis vacaciones de Convore\" seguí con Mexican.VC, estamos invirtiendo en 7 startups súper early stage y todo va caminando. Me emociona mucho el progreso que hemos visto con varias de ellas. Seguimos empujando Startup Weekend y junto con Britt Selvitelle estoy tratando de hacer de Hackspedition (http://hackspedition.org) un movimiento global. Ya veremos que sale. Ahhh... y casi lo olvido, estamos en el proceso de abrir BetaDF (http://betadf.com). Me da gusto saber de ustedes!", "group_id": 965, "id": 2332981}, {"user_id": 2946, "stars": [], "topic_id": 46361, "date_created": 1318453213.3661671, "message": "@Krator oye que buena idea! Es algo como Angel List?", "group_id": 965, "id": 2334495}, {"user_id": 3665, "stars": [], "topic_id": 46361, "date_created": 1318460955.5653369, "message": "@soska Si, pero queremos darle hacerlo como el \"startup management system\" parecido a yammer, con otras funciones y enfoque. Además que sea un lugar donde puedas encontrar mentores y/o advisors...bueno, las ideas son muchas, veremos a donde nos llevan los usuarios.", "group_id": 965, "id": 2335284}, {"user_id": 25716, "stars": [], "topic_id": 46361, "date_created": 1318469101.502279, "message": "Trabajo en algunas startups, y vivo la vida. Pero no tengo mucho cosas a mostrar :(", "group_id": 965, "id": 2336152}, {"user_id": 42145, "stars": [], "topic_id": 46361, "date_created": 1318488118.227165, "message": "Nuevo por aqui..en Julio me converti en corporate dropout, deje mi trabajo de gerente de Arquitectura en una empresa de consultoria grande y vivo de uno de mis emprendimientos http://mangohosting.com Ando arrancando una nueva startup con otro developer en MTY. Me inscribi al SW DF y espero que se haga el Hackspedition a Tabasco con Cesar y poder (en ambos) conocer e intercambiar más ideas con ustedes que están más inmersos .. afectuoso saludo", "group_id": 965, "id": 2337598}, {"user_id": 26088, "stars": [], "topic_id": 46361, "date_created": 1318518811.110898, "message": "Pues yo ando asociandome con gente para hacer un buen team y lanzar algo que es como un merge entre mi startup y su startup pero como punto de entrada su startup XD esperamos que se lance un MVP para cuando sea ciudad movil (coming soon)", "group_id": 965, "id": 2339853}, {"user_id": 24160, "stars": [], "topic_id": 46361, "date_created": 1318520014.2635729, "message": "@Krator Yo quiero ser usuario de Menthora!!!", "group_id": 965, "id": 2339929}, {"user_id": 3665, "stars": [], "topic_id": 46361, "date_created": 1318523439.7101941, "message": "@cesarsalazar Tenlo por seguro :D", "group_id": 965, "id": 2340277}, {"user_id": 29866, "stars": [], "topic_id": 46361, "date_created": 1318530398.2125759, "message": "Que bueno que vuelve a la vida el foro, seguimos con nuestra empresa y con una nueva Startup que estamos por lanzar en un par de meses, me moví a Italia por un par de meses y he andado más leyendo (Venture Deals) que trabajando, digamos en un momento de concentración... un saludo a todos por aquí!", "group_id": 965, "id": 2341011}, {"user_id": 39765, "stars": [], "topic_id": 46361, "date_created": 1318535433.826299, "message": "Yo de añadida en este mundo de los startups, organizando SWPuebla!!!", "group_id": 965, "id": 2341464}]