[{"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338822.014477, "message": "even that wasn't 100%, since following the Puppet directions doesn't set Apache's webroot to /vagrant, i guess cause it doesn't have a tutorial include for Puppet like it does for Chef", "group_id": 292, "id": 176420}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338265.9373291, "message": "i'm sure this is my fault for leaping into the deep end of several tools (vagrant and puppet) at once", "group_id": 292, "id": 176389}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338346.6176169, "message": "i'm looking at @rcrowley's puppet-pip as the provider: https://github.com/rcrowley/puppet-pip as discussed in his puppet deck: http://rcrowley.org/talks/sfpython-2010-11-10/#3", "group_id": 292, "id": 176393}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338253.013268, "message": "i see there's a “provider” for puppet to install python dependencies with pip, but how do i make vagrant make it available in the vm?", "group_id": 292, "id": 176387}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338460.7860739, "message": "seems like if i were on the vm manually i would just install the puppet-pip gem, but that's the kind of thing puppet is being used for, so i don't see how to articulate it from the few beginner's guides i've been able to get through", "group_id": 292, "id": 176397}, {"user_id": 13467, "stars": [{"date_created": 1298340055.1433229, "user_id": 141}], "topic_id": 7943, "date_created": 1298340014.149374, "message": "FWIW: I've been able to get a few Vagrant boxes working, but with Chef. I get the sense that Puppet is the lesser of the supported options :/", "group_id": 292, "id": 176501}, {"user_id": 1, "stars": [], "topic_id": 7943, "date_created": 1298338506.3283401, "message": "I wish I could help out here, but I've not been able to get Vagrant to work properly for me either.  Ran into a bunch of random problems--just chalked it up to my noobness.", "group_id": 292, "id": 176402}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338507.9420869, "message": "hmm, should i be able to have puppet install the puppet-pip gem, as long as it's before any packages require it? would that make it available to itself in the later steps?", "group_id": 292, "id": 176403}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298338590.881181, "message": "@ericflo yeah, i managed to get through the Getting Started with Vagrant guide http://vagrantup.com/docs/getting-started/index.html but that's all i've done with it yet", "group_id": 292, "id": 176409}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298339078.470381, "message": "seems like it “compiles” the whole puppet manifest up front, so i can't have the same manifest install the puppet-pip gem then use it later", "group_id": 292, "id": 176438}, {"user_id": 214, "stars": [], "topic_id": 7943, "date_created": 1298361595.577554, "message": "@markpasc I've used Chef, not Puppet, but doesn't Puppet have a way to install gems? Can't you just use that to install the puppet-pip gem and then go from there?", "group_id": 292, "id": 177701}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298361689.3105631, "message": "@carljm normally, but since i'm trying to install a puppet plugin (?) it would have to reload partway through to let me invoke it later in the manifest", "group_id": 292, "id": 177705}, {"user_id": 141, "stars": [], "topic_id": 7943, "date_created": 1298361790.899544, "message": "specifically i still get an error about the “provider => pip” packages even when i ask it to install the puppet-pip gem first (so i don't think it's even getting so far as running any of the manifest—it wants to have it already installed before running, which is reasonable)", "group_id": 292, "id": 177708}, {"user_id": 592, "stars": [], "topic_id": 7943, "date_created": 1298364076.89922, "message": "Again, like the others I've used Chef rather than Puppet. I've found the guys in #vagrant on irc.freenode.net to be very helpful so it may be worth asking any specific questions in there.", "group_id": 292, "id": 177851}, {"user_id": 592, "stars": [], "topic_id": 7943, "date_created": 1298364088.6765261, "message": "They are not always around though, but i suspect that's just a different timezone thing", "group_id": 292, "id": 177854}]