[{"user_id": 21431, "stars": [], "topic_id": 13944, "date_created": 1300533729.0098979, "message": "Mums ir jānolemj daži svarīgi jautājumi:\n1. Cik reizes nedēļā vēlaties turnīrus? (Manuprāt 2 reizes ir optimāls variants)\n2. Kurās dienās? (Varam palikt pie esošā varianta)\n3. Vai mums ir nepieciešams viens aktīvs galds, kluba ietvaros, lai jebkurā laikā varam uzspēlēt pokeru?\n4. Turnīru dalības maksa? (Citādi balvas nav īsti adekvātas)\n5. Ir idejas kā piesaistīt vairāk spēlētājus? (Tos, kas izmanto otrdienu turnīru)", "group_id": 6809, "id": 387916}, {"user_id": 21824, "stars": [], "topic_id": 13944, "date_created": 1300595346.3496151, "message": "1. Šādi, ka pokerstārs turnīri ir 2x nedēļā ir pietiekoši.", "group_id": 6809, "id": 390510}, {"user_id": 21824, "stars": [], "topic_id": 13944, "date_created": 1300595393.539686, "message": "2. 4dienas un 7dienās varētu būt labāk, pec inperil TH pokera turnīra būtu diena starpā. :)", "group_id": 6809, "id": 390513}, {"user_id": 21824, "stars": [], "topic_id": 13944, "date_created": 1300595435.5107059, "message": "3.Varam iztikt bez aktīva galda, nedomāju ka atsaucība būtu pārāl liela.", "group_id": 6809, "id": 390516}, {"user_id": 21824, "stars": [], "topic_id": 13944, "date_created": 1300595532.573349, "message": "4. Turnīra dalibas maksu protams var paaugstināt, tā takš play money, bet varētu padomat par 100 inperil punktiem papildus, taču tas , pieņemu, sarežģītu organizāciju.", "group_id": 6809, "id": 390523}, {"user_id": 21824, "stars": [], "topic_id": 13944, "date_created": 1300595598.653275, "message": "5. Piesaistīt vairak spēlētājus varētu vnk informējot, kas jau tiek darīts, ievietojot virsrakstus inperil sākumlapā, varētu vnk painformēt pirms TH pokera 2dienās :)", "group_id": 6809, "id": 390529}, {"user_id": 22000, "stars": [], "topic_id": 13944, "date_created": 1300634089.7409351, "message": "5. Varbūt turnīra uzvarētājam pie inperil profila vārda varētu pievienot attiecīgu ikoniņu (līdzīgi kā zvaigznīte ziedotājiem), uz kuras uzspiežot nonāk foruma paziņojumā par pokera turīriem.", "group_id": 6809, "id": 392204}, {"user_id": 23657, "stars": [], "topic_id": 13944, "date_created": 1300884259.9216681, "message": "Domaaju ka pietiek ar divaam reizeem nedeeljaa ! Reklaama saakumlapaa ir laba, bet domaaju ja buutu iespeejams izsuutiit visiem trakera lietotaajiem PM ar info par shaadu iespeeju uzspeleet....tad sanaaktu daudz vairaak interesentu ... jo biezhi vien pats saakumlapaa sevishki neiedzilinos ... kaa rezultataa vareetu arii nepamaniit shaadus turniirus! Bet ar PM buutu personigi uzrunaats katrs... kam neinteresees tas arii neliksies ne zinis... bet kaadu jaunu speleetaaju pakers ;) !", "group_id": 6809, "id": 416725}]