[{"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305266019.5019481, "message": "Who's getting this? It's releasing next week. I've cleared my gaming calender for this, I can't wait.", "group_id": 9493, "id": 1036294}, {"user_id": 25703, "stars": [], "topic_id": 35080, "date_created": 1305266470.4470389, "message": "I've been meaning to play The Witcher for *so long*. It's repeatedly cited as one of the best PC RPGs ever, so I'm definitely going to play that first.\n\nOne day.", "group_id": 9493, "id": 1036392}, {"user_id": 32282, "stars": [], "topic_id": 35080, "date_created": 1305266651.551167, "message": "I'd be getting this, if my PC was up to spec. The Witcher was excellent.", "group_id": 9493, "id": 1036442}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305267203.751924, "message": "The Witcher is my second favourite RPG of all time, right behind Planescape: Torment. I only played it after they released the Enhanced Edition, which was probably a wise thing. I think they've learned a lot from that first game, so hopefully the second one won't repeat all those mistakes.", "group_id": 9493, "id": 1036497}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305277539.8028841, "message": "I got The Witcher from GOG ($5!) and hope to find some time for it this weekend. I can't wait to witch everyone. Witch them to death.", "group_id": 9493, "id": 1038728}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305278025.472203, "message": "I'm tempted to buy the GOG version, if only the have a digital copy ready if I ever need it...", "group_id": 9493, "id": 1038848}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305382776.4571741, "message": "And I went and bought the GOG version of The Witcher today.", "group_id": 9493, "id": 1052645}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305645724.8094289, "message": "Busy installing Witcher 2 now. Reading the activation instructions for the pre-order code I got, looks like you can deactivate the code, so you can activate it again later. That's kind of novel in this Project $10 age...", "group_id": 9493, "id": 1084240}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305721669.4601231, "message": "THE GRAPHICS.", "group_id": 9493, "id": 1096399}, {"user_id": 31852, "stars": [], "topic_id": 35080, "date_created": 1305723357.8417311, "message": "So do you guys think there's any chance of The Witcher (the first one) running on a current, entry-level laptop? i3 Core CPU, 4 GB RAM, probably just onboard/Intel gfx.", "group_id": 9493, "id": 1096619}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305723777.612103, "message": "The system requirements are at the bottom here: http://www.gog.com/en/gamecard/the_witcher Seems like you check out!", "group_id": 9493, "id": 1096666}, {"user_id": 31852, "stars": [], "topic_id": 35080, "date_created": 1305723996.773927, "message": "Thanks!", "group_id": 9493, "id": 1096699}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305744957.9114101, "message": "The graphics card might be your biggest issue, but you should be able to play it if you drop the settings to low.", "group_id": 9493, "id": 1101454}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305783107.902746, "message": "I tried Witcher 2 with a 360 controller. It's actually very playable, the onscreen commands are all changed to reflect the use of the controller. It could definitely work on a console.\n\nI also came to the realisation that I need to upgrade my graphics card. The GTS250 I currently have is not doing so well, even on Medium settings. But boy does this game look pretty!", "group_id": 9493, "id": 1108474}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305798458.1729929, "message": "I'm playing with a controller as well. It's nice that the button prompts change to reflect that.", "group_id": 9493, "id": 1110017}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305798949.940639, "message": "Also, is it just me, or are the fights in the prologue kinda hard? Seems very easy to run out of vigor and get stabbed in the back.", "group_id": 9493, "id": 1110037}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305799118.966486, "message": "It's not just you, I had some trouble with that myself. They never really explain combat, and you're left to figure it out as you go. It helped a bit when you unlock the ability to block attacks from all sides at least.", "group_id": 9493, "id": 1110051}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305804250.0428841, "message": "Okay, I think I'm getting the hang of this. Item hoarding is a seriously bad idea in this game. Meditating before a fight and using potions and oils to buff your abilities seems to be essential -- and then luring enemies into traps so you can pick them off one at a time.", "group_id": 9493, "id": 1110395}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1305804345.390111, "message": "(Also, it looks like you can't see how many bombs/traps you have stocked once you've equipped them. What a silly oversight.)", "group_id": 9493, "id": 1110407}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1305806963.330539, "message": "I can't wait to get into it more tonight, I only managed to finish the prologue last night.", "group_id": 9493, "id": 1110634}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306026581.083828, "message": "The huge forest in Chapter 1 is probably one of the best-looking environments I've ever seen in a game. I just wish it wasn't so damn dangerous.", "group_id": 9493, "id": 1139133}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306040089.7523429, "message": "I decided to drop the difficulty down to easy, and I'm still getting my ass handed to me by Drowners and Nekkers. It seems though that the game makes some fights easier then others.", "group_id": 9493, "id": 1139966}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306144108.655771, "message": "There's definitely a difficulty hump at the start of the game. Once you craft some decent armor and weapons, and enable more talents, things get easier. Gaining some really useful abilities in the mage path. Oh, and upgrading Parry to level 2 in the training path seems essential.", "group_id": 9493, "id": 1150787}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306144436.9843669, "message": "I hardly got any playing done this weekend sadly. Haven't even managed to unlock any of the specialty paths yet.\n\nOn a graphical note, does the dithered shadows bother anybody else as well? I didn't notice it much in the prologue, but in Flotsam it's very evident. I first thought it was a problem with my graphics card, but after a bit of googling, it seems there's quite a few people finding it annoying, so it must be a engine thing. Hope they'll be looking at addressing this in a patch.", "group_id": 9493, "id": 1150827}, {"user_id": 31927, "stars": [], "topic_id": 35080, "date_created": 1306145393.9005921, "message": "Huh.  I remember the Xbox version of Far Cry 2 doing shadows like that, while the PS3 and PC versions didn't.  At the time it was chalked up to the lack of some ability on the part of Xenos.", "group_id": 9493, "id": 1150904}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306147008.7563789, "message": "I guess they went the route in order to save some CPU cycles for some other eye-candy, but I would prefer it to be a toggle-able option. Apparently GTA4 on the PC suffered similar in the beginning, and they patched it subsequently.", "group_id": 9493, "id": 1151020}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306151066.8816929, "message": "I've noticed it a few times (mostly on people's faces), but since I'm playing on my TV I'm not really close enough to see it. Does the shadow quality setting have any effect?", "group_id": 9493, "id": 1151241}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306151657.405658, "message": "The shadow quality setting doesn't seem to change anything at all, sadly. I imagine sitting away from the screen would make it less obvious, I'm sitting quite close to a 23\" monitor though, so it's very in-your-face.", "group_id": 9493, "id": 1151293}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306335122.0785551, "message": "Beyond the regular monster hunting contracts, the sidequests so far have been excellent! I hope BioWare's taking notes.", "group_id": 9493, "id": 1179215}, {"user_id": 31852, "stars": [], "topic_id": 35080, "date_created": 1306392901.2013359, "message": "So the ESRB posted a rating for an Xbox 360 version of the game on their site, which was promptly taken off once the media picked up on it. CDP says they haven't announced anything, but will announce the new project they're showing at E3 shortly before the start of E3.", "group_id": 9493, "id": 1189152}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306402249.0364261, "message": "I don't think it would be any surprise if it gets announced for the consoles. However, Penny Arcade did touch on the difficulty of the game, especially the prologue. It's definitely something they'll have to work on for the console crowd.", "group_id": 9493, "id": 1190412}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306413119.5356841, "message": "It's not really the difficulty so much as the awful tutorial.", "group_id": 9493, "id": 1191350}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306419737.46773, "message": "Which kind of makes the prologue difficult. But yeah, they'll have work on that for sure, onscreen prompts that come up while you're busy trying to not die might not have been the best idea.", "group_id": 9493, "id": 1192312}, {"user_id": 31852, "stars": [], "topic_id": 35080, "date_created": 1306735661.930126, "message": "Heh, apparently the new Witcher 2 patch is 9GB!", "group_id": 9493, "id": 1224627}, {"user_id": 31753, "stars": [], "topic_id": 35080, "date_created": 1306743048.777663, "message": "I believe that's only on Steam though. The patch I downloaded was 15mb about. I think the biggest issue was that the main resource file for Witcher 2 is 9gb, and the way that Steam's updating works meant that the whole file had to be downloaded, even if it only changed a little bit.", "group_id": 9493, "id": 1225206}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1306855597.2640629, "message": "PROOF that it's a good game: http://aol.it/jV4qw3", "group_id": 9493, "id": 1238259}, {"user_id": 31852, "stars": [], "topic_id": 35080, "date_created": 1307045461.8530309, "message": "Awesomeness confirmed.\n\nhttp://www.joystiq.com/2011/06/02/the-witcher-2-casting-spells-on-xbox-360/\n\n\"During its \"Summer Days\" presentation in Los Angeles this afternoon, developer CD Projekt Red announced intentions to release critically acclaimed The Witcher 2 on Xbox 360 by the end of 2011.\"", "group_id": 9493, "id": 1270635}, {"user_id": 32692, "stars": [], "topic_id": 35080, "date_created": 1307115646.849143, "message": "I'll be giving this a close look at E3. I just don't believe that they're getting that game to look as good on a 360. (Is the PC elitism already setting in?)", "group_id": 9493, "id": 1278377}, {"user_id": 25703, "stars": [], "topic_id": 35080, "date_created": 1307120699.625598, "message": "It's the anti-aliasing that does it.", "group_id": 9493, "id": 1278895}]