[{"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840336.9393859, "message": "from: https://plus.google.com/107132071272017969553/posts/fiHbedqvaGa", "group_id": 8855, "id": 2286303}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840399.0860009, "message": "And now from:", "group_id": 8855, "id": 2286309}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840430.6683221, "message": "S DaggeX  -  12:42 PM  -  Public\nHey Zooko:\n\nI was browsing through some journal articles I'd been meaning to read when I stumbled across the following article:\n\n1. Hernandez TL, Sutherland JP, Wolfe P, et al. Lack of suppression of circulating free fatty acids and hypercholesterolemia during weight loss on a high-fat, low-carbohydrate diet. The American Journal of Clinical Nutrition. 2010;91(3):578 -585.\n\nThis study compares two groups: a high-carb/low-fat and a high-fat/low-carb.\n\nFrom the study: \"In conclusion, our data indicate that a high-fat diet, instead of a calorie- and fat-restricted diet, increased LDL-cholesterol concentrations over 6 wk, and that this effect related at least in part to the lack of suppression of both fasting FFA and FFA measured hourly for 24 h. Despite this adverse effect, weight loss was not greater in the High Fat group. Thus, these data suggest that a high-fat diet may have adverse metabolic effects during active weight loss.\"\n\nHave you seen this already?", "group_id": 8855, "id": 2286318}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840360.2530711, "message": "Now I will paste the whole quote from S DaggeX, which also includes S DaggeX quoting other people. So it might get confusing. We'll see how this comes out.", "group_id": 8855, "id": 2286304}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840378.6505809, "message": "S DaggeX  -  12:39 PM  -  Public\nHello Zooko,\n\nThese studies appear to suggest that diets with high levels of saturated fats (such as those found in fat-heavy steaks as you recommend) are associated with increased cardiovascular events. Can you point me towards studies which suggest otherwise or that propose or show confounding variables which contradict or invert this association? Specifically, these studies and other related ones I've been reading in my evenings suggest that high-fat caloric-unrestricted diets are effective for losing weight, but that a significant portion of calories from saturated fats in specific should be replaced with poly-unsaturated fats for a healthier heart.\n\n1. Samaha F. Effect of very high-fat diets on body weight, lipoproteins, and glycemic status in the obese. Current Atherosclerosis Reports. 2005;7(6):412-420.\n\n\"Conclusion: In summary, the available prospective studies suggest that weight loss may be as successful with caloric restriction on a diet that allows a high proportion of fat as one with a low proportion of fat, at least over a 1-year period. Nevertheless, dietary fat composition yields significantly different effects on lipoprotein levels and on cardiovascular events. Diets high in saturated fat fail to decrease total cholesterol, even with significant weight loss. Both saturated and unsaturated fat increase HDL cholesterol levels. However, in clinical tudies, increased saturated fat consumption is still associated with an increased incidence of cardiovascular events. In contrast, substituting unsaturated fats for saturated fats yields the combined benefit of lowering total serum cholesterol levels and raising serum HDL cholesterol. This effect, together with favorable effects on markers of insulin resistance and inflammation, and potential antiarrhythmic effects of marine-based n-3 fatty acids, may partly explain why unsaturated fat consumption is associated with reduced cardiovascular events. Current guidelines from the NCEP now recommend increased proportions of unsaturated fat (25% to 35% total fat with less than 7% from saturated fat) [2]. However, a remaining question for future investigation is whether there is any beneficial effect of diets containing even higher proportions of unsaturated fat (eg, > 35% total fat with < 7% saturated fat).\"\n\n2. Jakobsen MU, O’Reilly EJ, Heitmann BL, et al. Major types of dietary fat and risk of coronary heart disease: a pooled analysis of 11 cohort studies. The American Journal of Clinical Nutrition. 2009;89(5):1425-1432.\n\n\"Results: During 4–10 y of follow-up, 5249 coronary events and 2155 coronary deaths occurred among 344,696 persons. For a 5% lower energy intake from SFAs and a concomitant higher energy intake from PUFAs, there was a signiﬁcant inverse association between PUFAs and risk of coronary events (hazard ratio: 0.87; 95% CI: 0.77, 0.97); the hazard ratio for coronary deaths was 0.74 (95% CI: 0.61, 0.89). For a 5% lower energy intake from SFAs and a concomitant higher energy intake from carbohydrates, there was a modest signiﬁcant direct association between carbohydrates and coronary events (hazard ratio: 1.07; 95% CI: 1.01, 1.14); the hazard ratio for coronary deaths was 0.96 (95% CI: 0.82, 1.13). MUFA intake was not associated with CHD. No effect modiﬁcation by sex or age was found. Conclusion: The associations suggest that replacing SFAs with PUFAs rather than MUFAs or carbohydrates prevents CHD over a wide range of intakes.\nAm J Clin Nutr 2009;89:1425–32.\"\n\n3. Astrup A, Dyerberg Jã¸, Elwood P, et al. The role of reducing intakes of saturated fat in the prevention of cardiovascular disease: where does the evidence stand in 2010? The American Journal of Clinical Nutrition. 2011;93(4):684-688.\n\n\"ABSTRACT\nCurrent dietary recommendations advise reducing the intake of saturated fatty acids (SFAs) to reduce coronary heart disease (CHD) risk, but recent ﬁndings question the role of SFAs. This expert panel reviewed the evidence and reached the following conclusions: the evidence from epidemiologic, clinical, and mechanistic studies is consistent in ﬁnding that the risk of CHD is reduced when SFAs are replaced with polyunsaturated fatty acids (PUFAs). In populations who consume a Western diet, the replacement of 1% of energy from SFAs with PUFAs lowers LDL cholesterol and is likely to produce a reduction in CHD incidence of \u00152–3%. No clear beneﬁt of substituting carbohydrates for SFAs has been shown, although there might be a beneﬁt if the carbohydrate is unreﬁned and has a low glycemic index. Insufﬁcient evidence exists to judge the effect on CHD risk of replacing SFAs with MUFAs. No clear association between SFA intake relative to reﬁned carbohydrates and the risk of insulin resistance and diabetes has been shown. The effect of diet on a single biomarker is insufﬁcient evidence to assess CHD risk. The combination of multiple biomarkers and the use of clinical endpoints could help substantiate the effects on CHD. Furthermore, the effect of particular foods on CHD cannot be predicted solely by their content of total SFAs because individual SFAs may have different cardiovascular effects and major SFA food sources contain other constituents that could inﬂuence CHD risk. Research is needed to clarify the role of SFAs compared with speciﬁc forms of carbohydrates in CHD risk and to compare speciﬁc foods with appropriate alternatives. Am J Clin Nutr 2011;93:684–8.\"\n\nAlso, I think you would like the following paper:\n\n4. Hite AH, Berkowitz VG, Berkowitz K. Low-Carbohydrate Diet Review. Nutrition in Clinical Practice. 2011;26(3):300-308.\n\n\"The shift in metabolism that occurs on a LC diet heralds a shift in our current dietary paradigm. Changing the macronutrient content of the diet changes the metabolic profile. Although increasing fiber and decreasing saturated fat intake may be of concern to those whose diets are high in carbohydrates, they may be of less concern to those whose diets are not. Increasing vegetable consumption and decreasing consumption of foods low in nutritional value is a dietary goal cited numerous times in the 2010 Dietary Guidelines recommendations.87 Reducing dietary carbohydrate can accomplish this goal while improving glucose control, insulin response, atherogenic dyslipidemia, and other cardiovascular risk factors, in\naddition to reducing caloric intake without hunger. This makes carbohydrate reduction a sensible dietary approach to achieving and maintaining health.\"", "group_id": 8855, "id": 2286307}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317840411.0085089, "message": "https://plus.google.com/107132071272017969553/posts/f1Bh2Gph7Y1", "group_id": 8855, "id": 2286314}, {"user_id": 25864, "stars": [{"date_created": 1320988263.3874731, "user_id": 12142}], "topic_id": 46191, "date_created": 1317848286.5010049, "message": "Hint: click the \"wrap text\" link up at the upper right of each of those quoted blocks with the long lines.", "group_id": 8855, "id": 2287042}, {"user_id": 18601, "stars": [], "topic_id": 46191, "date_created": 1317848592.799989, "message": "Isn't SFA a pretty broad spectrum? MCFAs are included for example. It seems like an odd conclusion to say: replace SFAs with PUFAs without analyzing further what types of SFAs were consumed in the trials.", "group_id": 8855, "id": 2287074}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317860423.8737171, "message": "S DaggeX  -  12:42 PM  -  Public\n\nHey Zooko:\n\nI was browsing through some journal articles I'd been meaning to read\nwhen I stumbled across the following article:\n\n1. Hernandez TL, Sutherland JP, Wolfe P, et al. Lack of suppression of\ncirculating free fatty acids and hypercholesterolemia during weight loss\non a high-fat, low-carbohydrate diet. The American Journal of Clinical\nNutrition. 2010;91(3):578 -585.\n\nThis study compares two groups: a high-carb/low-fat and a\nhigh-fat/low-carb.\n\nFrom the study: \"In conclusion, our data indicate that a high-fat diet,\ninstead of a calorie- and fat-restricted diet, increased LDL-cholesterol\nconcentrations over 6 wk, and that this effect related at least in part\nto the lack of suppression of both fasting FFA and FFA measured hourly\nfor 24 h. Despite this adverse effect, weight loss was not greater in\nthe High Fat group. Thus, these data suggest that a high-fat diet may\nhave adverse metabolic effects during active weight loss.\"\n\nHave you seen this already?\n", "group_id": 8855, "id": 2288273}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317860351.6135809, "message": "Here is an attempt at running these through fmt (1) first, as requested by Zack Weinberg.", "group_id": 8855, "id": 2288254}, {"user_id": 25864, "stars": [], "topic_id": 46191, "date_created": 1317860384.692703, "message": "S DaggeX  -  12:39 PM  -  Public \n\nHello Zooko,\n\nThese studies appear to suggest that diets with high levels of saturated\nfats (such as those found in fat-heavy steaks as you recommend) are\nassociated with increased cardiovascular events. Can you point me towards\nstudies which suggest otherwise or that propose or show confounding\nvariables which contradict or invert this association? Specifically, these\nstudies and other related ones I've been reading in my evenings suggest\nthat high-fat caloric-unrestricted diets are effective for losing weight,\nbut that a significant portion of calories from saturated fats in specific\nshould be replaced with poly-unsaturated fats for a healthier heart.\n\n1. Samaha F. Effect of very high-fat diets on body weight,\nlipoproteins, and glycemic status in the obese. Current Atherosclerosis\nReports. 2005;7(6):412-420.\n\n\"Conclusion: In summary, the available prospective studies suggest that\nweight loss may be as successful with caloric restriction on a diet\nthat allows a high proportion of fat as one with a low proportion\nof fat, at least over a 1-year period. Nevertheless, dietary fat\ncomposition yields significantly different effects on lipoprotein\nlevels and on cardiovascular events. Diets high in saturated fat fail\nto decrease total cholesterol, even with significant weight loss. Both\nsaturated and unsaturated fat increase HDL cholesterol levels. However,\nin clinical tudies, increased saturated fat consumption is still\nassociated with an increased incidence of cardiovascular events. In\ncontrast, substituting unsaturated fats for saturated fats yields the\ncombined benefit of lowering total serum cholesterol levels and raising\nserum HDL cholesterol. This effect, together with favorable effects\non markers of insulin resistance and inflammation, and potential\nantiarrhythmic effects of marine-based n-3 fatty acids, may partly\nexplain why unsaturated fat consumption is associated with reduced\ncardiovascular events. Current guidelines from the NCEP now recommend\nincreased proportions of unsaturated fat (25% to 35% total fat with\nless than 7% from saturated fat) [2]. However, a remaining question\nfor future investigation is whether there is any beneficial effect of\ndiets containing even higher proportions of unsaturated fat (eg, > 35%\ntotal fat with < 7% saturated fat).\"\n\n2. Jakobsen MU, O’Reilly EJ, Heitmann BL, et al. Major types of dietary\nfat and risk of coronary heart disease: a pooled analysis of 11 cohort\nstudies. The American Journal of Clinical Nutrition. 2009;89(5):1425-1432.\n\n\"Results: During 4–10 y of follow-up, 5249 coronary events and 2155\ncoronary deaths occurred among 344,696 persons. For a 5% lower energy\nintake from SFAs and a concomitant higher energy intake from PUFAs,\nthere was a signiﬁcant inverse association between PUFAs and risk of\ncoronary events (hazard ratio: 0.87; 95% CI: 0.77, 0.97); the hazard\nratio for coronary deaths was 0.74 (95% CI: 0.61, 0.89). For a 5%\nlower energy intake from SFAs and a concomitant higher energy intake\nfrom carbohydrates, there was a modest signiﬁcant direct association\nbetween carbohydrates and coronary events (hazard ratio: 1.07; 95% CI:\n1.01, 1.14); the hazard ratio for coronary deaths was 0.96 (95% CI: 0.82,\n1.13). MUFA intake was not associated with CHD. No effect modiﬁcation by\nsex or age was found. Conclusion: The associations suggest that replacing\nSFAs with PUFAs rather than MUFAs or carbohydrates prevents CHD over a\nwide range of intakes.  Am J Clin Nutr 2009;89:1425–32.\"\n\n3. Astrup A, Dyerberg Jã¸, Elwood P, et al. The role of reducing\nintakes of saturated fat in the prevention of cardiovascular disease:\nwhere does the evidence stand in 2010? The American Journal of Clinical\nNutrition. 2011;93(4):684-688.\n\n\"ABSTRACT 2–3%. No clear beneﬁt of substituting carbohydrates for SFAs\nhas been shown, although there might be a beneﬁt if the carbohydrate is\nunreﬁned and has a low glycemic index. Insufﬁcient evidence exists\nto judge the effect on CHD risk of replacing SFAs with MUFAs. No clear\nassociation between SFA intake relative to reﬁned carbohydrates and the\nrisk of insulin resistance and diabetes has been shown. The effect of diet\non a single biomarker is insufﬁcient evidence to assess CHD risk. The\ncombination of multiple biomarkers and the use of clinical endpoints\ncould help substantiate the effects on CHD. Furthermore, the effect of\nparticular foods on CHD cannot be predicted solely by their content of\ntotal SFAs because individual SFAs may have different cardiovascular\neffects and major SFA food sources contain other constituents that\ncould inﬂuence CHD risk. Research is needed to clarify the role of\nSFAs compared with speciﬁc forms of carbohydrates in CHD risk and to\ncompare speciﬁc foods with appropriate alternatives. Am J Clin Nutr\n2011;93:684–8.\"\n\nAlso, I think you would like the following paper:\n\n4. Hite AH, Berkowitz VG, Berkowitz K. Low-Carbohydrate Diet\nReview. Nutrition in Clinical Practice. 2011;26(3):300-308.\n\n\"The shift in metabolism that occurs on a LC diet heralds a shift in our\ncurrent dietary paradigm. Changing the macronutrient content of the diet\nchanges the metabolic profile. Although increasing fiber and decreasing\nsaturated fat intake may be of concern to those whose diets are high\nin carbohydrates, they may be of less concern to those whose diets are\nnot. Increasing vegetable consumption and decreasing consumption of\nfoods low in nutritional value is a dietary goal cited numerous times\nin the 2010 Dietary Guidelines recommendations.87 Reducing dietary\ncarbohydrate can accomplish this goal while improving glucose control,\ninsulin response, atherogenic dyslipidemia, and other cardiovascular risk\nfactors, in addition to reducing caloric intake without hunger. This\nmakes carbohydrate reduction a sensible dietary approach to achieving\nand maintaining health.\"\n", "group_id": 8855, "id": 2288263}]