[{"user_id": 11626, "stars": [], "topic_id": 7748, "date_created": 1298253258.709094, "message": "In 2008, the Alliance of Youth Movements held its inaugural summit in New York City. Attending this summit was a combination of State Department staff, Council on Foreign Relations members, former National Security staff, Department of Homeland Security advisers, and a myriad of representatives from American corporations and mass media organizations including AT&T, Google, Facebook, NBC, ABC, CBS, CNN, MSNBC, and MTV.\r\n\r\nhttp://allyoumov.3cdn.net/f734ac45131b2bbcdb_w6m6idptn.pdf\r\n\r\nOne might suspect such a meeting of representatives involved in US economic, domestic and foreign policy, along with the shapers of public opinion in the mass media would be convening to talk about America's future and how to facilitate it. Joining these policy makers, was an army of \"grassroots\" activists that would \"help\" this facilitation.\r\n\r\nAmong them was a then little known group called \"April 6\" from Egypt. These Facebook \"savvy\" Egyptians would later meet US International Crisis Group trustee Mohamed ElBaradei at the Cairo airport in Februrary 2010 and spend the next year campaigning and protesting on his behalf in his bid to overthrow the government of Egyptian President Hosni Mubarak.\r\n\r\nThe Alliance of Youth Movements mission statement claims it is a not-for-profit organization dedicated to helping grassroots activists to build their capacity and make a greater impact on the world. While this sounds fairly innocuous at first, even perhaps positive, upon examining those involved in \"Movements.org,\" a dark agenda is revealed of such nefarious intent it is almost difficult to believe.\r\n\r\nMovement.org is officially partnered with the US Department of State and Columbia Law School. Its corporate sponsors include Google, Pepsi, and the Omnicon Group, all listed as members of the globocrat Council on Foreign Relations (CFR). CBS News is a sponsor and listed on the globocrat Chatham House's corporate membership list. Other sponsors include Facebook, YouTube, Meetup, Howcast, National Geographic, MSNBC, GenNext, and the Edelman public relations firm.\r\n\r\nMovement.org's \"team\" includes Co-Founder Jared Cohen, a CFR member, Director of Google Ideas, and a former State Department planning staff member under both Condoleezza Rice and Hilary Clinton.\r\n\r\nFounding Movements.org with Cohen is Jason Liebman of Howcast Media which works with mega-corporate conglomerates like Proctor & Gamble, Kodak, Staples, Ford, and government agencies such as the US State Department and the US Defense Department, to create \"custom branded entertainment, innovative social media, and tardeted rich-media campaigns.\" He was also with Google for 4 years where he worked to partner with Time Warner (CFR), News Corporation (FoxNews, CFR) Viacom, Warner Music, Sony Pictures, Reuters, the New York Times, and the Washington Post Company.\r\n\r\nRoman Sunder is also credited with co-founding Movements.org. He founded Access 360 Media, a mass advertising company, and he also organized the PTTOW! Summit which brought together 35 top executives from companies like AT&T (CFR), Quicksilver, Activison, Facebook, HP, YouTube, Pepsi (CFR), and the US Government to discuss the future of the \"youth industry.\" He is also a board member of Gen Next, another non-profit organization focused on \"affecting change for the next generation.\"\r\n\r\nIt is hard, considering these men's affiliations, to believe that the change they want to see is anything less than a generation that drinks more Pepsi, buys more consumerist junk, and believes the United States government every time they purvey their lies to us via their corporate owned media.\r\n\r\nWhile the activists attending the Movements.org summit adhere to the philosophies of \"left-leaning\" liberalism, the very men behind the summit, funding it, and prodding the agenda of these activists are America's mega-corporate combine. These are the very big-businesses that have violated human rights worldwide, destroyed the environment, sell shoddy, overseas manufactured goods produced by workers living in slave conditions, and pursue an agenda of greed and perpetual expansion at any cost. The hypocrisy is astounding unless of course you understand that their nefarious, self-serving agenda could only be accomplished under the guise of genuine concern for humanity, buried under mountains of feel-good rhetoric, and helped along by an army of exploited, naive youth.\r\n\r\nWhat we see is not a foundation from which all activists can work from, but a foundation that has a very selective group of activists working on \"problem spots\" the US State Department would like to see \"changed.\" Sudan, Iran, Saudi Arabia, Egypt, Eastern Europe, Venezuela, and even Thailand - where ever protesters and movements are working to undermine governments non-conducive to corporate America's agenda, you will find Movements.org supporting their efforts.\r\n\r\nThe April 6 Movement of Egypt is one of them, and their role in the apparent success of the US ousting of Hosni Mubarak that may see their man Mohamed ElBaradei in office is a perfect example of how this new army of prodded youth will be deployed. It is color revolution 2.0, run directly out of the US State Department with the support of corporate America.\r\n\r\nIt would be strongly recommended that readers go to Movements.org themselves and explore the website, in particular the 3 summits they have held and those that were in attendance. Everyone from the RAND Corporation to the Council on Foreign Relations comes to \"prod.\" Movements.org truly is a new tentacle for manipulating and undermining the sovereignty of foreign nations.\r\n\r\n2008 Summit New York City .pdf\r\nhttp://allyoumov.3cdn.net/f734ac45131b2bbcdb_w6m6idptn.pdf\r\n\r\n2009 Summit Mexico City .pdf\r\nhttp://allyoumov.3cdn.net/b237e3ae9bd04eaf6d_4lm6bj8n6.pdf\r\n\r\n2010 Summit London \r\nhttp://www.movements.org/pages/the-summit#2010\r\n\r\nhttp://www.globalresearch.ca/index.php?context=va&aid=23283", "group_id": 3920, "id": 155514}]