[{"user_id": 26088, "stars": [], "topic_id": 41508, "date_created": 1310174319.9862599, "message": "Yo pondria la gratuita al principio y la regular en medio resaltada que tal la más cara es lo primero que ven y se frustran", "group_id": 965, "id": 1596972}, {"user_id": 3665, "stars": [{"date_created": 1310174505.819597, "user_id": 26088}], "topic_id": 41508, "date_created": 1310174059.0309551, "message": "Si van a ser muchos datos, agrega líneas muy tenues entre cada fila, para facilitar la vista. Al go muy personal, el botón de comprar lo pondría hasta abajo, y en el caso del paquete \"Regular\", el botón de comprar lo dejaría del mismo tamaño que el de Premium. Te paso este link: http://sixrevisions.com/web-applications/designing-pricing-plans-for-subscription-based-web-apps/?utm_source=twitterfeed&utm_medium=twitter", "group_id": 965, "id": 1596962}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310173460.4536221, "message": "No se si esto sea muy \"off-topic\", pero tratar de diseñar algo no es nada trivial para mi. Me gustarian sus comentarios sobre esta tabla de precios, para hacer cualquier ajuste antes de agregarle toda la información: http://min.us/mKTUyg", "group_id": 965, "id": 1596934}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310174444.3259871, "message": "Buenos comentarios, gracias. Yo que pensaba solo hacer A/B testing de los precios, pero creo que también voy a tener que hacerlo con sus sugerencias :)", "group_id": 965, "id": 1596975}, {"user_id": 25518, "stars": [], "topic_id": 41508, "date_created": 1310176290.9746721, "message": "@ivanyv Creo que viene al caso un video de TED en el que hablan de una opción aparentemente inutil en un plan de precios, pero que gracias ello, la percepción de los usuarios cambia y permite que se venda el paquete \"premium\" aqui dejo la liga: http://www.ted.com/talks/dan_ariely_asks_are_we_in_control_of_our_own_decisions.html", "group_id": 965, "id": 1597073}, {"user_id": 29866, "stars": [], "topic_id": 41508, "date_created": 1310174759.599256, "message": "Te dejo una que en lo personal me gusta mucho, si vas a usar muchos datos: http://shopkeep.com/plans", "group_id": 965, "id": 1596991}, {"user_id": 24160, "stars": [{"date_created": 1310176533.963994, "user_id": 25518}], "topic_id": 41508, "date_created": 1310176379.5540209, "message": "Para todo lo que tenga que ver con \"behavioral economics\", Dan Ariely es una gran referencia. Esquemas de precios definitivamente es una de estas cosas.", "group_id": 965, "id": 1597081}, {"user_id": 24160, "stars": [], "topic_id": 41508, "date_created": 1310176699.625468, "message": "La tabla de precios permite que las personas conozcan mejor el valor de tu servicio y que se den una idea de cuanto terminarían pagan en caso de que quisieran x ó y feature. Así mismo, permite que la elección pase de un (SI/NO) a un (A/B/C/D/NO)", "group_id": 965, "id": 1597091}, {"user_id": 24160, "stars": [{"date_created": 1310176820.130456, "user_id": 26088}], "topic_id": 41508, "date_created": 1310176693.77441, "message": "También, no pierdas de vista que lo más importante (paradójicamente) no es que *elijan* un plan en particular, sino que se suscriban a cualquiera. Una vez que alguien es tu usuario (activation), puedes ejecutar otras acciones para aumentar el ingreso que obtienes de ellos (revenue). Sin embargo, si la persona se va de tu sitio sin elegir al menos la gratuita, lo más probable es que no la vuelvas a ver.", "group_id": 965, "id": 1597088}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310179345.742013, "message": "Que buenos comentarios y recursos, muy útiles siendo la primera vez que implemento algo así, gracias!", "group_id": 965, "id": 1597246}, {"user_id": 2946, "stars": [], "topic_id": 41508, "date_created": 1310194962.529202, "message": "a mi me gusta, pero creo que lo que falta es un trial o garantía de money-back. Quizá en vez de \"Comprar\" debería decir \"Start 30 day trial!\" (pero en español, solo que no se como traducirlo :P )", "group_id": 965, "id": 1597926}, {"user_id": 16337, "stars": [], "topic_id": 41508, "date_created": 1310224881.8930981, "message": "\"30 días de prueba ¡gratis!\"", "group_id": 965, "id": 1599182}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310232140.4584551, "message": "No me convencía mucho ofrecer 30 días gratis, porque va a existir una diferencia enorme entre el plan gratuito y los de pago, y va a ser una diferencia aparente de inmediato. Esperaba que eso sea suficiente para disuadir, pero @cesarsalazar me puso a pensar en que es mejor que elijan cualquiera en lugar de ninguno debido al costo o a que no haya una prueba.", "group_id": 965, "id": 1599736}, {"user_id": 36952, "stars": [], "topic_id": 41508, "date_created": 1310416518.2105069, "message": "@ivanyv te sugiero que en la cuenta de prueba de 30 dias les pidas que ingresen los datos de tarjeta de credito. Eso beneficia mucho para separar a los realmente interesados de los solo curiosos. Esta esta guia que se llama \"Don't just roll the dice\" http://downloads.businessofsoftware.org/dontjustrollthedice.pdf", "group_id": 965, "id": 1615131}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310429009.6657341, "message": "PayPal", "group_id": 965, "id": 1616502}, {"user_id": 12739, "stars": [], "topic_id": 41508, "date_created": 1310424461.30249, "message": "Yo por lo menos, a no ser que sea una empresa con la que ya tengo experiencia o que me han dado muy buenas referencias, nunca doy los datos de mi tarjeta antes de comprar nada.", "group_id": 965, "id": 1616129}, {"user_id": 24160, "stars": [], "topic_id": 41508, "date_created": 1310427386.4372239, "message": "¿Qué estás usando para cobrar recurrentemente con tarjeta?", "group_id": 965, "id": 1616391}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310429157.3829, "message": "Estoy de acuerdo con @Krator, pienso ofrecer una experiencia muy agradable. Que solo presionen un botón del paquete, llenen sus datos escenciales (ni password necesario), y bam! ya tienen servicio", "group_id": 965, "id": 1616513}, {"user_id": 29866, "stars": [{"date_created": 1310431489.9054439, "user_id": 26088}], "topic_id": 41508, "date_created": 1310431328.387691, "message": "@ivanyv Paypal es la versión más recurrente y creo que la más conocida en el mercado, lo que me ha pasado en ocasiones con ellos es que los usuarios piensan que tienes que tener una cuenta con ellos y cuando llegas al apartado para realizar el pago, ven que piden el \"username y password\" y no siguen leyendo que hay opción de crearte una cuenta o de usar solo la tarjeta de crédito. Por eso he pensado en moverme a http://recurly.com/, http://chargify.com/, http://www.zuora.com/ personalmente me gusta más www.recurly.com lo único es que habría que analizar si manejan el \"multilenguaje\" o diferentes \"currencies\".", "group_id": 965, "id": 1616723}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310435760.6071119, "message": "@josuegio yo también quiero pasarme a una de esas opciones, pero como PayPal es lo que he usado, pos de rapidito eso uso. Aparte con esos servicios pagas también al gateway, pero igual vale la pena. Aparte he leido muchas historias de horror de PayPal, así que es bueno tener opciones.", "group_id": 965, "id": 1617102}, {"user_id": 36952, "stars": [], "topic_id": 41508, "date_created": 1310491267.4688139, "message": "@ivanyv Claro, depende a que segmento de mercados es a la que quieres llegar. Como lo menciona @Krator hay personas que prefieren ingresar su informacion hasta despues de probar el producto. Por ejemplo el modelo de SimpleGeo es interesante por que no te pide la tarjeta en la prueba de 30 dias. Pero si quieres 'abrir' la funcion de registrar datos te pide que ingreses los datos de facturacion.", "group_id": 965, "id": 1621303}, {"user_id": 29866, "stars": [{"date_created": 1311001718.141118, "user_id": 26088}, {"date_created": 1311001651.4502931, "user_id": 6541}], "topic_id": 41508, "date_created": 1310927434.149225, "message": "Me encontré esta tabla con el modelo SAAS en HackerNews: http://bit.ly/prUgJV  muy interesante.", "group_id": 965, "id": 1657649}, {"user_id": 13545, "stars": [], "topic_id": 41508, "date_created": 1310994246.47995, "message": "El PDF adjunto también esta muy interesante, gracias por compartir!", "group_id": 965, "id": 1662126}, {"user_id": 34594, "stars": [], "topic_id": 41508, "date_created": 1311002822.8239789, "message": "mi punto de vista es que debes de cobrar desde el inicio, quizá a los que crean en tí ofreceles un descuento adicional", "group_id": 965, "id": 1663500}, {"user_id": 2946, "stars": [{"date_created": 1311198907.9943521, "user_id": 26088}, {"date_created": 1311660859.0580859, "user_id": 25518}], "topic_id": 41508, "date_created": 1311143694.4688489, "message": "Hay una alternativa interesante a los 30 dias de prueba. Cobra desde el principio pero anuncia una política de 60 días de reembolso sin preguntas. Eso da confianza y es poca la gente que pide el reembolso. El compa de http://pluggio.com/ lo hizo y reporta un crecimiento interesante en los signups. (de acuerdo a el mismo, como lo dice en su podcast  http://techzinglive.com/ )", "group_id": 965, "id": 1679083}, {"user_id": 3665, "stars": [], "topic_id": 41508, "date_created": 1310417098.3258331, "message": "@JoseJimenez No estoy muy seguro de eso, ya que dar tu tarjeta por algo que solo lo quieres probar porque aún no estás convencido puede hacerte pensar que te cobraran \"a tu espaldas\", ahora también depende a quién va dirigido, algunos dudan más que otros. Opinaría que hasta cumplidos los 30 días pidas la tarjeta. Si tu servicio/producto @ivanyv,  es genial y cumple con las expectativas de tu usuario(llámase UX) no te deberías de preocupar por separar a los interesados de los curiosos, me ha pasado que por curioso he comprado algunas cositas...supongo que no soy el único. ", "group_id": 965, "id": 1615288}]