[{"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297905394.2503221, "message": "I know that for a lot of people there's been some confusion about the nifty scrollbar functionality. Personally, I love it, and anybody who doesn't just needs to get used to it. :p", "group_id": 88, "id": 127890}, {"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297905457.5923779, "message": "However, there is a problem if you ScrollUp/ScrollDown the broser scrolls the amount of the page height, not the amount of (chatWindow - header) amount.", "group_id": 88, "id": 127903}, {"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297905515.3709159, "message": "I'm not sure if that makes complete sense, but in essence, if I hit the scroll down button I expect to see the last few sentences that *were* at the bottom to be at the top, but what ends up happening is that if I scroll down I end up skipping 2-3 \"chats\".", "group_id": 88, "id": 127923}, {"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297905535.59164, "message": "Chrome 10 / Win 7", "group_id": 88, "id": 127929}, {"user_id": 67, "stars": [], "topic_id": 6679, "date_created": 1297943233.706753, "message": "Using Firefox.  The scroll is incomplete in your feedback group.", "group_id": 88, "id": 130964}, {"user_id": 67, "stars": [], "topic_id": 6679, "date_created": 1297945141.5188129, "message": "Using IE 8: Cannot cut and paste comments from one group to another.", "group_id": 88, "id": 131165}, {"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297959033.3054709, "message": "ugh... I was sleepy when I wrote this. I keep using \"scroll\" and \"page\" interchangeably, making it really hard to understand. Here's a corrected version. :p", "group_id": 88, "id": 132663}, {"user_id": 8138, "stars": [], "topic_id": 6679, "date_created": 1297959034.8825691, "message": "...\n\nHowever, there is a problem if you PageUp/PageDown. The broser scrolls the amount of the page height, not the amount of (chatWindow - header) amount.\n\nI'm not sure if that makes complete sense, but in essence, if I hit the PageDown button I expect to see the last few sentences that *were* at the bottom to be at the top, but what ends up happening is that if I page down I end up skipping 2-3 messages, because the window has scrolled too far.", "group_id": 88, "id": 132664}]