[{"user_id": 33175, "stars": [], "topic_id": 38545, "date_created": 1307484515.8785579, "message": "Sounds great. Too bad I need to pack and run last minute errands :(", "group_id": 4606, "id": 1328847}, {"user_id": 13919, "stars": [], "topic_id": 38545, "date_created": 1307484115.294493, "message": "Interested in learning from others and improving your programming skills? YEGRB is hosting our first ever CodeRetreat on Sunday June 12th.\n\nThe idea behind CodeRetreat is simple. Programming improves with practice and by studying the techniques of others. Therefore, if we want to become better programmers we need to program more and do so with as many programmers as possible. CodeRetreat captures this idea in a day of pair programming.\n\nDuring the retreat programmers work in teams using the language of their choise, and ideally practicing test driven development, to implement Conway's Game of Life (http://en.wikipedia.org/wiki/Conway's_Game_of_Life) in 45 minutes sprints. At the end of each sprint, there is a 15 minute retrospective and break. At the start of the next sprint programmers switch teams, delete all their code and start again. This repeats throughout the day with a one hour lunch break.\n\nParticipants in CodeRetreat should arrive with a good understanding of the language they'd like to use. CodeRetreat is not the place to learn a new language, though Internet access will be available for your reference. You should also brush up on at least one testing framework.\n\nYou can read more about CodeRetreats and how they work at http://coderetreat.com/how-it-works.html.\n\nTo provide lunch we're asking all attendees to bring $10 to use towards a group order. We can decide what to do for lunch at the CodeRetreat.\n\nThis is being organized over the next few days, so we'll announce a venue once numbers are known.\n\nRSVP at --> https://spreadsheets.google.com/a/burmis.ca/spreadsheet/viewform?hl=en_US&formkey=dGM5aXlrZVI4MDRIVkN3b3piSUhZTkE6MQ#gid=0", "group_id": 4606, "id": 1328762}, {"user_id": 13919, "stars": [], "topic_id": 38545, "date_created": 1307542900.1433179, "message": "Morning all. So CodeRetreat is getting off to a slow start, I'm the only attendee! I'm definitely going to do it on Sunday so depending on numbers it may be a smaller event than I'd planned. Tomorrow will be the last day to register for CodeRetreat so that I've got time to arrange a venue. As an aside, is there any interest in remote pairing for the CodeRetreat? It's less ideal but might be a good option if travelling is impractical.", "group_id": 4606, "id": 1337531}]