[{"user_id": 15046, "stars": [], "topic_id": 10720, "date_created": 1299213889.1507499, "message": "A lot of our clients are small businesses whom we've convinced to move from GoDaddy's Website Tonight automatic site builder to a much nicer custom Django-CMS based site. Currently we recommend to the more do-it-yourself clients that they sign up for Webfaction for simpler sites/Rackspace for more complex sites and then have us deploy their site to there.  Any consultants out there, what do you do?", "group_id": 5283, "id": 266647}, {"user_id": 16551, "stars": [{"date_created": 1302730112.5414929, "user_id": 27890}], "topic_id": 10720, "date_created": 1299214059.3313141, "message": "@audreyr FWIW, there are a bunch of new style Python web hosting services coming online which offer a much simpler way of pushing apps. So, have a look through http://blog.dscpl.com.au/2011/01/awesome-year-for-python-web-hosting.html", "group_id": 5283, "id": 266662}, {"user_id": 15046, "stars": [], "topic_id": 10720, "date_created": 1299215196.561466, "message": "@GrahamDumpleton Yeah, I've heard and am very excited and optimistic.  I hope that as many of them as possible survive and prosper.  I'd love to refer clients to something more client-friendly than Webfaction/Rackspace", "group_id": 5283, "id": 266773}, {"user_id": 8740, "stars": [{"date_created": 1311602253.2444201, "user_id": 8391}], "topic_id": 10720, "date_created": 1299231955.2224369, "message": "Indeed; someone suggested to us that we should allow white-labelling of ep.io. It's in the \"eventually\" pipeline, for those agencies/devs who want it, and I presume one or more of our competitors will also do it at some point.", "group_id": 5283, "id": 268442}, {"user_id": 13340, "stars": [], "topic_id": 10720, "date_created": 1299355035.3518269, "message": "@andrewgodwin indeed white labeling is also something that we've thought about doing. I think it could be really valuable for consultancies/agencies who want to give their clients an easy-to-use and well-supported hosting solution.", "group_id": 5283, "id": 277471}, {"user_id": 13340, "stars": [], "topic_id": 10720, "date_created": 1299355217.0120261, "message": "@audreyr if you want to give DjangoZoom a try, let me know and I can hook you up. Or if you will be at PyCon, I can help you get started with it there. Our advantage is that it's very easy to use, even if you're not particularly technically savvy or familiar with the intricacies of Django configuration.", "group_id": 5283, "id": 277478}, {"user_id": 456, "stars": [], "topic_id": 10720, "date_created": 1299391131.628082, "message": "@audreyr why do non-technical clients even need to be exposed to the hosting? Eldarion hosts their clients' sites on Gondor without giving those clients access to Gondor directly", "group_id": 5283, "id": 278748}, {"user_id": 8740, "stars": [], "topic_id": 10720, "date_created": 1299411537.2064581, "message": "@jtauber In my experience working at an agency, some clients want more control over the hosting - you're both agency and host, which is a bit different, for third-parties often giving them access is the only way to prevent them getting annoyed.", "group_id": 5283, "id": 279872}, {"user_id": 8740, "stars": [{"date_created": 1305187828.2997029, "user_id": 8391}], "topic_id": 10720, "date_created": 1299411560.4231219, "message": "To be honest, I think agencies _should_ shield their clients from hosting, but some won't want to", "group_id": 5283, "id": 279873}, {"user_id": 1797, "stars": [], "topic_id": 10720, "date_created": 1299817471.1122899, "message": "The best way we've found to convince clients to just let us take care of it is that we give out our cell phone numbers. So whether we're running their site on Rackspace or our own EC2 build, we act as the contact point for the client, and they don't have to battle shoddy customer service. And then you call it a \"maintenance agreement with hosting included\" to curb the \"why are you more expensive than GoDaddy\" questions.", "group_id": 5283, "id": 319292}, {"user_id": 1797, "stars": [], "topic_id": 10720, "date_created": 1299817503.8230021, "message": "Admittedly, that doesn't scale well.", "group_id": 5283, "id": 319293}, {"user_id": 8740, "stars": [], "topic_id": 10720, "date_created": 1299941871.68009, "message": "@kaseykelly Yeah, that really doesn't scale well, especially a few years later when you've got more and more client websites and haven't grown your sysadmin/ops team.", "group_id": 5283, "id": 332403}, {"user_id": 13340, "stars": [{"date_created": 1299989162.7685909, "user_id": 1736}], "topic_id": 10720, "date_created": 1299979385.1579461, "message": "Thanks to everyone who came to the Python deployment and hosting open space! If you want to continue the conversation, join the Google Group. https://groups.google.com/forum/#!forum/python-deployment", "group_id": 5283, "id": 338112}, {"user_id": 31910, "stars": [], "topic_id": 10720, "date_created": 1304394450.9310651, "message": "jkljl", "group_id": 5283, "id": 893469}, {"user_id": 34623, "stars": [], "topic_id": 10720, "date_created": 1311583346.1210151, "message": "philipscuong", "group_id": 5283, "id": 1714296}]