[{"user_id": 29484, "stars": [{"date_created": 1304698526.0626481, "user_id": 29357}], "topic_id": 33775, "date_created": 1304569006.9783831, "message": "Just noticed again that some of us seem to get really frustrated when trying to help out. I think it becomes important for all of us to consider who is asking. Not much sense in telling the person that is asking, that we feel like pulling teeth. We do not know what their background is and have to keep that in mind. I just feel sorry for some of the peeps sometimes.. Yes, lets find out if they have plugged the appliance in and that they turned it on etc....and if it does get too much for each and everyone of us, then its time to excuse  ourselves from it. Just my 2 cents....", "group_id": 8807, "id": 924226}, {"user_id": 29357, "stars": [], "topic_id": 33775, "date_created": 1304578635.73439, "message": "Try to keep it kind.", "group_id": 8807, "id": 925635}, {"user_id": 29475, "stars": [{"date_created": 1304604626.050344, "user_id": 29484}], "topic_id": 33775, "date_created": 1304578635.6040421, "message": "When the one who is answering the question has downvoted others trying to answer the question, they deserve to get left holding the bag.", "group_id": 8807, "id": 925634}, {"user_id": 29357, "stars": [{"date_created": 1304604623.4701171, "user_id": 29484}], "topic_id": 33775, "date_created": 1304589313.657444, "message": "Problem here is that no one is face to face, no punctuation, slang/abbreviations, lack of technical know how. The written word is easily misread or misinterpreted. Having been on the receiving end of someones \"response\" it is unpleasant to say the least. What makes ifixit better is the pretty professional way you guys answer people,  let's keep it that way?", "group_id": 8807, "id": 927217}, {"user_id": 29484, "stars": [], "topic_id": 33775, "date_created": 1304604567.0273459, "message": "That is what I am trying to get at. Personal vendettas could be fought on here so we can all see it ;-) I do feel that we lose credibility by trying to prove a point to each other, while answering questions. There should never be a reason to undermine anybody. I think it is okay to sometimes say, \" Hey I am at a loss\" without trying to belittle others that are trying to help or even worse, asking for help.", "group_id": 8807, "id": 929429}, {"user_id": 29484, "stars": [], "topic_id": 33775, "date_created": 1304621505.856864, "message": "Absolutely agree, or if it gets to frustrating it's ok to say so, but common courtesy should prevail. BE KIND", "group_id": 8807, "id": 932915}, {"user_id": 31265, "stars": [{"date_created": 1304677428.598645, "user_id": 29484}, {"date_created": 1304698569.408586, "user_id": 29357}], "topic_id": 33775, "date_created": 1304641970.7958429, "message": "i'm not gonna single anyone out, but some people do become demeaning and angry towards posters. I find when I get angry or frustrated or whatnot to just not answer that question, simple as that and I encourage anyone else who is frustrated to do the same. Remember, you're representing the iFixit community- do you want this person's only experience to be abuse and derision?", "group_id": 8807, "id": 935966}, {"user_id": 29357, "stars": [{"date_created": 1304677445.2190981, "user_id": 29484}], "topic_id": 33775, "date_created": 1304674813.722441, "message": "I went to a shop yesterday... The assistant was offhand.. I walked out. Perhaps I was rude but this is what people do when confronted by rude attitudes. One good customer brings more, one bad customer tells more...", "group_id": 8807, "id": 939956}, {"user_id": 29484, "stars": [], "topic_id": 33775, "date_created": 1304677548.441103, "message": "Yes, and anybody that has ever been at the receiving end knows that it feels terrible.  I know I would not come back to a site where I am going to be belittled...", "group_id": 8807, "id": 940240}, {"user_id": 29357, "stars": [], "topic_id": 33775, "date_created": 1304698634.2437191, "message": "@oldturkey03 then what would we do in our \"spare\" time! Hahaha", "group_id": 8807, "id": 943692}, {"user_id": 29484, "stars": [], "topic_id": 33775, "date_created": 1304729074.5567751, "message": "pollytintop, you are so right. I am sure you have as much spare time as I do ;-)", "group_id": 8807, "id": 948002}]