[{"user_id": 11626, "stars": [], "topic_id": 40751, "date_created": 1309374926.1317029, "message": "http://www.wired.com/dangerroom/2011/06/white-house-al-qaida-is-toast", "group_id": 3920, "id": 1520403}, {"user_id": 11626, "stars": [], "topic_id": 40751, "date_created": 1309374890.6843891, "message": "by Spencer AckermanJune 29, 2011  | \n    2:12 pm  | \n    Categories: Terrorists, Guerillas, Pirates\n\nAl-Qaida? The global terrorist entity that the U.S. has fought and feared for a decade? Shattered and irrelevant, declares the White House’s top counterterrorism adviser. It’s just that the U.S. has to keep fighting shadow wars — endlessly — to make sure it stays that way.\n\nIt’s not just the killing of Osama bin Laden. Over the past two and a half years, “unique assets” (i.e., drones and commando raids) have killed the leaders of “virtually every major al-Qaida affiliate,” said White House counterterrorism chief John Brennan. Expect a lot more of that, as new Defense Secretary Leon Panetta and incoming CIA Director David Petraeus have all but promised.\n\n“If we hit al-Qaida hard enough and often enough,” Brennan said, “there will come a time when they simply can no longer replenish their ranks with the skilled leaders they need to sustain their operations.”\n\nBrennan said that doesn’t require a “global war.” But that’s semantic, if not laughable. He gestured at the “utter destruction” of al-Qaida affiliates not just in the Pakistani tribal areas sheltering its leadership but “the periphery, places like Yemen, Somalia, Iraq and the Maghreb.”\n\n\nThen comes the “security cooperation” with foreign security services where al-Qaida seeks to take root, “be it Somalia, the Sahel or Southeast Asia.” Pakistan? Still “one of our most important counterterrorism partners,” Brennan said – never mind bin Laden using Abbottabad as a hideout for six years.\n\nAnd it’ll be bolstered by strengthened homeland security measures like better cargo screening, watchlist procedures for keeping suspected terrorists off planes, and the Bush-era surveillance techniques authorized by the Patriot Act.\n\nThen comes partnering between law enforcement and American Muslim communities — who are “part of the solution” –- to get tips on homegrown extremism. Finally, there’s the need to build a “culture of resilience” at home, so if a terrorist attack happens, the U.S. can “recover quickly” Brennan said, and “deprive al-Qaida of the success it seeks.” Talk about hedging.\n\nBut the biggest success the U.S. enjoys against al-Qaida isn’t the bin Laden kill or the drone strikes. It’s the Arab Spring, which leaves al-Qaida “on the sidelines, watching history pass them by,” Brennan said, reducing its ability to recruit or inspire new terrorists. Homegrown Arab reform movements expose al-Qaida’s “grandiose vision” of a new Islamic caliphate as an “absurd… feckless delusion.”\n\nStrikingly, Brennan had next to nothing to say about the Afghanistan war, a war still premised on smashing al-Qaida, at least according to President Obama. While Brennan hyped Obama’s troop withdrawals, by next September, there will still be 68,000 U.S. troops in Afghanistan, and a long-term troop basing agreement even after Afghan troops take charge of combat by 2014.\n\n“Our best offense won’t always be deploying large armies abroad,” Brennan said. But Obama’s leaving one in place.\n\nAll this points to a big intellectual tension at the heart of the White House’s counterterrorism approach. Why does the U.S. still need to devote such overwhelming resources worldwide against a force that’s seeing history pass it by? If the U.S. still needs such robust surveillance tools at home, why won’t American Muslims feel like targets, instead of full citizens and counterterrorism partners? And how does the U.S. know when al-Qaida has been “utterly destroyed”?\n\nThe charitable way to put it is that the Obama administration is being cautious. The uncharitable way is that it doesn’t know how to end the war.\n\nWhile Brennan portrayed al-Qaida as a spent force, he made it clear that there won’t be any rollback of the security state built after 9/11 to confront it. “We must have a legal framework that provides our extraordinary intelligence, counterterrorism, and law enforcement professionals with all the lawful tools they need to do their job,” Brennan said.\n\nAbove all, Brennan wants the enduring image of al-Qaida to be the one of bin Laden that the U.S. released from the Abbottabad raid — “an old terrorist, alone, hunched over in a blanket, flipping through old videos of a man and a movement that history is leaving behind.” Except that Brennan’s fight against that pitiful old man will continue, worldwide, with no end in sight.", "group_id": 3920, "id": 1520392}]