[{"user_id": 25788, "stars": [], "topic_id": 19821, "date_created": 1302960104.965384, "message": "Looking for signups http://funnelscope.com Thanks!", "group_id": 250, "id": 710534}, {"user_id": 2694, "stars": [{"date_created": 1303746601.6437349, "user_id": 13355}], "topic_id": 19821, "date_created": 1303160084.5442331, "message": "Having a web site with no credibility and no compelling answer to \"what's in it for me?\" does not mean you have a startup. When you don't have to indiscriminately beg for sign-ups, you have a startup.", "group_id": 250, "id": 731059}, {"user_id": 2694, "stars": [], "topic_id": 19821, "date_created": 1303160117.783772, "message": "That said— Exactly what benefits would I get out of trusting you with my email address?", "group_id": 250, "id": 731081}, {"user_id": 25788, "stars": [], "topic_id": 19821, "date_created": 1303219104.2745509, "message": "Hey that's fair. Was actually seeing if convore would be a good platform to generate interest. The benefits are faster hotel search through dialogue versus reading lots of reviews, a recommendation engine, and ability to connect with many hotels in a location to get unpublished rates / promotions. Bottom-line is we help users save time and money in their search for hotels.", "group_id": 250, "id": 741055}, {"user_id": 9018, "stars": [], "topic_id": 19821, "date_created": 1303735862.0377259, "message": "@josephrooks dude just use a throwaway email address to sign up, i have one that i change every year for things like this.\n\n@Kul, i think your landing page made sense and loooked great, good luck with it.", "group_id": 250, "id": 802909}, {"user_id": 2628, "stars": [], "topic_id": 19821, "date_created": 1303792678.329828, "message": "@kul I'd suggest actually explaining what you guys are doing right off the bat the next time you decide to see if a service is a good way of generating interest. In this case there is no way I would have given you my email address based on your landing page. I'd say this also means your coming soon page is a bit too vague.", "group_id": 250, "id": 810352}, {"user_id": 25788, "stars": [], "topic_id": 19821, "date_created": 1303792332.017478, "message": "@deancollins thanks for the feedback!", "group_id": 250, "id": 810319}, {"user_id": 15106, "stars": [], "topic_id": 19821, "date_created": 1303831872.1386969, "message": "Maybe get a better photo with correct depth of field and a bag with lighting that matches, looks pasted on.", "group_id": 250, "id": 815674}, {"user_id": 25788, "stars": [], "topic_id": 19821, "date_created": 1303845011.3665831, "message": "@cullenw thanks for the feedback. Makes sense although I've heard other advice of creating a mystery box to capture people's curiosity versus spelling it out.", "group_id": 250, "id": 817801}, {"user_id": 25788, "stars": [], "topic_id": 19821, "date_created": 1303845068.463589, "message": "@danimal thanks for taking a look and offering input. But not sure I fully understand your suggestion.", "group_id": 250, "id": 817816}]