[{"user_id": 35186, "stars": [], "topic_id": 38032, "date_created": 1307811463.8122201, "message": "My plan is to do some visualizations of carbon dioxide measurements on the surface of the oceans over the last 50 years. CO2 makes seawater more acidic, affecting the types of lifeforms which can survive in the oceans (and causing ocean deadzones, not good for seafood lovers like me).\n\nI already asked Riku to get the ocean CO2 dataset uploaded to EC2, and I also wrote some Hadoop jobs in my fork to run at the hackathon for slicing and dicing the data. Now I'm looking for devs who are good at the Google Maps API to join my team.\n\nI want to use the Maps API to do visualizations on Android. I think the simplest would be to have a map of the world and a time slider for the last 50 years and as you slide the time a number is shown on the regions of the map showing the average surface CO2 level during the time interval. Maybe colour (G->Y->R) could be used to indicate how acidic the seawater is in a given region due to the CO2. I'm also thinking of panning the map and when you tap on a point, a transparent graph is drawn showing how the ocean C02 level has changed over time in the region around that point. A friend also suggested visualizing the CO2 level with images of bubbles, or using a Voronoi diagram. I'm open to ideas doable in the day we have for the hack!", "group_id": 9834, "id": 1370486}, {"user_id": 35186, "stars": [], "topic_id": 38032, "date_created": 1308921422.5509641, "message": "Merged the latest HackReduce commits into my fork, if anybody in Boston wants to use my ocean CO2 mappers and reducers which I tested last week in Toronto.", "group_id": 9834, "id": 1476191}, {"user_id": 36795, "stars": [], "topic_id": 38032, "date_created": 1308955629.4266789, "message": "Hi. I am attending Hack Reduce in Boston , tomorrow. Kinda newbie to Hadoop & MapReduce development. I do have good skills with Mapping, Visualization. Let me know if i can continue working on your CO2 mappers at the event tomorrow.", "group_id": 9834, "id": 1481246}, {"user_id": 35186, "stars": [], "topic_id": 38032, "date_created": 1309010288.6255341, "message": "Hi Satish, that would be fantastic! Go to the HackReduce repo on Github, go to the forks, and look for my fork, \"William Cheung\".", "group_id": 9834, "id": 1484066}, {"user_id": 35186, "stars": [], "topic_id": 38032, "date_created": 1309010926.080795, "message": "Also Satish: the job I ran successfully on the cluster last Saturday was OceanCO2RegionMonthlyStatsOverYears from my code. I spent a lot of time resolving an issue with the Reducer key on my solo team (guess I don't have good pitching skills :) and I didn't get to do any showable visualization of the results. Hoping you can continue from where I left off and create some awesome visualizations of ocean dead zones. Let me know how it goes!", "group_id": 9834, "id": 1484109}]