[{"user_id": 29034, "stars": [{"date_created": 1302712684.1692879, "user_id": 6396}, {"date_created": 1306653721.5078321, "user_id": 5734}], "topic_id": 19169, "date_created": 1302692071.4978559, "message": "I am a specialist recruiter working within the Python Community. I try to set myself apart from the norm by attending socials, User Groups and potentially the conferences. I am keen to find out what people would want from us and any feedback on how to improve.... Cheers. Jon", "group_id": 81, "id": 662958}, {"user_id": 3354, "stars": [{"date_created": 1302848564.2077141, "user_id": 15892}], "topic_id": 19169, "date_created": 1302692896.7856989, "message": "You will find that some people just want you to disappear. Given the current fairly tight state of the Python market you might try explaining how this demand can be made to work on the recruit's behalf. I think the way you asked this question stands in your favor, but remember the first sentence!", "group_id": 81, "id": 663074}, {"user_id": 29034, "stars": [], "topic_id": 19169, "date_created": 1302697742.6357701, "message": "Thanks Steve, I assume that is the view from across the pond. What do guys in the UK feel?", "group_id": 81, "id": 663948}, {"user_id": 6688, "stars": [{"date_created": 1302744592.3236001, "user_id": 141}], "topic_id": 19169, "date_created": 1302701975.7381411, "message": "Honestly, my opinion of recruiters is exactly the same as most people who fill the role of \"agent\" -- they're invaluable if they actually act as an agent, but they're a waste of oxygen when they don't.", "group_id": 81, "id": 665097}, {"user_id": 6688, "stars": [{"date_created": 1302702069.7397139, "user_id": 6415}, {"date_created": 1302754986.3469629, "user_id": 4078}, {"date_created": 1302782152.9600849, "user_id": 1243}, {"date_created": 1302865361.15414, "user_id": 7381}], "topic_id": 19169, "date_created": 1302702009.0632689, "message": "i.e., when I engage a recruiter, or a realtor, or an insurance agent, I'm willing to pay -- but in exchange, I get back a highly specialized and customized service.", "group_id": 81, "id": 665104}, {"user_id": 6688, "stars": [], "topic_id": 19169, "date_created": 1302702071.6209221, "message": "If I engage a recruiter to fill 1 position, I want to see, a week later, 3 people for the job who I would kill to have on my team.", "group_id": 81, "id": 665115}, {"user_id": 6688, "stars": [{"date_created": 1302702427.4355819, "user_id": 960}, {"date_created": 1302713602.297775, "user_id": 25106}, {"date_created": 1302754973.585218, "user_id": 4078}, {"date_created": 1302756926.284656, "user_id": 5778}, {"date_created": 1302758270.2972169, "user_id": 594}, {"date_created": 1302820388.17818, "user_id": 4156}, {"date_created": 1302848607.110568, "user_id": 15892}, {"date_created": 1303018747.601361, "user_id": 11971}], "topic_id": 19169, "date_created": 1302702109.9620321, "message": "I have exactly zero patience for recruiters (or real estate agents, or agents of any kind) who expect to be paid for acting as a mailbox for every twit who can send a resume.", "group_id": 81, "id": 665121}, {"user_id": 6688, "stars": [], "topic_id": 19169, "date_created": 1302702201.5686691, "message": "In other words -- I want a recruiter to work for their money :-)", "group_id": 81, "id": 665132}, {"user_id": 13339, "stars": [], "topic_id": 19169, "date_created": 1302702361.22085, "message": "read blogs by and for developers. read lots of them.", "group_id": 81, "id": 665161}, {"user_id": 6688, "stars": [], "topic_id": 19169, "date_created": 1302702177.2197249, "message": "That means the recruiter needs to know the landscape, know the people, know the personalities, know their areas of expertise -- and know them at a deep level to be able to make valuable suggestions and recommendations.", "group_id": 81, "id": 665126}, {"user_id": 6415, "stars": [], "topic_id": 19169, "date_created": 1302704714.289135, "message": "Know your target and only contact them when you are pretty sure you are not wasting their time with yet another proposition they don't care about. Take no as an answer.", "group_id": 81, "id": 665533}, {"user_id": 1930, "stars": [{"date_created": 1302759243.870054, "user_id": 960}], "topic_id": 19169, "date_created": 1302713078.4483409, "message": "...and I would add to what @freakboy3742 said: Agents who represent a hiring entity can do easy filtering too (not build relationship) and get the obviously \"hot\" picks connected.  The _real_ value is when you actually get to know the worker-bee, and see what a casual interview would miss.   Then you bring value to both the worker, and the hiring entity.", "group_id": 81, "id": 667281}, {"user_id": 1930, "stars": [{"date_created": 1302782191.8228841, "user_id": 1243}], "topic_id": 19169, "date_created": 1302713133.662009, "message": "Put another way, it's harder to invest in knowing the workers deeply than the hiring entity, but it's what makes you valuable.", "group_id": 81, "id": 667295}, {"user_id": 1930, "stars": [], "topic_id": 19169, "date_created": 1302713200.0133841, "message": "Put the other way around:  if you get to know an individual looking for a change, and actually find him a spot that @freakboy3742 would jump at, then you have served well both ends - that is the essence of a valuable recruiter:   an effective matchmaker.", "group_id": 81, "id": 667306}, {"user_id": 1930, "stars": [], "topic_id": 19169, "date_created": 1302713221.514333, "message": "and that takes getting to know both ends of the market you try to match.   Good luck!", "group_id": 81, "id": 667310}, {"user_id": 17897, "stars": [{"date_created": 1302718676.79161, "user_id": 13339}, {"date_created": 1302720688.1207809, "user_id": 7376}], "topic_id": 19169, "date_created": 1302717477.890449, "message": "As a recruiter the one thing you should never ever do is send out a project offerif it doesn't fit the developer you're send it to.", "group_id": 81, "id": 668534}, {"user_id": 17897, "stars": [], "topic_id": 19169, "date_created": 1302717430.6912861, "message": "@freakboy3742 I doubt you'd get the connection to people you'd kill for via a recruiter. The top notch people have enough personal contacts to keep them busy. At least that's the way it is in my branch, which sadly doesn't have anything to do with Python.", "group_id": 81, "id": 668519}, {"user_id": 17897, "stars": [], "topic_id": 19169, "date_created": 1302717793.761868, "message": "I've been a freelancer for the past 10 years so there are a whole bunch of recruiting agencies that have my contact data. For work I code ABAP in the SAP world specifically in the utilities sector. You have no idea how many emails I get every week with project offers for C#, Java, C or SAP modules I have no clue about. Every single invalid email is a -1 for that agency.", "group_id": 81, "id": 668629}, {"user_id": 6396, "stars": [{"date_created": 1302750983.770443, "user_id": 5852}, {"date_created": 1302757095.5619659, "user_id": 5778}, {"date_created": 1302758378.4076509, "user_id": 594}, {"date_created": 1302759306.118582, "user_id": 960}, {"date_created": 1302777381.607604, "user_id": 15180}, {"date_created": 1302778666.730129, "user_id": 15258}, {"date_created": 1302782229.210542, "user_id": 1243}, {"date_created": 1303059928.637701, "user_id": 4093}], "topic_id": 19169, "date_created": 1302726302.319154, "message": "Jon, I think yours was the only recruiter email I actually bothered replying to in the last 2 years; it was personal (as in clearly not a mail merge), to-the-point, and also not actively shoving any jobs in my face without knowing what I actually do. After I replied saying I was currently happy, you haven't contacted me since which is perfect - I know you exist and I know where I *could* go should I ever need to look for a role/hire someone.", "group_id": 81, "id": 671217}, {"user_id": 6396, "stars": [{"date_created": 1302733216.6965981, "user_id": 13339}, {"date_created": 1302778436.711576, "user_id": 15258}], "topic_id": 19169, "date_created": 1302727186.1181591, "message": "I think the key points other than the personal emails have already been mentioned but here are mine anyway: keep up-to-date with the community; understand the technologies rather than just learning the acronyms; don't send unqualified people to roles you know they won't do any well in; get to know the different types of developer (i.e those that enjoy front-end vs those that don't); and don't spam with mailing lists - as they go straight in the trash/get blacklisted.", "group_id": 81, "id": 671414}, {"user_id": 594, "stars": [], "topic_id": 19169, "date_created": 1302758444.9731441, "message": "Yes, especially don't spam the wrong mailing lists. That's an instant blacklist for most devs, and if we think we can figure out who you're recruiting for, we'll blacklist them too.", "group_id": 81, "id": 678993}, {"user_id": 19403, "stars": [], "topic_id": 19169, "date_created": 1302763107.9203589, "message": "We want you to have some idea what the client is actually looking for and what I do.  Don't send me a req for someone who knows Pyhton, C, C++, Java, and Erlang coupled with great Unix skills and SQL masery--predictive analysis and machine learning a plus.  This shows that the employer has no idea what they want and neither do you.  Don't call me the night before the interview and say, \"You should review basic CS skills:, it is not helpful and shows that you are clueless.  At a minimum don't waste our time.", "group_id": 81, "id": 679982}, {"user_id": 26100, "stars": [], "topic_id": 19169, "date_created": 1302797347.4101319, "message": "On the hiring side, taking no for an answer is a huge plus. Also, don't blindly send resumes and assume that represents some kind of binding contract. My nightmare scenario involved interviewing a candidate who sent his resume directly to my company only to have a recruiter call me days later demanding a percentage because he had sent the same resume to my spam folder a few weeks earlier.", "group_id": 81, "id": 686782}, {"user_id": 7, "stars": [{"date_created": 1302848654.889008, "user_id": 15892}, {"date_created": 1303159966.1797099, "user_id": 5778}], "topic_id": 19169, "date_created": 1302806467.5118549, "message": "If I don't respond to your \"out of the blue emails\" it means I'm not interested, and have 0 free time.  Not to keep emailing me.", "group_id": 81, "id": 688483}, {"user_id": 29034, "stars": [], "topic_id": 19169, "date_created": 1302807095.6020839, "message": "Thanks for the comments and feedback..... Has anyone ever had a good experience hiring through a recruiter or being placed by one?", "group_id": 81, "id": 688671}, {"user_id": 17897, "stars": [], "topic_id": 19169, "date_created": 1302811579.79125, "message": "@JonWebJobs The few times I've tried I wasn't very impressed. But always the personal contacts brought along the next project. So I've only needed them to do the billing to the end customer. utilities companies don't do contracts with a single freelancer and for the billing part I have always had good experiences.", "group_id": 81, "id": 689781}, {"user_id": 594, "stars": [{"date_created": 1303160005.9301939, "user_id": 5778}], "topic_id": 19169, "date_created": 1302813131.365139, "message": "Oh, the other thing that's really obnoxious: Emails that go something along the lines of \"you look like you'd be a great fit for our company, please review the jobs posting at <url> and apply at <other url> if you see anything you'd like.\" If you really think I'm a great fit, you'll pick the job I actually fit, pitch me that specific job, and take care of the busywork for me. I expect a good recruiter to remove the \"standard application form\" from the start of the hiring process in most cases. If you're good enough to recruit for the company, you're good enough to save me from the steps in the screening process that weed out the people who can't tie their shoes.", "group_id": 81, "id": 690278}, {"user_id": 3354, "stars": [], "topic_id": 19169, "date_created": 1302834745.11743, "message": "The above behavior is especially egregious when sent to a mailing list rather than an individual. What we are saying, in essence, is become a part of the community you are recruiting from. We place a lot of stock in community contributions of one type or another, too. Maybe your company could host a Meetup for a Python group, or do something else that shows you understand the \"geek culture\" or whatever.", "group_id": 81, "id": 694109}, {"user_id": 3354, "stars": [], "topic_id": 19169, "date_created": 1302834776.6040659, "message": "Geeks are used to being treated like humans. Surprise us, and we may surprise you ;-)", "group_id": 81, "id": 694118}, {"user_id": 4077, "stars": [], "topic_id": 19169, "date_created": 1302837781.344444, "message": "The best recruiter I ever worked for had one perk that I've never seen in years since.  He paid me whether or not I was active on a contract.  I had a flat 'idle' rate that I made no matter what, and an adjustable 'contract' rate that I made depending on the pay range for the contract I was placed to.", "group_id": 81, "id": 694918}, {"user_id": 1930, "stars": [], "topic_id": 19169, "date_created": 1302840995.3909819, "message": "haven't seen anything withing a tornado's wind of that recently", "group_id": 81, "id": 695658}, {"user_id": 1930, "stars": [{"date_created": 1302883428.2302811, "user_id": 13339}], "topic_id": 19169, "date_created": 1302840933.6266229, "message": "There's the old story of the law of the farm, of investing in practicing a piece of music before a performance;   on the recruiter end, I remember a recruiter (out of college) interviewing me, and then giving feedback, and getting to know more.   That recruiter built a stable of people she _really_ know, and thus could fill clients needs with pre-interviewed, honestly known quantities.   That kind of \"recruiter\" relationship is one worth knowing, building, and maintaining throughout your career.", "group_id": 81, "id": 695654}, {"user_id": 6396, "stars": [{"date_created": 1303728882.504463, "user_id": 25337}], "topic_id": 19169, "date_created": 1302861636.753454, "message": "@holdenweb Austin Fraser (Jon's Company) already do; they've sponsored the Django user group meetups both here in London and Bristol (afaik). Definitely on the right track anyway..", "group_id": 81, "id": 698888}, {"user_id": 30876, "stars": [], "topic_id": 19169, "date_created": 1303594321.089206, "message": "Wow!! I am really impressed with how this Django Community is opening up!  When I see a rookie recruiter post a job with every language and technical term on a Ruby board, I cringe and wait for the dogpile of insults.  You need to Give and then once people get to know you the real members of the community will Give Back to you  I was notified of this thread by a member of your community.  So in short, you should participate in discussions and when someone is looking for a referral have the contacts that are strong enough you would risk your reputation to refer them to.  It might take years as it has with me, but once you are in the business and the candidates will come to you. Good luck!", "group_id": 81, "id": 791303}]