[{"user_id": 4070, "stars": [], "topic_id": 35568, "date_created": 1305582992.397392, "message": "Read It Later and Instapaper both offer functionality that is absolutely crucial for me. Saving articles to read later in a pleasant, uncluttered format, online or off, is the number one thing I do with the Internet and my various devices. I'm an iOS user, so I have the choice between the two, but Read It Later's marketing message got to me first.\n\nSo far, I'm like 80% satisfied, but the app has some problems syncing, and it has a tendency to miss the first paragraph of some articles, which is pretty much unacceptable. However, from what I've seen of Instapaper (screenshots only), it's a much more cluttered, distracting reading environment than RIL, which would be a deal-breaker for me.\n\nI'd love to hear views of people who have used both, as well as people who are strongly devoted to one or the other.", "group_id": 97, "id": 1075371}, {"user_id": 12346, "stars": [], "topic_id": 35568, "date_created": 1305587986.4534819, "message": "Remeber that soon, Apple will also have something called \"Reading List\"", "group_id": 97, "id": 1076003}, {"user_id": 4070, "stars": [], "topic_id": 35568, "date_created": 1305597002.972872, "message": "Yeah, but as a non-Safari user, that's not gonna do it for me. Plus, they haven't even implemented Reader mode on iOS yet. Everything we know about Reading List suggests that it's nothing more than a temporary bookmarks folder.", "group_id": 97, "id": 1077608}, {"user_id": 6693, "stars": [], "topic_id": 35568, "date_created": 1305609364.4473169, "message": "You don't mention whether you're using iPhone or iPad, but I assume the former as RIL isn't available on iPad just yet. I'm a huge fan of Instapaper, and use it constantly across both devices - never for a second thought the interface was more cluttered / distracting, but will definitely check out RIL when they get their App Store iPad approval.", "group_id": 97, "id": 1079155}, {"user_id": 2293, "stars": [], "topic_id": 35568, "date_created": 1305609841.5140159, "message": "Personally, I prefer readability.com – It's much cleaner and professional looking vs. Instapaper and Read It Later and you're giving back to the authors that you read.", "group_id": 97, "id": 1079173}, {"user_id": 2293, "stars": [], "topic_id": 35568, "date_created": 1305609948.062361, "message": "I guess I should add that before I switched to Readability I religiously used Instapaper. Never had any issues with its parsing content, syncing, etc. Can't say anything for Read It Later as Instapaper grabbed me first. :)", "group_id": 97, "id": 1079181}, {"user_id": 2276, "stars": [], "topic_id": 35568, "date_created": 1305618430.8262651, "message": "I use Instapaper but it's connected to my Readability account.", "group_id": 97, "id": 1079940}, {"user_id": 4070, "stars": [], "topic_id": 35568, "date_created": 1305652631.6153049, "message": "Wait a sec. Read It Later is not available on the iPad? My iPad is arriving today. I guess that settles that.", "group_id": 97, "id": 1085226}, {"user_id": 22603, "stars": [], "topic_id": 35568, "date_created": 1305659929.9329629, "message": "@aksyn: uh? In fact RIL supports *both* iPhone and the iPad, since the beginning. It's a paid app ($2.99) but well worth the money.", "group_id": 97, "id": 1086980}, {"user_id": 22603, "stars": [], "topic_id": 35568, "date_created": 1305659977.5558419, "message": "@JonMwords I travel a lot, so I'm heavy user of  both RIL and Instapaper on the iPad. I think that RIL is more polished and has more (useful) features than Instapaper. The minimalist interface of Instapaper is nice (and their 1-paragraph article view is useful), but RIL is fast and practical for heavy reading, and also has a cool digest-mode where articles are organized in a flipboard-like view. Anyway, both are very close in terms of functionality, but I personally prefer RIL's UI.\n\nWhat bothers me is that some apps only support one (Pulse News for example only supports Instapaper). I hacked a simple shell script that pulls my items from Instapaper every hour and submits to RIL, so I have everything consolidated on a single place. It's a script that runs on a linux crontab, but if it is useful let me know and I'll post it.", "group_id": 97, "id": 1086988}, {"user_id": 4070, "stars": [], "topic_id": 35568, "date_created": 1305663607.564558, "message": "Yeah, like @guiambros said, RIL is a universal app. I thought so. So, that's good.\n\nThanks, @guiambros. You're making me glad I'm a RIL user, and, so far, all my important services (Twitter, Tweetbot, Feedly) all support both.\n\nDo you ever have the problem, though, where RIL misses the first paragraph of an article? That's the bug that has made me start feeling wanderlust for Instapaper.", "group_id": 97, "id": 1087678}, {"user_id": 22603, "stars": [], "topic_id": 35568, "date_created": 1305699000.7172661, "message": "@JonMWords: weird, never saw RIL missing the any paragraph. The only problem I have sometimes is with some pwd protected sites, but hey, it can't do miracles =)", "group_id": 97, "id": 1093424}, {"user_id": 5436, "stars": [], "topic_id": 35568, "date_created": 1305703865.0767331, "message": "I enjoy reading my Instapaper on my Kindle. Not free but only costs fractions of a Friday beer.", "group_id": 97, "id": 1094128}, {"user_id": 6693, "stars": [], "topic_id": 35568, "date_created": 1305704496.1302869, "message": "@guiambros: my mistake! i googled and was reading an old blog entry. doh.", "group_id": 97, "id": 1094236}, {"user_id": 23764, "stars": [], "topic_id": 35568, "date_created": 1306071777.895493, "message": "Also, I agree with @JonMwords about RIL being a little less popular than Instapaper in some iOS apps but there is an easy workaround which is to mail article/content to add@readitlaterlist.com and every app supports mailing articles.  Once sent to this mail address, it'll appear in RIL.", "group_id": 97, "id": 1141862}, {"user_id": 23764, "stars": [], "topic_id": 35568, "date_created": 1306071674.6647291, "message": "I'm a big RIL user (iPhone, iPad, Web digest on the PC).  I tried Instapaper when the free version was still avalable and prefer RIL.  It keeps articles images and has a nicer interface.  It's not perfect but the dev works actively on it and answers back promptly (http://support.readitlaterlist.com/).  I don't miss the first paragraph either.  It's cheaper and offers more IMO.", "group_id": 97, "id": 1141856}]