[{"user_id": 11626, "stars": [], "topic_id": 7695, "date_created": 1298234315.855207, "message": "http://www.rawstory.com/rs//wp-content/uploads/2011/02/capt.photo_1297803956243-1-0.jpg\r\n\r\nThe FBI urged members of the House Judiciary Subcommittee on Crime, Terrorism and Homeland Security on Thursday to update the Communications Assistance to Law Enforcement Act (CALEA) and make it easier for authorities to eavesdrop on Internet.\r\n\r\nThe act was passed in 1994 and requires telecommunication companies to design their equipment and services to ensure that law enforcement and national security officials can monitor telephone and other communications whenever necessary.\r\n\r\n\"Over the years, through interpretation of the statute by the Federal Communications Commission, the reach of CALEA has been expanded to include facilities-based broadband internet access and Voice over Internet Protocol (VoIP) services that are fully inter-connected with the public switched telephone network,\" FBI General Counsel Valeria Caproni told the subcommittee.\r\n\r\n\"Although that expansion of coverage has been extremely helpful, CALEA does not cover popular Internet-based communications modalities such as webmail, social networking sites or peer-to-peer services.\"\r\n\r\n\"As a result, although the government may obtain a court order authorizing the collection of certain communications, it often serves that order on a provider who does not have an obligation under CALEA to be prepared to execute it,\" she explained. \"Such providers may not have intercept capabilities in place at the time that they receive the order.\"\r\n\r\nThe proposal to expand CALEA would require companies involved in online communications to re-engineer their software so that law enforcement could easily access it.\r\n\r\nIn October 2010, the New York Times reported that the Obama administration was drafting new regulations to make it easier for authorities to eavesdrop on Internet and e-mail communications.\r\n\r\nBut, according to Caproni, \"the Administration does not have a formal position at this time on whether any legislative changes are necessary.\"\r\n\r\nDocuments obtained by the Electronic Frontier Foundation through a Freedom of Information Act request show that the FBI and Justice Department have been working on amendments to CALEA since 2006 and have been lobbying Congress and the White House to support it.\r\n\r\n\"Though the administration claims this is just a technical fix, its request will actually change the structure of the Internet, providing the government with a master key to our online communications,\" Laura W. Murphy, Director of the ACLU Washington Legislative Office, said.\r\n\r\n\"The proposed changes will not only make it easier and cheaper for the government to invade our privacy, but also make the Internet more vulnerable to penetration from other sources.\" \r\n\r\nhttp://www.rawstory.com/rs/2011/02/17/fbi-urges-congress-to-expand-internet-wiretapping", "group_id": 3920, "id": 154709}]