[{"user_id": 4655, "stars": [], "topic_id": 37602, "date_created": 1306880153.0335331, "message": "I don't understand the question, \"A number of students are answering a questionnaire form that has 55 questions. Answer to each question is given as an integer number ranging from 0 to 5. Write a C or C++ program that first reads the number of students that have left the fulfilled questionnaire. After that the programs reads answers so that answers of the first student are entered starting from question 1 and ending to question 55. Answers of second student are then read in similar way. When all answers are entered the program finds out what are questions (if any) to which all students have given the same answer. Finally the program displays those questions (the question numbers). Assume a maximum number of 50 students.\"", "group_id": 10285, "id": 1243254}, {"user_id": 4655, "stars": [], "topic_id": 37602, "date_created": 1306880160.1439509, "message": "can somebody clarify this for me?", "group_id": 10285, "id": 1243258}, {"user_id": 4655, "stars": [], "topic_id": 37602, "date_created": 1306880539.5953121, "message": "Also, I don't understand what to do w/ the first question... It just has a c program on one line and then a textbox - what are we supposed to do??", "group_id": 10285, "id": 1243412}, {"user_id": 4655, "stars": [], "topic_id": 37602, "date_created": 1306914056.9166119, "message": "i got this from professor regarding prob #3: Assume that there are up to 50 students in a class.  The students are given a form to fill in.  The form has 55 questions.   The answer to each question can be an integer between 0 and 5. \n\n\nwrite a program to \n\n1- Get number of students from keyboard\n    Set studentindex =1;\n\n\n2- Get the answers of the next student \n\tRead the answer to question 1 \n\tRead the answer to question 2\n\t\t\t\t.\n\t\t\t\t.\n\tRead the answer to question 55\n\n3-   Increase student index  by 1\n\n4-  if not all students are processed, goto 2\n\n5- after all students answers are entered,  find  if there is a  question where all students responded with the same answer.  if such a question exists,  display the question.", "group_id": 10285, "id": 1250931}]