[{"user_id": 30714, "stars": [], "topic_id": 35499, "date_created": 1305556243.266717, "message": "I've been using Thunderbird for years and its starting to feel dated and arcane.  Is there a more modern email client that works as well or better?  Apple Mail and Thunderbird seem comparable.  Sparrow is new and attractive, but is it as robust as Thunderbird?", "group_id": 97, "id": 1071385}, {"user_id": 3444, "stars": [], "topic_id": 35499, "date_created": 1305557539.9323399, "message": "Since you mention Apple Mail I'm assuming you're on a MAC? I've used Evolution in the past and it's worked great, but I'm not sure if it's available on MAC.", "group_id": 97, "id": 1071698}, {"user_id": 4149, "stars": [], "topic_id": 35499, "date_created": 1305558725.245712, "message": "evolution is super outdated, apple mail is beautiful and really good and robust with some plugins, but the problem with sparrow is it makes email dumb, like twitter it makes it so you can read it like a timeline, so i believe it isn't that good, apple mail can't go wrong, but i am really enjoying thunderbird what about it feels dated?", "group_id": 97, "id": 1071891}, {"user_id": 26433, "stars": [], "topic_id": 35499, "date_created": 1305560848.3540151, "message": "@tronathan, do you use Gmail? If yes, Sparrow is the best email client on the Mac for it. If you're looking for something much more advanced or newer than Thunderbird/Apple, there is Postbox and Outlook for Mac that you can try.", "group_id": 97, "id": 1072135}, {"user_id": 30714, "stars": [], "topic_id": 35499, "date_created": 1305561706.8866739, "message": "I use Gmail but only occasionally, so I'm not addicited to the keyboard shortcuts and so on.  All of my email accounts are Google-hosted (Gmail, Gapps) though.", "group_id": 97, "id": 1072230}, {"user_id": 26433, "stars": [{"date_created": 1305574036.9484911, "user_id": 15929}], "topic_id": 35499, "date_created": 1305560774.0366499, "message": "I do not understand the problem with Sparrow, emails by its nature are dumb and are read in a timeline. Sparrow does it with a simple and clean interface that is different from others.", "group_id": 97, "id": 1072118}, {"user_id": 30714, "stars": [], "topic_id": 35499, "date_created": 1305561670.698797, "message": "Thunderbird's UI hasnt changed since the days of Eudora.  Good to hear your +1 for Apple Mail.  I've had some weeeirdness with Apple Mail in the past that makes me shy away from it.", "group_id": 97, "id": 1072219}, {"user_id": 30354, "stars": [], "topic_id": 35499, "date_created": 1305565627.085526, "message": "Postbox is great", "group_id": 97, "id": 1072654}, {"user_id": 13714, "stars": [], "topic_id": 35499, "date_created": 1305585774.882796, "message": "I agree with Lloyd, if you're looking for a desktop email client, Postbox is the shiznit.", "group_id": 97, "id": 1075753}, {"user_id": 4149, "stars": [], "topic_id": 35499, "date_created": 1305592077.510283, "message": "@Lloyd it was in beta when i got the beta invite like in sept so i was guessing it was still in beta i guess not, but it wasn't that great in beta", "group_id": 97, "id": 1076615}, {"user_id": 4149, "stars": [], "topic_id": 35499, "date_created": 1305591495.563899, "message": "@kapriforce isn't postbox in beta and cost like $20?", "group_id": 97, "id": 1076491}, {"user_id": 30354, "stars": [], "topic_id": 35499, "date_created": 1305591763.1532011, "message": "Oh yeah it costs money. I don't really notice any beta-bits though. I love it, so simple and awesome - there's a plugin that tracks mail hops on a map and I think that's the best :P", "group_id": 97, "id": 1076537}, {"user_id": 4149, "stars": [], "topic_id": 35499, "date_created": 1305592165.77104, "message": "then they tried to scam the beta user's by telling us they would give it to us for free yet they never did and made that update $20", "group_id": 97, "id": 1076635}, {"user_id": 30354, "stars": [], "topic_id": 35499, "date_created": 1305633989.9249599, "message": "@CrowderSoup I think he might mean Outlook Express (used to be bundled with windows)", "group_id": 97, "id": 1081679}, {"user_id": 6097, "stars": [], "topic_id": 35499, "date_created": 1305632848.7969489, "message": "I was kind of forced onto Thunderbird when I upgraded from XP to Windows 7, since 7 does not support Outlook.  Instead they gave us LiveMail, but it would not import the dbx files from outlook for some dumb reason.   After a while of struggling with that I found Thunderbird.  It's pretty ok and so-so for me.  One thing I don't like is that I have to click on each mail to set it to read, whereas in Outlook I could select any or all and set them all to 'read' status with ctrl+q.  Can't find that in Thunderbird.  Anyone know how?   Thanks.", "group_id": 97, "id": 1081542}, {"user_id": 3444, "stars": [{"date_created": 1305714721.813, "user_id": 9108}], "topic_id": 35499, "date_created": 1305634083.45154, "message": "@Lloyd Good call. Never crossed my mind that people actually USED Outlook Express.", "group_id": 97, "id": 1081696}, {"user_id": 3444, "stars": [], "topic_id": 35499, "date_created": 1305633311.182864, "message": "@vbwyrde Since when does Win7 not support Outlook? I have outlook open on my Win7 machine as we speak.", "group_id": 97, "id": 1081595}, {"user_id": 30354, "stars": [], "topic_id": 35499, "date_created": 1305634148.2160709, "message": "Ha!", "group_id": 97, "id": 1081704}, {"user_id": 28472, "stars": [], "topic_id": 35499, "date_created": 1305645383.2895, "message": "If he's ever purchased a copy of Office pro, he'd have access to a proper copy of Outlook.", "group_id": 97, "id": 1084174}, {"user_id": 17897, "stars": [], "topic_id": 35499, "date_created": 1305666345.614614, "message": "right click on the selected mails > Mark > as Read", "group_id": 97, "id": 1088271}, {"user_id": 17897, "stars": [], "topic_id": 35499, "date_created": 1305666308.7924671, "message": "@vbwyrde select the messages you want to mark as read and then either:", "group_id": 97, "id": 1088264}, {"user_id": 17897, "stars": [], "topic_id": 35499, "date_created": 1305666363.0452421, "message": "or messages menu > mark > as read", "group_id": 97, "id": 1088273}, {"user_id": 17897, "stars": [], "topic_id": 35499, "date_created": 1305666313.4773631, "message": "press the M key.", "group_id": 97, "id": 1088265}, {"user_id": 17897, "stars": [], "topic_id": 35499, "date_created": 1305666393.2529271, "message": "that's with thunderbird 3.x, but afair that already worked with 2.x", "group_id": 97, "id": 1088274}, {"user_id": 6097, "stars": [], "topic_id": 35499, "date_created": 1305718237.5122931, "message": "@adsworth Oh!  Hah... Great thanks!", "group_id": 97, "id": 1096163}, {"user_id": 6097, "stars": [], "topic_id": 35499, "date_created": 1305718398.944176, "message": "@Lloyd Yup.  The reason i stick with Outlook Express was because it has one feature that I like.  If you look at the message you can look at the details before opening the email, wherein you can see not only all of the headers, but the entire text of the email as well whether it be html, plain text or binary, in a non-script-executing window.   That allowed me to look at suspicious emails and check them before actually opening them.   Outlook, as far as I could tell, and for whatever reason, did away with this useful safety feature.   So I continued to use Outlook Express.", "group_id": 97, "id": 1096172}, {"user_id": 12709, "stars": [], "topic_id": 35499, "date_created": 1305771015.423779, "message": "I used to use Mail.app, but found it was really slow & clunky once you got a few emails in there. I also found that it would occasionally crash & corrupt the mail db, which was always fun. It's not so bad under Snow Leopard, but used to happen every so often under Leopard.\nI used Sparrow a lot during their beta & made the jump as soon as they added support for MobileMe. I really like it, quick, simple & has some good shortcuts that make things a bit easier. It probably doesn't do half the enterprisey stuff of other clients, but I don't need that stuff.", "group_id": 97, "id": 1106089}, {"user_id": 9108, "stars": [], "topic_id": 35499, "date_created": 1305946768.074507, "message": "You could always use pine for awhile... then Thunderbird won't seem so dated by comparison.", "group_id": 97, "id": 1131994}, {"user_id": 17912, "stars": [], "topic_id": 35499, "date_created": 1305958960.265887, "message": "I use Postbox and love it! It feels very much like Thunderbird, and if you migrate, you can bring over many of your custom settings (topics, filters, etc.). It's totally worth the $40 or whatever it costs.", "group_id": 97, "id": 1132907}, {"user_id": 33955, "stars": [], "topic_id": 35499, "date_created": 1306122995.2831941, "message": "Sparrow is awesome and zippy", "group_id": 97, "id": 1148094}]