[{"user_id": 11626, "stars": [], "topic_id": 6545, "date_created": 1297891840.446702, "message": "Senior Pentagon officials are sounding concern over China's development of weapons designed to shoot down satellites or jam communication signals.\r\n\r\nU.S. Deputy Secretary of Defense for Space Policy Gregory Schulte said China's project was becoming a \"matter of concern\" for the United States.\r\n\r\nSpace, he told defense and intelligence officials while unveiling a 10-year strategy for security in space, \"is no longer the preserves of the United States and the Soviet Union, at the time in which we could operate with impunity.\"\r\n\r\n\"There are more competitors, more countries that are launching satellites ... and we increasingly have to worry about countries developing counter-space capabilities that can be used against the peaceful use of space.\"\r\n\r\nIn 2007, China shot an obsolete weather satellite with a ground missile, creating so much space junk that crew members on the International Space Station had to change orbit to avert a collision last year.\r\n\r\nSchulte said in his remarks that U.S. concerns had prompted U.S. Defense Secretary Robert Gates to seek to include space in stability talks being pursued with the Chinese.\r\n\r\nThe official said China's capabilities were going beyond shooting at spacecraft.\r\n\r\nBeijing's counter-space activities include jamming satellite signals. It is also in the process of developing directed energy weapons that emit a disabling burst of energy toward a target rather than firing a projectile at it.\r\n\r\nOther countries believed to be developing counter-space technology include Iran and Ethiopia.\r\n\r\nDiplomatic cables distributed by WikiLeaks and published by the British Daily Telegraph newspaper said that the United States and China had engaged in a show of military strength in space by testing anti-satellite weapons on their own satellites on separate occasions.\r\n\r\nThe memos feature more than 500 leaked cables that detail the fears of the countries as they race to gain supremacy in space.\r\n\r\nThe documents revealed that following China's destruction of the weather satellite in 2007, the United States responded a year later by blowing up a defunct satellite in a test strike.\r\n\r\nU.S. officials at the time, rebuffed reports that the move was part of a military test, saying it was necessary to destroy the American spy satellite to avert a health and environmental fallout as it re-entered the Earth's atmosphere laden with toxic fuel.\r\n\r\nUnder the 10-year space strategy being formulated by the Pentagon, Schulte said the United States was bent on proposing ways to protect U.S. space assets. Among the considerations: setting up international partnerships along the lines of NATO, under which an attack on one member would constitute an attack on all and thus jointly retaliate.\r\n\r\nSchulte said the United States also retained the option to \"respond in self-defense to attacks in space.\"\r\n\r\nhttp://www.spacedaily.com/reports/US_wary_of_China_space_weapons_999.html", "group_id": 3920, "id": 124720}]