[{"user_id": 9018, "stars": [], "topic_id": 21839, "date_created": 1304014725.8989019, "message": "Anyone on the list willing to chat about their email open rates (either publicly or shoot me an email offline)\n\nLiveFanChat sent out an email on Tuesday thinking that would leave plenty of time for tonights NFL Draft chat at 7pm but 91% of the recipients still haven’t even opened the email.\n- http://us1.campaign-archive1.com/?u=bef9698ab77e79ba72e40cf40&id=f835c657f1&e \n\nIs this the norm?\n\nOr unsubscribes and bounces are great (eg really low) but really surprised about the fact that only 9% of the emails have even been looked at in the last 48 hours (I’m assuming if they aren’t read by today probably never will be etc).\n\nIs there something I can do to improve this open rate or it is what is it and this is about average (or the tools are sub standard and these reports are inaccurate).\n \n", "group_id": 97, "id": 844818}, {"user_id": 15929, "stars": [], "topic_id": 21839, "date_created": 1304018643.1774621, "message": "where did you get the email addresses? and NFL probably won't be flagged as important for most. I, for one, add +misc to my gmail address and skipped the inbox for mailing list like this.", "group_id": 97, "id": 845963}, {"user_id": 31293, "stars": [], "topic_id": 21839, "date_created": 1304019200.8286591, "message": "If you gotta trick people to open your mail, you've already failed IMHO.", "group_id": 97, "id": 846132}, {"user_id": 28472, "stars": [], "topic_id": 21839, "date_created": 1304018813.0453401, "message": "I can't answer your question, but if it were feasible to do so I'd have sent out that email atleast 5 days in advance. Many people I know, at best, check their email every few days.", "group_id": 97, "id": 846021}, {"user_id": 15929, "stars": [], "topic_id": 21839, "date_created": 1304018947.5381889, "message": "I used to work at a marketing company, there are \"tricks\" to get those numbers up. I felt sleazy even thinking about them", "group_id": 97, "id": 846059}, {"user_id": 15929, "stars": [], "topic_id": 21839, "date_created": 1304018691.3674979, "message": "and in this particular case, I think twitter will serve you better than mail blast", "group_id": 97, "id": 845983}, {"user_id": 1661, "stars": [], "topic_id": 21839, "date_created": 1304021348.8468511, "message": "Hmm... For niche emails where the user has opted in I'm used to a 20% - 25% open rate with a viral factor very close to but less than 1.", "group_id": 97, "id": 846590}, {"user_id": 9018, "stars": [], "topic_id": 21839, "date_created": 1304029632.411958, "message": "the email addresses are from people who signed up for our app at http://www.LiveFootballChat.com", "group_id": 97, "id": 847946}, {"user_id": 9018, "stars": [], "topic_id": 21839, "date_created": 1304029861.901926, "message": "we didnt have a problem with the emails being incorrect, mailchimp shows you those failures (hard bounces), i was surprised only 1 of the emails hard bounced, the other 99.999% were delivered successfully but that makes sense as the emails are provided to us by end user then password confirmed with a click.\n\nThis is the first time we've sent out a news letter so surprised 90% haven't been opened, all the other emails we send are transactional emails that are sent from our servers eg sign up, win a badge, someone adding you to their buddy list etc", "group_id": 97, "id": 847973}]