[{"user_id": 4182, "stars": [], "topic_id": 16966, "date_created": 1301796066.262136, "message": "I started out with rails a few weeks ago. It's going really well and I'm getting beyond the more basic stuff..\nNow often times I have specific questions stopping my progress, that should be pretty simple for someone in the know, but are really too little and happen too frequent to post on stackoverflow every time. #rubyonrails also has not proven to be an optimal solution.\n\nSince I don't really know anyone that masters Rails, I'm looking for someone that I can add on Skype, and would allow me to ask a specific (pre-googled) question now and then.\n\nI am really good in design and front-end development, maybe I could assist people in that as a trade.\nThanks!", "group_id": 447, "id": 511312}, {"user_id": 4221, "stars": [], "topic_id": 16966, "date_created": 1301831365.4877789, "message": "I would think just sitting on an IRC channel would be a pretty easy way to do this. http://rubyonrails.org/community says that #rubyonrails on freenode.net is a good place to hang out and get more real-time answers.  \n\nhttp://webchat.freenode.net/ is a good-enough web chat frontend for IRC (I use it all the time since my firewall/proxy blocks IRC ports and such)", "group_id": 447, "id": 514111}, {"user_id": 290, "stars": [], "topic_id": 16966, "date_created": 1301876406.935087, "message": "@mortelmans I'm porting Sinatra app to rails now and think it would be cool to have another person outside irc/buddies way better than me at this to chat with. Does this thing have DM?", "group_id": 447, "id": 518947}, {"user_id": 4221, "stars": [], "topic_id": 16966, "date_created": 1301915918.9875419, "message": "If this thing has DM or chat-like features, I've yet to find them.", "group_id": 447, "id": 522626}, {"user_id": 2, "stars": [{"date_created": 1301935320.626086, "user_id": 25720}], "topic_id": 16966, "date_created": 1301931467.649662, "message": "@klauern  @magicbeef we're working on a private messaging (DM-like) feature... soon. :D", "group_id": 447, "id": 524098}, {"user_id": 5446, "stars": [], "topic_id": 16966, "date_created": 1302076400.828258, "message": "@mortelmans Ive finished a few decent Rails apps and though I am no master, I never mind discussing stuff and helping if I can. sapientsa on Skype.", "group_id": 447, "id": 556163}, {"user_id": 4182, "stars": [], "topic_id": 16966, "date_created": 1302103302.644872, "message": "Maybe I should have mentioned my Skype; dringdring188", "group_id": 447, "id": 560364}]