[{"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306432639.458936, "message": "@pevans_om Life?", "group_id": 9787, "id": 1194542}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306432466.8631999, "message": "What are your thoughts about NDEs? Real deal? Impossible? Heard about this on a podcast on the way home today http://www.youtube.com/watch?v=OC0AQ3L8r9c&feature=player_embedded", "group_id": 9787, "id": 1194518}, {"user_id": 32900, "stars": [], "topic_id": 36929, "date_created": 1306432579.623491, "message": "I think they call it 'life'", "group_id": 9787, "id": 1194534}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306432846.72721, "message": "2 Corinthians 12:2-6 \"2  I know a man in Christ who fourteen years ago--whether in the body I do not know, or out of the body I do not know, God knows--such a man was caught up to the third heaven.3  And I know how such a man--whether in the body or apart from the body I do not know, God knows--4  was caught up into Paradise and heard inexpressible words, which a man is not permitted to speak.5  On behalf of such a man I will boast; but on my own behalf I will not boast, except in regard to my weaknesses.6  For if I do wish to boast I will not be foolish, for I will be speaking the truth; but I refrain from this, so that no one will credit me with more than he sees in me or hears from me.\"", "group_id": 9787, "id": 1194569}, {"user_id": 32900, "stars": [], "topic_id": 36929, "date_created": 1306432986.645638, "message": "@penkin Yup.'Life'...it's what happens right before death for most people :)", "group_id": 9787, "id": 1194584}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306433123.480799, "message": "@pevans_om hehe You must be thinking of RBD (Right Before Death), but seriously. What do you think of it? People going/seeing either hell or heaven and then coming back. Seems to be a lot of documented cases, have read none :)", "group_id": 9787, "id": 1194613}, {"user_id": 32888, "stars": [], "topic_id": 36929, "date_created": 1306435739.8547039, "message": "define near death experience?", "group_id": 9787, "id": 1194917}, {"user_id": 32891, "stars": [], "topic_id": 36929, "date_created": 1306480635.4613619, "message": "A friend of the family passed away recently, but apparently a few weeks before he died he had an op where his heart stopped. Supposedly he experienced something, but one of the first things he did afterwards was phone up a Christian friend & tell them that there were no angels or fairys waiting... Weird. I guess it's the same as the dream interpretation thing. There aren't any formulas..", "group_id": 9787, "id": 1201768}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306480324.577343, "message": "@LintonCaldecott \"The perception reported by a person who nearly died or who was clinically dead and revived.\"", "group_id": 9787, "id": 1201742}, {"user_id": 32900, "stars": [], "topic_id": 36929, "date_created": 1306502191.006556, "message": "The human mind and imagination are powerful things. How can we know whether we've seen something real or imagined. I agree with @EdwinGarden, this is similar to dream interpretation in some ways. Is the book of Revelation a 'near death experience'? Is it a real picture of heaven or a symbolic one? eish! We can't really know until we actually die.", "group_id": 9787, "id": 1204660}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306513518.192136, "message": "@pevans_om I suppose. There seems to be a lot of documented cases of both hell and heaven experiences. What is a mind twister for me is, the body dies, and somehow you see a \"glimpse\" of heaven or hell and then when someone revives you back here on Earth your walkabout self is snapped back in your body.\n\nWhat would be interesting though is how similar or dissimilar the encounters are?", "group_id": 9787, "id": 1206603}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306513725.627099, "message": "The follow on from all this is also \"Outer Body Experiences\" where people are on the operating table and they \"die\" (or whatever) and the can see everything from a distance. When they are revived they recall things that happened in other rooms accurately. These things have also been documented.\n\nMy question though is, why are some just wondering outside their body and others going to Heaven or Hell? Are some more dead than others?", "group_id": 9787, "id": 1206642}, {"user_id": 32900, "stars": [], "topic_id": 36929, "date_created": 1306599499.171566, "message": "or are they just visions of the demonic?", "group_id": 9787, "id": 1213003}, {"user_id": 13817, "stars": [], "topic_id": 36929, "date_created": 1306835764.6043291, "message": "@CelesteH2O There are lots of recorded cases. Both of \"hell\" experiences and \"heaven\". From what I have heard though, there are also differing ones. I'm not sure what to make of it though. Would be cool to sit with someone that has had the experience to see what they say and where they land after the experience.", "group_id": 9787, "id": 1236386}, {"user_id": 34565, "stars": [], "topic_id": 36929, "date_created": 1306835280.201514, "message": "Its strange how everyone has the same near-death experience. Often times they see a bright light and feel at peace. So they go to \"heaven\" regardless of whether they accepted Jesus as their saviour. And more often than not, they end up in new age rubbish like angel communication. I think we have to judge each case seperately and measure it against Scripture to see if its good or bad.", "group_id": 9787, "id": 1236341}, {"user_id": 32900, "stars": [], "topic_id": 36929, "date_created": 1306836132.180599, "message": "@CelesteH2O Agreed, I think it's something that must be evaluated case-by-case. Visions and dreams can be very powerful and very 'real'. For example, I'm convinced to this day that when I was five I had my tonsils removed and I woke up in the theater during the operation. I remember clearly seeing the faces of the doctors above me. My mother and the doctors swear I never woke up......so.....real or not?", "group_id": 9787, "id": 1236426}]