[{"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1298672590.5499971, "message": "Este espacio es para escribir las preguntas que tengamos del Proyecto y llevarlas el Lunes 28 de Febrero a la Clase", "group_id": 5157, "id": 211792}, {"user_id": 16090, "stars": [], "topic_id": 9156, "date_created": 1298676937.3312681, "message": "Ok, listo", "group_id": 5157, "id": 212067}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1298689619.282007, "message": "OK.", "group_id": 5157, "id": 212680}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1298856532.996829, "message": "Pregunta sobre el enunciado: \"Los tableros deben actualizarse de forma automática en no más de 5 minutos para el tablero del gerente de teatro, no más de 15 minutos en caso de que se trate de un gerente de ciudad, y no más de media hora en el caso del gerente por país.\". ¿Los tableros también se pueden actualizar manualmente?, en caso de ser posible, ¿Cuánto tiempo debe demorarse en actualizarlo?.", "group_id": 5157, "id": 223205}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1298859659.0807791, "message": "El acceso a todos estos servicios, parece que se hace por Internet (lógicamente?). Pero solo hablan de una página para la confitería. El usuario deberá descargar una aplicación (que trabaja con contenido de internet) o es a través de un browser.", "group_id": 5157, "id": 223322}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1298861312.8053861, "message": "El componente del Call Center tiene acceso directamente a la Base de Datos de los Cines? o debe pasar por otro componente?", "group_id": 5157, "id": 223386}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1298862287.19506, "message": "En la sección \"Summary of capabilities\", el \"Customer\" hace referencia solamente al cliente (Cine Universal Ltda.) o también a los usuarios finales.", "group_id": 5157, "id": 223399}, {"user_id": 12446, "stars": [{"date_created": 1298862595.5351789, "user_id": 12446}], "topic_id": 9156, "date_created": 1298859713.879437, "message": "Si ustedes logran dar respuesta a alguna de estas, pues mejor para no \"quedar mal\" en clase. En mi caso, esta funcionando leer el documento de visión y lo que debe ir ahí, después de haber visto el enunciado... así salen más dudas.", "group_id": 5157, "id": 223329}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299081750.5529661, "message": "Esta noche les publico los temas de cada uno por este medio.", "group_id": 5157, "id": 248186}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299173793.2770431, "message": "Cristian, usted publica los temas y trabajamos por separado el viernes o al fin nos vamos a reunir?, si la respuesta es que no nos reunimos cuando hacemos merge.", "group_id": 5157, "id": 261724}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299199496.6517529, "message": "Anotaciones importantes del documento e ideas iniciales. ¿Qué les parece si trabajamos en un Google Doc o con Google Cloud Connect?. Ustedes dirán. Yo opino que podríamos usar Cloud Connect porque cada uno tiene una sección diferente y eso nos va a ahorra tiempo de integración y no nos cruzamos con nada.\n\nPor otro lado, en vista del ejemplo dado, todo es muy concreto. Tengan en cuenta la buena redacción y re-lean cada párrafo que escriban, de tal forma que el resultado final sea muy concreto y entendible.\n\nLa sección \"A. Features Attributes\" no se debe realizar, lo dijo Carreño la clase pasada.", "group_id": 5157, "id": 265294}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299199253.6507909, "message": "Bueno, que pena por la demora. Por diferentes circunstancias de carácter urgente no había subido la distribución. Sin embargo, ustedes saben que siempre soy cumplido y de aquí en adelante si nada se presenta, seré igual de cumplido.", "group_id": 5157, "id": 265285}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299199733.182884, "message": "Distribución:\n\n+ Cristian: Sección 1, 2 y 3\n+ Camilo: Sección 4, 5 y 6\n+ Jeisson: Sección 7,8,9 y 10\n\nRevisen TODA la plantilla y si están de acuerdo, manifiesten por escrito el estar de acuerdo con la distribución en este mismo foro. Si no, sugieran los cambios. También tengan cuidado si necesitan información de otra sección. Traten de adelantar todo lo más pronto posible.", "group_id": 5157, "id": 265315}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299205999.3767509, "message": "Pues yo opino que si lo de google conet ya esta comprobado de que no nos va a causar problemas, pues lo usamos me parece que es una buena estrategia. A los problemas que me refiero es que se nos borren cosas y eso, pero igual como por prevención creo que sobra decir que es buena que cada uno tenga su versiones guardas, lo cual también nos sirve para el historial de cambios. y lo ultimo que quiere preguntar o mas bien es acordar la fecha de entrega.", "group_id": 5157, "id": 266020}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299207242.5243139, "message": "Pero Google Cloud Connect no tiene problema con las versiones porque igual el archivo esta en el computador de cada uno. Solo se va sincronizando con lo de los demás. La fecha de entrega sería para el Domingo 6 de Marzo.", "group_id": 5157, "id": 266130}, {"user_id": 16090, "stars": [], "topic_id": 9156, "date_created": 1299268376.5492351, "message": "Muchachos por favor cada uno coloque el nombre de sus secciones asignadas en español.", "group_id": 5157, "id": 272223}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299283540.1734991, "message": "@JeissonPerez109 ok", "group_id": 5157, "id": 274027}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299284703.9320819, "message": "En la sección 1.3 y 1.4, coloquen todas las definiciones y referencias que necesiten.", "group_id": 5157, "id": 274156}, {"user_id": 12446, "stars": [], "topic_id": 9156, "date_created": 1299430349.558461, "message": "@facecamiloabaunza Así como usted decía, póngale que se va alojar donde los contratantes (Cine Universal Ltda.) decidan alojar la información... algo así", "group_id": 5157, "id": 280822}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299430632.265949, "message": "pero el problema digamos es que tambien me toca hablar de costos, y pues la verdad es que estoy confundido si el proyecto hay que verlo como un proyecto académico o como si de verdad lo fuéramos hacerlo, porque en este ultimo habría que calcular un costo, mientras que si es un proyecto académico como siempre lo hacemos el costo, primero lo asumen la universidad con el uso de servidores, licencias, maquinas que necesitamos nosotros  y todas esas cosas.", "group_id": 5157, "id": 280853}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299429510.9869781, "message": "Dentro de la parte que me toco hacer a mi me toca hablar sobre los supuestos, pero tengo una dudas y es que digamos nosotros como lideres del proyecto tenemos que decir en algún lado que suponemos que el sistema de información se va a alojar en los servidores de la Pontificia Universidad Javeriana. y otras cosas relacionadas como eso...... o hay que enfocarlo como si fuera un negocio de verdad y entonces en ese caso tendríamos que decir como que se va a lojar en los servidores que proporcione Cine Universal Ltda.", "group_id": 5157, "id": 280718}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299431735.615046, "message": "si tienen cosas las cuales van a asumir en cuanto al producto (sistema de información), póngalas acá, ya que me toca poner las suposiciones que se hacen. y no es que esten haciendo el trabajo por mi si no que cada uno tiene puntos de vista diferentes dependiendo lo que les toco hacer.", "group_id": 5157, "id": 280982}, {"user_id": 16117, "stars": [], "topic_id": 9156, "date_created": 1299480035.8454909, "message": "en este momento se da por finalizado el documento de visión (RUP)", "group_id": 5157, "id": 285927}]