[{"user_id": 11827, "stars": [], "topic_id": 20692, "date_created": 1303391281.6408379, "message": "So what's your take?  Should it be in a separate project or in the same project?", "group_id": 2227, "id": 769832}, {"user_id": 11827, "stars": [], "topic_id": 20692, "date_created": 1303391124.2395959, "message": "I'm starting with Fabric for my Django app. I noticed that many developers store their Fabric scripts in the same project as their web app.", "group_id": 2227, "id": 769814}, {"user_id": 11827, "stars": [], "topic_id": 20692, "date_created": 1303391194.8907909, "message": "I believe separating it into a different deployment project may be a better idea. I don't have any experience with Fabric, so I might be missing something.", "group_id": 2227, "id": 769824}, {"user_id": 5794, "stars": [], "topic_id": 20692, "date_created": 1303411306.3287849, "message": "What would be the point in separating them? It only relates to that project? If it's a fablib perhaps but even still I'd include it in the repo so users are ready to go if it's needed", "group_id": 2227, "id": 774043}, {"user_id": 4156, "stars": [], "topic_id": 20692, "date_created": 1303414735.5243289, "message": "Put another way -- it's Just Python(tm) so do whatever you would do with any other Python code related to your web project :)", "group_id": 2227, "id": 774796}, {"user_id": 4156, "stars": [], "topic_id": 20692, "date_created": 1303414760.4443009, "message": "all that matters in the end is that your fabfile ends up with the tasks imported into it, how they get there is up to you and Python", "group_id": 2227, "id": 774803}, {"user_id": 4156, "stars": [], "topic_id": 20692, "date_created": 1303414712.7164781, "message": "If you find yourself abstracting out generic fab recipes that could apply to multiple projects, *that* is usually when you start thinking about a standalone repository and moving to a tiered setup (i.e. generic + app-specific both being imported and using overrides/etc)", "group_id": 2227, "id": 774786}, {"user_id": 4156, "stars": [], "topic_id": 20692, "date_created": 1303414667.557034, "message": "Generally, code that is tightly tied to your application should live in the app -- that way developers can simply check out one repository and go to town, and the Fabric code may eg import your app code or otherwise interface with it", "group_id": 2227, "id": 774775}, {"user_id": 11827, "stars": [], "topic_id": 20692, "date_created": 1303469266.1512079, "message": "Thank you all for your insights. I agree that the app should run for a developer \"out of the box\", but the production/testing deployment, which shifts all the time, seems to be a different story. Anyway, I'm sure I'll find the right formula in my case.", "group_id": 2227, "id": 780672}, {"user_id": 5794, "stars": [], "topic_id": 20692, "date_created": 1303487575.7350791, "message": "Is there a case where production/testing isn't being deployed by the devs? Or are the fab tasks really only for making your life simpler, and don't add anything to the final product?", "group_id": 2227, "id": 782276}, {"user_id": 11827, "stars": [], "topic_id": 20692, "date_created": 1303627957.6265049, "message": "I like the modularity. For example, tomorrow, I might deploy two projects on the same server, e.g. one for my static site and one for my web app. You could argue that this should all be one big happy project. Again, I think modularity has its' benefits. Call it the architect perspective.", "group_id": 2227, "id": 793294}]