[{"user_id": 11991, "stars": [], "topic_id": 20808, "date_created": 1303449279.3904481, "message": "Solo quieres el diagrama para documentar el proyecto?", "group_id": 965, "id": 779203}, {"user_id": 24172, "stars": [], "topic_id": 20808, "date_created": 1303454171.13187, "message": "Sólo hago wireframes para la UI. Qué recomiendas para la parte del WebService?", "group_id": 965, "id": 779570}, {"user_id": 25716, "stars": [], "topic_id": 20808, "date_created": 1303454626.3042791, "message": "Pluma y papel :D Pero, que estas buscando especifico? Existes mucho programas para diagramas, yo uso OmniGraffle", "group_id": 965, "id": 779614}, {"user_id": 2946, "stars": [], "topic_id": 20808, "date_created": 1303456285.0557489, "message": "justo acabo de descubrir http://www.lucidcharts.com/ mediante AppSumo y me parece una herramienta muy interesante. Igual sirve para hacer wireframes que diagramas.", "group_id": 965, "id": 779666}, {"user_id": 24172, "stars": [], "topic_id": 20808, "date_created": 1303462069.5329311, "message": "Yo uso Balsamiq Mockups, te regalan una cuenta de por vida Premium si tienes una comunidad o tienes una librería open source :). También Cacoo me gustó mucho para wireframing :).", "group_id": 965, "id": 780119}, {"user_id": 20146, "stars": [], "topic_id": 20808, "date_created": 1303470489.6317899, "message": "Yo suelo ocupar DIA para todo tipo de diagramas, http://projects.gnome.org/dia/ las funcionalidades de le pueden llegar a faltar se resuelven con plugins en python: http://projects.gnome.org/dia/python.html", "group_id": 965, "id": 780752}, {"user_id": 26084, "stars": [{"date_created": 1303490074.163275, "user_id": 19921}], "topic_id": 20808, "date_created": 1303479191.1009359, "message": "Esto me recuerda a cuando estaba trabajando para una aseguradora, ya que ahí o creabamos todo o no hacíamos nada aunque luego no lo implementaran de la forma correcta.\n\nPara la arquitectura, desde los casos de uso hasta la representación en clases uso Enterprise Architect, no eh encontrado en Mac/Linux algo que lo iguale, ya que terminaste los diagramas, este te genera el código base o arqueotipo que utilizaras para tu aplicación.\n\nPara UI al igual que los demás Balsamiq y aveces Napkee para mostrar como seria el proyecto en estado de prototipo.\n\nAlgo aún mejor que eso es lapiz y papel, más rapido, más economico y la experiencia de usuario es inigualable!", "group_id": 965, "id": 781379}, {"user_id": 2946, "stars": [], "topic_id": 20808, "date_created": 1303494757.4156411, "message": "@reymundolopez depende, si necesitas colaborar remotamente o hacer una presentación con tus mockups, la experiencia de usuario del lapiz y papel es horrible. Aunque la culpa es de los escáners, que siguen siendo tan shitties y lentos como hace 15 años.", "group_id": 965, "id": 783490}, {"user_id": 19938, "stars": [], "topic_id": 20808, "date_created": 1303519253.1615829, "message": "@mauropm puedes explicar un poco mejor qué es lo que quieres? quieres hacer un diagrama para uso interno mientras planeas hacer un API? o ya tienes el API y quieres hacer documentación para que la vean los que la van a consumir?", "group_id": 965, "id": 786339}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598530.125833, "message": "En general quiero algo como Prezzi: Que pongo una imagen \"grande\", con los componentes principales de la aplicación y si das click en cada uno, hace un \"zoom\" lógico a los detalles asociados de la parte que se dió click, digamos, que vaya  a hacer un zoom a los pantallazos de mi aplicación móvil, describiendo en cada espacio cual es la funcionalidad.", "group_id": 965, "id": 791723}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598679.192888, "message": "@nRikeDiaz tengo balsamiq, me encanta y le encanta en general a ingenieria, pero no es tan sexy con el cliente :D", "group_id": 965, "id": 791751}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598554.3031261, "message": "@AbeEstrada quiero diagramar por un lado para ordenar mis ideas, por otro para documentar el proceso de arquitectura.", "group_id": 965, "id": 791724}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598602.1403019, "message": "@nRikeDiaz Si, también creo que los wireframes pueden ser una megaayuda. Para lo de webservice quiero ver los componentes (digamos los webservers, la base de datos, con la metainformación de la api ahi a la mano). Creo que lo que quiero no existe jajaj", "group_id": 965, "id": 791729}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598703.6339951, "message": "@fitorec yo use dia mucho tiempo para diagramar bases de datos, me gusta mucho, pero queria algo como que más fancy", "group_id": 965, "id": 791756}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598644.680218, "message": "@dsch Si, pluma + papel + postits para detalles conceptuales y detalles asociados a componentes", "group_id": 965, "id": 791737}, {"user_id": 26105, "stars": [], "topic_id": 20808, "date_created": 1303598660.472296, "message": "@soska ahora mismo lo estoy buscando para bajarlo :D gracias!", "group_id": 965, "id": 791742}]