[{"user_id": 34431, "stars": [], "topic_id": 37252, "date_created": 1306670486.4742031, "message": "I started python because I wanted to use Django. This is less then ideal and unfortunate as in the beginning I assumed that the python functionality I was seeing in Django was infact Django functionality. I already knew C,C++, Java etc. so it wasn't a problem picking it up but I feel that, while I know how to program using python, I don't know program in python! What's a good way to really get into all of Python's features?", "group_id": 292, "id": 1217042}, {"user_id": 13403, "stars": [{"date_created": 1306684314.2448671, "user_id": 13817}], "topic_id": 37252, "date_created": 1306670703.1874001, "message": "Dive Into Python <http://diveintopython.org/> is a great way to familiarise yourself with the language’s features and give yourself an idea of what it means for code to be Pythonic.", "group_id": 292, "id": 1217064}, {"user_id": 3354, "stars": [{"date_created": 1306891701.679635, "user_id": 8391}], "topic_id": 37252, "date_created": 1306754519.5951879, "message": "There's also Zed Shaw's \"Learning Python the Hard Way\", and loads of material on the web. http://tutorial.python.org/ might be a little on the simple side.", "group_id": 292, "id": 1226326}, {"user_id": 20326, "stars": [], "topic_id": 37252, "date_created": 1306848168.609385, "message": "@pastylegs Perhaps you should go over the official tutorial http://docs.python.org/tut -- it covers most of the features you need for normal programming in Python which may help you to delineate between Python features and stuff in Django.\n\nI suspect with your background Dive Into Python and Learn Python The Hard Way would ultimately be a waste of time for you. LPTHW stays pretty basic and is really intended for new programmers. DIP does get a little more advanced, but I really don't think it's an especially great resource; it targets less-relevant versions of Python and has a lot of ugly examples and inaccurate statements. If you insist on a book, you might check out http://www.greenteapress.com/thinkpython/thinkpython.html", "group_id": 292, "id": 1237334}, {"user_id": 18123, "stars": [], "topic_id": 37252, "date_created": 1306934577.353632, "message": "... but you learn all the important details you missed the first time.", "group_id": 292, "id": 1252973}, {"user_id": 18123, "stars": [{"date_created": 1307011884.6845441, "user_id": 5942}, {"date_created": 1308823256.165736, "user_id": 12963}], "topic_id": 37252, "date_created": 1306934439.845952, "message": "\"Beginning Python from novice to professional\", chapters 1-11. The first two chapters might seem basic", "group_id": 292, "id": 1252956}]