[{"user_id": 21246, "stars": [], "topic_id": 12845, "date_created": 1300039790.7415321, "message": "Governor Tom Corbett today fulfilled his friendly Super Bowl wager \nwith Wisconsin Governor Scott Walker while helping to deliver a $25,000 check on \nbehalf of Coca-Cola to the Boys and Girls Clubs of Western Pennsylvania and the \nSarah Heinz House Boys & Girls Club.  \n \nBecause the Steelers lost the Super Bowl to the Packers, Gov. Corbett, a lifelong \nSteelers fan, appeared at the check presentation wearing a Green Bay jersey. \n \n“I’m here today to pay off a bet. I promise you: this is the only time you’re going to \nsee me in a Packers jersey,” said Corbett. “But the governor of Wisconsin and I \nmade a bet, and when you make a bet you have to keep your word.” \n \n“Although my beloved Steelers lost the Super Bowl, I’m happy to turn that loss into \na win for the children of the Pittsburgh region who are served by the Boys and Girls \nClubs of Western Pennsylvania and the Sarah Heinz House Boys & Girls Club,” \nCorbett added. \n \nThe money was donated through the nationwide “Coke Cheers” promotion. The \npromotion raised funds for Boys & Girls Clubs of America (BGCA) to support Triple \nPlay, a national program created by BGCA and Coca-Cola to help kids eat healthier \nand become more physically active. \n \nThe ceremony was held at the Sarah Heinz House in Pittsburgh. It was established \nby Howard Heinz, the son of HJ Heinz, in 1901. It later became one of the first \nmembers of the national Boys and Girls Clubs of America.  \n \nGov. Corbett already fulfilled the first half of his wager with Gov. Walker by sending \nhim a basket of Pennsylvania-made products. The basket contained PA Preferred \nproducts ranging from apples and honey to Eat’n Park Smiley Face Cookies, Penn \nPilsner Beer, Sarris Candies and Heinz Ketchup. It was sent the week after the \nSuper Bowl in February. ", "group_id": 6708, "id": 342123}, {"user_id": 21246, "stars": [], "topic_id": 12845, "date_created": 1300143474.8182051, "message": "Kent Courtney Live - We'll be doing Civil War and Irish Music at 17 On The Square in Gettysburg, PA, this Friday (5:30 - 7:00) and Saturday (11am - 4pm).  17 Lincoln Sq # 1\nGettysburg, PA 17325-2200\n(717) 339-0017", "group_id": 6708, "id": 351843}, {"user_id": 21246, "stars": [], "topic_id": 12845, "date_created": 1300143620.5892069, "message": "March 10, 2011 \n \nGovernor Corbett Tours Johnstown Dairy, Talks Jobs and Economic Growth \n \nJohnstown, Cambria County – Governor Tom Corbett today toured Galliker Dairy \nCompany in Johnstown, highlighting his commitment to helping Pennsylvania’s \nlongstanding, family businesses grow by freeing them of the red tape associated \nwith state government programs. \n \n“Agriculture is our biggest industry and dairy is its biggest sector. It runs best when \nstate government gets out of the way. And it grows best when we give it the \nclimate to do so. That’s what my budget is about; keeping away from more taxes \nand freeing the private sector from red tape,” said Corbett. \n \nCorbett’s proposed budget cuts government spending by 3 percent, most of which \nis done by consolidating programs, targeting inefficiencies and reducing or \neliminating discretionary financial grants. \n \nThe budget refocuses and streamlines the state’s support of free enterprise by \nsupporting programs that will encourage economic growth and job creation, \nstreamlining a multitude of business incentive programs, awarding tax credits as \nincentives for new and creative ideas to improve business and industry, and helping \nto expedite permit reviews in the agriculture industry to speed up projects that \ncreate jobs for farmers. \n \n“This business began as the Shreve Ice Cream Company in the downtown area. It \nwas a family business then. In 1914, the Galliker family bought it and it’s still a \nfamily business,” said Corbett. “The budget I just introduced has that kind of \ncontinuity in mind. We want the Galliker Dairies of Pennsylvania to be here for our \nchildren and beyond.” \n \nLearn more about Gov. Corbett’s proposed 2011-12 budget online at www.pa.gov \nand choose the link for “Governor’s Proposed Budget.” ", "group_id": 6708, "id": 351852}]