[{"user_id": 11626, "stars": [], "topic_id": 6639, "date_created": 1297900431.8745401, "message": "Efforts to protect consumers' privacy on the Internet are likely to impact companies that collect, use or distribute geolocation data, said LeClairRyan attorney Kevin D. Pomfret, a leading advisor in the rapidly developing fields of spatial law and technology.\r\n\r\nAs a result, businesses should step forward to educate Congress and executive agencies such as the Federal Trade Commission (FTC) about the breadth and scope of location-based technologies, as well as the industry's enormous potential, Pomfret said.\r\n\r\nIn addition, the veteran attorney recommended that companies begin to identify and protect any geolocation data they collect or use that could be associated with an individual.\r\n\r\nA number of privacy-related initiatives are currently underway in Washington that attempt to address geolocation, noted Pomfret, a Richmond-based partner in LeClairRyan and executive director of the Centre for Spatial Law and Policy. For example, Rep. Bobby L. Rush's privacy protection bill, the so-called \"Best Practices Act of 2010,\" cites \"precise geolocation information\" as sensitive data subject to greater protection, and similar legislation is expected in the near future.\r\n\r\nIn addition, the FTC staff recently stated in its 123-page report, Protecting Consumer Privacy in an Era of Rapid Change, that precise geolocation information is sensitive and subject to greater protection. The Department of Commerce also issued a report in December that cites location as a privacy concern.\r\n\r\nAs noted by Pomfret, GPS location-aware smart phones and other devices already collect enormous amounts of data about where people go, who they are and what they do. The level of available detail--and potential privacy risks--will only increase with time, compounding existing concerns about such issues as \"cyber-stalking,\" Fourth Amendment privacy rights and more, he said.\r\n\r\n\"Clearly, location is becoming an increasingly important component of our daily lives,\" the attorney explained, \"and legitimate privacy concerns do exist.\"\r\n\r\nHowever, Pomfret noted, there are as many different types of location data as there are ways to collect and use the data. \"The geolocation industry must educate lawmakers and regulators about the many ways location data can be collected and used in order to create a fully informed discussion about the geolocation industry and the technology,\" he said.\r\n\r\n\"For example, should an individual's location on a public street be protected in the same way as that individual's medical records or bank-account information?\"\r\n\r\nOverly broad legislation could stymie the numerous important governmental and societal applications currently being developed based upon location. These include using location data for crisis and emergency response, public transportation and economic development, Pomfret said.\r\n\r\nIn order to fully understand how proposed regulations will affect them, geolocation companies should begin to identify what spatial data assets they have throughout their organizations and how that information is aggregated, Pomfret added.\r\n\r\n\"Increasingly, companies that do not consider themselves 'geolocation companies' have databases that connect customers, employees and vendors to a location, often at a particular time,\" he said. \"Depending upon the outcome of the current privacy discussion in Washington, such information could become subject to regulation if laws are not carefully drafted.\r\n\r\n\"While it is an exciting time for geolocation firms, with new applications and business models being developed as location technology becomes mainstream, the industry can expect greater scrutiny as it matures and becomes successful,\" Pomfret continued. \"Consequently, it is important for all segments of the industry to be both actively engaged in what is happening and prepared for potential outcomes.\"\r\n\r\nhttp://www.gpsdaily.com/reports/Privacy_Push_Will_Impact_Geolocation_Sector_999.html", "group_id": 3920, "id": 126724}, {"user_id": 12462, "stars": [], "topic_id": 6639, "date_created": 1297903415.9603529, "message": "test", "group_id": 3920, "id": 127584}]