[{"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1300914404.9144509, "message": "I really want to start a blog about electronic music, but it isn't clear to me how I could turn it into a money generating business until it becomes a trusted source for electronic music news....", "group_id": 250, "id": 420846}, {"user_id": 14070, "stars": [], "topic_id": 14806, "date_created": 1300915469.354948, "message": "Yes it is worth it ! Definitely ! To me, there is no place for a business plan within a blog. For a specialized magazine yes, but it's not your case right now", "group_id": 250, "id": 421094}, {"user_id": 224, "stars": [], "topic_id": 14806, "date_created": 1300914797.5180309, "message": "@pskulte yes", "group_id": 250, "id": 420952}, {"user_id": 14142, "stars": [], "topic_id": 14806, "date_created": 1300916661.63574, "message": "Go for it! If you have the time to invest into building a blog then go for it. Kyanainsweden", "group_id": 250, "id": 421250}, {"user_id": 24307, "stars": [], "topic_id": 14806, "date_created": 1300919802.7085731, "message": "A journey of a thousand miles begins with the first step (or so \"they\" say). I recommend starting off with your passion, build an audience who digs the same music, engage the community, ask them what they'd like to see/experience at your blog, and it may reveal to you the path/s to revenue for your venture.", "group_id": 250, "id": 421431}, {"user_id": 14070, "stars": [], "topic_id": 14806, "date_created": 1300921895.9128511, "message": "And don't forget to share your blog URL, there might be some electro aficionados in here", "group_id": 250, "id": 421691}, {"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1300921656.2276199, "message": "Thanks for the responses. That was exactly what I was thinking. I figured the revenue part would just fall into place in the future.", "group_id": 250, "id": 421667}, {"user_id": 9321, "stars": [], "topic_id": 14806, "date_created": 1300921886.144464, "message": "I would say just go and start your blog. Right now! Just go and do it. Head over to wordpress or blogger or something and start. You will have it up and running in less than 10 minutes and you can start writing. Then as you go you will figure out the types of things you want to write about, or the things you want to include on the site, and then you will find ways to integrate them. Eventually you will figure out some aspect of the site that could actually make some $$.", "group_id": 250, "id": 421687}, {"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1300925409.50881, "message": "Yea last night I bought drum-love.com. I figured it would be a good name because I will mainly blog about drum&bass, dubstep, and break beat which are all pretty drum (and bass) heavy electronic generes. What do you guys think of the name? Btw if you go to the site now there obviously is nothing, but a crappy graphic I put up quick last night.", "group_id": 250, "id": 422006}, {"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1300939315.3849659, "message": "So I have a website somewhat up...its at least looking how I want it. Not much content, but what does everyone think? http://www.drum-love.com/", "group_id": 250, "id": 423911}, {"user_id": 11405, "stars": [], "topic_id": 14806, "date_created": 1300949393.0009129, "message": "Hey nice one! Start off with linking to great tracks, get a facebook page and a twitter account. Promote your site at other blogs, forums about electronic music, maybe a subreddit if existing. After you got some followers and an audience, try to add interviews with artists from the szene and there you are: Generating unique and quality content.", "group_id": 250, "id": 424469}, {"user_id": 8285, "stars": [], "topic_id": 14806, "date_created": 1300960866.8169301, "message": "To be honest, I really doubt there is much revenue to be made with a blog like that - just look at Hype Machine (http://hypem.com), there's literally thousands of blogs exactly like yours. If you do manage to get a sizeable readership though, you might be able to start thinking about revenue then - but the way it stands now, you're one amongst millions. With enough perseverance you might be able to make it though - don't let this turn you off!", "group_id": 250, "id": 425367}, {"user_id": 23644, "stars": [], "topic_id": 14806, "date_created": 1300970002.5294089, "message": "Starting a blog is dirt cheap so go for it. You won't be able to earn much income until you have a big reader base anyways. You can use that time to discover what subjects haul in the most viewers, etc... I am in the middle of this adventure right now.", "group_id": 250, "id": 426087}, {"user_id": 22845, "stars": [{"date_created": 1301026720.9795229, "user_id": 11405}, {"date_created": 1301067847.9468851, "user_id": 9321}], "topic_id": 14806, "date_created": 1300973088.129746, "message": "Whatever you do, don't let it smell like a potential revenue stream. Let it feel like a passion. Otherwise folk'll be turned off before you're even off the ground!", "group_id": 250, "id": 426530}, {"user_id": 9321, "stars": [], "topic_id": 14806, "date_created": 1300979815.5919769, "message": "@pskulte see - a few hours and you already have what is shaping up to be a great site. If you keep posting quality content on a very regular basis, you will probably eventually attract your audience. You might be able to turn it into a revenue stream in very subtle ways (link out to music purchases, concert tickets, club events, etc...)", "group_id": 250, "id": 427650}, {"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1300998974.826699, "message": "@lachenmayer I agree I don't think there is much money in it either, but I read and listen to so much music and my friends all come to me for new music. Makes me feel like I have a small chance of making something happen.", "group_id": 250, "id": 430778}, {"user_id": 24837, "stars": [{"date_created": 1301121543.6598859, "user_id": 11405}], "topic_id": 14806, "date_created": 1301080719.4652879, "message": "I'm all for going lean like this.  Your risk in minimal -- for the time being you really only stand to lose your time, and you are the best judge of your time's value.  As has been pointed out, your only potential differentiator is probably passion.  When you start to feel that you have a product (not just a feature or features), talk to your (potential) customers, and then start to think business models, and *then* business plans.", "group_id": 250, "id": 441612}, {"user_id": 24837, "stars": [], "topic_id": 14806, "date_created": 1301080743.860975, "message": "Or, more briefly:  go for it.", "group_id": 250, "id": 441622}, {"user_id": 25435, "stars": [], "topic_id": 14806, "date_created": 1301144205.025862, "message": "I would make sure your writing it because you love it vs hoping for a big payday. If not you will quickly tire of it and stop posting. But if you love it, like Gary V says, Crush it and the money will come.", "group_id": 250, "id": 446041}, {"user_id": 21746, "stars": [], "topic_id": 14806, "date_created": 1301241931.3019509, "message": "Like", "group_id": 250, "id": 451785}, {"user_id": 24254, "stars": [], "topic_id": 14806, "date_created": 1301287629.3307819, "message": "Just an update for all of you participating in this topic: I took a stab at it and also got another friend on board running the sister site mo-love.com. I secured an interview with a producer/dj who will be referring all of his followers and fans to my site. It's great to see my passion turn into something. Thanks for the support!", "group_id": 250, "id": 455106}]