[{"user_id": 15941, "stars": [], "topic_id": 9041, "date_created": 1298643325.4388011, "message": "d) vision.  I don't immediately take to a photographer per se, but first to a photograph, especially one that expresses a vision of a scene different from what I expect.  If I then find that the same photographer repeatedly surprises me with photographs that resonate in this way, then I begin to value that photographer.  And I don't think that's necessarily (b) passion or (c) intuition, although it must include a certain (a) technical skill.  This 'vision' I speak of is an ability to see, to visualize an image within a scene that which others do not see, and to bring that image into the fore so that all may see, if they look.  I'll admit,however, that my 'vision' may be something similar to what you suggested with your words passion and intuition.", "group_id": 5123, "id": 207933}, {"user_id": 15928, "stars": [], "topic_id": 9041, "date_created": 1298760622.6060939, "message": "@bitfool great distinction. Vision is critical. I often call it creative eye, a way of seeing, anticipating and composing prior to pressing the shutter. Thank you!", "group_id": 5123, "id": 215934}, {"user_id": 19003, "stars": [], "topic_id": 9041, "date_created": 1299362135.8541751, "message": "I'd say intuition but this is not really the term I have in mind. Creativity or as bitfool likes to refer to as vision. I say creativity because the images that I have done and were the most rewarding, were scene created right in my head and then transposed in the reality. The feeling of accomplishment is generates when the reality matches what you had in mind, is a feeling that can't be beat. Of course it requires technical skills and a lot of passion. But passion and technique don't warrant creativity...", "group_id": 5123, "id": 277772}, {"user_id": 9391, "stars": [], "topic_id": 9041, "date_created": 1299393171.23225, "message": "I think that if you're passionate and have a 'good eye' or intuition for the most part you'll become a skillful photographer. People are often surprised of how well I capture certain photos, and although I know I'm not a pro, I feel I do have that intuition for capturing detail and beauty, moment by moment. Even without a lot of sophisticated gear and indepth knowledge I can take some beautiful shots.", "group_id": 5123, "id": 278832}, {"user_id": 22185, "stars": [], "topic_id": 9041, "date_created": 1300332459.7014761, "message": "i just clicked this because you looked hot. im not going to lie. do you like it in the butt?", "group_id": 5123, "id": 371259}]