[{"user_id": 29596, "stars": [{"date_created": 1303144984.6494689, "user_id": 20118}], "topic_id": 19987, "date_created": 1303068303.4247041, "message": "We tried some tactics in getting people to sign up for our soon to be launched product and was surprised by how well one of the tactics increased the conversion rate of our landing page and so we thought we share our tactic with the HN community. \n\nhttp://news.ycombinator.com/item?id=2456756", "group_id": 95, "id": 718158}, {"user_id": 4060, "stars": [], "topic_id": 19987, "date_created": 1303080167.397089, "message": "looks like your tactic backfired :)", "group_id": 95, "id": 719321}, {"user_id": 4149, "stars": [], "topic_id": 19987, "date_created": 1303080272.9422431, "message": "if you just want sign up, instead of making a great product that people want to sign up for then your company should be ashamed", "group_id": 95, "id": 719341}, {"user_id": 20118, "stars": [], "topic_id": 19987, "date_created": 1303083729.9189091, "message": "@italiano40 I don't quite understand what you are saying but maybe linking to the blog post is much clearer. What I'm trying to share is how we offered the chance to win a premium if users sign up at the landing page helped http://blog.appdk.com/how-i-increase-sign-ups-by-500", "group_id": 95, "id": 719707}, {"user_id": 20118, "stars": [], "topic_id": 19987, "date_created": 1303083483.238914, "message": "@myke how so? We got a lot more sign ups than we had anticipated", "group_id": 95, "id": 719690}, {"user_id": 29596, "stars": [], "topic_id": 19987, "date_created": 1303084569.66661, "message": "@mkye contrary to HN's reaction, what we had wanted to share got a different reaction, a nicer and less flaming,  http://backtweets.com/search?q=blog.appdk.com%2Fhow-i-increase-sign-ups-by-500&ref=p1", "group_id": 95, "id": 719763}, {"user_id": 4149, "stars": [], "topic_id": 19987, "date_created": 1303085983.193753, "message": "@appdk also tweets i never take serious unless i know the person so that doesn't really help your case", "group_id": 95, "id": 719866}, {"user_id": 4149, "stars": [], "topic_id": 19987, "date_created": 1303085947.9058101, "message": "@gph first off that isn't a line of code, that is a wording of a sentence and second that is kinda tricking a user, your main focus is to make a product and release it, not to figure out how to get users to sign up, you guys need to think about what you really want for you company then being know as *spammers* which your already known as, i am an iOS dev and probably will not being looking at your product just due to that reason", "group_id": 95, "id": 719864}, {"user_id": 29596, "stars": [], "topic_id": 19987, "date_created": 1303088652.2514601, "message": "@italiano40 \"is kinda tricking a user\" We're not tricking the user to sign up. We are giving early beta testers a chance to get a free premium account in return for their participation, and these early beta tester will help make the product better. I don't know why you would think we are only out to spam the users that signed up.", "group_id": 95, "id": 720043}, {"user_id": 4060, "stars": [], "topic_id": 19987, "date_created": 1303098525.0933609, "message": "way too many links to click through and words to read..  what exactly was the line of code changed that increased signups 500%?", "group_id": 95, "id": 721644}, {"user_id": 24097, "stars": [], "topic_id": 19987, "date_created": 1303134179.3324389, "message": "i dont think you guys understand what appdk did. Most people like free stuff, i know i do! and if you give them the opportunity to try something for free, they'll take it. appdk, from what i understand is just leveraging that quintessential feeling of a good deal to drive sign ups. Naturally it would take more than the number of signups for it to succeed but its a good place to start. If the product is good, then more people would come in.", "group_id": 95, "id": 726273}, {"user_id": 20118, "stars": [], "topic_id": 19987, "date_created": 1303144943.8644459, "message": "@jimisir I'm glad you understand what I'm conveying here. I see many startups having a vanilla sign me up landing page and what we wanted to share is if you just do a little more like what we did here, you'll see better conversions.", "group_id": 95, "id": 727914}, {"user_id": 24097, "stars": [], "topic_id": 19987, "date_created": 1303146591.0429051, "message": "@gph yeah. Hopefully you can remove the stigma this misunderstanding has caused. Goodluck'", "group_id": 95, "id": 728336}]