[{"user_id": 16229, "stars": [], "topic_id": 33416, "date_created": 1304439589.770113, "message": "Hola a todos, ya tenemos nuestro portal de la #brigadadigital en versión Beta, les parece si la vamos mejorando con las sugerencias de todos?? Ideas?? :)  ->> http://bit.ly/brigadadigital", "group_id": 2696, "id": 899964}, {"user_id": 14259, "stars": [], "topic_id": 33416, "date_created": 1304547583.3735189, "message": "También creo que hace falta decir para que sirve registrarse en #brigadadigital. Además, de la invitación debería mencionarse el para que y cuales son los beneficios. De igual forma, debería permitirse registrarse con las credenciales de twitter / facebook", "group_id": 2696, "id": 920761}, {"user_id": 14259, "stars": [], "topic_id": 33416, "date_created": 1304547462.4455719, "message": "Creo que debería ponerse un enlace/banner que redireccione a Convore, esto es algo así como el foro de #brigadadigital y seria bueno destacarlo.", "group_id": 2696, "id": 920740}, {"user_id": 14259, "stars": [], "topic_id": 33416, "date_created": 1304547931.2277689, "message": "Por ultimo,  creo que el escudo de Colombia además de no verse bien, va en contravia con el manual  de identidad corporativa del Gobierno Colombiano. Estas serían las primeras sugerencias que tendría. Saludos", "group_id": 2696, "id": 920828}, {"user_id": 16229, "stars": [], "topic_id": 33416, "date_created": 1304562482.831424, "message": "Nico tienes razón en los dos iniciales. Lo último está acorde con manual de imagen de Ministerio TIC ;) Tomando nota!!!", "group_id": 2696, "id": 922911}, {"user_id": 26132, "stars": [], "topic_id": 33416, "date_created": 1304597065.4302571, "message": "Ah quedó muy chévere el diseño Claudia,tengo las siguiente pregunta : Veo que no se ha consolidado el escuadrón de innovación educativa, se piensa hacer a futuro?", "group_id": 2696, "id": 927810}, {"user_id": 21732, "stars": [], "topic_id": 33416, "date_created": 1304603020.319777, "message": "Me parece buena la idea de registrarse con la cuenta Twitter y no desligarse de los inicios", "group_id": 2696, "id": 929031}, {"user_id": 26153, "stars": [], "topic_id": 33416, "date_created": 1304784078.0157111, "message": "Insisto, el mapa del Beta de la #Brigadadigital debe ser en Open Street Map", "group_id": 2696, "id": 951350}, {"user_id": 13447, "stars": [], "topic_id": 33416, "date_created": 1304980857.6234961, "message": "Muy bacano el portal y estoy de acuerdo que se debe permitir registrarse con la cuenta de Twitter", "group_id": 2696, "id": 979587}, {"user_id": 19193, "stars": [], "topic_id": 33416, "date_created": 1306096015.7207091, "message": "Hola a todos!! Claudia el portal web esta quedando muy interesante.., yo tengo una pregunta relacionada con el portal, y es como se integra a http://pio.la/platforms/brigadadigital/ creo que me confundí,,  me toco crear otra cuenta en esa plataforma,,. sería bueno que todo se amarrara a un solo registro (apoyo que sea el de la cuenta de twitter) y mejor si estan todos los portales enlazados para evitar duplicacion de información. de igual forma brinda mas claridad a quienes empiezan a involcrarse  :D saludos  y felicitaciones por el trabajo", "group_id": 2696, "id": 1143868}]