[{"user_id": 13919, "stars": [], "topic_id": 43916, "date_created": 1313536429.4667301, "message": "@RyanOnRails One option is to fork the gem on GitHub, make your changes and submit them as a pull request. If it appears that the repo is abandoned you may want to fork from an active fork instead. Once you've a repo you can use Bundler supports retrieving gems directly from a GitHub repo. Checkout http://gembundler.com/git.html for the details.", "group_id": 4606, "id": 1887254}, {"user_id": 22052, "stars": [], "topic_id": 43916, "date_created": 1313535918.7756901, "message": "Oh awesome. Convore is being stupid again (I typed that in word). Hit \"wrap text\" top right for  a better view.", "group_id": 4606, "id": 1887203}, {"user_id": 22052, "stars": [], "topic_id": 43916, "date_created": 1313535880.7950809, "message": "I've been spending quite a bit of time trying to integrate Microsoft's web services (from many products, SharePoint, CRM, SSRS etc.) and I keep hitting ridiculous issues with gems.  Sometimes it’s from 1 gem being updated and another not being updated. Other times it’s from gems that don’t have https support. To top it all off I notice that some of the gems have pull requests that the owner isn’t pulling. \n\nSo I’m at the point where I’ve basically had to hack away at the gems to get them to work. If I ever did a pull I’d nuke all my changes and be back at square 1 (I’ve backed up my changes, but I don’t want to go edit my gems every time I update). I COULD just keep local copies, but I feel that defeats the purpose of gems.\n\nI recently pulled an item (activesp) which seemed to have many versions of custom gems:\nFetching: xaop-ntlm-http-0.1.1.2.gem (100%)\nFetching: savon-xaop-0.7.2.7.gem (100%)\nFetching: activesp-0.1.0.gem (100%)\nsavon and ntml have “official gems” but “xoap” looked to be in the same position as me and had to make modifications and just create their own gems. I’d do this also, but it seems like it’s just going to dirty up the gem pool.\n\nI can’t really think of a solution other than what “xoap” did. What do you guys do at work? Or for personal projects?\n", "group_id": 4606, "id": 1887197}, {"user_id": 21844, "stars": [], "topic_id": 43916, "date_created": 1313549509.8925741, "message": "@MarkBennett is right on, taking gems right out of github projects can get you the precision you need. Here's an example from a Rails project Gemfile https://gist.github.com/1150707#L50 . I had to lock activerecord-oracle_enhanced-adapter down to a specific git commit to boot which you can do. Or you can target a branch: https://gist.github.com/1150707#L62 .", "group_id": 4606, "id": 1888723}, {"user_id": 21844, "stars": [], "topic_id": 43916, "date_created": 1313549583.6829021, "message": "Just make sure to `bundle install` then commit your Gemfile.lock along with the project. That file will have the specific version of everything in a running state. Theoretically, no more guessing when you bring it to another machine. Then again, I hear you sometimes use Windows... Haha, how could I resist?", "group_id": 4606, "id": 1888735}, {"user_id": 21844, "stars": [{"date_created": 1313551935.0218141, "user_id": 22052}], "topic_id": 43916, "date_created": 1313549607.1761351, "message": "Oh, and p.s. I knew this was your topic as soon as I read the name ;)", "group_id": 4606, "id": 1888740}, {"user_id": 22052, "stars": [], "topic_id": 43916, "date_created": 1313551887.3746829, "message": "That is ridiculously badass. I didn't realize you could point bundler directly towards a github repo. Well this opens many doors.... Specially since I've been downloading branches into a directory and then referencing them directly (via irb with './gem/lib/gem').", "group_id": 4606, "id": 1889131}, {"user_id": 22052, "stars": [], "topic_id": 43916, "date_created": 1313551924.815429, "message": "This is why I love yegrb. Thanks for the link Mark and the great gists fletcher.", "group_id": 4606, "id": 1889141}, {"user_id": 21844, "stars": [], "topic_id": 43916, "date_created": 1313552163.2601831, "message": "<3 <3 <3 to yegrb :)", "group_id": 4606, "id": 1889203}]