[{"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1317888176.540287, "message": "If someone went through the Dramatica story development process and came out with a 4-act plan for their story, but the material related to act one seemed rather boring and lacking in action or conflict, what did the person do wrong or how could this be fixed?", "group_id": 2515, "id": 2290550}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1317900505.7745831, "message": "Please list here all the dynamics or story points of said act one.", "group_id": 2515, "id": 2291123}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317913097.7476189, "message": "That question is so vague that I don't think it could be answered.", "group_id": 2515, "id": 2292163}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1317917140.8152699, "message": "@MikeDerk - I've previously seen people give general tips for \"Fixing a boring or saggy story segment\", so I figured there was probably a Dramatica equivalent.  At any rate I will list more info.", "group_id": 2515, "id": 2292640}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1317917876.444524, "message": "@sam_potter Here is some info, please let me know if I forget any piece of information you think is important. :)\n\nOS: Situation - Signpost 1: How Things Are Changing\nMC/IC: Fixed Attitude - Signpost 1: Impulsive Responses\nMC: Activity - Signpost 1: Gathering Information\nIC: Manipulation - Signpost 1: Conceiving An Idea\n\nMC Dynamics: Steadfast* Stop Do-er, Logical\nOS Dynamics: Action Optionlock Success Good\n\n* means the story engine required this to be there but I'm not sure it actually fits the story I want to tell.  Fortunately I don't think the MC's resolve really shows up in Act 1.", "group_id": 2515, "id": 2292724}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1317920263.4539261, "message": "Story-wise, what is happening in Act 1 is that the two groups of people have migrated (fled) from elsewhere and are trying to re-establish their societies in a new place.  The social climate is that everyone feels nervous about their new neighbors, the fact that in this transition they are losing traditions, and the uncertainty of the future.  In the face of uncertainty people's impulsive response is to be stubborn, isolationist, and defensive, tense with fear and tempted to convert that fear into anger.  Meanwhile the MC is a man who is working closely with the other race for the first time, specifically with a pretty young woman of the other race (the IC); he does not at first know what to make of her but can't help finding her very interesting.  She meanwhile is looking at the problem of the tense situation which is not headed for improvement because people are being closed and defensive; she is starting to conceive the idea that she can and should do something to fix this.  So, perhaps that makes clear the  problem that nothing is really happening here.  If it were a horror story it would be that part where everyone is waiting nervously to see if anything a monster appears or they are just imagining things and there is no monster.", "group_id": 2515, "id": 2293010}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317920978.292902, "message": "I'm sure there is some sort of Dramatica equivalent, but it could fall into Storyweaving or Story Encoding. (Forgive me if I don't have those terms down correctly. What I mean is this:)", "group_id": 2515, "id": 2293101}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317921263.253829, "message": "The way to solve the problem could be to:\n* Arrange the elements to make them more dramatic.\n* Chose more dramatic ways to encode your story.\n\nThe problem with that answer is that the ways to do that are infinite.\n\nIs it more dramatic to show a family wake up in a bedroom with the house on fire, or to show a mother stumble out of a burning house and worry about where her children are?\n\nIs it more vital to show the fire started because the overworked father fell asleep at the table with a candle burning, because now we know this family has a tradition of hard work, and that sometimes it backfires? Or does the fire start because they are using a \"foreign\" technology that will foreshadow problems of mixing races?", "group_id": 2515, "id": 2293120}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317921476.706995, "message": "I think it's telling that you don't list the OS or MC Problem.\n\nThe story is about dealing with that problem.\n\nIf you aren't focused on putting that problem and it's fallout (symptom, response, and more) front and center, then I think you aren't thinking about telling the story in the right way.\n\nThis is a sin I used to do all the time. \"Let's meet the people. Let's find out what they want. Then, I'll interfere with it.\" The result is many many many boring scripts. I would work on making these people so interesting. On their relationships. It never panned out.\n\nThe story is about the problem.", "group_id": 2515, "id": 2293136}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317921589.5586669, "message": "I'll share a piece of advice that I got from another blog: have your Protagonist* solve a problem 5 times in the first ten pages.\n\nThat's ten script pages, btw, not prose.\n\nThat is how vital the Problem is.\n\n(*Protagonist most surely means MC/Protagonist in this context.)", "group_id": 2515, "id": 2293145}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1317924811.8077819, "message": "That's an interesting take on problem/symptom/etc.  In the Instant Dramatica applet these are all assigned to the second half of the story (symptom/response in act 3 and problem/solution in act 4).  It does logical to put symptom in Act 1, although I don't know about the rest of it.  However, the s/r/p/s terms mostly aren't things I'd consider to add action to a story.  In this case the MC symptom and response are Feeling and Thought (which I think is backwards but oh well).  Both Feeling and thought are rather quiet semi-passive things for the MC to be doing.  The IC has Avoidance and Pursuit, that's a bit more active, but basically she is running around trying to make friends and getting snubbed except by the MC, so it's still not particularly dramatic action.  The OS and MC/IC both have Consider and Reconsider, which seems like appropriate content for introspection and dialogue but again not really related to actions.\n\nI do think it might be an issue of choosing more dramatic encoding and arrangement, which is a very open-ended topic.  In general I have difficulty brainstorming character actions which are dramatic yet appropriate to the story (that's the problem with a house fire, it doesn't fit the story).  There are logical things for the characters to be doing in act one, but they are boring things like taking inventory of supplies, packing clothes and food, loading crap onto transports, saying goodbye to a family member, having a planning meeting, getting job assignments from a leader, starting to travel through the desert, etc.", "group_id": 2515, "id": 2293494}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317926143.4297111, "message": "A woman goes on a date with a dark and sexy guy because she is drawn to him. (Feeling.)\nShe has no idea that he is a vampire. And that is the drama, right there. The feeling is her problem, it leads to the drama. It is not the drama. \n\nUntil, of course, her thoughts -- I have to get out of here/I can sneak out through the larder -- are betrayed by her feelings. \"But then I'll never love again... is it better to die a vampire's prey, in love, or a chaste dowager with regrets?\" Oh, shit, look at that conflict. Drama!", "group_id": 2515, "id": 2293649}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317925893.7540901, "message": "You say that Feeling and Thought seem passive, and I just have to say, \"think about it again.\"", "group_id": 2515, "id": 2293610}, {"user_id": 7664, "stars": [], "topic_id": 46218, "date_created": 1317925824.9981821, "message": "My take on Instant Dramatica -- and I haven't spent a lot of time with it -- is that it is to help a writer make an outline that he or she can pitch. It's not meant to be an actual outline. That's why it's okay to put the problem in the back half, because it's a cheap way to represent the escalation of the story. Which is perfect for a short pitch to producers.\n\nNevertheless, the Problem is still the Problem. My wife and I are arguing about her business because it's stressful. It takes too long to have the clients get back to her, and that's frustrating, because it slows things down. But -- the real problem -- that more time with her business actually means less problem with the kids: that is always true. It is true even when we are trying to solve the symptom, the thing that seems like the real problem, the fact that clients don't get back to her.\n\nIn a pitch, I can wait until halfway through to say, \"Aha! But the real problem is this!\" But as the writer, I have to make sure that problem is true and represented  and misinterpreted right from the get go. Otherwise, I'd be lying to the audience. I'd be changing the game on them. Audiences call this \"cheating\" and they abandon you because of it.", "group_id": 2515, "id": 2293606}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1318116294.439558, "message": "Sorry it took me so long to get back to this.  Mike's thoughts were pretty much in the same direction I was going.  The reason I asked you to list the dynamics and story points for act one was so that I could hopefully illustrate there are infinite possibilities to illustrate the same act one.  As the  story teller it is up to you to make compelling promises in act one.  I am learning from Fast Screenplay system that an audience wants to get into the story as soon as possible.  You must capture their attention as soon as possible.  The opening hook needs to give your audience an immediate reason to care.\nSomething must be happening — in intimate character studies as well as in big action films — something compelling must draw the audience into your story.", "group_id": 2515, "id": 2308029}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1318116589.92471, "message": "These are some ideas I am sharing from Jeff Bollow\n\"You can start with a “rolling opening” where the action is already underway, prompting the audience to learn and fill in the gaps as they go. \n\nYou can start with a “slow opening” that merely has intriguing or fascinating things happening which put questions in the audience’s mind that they want answers to.\n\nYou can show both the protagonist and the antagonist in their different worlds, so the audience wonders what the connection is between the two.\n\nYou can shock your audience somehow, so they sit up in their seats and wonder what could possibly top that scene – and, of course, the rest of your screenplay will be just as powerful in its own way.\n\nYou can show a powerful scene from somewhere else in the movie — even the climax, if that’s appropriate for the emotional journey of the audience.\"", "group_id": 2515, "id": 2308056}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1318116889.2740669, "message": "@sunandshadow I have a question for you.  Whether my main character is a change or a steadfast character for me is one of the first things I am sure of when I think of my own stories, why did you let the program choose that for you?", "group_id": 2515, "id": 2308080}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1318119757.898284, "message": "@sam_potter (I tried posting this once, don't see it, so I'll try again.)  Thank you for responding, I was indeed curious whether you agreed with Mike. That's interesting about the types of openings. I wanted the opening to be an atmospheric type which pulls the viewer into the story world. Something like the beginning of Titanic (excluding the frame of the interview with the old woman). I really want the audience to immediately find out about the two races uneasily trying to work together on a barely livable planet; the audience needs to feel that tension even before they meet the MC, because he does not embody that tension, he is a contrast to it because he is a point of calm within the uneasy social environment.\n\nI let the program choose that because whether the main character is change or steadfast is relatively easy for me to ignore or change in exported reports or the Instant Dramatica applet. As you say, it's also something I usually know from the beginning, so I don't need the program to help me with that part. On the other hand something like the plot progression is impossible to change if I want to make any use of the PSR at all. But I actually had made about four different storyforms for this concept so I could compare what was the same between them and what was different and see which version I liked more. I chose the one which had the most correct plot progression for Act 1 since that was the topic I wanted to discuss.", "group_id": 2515, "id": 2308289}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1318123557.480895, "message": "@sunandshadow I guess I'm old school.  How can you have a proper storyform with out the basic dynamics correct? Here is a quote from Chris Huntley, \"CHARACTER: The four questions about character are about their character dynamics. Dynamics are about the relationships between things, not the things themselves. Most people do not make that distinction when thinking about structure, but it is one I think worth making. Think of dynamics as the story points that affect the flow of a story.\n\nPLOT: The same is true with the four plot dynamics questions.\n\nTHEME: The four thematic OS story points are, in fact, structural questions. Of the four, the OS Issue is the most \"theme\"-related topic.\n\nGENRE: The OS Domain (throughline) story point is the most genre-related question of the twelve essential questions. While we do not ask about the genre aspect of the OS Domain, it is directly connected to the type of Dramatica genre the story will have, e.g. Situation Comedy (Situation), Physical Comedy (Activity), Comedy of Manners (Fixed Attitude), or Comedy of Errors (Manipulation).\" http://forums.screenplay.com/viewtopic.php?f=21&t=4242#p8271", "group_id": 2515, "id": 2308567}, {"user_id": 36525, "stars": [], "topic_id": 46218, "date_created": 1318124939.5996909, "message": "@sam_potter Typically the combination of dynamics and thematics I want is not possible to have within the Dramatica program.  Possibly I do not think with the western paradigm Dramatica is intended for.  In this case any storyform would be wrong somewhere, so there is no proper story form for that story concept.  I've adapted by trying to make sure the wrongness is pushed into the areas where it will be least crippling, and I've also adapted by using more than one storyform so I can get everything right somewhere.  I agree that Dramatica's Dynamics express relationships between things.  Relationships are one of the things that come most easily to me as a writer, so they are something that I feel confident that if I get it wrong in Dramatica I can fix it later.  On the other hand plot sequence and putting the thematics into that plot sequence are difficult for me and what I want to use Dramatica to help me with.  So when I use Dramatica I find that the most functional approach for me personally is to spend my time and brainpower getting the plot sequence and thematics as right as possible for a particular story concept of mine, and let Dram do whatever it wants with the dynamics.  I've spent enough time analyzing how Dramatica generates its reports that I can look at a report with a steadfast character and say \"If the character were change instead the report would be different in these three places.\"  But what the story engine does with the thematic choices is sufficiently complicated that I would have great difficulty saying what would change if, say, the OS problem were different.", "group_id": 2515, "id": 2308676}, {"user_id": 37586, "stars": [], "topic_id": 46218, "date_created": 1318129420.8312571, "message": "@sunandshadow  :-) Very cool.  You are well beyond me.  You explain that very well.  Thank you.", "group_id": 2515, "id": 2309001}, {"user_id": 10814, "stars": [], "topic_id": 46218, "date_created": 1318262717.8860271, "message": "One thing to keep in mind when encoding a storyform is that resistance to the effort to resolve an inequity creates CONFLICT.  While not the only tool in a storyteller's toolbox, conflict is one of the major ones for keeping an audience's interest.  So, one can help a sagging or boring middle act by upping the conflict.  This happens naturally with any dynamic pair in the Dramatica model, which includes characters, themes, plots, and genre.", "group_id": 2515, "id": 2318869}, {"user_id": 39675, "stars": [], "topic_id": 46218, "date_created": 1323671648.864856, "message": "I would think \"...stubborn, isolationist, and defensive...\" would be the opposite of impulsive responses.  When I looked at the initial storyform info, I thought that impulsive responses should have been the last signpost.  Have you experimented with that?", "group_id": 2515, "id": 2740054}]