[{"user_id": 16812, "stars": [], "topic_id": 17929, "date_created": 1302211194.2710071, "message": "Just thumbing through this chapter, I can already tell the charts, graphs, illustrations, etc. are a brilliant way of conveying the message.", "group_id": 8566, "id": 580873}, {"user_id": 28067, "stars": [], "topic_id": 17929, "date_created": 1302278854.4747109, "message": "Hmm... \"We define IT governance as specifying the decision rights and accountability framework to encourage desirable behavior in using IT.  IT governance is not about making specific IT decision - management does that - but eather determines who systematically makes and contributes to those decisions.\"", "group_id": 8566, "id": 592136}, {"user_id": 28067, "stars": [], "topic_id": 17929, "date_created": 1302278872.944603, "message": "above quote - page 2", "group_id": 8566, "id": 592141}, {"user_id": 16812, "stars": [], "topic_id": 17929, "date_created": 1302279996.4234309, "message": "@bradricca \"...desirable behavior in *using* IT...\" - For me, that's key! It's like thinking about HR Governance beyond any compliance items (i.e. non-discrimination, background checking, etc.). It's about front-line staff embracing \"desirable behavior\" in practicing HR (i.e. staff development, engaging review sessions, mentoring staff, etc.). So for IT, it's about front-line staff *using* IT (recording tours in the system; providing details during member retention in the system; going to and relying on the detailed data in IT systems to make a difference in their particular area.", "group_id": 8566, "id": 592302}, {"user_id": 16812, "stars": [], "topic_id": 17929, "date_created": 1302283989.9093339, "message": "page 3 - The Houston Experience - \"Without a cohesive IT governance design, enterprises must rely on their CIOs to ameliorate problems through tactical solutions rather than position IT as a strategic asset.\" And even further, it's now been outsourced, completely relegated, for $5million over 5 years. Not positioned as an asset; viewed as liability & \"cap the loss\" mentality. :(", "group_id": 8566, "id": 593251}]