[{"user_id": 19880, "stars": [], "topic_id": 39837, "date_created": 1308540533.9376299, "message": "No one seems to be using this, so I'll try to start something a bit heated. I was in a plane looking at he skymall catalog, when I came across the Telikin (https://www.telikin.com/)", "group_id": 10471, "id": 1435386}, {"user_id": 19880, "stars": [], "topic_id": 39837, "date_created": 1308540761.7897141, "message": "They seemed to come to a very similar idea, but they lack the medical application side of it. It's Linux on a similar touchscreen device. It's simple for elderly people and keeps them communicated with others.", "group_id": 10471, "id": 1435409}, {"user_id": 19880, "stars": [], "topic_id": 39837, "date_created": 1308540784.8836, "message": "I guess I'm really asking when you're gonna be in SkyMall? ;)", "group_id": 10471, "id": 1435413}, {"user_id": 35542, "stars": [], "topic_id": 39837, "date_created": 1308566548.0819409, "message": "Joe, this is just the communication aspect of GrandCare.  The value of the GrandCare product is the three legs of the system, communication, location monitoring, and medical information.  The $799 Telikin is just a closed email and game system.  GrandCare offers two or even three-way communication with caregiver, loved one and medical personal, plus with the monitoring give peace of mind to caregiver as to location, movement and basic timed events.  Personally, I hope we never see GrandCare in the SkyMall!", "group_id": 10471, "id": 1437456}, {"user_id": 19880, "stars": [], "topic_id": 39837, "date_created": 1308627556.15873, "message": "Okay, I MAY have been trolling to get people to talk. Though I must say I did notice the similarities when I saw it.", "group_id": 10471, "id": 1445159}, {"user_id": 35533, "stars": [], "topic_id": 39837, "date_created": 1308675138.633903, "message": "HAHA - yes, telikin is quite a nifty product - - we like it!  It really isn't a competitor of ours, though, Telikin would definitely be more of a competitor of something like MyGait, which is the senior friendly, Go Computer.  Telikin offers an easy-to-use touch interface for emailing, web chatting, looking at pictures, getting emails, etc.  It doesn't have any of the monitoring (activity of telehealth) capabilities!  I think the point of Telikin is for seniors that want all aspects of a computer, but don't actually want to work a standard PC.  Yes, I don't see GrandCare in SkyMall for quite a while, since we're not really a system that you would buy off a shelf and install yourself. We are a system that needs careful consideration and assessment (determining which sensors are appropriate and setting the rules), showing the caregiver all of the capabilities for communication!", "group_id": 10471, "id": 1449882}]