[{"user_id": 6541, "stars": [], "topic_id": 13864, "date_created": 1300489303.942524, "message": "Los frameworks son como las distribuciones de linux, todos tenemos un preferido y es el mejor.  Solo conozco django y tiene rato que no escribo nada con el, pero resuelve lo que mencionas ademas de crearte el backend colocando una linea.", "group_id": 965, "id": 385822}, {"user_id": 6327, "stars": [], "topic_id": 13864, "date_created": 1300488812.0619161, "message": "He estado probando frameworks para ver cuál me gusta. Urgía algo en la chamba y lo hice con Web2py, xq me resolvía muchas cosas como usuarios y sesiones y seguridad, y la documentación era buena. Pero desde entonces he visto Web.py, Pylons, Pyramid (Pylons Project), Flask y por supuesto Django. ¿Hay alguna que prefieran?", "group_id": 965, "id": 385756}, {"user_id": 20521, "stars": [], "topic_id": 13864, "date_created": 1300489517.6035991, "message": "Yo cambie flask por webpy, ahora cambie flask por bottlepy. En lo personal me gustan mas lo micro frameworks que te dan libertad de hacer las cosas a tu modo y bottlepy me permite eso tiene lo básico para rutear y poco mas lo demás lo hago con bibliotecas de 3°.", "group_id": 965, "id": 385828}, {"user_id": 6327, "stars": [], "topic_id": 13864, "date_created": 1300491333.4640379, "message": "Ese bottle.py no lo conocía. Parece similar a Flask (aunque Flask tiene mejor designer hehe)", "group_id": 965, "id": 385960}, {"user_id": 20521, "stars": [], "topic_id": 13864, "date_created": 1300492056.1163881, "message": "Muy fea la web :P cierto y pues es mas sencillo que flask, mas micro.", "group_id": 965, "id": 385986}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500542.2052209, "message": "Yo vengo del mundo de Zope y aunque no me agrada mucho soy muy dependiente de este porque he hecho varios proyectos con Plone", "group_id": 965, "id": 386521}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500296.1085019, "message": "Muy cierta la analogía de @jyr con los FW, pero en vez de buscar el \"mejor y bonito\" (porque no lo hay) hay que buscar el mas adecuado a nuestro requerimiento de desarrollo, aunque no nos guste por completo.", "group_id": 965, "id": 386505}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300501025.6025579, "message": "micro-frameworks: si tu aplicación es pequeña e incluso la quieres desarrollar en un archivo usa estos: flask, bootle, djng", "group_id": 965, "id": 386576}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500612.8723459, "message": "Actualmente estoy haciendo un proyecto \"grande\" con Django y aunque no me convence por completo, decidí utilizarlo por la cantidad de documentación y el soporte de la comunidad que tiene y por consecuencia es mas facil capacitar a gente nueva, a pesar que Django en algunos años terminara como Zope2... feo y pesado.", "group_id": 965, "id": 386527}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500653.1193669, "message": "En resumen, si eres fan de python mi recomendación es que busques el framework adecuado a tu necesidad de desarrollo apegandote a las clasificaciones de estos:", "group_id": 965, "id": 386534}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500757.368588, "message": "Frameworks monoliticos: tienen todo lo que necesitas pero a su forma y estilo, es bueno para proyectos que inician desde cero y no mezclan muchas tecnologías web y aplicaciones de terceros. Django, Web2py, Zope2, Bluebream, etc.", "group_id": 965, "id": 386545}, {"user_id": 11639, "stars": [], "topic_id": 13864, "date_created": 1300500971.116431, "message": "Frameworks diversificados: su nombre dice mucho, prefieren reutilizar o extender que hacer forks, es fácil de integrar con multiples tecnologías, puedes hacer la misma cosa de diferentes formas y estilos, estos son buenos cuando hay que integrar diferentes proyectos ya hechos o tienes una base de datos ya creada o también para hacer proyectos desde 0 y no te gusta que te limiten o impongan la forma de hacerlo, ejemplo de estos: Pylons, Grok, Turbogears, como dato aclaratorio, Pylons Project creó Pyramid que es la unión de esfuerzos de repoze.bfg, pylons framework y turbogears", "group_id": 965, "id": 386572}, {"user_id": 6327, "stars": [], "topic_id": 13864, "date_created": 1300514873.821898, "message": "Gracias por el scoop. Entre los fw que he probado, el que más me llama es Flask. Pyramid se me hizo muy complejo con los env y los componentes como legos. En cambio, con Flask, si quiero poner cosas como auth pues añades algunas funciones y ya lo tienes sin tanto show. Además, el código termina siendo sólo Python y no clases sobre clases sobre clases.", "group_id": 965, "id": 387109}, {"user_id": 14444, "stars": [], "topic_id": 13864, "date_created": 1300515928.4946599, "message": "Flask esta bueno, pero me late mas django sobre todo por la similitud a rails", "group_id": 965, "id": 387127}, {"user_id": 20521, "stars": [], "topic_id": 13864, "date_created": 1300544848.9987071, "message": "Flask esta ganando mucha comunidad y si es posible hacer apps grandes tanto el como bottle permiten dividir tu app en varias mini apps, pero claro que el desarrollo se vuelve algo mas tardado para proyectos grandes.", "group_id": 965, "id": 388436}, {"user_id": 12133, "stars": [], "topic_id": 13864, "date_created": 1300810356.551163, "message": "yo prefiero django, esta probado no falla y hay mucha gente que lo soporta ademas de ser el mas popular encuentras miles de problemas resueltos. Ademas cientos de apps de engrane www.djangopackages.com", "group_id": 965, "id": 408749}, {"user_id": 11647, "stars": [], "topic_id": 13864, "date_created": 1301100748.8715601, "message": "Flask es muy similar a Sinatra en Ruby, te provee lo mínimo necesario para que trabajes (Manejo muy básico de URLs y Templates) lo cual es excelente para proyectos pequeños, pero aunque es muy minimalista tiene dependencias mayores a Pyramid y por su arquitectura hay mucho parametros que se quedan entrerrados en las dependencias.", "group_id": 965, "id": 443700}, {"user_id": 11647, "stars": [], "topic_id": 13864, "date_created": 1301100580.1911211, "message": "De los que he usado y recomiendo: Django para apps que contienen una gran cantidad de logica de negocio (tan solo por el orm vale la pena) y no tienen necesidad de manejar demasiados qps (los templates son medio lentos, se pueden optimizar pero eso transforma tu Django en algo custom).", "group_id": 965, "id": 443687}, {"user_id": 11647, "stars": [], "topic_id": 13864, "date_created": 1301100779.5026779, "message": "En general, recomiendo comenzar con Django porque por mucho tiene una comunidad más madura, excelente documentación y muy buenos tutoriales.", "group_id": 965, "id": 443702}, {"user_id": 11647, "stars": [], "topic_id": 13864, "date_created": 1301100617.5800669, "message": "Pylons/Pyramid/Repoze para apps con lógica sencilla pero que requieren latencia muy baja y que se benefician de que tu escribas tu propia lógica para manejo de bases de datos (Aquí los templates son súper rápidos -dependiendo del engine que uses claro- pero no hay ninguna clase para bases de datos). El tiempo de setup es mayor a Django ya que requiere que configures tu stack completo (Entrutamiento de URLs, bases de datos, etc..)", "group_id": 965, "id": 443688}, {"user_id": 6227, "stars": [], "topic_id": 13864, "date_created": 1301102829.2643001, "message": "pylons (framework no el proyecto) fue mi default por mucho tiempo pero estoy un poco decepcionado por las decisiones recientes con respecto a repoze y el merge, siento que pueden estar queriendo abarcar mucho, convertirse en un framework todólogo, pero bien pueden ser solo prejuicios mios, no he tenido chance de ver como anda pyramid en realidad. por cierto, el que quería algo similar a rails (menos active record) creo vendría siendo pylons (el descontinuado) no django, la estructura de los apps y el sistema de routing (routes) eran originalmente una reimplementación de los de rails en python y siguen estando bastante similares.  Recientemente he empezado a usar más werkzeug/flask, me gusta mucho como te permite comenzar el desarrollo desde un solo archivo py y desprender el modelo y diferentes modulos conforme va creciendo el código (junto con mi comprensión de lo que necesito programar), es decir creo se presta mucho para lo que llaman \"exploratory programming\".", "group_id": 965, "id": 443826}, {"user_id": 12423, "stars": [], "topic_id": 13864, "date_created": 1301330751.0838709, "message": "Pues pyramid esta muy muy bien, y en realidad no creo que quieran abarcar mucho... en realidad no es un merge... es basicamente repoze.bfg con un nombre nuevo.\nY la idea de repoze.bfg es ser un framework minimalista, y pyramid lo sigue siendo... \n\nFlask suena interesante, no lo he probado... pero yo recomendaria por lo menos intentar con pyramid, es un framework minimalista que te da mucha libertado.", "group_id": 965, "id": 459584}]