[{"user_id": 20326, "stars": [], "topic_id": 12900, "date_created": 1300061756.480371, "message": "In the \"My domain/specialty of scientific computing doesn't have a community\" thread, @yungyuc suggested what he called a \"wild\" idea—starting a journal. I wanted to move discussion of this to a new thread.", "group_id": 6727, "id": 344328}, {"user_id": 20326, "stars": [], "topic_id": 12900, "date_created": 1300062433.658828, "message": "This is by far the most traditional solution for fostering communication within a community. I wonder a little how well this addresses the original problem \"How do we have these kinds of discussions the rest of the year?\" asked at a PyCon OpenSpace, as you cannot have the level of discussion in a journal that you can in a a more interactive forum, but I also think this might be a great way to get high quality information out there.", "group_id": 6727, "id": 344358}, {"user_id": 20326, "stars": [{"date_created": 1300114321.819782, "user_id": 7688}], "topic_id": 12900, "date_created": 1300062451.2321341, "message": "I also wonder a little if to make the journal target Python especially wouldn't be a mistake, or if—assuming the idea went forward—a more general category might make more sense to discuss, perhaps similar to the niche carved out by conferences like VEESC http://sss.cs.purdue.edu/projects/veesc/2010/ . On the other hand, I think Haskell's The Monad Reader http://themonadreader.wordpress.com/ has a great tone for the sort of sharing we would want to do.", "group_id": 6727, "id": 344359}, {"user_id": 10411, "stars": [], "topic_id": 12900, "date_created": 1300065017.8672259, "message": "As I mentioned in the orig. thread, I think this is a bad idea, because this niche has been recently filled.", "group_id": 6727, "id": 344476}, {"user_id": 10411, "stars": [], "topic_id": 12900, "date_created": 1300065033.6425099, "message": "...though not for python specifically.", "group_id": 6727, "id": 344477}, {"user_id": 7688, "stars": [], "topic_id": 12900, "date_created": 1300074336.560883, "message": "Perhaps, those forums will be the next-generation \"journals\" for science, at least for computational science.  So it is my 2 cents.  (After all, I think I will try to submit something to ORC ;)", "group_id": 6727, "id": 344800}, {"user_id": 7688, "stars": [], "topic_id": 12900, "date_created": 1300073925.073473, "message": "Perhaps it not as wild as I thought (since there is already a similar journal and it even advertises PyCon).  I agree with @scopatz that running a journal really needs tons of efforts.  Moreover, it actually also needs academic establishment.  But when thinking about scientific community, a peer-reviewed venue just pops into my mind.", "group_id": 6727, "id": 344784}, {"user_id": 7688, "stars": [], "topic_id": 12900, "date_created": 1300074228.9206741, "message": "This convore group was set up to support the development of domain-specific communities for scientific Python.  I think no matter in what form they will be started, eventually the communities will evolve into solid forums for science, related to Python.", "group_id": 6727, "id": 344795}, {"user_id": 20326, "stars": [{"date_created": 1300114312.7559209, "user_id": 7688}], "topic_id": 12900, "date_created": 1300075900.6259351, "message": "Many of the ideas of journals are getting to be pretty anachronistic, so it's interesting to wonder how the system will eventually adapt and at what speed. I sometimes go to http://imechanica.org/ , a site for people in my field of engineering mechanics, where the topic of whether the journal system as we know it's number is up was discussed (and beaten to death) a few years back, which has put it in the back of my mind ever since.", "group_id": 6727, "id": 344895}, {"user_id": 21402, "stars": [{"date_created": 1300083280.1070371, "user_id": 10411}, {"date_created": 1300092522.0104871, "user_id": 10343}, {"date_created": 1300111501.257277, "user_id": 7688}], "topic_id": 12900, "date_created": 1300081416.7245541, "message": "The Python Papers http://pythonpapers.org is a free online journal for Python that is gaining more and more scientific content. Might be worth having a look at that one, rather than spawning another one.", "group_id": 6727, "id": 345178}, {"user_id": 10411, "stars": [], "topic_id": 12900, "date_created": 1300080118.5519619, "message": "@yungyuc Actually, you make a good point that domain specific journals inside of scientific computing would be interesting to develop.  However, I want to ensure that things like the scientific computing version of 'Science' and 'Nature' are successful first, before diversifying.", "group_id": 6727, "id": 345096}, {"user_id": 7688, "stars": [], "topic_id": 12900, "date_created": 1300104928.3592701, "message": "@scopatz Yes.  I think scipy-user mailing, this convore group, and anything we are going to build will be a good start.", "group_id": 6727, "id": 346560}, {"user_id": 21487, "stars": [], "topic_id": 12900, "date_created": 1300112335.3612969, "message": "@pohutukawa The Python Papers seems not to have published since 2008. Is it dead?", "group_id": 6727, "id": 347550}, {"user_id": 21579, "stars": [], "topic_id": 12900, "date_created": 1300138633.1461489, "message": "Not a Python specific journal but GMDD and GMD (Geoscientific Model Development & Discussions) fills a niche for the direct model development / description focused publications (most entries include source codes as well) in Earth Sciences. They have a unique publication methodology where submissions go online very quickly and review comments are available to everyone.", "group_id": 6727, "id": 351314}, {"user_id": 21402, "stars": [], "topic_id": 12900, "date_created": 1300139922.9738891, "message": "@fonnesbeck Nope, not at all. What you're seeing listed there is just the archive until 2008. They've switched to the OJS system since then (Open Journal System): http://ojs.pythonpapers.org/", "group_id": 6727, "id": 351402}, {"user_id": 7688, "stars": [], "topic_id": 12900, "date_created": 1300144037.3769901, "message": "@gsever Those sound very good.  One problem with computational science is that often the published results are not reproducible by other fellow scientists, just like what LeVeque pointed out in his recent paper (doi: 10.1109/MCSE.2009.13).", "group_id": 6727, "id": 351876}, {"user_id": 21664, "stars": [], "topic_id": 12900, "date_created": 1300377300.3737781, "message": "how about starting from a collection of link to scientific computing papers using python?", "group_id": 6727, "id": 375104}, {"user_id": 10411, "stars": [{"date_created": 1300677530.986856, "user_id": 12619}], "topic_id": 12900, "date_created": 1300384345.6723161, "message": "@infoecho Actually that is a pretty great idea.  Software carpentry has some articles posted at the bottom of this page http://software-carpentry.org/4_0/reading/", "group_id": 6727, "id": 375933}]