[{"user_id": 31852, "stars": [], "topic_id": 42856, "date_created": 1311839543.200418, "message": "At least in the US, where it'll drop from $250 to $170 on 12 August.", "group_id": 9493, "id": 1737424}, {"user_id": 35617, "stars": [], "topic_id": 42856, "date_created": 1311840293.4600451, "message": "Call me once someone manages to crack the region locking.", "group_id": 9493, "id": 1737474}, {"user_id": 25703, "stars": [], "topic_id": 42856, "date_created": 1311842921.1840589, "message": "Are there *any* games worth buying besides Ocarina yet?", "group_id": 9493, "id": 1737591}, {"user_id": 32282, "stars": [], "topic_id": 42856, "date_created": 1311847284.8706231, "message": "I suspect the era of the dedicated handheld gaming device is starting to come to an end. Smartphones are starting to rip the insides out of this market, just like they have already done to the PND market. (And like they will surely do to the low-end digital camera market, too)", "group_id": 9493, "id": 1737800}, {"user_id": 33318, "stars": [], "topic_id": 42856, "date_created": 1311851084.0576601, "message": "Core confirmed that it will drop in SA as well. Will let you know if I hear anything.", "group_id": 9493, "id": 1738035}, {"user_id": 31927, "stars": [], "topic_id": 42856, "date_created": 1311926665.012593, "message": "More:  Nintendo made there first quarterly loss in its history, whereafter its stock plunged by **21%**.\n\nAnd this is the company that \"reinvented gaming\" just a few short years ago.", "group_id": 9493, "id": 1745989}, {"user_id": 31927, "stars": [], "topic_id": 42856, "date_created": 1311926249.962697, "message": "@lanceha I suspect (and fear) that what we're witnessing may have even more profound implications than that.  The gaming market as we know it is changing, and I'm not sure that we, as a group, are necessarily going to like the look of gaming a few years down the line.\n\nMore grist to the mill:  In the middle of this interview…\n\nhttp://www.industrygamers.com/news/ea-ceo-consoles-now-only-40-of-games-industry/\n\n… Riccitiello states that in 2000, consoles accounted for 80% of the gaming industry.  (By profits?  Unit sales?  He doesn't say.)   Today?  Just 40%.\n\nMore pressing:  The decline of game sales year-on-year for the past few years.  (You can find those stats anywhere.)  This is usually painted as a decline in *boxed* sales, but I'm convinced that digital sales of traditional games account for less than a drop in the bucket (though if you have stats to the contrary, do let me know).\n\nBut yes, it's hard to read the slashing of price by a ⅓ just 5 months after launch as anything but a massive admission of defeat by the company that has *always* dominated the handheld gaming market.  Heck, these guys barely broke a sweat when then-industry dominator Sony entered said market…", "group_id": 9493, "id": 1745976}, {"user_id": 32692, "stars": [], "topic_id": 42856, "date_created": 1311937766.364753, "message": "I know this is selfish, but I'm happy to see Nintendo on the defensive again. They've neglected a lot while they've been in cruise mode. Also, expect them to talk to the press a lot more often now. Ha!", "group_id": 9493, "id": 1746476}, {"user_id": 35617, "stars": [], "topic_id": 42856, "date_created": 1311945574.2777281, "message": "I wonder if they'd have the same issue if the 3DS had more than just one game.", "group_id": 9493, "id": 1747208}, {"user_id": 31927, "stars": [], "topic_id": 42856, "date_created": 1311946015.860244, "message": "We can always hope that the problem really is something as simple as a sparse software library, and not something endemic to the industry as a whole…\n\nAlso, that stock plunge was originally misreported.  It was in fact 12%.  Still big for a one-day drop, but not quite as outrageous.", "group_id": 9493, "id": 1747266}, {"user_id": 35612, "stars": [], "topic_id": 42856, "date_created": 1312011861.644697, "message": "A related article. http://toucharcade.com/2011/07/29/despite-turbulent-waters-nintendo-reiterates-no-nintendo-games-on-non-nintendo-platforms/", "group_id": 9493, "id": 1753668}, {"user_id": 32282, "stars": [], "topic_id": 42856, "date_created": 1312196789.5623109, "message": "R1899 in SA from 12 August", "group_id": 9493, "id": 1764859}, {"user_id": 31927, "stars": [], "topic_id": 42856, "date_created": 1312201032.5855789, "message": "Penny-Arcade gets to the root of it:\n\nhttp://art.penny-arcade.com/photos/i-GgW57X4/0/XL/i-GgW57X4-L.jpg", "group_id": 9493, "id": 1765164}, {"user_id": 36043, "stars": [], "topic_id": 42856, "date_created": 1312201954.3735819, "message": "For those who don't have one, is that price drop enough to go get one now?", "group_id": 9493, "id": 1765237}, {"user_id": 35617, "stars": [], "topic_id": 42856, "date_created": 1312202034.1258609, "message": "Wait to see in which region the games you'll be interested in will be released first.", "group_id": 9493, "id": 1765246}, {"user_id": 32282, "stars": [], "topic_id": 42856, "date_created": 1312205923.3394361, "message": "Is Ninetndo still going to be making profit on each unit at the new price?", "group_id": 9493, "id": 1765772}, {"user_id": 32282, "stars": [], "topic_id": 42856, "date_created": 1312207804.4690909, "message": "In answer to my question, nope. http://www.andriasang.com/e/blog/2011/07/29/3ds_losses/ This is new territory for Nintendo.", "group_id": 9493, "id": 1766079}, {"user_id": 31927, "stars": [], "topic_id": 42856, "date_created": 1312211740.9021461, "message": "Indeed it is, and it underlines the gravity of the situation.\n\n(One insta-analysis I've seen seemed to indicate that the new RRP might just about cover the hardware costs, but not sales, marketing, and the amortised R&D.)", "group_id": 9493, "id": 1766848}, {"user_id": 35612, "stars": [], "topic_id": 42856, "date_created": 1312271278.9803431, "message": "With EA also dropping support for 3D gaming, does this spell the end for 3D?", "group_id": 9493, "id": 1773297}, {"user_id": 36043, "stars": [], "topic_id": 42856, "date_created": 1312275677.855696, "message": "3D is that thing that everyone seems to be getting SUPER excited about but no one really cares about it that much. Lots of  new TV's have 3D now, consoles have 3D support (well, 2 at least), and still I think 3D is something that should be left at the cinema, where it remains a spectacle.", "group_id": 9493, "id": 1773457}, {"user_id": 36043, "stars": [], "topic_id": 42856, "date_created": 1312275707.8872299, "message": "Buffel; Surely you're keen on Devil Survivor Overclocked?", "group_id": 9493, "id": 1773458}, {"user_id": 35617, "stars": [], "topic_id": 42856, "date_created": 1312276183.458951, "message": "Well, problems with that:\n\n1) Devil Survivor 2 is coming out on the (NON-REGION LOCKED) DS. And since I've already played through DS twice, I'd rather play something new than something I've already played (with a bit of bonus content)\n\n2) No current plans for a release outside the US. So with the DAMN 3DS BEING REGION LOCKED it means I'd either have to wait for an announcement of a release outside the US or get a US 3DS or wait for someone to crack the 3DS.\n\nSo, yeah. At the moment it's more trouble than it's worth.", "group_id": 9493, "id": 1773476}, {"user_id": 36043, "stars": [], "topic_id": 42856, "date_created": 1312283242.1730311, "message": "I can see why this irritates you. Are the games region-locked or is the system? Example, if you have an EU 3DS, will a US Devil Survivor 2 DS cart work?", "group_id": 9493, "id": 1773891}, {"user_id": 35617, "stars": [], "topic_id": 42856, "date_created": 1313164202.2947819, "message": "So, it seems that Nintendo have a very... unique approach to this Ambassador program of theirs.\n\nFor the free NES games, they're releasing \"priority versions\" (ie. half-assed versions without all the features) on the 1st of September and these will later have to be updated to the proper versions some time afterwards.\n\nHow does this approach make any sense?\n\nhttp://www.officialnintendomagazine.co.uk/29448/3ds-ambassador-game-features-detailed/", "group_id": 9493, "id": 1857944}]