[{"user_id": 13109, "stars": [], "topic_id": 16201, "date_created": 1301480422.693856, "message": "Have just been thinking over some films recently and was thinking of those woeful character moments in films when a character changes because \"that's what you need to happen\" and not because of change caused by the effect of an impact character or anything intrinsically in the film universe itself.\n\nSpoilers ahead:\n\nTron\nOne glaring example that came to my mind was the change of Tron (I think) in Tron (Legacy) where one second he was shooting/trying to destroy Flynn. Then - what seemed like out of nowhere switched between \"I want to kill you\" to \"Sure, let me help you - because I believe in you\".  I can remember actually laughing out loud at that point at how brazenly the writer just threw that switch in.\n\nThe writers/director gave absolutely no reason for the character's change.  It was just bad to watch.\n\nAnyone else have other examples of glaringly bad writing with unmotivated character change?", "group_id": 2515, "id": 480616}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1301505852.9716289, "message": "In the recent remake of Dawn of the Dead (maybe Day of the Dead) there is an arrogant, out-for-himself character who sacrifices himself at the end to save the rest of them. He even makes some comment that exacerbates the crime, like \"Of course I go out this way.\" \n\nArguably it doesn't even need to happen to change the course of the movie, which makes it even worse in my book.", "group_id": 2515, "id": 483292}, {"user_id": 7645, "stars": [], "topic_id": 16201, "date_created": 1301546843.6903419, "message": "Agree with the Tron example. There seemed to be another storyform in there with Tron as the IC. In fact, I think that that story was potentially more engaging emotionally then the one that was presented.", "group_id": 2515, "id": 487990}, {"user_id": 10814, "stars": [], "topic_id": 16201, "date_created": 1301592356.7411311, "message": "Agreed.", "group_id": 2515, "id": 493954}, {"user_id": 13109, "stars": [], "topic_id": 16201, "date_created": 1302693149.701174, "message": "Watched \"I am Number Four\" and found another clanger.  The ex-boyfriend - who could be seen as the thorn in the side for most of the film, changes his position with no reason behind it.  It was such a meaningless change in character that my friends who were watching the film started laughing. Hilarious", "group_id": 2515, "id": 663128}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302712366.1015151, "message": "Want me to ask the screenwriter why that happened if I run into her?", "group_id": 2515, "id": 667083}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302719007.4096401, "message": "Holy crap, she just walked into the coffee shop. Speak of the devil...", "group_id": 2515, "id": 669024}, {"user_id": 13109, "stars": [], "topic_id": 16201, "date_created": 1302774366.0168819, "message": "Lol...   You serious?", "group_id": 2515, "id": 681833}, {"user_id": 13109, "stars": [], "topic_id": 16201, "date_created": 1302774623.2241361, "message": "I do wonder about the pressures that come to bear on the writer when the studio steps in.  I think I read an article linked from Jim's site telling how Nottingham turned into Robin Hood.  Fascinating reading on how \"well meaning\" execs/directors can mangle good stories", "group_id": 2515, "id": 681873}, {"user_id": 7645, "stars": [], "topic_id": 16201, "date_created": 1302787017.6368041, "message": "Yes, huge bummer. The original Nottingham version sounded infinitely better than the final product.", "group_id": 2515, "id": 684395}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302790573.3913741, "message": "Another screw up was Christian Bale's involvement in the Terminator Franchise. He signed on to play one character who wasn't the MC and the studio was so happy to have him that they rewrote the movie to make his character the MC (at his request).", "group_id": 2515, "id": 685218}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302790471.0851409, "message": "Haha, I wasn't serious about asking her, but yes I did run into her yesterday.", "group_id": 2515, "id": 685193}, {"user_id": 10814, "stars": [], "topic_id": 16201, "date_created": 1302796523.489965, "message": "Yes, that was a critical flaw in T4, Terminator Salvation.  It was obvious that Christian Bale's John Connor was NOT supposed to be the MC, but it was reworked to try to retrofit it.  It didn't work because the emotional center remained with Marcus Wright, the cyborg.  The end result was an unsuccessful and unsatisfying film experience.", "group_id": 2515, "id": 686635}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302797050.3771949, "message": "I have the Nottingham script if anybody wants it, btw.", "group_id": 2515, "id": 686732}, {"user_id": 7645, "stars": [], "topic_id": 16201, "date_created": 1302800497.0889549, "message": "Worth reading?", "group_id": 2515, "id": 687354}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1302802664.334682, "message": "I haven't had a chance to find out.", "group_id": 2515, "id": 687710}, {"user_id": 13109, "stars": [], "topic_id": 16201, "date_created": 1302862414.6683061, "message": "Nottingham is quite a good read.  Interesting take on the topic all in all.  Didn't see why it started an apparent bidding war but definitely worth the time to read it.", "group_id": 2515, "id": 698954}, {"user_id": 7664, "stars": [], "topic_id": 16201, "date_created": 1303514534.411181, "message": "I think I saw some meaningless character change in Arthur, btw. I won't say what it is, since I think you're going to be watching it.", "group_id": 2515, "id": 786058}, {"user_id": 30951, "stars": [], "topic_id": 16201, "date_created": 1303676782.6103499, "message": "That's really interesting about T4. I didn't really understand why I felt so unsatisfied with that film, especially as I had enjoyed the Sarah Conner Chronicles series (much much better than it sounds!) and was ready for some Terminator universe action.", "group_id": 2515, "id": 796625}]