[{"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299615289.2594991, "message": "How many people would be willing to throw away a weekend for a fun sleepless weekend like this that ALSO live in the area?", "group_id": 95, "id": 299087}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299615273.1223199, "message": "The idea is that you would sign up, pitch ideas around 7pm Friday night, and then finish and show off your company, in whatever stage it is, at around 9 to 11 pm Sunday night. You'd be paired off with teammates (how would be decided later) of various skills and pursue a chosen idea. The goal is to learn and make connections with talented entrepreneurial people, not necessarily create the next Google.", "group_id": 95, "id": 299085}, {"user_id": 12510, "stars": [], "topic_id": 11553, "date_created": 1299637772.4025271, "message": "Omg this actually sounds like fun. I'd be down but not in the area.", "group_id": 95, "id": 301119}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299638615.064827, "message": "well what are aare you in @drcbarnardo ?", "group_id": 95, "id": 301213}, {"user_id": 19414, "stars": [], "topic_id": 11553, "date_created": 1299697473.466918, "message": "I'd be interested. In Manhattan. A clean hackathon. I'm off to PyCon this weekend, and I suspect a number of people will be at SXSW.", "group_id": 95, "id": 307514}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299697716.8264599, "message": "What do you mean by \"clean\" hackathon @iqbalmohomed ?  And yeah, this would take place in a month or two, I'm judging interest right now.", "group_id": 95, "id": 307533}, {"user_id": 6718, "stars": [], "topic_id": 11553, "date_created": 1299721743.6335771, "message": "If it was in PA I might be up for hanging out and learning, using my paltry skills to build. I am located in Greensboro NC but would totally make the trip", "group_id": 95, "id": 309927}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299724670.3726289, "message": "I've talked to some other people in the hackerspace. So far people like the idea. I'll be sure to advertise it on Hacker News when we get more information.", "group_id": 95, "id": 310130}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299724684.9226899, "message": "So here's a question for those interested - what would you want, need to see ,and what kind of formatwould you look for?", "group_id": 95, "id": 310131}, {"user_id": 16271, "stars": [], "topic_id": 11553, "date_created": 1299740631.6399081, "message": "Count me as possibly interested.  I'm in the DC/Baltimore area so I'd have to come up for the weekend but it's not like any of those states are all that far of a drive (well unless it was in upstate NY or something).  I'd probably be more interested in the networking than in developing but who knows - maybe.  Plus my schedule is super impossible all the time.  But I'm certainly interested in hearing more if you move forward with the idea.", "group_id": 95, "id": 311511}, {"user_id": 18530, "stars": [], "topic_id": 11553, "date_created": 1299764831.448864, "message": "Are you a tech person @mridley ? I'm trying to find non tech people to get their perspectives so I can get some insight on how to organize this.", "group_id": 95, "id": 313309}, {"user_id": 16271, "stars": [], "topic_id": 11553, "date_created": 1299784691.617449, "message": "@hlfshell I am indeed", "group_id": 95, "id": 315650}]