[{"user_id": 38112, "stars": [], "topic_id": 42172, "date_created": 1310894212.9462819, "message": "I'm trying to use a reusable app that allows me to set a subclassed model in my settings file. Before putting it on ep.io, I was referencing the model like this: myproject.myapp.models.TheModel. But ep.io says not to include the project name, so the reusable app is throwing an ImproperlyConfigured error and can't find the model. Do I need to do something else to get this app to find the model in my app?", "group_id": 2873, "id": 1656125}, {"user_id": 8740, "stars": [], "topic_id": 42172, "date_created": 1310896180.5598199, "message": "@knuckfubuck How have you configured your import paths? You should set [wsgi] pythonpath to make sure it includes the directory the app is in (usually the project directory, unless you have apps in \"apps/\" or something)", "group_id": 2873, "id": 1656182}, {"user_id": 38112, "stars": [], "topic_id": 42172, "date_created": 1310938814.528101, "message": "The reusable app is \"django-shop\" and I'm using virtualenv and pip. django-shop is in my requirements file and the app my model is in is inside my main project dir. Which one do I need to put into the import paths?", "group_id": 2873, "id": 1658907}, {"user_id": 8740, "stars": [], "topic_id": 42172, "date_created": 1310941297.664181, "message": "sounds like you need to include your project dir in the import path, if the setting refers to your new subclass of something from the reusable app", "group_id": 2873, "id": 1659098}, {"user_id": 8740, "stars": [], "topic_id": 42172, "date_created": 1310941332.3879859, "message": "in this case, it might be best to just keep the project name in there and follow the alternate advice to make sure ep.io just checks your code out inside the right directory name", "group_id": 2873, "id": 1659105}, {"user_id": 38112, "stars": [], "topic_id": 42172, "date_created": 1310945987.085495, "message": "Thanks, using [checkout] worked.", "group_id": 2873, "id": 1659367}]