[{"user_id": 24734, "stars": [], "topic_id": 36714, "date_created": 1306329984.8447361, "message": "Better relationship  A man walked into a therapist's office looking very depressed. \"Doc, you've got to help me. I can't go on like this.\"  \"What's the problem?\" the docotor inquired.  \"Well, I'm 35 years old and I still have no luck with the ladies. No matter how hard I try, I just seem to scare them away.\"  \"My friend, this is not a serious problem. You just need to work on your self-esteem. Each morning, I want you to get up and run to the bathroom mirror. Tell yourself that you are a good person, a fun person, and an attractive person. But say it with real conviction. Within a week you'll have women buzzing all around you.\"  The man seemed content with this advice and walked out of the office a bit excited. Three weeks later he returned with the same downtrodden expression on his face.   \"Did my advice not work?\" asked the doctor.  \"It worked alright. For the past several weeks I've enjoyed some of the best moments in my life with the most fabulous looking women.\"  \"So, what's your problem?\"   \"I don't have a problem,\" the man replied. \"My wife does.\"", "group_id": 9873, "id": 1177736}, {"user_id": 24734, "stars": [], "topic_id": 36714, "date_created": 1306329725.716511, "message": "Psychiatrist phone  Hello. Welcome to the Psychiatric Hotline  If you are obsessive-compulsive, please press 1 repeatedly.  If you are co-dependent, please ask someone to press 2.  If you have multiple personalities, please press 3, 4, 5, and 6.  If you are paranoid-delusional, we know who you are and what you want. Just stay on the line so we can trace the call.  If you are schizophrenic, listen carefully and a little voice will tell you which number to press.  If you are manic-depressive, it doesn't matter which number you press. No one will answer.  If you are anxious, just start pressing numbers at random.  If you are phobic, don't press anything.  If you are anal retentive, please hold.", "group_id": 9873, "id": 1177661}, {"user_id": 24734, "stars": [], "topic_id": 36714, "date_created": 1306329803.883764, "message": "Crazy people talk  A doctor of psychology was doing his normal morning rounds when he entered a patient's room. He found Patient #1 sitting on the floor, pretending to saw a piece of wood in half.   Patient #2 was hanging from the ceiling, by his feet.   The doctor asked patient number 1 what he was doing. The patient replied, \"Can't you see I'm sawing this piece of wood in half?\" The doctor inquired of Patient #1 what Patient #2 was doing. Patient #1 replied, \"Oh. He's my friend, but he's a little crazy. He thinks he's a lightbulb.\" The doctor looks up and notices Patient #2's face is going all red.   The doctor asks Patient #1, \"If he's your friend, you should get him down from there before he hurts himself\"   Patient #1 replies, \"What? And work in the dark?\"", "group_id": 9873, "id": 1177687}, {"user_id": 30352, "stars": [], "topic_id": 36714, "date_created": 1306371038.816992, "message": "LOL! Those are SO funny! I don't know what I would do in those situations!", "group_id": 9873, "id": 1186276}]