[{"user_id": 26577, "stars": [], "topic_id": 16295, "date_created": 1301509716.516608, "message": "The address is www.snackandmunch.com, give me your feedback and input on how we can improve it. We had orders coming in the very first day so it was REALLY exciting! Place an order with the promo code 2BUCKS and get a discount!\n", "group_id": 447, "id": 483748}, {"user_id": 1381, "stars": [], "topic_id": 16295, "date_created": 1301517112.3238931, "message": "Here's to hoping Convore gets some sort of spammer control", "group_id": 447, "id": 484931}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1301654651.801914, "message": "I don't really get the point of the app.  Is $1 a snack even affordable?  I mean, I'm used to getting ripped off at a vending machine, but just because that vending machine is online doesn't mean I'm going to use it...", "group_id": 447, "id": 500548}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1301654715.491636, "message": "Part of the reason I choose to pay $1 for a snack at a vending machine is due to the immediacy of wanting the snack.  If I was saying \"I can wait for this snack to be delivered\" or I'm planning ahead, I'm going to be cheap about it, go to Sam's or Costco and just purchase a bunch of something in bulk", "group_id": 447, "id": 500552}, {"user_id": 6166, "stars": [], "topic_id": 16295, "date_created": 1301984711.4614191, "message": "I posted this in the Rails section because Snack&Munch is a 100% pure Rails app, wasn't trying to spam.  Also @klauern the point of this service is to save you time and energy, there are many people that just don't have time to go hunt at grocery stores or warehouses for snacks at work.  Plus if you buy something at Costco or Sams you get a big box of one thing.  Snack&Munch lets people make a mix pack of items.  Also we have many iteams you will not find at normal stores like international snacks.", "group_id": 447, "id": 536399}, {"user_id": 6166, "stars": [], "topic_id": 16295, "date_created": 1301984945.5284469, "message": "Also I forgot to mention we are getting many orders from college students that live in dorms, they have no transportation and need snacks late at night when they are studying.", "group_id": 447, "id": 536469}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302046119.345866, "message": "Ah, those are good reasons to use your site.  I hadn't thought of 1) international snacks, 2) mix-packs, 3) college kids without easy transportation, 4) hard to get snacks, etc., and wouldn't have had you not mentioned it.", "group_id": 447, "id": 550217}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302046169.825099, "message": "However, your main selling points are convenience and $1 a snack, neither of which are very interesting to me.", "group_id": 447, "id": 550244}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302046175.871032, "message": "Those other things are much more interesting, however.", "group_id": 447, "id": 550248}, {"user_id": 6166, "stars": [], "topic_id": 16295, "date_created": 1302053388.0368979, "message": "@klauern thats ok its a niche market :-)", "group_id": 447, "id": 552284}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302086249.955611, "message": "I mena I could see how you would be able to email advertise all sorts of things on that like \"You want to try some really different kinds of candy?  Here's some chocolate-covered grasshoppers\" or \"this is a big hit in Germany\" or \"vintage candy lineup\"", "group_id": 447, "id": 557568}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302086281.3961501, "message": "That way the price isn't so much of a concern for me, but the viral need to keep looking on your site for new candies would be", "group_id": 447, "id": 557573}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302086114.7397361, "message": "Wouldn't that make better business sense?  It sounds like you're trying to compete on price.  $1 a snack is a nice tagline, but it isn't competitive with the big boys and won't be something that interests alot of people.", "group_id": 447, "id": 557548}, {"user_id": 4221, "stars": [{"date_created": 1302094708.31897, "user_id": 25720}], "topic_id": 16295, "date_created": 1302086072.1830289, "message": "Well, if I might offer a minor suggestion, then.  Since these things you're telling me are unique to your business, why aren't they more prominently shown on the page than the $1 a snack?  I mean, most people will look at that page and not immediately realize that the point isn't that you pay $1 a snack (which they will compare to the $0.70 a snack they pay at their vending machines), but that you offer things they can't get at Costco, a vending machine, or elsewhere?", "group_id": 447, "id": 557540}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302086180.708365, "message": "But being able to mix a basket of 24 different snacks, offer a larger variety, and international choices, then it becomes not about $1 a snack but about being able to pick out a bunch of fun choices, surprise yourself with \"weird candies\" and try to make that angle of the business the one that shines.", "group_id": 447, "id": 557561}, {"user_id": 6166, "stars": [], "topic_id": 16295, "date_created": 1302195835.605931, "message": "@klauern i love all your feedback, I'll definitely use it!  The international aspect is something we are trying to do for sure, just takes time to get everything in out inventory.  Thanks! -Ammar", "group_id": 447, "id": 577398}, {"user_id": 4221, "stars": [], "topic_id": 16295, "date_created": 1302269450.0415721, "message": "You're very welcome.  Looking forward to see what comes", "group_id": 447, "id": 589670}]