[{"user_id": 13453, "stars": [], "topic_id": 9743, "date_created": 1298997643.5238259, "message": "Líder: @Redes_Colombia - @issa2507\nObjetivos: Conectar a los colombianos en el exterior y vincularlos al desarrollo del Plan Vive Digital.\nActividades: 1. Ubicar a través de los 6 grados de separación la mayor cantidad de colombianos en el exterior a quienes vincular al Plan Vive Digital.\n2. Iniciar la vinculación, conectado talento colombiano en el exterior a través de la realización de foros temáticos, dónde se comparta la experticia de los connacionales fuera del país, haciendo uso de la plataforma RedEsColombia.\n3. Acometer acciones para fortalecer los trámites en línea con base en las necesidades de los usuarios internacionales.\n4. Dar respuesta a las necesidades de información y servicios del ciudadano en el exterior, que permita estrechar la relación entre el Gobierno y la diáspora. \nEnlace MinTic - ViveDigital: Claudia Berbeo", "group_id": 2696, "id": 236190}, {"user_id": 16748, "stars": [], "topic_id": 9743, "date_created": 1299009516.6522241, "message": "5. Mejorar las web de las Embajadas de Colombia en el exterior", "group_id": 2696, "id": 237599}, {"user_id": 16500, "stars": [], "topic_id": 9743, "date_created": 1299083545.4676759, "message": "Yo tengo una ídea para un proyecto específico en esta área, pero voy a afinarla y les cuento luego ;P", "group_id": 2696, "id": 248437}, {"user_id": 17917, "stars": [], "topic_id": 9743, "date_created": 1299100164.415647, "message": "sobretodo lo que deberían entender las embajadas y/o consulados en el exterior es su principal razón de ser, la persona! El concepto de servicio y de tratar a los colombianos como compatriotas deja bastante que desear. Lo que aleja por completo la cercanía de los colombianos en el exterior con estas oficinas.  Solo un comentario suelta que no aporta, pero lo expongo. Feliz tarde.", "group_id": 2696, "id": 252870}, {"user_id": 16177, "stars": [], "topic_id": 9743, "date_created": 1299189725.011831, "message": "Tengo unos cuantso Colombianos en el exterior en mi TL. una vez contactados, donde los remitimos? mientras iré haciendo una lista para mantenerlos en contacto!", "group_id": 2696, "id": 264374}, {"user_id": 19193, "stars": [], "topic_id": 9743, "date_created": 1299454088.9984021, "message": "@KAMIAN cual es la idea a mi este escuadron me interesa :D", "group_id": 2696, "id": 282335}, {"user_id": 16500, "stars": [], "topic_id": 9743, "date_created": 1299503689.5520811, "message": "jajaja, básicamente es un sitio dentro de un mundo virtual donde se convoque a los Colombianos en el exterior, especialmente los que llevan muchos años afuera, un sitio donde se sientan de algún modo en casa y donde se desarrollen actividades representativas, de inclusión y de impacto en la vida real.", "group_id": 2696, "id": 287368}, {"user_id": 17223, "stars": [], "topic_id": 9743, "date_created": 1299757308.1477699, "message": "Conozco a algunas personas fuera del pais pero donde pasamos los datos o como?", "group_id": 2696, "id": 312640}, {"user_id": 19193, "stars": [], "topic_id": 9743, "date_created": 1299943226.352241, "message": "me parece genial,., un mundo virual como second life? :D", "group_id": 2696, "id": 332677}, {"user_id": 16500, "stars": [], "topic_id": 9743, "date_created": 1300044926.5836401, "message": "jeje, exactamente :P", "group_id": 2696, "id": 342891}, {"user_id": 16677, "stars": [], "topic_id": 9743, "date_created": 1300067710.260494, "message": "Gracias a todos por sus aportes a la discusión de los líneamientos del Escuadrón, entre todos podemos optimizar la conexión con la comunidad colombiana en el exterior. Activemos nuestros #6grados de separación!!! Ayúdennos a ubicar colombianos en el exterior. Recomiendennos contactos al twitter @Redes_Colombia o a nuestra fan page http://on.fb.me/hLqGiu #colombianosmascerca", "group_id": 2696, "id": 344549}, {"user_id": 17223, "stars": [], "topic_id": 9743, "date_created": 1300157409.6739149, "message": "Issa que no se te olvide mandarme la info de 6 grados de separacion para Santamartaviva..", "group_id": 2696, "id": 353001}, {"user_id": 16677, "stars": [], "topic_id": 9743, "date_created": 1300464778.161304, "message": "Actriva tus #6grados http://bit.ly/gyhsnt | Ayúdanos a ubicar colombianos en el exterior #colombianosmascerca | Rueda la bola!", "group_id": 2696, "id": 383179}]