[{"user_id": 7645, "stars": [], "topic_id": 44318, "date_created": 1314107065.6731451, "message": "How long is part one?", "group_id": 2515, "id": 1939774}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314117113.1297221, "message": "First IC-1 then IC-2.", "group_id": 2515, "id": 1941114}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314055300.8949659, "message": "In my story, the IC is the MC's lover, and the inciting incident is that the IC is assassinated quite early in the story, at which point the MC's best friend takes over the counter-argument.\n\nI'm wondering if anyone could offer examples of other stories where this kind of shift takes place.", "group_id": 2515, "id": 1934922}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314055801.365865, "message": "Why do you have the IC do a handoff? I don't their their being dead mandates that.", "group_id": 2515, "id": 1935001}, {"user_id": 33839, "stars": [], "topic_id": 44318, "date_created": 1314065960.9285841, "message": "It seems like one of those conspiracy thrillers from the 70's may follow this type of format.  Perhaps the Parallax View?", "group_id": 2515, "id": 1936840}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314065974.2289109, "message": "There's a reason for it. The character that the IC role gets handed off to becomes the antagonist in part 2.... was trying to avoid going into too much detail.", "group_id": 2515, "id": 1936845}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314066024.2228949, "message": "Hm... been a very long time since I've seen The Parallax View... will check it out.", "group_id": 2515, "id": 1936855}, {"user_id": 33839, "stars": [], "topic_id": 44318, "date_created": 1314067214.4478481, "message": "Don't hold me to it - it just seems like a storyline from one of those 70's conspiracy thrillers as many of those had key characters who died early in the film, leaving the main character in limbo... but it seems like the \"best friend\" who stepped in to be supportive always ended up being revealed as the true antagonist (it's always somebody close to the MC). \n\nMaybe even something like Ghost?", "group_id": 2515, "id": 1937069}, {"user_id": 39675, "stars": [], "topic_id": 44318, "date_created": 1314068080.9765069, "message": "My husband is a In the Heat of the Night tv show re-run junkie. They had a very successful handoff in many episodes by showing the MC with IC, who ended up getting killed, with the police force taking over and a different IC being flushed out.", "group_id": 2515, "id": 1937212}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314070012.784626, "message": "\"becomes\" the antagonist? So, there's an antagonist hand-off, too?", "group_id": 2515, "id": 1937460}, {"user_id": 39675, "stars": [], "topic_id": 44318, "date_created": 1314072913.0007601, "message": "@MikeDerk Isn't that common in episodic tv?  A new IC needing to cover the murder of the original antagonist seems vaguely familiar.", "group_id": 2515, "id": 1937853}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314075240.8982971, "message": "I haven't dissected any TV, really, so I wouldn't know.", "group_id": 2515, "id": 1938009}, {"user_id": 7645, "stars": [], "topic_id": 44318, "date_created": 1314078787.4016559, "message": "If your candidate for the IC is assassinated when the story begins (Inciting Incident) how can they be considered the IC, or rather why are they? Isn't the best friend really the IC? How does the MC carry on a relationship with the dead lover? And the best friend then becomes the Antagonist?", "group_id": 2515, "id": 1938199}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314095696.603615, "message": "I mean trying NOT to go into too much detail.", "group_id": 2515, "id": 1939040}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314096096.809299, "message": "Chris addressed this briefly in the Dramatica forum: http://forums.screenplay.com/viewtopic.php?f=22&t=4207", "group_id": 2515, "id": 1939059}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314095622.672246, "message": "Oh, I knew this was going to happen... Part 1 is largely  a set up, and there is no strong antagonist present -- the best friend (IC-2) has some antagonist characteristics, especially in the areas of Methodology and Evaluation, in order to set him up as the real antagonist in Part 2. The SS, MC and IC-1 throughlines start right at the beginning, but the OS kicks in once IC-1 is assassinated. We don't know yet who did it.\n\nAt the end of Part 1 the MC travels back in time (it's a fantasy novel) to try to change the course of events. Part 2 begins with IC-1 now as a young man, and the new MC (but we don't know he is IC-1 from Part 1 until later in Part 2). The MC from Part 1 is now the new IC-Protagonist. IC-2 from Part 1 also goes back in time and becomes the Antagonist.\n\nNow you see why I was trying to go into too much detail... LOL.", "group_id": 2515, "id": 1939038}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314108369.7750649, "message": "Probably about 1/4 of the total.", "group_id": 2515, "id": 1939883}, {"user_id": 39675, "stars": [], "topic_id": 44318, "date_created": 1314115091.6234441, "message": "Who wants to stop the protagonist in part 1?", "group_id": 2515, "id": 1940746}, {"user_id": 7645, "stars": [], "topic_id": 44318, "date_created": 1314117900.8142869, "message": "1/4? Does that mean when the OS starts you're already into the 2nd or 3rd signposts for the MC, IC and SS throughlines?", "group_id": 2515, "id": 1941309}, {"user_id": 7645, "stars": [], "topic_id": 44318, "date_created": 1314126842.6934459, "message": "It doesn't sound like it.", "group_id": 2515, "id": 1942835}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314125832.42383, "message": "Is this going to end up being structured like \"Ironman\"?", "group_id": 2515, "id": 1942696}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314129106.3797989, "message": "No...... Part 1 is a quarter of the entire book length. The inciting incident comes in chapter 4 (based on current plans).", "group_id": 2515, "id": 1943172}, {"user_id": 39675, "stars": [], "topic_id": 44318, "date_created": 1314131649.013737, "message": "Maybe you have another character who is the IC.  These things do sneak up on one.  Who is the guardian?  You do not have to tell me if it is confidential.  Just think about it.", "group_id": 2515, "id": 1943538}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314133532.258734, "message": "@PhillyJeff I have a feeling you're mixing theories here, just a bit. \n\nMany theories would say that a story is a Stasis, followed by an Inciting Incident, and then things play out until a new Stasis is achieved.\n\nDramatica doesn't really look at stories that way, and even though we still talk about inciting incidents, perhaps it would be better to ask you what the earliest occurrence of the Driver is.", "group_id": 2515, "id": 1943790}, {"user_id": 10814, "stars": [], "topic_id": 44318, "date_created": 1314138690.2564609, "message": "An IC hand-off happens about half-way through \"In the Line of Fire,\" starring Clint Eastwood.  In the first half, Renee Russo's character is the IC and Clint's partner is the sidekick.  Clint's partner is killed by the antagonist about halfway through, at which point Renee Russo becomes the sidekick and the antagonist becomes the IC.  There is even a \"You and I are alike\" moment between Clint and the assassin.", "group_id": 2515, "id": 1944451}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314145032.1492839, "message": "I'm sorry everyone -- I appreciate your interest in what I'm doing, but I wasn't really looking for this kind of discussion. I just asked about examples of the hand-off. I've second guessed myself 100 times already over the last year of working on this story, and I'm in a writer's group that is very engaged and critical, but believe I'm on the right track. I'd like to end this now, please.", "group_id": 2515, "id": 1945172}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314145145.78916, "message": "ohh! Great example, Chris! Thanks.", "group_id": 2515, "id": 1945189}, {"user_id": 37586, "stars": [], "topic_id": 44318, "date_created": 1314147904.74365, "message": "@PhillyJeff I admire and applaud your strength not to second guess yourself any longer and to move forward with the peace that you are on the right track. And to do it graciously :0)", "group_id": 2515, "id": 1945556}, {"user_id": 7664, "stars": [], "topic_id": 44318, "date_created": 1314151669.3084271, "message": "Sorry, I tend to be a dog with a bone. Knock out that first draft and don't look back.", "group_id": 2515, "id": 1946056}, {"user_id": 7645, "stars": [], "topic_id": 44318, "date_created": 1314158955.8778729, "message": "Yeah, sorry if it was too prodding, just interested", "group_id": 2515, "id": 1946690}, {"user_id": 38500, "stars": [], "topic_id": 44318, "date_created": 1314164515.153928, "message": "Thanks to all of you. :-)", "group_id": 2515, "id": 1947090}]