[{"user_id": 12133, "stars": [], "topic_id": 36178, "date_created": 1305923638.703449, "message": "telmexhub ... acceso a internet gratis y lugar de trabajo", "group_id": 965, "id": 1130053}, {"user_id": 26089, "stars": [], "topic_id": 36178, "date_created": 1305925015.7642381, "message": "Tenemos que trabajar con muchos menos recursos que los que hay en otros lados, eso empuja la creatividad.", "group_id": 965, "id": 1130265}, {"user_id": 26084, "stars": [], "topic_id": 36178, "date_created": 1305924293.1503949, "message": "Desarrolladores talentosos, los hay en todo México, pero en el DF existe una mayor concentración.", "group_id": 965, "id": 1130155}, {"user_id": 3084, "stars": [], "topic_id": 36178, "date_created": 1305951331.5307381, "message": "Para modelos B2B muchas matrices se concentran ahí", "group_id": 965, "id": 1132310}, {"user_id": 26085, "stars": [], "topic_id": 36178, "date_created": 1305993525.9935, "message": "Me refería a ventajas que tiene la ciudad para probar modelos de negocio. Por ejemplo... una población de mas de 22 millones de habitantes si contamos el área conurbada. Hay muy pocos lugares donde podríamos encontrar una población así de grande.", "group_id": 965, "id": 1134751}, {"user_id": 19921, "stars": [], "topic_id": 36178, "date_created": 1306082390.576576, "message": "Una gran ventaja es que las matrices de muchas empresas importantes estan en el Distrito. Y si, por ejemplo, tu Startup quiere vender SaaS, eso representa un buen punto para estar aqui.", "group_id": 965, "id": 1142745}, {"user_id": 20146, "stars": [], "topic_id": 36178, "date_created": 1306126773.9511571, "message": "La escases de recursos no es algo \"unico\" en el DF de echo es algo generalizado en todas las ciudades de México(salvo excepciones).por otra parte un espacio de trabajo y conexión a Internet.\n\nLa principal ventaja es que la cuidad es un gran conglomerado de personas, empresas, instituciones y organizaciones.", "group_id": 965, "id": 1148532}, {"user_id": 20146, "stars": [], "topic_id": 36178, "date_created": 1306127862.3174961, "message": "La escases de recursos no es algo único en el DF de echo es algo generalizado en todas las ciudades de México(salvo excepciones).Por otro lado varias ciudades de la república cuentan con coworkings o lugares donde puedes conseguir un espacio de trabajo y conexión a Internet si no gratis si a un bajo precio.\n\nLa principal ventaja es que la cuidad es un gran conglomerado de personas, empresas, instituciones y organizaciones.\n\nCreo que por ahi estaría la cosa, p.e. vender algún servicio que le interese a las personas ubicadas en la cuidad de México.\n\nOtra ventaja es que pueden encontrar mas empresas con las que se pueden ofrecer sus servicios y/o asociar.\n\nEl echo de que las instituciones federales se encuentren ahí es otro gran punto, p.e. \npara las personas que no somos de ahi nos es un poco dificil realizar ciertos tramites.\n\nConozco varios desarrolladores que viven en el D.F. de echo conozco uno que puso su propia empresa de desarrollo y otro par de compañeros que egresaron con migo que se fueron a trabajar en empresas de por ahi. y se fue ahí\n\nEl DF es una cuidad muy dinámica donde hay mucho comercio de todo tipo, creo que algún sistema de intermediario es buena opción también. Creo que si encuentras algún problema en el comercio en el DF que puedas resolver has encontrado un gran nicho.", "group_id": 965, "id": 1148615}, {"user_id": 13545, "stars": [], "topic_id": 36178, "date_created": 1306161092.5563271, "message": "Creo que el DF es una de las pocas opciones que tienes si quieres lanzar algo como Foursquare, Groupon, etc., donde la concentración de usuarios de Internet y su localización son importantes.", "group_id": 965, "id": 1153109}, {"user_id": 3084, "stars": [], "topic_id": 36178, "date_created": 1306201967.1403451, "message": "Algo importante es que si quieres ser global, el DF es realmente un gateway al mundo.", "group_id": 965, "id": 1160010}]