[{"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305911488.1009891, "message": "Let's throw Appraise/Re-appraise into the mix...", "group_id": 2515, "id": 1127955}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305911515.1794651, "message": "Consider: I think Save the Cat! is the only structure paradigm I need to know. Reconsider: Maybe I've been thinking of things the wrong way and need to reconsider my point-of-view.", "group_id": 2515, "id": 1127961}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305911553.1977839, "message": "The first instance shows Consider as creating problems. The only way those problems are solved is through Reconsidering that original consideration (within the context of that story_", "group_id": 2515, "id": 1127967}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305911889.336442, "message": "  Appraisal and Re-appraisal are the same sort of thing, but I believe these two are more concerned with an initial understanding of evidence, whereas Consider/Reconsider deal with problematic motivations, i.e. the problems that come from someone who constantly mulls things over as opposed to someone who takes a quick snapshot of something and moves on from there.", "group_id": 2515, "id": 1128004}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305911573.07178, "message": "But, I've appraised Dramatica and it's too hard, so you should stick with STC. No, wait, let me re-appraise it.", "group_id": 2515, "id": 1127970}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305911616.4234359, "message": "The opposite would be someone who constantly bounces from one consideration to the next (Reconsider as a Problem). The only way to solve that problem is by Considering one point-of-view and going with it.", "group_id": 2515, "id": 1127975}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305911370.6114249, "message": "Talking about cause/effect led me to another one:  consider/re-consider.\n\nTo me, re-consider is not the opposite of consider. The opposite of consider would be ignore, or refuse, or dismiss, or reject. To re-consider is just to consider again, which is still considering.\n\nFor some reason I hit this one a lot, and I never know how to use it. I have an OS problem of consider in a current story, and re-consider as a solution seems baffling. The solution, to me, would be to not consider it at all.", "group_id": 2515, "id": 1127947}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305914667.4477661, "message": "Or to Consider a different approach.", "group_id": 2515, "id": 1128574}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305912868.5203681, "message": "But to me \"considering\" one point of view is different from \"going with it\". \"Considering\" implies that you're thinking about it, \"going with it\" implies that you make a decision. \n\nSo I can ask you to consider that Save the Cat is the only structure paradigm you need, but if the source of the story problem is you deciding to go with Save the Cat (and the shitty screenplays that would invariably result :) ), then that story is not about Consider.  It's about the decision, not the consideration.\n\nFor the story to be about Consider, it would have to be the problems you encounter when you're reading Save the Cat and trying to make up your mind about it. And if you're \"Re-considering\", then you're just trying to make up your mind again.", "group_id": 2515, "id": 1128164}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305915644.168642, "message": "touché", "group_id": 2515, "id": 1128729}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305912964.9841039, "message": "And if the story is about you Re-considering Save the Cat, the solution is not to consider it. The solution is to refuse to re-consider it.", "group_id": 2515, "id": 1128178}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305914512.6950459, "message": "Also, the solution of Re-consider can't be \"don't consider the book\" -- he's already considered it. \n\nIf his goal is a well-written screenplay, not considering the book won't get him there. He is obviously looking for a tool to help him -- he still needs a tool. He needs to re-consider doing everything by intuition, reconsider his approach to using Dramatica, reconsider the fallout from plagiarizing from Mike Derk (who is awesome), etc.", "group_id": 2515, "id": 1128551}, {"user_id": 7664, "stars": [{"date_created": 1305919056.304666, "user_id": 7645}], "topic_id": 36149, "date_created": 1305914549.188638, "message": "I think we are running into problems taking things as stand-alone things. Dramatica is a network of tensions.", "group_id": 2515, "id": 1128555}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305914684.9891441, "message": "woops, didn't see Mike's comments...reading...", "group_id": 2515, "id": 1128578}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305914805.841084, "message": "LOL re:plagiarizing. \"Network of tensions\" is awesome.", "group_id": 2515, "id": 1128596}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915454.776659, "message": "Note that the argument is weak, some will not be entirely convinced, yet feel that something is there. That's because I have yet to add Mike as my Impact Character who is fixated on Dramatica and will spend a majority of his time manipulating me into changing my nature as a stubborn-headed buffoon.", "group_id": 2515, "id": 1128693}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305914395.533531, "message": "I think you've said it. The problem is in *how* the book is considered. If Jim considers it more important that everyone is reading it than he considers the information inside, he'll make a bad decision (hence, considering is not the problem, the problem is the fall out from the considering). \n\nOnce he's come to that decision, the only way to make another decision is to reconsider the book, or reconsider taking a screenwriting class, or something.", "group_id": 2515, "id": 1128533}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915288.952054, "message": "My name is Jim, I'm an unsuccessful screenwriter who writes every day to try and change that. My Goal as Protagonist is to get that Million Dollar Screenwriting Spec Sale. My writer's group Considers Save the Cat! to be THE authority on structuring a story. We follow it, with disastrous results. I talk to managers and agents who say, if you follow that paradigm, we pick up on it pretty quickly and toss it into the trash. Yeah, our group says, but it makes us feel really smart and its fun to figure out the Fun and Games or when the Bad Guys Close In. We still don't get paid. I, as Protagonist still don't get paid, because we are motivated to not consider anything else. Only when we Reconsider the use of outward-in paradigms do we finally achieve success and I win a Million Dollars.", "group_id": 2515, "id": 1128675}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915331.2050011, "message": "Storyform would be - Change, Do-er, Decision, Success, Good, Activity, Obtaining, Approach, Consider.", "group_id": 2515, "id": 1128680}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915360.3101239, "message": "How freaking cool is it that the Issue was Approach -- didn't even know that going in to my comment. Dramatica reaffirms I'm on the right track. Our issues stem from problematic Approaches.", "group_id": 2515, "id": 1128681}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915468.3277531, "message": "He will eventually succeed, but only because it is a work of fiction. :)", "group_id": 2515, "id": 1128695}, {"user_id": 7645, "stars": [], "topic_id": 36149, "date_created": 1305915452.7454369, "message": "In writing this story I am making an argument as to the BEST way to solve the problem of only considering one paradigm.", "group_id": 2515, "id": 1128692}, {"user_id": 30951, "stars": [], "topic_id": 36149, "date_created": 1305917123.496444, "message": "Full of quotes. Here's a few:\n\n\"Also, the solution of Re-consider can't be \"don't consider the book\" -- he's already considered it. \"   - yes, that makes sense, and is a great way to understand why not considering is not the opposite with Dram.\n\nJust to check, are we use fact or fiction for our examples???? ;):\n\n\"and will spend a majority of his time manipulating me into changing my nature as a stubborn-headed buffoon.\"", "group_id": 2515, "id": 1129037}, {"user_id": 30951, "stars": [], "topic_id": 36149, "date_created": 1305917033.010241, "message": "Also, the solution of Re-consider can't be \"don't consider the book\" -- he's already considered it. ", "group_id": 2515, "id": 1129017}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305929480.5750051, "message": "Interesting! So... I've got a story where the MC has been active for years trying to change public opinion about something (manipulation domain). And he has had some success... the public is starting to lean his way. Then the inciting incident happens and swings the public away from him to the extreme.  Is that a problem of Consider, or of Re-Consider?", "group_id": 2515, "id": 1131082}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305931888.48157, "message": "Are you limiting us to those two options?", "group_id": 2515, "id": 1131268}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305935188.5043991, "message": "Not necessarily, but when I ran it through Dramatica, that's the quad that seemed to fit best.  I'm open to anything that works.", "group_id": 2515, "id": 1131382}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305936033.466181, "message": "Without knowing any more, I could see any of those four in the quad working.", "group_id": 2515, "id": 1131408}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305935236.4433, "message": "(Bear in mind, I clearly didn't have a good understanding of Consider/Reconsider when I was working this out.  It was best guess at the time.)", "group_id": 2515, "id": 1131386}, {"user_id": 30287, "stars": [], "topic_id": 36149, "date_created": 1305939847.817199, "message": "That's kind of the problem. Consider and re-consider seem like the same thing to me, to the point where they're interchangeable in my situation. Either the problem is that the public won't consider the hero's position, or they're re-considering their position on my hero. It's kind of the same thing.", "group_id": 2515, "id": 1131529}, {"user_id": 7664, "stars": [], "topic_id": 36149, "date_created": 1305944451.5708981, "message": "Could it be that the new information causes opposition to the MC's plan (by proposing something else, it leads people astray) and he needs Support to succeed?", "group_id": 2515, "id": 1131851}, {"user_id": 30951, "stars": [], "topic_id": 36149, "date_created": 1305967710.769423, "message": "Strangely enough, i think I get it. \n\nWhen I think of a past story idea of mine, where a character gets taken in by beautiful girl, his problem was that he gave in to temptation (a la Sirens), and didn't stop and think about what was happening.\n\nTherefore, in this context, his problem could have been Consider (because he didn't), but definitely not Re-consider. \n\nHe Considered only the positives of this girl, and ultimately solved his problem by Re-considering the positives and negatives, therefore realising she was not what she initially seemed.\n\nRe. Jim's point, is this story, the solution could not be 'don't consider' or 'don't do it' cause he already had. He needed to re-evaluate / re-consider to understand where he had gone wrong. This meant, not only did he leave the girl and solve his problem, but he also grew through this new understanding.", "group_id": 2515, "id": 1133306}]