[{"user_id": 11626, "stars": [], "topic_id": 8691, "date_created": 1298530452.3263659, "message": "The Army’s on a crash course to get its futuristic information network available down to the lowest possible levels, says its deputy leader, a move that will provide soldiers with a “tremendous advantage that we’ve never had before.”\r\n\r\nSpeaking at the Brookings Institution in Washington D.C., Gen. Peter Chiarelli hailed the initial development of the Army’s Common Operating Environment as a potential gamechanger for the nation’s ground forces. Its proliferation will pave the way for soldiers to one day get equipped with smartphones, each linked in to access information from across a warzone or back home. It may take years to get networked phones to soldiers, but the Army’s trying to push its networks out to the “squad and team level.”\r\n\r\n“It’s taken us way too long to get the network out to the soldiers,” Chiarelli said, lamenting the relative ease with which insurgents in Iraq and Afghanistan have been able to communicate and push out their message.\r\n\r\nEnter the Common Operating Environment. Unveiled in October, it’s a series of standards by which software developers can design applications that tap into the Army’s data systems, known collectively as its Enterprise Network. Whether that developer is a soldier or works for a defense company, the Common Operating Environment is supposed to guide development of different communications tools, whether they’re radios or smartphones or applications for the phones.\r\n\r\nThat builds on last year’s big “Apps for the Army” contest — a proving ground to determine whether the Army community has enough developers who can design applications, says Lt. Col. Gregory Motes, head of a new group called the Mobile Applications Branch at Fort Gordon. Nearly 150 participated in the months-long challenge to build apps relevant to the Army; Motes and Capt. Chris Braunstein designed one that digitizes the Army’s physical-training standards.\r\n\r\nAs the Common Operating Environment matures, more sophisticated applications can be written and more equipment can be linked in to the Enterprise Network. Chiarelli said testing is still ongoing: in “June and July” he’ll observe a test of Rifleman Radio, a network-compliant radio system built by General Dynamics that allows squad and team leaders to get GPS coordinates on exactly where their soldiers are.\r\n\r\nThe Common Operating Environment is designed to be agnostic to any particular platform, instead elaborating the technical requirements that apps have to meet. Its goal is interoperability, in its founding document’s words, so data is “available anywhere on the network to authorized users from any suitable Army-managed device.”\r\n\r\n“I’m not into any particular smartphone,” Chiarelli tells Danger Room,”I just happen to carry an iPhone for my own personal use…. We can already see the benefit for the squad and team leader.” That is, the rapid availability of data from across the Army, all over the world, into a soldier’s mobile device — from intelligence reports to drone video to local-language phrasebooks — if the bandwidth is available.\r\n\r\nThose are questions that Motes’ team at the Army’s Training and Doctrine Command (TRADOC) are still studying. Is there enough bandwidth when soldiers are out in the middle of nowhere for accessing the networks? (Darpa’s trying to solve that problem.) What’s the best operating system for soldier smartphones and app generation? Should there be a particular phone issued, or is it better to issue requirements for operating across the Common Operating Environment and leave it for the market to sort out and update for soldiers to buy?\r\n\r\nTroops at Fort Bliss have been experimenting with smartphones in a simulated war environment for the past year. Mike McCarthy, a civilian out at Bliss with the Brigade Modernization Command and one of the officials in charge of exploring smartphone use, tells Danger Room that a consensus exists within his TRADOC group that the time has come to equip soldiers with the phones, and expects the Army to make a top level decision on issuance this year. If the Army decides to go the smartphone route, it’ll still take years to get Common Operating Environment-compliant phones, hooked into to the Army Enterprise Network, out to soldiers.\r\n\r\nBut it’s the environment that standardizes app development and paves the way. Asked by Danger Room if troops could have their phones before the U.S. leaves Afghanistan, Chiarelli says, “I see that happening very, very soon.”\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/smartphonearmy.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/army-wants-low-level-soldiers-linked-into-its-data-nets/", "group_id": 3920, "id": 195844}]