[{"user_id": 11626, "stars": [], "topic_id": 6334, "date_created": 1297850297.0136249, "message": "A port official has admitted that a 'weapon of mass effect'  has been found by 'partner agencies' in the U.S., raising major questions over a possible government cover-up.\r\n\r\nThe disturbing revelation came in an interview with San Diego's assistant port director screened by a television channel in the city.\r\n\r\nThe Customs and Border Protection Department tried to dampen speculation over his remarks, but doubts remained over whether he had inadvertently revealed a dirty bomb plot to attack the U.S. mainland.\r\n\r\nConcern over a secret WMD bust came after U.S. cables made public by the Wikileaks whistleblower website revealed terror groups were plotting a 'nuclear 911.'\r\n\r\nIn the interview screened by San Diego’s 10News, Al Hallor, assistant San Diego port director, said ‘weapons of mass effect’ had been found, although he did not specify exactly where or what they were.\r\n\r\nReporter Mitch Blacher asked Mr Hallor: ‘Do you ever find things that are dangerous like a chemical agent or a weaponised device?’\r\n\r\n‘At the airport, seaport, at our port of entry we have not this past fiscal year, but our partner agencies have found those things,’ the customs official replied.\r\n\r\n‘So, specifically, you're looking for the dirty bomb? You're looking for the nuclear device?’ asked Mr Blacher.\r\n\r\n‘Correct. Weapons of mass effect,’ said Mr Hallor.\r\n\r\n‘You ever found one?’ asked Mr Blacher.\r\n\r\n‘Not at this location,’ Mr Hallor said.\r\n\r\n‘But they have found them?’ asked Mr Blacher.\r\n\r\n‘Yes,’ said Mr Hallor.\r\n\r\n‘You never found one in San Diego though?’ Mr Blacher asked.\r\n\r\n‘I would say at the port of San Diego we have not,’ Mr Hallor said.\r\n\r\n‘Have you found one in San Diego?’ Mr Blacher asked.\r\n\r\nThe interview was then interrupted and cut short by a public relations official before Mr Hallor was able to answer the question.\r\n\r\nSan Diego's Customs and Border Protection agency was unavailable for comment today.\r\n\r\nEarlier, Mr Hallor told Mr Blacher: ‘Potentially every city in America is a target. Given the waterways and the access to the Navy fleet here, I’d say, absolutely, San Diego is a target.\r\n\r\n‘Our overall arching mission is to protect the American homeland against terrorists and from weapons of mass effect from entering the country. We are the guardians of America’s borders.’\r\n\r\nHe was explaining how the port checks cargo ships arriving at the port. He suggested the customs ‘partner agencies’ may have found the 'weapons of mass effect.'\r\n\r\nFormer Secret Service agent and airline security director Glen Winn told 10News Mr Hallor’s comments appeared to be credible.\r\n\r\n‘This person was, I believe, knowledgeable, has a very important position with the port and the government and as such has that knowledge,’ he said.\r\n\r\n‘You posed some very serious questions as to security gaps and discoveries that perhaps have taken place in this area.\r\n\r\n'I want to know how many and where did you find them so if I'm in that area, driving around and I see something that is out of place, I make a phone call,’ he added.\r\n\r\nBut 10News said a spokesman for the Department of Homeland Security told them Mr Hallor was 'just nervous' in the interview and 'mis-spoke'.\r\n\r\nThe spokesman denied officials said weapons of mass destruction had never been found in the U.S.- but would not answer questions about dirty bombs or chemical weapons.\r\n\r\nAfter the interview, the Customs and Border Protection department in San Diego issued a statement denying it had dealt with any nuclear-related smuggling attempts.\r\n\r\n‘CBP has not specifically had any incidents with nuclear devices or nuclear materials at our ports of entry,’ it said.\r\n\r\n‘CBP is an all-threats agency. The purpose of many security measures is to prevent threats from ever materializing by being prepared for them.\r\n\r\n'And, we must be prepared to stop threats in whatever form they do materialise at the border, whether it’s an individual or cargo arriving by land, air, or sea.\r\n\r\n'Regardless of what the contraband or threat is, we’re being smart, evaluating, and focusing in on anything or anyone that is potentially high-risk.’\r\n\r\nNo WMDs have ever been smuggled into the US, or, a least, none have been disclosed.\r\n\r\nThere were reports more than six years ago that al Qaeda was planning to try and sneak a bomb through a secret tunnel into Arizona from northern Mexico, although it was never substantiated. Just last year, a 2,200 ft cross-border drugs tunnel was discovered in San Diego, complete with lighting and ventilation.\r\n\r\nOne reason for covering up a known attempt would be to prevent public panic. Just three days ago, acting Inspector General of the Department of Justice, Cynthia Schnedar, criticised U.S. efforts to prepare for a potential WMD attack as 'uncoordinated and fragmented'.\r\n\r\nWhile the FBI had made adequate precautions for dealing with a WMD fallout, other branches of the DOJ were not sufficiently ready.\r\n\r\nWith the exception of the FBI, other departments had no training, did not participate in drills and had not selected an individual to take charge over WMD response operations, she said.\r\n\r\n'In addition, while the department had designated the Bureau of Alcohol, Tobacco, Firearms and Explosives as the lead agency to coordinate the use of federal law enforcement resources to maintain public safety and security if local and state resources are overwhelmed during a WMD incident, ATF had not adequately prepared for this role,' she added.\r\n\r\nA year ago, the Commission on the Prevention of Weapons of Mass Destruction Proliferation and Terrorism said the U.S. government should be doing more to prevent the nuclear threat.\r\n\r\nWork to improve the nation's response to biological attacks and efforts to reform intelligence gathering and other aspects of homeland security all received an 'F' on the report.\r\n\r\nhttp://www.dailymail.co.uk/news/article-1356645/A-weapon-mass-destruction-U-S--Shock-confession-Customs-officer.html", "group_id": 3920, "id": 118670}]