[{"user_id": 4219, "stars": [], "topic_id": 14366, "date_created": 1300760819.530972, "message": "or are they both pretty much covered in the docs?", "group_id": 81, "id": 404512}, {"user_id": 22713, "stars": [], "topic_id": 14366, "date_created": 1300762254.770858, "message": "for my is goog for a newbie", "group_id": 81, "id": 404621}, {"user_id": 19403, "stars": [], "topic_id": 14366, "date_created": 1300775044.7766869, "message": "Dave Beazley's book is excellent and well worth the money.  This and Marty Alchin's Pro Python will give you deep understanding of the language.  Dave's book is invaluable on an everyday basis because of the real world examples and the extremely clear writing.", "group_id": 81, "id": 405143}, {"user_id": 25149, "stars": [], "topic_id": 14366, "date_created": 1301043901.7537501, "message": "I found Python Web Development with Django by Jeff Forcier, Paul Bissex and Wesley Chun very helpful in the beginning.", "group_id": 81, "id": 436988}, {"user_id": 13912, "stars": [], "topic_id": 14366, "date_created": 1301046223.7836781, "message": "It's definetly worth buying after you have some grasp of the basic to intermediate stuff - after you've built a simpler project or two", "group_id": 81, "id": 437264}, {"user_id": 13912, "stars": [], "topic_id": 14366, "date_created": 1301046058.0252621, "message": "Pro Django is a very good book. Most of it is not covered in the docs. It also has background on advanced Python that's not covered in the docs.", "group_id": 81, "id": 437234}, {"user_id": 13912, "stars": [], "topic_id": 14366, "date_created": 1301046067.1028221, "message": "But it's not for beginners.", "group_id": 81, "id": 437237}, {"user_id": 16570, "stars": [], "topic_id": 14366, "date_created": 1301046258.6426089, "message": "Learning Python (or the myriad tutorials on the 'net) is a good start, especially if you've never touched Python before. But after that, do the official tutorial in the docs & then start with James Bennett's Practical Django Projects (2nd Ed!). It's up to date (for 1.1, so only now is it a tad outdated with the class-based views change in 1.3), and is very pragmatic in its approach. This is how I started out & I found it a great process.", "group_id": 81, "id": 437266}, {"user_id": 3978, "stars": [], "topic_id": 14366, "date_created": 1301083402.7461801, "message": "@miskerik +1 for Python Web Development with Django. It was my first intro to Django/Python and helped a ton, especially with getting a handle on basic Python stuff.", "group_id": 81, "id": 442105}, {"user_id": 2116, "stars": [], "topic_id": 14366, "date_created": 1301228020.0796461, "message": "For a newbie, i'll recommend you reading DiveIntoPython from Mark Pilgrim to start with Python, then a good start to Django is the Django documentation. In the meantime, you can check out the Definitive Guide to Django - Development done right from Jacob Kaplan Moss and Adrian Holovaty (Django founders), although quite outdated. Then, go ahead and read Practical Django Projects from James Bennett (Django Release Manager). Once there, give you the opportunity to read ProDjango, as it's a definitive Bible both for Python and Django advanced techniques. IMHO, a must read you have to have on your shelves.", "group_id": 81, "id": 450810}, {"user_id": 207, "stars": [], "topic_id": 14366, "date_created": 1301502158.37181, "message": "I'd also argue against Pro Django for someone new to the craft. You don't have to be an expert to read it, but it's really not written for beginners, so it's best to get some background elsewhere first.", "group_id": 81, "id": 482762}, {"user_id": 24930, "stars": [], "topic_id": 14366, "date_created": 1301501306.686949, "message": "@seanbrant Did you have prior programming language skills?", "group_id": 81, "id": 482649}, {"user_id": 3978, "stars": [], "topic_id": 14366, "date_created": 1301501411.2957301, "message": "@jngox3 just php", "group_id": 81, "id": 482677}, {"user_id": 3243, "stars": [], "topic_id": 14366, "date_created": 1301540655.865237, "message": "+1 for James Bennett's Practical Django Projects. The Apress Django E-Comm book isn't bad and the Django Testing book is great.", "group_id": 81, "id": 487377}]