[{"user_id": 19854, "stars": [], "topic_id": 17395, "date_created": 1302017433.0419109, "message": "I should probably answer my own question.  Modal realism doesn't seem right to me (it seems like a ton of metaphysical machinery for a fairly unsatisfying reductionist view).  I actually think the same about Plantinga worlds---they bring a lot of ontological baggage and practically zero explanatory power.  At least so far as the main options go, I'm dissatisfied with my choices.  I'd like a theory that either (a) explains modality or (b) has ontological costs but provides some explanatory benefits.  I'm not sure what that looks like, though.", "group_id": 6186, "id": 542209}, {"user_id": 19854, "stars": [], "topic_id": 17395, "date_created": 1302017153.288101, "message": "So far as I can tell, most people accept one of two theories of modality: (1) a Plantinga-world style actualism (most likely either Plantinga's view or a slightly modified version of that view), or (2) a sort of hybrid view that isn't actually modal realism but takes modal realism to be a helpful way to think about things, even though it is false.  I don't see many people actually embracing modal realism.  And though there are a few other options (like fictionalism and conventionalism), they aren't terribly popular.  So my question is this: whatever your view, are you happy with it?  Here are some more specific questions: if you endorse, e.g., the Plantinga view, do you endorse it because it seems right, or because it is the least-bad option? Do you fully accept it, or are you worried about parts of it?  Are you committed to that view, or would you abandon it for another if you could?  What would it take for you to abandon the Plantinga view?  Those are a lot of questions.  I just want to open the question up and see what people think.", "group_id": 6186, "id": 542147}, {"user_id": 19854, "stars": [], "topic_id": 17395, "date_created": 1302028976.2146859, "message": "@bmcd I knew I would bait someone into a reply with my unsubstantiated, overstated worries!  Tell me where I'm wrong, but it sounds like you only like Plantinga-style modality because (a) it isn't one of these bad options and (b) you like the work they do in the philosophy of time.  That certainly makes them preferable to other options, but it is a pretty weak endorsement.", "group_id": 6186, "id": 544492}, {"user_id": 22361, "stars": [], "topic_id": 17395, "date_created": 1302028390.018589, "message": "I'd say I'm reasonably happy with Plantinga-world-style actualism. I don't currently feel any need to abandon this type of actualism. I take it to be preferable to modal realism, fictionalism, and conventionalism. But that's at least partly because I find the latter three views completely unattractive. Not sure if Plantinga-style worlds have \"practically zero explanatory power\". If explanatory power is tied closely to reductionism, then they do very little explanatory work. But I don't think explanatory power needs to be tied so closely to reductionism. I think construing times similarly to Plantinga-style worlds (i.e. taking both times and worlds to be maximal propositions) is useful when formulating presentism, but I've not thought as much about their utility in the modal realm. When I do worry about Plantinga-style actualism, what worries me is usually objections having to do with whether worlds are maximal propositions, or maximal sets of propositions; the latter are problematic (if I remember Chihara correctly), but if one abandons maximal sets of propositions for maximal propositions, then I suppose there's a worry about whether the latter are even well-defined entities.", "group_id": 6186, "id": 544358}, {"user_id": 22361, "stars": [], "topic_id": 17395, "date_created": 1302028478.761389, "message": "And I don't really think that Plantinga-style worlds \"bring a lot of ontological baggage\".  I have other reasons to believe in abstracta; so I don't think believing in Plantinga's worlds adds anything I wasn't already committed to.", "group_id": 6186, "id": 544367}, {"user_id": 19854, "stars": [], "topic_id": 17395, "date_created": 1302029329.0650361, "message": "I thought an Enter would give me a line break, not submit my post.  This continues the above:  I don't think this is no support---it might be the best support we can get for a view of modality.  But I guess I just wonder if that is all the support to be had.", "group_id": 6186, "id": 544609}, {"user_id": 22361, "stars": [], "topic_id": 17395, "date_created": 1302030370.072324, "message": "I had the same problem with pressing Enter.  Your (a) and (b) sound right to me.  And I think you're also right that, so far, those aren't especially strong reasons.", "group_id": 6186, "id": 544862}, {"user_id": 19854, "stars": [], "topic_id": 17395, "date_created": 1302030991.2322209, "message": "@bmcd Cool.  That seems defensible and reasonable to me, I was just curious if that is what is going on for people.  Thanks for the replies.", "group_id": 6186, "id": 545035}]