[{"user_id": 2360, "stars": [], "topic_id": 2795, "date_created": 1297293116.2131259, "message": "Hey guys, well as the title says I have just recently got my first DSLR which is a Canon 1000D, this is my first proper camera so any tips would be great.", "group_id": 516, "id": 59809}, {"user_id": 3531, "stars": [], "topic_id": 2795, "date_created": 1297302260.3579471, "message": "Read the manual! Seriously, I know it sounds lame, but the Canon manuals are actually pretty good (I'd recommend at least skimming). Even if you don't understand the manual fully, it gives you some nice terminology that you can Google for more info.", "group_id": 516, "id": 62561}, {"user_id": 874, "stars": [{"date_created": 1305350928.1725211, "user_id": 2671}], "topic_id": 2795, "date_created": 1297313286.619103, "message": "You're going to love it. Don't be afraid of \"M\" manual mode or manual focus. Move with your feet, not your zoom. Use the highest number f-stop (in manual mode) you can before things get too dark. Use a card reader ($10), not a USB cable into the camera. Have fun.", "group_id": 516, "id": 64922}, {"user_id": 3531, "stars": [], "topic_id": 2795, "date_created": 1297314732.8071079, "message": "Moving with your feet and not the zoom is a very good point and just reminded me to link this: http://mschade.me/video-of-s2-years10-minutes-of-photography-a -- Warning that it's a shameless plug, but I'm not beyond that, so I'll go with it anyway. The link contains a short video of a presentation that I gave at this year's Strange Loop where I discuss the key points I've taken out of my two years of photography (now nearing three).", "group_id": 516, "id": 65193}, {"user_id": 594, "stars": [{"date_created": 1305350991.2003379, "user_id": 2671}], "topic_id": 2795, "date_created": 1297316787.4085929, "message": "When you have more money to spend, save it up for good lenses, rather than another camera upgrade. Lenses are more important once you're into a decent-grade  camera body.", "group_id": 516, "id": 65770}, {"user_id": 5356, "stars": [{"date_created": 1305351005.495918, "user_id": 2671}], "topic_id": 2795, "date_created": 1297339140.3306351, "message": "@modband Using the highest f-stop won't necessarily give you the desired outcome - it all depends on what you are trying to achieve (e.g. depth of field, shutter speed).", "group_id": 516, "id": 68627}, {"user_id": 874, "stars": [], "topic_id": 2795, "date_created": 1297341197.209188, "message": "@zeevb Closing the aperature just before things get too dark, then moving on to shutter speed and finally ISO seems to work pretty well for me. But sure, you can aim to achieve many things. I was addressing one of that many. Cheers.", "group_id": 516, "id": 68807}, {"user_id": 5356, "stars": [], "topic_id": 2795, "date_created": 1297412415.380084, "message": "@modband an example: if you want a shallow depth of field then you would try to open the aperture as wide as possible for the shot", "group_id": 516, "id": 79106}, {"user_id": 9763, "stars": [], "topic_id": 2795, "date_created": 1297765771.9434199, "message": "And stopping down to the highets possible f number can lead into diffraction -> http://en.wikipedia.org/wiki/Diffraction. Usually a Lens performs best at about 2 f stops higher as written on the Lens.", "group_id": 516, "id": 110126}, {"user_id": 874, "stars": [], "topic_id": 2795, "date_created": 1297791923.2827229, "message": "The good part about your new DSLR is the \"D\" part. You can play with the f-stop, learn what it does for the situation you're in, see the results immediately and go from there. You'll soon develop a method that works best for you. Without the cost of paying for dozens of bad prints. :)", "group_id": 516, "id": 113099}, {"user_id": 17551, "stars": [], "topic_id": 2795, "date_created": 1299144132.256156, "message": "5 years ago I bought a Nikon 8800. I should have bought a DSLR but they were just coming out then. This camera has served me well. I have taken 20,000 photos with it. Like this photo at Horizons Restaurant in Sausalito a couple weeks ago. https://lh4.googleusercontent.com/_ECPbaaEoSI8/TVj2XJ-XkrI/AAAAAAAAPB4/MbrnTsVYGEg/s800/DSCN7712.JPG", "group_id": 516, "id": 259252}, {"user_id": 1629, "stars": [], "topic_id": 2795, "date_created": 1300110090.722158, "message": "My tip is look at photos on flickr taken by your camera. It's easy to make the excuse that I don't have enough gear, etc. Just look at what people can do! Here's yours: http://www.flickr.com/cameras/canon/eos_digital_rebel_xs/", "group_id": 516, "id": 347293}, {"user_id": 2360, "stars": [], "topic_id": 2795, "date_created": 1300130224.0124691, "message": "Thanks for all the tips guys, going to start of with the manual have it downloaded on to  my iPad ;)", "group_id": 516, "id": 349940}, {"user_id": 22138, "stars": [], "topic_id": 2795, "date_created": 1300412353.5516019, "message": "completely agree w/ @evan.  be sure to check out flickr's most interesting photos for some inspiration, http://www.flickr.com/explore/interesting/7days/", "group_id": 516, "id": 379008}, {"user_id": 22212, "stars": [], "topic_id": 2795, "date_created": 1301232453.837796, "message": "Nikon D90 is where it's at!", "group_id": 516, "id": 450988}]