[{"user_id": 17551, "stars": [], "topic_id": 10446, "date_created": 1299140834.777518, "message": "Amber had on the CEO of Convore, now all the world knows about it. See ya geeks! Time to bug out, here comes the rest of the world. I think this could be really big. I like that I can just keep typing and say what ever I want without a worry, it's pretty cool, ok I'm done! Thanks Amber!", "group_id": 5074, "id": 259055}, {"user_id": 17298, "stars": [], "topic_id": 10446, "date_created": 1299147817.9123349, "message": "bump", "group_id": 5074, "id": 259415}, {"user_id": 13888, "stars": [], "topic_id": 10446, "date_created": 1299150477.9540031, "message": "it was a great show. I listened to audio podcast while commuting to work and enjoyed it a lot.", "group_id": 5074, "id": 259553}, {"user_id": 17551, "stars": [], "topic_id": 10446, "date_created": 1299150856.465656, "message": "@stefanCH I listened the same way today. I actually didn't like Convore till I heard the show. Now I love it, I think it could be really a big deal.", "group_id": 5074, "id": 259578}, {"user_id": 17629, "stars": [{"date_created": 1299178992.7849331, "user_id": 17551}], "topic_id": 10446, "date_created": 1299154740.8719089, "message": "I signed up here only because I heard the interview.  This does seem like a very nice format for dynamic conversation. I listen to other TWiT shows via my phone using Google's Listen.  I stumbled on the Convore interview when I tried the Stitcher app on my phone so I could listen to Kevin Smith's Smodcasts.", "group_id": 5074, "id": 259775}, {"user_id": 13888, "stars": [], "topic_id": 10446, "date_created": 1299236370.336477, "message": "@DanB I also use Google listen. Thanks for mentioning Stitcher. I never used or studied it. How does it compare or differ from google listen? \nNext net@night they invited Guy Kawasaki. That should be fun!", "group_id": 5074, "id": 268890}, {"user_id": 18713, "stars": [], "topic_id": 10446, "date_created": 1299254094.1713171, "message": "Google Listen is fine for audio-only podcasts, but BeyondPod is way better.  It's not free, but it supports both audio and video feeds (the only limitation is the video formats supported by your device.  Great landscape mode with extra large buttons if you're driving.  Smart playlists, sleep mode, Google Reader synchronization and many other options available.  And specifically for TWiT, the Mediafly TWiT app is awesome!", "group_id": 5074, "id": 270564}, {"user_id": 18924, "stars": [{"date_created": 1299354441.677021, "user_id": 1}], "topic_id": 10446, "date_created": 1299327570.824209, "message": "Watching the net@night replay of Covore. I like it so far.", "group_id": 5074, "id": 276140}, {"user_id": 18922, "stars": [], "topic_id": 10446, "date_created": 1299327486.5166759, "message": "Computer Science: Syntax for expressing thought.  What an amazing art form.  Love Twit. Leo, you rock.", "group_id": 5074, "id": 276138}, {"user_id": 18922, "stars": [{"date_created": 1299354443.6287241, "user_id": 1}], "topic_id": 10446, "date_created": 1299329386.0057001, "message": "I'm interested to see what this evolves into.", "group_id": 5074, "id": 276153}, {"user_id": 19032, "stars": [], "topic_id": 10446, "date_created": 1299372209.9453781, "message": "The best part of last Tuesday's show was not convore.com but a new travel flight website hipmunk.com.  A much nicer way to display flights and connections.", "group_id": 5074, "id": 278094}, {"user_id": 19109, "stars": [], "topic_id": 10446, "date_created": 1299432332.726439, "message": "I find myself more and more using the Apple TV to catch up with shows like Net@night and audio when travelling transatlantic probably that will change soon too!", "group_id": 5074, "id": 281033}]