[{"user_id": 11626, "stars": [], "topic_id": 21552, "date_created": 1303872459.2628231, "message": "http://www.infowars.com/investigation-government-ordered-cellphone-companies-to-spy-on-users\r\n\r\n\r\nInvestigation: Government Ordered Cellphone Companies to Spy on Users\r\nPaul Joseph Watson & Alex Jones\r\nInfowars\r\nApril 25, 2011\r\n\r\nThe controversy generated as a result of computer researchers discovering a hidden file that allows Apple to track the location of iPhone and iPad users has been treated as a shocking revelation by the media, and yet since October 2001, the FCC has mandated that all wireless carriers track the location of their users down to within 50 feet.\r\n\r\n“Stunned iPhone and iPad owners have only just found out that all of their movements are tracked and stored in a hidden iOS file which gets synced to their PC every time they connect the phone,” reports Gadgets and Gizmos. “The name of the file is Consolidated.db and it uses the Apple devices’ GPS function to record your location and the time you were there.”\r\n\r\nThe secret file was found by computer experts and made public at the recent Web 2.0 conference in San Francisco.\r\n\r\nThe Wall Street Journal expanded on the revelations surrounding Apple on Friday by reporting that Google’s Android smart phones also, “Regularly transmit their locations back to…Google, according to data and documents analyzed by The Wall Street Journal—intensifying concerns over privacy and the widening trade in personal data.”\r\n\r\nTechnology writers are seemingly baffled as to why top smart phone producers like Apple and Google are tracking the movements of their users, while lawmakers have also begun asking questions of Apple CEO Steve Jobs.\r\n\r\nA bizarre initial reaction to the story from some quarters of the media and industry centered around the suggestion that the hidden file was “actually a bug which Apple should be looking to fix,” a theory dismissed almost instantly after it was confirmed other smart phone manufacturers were also tracking their users and that such efforts were “clearly intentional, as the database is being restored across backups, and even device migrations.”\r\n\r\nIndeed, as much as a year ago Apple admitted to the fact that it “intermittently” collects location data, including GPS coordinates, of many iPhone users and nearby Wi-Fi networks and transmits that data to itself every 12 hours, according to a letter the company sent to U.S. Reps. Edward Markey (D-Mass.) and Joe Barton (R-Texas),” reports the WSJ.\r\n\r\nGoogle’s HTC Android phones collect location data every few minutes and transmit that information directly to Google several times an hour, including the unique phone identifier, meaning that Google can keep tabs on the movement of a known individual almost constantly. Since people now ubiquitously carry their cellphones everywhere they go, this is akin to having a tracking microchip implanted in your forehead.\r\n\r\nHowever, far from being a recent phenomenon, as the media would have us believe, tracking of individuals via their cellphones has been going on for almost ten years at least.\r\n\r\nUnder the 1996 Telecommunications Act, the FCC mandated that by October 1, 2001 a quarter of all new cellphones be equipped with GPS functionality that would allow authorities to track the location of users. By the end of 2002, this became a mandatory requirement of all new cellphones.\r\n\r\nAs Geek.com reported back in October 2001, “Because cellphone calls to 911 (estimated at around 140,000 per year) do not give the 911 operator location information, the FCC mandated that wireless companies “be able to locate 67 percent of callers to 911 within 50 meters that elect the handset solution while those using network technology must be able to locate the caller within 100 meters.” Wireless companies must also have one-quarter of the new cellphones they offer equipped to provide that location information by the end of the year, and all new cellphones so equipped by the end of next year.”\r\n\r\nAs a PC World article written in August 2001, two months before the first phase of the new FCC rules were enacted, asked, “The FCC requires cell phone companies to track you, in order to find you when you call 911–but what about your privacy?”\r\n\r\n“Cell phone tracking was propelled by the Federal Communications Commission, which adopted enhanced 911 rules to cover wireless services. For E911′s first phase, cellular carriers must be able to pinpoint, to the nearest cell tower, the location of someone calling 911. For Phase II, carriers must be able to pinpoint a 911 caller’s location to within 50 to 300 meters,” states the article.\r\n\r\nYour cellphone has been tracking you in real time for the lion’s share of the last decade, so why has it taken the media nearly 10 years to notice? Because in 2001, when such measures could have been made illegal, there was no iPhone, there was no app store, and the smart phones being used were extremely crude compared to today’s models, which are no less than mini-laptops.\r\n\r\nIn 2001, cellphones did little else than make calls and send text messages – these services didn’t require GPS technology. People weren’t addicted to their cellphones like they are today, they didn’t use them to catalogue, record and process every aspect of their existence.\r\n\r\nThe likes of Apple have worked hard over the last decade to make hundreds of millions of people dependent on their gadgets, creating an army of addicts who couldn’t care less that their cellphone is transmitting their every move directly to Steve Jobs. In their eyes, the choice between sacrificing their privacy and sacrificing their precious “apps” is an easy one to make. Privacy can’t book a table at a restaurant in a few taps of a finger, nor can it tell you the weather forecast or where the nearest ATM is located.\r\n\r\nIf the debate had been allowed to run its course in 2001, when cellphone tracking was first being adopted, the outcome may have been different. But since cellphone companies have been tracking their users for the best part of a decade, in line with government mandates, the recent controversy is merely part of the acclimatization process to achieve calm subservience and acceptance of the fact that true privacy is dead, and as Henry Blodget explains, Apple’s omnipresent brainwashing campaign has helped keep the outrage to a minimum.", "group_id": 3920, "id": 821043}]