[{"user_id": 11626, "stars": [], "topic_id": 40744, "date_created": 1309372239.3673019, "message": "Brennan: Focusing on Al Qaeda Inspires Internal Attack\nWired's Danger Room (via Twitter)\nJune 29, 2011\n\nFrom advance text of WH's Brennan's counterterrorism speech: focusing on AQ 'inspire ppl in the US to attack us from within'\nhttp://twitter.com/dangerroom#\n\nNY Times reporter may have to testify against ex-CIA agent from O'Fallon, MO\nSTL Today\nJune 29, 2011\n\nIn a legal opinion unsealed Tuesday, a federal judge indicated that she might require a New York Times reporter who wrote a book about the CIA to testify at the trial of a former CIA officer from OFallon, Mo., accused of leaking classified information. The reporter, James Risen, wrote about a secret program aimed at disrupting Iran's [alleged] quest for nuclear weapons in his 2006 book \"State of War.\" Jeffrey Sterling, who served on the CIA's Iranian desk, is accused of leaking secrets to Risen.\nhttp://www.stltoday.com/news/national/article_0ff82cbf-970f-5d91-9d54-469be7df94b3.html\n\nSummer holiday could tempt terrorists, federal officials warn\nCNN\nJune 29, 2011\n\nThere is \"no specific or credible information\" terror groups are planning to attack the United States during the summer holiday season but law enforcement agencies should remain vigilant, the FBI and Department of Homeland Security say in an intelligence bulletin. The death of al Qaeda [al-CIAduh] leader Osama bin Laden could spur lone offenders to try an attack on a holiday like July Fourth to \"increase the symbolic impact,\" they say.\nhttp://edition.cnn.com/2011/US/06/28/terror.attack.vigilance/\n\nDrills Action Video: Taiwan military repel nuclear & biological attacks\nRussia Today\nJune 29, 2011\n\nOver a thousand people took part in Taiwanese military drills to simulate potential nuclear and biological attacks. The country's military police and firefighters also re-enacted a hostage situation on a bus and a biological attack on board a ship. Government officials say the drills are aimed at improving the response to unconventional warfare.\nhttp://www.youtube.com/watch?v=mMqeVehU3cc\n\nIran secretly tested 'nuclear-capable missiles'\nAFP\nJune 29, 2011\n\nLONDON — Iran has carried out secret tests of ballistic missiles capable of delivering a nuclear payload in breach of UN resolutions, British Foreign Secretary William Hague said Wednesday. Hague's comments came a day after Iran's elite Revolutionary Guards said they had fired 14 missiles in an exercise, one of them a medium-range weapon capable of striking Israel or US targets in the Gulf. In a statement to lawmakers, Hague said: \"Iran has also been carrying out covert ballistic missile tests and rocket launches, including testing missiles capable of delivering a nuclear payload in contravention of UN resolution 1929.\" He said Iran had also announced plans to triple its capacity to produce 20 percent enriched uranium, adding: \"These are enrichment levels far greater than is needed for peaceful nuclear energy.\nhttp://www.google.com/hostednews/afp/article/ALeqM5hnl-YPuDmONcoBmmS8_G91LxdryA?docId=CNG.041943dc452c61a507ee986061b49f2d.f21\n\nDHS Secretary Napolitano launches Faces of Homeland Security: Heroes on the Front Lines\nDHS\nJune 29, 2011\n\nOur guiding principle here at DHS is that homeland security begins with hometown security. All across the country, remarkable Americans – from our military, police & 1st responders to heroic citizens – work every day to protect & defend our country & keep our communities safe. As we approach the 10th anniversary of September 11th, we are launching a new initiative, Faces of Homeland Security: Heroes on the Front Lines to share some of the remarkable stories behind the men & women of DHS & our local partners who have been working at every level to prevent terrorism, secure our borders, enforce our immigration laws, safeguard cyberspace & prepare for, respond to & recover from disasters.\nhttp://www.dhs.gov/xabout/faces-of-homeland-security.shtm\n\nBin Laden Killing Team May Have Used Night Vision Contact Lenses\nGizmodo\nJune 28, 2011\n\nChristian at Military.com's Kit Up! has heard an interesting rumor on one of the technologies that Seal Team 6 used to kill Osama bin Laden: Night vision contact lenses! Holy pants, Batman. \"I heard a rumor that the Team guys who busted bin Laden might have been wearing 'cat vision' contact lenses that literally give the wearer night vision for a limited time without having to wear the bulky, heavy NVGs\"....\nhttp://gizmodo.com/5816382/bin-laden-killing-team-may-have-used-night-vision-contact-lenses\n\nCIA wins suit against ex-officer who published unapproved book\nPOLITICO\nJune 28, 2011\n\nA federal judge in Virginia has ruled that a former covert CIA officer violated an agreement with the CIA by failing to obtain its approval before publishing a highly critical book about his work there. U.S. District Court Judge Gerald Lee ruled last week that the former CIA operative, who wrote and was sued by the government under the pseudonym Ishmael Jones, breached the agreement that requires agency personnel to seek pre-publication review of books and articles. In the next phase of the case, Lee will decide what monetary damages or other relief the CIA is entitled to. The book Jones published in 2008, \"The Human Factor:  Inside the CIA's Dysfunctional Intelligence Culture,\" is harsh toward what the former deep-cover officer who worked on nuclear proliferation issues considered widespread mismanagement at the spy agency.\nhttp://www.politico.com/blogs/joshgerstein/0611/CIA_wins_suit_against_exofficer_who_published_unapproved_book.html\n\nActually, Special-Ops ‘Night Raids’ Are Rather Gentle\nWired's Danger Room\nJune 28, 2011\n\nAccording to Vice Adm. William McRaven [soon to be the next leader of US Special Operations Command], they’re far from the shoot-’em-ups that the media portrays. McRaven’s team has conducted over 1700 night raids in the past year alone, he disclosed. Of those, McRaven said, the vast majority — “approximately 84 to 86 percent” — “never fire a shot.” “Every operation,” McRaven told the Senate panel... is accompanied by Afghan troops, who “are always in the lead during entry of compounds & call outs.” Teams of women accompany the raids to “reassure women & children” in Afghan compounds that “everyone is going to be safe.” Stopping the raids, as Karzai wants, would “certainly be detrimental to the special operations aspect to the fight in Afghanistan,” McRaven said.\nhttp://www.wired.com/dangerroom/2011/06/actually-special-ops-night-raids-are-rather-gentle\n", "group_id": 3920, "id": 1519741}]