[{"user_id": 13507, "stars": [{"date_created": 1312011314.591517, "user_id": 13735}, {"date_created": 1312050431.9739051, "user_id": 218}], "topic_id": 42239, "date_created": 1311942908.3622489, "message": "motivation: that it would actually have the potential to go live", "group_id": 292, "id": 1746874}, {"user_id": 12404, "stars": [], "topic_id": 42239, "date_created": 1312047390.3858809, "message": "$$$$$ i don't do stuff for free... that's just stupid", "group_id": 292, "id": 1755206}, {"user_id": 1398, "stars": [{"date_created": 1312095967.1925631, "user_id": 38714}], "topic_id": 42239, "date_created": 1312047158.1057019, "message": "Developers need pay. So that means you either pay them the appropriate hourly rate, or if you offer them equity, you should give them at least 50% since they are doing all the hard work.", "group_id": 292, "id": 1755190}, {"user_id": 38589, "stars": [], "topic_id": 42239, "date_created": 1312092150.988483, "message": "@tbatterii \"stupid\" is a bit strong but I'd definitely say either \"mistake for young players\" or \"recipe for madness and frustration\"", "group_id": 292, "id": 1757748}, {"user_id": 19520, "stars": [{"date_created": 1312147166.9833801, "user_id": 5778}, {"date_created": 1314114456.7309251, "user_id": 40122}], "topic_id": 42239, "date_created": 1312124134.203299, "message": "Developers definitely need pay but 50% is far too little up front, make business guy \"earn-out\" his share. eg. two developers, one business guy. Development almost always occurs first, so devs take 90% (45% each) biz dude gets 10%. Goal is that all partners would eventually own 1/3, so I say simple reciprocity states that since devs have delivered code, the biz dude should have to deliver a set threshold of some deals a/o sales to have his stake increase to 1/3. Otherwise you're giving away to much in the beginning. Biz dude has little value without producing revenue just like dev dudes have little value without delivering code. Discuss this arraignment with your potential biz partner and see how committed they really are to the project and how much confidence they have in their own skills. If they won't take a risk on their own skills, why should you?", "group_id": 292, "id": 1758876}, {"user_id": 28529, "stars": [], "topic_id": 42239, "date_created": 1312128162.944607, "message": "That's one of the most equitable ( from a developer point of view ) that I've ever heard.", "group_id": 292, "id": 1759097}, {"user_id": 1398, "stars": [], "topic_id": 42239, "date_created": 1312180395.225745, "message": "@macnpy - So long as the total engineers and developers take home more than 50% I'm happy. It's when they do all the work, including a large part of the marketing, and then get shafted when things get started that turns me off. I see it again and again.", "group_id": 292, "id": 1763602}, {"user_id": 12404, "stars": [], "topic_id": 42239, "date_created": 1312197877.0385759, "message": "@elena from a purely economic point of view, I don't think stupid is too strong. your time and effort is your scarce resource, it is up to you ultimately to maximize your compensation for your time and effort. there's plenty of these \"start-up\" types that would love to exploit you(been there done that) and it would be really stupid of you to allow yourself to be exploited. As far as risk goes, if you are the one constructing the software, your risk is trusting the start-up guy to be able to deliver on his/her promise because ultimately you are building them what they want and trusting their judgement that this is what they can make money on. To do that without fair compensation or some tangible promise of compensation that is acceptable to you is again, plain stupid.", "group_id": 292, "id": 1764917}]