[{"user_id": 6730, "stars": [], "topic_id": 21259, "date_created": 1303752844.4581621, "message": "Hi TWIST fans! Tomorrow at 1pm PST we broadcast Jason's pre-recorded interview with Wanderfly CEO and co-founder Evan Schneyer. If you have a question for Evan, post it here -- he'll join the chat during the show.", "group_id": 4530, "id": 805351}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303757479.9057441, "message": "@rk... ditto", "group_id": 4530, "id": 806046}, {"user_id": 1381, "stars": [], "topic_id": 21259, "date_created": 1303757177.258019, "message": "Hmm, wonder what's going on with TWIST lately. Been pre-recorded a lot lately, takes a lot of the \"This week in\" out of TWIST.", "group_id": 4530, "id": 805981}, {"user_id": 6730, "stars": [], "topic_id": 21259, "date_created": 1303757553.692292, "message": "@rk @mpressme We are at the mercy of Jason's schedule -- we are live when we can be!", "group_id": 4530, "id": 806065}, {"user_id": 6730, "stars": [], "topic_id": 21259, "date_created": 1303757569.871814, "message": "This Friday is a live news roundtable, and we have live shows for Tuesday and Friday next week.", "group_id": 4530, "id": 806072}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303758492.2828009, "message": "@kirinkalia... thanks for the advance notice... much appreciated ;)", "group_id": 4530, "id": 806207}, {"user_id": 14240, "stars": [], "topic_id": 21259, "date_created": 1303777165.021323, "message": "Some shows like Twit with Leo shouldn't be live...so there you go", "group_id": 4530, "id": 808454}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303827204.1646881, "message": "I wish that this was a live episode, the Wanderfly UI is awesome! Great job there! I just want to play with the thing.", "group_id": 4530, "id": 814767}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303827265.1927869, "message": "Q: How long did it take to develop the Wanderfly site?", "group_id": 4530, "id": 814788}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303827454.5979681, "message": "Q: What's been the biggest challenge competing in such a heavily saturated travel space?", "group_id": 4530, "id": 814833}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303848435.301182, "message": "@Mpressme thanks! yeah, we believe UX is everything. site took about 1 year from writing the first line of code to entering a closed beta. now we're working on v2 (launching in a couple weeks) and it's taken about 3 months -- it's a bit easier the second time around ;-)", "group_id": 4530, "id": 818325}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303848695.1915309, "message": "@evanschneyer the UX alone will get me to come back and use the platform. Sweet!", "group_id": 4530, "id": 818351}, {"user_id": 30309, "stars": [], "topic_id": 21259, "date_created": 1303849861.4317839, "message": "How long are investors giving you to break even on dev and operations costs ?", "group_id": 4530, "id": 818552}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303848752.457623, "message": "Q: What is the marketing plan for you guys to compete with the big guns like Expedia and Travelocity?", "group_id": 4530, "id": 818362}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303851065.632828, "message": "@louiseric yes, we have a separate board of advisors (full disclosure: jason is on it!). as a group they've been helpful... not as much as we'd like, but really that's on us -- we need to get into the habit of asking them for help more frequently since that's what they're there for :-)", "group_id": 4530, "id": 818727}, {"user_id": 30309, "stars": [], "topic_id": 21259, "date_created": 1303849184.195318, "message": "Are you building a product that you want to operate as a standalone business or are you setting it up as an acquisition candidate ?", "group_id": 4530, "id": 818425}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303851697.144145, "message": "i've gotta run guys (back to building!). thanks to TWIST for this and please feel free to drop me a line directly.", "group_id": 4530, "id": 818836}, {"user_id": 30302, "stars": [], "topic_id": 21259, "date_created": 1303851726.5076571, "message": "Thanks so much Evan!", "group_id": 4530, "id": 818842}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303849104.8780251, "message": "we're not competing on a targeted keyword basis (\"cheap hotels in miami\") because we're not a transaction site. people are coming to us much earlier in the process, so we're building in lots of social features that cater to that phase and make it natural for people to involve friends in the discovery and planning process.", "group_id": 4530, "id": 818418}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303849571.7487791, "message": "there's a big overlap in those two paths. we're working on building a sustainable business right now, which includes working with lots of larger partners and would-be-acquirers. so the stronger we are as a standalone business, the more attractive we'll be to an acquirer down the line.", "group_id": 4530, "id": 818483}, {"user_id": 31238, "stars": [], "topic_id": 21259, "date_created": 1303850958.171289, "message": "@evanschneyer Oh okay thanks. Gotta look into some more. Its my first business so.", "group_id": 4530, "id": 818709}, {"user_id": 31238, "stars": [], "topic_id": 21259, "date_created": 1303850561.436491, "message": "How big is your business plan? How many pages? Mine is around 12~ pages. (Still editing all the time as we build)", "group_id": 4530, "id": 818652}, {"user_id": 30309, "stars": [], "topic_id": 21259, "date_created": 1303850832.768667, "message": "Great answers; thanks. Do you have a board of advisors that is distinct from your board of directors or is that one and the same ? Does it provide useful value ?", "group_id": 4530, "id": 818698}, {"user_id": 30309, "stars": [], "topic_id": 21259, "date_created": 1303851148.7509561, "message": "How do you find great advisors ? Are they all reachable through your social circle or did you go and \"recruit\" them ? How do you motivate them to participate ?", "group_id": 4530, "id": 818745}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303850737.7874241, "message": "@louiseric we've got about a year of runway right now, but the goals for the year are more about creating sustainable traffic and engagement than breaking even", "group_id": 4530, "id": 818687}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303850898.5397401, "message": "@dbuizert i don't want to throw out a number because there's really no standard. it depends on what it's for, and obviously it depends on the business. in our case, there was a lot of complexity in everything from the technology to the business development and marketing plans, so there was a lot to plan out. plus we were submitting it to a formal competition so it had to be more polished and longer than it would have been if we'd just been doing it for ourselves as a prudent startup exercise.", "group_id": 4530, "id": 818704}, {"user_id": 13980, "stars": [], "topic_id": 21259, "date_created": 1303851094.406709, "message": "Just played with the product, very cool!", "group_id": 4530, "id": 818736}, {"user_id": 30309, "stars": [], "topic_id": 21259, "date_created": 1303851698.5964241, "message": "Thanks Evan. As a frequent adventure traveler I'm really happy to see a new idea in the market and see it so beautifully executed.", "group_id": 4530, "id": 818837}, {"user_id": 31228, "stars": [], "topic_id": 21259, "date_created": 1303851604.290293, "message": "all of the above. our experience with building a group of advisors is similar to a more general trend we keep seeing: once you figure out what you *want*, it starts working out in one way or another, because you tell people about it, they refer others, etc. it becomes a self-fulfilling prophecy at some point. as far as motivation, that's easy: stock options (you can google and find standard ranges for advisors) combined with the fun experience and cool factor of being involved with an exciting startup are generally more than enough to get people on board.", "group_id": 4530, "id": 818812}, {"user_id": 29769, "stars": [], "topic_id": 21259, "date_created": 1303852564.596231, "message": "thx Evan.. looking forward to the new version, especially if its better then this one!", "group_id": 4530, "id": 818946}]