[{"user_id": 11626, "stars": [], "topic_id": 6757, "date_created": 1297919918.5105209, "message": "Several developments within the last few days suggest that concern regarding rare earth metals is moving to the forefront of the U.S. security discourse. Last week the America Security Project, a non-profit public policy and research organisation, released a new report entitled \"Rare Earth Metals and U.S. National Security.\" The report states that China's dominance in the rare earths market will have serious implications for the U.S. national security within the next few years. The report focuses predominantly on the importance of REMs for military applications such as guided missiles and night vision goggles. In contrast, clean technology applications receive very little attention.\r\n\r\nThe report also makes a number of recommendations for the U.S. government to reduce America's dependence on Chinese REMs. These includes:\r\n\r\n- Stockpiling REMs\r\n\r\n- Developing new mines\r\n\r\n- Increasing international cooperation\r\n\r\n- Filing a World Trade Organisation dispute\r\n\r\n- Developing effective substitutes for REMs\r\n\r\n- Developing new technologies\r\n\r\nThe release of the report suggests that the constricted nature of the global REM market and principally its impact on the defence industry continues to cause concern amongst U.S. policymakers.\r\n\r\nDuring the same week, Senators Mark Begich and Lisa Murkowski (both from Alaska) and Representative Mike Coffman (Colorado) addressed a letter to the U.S. Secretary of Defence expressing concern about at militaries reliance on REMs. The letter states that the trade situation with China leaves the \"United States dependent on an unreliable foreign supplier\" with no active supply in the United States. The senators go on arguing that, \"rare earth supply limitations present a serious vulnerability to our national security.\" In concluding, the letter demands that the DOD propose \"real solutions in the soon-to-be-released National Defense Authorisation Act for 2011.\"\r\n\r\nWhatever policy measures are taken, it appears clear that this issue presents real headaches for the U.S. economy and particularly for the clean energy sector where REMs are critical to a host of technologies. We hope to bring you a more thorough evaluation of the consequences for the clean tech industry within the coming weeks.\r\n\r\nhttp://www.reuters.com/article/2011/02/15/idUS960537620110215", "group_id": 3920, "id": 129456}]