[{"user_id": 13695, "stars": [], "topic_id": 12386, "date_created": 1299863516.22281, "message": "Interested in hearing gaming techniques that keep users engaged", "group_id": 97, "id": 324722}, {"user_id": 17610, "stars": [{"date_created": 1299888454.2809279, "user_id": 10694}], "topic_id": 12386, "date_created": 1299866048.0330889, "message": "Achievements like badges on Miso and GetGlue; discounts like on 4sq.", "group_id": 97, "id": 325199}, {"user_id": 20661, "stars": [{"date_created": 1299888464.589628, "user_id": 10694}], "topic_id": 12386, "date_created": 1299874333.621778, "message": "I think the fact of being better than the rest of the players and winning some extra benefits is the main reason why this kind of apps are too successful. It's all about competitiveness and earning something.", "group_id": 97, "id": 326360}, {"user_id": 19848, "stars": [], "topic_id": 12386, "date_created": 1300028146.4075539, "message": "We keep waiting for the mayorships to start paying off. They best I've seen so far is $1 off a drink at a local Starbucks. There needs to be an incentive to keep people coming back. The mayor title only goes so far.", "group_id": 97, "id": 341172}, {"user_id": 9108, "stars": [], "topic_id": 12386, "date_created": 1300028296.848175, "message": "I think some of these services, especially GetGlue, need to make it rewarding without forcing their users to spam updates. I've unfollowed quite a few people on Twitter because every 5 minutes they had new GetGlue updates; it just gets irritating and also made me want to avoid GetGlue.", "group_id": 97, "id": 341187}, {"user_id": 12804, "stars": [], "topic_id": 12386, "date_created": 1300034741.642029, "message": "I think mayorship is good but badges and stickers need to go. It was fine when Foursquare started it but now ALL check-in services have them", "group_id": 97, "id": 341591}, {"user_id": 17610, "stars": [], "topic_id": 12386, "date_created": 1300035243.3721931, "message": "@JohnFail Yeah, the constant GetGlue updates are annoying.  I don't think it's forced as much as encouraged.  You can turn them off, if you want. On Miso you get extra points for posting updates to services like Twitter and FB.", "group_id": 97, "id": 341606}]