[{"user_id": 10411, "stars": [], "topic_id": 20628, "date_created": 1303348787.558866, "message": "I helped migrate ETS from svn to git and it was...painful.", "group_id": 9127, "id": 763960}, {"user_id": 30469, "stars": [], "topic_id": 20628, "date_created": 1303348255.5690761, "message": "So we started talking earlier on the topic of version control. The major options are cvs, svn, git, and mercurial. I think we can rule out cvs with no further discussion. Although I've never actually used git or mercurial myself, I am, in principle, in favor of having a distributed VCS. Does anyone have any strong preferences/arguments for git vs. mercurial (or bazaar)?", "group_id": 9127, "id": 763820}, {"user_id": 30469, "stars": [], "topic_id": 20628, "date_created": 1303348396.0370231, "message": "A second but related question is where we want to host the repository (github, Google Code, SourceForge, etc.) - but in my mind, we should decide on version control first (since that will simplify the question anyway).", "group_id": 9127, "id": 763847}, {"user_id": 10411, "stars": [], "topic_id": 20628, "date_created": 1303348746.41944, "message": "If you are starting a new project these days the choice is really between git & hg.  People might jump on me for saying this, but svn is really for projects that have been around for a while and have yet to migrate.  The benefits of a dvcs are immense.\n\nThat said, hg & git have nearly identical functionality.  We fought for a couple of months at Enthought about which one we were going to pick.  In the end we choose git because of GitHub and the fact that NumPy, SciPy, and now ETS are on GitHub.  Python itself is on hg for largely political reasons.  \n\nThe technical reason for us to choose git over hg here is that Seth and I have a lot of code in git already so we would be able to preserve our history seamlessly.  (ie we wouldn't have to use to an hg <-> git bridge.  Such tools barely work.)", "group_id": 9127, "id": 763948}, {"user_id": 30469, "stars": [], "topic_id": 20628, "date_created": 1303355900.8927569, "message": "Man I hope they pay you some serious $$ to go through that kind of pain! I'm fine with using git and agree with everything you're saying. Any further thoughts on this or can we consider this topic closed and move on to deciding where we want to host?", "group_id": 9127, "id": 765084}, {"user_id": 10411, "stars": [], "topic_id": 20628, "date_created": 1303364040.5239229, "message": "@paul_romano Haha!  I'd be fine with closing this but that would be self serving ;)\n\nFor git, I think the choice is between GitHub and Gitorious.  My choice would be for GitHub simply because of the larger network.  \n\nFor more than you ever wanted to know about hosting services... http://en.wikipedia.org/wiki/Comparison_of_open_source_software_hosting_facilities", "group_id": 9127, "id": 766491}]