[{"user_id": 11626, "stars": [], "topic_id": 9009, "date_created": 1298622057.462132, "message": "(WashingtonsBlog) – It’s amazing how governments infiltrate terror cells time and again, but then fail to actually stop the attacks.\r\nLondon\r\n\r\nThe Guardian noted on February 13th:\r\n\r\n    A remark from the sentencing judge that Babar “began co-operating even before his arrest”, has raised the possibility, supported by other circumstantial evidence obtained by the Guardian, that he may have been an informant for the US government before his detention by the FBI in April 2004.\r\n\r\n    ***\r\n\r\n    Having reviewed the court transcript himself, bereaved father Graham Foulkes said: “There’s a hint from one or two of the sentences [in the transcript] that do strongly suggest [Babar's] co-operation was going well beyond his official arrest. And it looks as if the Americans may well have known in detail what Babar was up to in Pakistan [at the time] and that is a very, very serious matter.”\r\n\r\n    When judge Marrero’s office was asked to clarify the remarks, his office declined to comment. The US attorney’s office declined to comment on whether Babar had been working with US agencies before his arrest.\r\n\r\n    The law enforcement officer involved in Babar’s arrest and debriefing also refused to discuss the allegations.\r\n\r\nIndeed, this short Fox news interview with terrorism expert and former prosecutor for the Justice Department shows that the bombing “mastermind” was a British intelligence agent (or read the transcript here). And see confirming story here.\r\n\r\nAn MSNBC translator confirms that claim of responsibility by Al-Qaeda was a fake. And see this this regarding the unreliability of the translation.\r\n\r\nThis article from the Independent raises the question of whether attackers were “arrested and then released” while remaining under close observation by the government”.\r\n\r\nTimes Online reports that the police were “bugging” the car of the mastermind of the bombings.\r\n\r\nAnd apparently Israel was warned ahead of the blasts (confirmed here).\r\n\r\nMadrid\r\n\r\nBBC reported in 2004:\r\n\r\n    The Spanish interior ministry says it is investigating reports that two suspects in the 11 March Madrid train bombings were police informants.\r\n\r\n    The move came after Spain’s El Mundo newspaper said Moroccan Rafa Zuher and Spaniard Jose Emilio Suarez had been in contact with police before the attacks.\r\n\r\n    The men are suspected of providing dynamite for the attacks, which killed 191 people and injured more than 2,000.\r\n\r\n    The paper said they passed on details about drug deals and other crimes.\r\n\r\nNew York: 1993\r\n\r\nFor example, the FBI had penetrated the cell which carried out the 1993 world trade center bombing, but had — at the last minute — canceled the plan to have its FBI infiltrator substitute fake powder for real explosives, against the infiltrator’s strong wishes (summary version is free; full version is pay-per-view)?\r\n\r\nAnd see this TV news report:\r\n\r\nNew York: 2001\r\n\r\nThe government had also infiltrated the 9/11 terror cell:\r\n\r\n    *\r\n      An FBI informant hosted and rented a room to two hijackers in 2000. Specifically, the Congressional Joint Inquiry discovered that an FBI informant had hosted and even rented a room to two hijackers in 2000. And see this Newsweek article and this New York Times report\r\n\r\n    *\r\n      According to the large French newspaper Le Monde, the intelligence services of America’s close ally France and of other governments had infiltrated the highest levels of Al-Qaeda’s camps, and actually listened to the hijackers’ debates about which airlines’ planes should be hijacked, and allied intelligence services also intercepted phone conversations between Al-Qaeda members regarding the attacks\r\n\r\n    *\r\n      According to journalist Christopher Ketcham, America’s close ally Israel tracked the hijackers’ every move prior to the attacks, and sent agents to film the attack on the World Trade Centers\r\n\r\n    *\r\n      The National Security Agency and the FBI were each independently listening in on the phone calls between the supposed mastermind of the attacks and the lead hijacker. Indeed, the FBI built its own antenna in Madagascar specifically to listen in on the mastermind’s phone calls\r\n\r\n    *\r\n      According to various sources, on the day before 9/11, the mastermind told the lead hijacker “tomorrow is zero hour” and gave final approval for the attacks. The NSA intercepted the message that day and the FBI was likely also monitoring the mastermind’s phone calls\r\n\r\n    *\r\n      Shortly before 9/11, the NSA also intercepted multiple phone calls to the United States from Bin Laden’s chief of operations\r\n\r\n    *\r\n      The CIA and the NSA had been intercepting phone calls by the hijackers for years (see also this)\r\n\r\n    *\r\n      According to the Sunday Herald, two days before 9/11, Bin Laden called his stepmother and told her “In two days, you’re going to hear big news and you’re not going to hear from me for a while.” U.S. officials later told CNN that “in recent years they’ve been able to monitor some of bin Laden’s telephone communications with his [step]mother. Bin Laden at the time was using a satellite telephone, and the signals were intercepted and sometimes recorded.” Indeed, before 9/11, to impress important visitors, NSA analysts would occasionally play audio tapes of bin Laden talking to his stepmother.\r\n\r\n    *\r\n      And according to CBS News, at 9:53 a.m on 9/11, just 15 minutes after the hijacked plane had hit the Pentagon, “the National Security Agency, which monitors communications worldwide, intercepted a phone call from one of Osama bin Laden’s operatives in Afghanistan to a phone number in the former Soviet Republic of Georgia”, and secretary of Defense Rumsfeld learned about the intercepted phone call in real-time (if the NSA monitored and transcribed phone calls in real-time on 9/11, that implies that it did so in the months leading up to 9/11 as well)\r\n\r\nWhat About the Terror Arrests?\r\n\r\nBut what about the arrests which have been made of would-be terrorists? Doesn’t that show that governments do sometimes catch the bad guys?\r\n\r\nMaybe … but:\r\n\r\n    *\r\n      Former counterterrorism czar Richard Clarke said:\r\n\r\n        A lot of the cases after 9/11 were manufactured or enormously exaggerated and were announced with great trumpets by the attorney general and the FBI director so that we felt that they were doing something when, in fact, what they were doing was not helpful, not relevant, not needed.\r\n\r\n    *\r\n      The Washington Post ran a story about one alleged threat entitled “Was it a terror sting or entrapment?“, showing that the U.S. government lent material support to the wanna-be terrorists, and put violent ideas in their heads\r\n\r\n    *\r\n      Raw Story reports that the alleged terrorist group that is alleged to have planned to blow up Chicago’s Sears Tower was non-violent before a government informant infiltrated the group and planted violent ideas in their heads\r\n\r\n    *\r\n      PBS’ Frontline ran a special report focusing on the the alleged Al Qaeda plot in Lodi, California, which showed — based upon interviews with top law enforcement officials involved in the case — that the bust amounted to little more than entrapment and coerced and fabricated confessions from two men who, in fact, had nothing to do with the terrorist group\r\n\r\n    *\r\n      There are numerous other instances of entrapment of peaceful or mentally incompetent people who are then arrested as “terrorists”. For example, the “mastermind” of the terrorism plot was a self-confessed “pothead” , another was a crackhead, and that they were all semi-retarded. And see this, this and this\r\n\r\nSo while there are a lot of loud announcements about catching terrorists, most of the convictions are optics without substance.\r\n\r\nhttp://dprogram.net/2011/02/24/government-infiltrates-terror-cells-time-and-again-but-fails-to-stop-attacks", "group_id": 3920, "id": 206580}]