[{"user_id": 4831, "stars": [], "topic_id": 10909, "date_created": 1299279044.4034901, "message": "Who has it? what do you think?", "group_id": 97, "id": 273657}, {"user_id": 9018, "stars": [{"date_created": 1299634285.4764099, "user_id": 7081}], "topic_id": 10909, "date_created": 1299280058.5643871, "message": "as someone working on apps in the space - steer clear of the whole internet appliance space for now - great for streaming video but the whole idea of coding apps on (eg the yahoo tv platform) is BS, stuff just break and is pure busted.\n\nYou thought developing for handsets was hard with different hardware/screensize issues - it makes connected tv appliances look like a walk in the aprk - oh but if you if you just want to stream video - yeh it works fine.", "group_id": 97, "id": 273741}, {"user_id": 9018, "stars": [], "topic_id": 10909, "date_created": 1299280068.040004, "message": "lol more than you needed to know right?", "group_id": 97, "id": 273746}, {"user_id": 2458, "stars": [], "topic_id": 10909, "date_created": 1299285783.753536, "message": "It's great for Netflix and YouTube, but not much else right now. TV stations almost all block it, no Hulu yet.", "group_id": 97, "id": 274257}, {"user_id": 2458, "stars": [{"date_created": 1299634277.5284059, "user_id": 7081}], "topic_id": 10909, "date_created": 1299285792.451375, "message": "Amazon Prime should work", "group_id": 97, "id": 274259}, {"user_id": 4831, "stars": [], "topic_id": 10909, "date_created": 1299303675.2793379, "message": "I keep wondering how the apps will be, ive seen where it was rooted and the android market was installed but I do not know how well it works but it seems to work fine from what I saw in the video. I know with tversity and playon you can access some of the blocked services (i cannot really say I agree with the blocking but hey it's their content).  Their is a growing number of websites such as revision 3 and the above mentioned, so it appears the content is growing. I take it not many people have tried it, I keep hoping that it grows as well as android has.", "group_id": 97, "id": 275207}, {"user_id": 2458, "stars": [{"date_created": 1299634291.22174, "user_id": 7081}], "topic_id": 10909, "date_created": 1299334822.0343311, "message": "I use Netflix a lot, and it was always a pain to hook up my laptop to the TV or just to watch instant play movies directly on the laptop. It's really changed the way we consume Netflix (and the volume at which we consume it :) ). I don't see any need for tweeting on my television, or checking Facebook, etc. As a pure media consumption it let me down when I realized that tv stations are all blocking it. I never got into the DVR/TIVO thing, so if we want to watch a show we missed then we do it on Hulu or the station site - both of which don't work with Google TV.", "group_id": 97, "id": 276275}]