[{"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310255801.674912, "message": "Going back over a previous script, starting with the climax.  The gist of the story is it's a tragedy though I'm not sure which type specifically (one recent reader said it was Black Swan).  I'm starting with the climax and trying to identify the crucial element because this (the climax) was the inspiration for the story.  \n\nThe short on the story is a mother to a recent newborn is suffering from postpartum psychosis, or so others around her believe.  She \"sees\" images which may (or may not) be from early childhood or... a previous life.   In reality, the mother had lost the child during birth and is really suffering from psychosis, however, the bulk of the story is her investigating the images that lead her to an old Bed and Breakfast where, surprise surprise, the previous owner committed suicide after having a child and was believed to have been crazy because she saw the same images.  \n\nAs the story unfolds, we see it subjectively through the mother's eyes so we \"assume\" her child is alive.  During her investigation, she comes to realize the previous owner was actually her mother and she was the child who survived, something her adoptive parents shunned telling her (what she doesn't know won't hurt her).  At the climax, she realizes her child is dead and \"becomes\" or fulfills her mother's visions --> she IS the ghost her mother saw - it was just in the future tense.  \n\nThat being said, the OS class seems like it would be situation (everybody's dealing with the fact that Sunny, the MC, does not believe her child is dead - and in the past, everybody is dealing with what her mother saw) while the crucial element might be destiny.  The MC class FEELS like it should be state of mind as the MC touches upon all the elements within that realm.  \n\nAny thoughts?  By the way, this script has done fairly well in contests and coverage I've received - but I just feel like it's not quite over the hump and missing something.  The argument I'm trying to make is ultimately one where the \"crazy\" person isn't crazy after all, that just because we don't experience something someone else does that can't be explained, doesn't mean they're crazy.  The father at the end of the story has lost the love of his life years before, then lost his daughter after being reunited... both for the same reasons - because he thought they were both ill.", "group_id": 2515, "id": 1601536}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310266412.494925, "message": "Ooops, correction.  Destiny/Fate would be the variation pairing, but I'm having problems relating the variation to the element choices.  I think part of my confusion is understanding their relationship: in the book, there's 64 variations, then it says those can each be sub-divided into four elements, but there's only the same number of elements (64).  What am I missing here?", "group_id": 2515, "id": 1602465}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274224.4008689, "message": "When the book says that each Variation can be divided into four elements, those are the four elements below each Variation. These four can be found on the \"bottom\" floor of the model and describe the Problems and Solutions the characters will face or ignore in their drive to resolve the story's inequity.", "group_id": 2515, "id": 1603202}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310275340.1191821, "message": "Lastly the idea of tragedy -- the fact that someone compared it to Black Swan is a good thing in light of some of the dynamics you have going on. If what is really going on is finally revealed, a la Sixth Sense/Usual Suspects, then the Solution of Actuality is put into place and the OS would be a Success. Assuming this solution is felt in the MC throughline as well, and if the Black Swan comparison is right, then it would seem you have a Change/Success/Good story - or a triumph, not a tragedy. What happens might be tragic, but what you're saying isn't.", "group_id": 2515, "id": 1603295}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310273985.712651, "message": "I'll do my best here...I've read the above several times and for some reason, I'm still quite confused as to what the story is about, but I think I might have some thoughts that might steer you in the right direction.", "group_id": 2515, "id": 1603180}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274692.6252351, "message": "When you're talking about images and people confusing what they see with what is really going on, what you are really talking about is an issue of Senses. Perception, Actuality, Aware and Self-Aware seem to be the quad more at the heart of what your story is about - particularly the first two. Like Sixth Sense, The Others and The Usual Suspects, your story centers around a problem of Perception - what the characters perceive is not what is really going on (Actuality).", "group_id": 2515, "id": 1603253}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274123.5415239, "message": "First - your question about Variations and the book. There are 64 Variations - if you're looking at the 3D representation of the model, this level is the 2nd one from the bottom and has Fate, Destiny, Openness, State of Being and Preconditions. This is the Theme level.", "group_id": 2515, "id": 1603191}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274584.8489499, "message": "That said, I don't think these are the problems or issues in your story.", "group_id": 2515, "id": 1603241}, {"user_id": 7645, "stars": [{"date_created": 1310323125.2153881, "user_id": 13109}], "topic_id": 41557, "date_created": 1310274563.8987229, "message": "For instance, the Issue of Fate is comprised of the four elements of Knowledge, Thought, Chaos and Order. I'm sure you've seen a movie or two where, when discussing matters of fate, they question whether there is a pattern to the way things have happened (Order) or if its simply a series of random events (Chaos). When fate causes issues for others it is usually as the result of a group of people who feel they know exactly why things happen (Knowledge) versus those with a bent for more consideration and thoughtfulness towards these matters (Thought). For an example of how Projection, Speculation, Aware and Self-Aware relate to Destiny look to Dom Cobb in Inception and how the problems he faces in the story correspond with what he perceives as his destiny.", "group_id": 2515, "id": 1603237}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274919.115454, "message": "Remember that a Concern of the Past doesn't mean you're visiting what happened - you mentioned that in the past, everyone is dealing with her mother -- ok, to them that isn't the past, that's the present or progress. To us the audience it is in the past, but for those characters back then, the past is not an issue for them.", "group_id": 2515, "id": 1603274}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310274825.632895, "message": "Furthermore, your character sounds more like a Situation character -- her problem is that she is the daughter of this woman who killed herself. Her past is literally coming back to haunt her. I'm assuming she is a Change character (because she finally sees things for the way they are), and this works nicely with an Issue of Prediction, particularly in light of her mother's premonition of what will be and the various issues this will cause her.", "group_id": 2515, "id": 1603270}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310275038.586354, "message": "Which returns us to the crucial element and variations. The crucial element is found on the Problem (or Element) level, not the Variation level. Personally, if what you've written above is any indicator of what you feel is the centerpiece of your story, the crucial element is clearly Perception.", "group_id": 2515, "id": 1603284}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310275652.9554751, "message": "Ahh - and to answer your question about why, if all 64 variations are divided into 4, are there only 64 elements...I believe Knowledge under Situation is different from Knowledge under Activity as well as Knowledge under Fixed Attitude and Psychology. There really are 256 separate elements, but at that level of detail the difference is so minute as to be inconsequential to the meaning of a story. In addition, I think if they were 256 distinct separate elements (if you could even find words to describe them), I think it would diminish the value of the model as it would fail to show the idea that each throughline is looking at the same inequity from a different point-of-view. In your story above you would be looking at Perception from an objective and an intensively personal point-of-view. If Perception was labeled differently for both perspectives you might miss out on that connection and the chance to add that sort of insight into your work.", "group_id": 2515, "id": 1603309}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310302203.5934551, "message": "Glad to see I was reading it right, lol.  That's how I was interpreting the elements vs. variations, but because I started at the end point and both have 64, I confused them and saw destiny/fate and that seemed to stand out.  What I need to do, for my own benefit, is print those pages with the charts out and make a flip/stack chart where they overlay one another from top to bottom.  I just kept staring at the 3D diagram at the end of the day and it was like making as much sense as Transformers 3D...", "group_id": 2515, "id": 1604242}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310302491.3803949, "message": "Just to clarify a few more plot points:  Sunny, the MC/young mother, is something of a \"non-believer\" - meaning she's driven by logic, rational, everything needs to make sense and be explained.  She's a TA working on her own thesis dealing with the psychology of beliefs, more specifically problematic beliefs (ghosts, paranormal, astrology) and why  people believe what they do.", "group_id": 2515, "id": 1604252}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310303672.1216869, "message": "And she does uncover a conspiracy, but the true ramifications of it aren't known until the climax as well.  It was an accident that happened when her father (Morgan) threatened to take her from her mother who he believed had gone crazy, already ostracized by the community.  The mistake Morgan and his sister, Evelyn, make is they decide to make it look like suicide: hey, she's been going on about seeing a hanging ghost, so let's make it look like she hung herself.   \n\nThe consequences being Morgan's relationship was somewhat secret, so he couldn't just all of a sudden show up with a baby (Sunny) - he had to leave her there for someone else to find.", "group_id": 2515, "id": 1604318}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310304146.7077301, "message": "Anyway, it's Morgan who pushes Sunny to the realization by using the words her adoptive family and husband have been avoiding \"She is dead!\".  The only thing is, he's referring to Sunny's mother... Nadeen.  Confused?  ;)  Not only does Sunny believe her baby is alive, but she talks of Nadeen being the one renovating the house.  Nadeen is the author of the diaries and Sunny's mother, but... this is where I went for ambiguity: if Nadeen is a ghost as well, then she's a vengeful one leading Sunny down the path to fulfill her vision.  Or, Nadeen could be a manifestation of Sunny's psychosis - in the present, she's \"doubtful\" of ghosts and hauntings, but this could be interpreted as Sunny's rationalization of her own beliefs, \"someone\" who aids in her beliefs.  \n\nEither way, the truth is in the diaries and it becomes inevitable what will happen as it's strongly hinted at the 2nd act turning point.  From there, everything Sunny tries to do to avert her destiny works against her.", "group_id": 2515, "id": 1604359}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310303338.556905, "message": "I didn't think I had a real IC at first, then I realized it's her mother - more specifically, she finds her mother's diaries upon discovering the B&B she's obsessive about is real, journeying to it where she finds a woman, Nadeen, working to renovate it.  Sunny at this point is on the run, fearing her family is trying to take her baby from her.  \n\nHowever, she doesn't know the diaries are her mothers until the 2nd act turning point - she thinks the \"author\" is delusional.  Once she finds out its her mother, she now feels the burden of proving there was foul play and a conspiracy covering it up - otherwise, everyone will assume she's suffering from the same illness once the truth is known.", "group_id": 2515, "id": 1604290}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310304437.3816371, "message": "That's where the solution of actuality would come in.  She changes because she's left with no other explanation BUT to believe and by taking her own life via hanging, she's exonerating her mother of being \"crazy\".  That's why were left with a broken Morgan, because he now sees how wrong he was at the beginning.  \n\nStrange how I consider this to be the least complex of the scripts I've written, lol.  Anyway, I was aiming for something REALLY haunting on multiple levels.  We believe Sunny at the beginning and see her family, particularly her husband, as antagonists - but really they're trying to save her from herself.  It's why they play along with Rebecca still being there, because they're afraid of what her fate would be if she realizes reality ---", "group_id": 2515, "id": 1604371}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310306082.7643039, "message": "--- their fears justified in the end.  \n\nAs always, thanks for the help.  I'll go back later today and look at it from the perspective you came up proposed.", "group_id": 2515, "id": 1604463}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310306407.182873, "message": "Funny how I can throw tidbits and scraps of story out there and get much, much, much more helpful information than if I were to post my script on a peer review site and get six reviews of varying quality from people who actually read it (or as I like to say, where the blind lead the blind, lol).  \n\nMany kudos and thanks again!", "group_id": 2515, "id": 1604475}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310311348.86606, "message": "You're welcome. Two things -- who is Rebecca? And what relationship of Morgan's must be kept a secret?", "group_id": 2515, "id": 1604847}, {"user_id": 7645, "stars": [], "topic_id": 41557, "date_created": 1310311335.1423111, "message": "You're welcome. Two things -- who is Rebecca? And what relationship of Morgan's must be kept a secret?", "group_id": 2515, "id": 1604846}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310314559.1674881, "message": "Rebecca is the deceased baby's name.  Morgan's relationship with Nadeen wasn't a secret so much at first, but once she became pregnant and she began seeing things and became ostracized by the community, he kept it secret because of his social standing (in the present, he's the mayor of the town). \n\nEvelyn is Morgan's domineering sister who lives off his social stature and comes up with the plan.  She's the one who, in the present, manipulates Sunny.  Neither side is aware of either's relationship at first... But Sunny obviously knows things from the diaries which causes concern for Evelyn.   \n\nThere's a whole red herring bit of the 1st half where Sunny may be the reincarnate of her mother (sort of like the Reincarnation of Peter Proud, if you've ever seen that.  Rumor has it David Finch was going to remake it with the screenwriter of Seven).", "group_id": 2515, "id": 1605037}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310314721.390739, "message": "A lot (LOT) of Hitchcock influence on this, mostly from Vertigo and the backstory of \"Mad Carlotta\".  It's had a lot of comparisons to Sixth Sense and The Others, which was flattering at first, but eh... it's really not like those (not to mention the first draft was written back when Sixth Sense actually came out).", "group_id": 2515, "id": 1605045}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310329595.9897521, "message": "I must have had birds on my brain this morning.  That's Fincher, not Finch.  Duh.", "group_id": 2515, "id": 1606280}, {"user_id": 33839, "stars": [], "topic_id": 41557, "date_created": 1310330633.8590059, "message": "And I agree - after looking at this, it's definitely perception with actuality as the answer just as the variations are fact vs. fantasy.  Brilliant.  Who knew Dramatica would be so easy... so easy, I did it without knowing, lol.  Really good stuff to be able to go back and see stuff I've already written fall in line and into place.  It might not ALL be there, but what is at this point makes it feel like it's easier to pick up (I'm not banging my head against the wall thinking nothing is adding up/making sense - just the opposite).", "group_id": 2515, "id": 1606381}]