[{"user_id": 31196, "stars": [], "topic_id": 33817, "date_created": 1304601850.8130419, "message": "I'm an almost graduating college student, and in my spare time I run a startup with 2 others, me being the sole developer. The others are working part time elsewhere and working salaried part time. Would you continue doing the startup and find a salaried part time job, or find a full time job and ditch the startup (as a fresh graduate)", "group_id": 95, "id": 928737}, {"user_id": 25716, "stars": [], "topic_id": 33817, "date_created": 1304602829.2517581, "message": "What do you enjoy more?", "group_id": 95, "id": 928990}, {"user_id": 31196, "stars": [], "topic_id": 33817, "date_created": 1304602994.543566, "message": "It's hard to say. Being a one man dev team has its disadvantages. On the other hand, I can do whatever I want tech wise, and have a lot of say. It's also a good time career wise to do a startup I think, doesn't really matter right now.", "group_id": 95, "id": 929029}, {"user_id": 24951, "stars": [], "topic_id": 33817, "date_created": 1304612715.540606, "message": "Whats more important to u? to become a good dev, or to own a startup. Right now is a good time to start something since i don't think you have any other responsibilities or bills. However right now is also a good time to join a company and gain some good development skills. So it really comes down to whats more interesting or important to you.", "group_id": 95, "id": 931290}, {"user_id": 3444, "stars": [], "topic_id": 33817, "date_created": 1304614265.01424, "message": "@vshlos I agree with you about dev skills. I'm working for a Web Based CRM company right now. There's nothing more that I want than to own my own company though, but I'm gaining valuable training right now, and getting paid for it. So really I think that would be a good option for you  @webguy", "group_id": 95, "id": 931531}, {"user_id": 26088, "stars": [], "topic_id": 33817, "date_created": 1304623721.7005551, "message": "IF you chose the right company, why not part time employee, part time startup, go freelancing on sites like vworker.com, odesk.com, elance.com, it has more risk but you get more flexibility and you can bootstrap your startup", "group_id": 95, "id": 933326}]