[{"user_id": 25438, "stars": [], "topic_id": 36806, "date_created": 1306358264.0304461, "message": "Ideally ar would be agnostic on what you want to name things.  (Not that it is today).", "group_id": 9739, "id": 1184446}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306358329.116122, "message": "Yes, but nonetheless, wouldn't it be nice if we compressed both functions into a single function?", "group_id": 9739, "id": 1184453}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306357719.0604069, "message": "(Also, since I like the idea of using zap in argument lists, if we did this, we could then make \"table\" a function that converts it's argument to a table, similar to string and sym)", "group_id": 9739, "id": 1184341}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306357604.5573759, "message": "Rationale: (table) is equivalent to (obj) and having two is redundant. Also, I don't like the name \"obj\" because it reminds me of \"object\" which reminds me more of OOP things, not hash tables. But \"hash\" is clear.", "group_id": 9739, "id": 1184325}, {"user_id": 22796, "stars": [], "topic_id": 36806, "date_created": 1306358030.1507471, "message": "Just use table? I want to use hash as a verb.", "group_id": 9739, "id": 1184393}, {"user_id": 25438, "stars": [], "topic_id": 36806, "date_created": 1306358158.150825, "message": "Not really a question for ar itself, I don't think.  You should, of course, be able to rename obj to hash if you want, and if that's hard to do that would be a bug in ar because it's supposed to be easily hackable.", "group_id": 9739, "id": 1184424}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306358171.5422311, "message": "(I'll note that this is for the defaults for ar... in backcompat mode, both functions should retain the same names)", "group_id": 9739, "id": 1184425}, {"user_id": 25438, "stars": [], "topic_id": 36806, "date_created": 1306358698.0018401, "message": "Coming up with a better language than Arc 3.1 is a good conversation to have, just pointing out that it's not an ar-level decision.  (If you said \"I want to rename obj to hash in my Arc+ language, and here's a proposal for how to get ar to support that easily\", that would be a proposal for ar itself).", "group_id": 9739, "id": 1184478}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306358788.9729991, "message": "Sure, but one language that ar supports out-of-the-box is Arc, so are you saying I shouldn't make proposals about ar's default Arc support?", "group_id": 9739, "id": 1184492}, {"user_id": 25438, "stars": [], "topic_id": 36806, "date_created": 1306359485.085135, "message": "One of the languages that ar supports out-of-the-box is Arc 3.1.  If you want to make a better Arc, that's not a proposal at the ar level, it's just something you want to do.  If you have ideas for a better Arc that you want feedback on, that's good idea, it's a bit off-topic for ar (aside from deficiencies in ar that might make it hard), and might be better in a different Convore group, though I don't mind off-topic conversations here.  By analogy: whether a car should have three wheels or four wheels is a car-level proposal; whether to go to the park or the movies is a higher-level proposal; the car should be able to take you to either place.", "group_id": 9739, "id": 1184551}, {"user_id": 32737, "stars": [], "topic_id": 36806, "date_created": 1306359553.602361, "message": "Hm... well, alright then.", "group_id": 9739, "id": 1184557}]