[{"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957596.591826, "message": "My question is.. how do you begin to concept something? I've drawn a few wireframes, but they are really coarse granularity. block for logo, big squiggle for header, little squiggles for content.", "group_id": 629, "id": 232077}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957524.5906761, "message": "http://twitter.com/#!/capndesign/status/42431817734832128", "group_id": 629, "id": 232074}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957642.0459671, "message": "I'm not sure how to get from what I have there (basically what the wireframe showed) to something that looks reasonable. My initial approach was to go though a checklist of \"design things\" and make sure they were all considered / accounted for.", "group_id": 629, "id": 232079}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957708.0685611, "message": "those things being:  balance, golden proportion, reptition, whitespace, contrast, texture, shape, scale, heirarchy, weight, rhythm, motion, color, value, type{face,size,style,spacing}    Is this bad? Is there a better way? How do *you* do it?", "group_id": 629, "id": 232084}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957511.662493, "message": "Now I want to make it look like a reasonable site.  I've been told this is thinking like an engineer.", "group_id": 629, "id": 232071}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1298957496.4476759, "message": "So I have some semblance of a site put together. https://dl.dropbox.com/u/91251/jsblog/index.html  Its more or less what I was thinking of.", "group_id": 629, "id": 232068}, {"user_id": 12525, "stars": [], "topic_id": 9636, "date_created": 1299002627.639401, "message": "@justinlilly - research what it is that you want the site to look like, here's a couple of places to look at www.foliofocus.com, www.sixrevisions.com, www.smashingmagazine.com are a few places that you can get design inspiration, from there it's just a matter of designing something, once you have something in mind put up on www.conceptfeedback.com where you can get feedback on design and development. Then it's all down to the stylesheet and Jscript, and any of the fancy stuff that you do or do not want to do. Alternatively post your wire frame here to view and let designers give you some tips....", "group_id": 629, "id": 236485}, {"user_id": 581, "stars": [], "topic_id": 9636, "date_created": 1299006054.035701, "message": "Then when you're happy with what might look like colorful wireframes, you can do a finishing pas", "group_id": 629, "id": 237025}, {"user_id": 581, "stars": [], "topic_id": 9636, "date_created": 1299005987.173974, "message": "@justinlilly I think I usually do a really fast sketch of what I had in mind, then do a unpolished version on screen (usually in fireworks). Then I'll polish once it's feeling right. A checklist of 'design things' is useful maybe at a later date but starting with it runs the risk of just doing what people have prescribed to be 'good design' in the past.. which isn't very exciting.", "group_id": 629, "id": 237010}, {"user_id": 12525, "stars": [], "topic_id": 9636, "date_created": 1299007727.132587, "message": "good points by spencer... it's funny that's generally my way of doing it too...", "group_id": 629, "id": 237280}, {"user_id": 581, "stars": [], "topic_id": 9636, "date_created": 1299006038.1064091, "message": "Don't expect to nail it on the first pass, either. That's why a more 'playful' approach can be useful. Slowly adding polish allows you to think about IA first, in the context of what your visual style might be.", "group_id": 629, "id": 237022}, {"user_id": 581, "stars": [], "topic_id": 9636, "date_created": 1299006084.8743191, "message": "I'm trying not to be too descriptive of my process because I don't want to force an approach or process on you, so sorry if that didn't make much sense lol", "group_id": 629, "id": 237032}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1299023865.535578, "message": "forgive me if I'm simplifying this too much.. but it seems like: \"Find other sites which you think look good and are similar. Draw out some boxes on paper for where things should roughly go, then 'finish' it\"  ... that doesn't feel particularly helpful to me. Maybe I'm just not looking at it right or missing something?", "group_id": 629, "id": 242101}, {"user_id": 218, "stars": [], "topic_id": 9636, "date_created": 1299024909.2576661, "message": "@azcreative I think I have some semblance of ability in all of those areas save the \"design\" step. suppose I'll finish the basic wireframes I have, then send it asking for more specific help.", "group_id": 629, "id": 242192}, {"user_id": 12525, "stars": [], "topic_id": 9636, "date_created": 1299024767.3850701, "message": "@justinlilly, I think it all depends on what you want to achieve... by the looks of what you have in that page, it's basically a very bare base portfolio page. If you want steps of design, then it always comes down: site architecture, usability, functionality, wire-frame, Research, design, feedback from colleagues  friends, research, HTML/ CSS, tweak, feedback, then when you are either extremely sick of it or completely satisfied, finish it.", "group_id": 629, "id": 242180}, {"user_id": 12525, "stars": [], "topic_id": 9636, "date_created": 1299026390.7728119, "message": "@justinlilly if you need design help shout out", "group_id": 629, "id": 242293}, {"user_id": 581, "stars": [], "topic_id": 9636, "date_created": 1299026920.338388, "message": "Yep post anything you want to share here and people will likely help out :-)", "group_id": 629, "id": 242343}]