[{"user_id": 13453, "stars": [], "topic_id": 9683, "date_created": 1298980680.7078581, "message": "Lider: @pieranghela - @tifis\nObjetivos: Promover la inclusión de las mujeres en el desarrollo y buen uso de las TIC.\nActividades: Recolección de información: estado del arte inclusión de la mujer en procesos de alfabetización digital. Debilidades, Fortalezas, Oportunidades y Amenazas.\nCreación de contenidos, sensibilización y posicionamiento del escuadrón a través de la publicación de un blog especializado.\nIdentificación de las líneas de soporte del escuadrón, asociaciones y fundaciones interesadas en alfabetizar o hacer uso responsable de las TIC. (Trabajo regional). Inclusión de organizaciones privadas y públicas como participantes en el proceso.\nEnlace MinTic - ViveDigital: Jesús Zambrano – Dirección de apropiación de TIC", "group_id": 2696, "id": 233941}, {"user_id": 16654, "stars": [], "topic_id": 9683, "date_created": 1298986537.7675359, "message": "¿Cuales creen que son los espacios de la mujer en la tecnología?, ¿cómo la inclusión de la mujer puede ayudar a solucionar problemáticas como la póbreza, alfebetización, embarazo no deseado o desempleo?", "group_id": 2696, "id": 234502}, {"user_id": 15483, "stars": [], "topic_id": 9683, "date_created": 1299016770.45081, "message": "Recomiendo a las #geeksgirls esta charla TED  http://www.ted.com/talks/lang/eng/halla_tomasdottir.html", "group_id": 2696, "id": 239490}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1299022672.1397071, "message": "#geekgirl reportandose... ayer llegué tarde al streaming... pregunto por acá... puedo unirme tambien a algún otro escuadrón?", "group_id": 2696, "id": 241924}, {"user_id": 17917, "stars": [], "topic_id": 9683, "date_created": 1299100703.276988, "message": "Con el entusiasmo de construir cosas, me alegra la creación de este grupo, más allá del hashtag. Felicitaciones. les dejo mi aporte sobre uso responsable de tic y alfabetizacion digital www.aulajoannaprieto.blogspot.com. Saludos.", "group_id": 2696, "id": 253096}, {"user_id": 18403, "stars": [], "topic_id": 9683, "date_created": 1299173003.6042631, "message": "Me reporto nueva en el grupo!", "group_id": 2696, "id": 261600}, {"user_id": 17462, "stars": [], "topic_id": 9683, "date_created": 1299275915.5626061, "message": "Hola, para la contrucción del estado de arte sobre la inclusión de la mujer en procesos de alfabetización digital, propongo un observatorio o un repositorio, con información sobre experiencias y mujeres destacadas en Colombia que puedan servir como línea de base para pensar cómo las tecnologías pueden ayudar en el crecimiento y desarrollo de la mujer en la sociedad.", "group_id": 2696, "id": 273329}, {"user_id": 16641, "stars": [], "topic_id": 9683, "date_created": 1300129104.7532971, "message": "Hola a tod@s. Me gustaría poner a discusión algunos de los aportes y sugerencias que tengo para el escuadrón. 1). Actividades o participaciones pequeñas pero constantes que nos permitan medir efectiva y rápidamente la participación y aceptación del grupo en los diversas áreas de incidencia. Ej: Capacitaciones a población a joven (ávida por el uso de nuevas tecnologías) como integradores y divulgadores de la filosofía de las geek girls y que a su vez abone y/o fortalezca las actividades conjuntas entre escuadrones; estas capacitaciones pueden realizarse en colegios Distritales que son una población igualmente vulnerable en términos sociales y que son muy receptivas a nuevas propuestas. 2). Diseño de actividades transversales: el alcance de la brigada y su efectividad puede mejorada con el diseño de actividades que reúnan 2 o más escuadrones y que en términos de alcances y reputación podríamos cubrir varios objetivos con actividades mancomunadas.     Estaré atenta a todos sus comentarios y sugerencias :)", "group_id": 2696, "id": 349861}, {"user_id": 16229, "stars": [], "topic_id": 9683, "date_created": 1300133042.976733, "message": "Chicas, no sé, por facilidad les propongo utilizar el Doc colaborativo del Facebook, allí podemos ir haciendo ajustes y completando la información del escuadrón: http://www.facebook.com/home.php?sk=group_152942754764700&view=doc&id=152965871429055", "group_id": 2696, "id": 350430}, {"user_id": 18403, "stars": [], "topic_id": 9683, "date_created": 1300133289.22135, "message": "De acuerdo con Clau aprovechemos el Doc y vamos aportando", "group_id": 2696, "id": 350487}, {"user_id": 18844, "stars": [], "topic_id": 9683, "date_created": 1300155111.8949001, "message": "Yo soy de  éste y de #prosperidad ? Puedo?", "group_id": 2696, "id": 352863}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1300157324.472106, "message": "Chicas.. les cuento que proximamente estaré retomando la realización de los Delm en santa marta, ya que he visto que la comunidad 2.0 ha ido creciendo. voy a empezar a tantear el terreno e ir mirando que temas se pueden tocar, si a alguna tiene una idea, bienvenida sea, escucho todas las ideas que me puedan aportar para empezar a motivar a la gente en Sta marta con todo esto del manejo de las TIC... Ah y ya saben que cuando necesiten algo de acá me pueden contactar...", "group_id": 2696, "id": 352994}, {"user_id": 13453, "stars": [], "topic_id": 9683, "date_created": 1300160456.6543601, "message": "GeekGirls... si les interesa: FEMINISMOS: LOS DEBATES ENTRE IGUALDAD Y DIFERENCIA.\n\nEl miércoles 16 de marzo se llevará a cabo un debate sobre dos vertientes del feminismo: el de la igualdad y el de la diferencia. La sesión está organizada por el grupo Mujer y Sociedad.\n\nLa baguette du chef Calle 67 No. 7-38, de 6 a 8 pm. Entrada libre.\n\nPara más información llamar al teléfono de la oficina de Florence Thomas 3451704 o al celular de Daniel García 3143090673.", "group_id": 2696, "id": 353281}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1300198303.2123029, "message": ":) si  totalmente, ahorita estoy escribiendo uno mas cortico, en cuanto lo tenga listo se los comparto..", "group_id": 2696, "id": 356201}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1300197542.344929, "message": "Chicas les comparto un post que hice hace ya un tiempo http://www.loquenomevoyacallar.co.cc/2010/07/y-tu-mujer-como-usas-el-internet.html", "group_id": 2696, "id": 356072}, {"user_id": 16500, "stars": [], "topic_id": 9683, "date_created": 1300198160.6141341, "message": "Muy bueno tu artículo Kathy, especialmente por que creo que la mujer cumple un ro muy importante en nuestra sociedad, personalmente pienso que son el nucleo y eje central de las familias en Colombía, y en general de nuestra sociedad, por eso creo que es muy importante lo que planteas en tu artículo, sobre la responsabilidad social de las mujeres (Obviamente no solo de las mujeres, pero especialmente en ellas) como promotoras de un buen manejo de las redes sociales.", "group_id": 2696, "id": 356170}, {"user_id": 16684, "stars": [], "topic_id": 9683, "date_created": 1300210712.81007, "message": "Miren estas lecturas... me parecieron interesantes... \"Because I am a Girl\" http://bit.ly/gCr6Fz  ; Bridging the Gender Divide: How Technology Can Advance Women Economically http://bit.ly/daASfB ; White paper: Why girls are still not attracted to ICT studies and careers http://bit.ly/hODdBK ; Innovation for Women's Empowerment and Gender Equality http://t.co/cFmFeHL", "group_id": 2696, "id": 358896}, {"user_id": 16654, "stars": [], "topic_id": 9683, "date_created": 1300291022.8208289, "message": "Me parece importante resaltar el poco contacto que tienen algunas mujeres con la tecnología. Probablmente estemos hablando de una probelmática familiar, social y discriminativa. \n\n¿Por dónde sugieren debemos arrancar?", "group_id": 2696, "id": 367162}, {"user_id": 13453, "stars": [], "topic_id": 9683, "date_created": 1300291419.8024931, "message": ".. a propósito: RT @danielruedao: @Ministerio_TIC a través de @Compartel_ conectó la Casa de la Mujer en Montería. 300 mujeres capacitadas en TIC cada 6 meses. #ViveDigital", "group_id": 2696, "id": 367190}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1300831825.0316491, "message": "Como controla @Ministerio_tic  el programa Santa marta digital? realmente por mas que busco información acerca de esto no encuentro.. y además cuando llamo a la alcaldia el encargado nunca está... #fail", "group_id": 2696, "id": 412293}, {"user_id": 18844, "stars": [], "topic_id": 9683, "date_created": 1300885584.8015211, "message": "Al igual que Kathy, al vivir en una ciudad pequeña encuentro que aca poco o nada se habla del tema. De qué manera podremos trabajarlo en estas ciudades?", "group_id": 2696, "id": 416915}, {"user_id": 13453, "stars": [], "topic_id": 9683, "date_created": 1300887995.2317941, "message": "Niñas... Los escuadrones tienen asiento en nodos territoriales que se conectan con los territorios digitales... aquí es precisamente donde vamos a articularnos desde cada escuadrón a procesos como el de Santa Marta Digital, en los casos donde ya esté. Pero se articula en lo específico de cada escuadrón, y entre las personas de cada escuadrón de cada ciudad ayudan a fortalecer el programa territorial :) Voy a revisar lo de los territorios y le cuento a Claudia los dos casos para que vayamos avanzando... :)", "group_id": 2696, "id": 417382}, {"user_id": 22025, "stars": [], "topic_id": 9683, "date_created": 1300982360.733546, "message": "Hola... Desde hace algún tiempo estoy leyendo los aportes valiosos que se dan desde éste escuadrón, me he hecho preguntas desde mi práctica pedagógica y me gustaría compartirlas con ustedes... \n\nQué podríamos hacer desde estos escuadrones para hacer mucho más eficaz el trabajo de nuestras maestras en el aula desde la tecnología? Cómo podemos ayudar a nuestras maestras a hacer uso de las tecnologías en el aula? Qué estamos dispuestas a hacer para que la educación en Colombia de un giro en cuanto a la tecnología?\n\n.... Sería bueno que la batuta la llevaran las mujeres en este tipo de cambios... Saludos.", "group_id": 2696, "id": 428093}, {"user_id": 16229, "stars": [], "topic_id": 9683, "date_created": 1300990053.9324219, "message": "Hola Marce, el primer paso es tener las ganas y la iniciativa, así que muchas gracias por participar!! En este momento estamos definiendo el Plan de trabajo del Escuadrón, pero creo tu inquietud está más relacionada con el Escuadrón de #InnovaciónEducativa -> http://bit.ly/faEMxb", "group_id": 2696, "id": 429224}, {"user_id": 17223, "stars": [], "topic_id": 9683, "date_created": 1301019898.8925481, "message": "Rosi,  please lo que te puedas averiguar de SMD estoy pendiente porque aca el encargado nunca está disponible para dar información...", "group_id": 2696, "id": 434081}, {"user_id": 15483, "stars": [], "topic_id": 9683, "date_created": 1301074384.8517489, "message": "#geekgirls hay una mesa de trabajo en el #labsurlab que conecta perfectamente con la esencia de este escuadrón: http://labsurlab.co/?mesasredondas", "group_id": 2696, "id": 440541}, {"user_id": 22025, "stars": [], "topic_id": 9683, "date_created": 1301153223.2857001, "message": "Claudia, me temo que no hay mucha concurrencia en #InnovaciónEducativa, no hay mucho movimiento por aquel escuadrón", "group_id": 2696, "id": 446289}]