[{"user_id": 19729, "stars": [], "topic_id": 39619, "date_created": 1308292103.1869459, "message": "*Research Assistant (or Postdoc) position at the Oxford Internet Institute,University of Oxford* Grade 6: Salary £25,751 - £30,747 p.a. We are a leading international research and policy Institute looking for afull-time Research Assistant to work with Dr Mark Graham on the ESRC-DFIDfunded project, The Promises of Fibre-Optic Broadband: A Pipeline forEconomic Development in East Africa. Employing case-studies, interviews, surveys and textual analysis in Kenyaand Rwanda, this project examines the expectations and stated potentials ofbroadband Internet and compares those expectations to on-the-ground effectsthat broadband connectivity is having in the production networks of threeeconomic sectors: tea production, ecotourism, and business processoutsourcing. Applicants should have a graduate or postgraduate qualification in one ofthe social sciences, experience of social science research, and be willingto conduct extended fieldwork in East Africa. The successful candidate willbe able to take a lead in project management, data collection and analysis,and the dissemination of results. Based at the Oxford Internet Institute, University of Oxford, this positionis available from 1st October 2011 for 28 months in the first instance, withthe possibility of renewal thereafter funding permitting. It may be possibleto hire at Postdoctoral Research Fellow level given the right candidate. Applications for this vacancy are to be made online. Only applicationsreceived before 12:00 midday on the 21st July 2011 can be considered.Interviews for those short-listed are currently planned to take place in theweek commencing 8th Aug 2011. Full job details and online application are available at the followinglink:https://www.recruit.ox.ac.uk/pls/hrisliverecruit/erq_jobspec_version_4.jobspec?p_id=100439 More details about the project available here:http://www.oii.ox.ac.uk/research/projects/?id=59 Please share this position widely and feel free to get in touch with anyquestions. Mark ------------------------------------------Mark Graham, Ph.D.Research Fellow Oxford Internet InstituteUniversity of Oxford1 St GilesOxford OX1 3JSUnited Kingdom Telephone +44 (0) 1865 287 203 begin_of_the_skype_highlighting              +44 (0) 1865 287 203      end_of_the_skype_highlightingFax +44 (0) 1865 287 211www.oii.ox.ac.uk/people/grahamwww.geospace.co.ukwww.wikichains.comtwitter.com/geoplace\n", "group_id": 10646, "id": 1416534}, {"user_id": 19729, "stars": [], "topic_id": 39619, "date_created": 1308292817.598613, "message": "call for Papers: DGI-CONFERENCE 2012 - EUROPEAN AFTERNOON22 March 2012 ________________________________________ SOCIAL MEDIA AND WEB SCIENCE The Web as a Living Space ________________________________________ Co-located with the 2nd DGI-Conference and 64. Annual Meeting22 and 23 March 2012Düsseldorf/Germany View the complete call for papers at:http://www.dgi-info.de/CfP2012DGI-Konferenz_GB.aspxTwitter hashtag: #dgi2012 The upcoming DGI-Conference, hosted by the German Society of Information Scienceand Information Practice, will take place on March 22nd and 23rd in Düsseldorf,Germany. DGI-Conference continues the long tradition of annual meetings by theDGI, being held regularly since its foundation in 1948. This time, theconference topic is ?Social Media & Web Science?. While the presentations of the main conference will be held in German, it isplanned to also organize a special research track in English language. This?European Afternoon? will take place on March 22nd. We would like to welcomeresearchers and practitioners interested in the social dimensions of Webdevelopments and information technologies, e.g. from the fields of informationscience, library and documentation science, computer science, digitalhumanities, linguistics, psychology, political science, law and economics. The conference will cover topics such as: SOCIAL MEDIA - Collaborative and collective information services (e.g. social bookmarking,social networking, wikis) - Information retrieval for the Social Web, social search - Knowledge representation for the social web (social tagging and folksonomies) - Social Semantic Web - Social software use cases & policies (e.g. corporate social software, socialmedia for research, in e-learning environments, in libraries) - Enterprise 2.0: knowledge management with social media - Social analytics, metrics for social media - Market research and trend monitoring - Communities of practice and user networks - Web-economy, new business models - Linked Data and Open Data on the Social Web WEB SCIENCE - Characteristics and structures of communication on the Web (e.g. blogs,microblogging) - Information literacy and didactics for information science - Measuring information behaviour, e.g. for particular target groups - Visualization of data structures, networks and information - Science and the Internet: eScience, digital humanities, scientificcommunication, eLearning - Game studies, serious games and browser-based games - Digital libraries - The digital divide, accessibility and usability of information on the Web - Emotions on the Web - Legal dimensions of Web usage, trust and privacy, cybercrime - eGovernment, eGovernance & eDemocracy - eActivism & eProtest (e.g. Guttenplag-Wiki, Wikileaks) - Crowdsourcing (e.g. for politics, in science, in business) - Mobile Web and location based services - Webometrics We particularly welcome interdisciplinary approaches for Web research! SUBMISSIONS You can submit scientific research papers of up to 36,000 characters in length(including spaces). Please use the APA style for formatting your references.Additional information and a link to a conference management tool for uploadingyour submission will be provided onhttp://www.dgi-info.de/CfP2012DGI-Konferenz_GB.aspx. Accepted papers will haveto be presented during the conference and will be published in the printedconference proceedings. IMPORTANT DATES Submission of full papers: 31.08.2011 Notification of acceptance: 21.11.2011 Submission of camera-ready (revised) versions: 21.12.2011 PROGRAMME CHAIRS Katrin Weller & Isabella Peters (Heinrich-Heine-University Düsseldorf) ORGANISER Deutsche Gesellschaft für Informationswissenschaftund Informationspraxis e.V. (DGI) /German Society of Information Science and Information PracticeWindmühlstraße 360329 Frankfurt am Main, Germany Fon +49 (0)69 430313 begin_of_the_skype_highlighting +49 (0)69 430313 end_of_the_skype_highlighting Fax +49 (0)69 4909096 e-mail: mail@dgi-info.de www.dgi-info.de CONTACT Nadja Strein", "group_id": 10646, "id": 1416586}, {"user_id": 19729, "stars": [], "topic_id": 39619, "date_created": 1308292601.2616439, "message": "Two academic posts at University of Stirling‏\nDear all Some colleagues may be interested in these two new posts. The Division ofFilm, Media & Journalism at the University of Stirling is to appoint asenior figure in Journalism Studies at Chair/Reader/Senior Lecturer leveland a Lecturer in Screen/Media Studies. The closing date for both is 8 July2011. Full details are available here:http://www.hr-services.stir.ac.uk/vacancies/index.php Best regards, graham Dr Graham Meikle----------------------Senior Lecturer, Communications, Media & Culture,School of Arts and Humanities,University of Stirling, FK9 4LA, Scotland. T: +44 (0) 1786 466222 begin_of_the_skype_highlighting              +44 (0) 1786 466222      end_of_the_skype_highlightingF: +44 (0) 1786 466855E: <graham.meikle@stir.ac.uk>W: <http://www.fmj.stir.ac.uk/staff/graham-meikle/graham-meikle.php>  -- The Sunday Times Scottish University of the Year 2009/2010The University of Stirling is a charity registered in Scotland, number SC 011159.", "group_id": 10646, "id": 1416577}, {"user_id": 19729, "stars": [], "topic_id": 39619, "date_created": 1308292295.9051809, "message": "SENIOR RESEARCH ASSISTANTS (2 POSTS FIXED FOR 2 YEARS)IN THE PSYCHOLOGY AND COMUNICATION TECHNOLOGIES (PaCT) Lab , SCHOOL OF LIFE SCIENCES, AT NORTHUMBRIA UNIVERSITY Applications are invited for TWO senior research assistant posts within the PaCT Lab, School of Life Sciences at Northumbria University. Both Posts are fixed for 2 years. The first post is to work on a NIHR-funded study of decision-making in e-health (as part of a £1.9 million project on online patient experience, led by Oxford University). The second is a flexible post and can be adapted to the interests of the applicant. The aim is to work collaboratively on projects in relation to psychological approaches to older adults OR consumer psychology or the psychology of security. Successful candidates will be encouraged to conduct cooperative and independent research with an emphasis on study inception, manuscript writing, and applying for grants. The School of Life Sciences has a reputation for excellence in undergraduate and postgraduate education, research, consultancy and community activity. The School through its academic departments has enjoyed a sustained period of growth and has recently moved into state-of-the-art facilities. An exciting research culture continues to thrive in the School with significant success in the Research Assessment Exercise 2008 (RAE) - 90% of research in Psychology is of international quality. Candidates will have sound knowledge and expertise of research and experimental methodologies in Psychology and/or Human Computer Interaction or related discipline, with an emphasis on e-health. You will be expected to have good interpersonal and communication skills as well as a high level of organisation, presentation, numeracy and literacy skills. A position description is available at http://work4.northumbria.ac.uk/hrvacs/lsc1036  For an informal discussion about these posts please contact Dr Lynne Coventry, Director of PaCT, on +44 (191) 243 7772 begin_of_the_skype_highlighting              +44 (191) 243 7772      end_of_the_skype_highlighting, lynne.coventry@northumbria.ac.uk. Full applications should be made through the University website as described in the linked Position Description and the closing date is: 30 June 2011 Northumbria University is an equal opportunities employer and welcomes applications from all sectors of the community.\n", "group_id": 10646, "id": 1416560}]