[{"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1297993323.147438, "message": "1. Pub Standards occurs every month, around the middle Thursday of the month, in the same venue. We have, after getting pissed there a few times now, decided that Uptown at 17th & Capp is our home, since it's kinda cool, and close enough to BART for people to descend there after work.", "group_id": 1413, "id": 138821}, {"user_id": 96, "stars": [{"date_created": 1297993433.1050401, "user_id": 1}], "topic_id": 7152, "date_created": 1297993402.2257221, "message": "2. Substandards is Pub Standards sister event, occurring once a month two weeks apart from proper Pub Standards. This occurred because a once monthly event was not enough beer for Londoners, and it shouldn't be for us either.", "group_id": 1413, "id": 138832}, {"user_id": 96, "stars": [{"date_created": 1297993824.3342631, "user_id": 1}], "topic_id": 7152, "date_created": 1297993811.6897221, "message": "Pub Standards is not a tech event. Nor a recruitment event. Nor anything else that is not a direct offshoot of the consumption of beer (or other alcoholic beverage of your choosing.) In American parlance, we can neatly summarize this rule as “No Douchebaggery.”", "group_id": 1413, "id": 138868}, {"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1297993267.438417, "message": "Since we're starting Pub Standards anew in a new country, it's worth writing down the Rules of Pub Standards, and other such FAQs. There's not much to it.", "group_id": 1413, "id": 138815}, {"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1297993507.1804969, "message": "Pub Standards events are numbered, roman numerically. Since it would be confusing to have a ‘Pub Standards II’ in SF whilst ‘Pub Standards LXIII’ was happening in London, the adopted numbering is global. This is why the first Pub Standards SF is Pub Standards 62.", "group_id": 1413, "id": 138851}, {"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1297993678.1157939, "message": "Substandards events have names. (Also different word spacing.) Sometimes the name will be themed around the venue, because while Pub Standards is always in the same place, Substandards may NEVER be in the same venue twice. London examples include: “Substandards Wasabi”, “Substandards Revenge”, “Substandards in a Box” and “Substandards Cholera”. You get the idea.", "group_id": 1413, "id": 138859}, {"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1297994093.5369711, "message": "You can find out more from the Pub Standards London Chapter: http://london.pubstandards.com/", "group_id": 1413, "id": 138898}, {"user_id": 8119, "stars": [], "topic_id": 7152, "date_created": 1298466847.581749, "message": "So the Pub Standards channel on Convore is now the US-only Pub Standards?", "group_id": 1413, "id": 187412}, {"user_id": 96, "stars": [], "topic_id": 7152, "date_created": 1298491846.1240709, "message": "I don't see that it should be, no. In practice it may be somewhat duplicitous of the mailing list, but I don't see any reason others shouldn't use this if they want to. We can always start another SF group or list if we need to separate announcements later.", "group_id": 1413, "id": 190538}]