[{"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1309945950.3785281, "message": "What Dramatica term is closest to John Truby's \"Weakness\" (the first of seven basic stages in a story)?", "group_id": 2515, "id": 1574222}, {"user_id": 30951, "stars": [], "topic_id": 41267, "date_created": 1309952316.370805, "message": "Could there be an issue here with the audience vs author outlook here? I think Truby is audience perspective?", "group_id": 2515, "id": 1574640}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1309953007.3084099, "message": "I would say it's a bit of a combination of  crucial element and critical flaw, since weakness is paired with need (the step is actually weakness/need).  Truby makes it somewhat confusing though as he seems to, in his definitions, use \"problem\" and \"weakness\" interchangeably at points.  \n\nWeaknesses to Truby are defined as something that is holding the hero back (which could be something they're aware of, missing, and multiple instances of) - whereas the need is what the hero must fulfill within himself in order to have a better life, usually overcoming the weakness.", "group_id": 2515, "id": 1574730}, {"user_id": 7664, "stars": [], "topic_id": 41267, "date_created": 1309970999.3177691, "message": "I've never read Truby.\n\nIf a weakness is holding a character back, can it be external or internal?", "group_id": 2515, "id": 1576954}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1309973034.2938011, "message": "@MikeDerk He doesn't really discriminate in terms of weakness, but he does say that the most compelling heroes have both a moral and psychological need (psychological being strictly personal/moral being directed towards others).", "group_id": 2515, "id": 1577378}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1309976167.888423, "message": "As an initial FYI, Chris has performed several comparisons of several leading How To Write Story authors here: http://dramatica.com/theory/articles/index.htm\n\nTruby describes Weakness in conjunction with Need (which is a part of Dramatica vocabulary), and Chris has identified Need as a part of the Main Character Throughline. (I also wish to make note that Truby seems to utilize 3 dimensions of character, while Dramatica utilizes 4 dimensions.)\n\n@JBarker, I'm leaning towards your observations, moreso Critical Flaw, in particular as it is most related to the MC Throughline (Crucial Element ties in the MC to the Impact Character by Dramatica definitions).", "group_id": 2515, "id": 1577962}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1309975810.3332269, "message": "Here's an example copy/pasted from his Thriller form:  In most thrillers, the hero is under attack in a strictly physical way. The writer has failed to use the most powerful dramatic elements to create fear in the hero. In the best thrillers, the opponent attacks the unique psychological and moral weakness of the hero. Or the opponent uses what is best about the hero against him/her. This makes the thriller far more personal and dramatic.\n\nI think a good example of this would be found in The Dark Knight and with how the Joker ultimately gets Batman down to his own level, to the point that for Batman to win - he has to adapt strategies that are viewed as immoral (Lucius questioning his tactics, as an example).", "group_id": 2515, "id": 1577894}, {"user_id": 7645, "stars": [], "topic_id": 41267, "date_created": 1309978177.8416049, "message": "Need as listed in the Dramatica vocabulary is not the same as Truby's Need. His Need sounds more like the Solution for Change characters.", "group_id": 2515, "id": 1578340}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1309980478.356904, "message": "I had read that article before I delved into Dramatica, and now that I'm learning more - I'm somewhat in disagreement with some of its points.  For instance, while I agree Dramatica is a much broader paradigm - it's also limited in some sense to a grand argument story.  \n\nWhen looking at the four thru-lines of Dramatica vs. two for Truby, the article mentions there's no impact character line in the later.  This is true, but I suspect it's because Truby is taking a much broader sense of story, that not all are making an argument or solving problems.  \n\nThere are functions and elements within his story theory that relate to the IC, but they're not necessarily viewed as a necessary component.  Specifically, Truby calls them a fake ally/opponent and acknowledges they're not used in all stories.  It's certainly not a carbon copy of the IC, but in terms of definition, it comes fairly close.", "group_id": 2515, "id": 1578699}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1309980699.014668, "message": "@jimhull Yes, that's pretty much it.  Copied and pasted:  The Need is what the hero must fulfill in order to have a better life. Typically, the hero must overcome a great weakness in order to fulfill the need.  As previously mentioned, he also adds in a moral and psychological aspect as well.  \n\nI think this is where Dramatica differs substantially in that it exemplifies a steadfast character whereas a lot of other story theories focus on the change a main character undergoes.", "group_id": 2515, "id": 1578738}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1309987092.952378, "message": "@jimhull Jim, you're right.The Dramatica definition of MC Solution is \"EXPLANATION:  To completely know your Main Character you should know what would completely satisfy him.  Choosing the Main Character solution determines the nature of what will resolve your Main Character's angst.  Select the item(s) that best describes this issue.\n\nMain Character Solution:  That which is needed to truly satisfy the Main Character's motivation; the solution to the Main Character's problems.\"\n\nThat definition corresponds best to Truby's definition of Desire.\n\nThank you.", "group_id": 2515, "id": 1579907}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1309986876.8119569, "message": "@MikeDerk Truby writes \"Need has to do with overcoming a weakness within the character. A hero with a need is always paralyzed in some way at the beginning of the story by his weakness. Desire is a goal outside the character. Once the hero comes up with his desire, he is moving in a particular direction and taking actions to reach his goal.\" (pp. 61-62)\n\nTruby, John (2008). The Anatomy of Story: 22 Steps to Becoming a Master Storyteller (pp. 61-62). Faber & Faber. Kindle Edition. \n", "group_id": 2515, "id": 1579871}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1310053844.459219, "message": "I'm currently associating Truby's Battle to the OS Appreciations Intro > OS Direction.\n\nTruby describes Battle as \"Throughout the middle of the story, the hero and opponent engage in a punch-counter punch confrontation as each tries to win the goal. The conflict heats up. The battle is the final conflict between hero and opponent and determines which of the two characters wins the goal. The final battle may be a conflict of violence or a conflict of words.\" (p. 68). \n\nDramatica defines the OS Direction as \"The Objective Characters do not address the actual problem of the story until the climax and are instead dealing with the effects of the problem or what they think the problem is (called the \"Focus\").  The approach they take toward solving their focus is their Direction.  In other words, Direction describes how the Objective Characters try to approach the problem.\"", "group_id": 2515, "id": 1585194}, {"user_id": 7645, "stars": [], "topic_id": 41267, "date_created": 1310053997.2728381, "message": "Is Truby's opponent the Antagonist or the Influence Character?", "group_id": 2515, "id": 1585202}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1310054071.81058, "message": "He doesn't make an association to an Influence Character.", "group_id": 2515, "id": 1585224}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1310054149.2611771, "message": "Based on my understanding of his method thus far, the antagonist and the opponent are one in the same.", "group_id": 2515, "id": 1585234}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1310058402.120923, "message": "He doesn't differentiate between antagonist and opponent (actually, I don't think he uses protag/antag labels that much at all).  The closest he comes to the influence character is the fake ally/opponent, but he's much more specific (one being an ally who appears to be against the goal of the main character, but shows him he's doing something wrong vs. the opponent who appears to be an ally but is working against them (which is more like a contagonist)).", "group_id": 2515, "id": 1585664}, {"user_id": 7712, "stars": [], "topic_id": 41267, "date_created": 1310156998.930052, "message": "Just a quick note to express my thanks to all for participating in this thread. I'm currently teaching a Memoir writing class for beginning writers and am making my best effort to weave Dramatica definitions into my lecture material and exercises. My belief (and hope) is that if Dramatica theories are introduced in a workshop through conversational lecture material by associating and comparing them with conventional terms used by Truby (and McKee, Hague, Vogler and Campbell...) that if and when the aspiring writer begins to formally use Dramatica that it will be much less difficult and intimidating.\n\nNext August I begin teaching creative fiction writing classes and will be using the same approach. \n\nThanks again for your feedback, it's been very helpful.", "group_id": 2515, "id": 1595820}, {"user_id": 7645, "stars": [], "topic_id": 41267, "date_created": 1310159203.0888441, "message": "Awesome, it would be interesting to hear how this works out.", "group_id": 2515, "id": 1596036}, {"user_id": 33839, "stars": [], "topic_id": 41267, "date_created": 1310165799.135222, "message": "Probably the biggest difference between the two I could point to is that Truby's theory is more linear: there's a definite start and end point carried through time and space (thinking left to right) whereas Dramatica appears to be much more vertical in the way it drills down into sub-categories.  \n\nI realize this changes a bit once getting into structure and storyweaving, but even thing, when going over my last script, I found myself working it more vertically than horizontal for some strange reason.", "group_id": 2515, "id": 1596600}]