[{"user_id": 7263, "stars": [], "topic_id": 14738, "date_created": 1300897552.9070721, "message": "One of my favorite design firm websites, it's simple, straight to the point, and I love news tickers: http://www.collins1.com/", "group_id": 345, "id": 418590}, {"user_id": 7263, "stars": [], "topic_id": 14738, "date_created": 1300897692.31162, "message": "I really appreciate this one because the entire structure of the website is based around one sentence that says what they do, \"We help companies design their future.\" http://www.sypartners.com/", "group_id": 345, "id": 418612}, {"user_id": 5612, "stars": [], "topic_id": 14738, "date_created": 1300907391.1626539, "message": "I like simple best. Sometimes all of the \"flash\" and \"look we're creative on our website\" can be too much for me. I think keeping our audience in mind is key - some of the people who will be contacting us could be project or business managers - or people in some type of leadership role who don't know what usability or design research is - but are told they need to go out and find someone to do it. A site that is easy to navigate and gets to the point telling others how we can benefit them is key. I won't say this site has the greatest design, but their rotating banner rotates slowly, so you can actually see it, and their offerings are clear on the home page. It may be a little TOO much information, however. http://www.akendi.com/", "group_id": 345, "id": 419837}, {"user_id": 5612, "stars": [], "topic_id": 14738, "date_created": 1300908050.3011701, "message": "Ok adding another one - the pictures on here look a little clip-arty to me, but I like how they've illustrated what they do and how they discuss their processes. I think we need to provide - at least at a high level - clarification into what we're going to do, how we're going to do it, and what you're going to see at the end. http://www.ergosign.de/en/services", "group_id": 345, "id": 419952}, {"user_id": 5612, "stars": [], "topic_id": 14738, "date_created": 1300907495.3198669, "message": "I like this site too - easy to navigate and understand - its all on one page, clear, concise, broken up into relevant sections, and seems to provide just enough information to get the call. http://www.amber-light.co.uk/", "group_id": 345, "id": 419857}, {"user_id": 5612, "stars": [], "topic_id": 14738, "date_created": 1300989602.140604, "message": "In the DR meeting today, we went over the Process of Collecting and Understanding Data and it was discussed that we originally created this to help a client understand what it is we do. Should we include something like this on our website to help future clients understand our processes or potential processes?", "group_id": 345, "id": 429131}, {"user_id": 7272, "stars": [], "topic_id": 14738, "date_created": 1301491086.7694249, "message": "can we post a link to our site in progress? or maybe some server file paths to where we can find concepts, etc.?  I'd love to see what's up so far!", "group_id": 345, "id": 481457}, {"user_id": 5612, "stars": [], "topic_id": 14738, "date_created": 1302026779.4126749, "message": "i know this isn't anything new - but I'm really loving this perspective web design. Wonder if we could use anything like this? Or has this been overdone? I just feel more \"drawn in\" to the website. Some of these examples are better than others... http://tympanus.net/codrops/2011/01/28/depth-perspective-web-design/", "group_id": 345, "id": 543986}, {"user_id": 2739, "stars": [], "topic_id": 14738, "date_created": 1302128969.4613609, "message": "also, Adrienne, although I was unable to visit the site for Sypartners, one concept we are looking at is one based on a single sentence. Colette and Sherie came up with it a bit ago and it is an interesting idea.", "group_id": 345, "id": 565896}, {"user_id": 2739, "stars": [], "topic_id": 14738, "date_created": 1302128610.797358, "message": "Ok, so I've got to get here on convore a lot more, didn't even realize this topic was here. That said, couple of things, yes, we are going to be using half of Dan's office as a war room for the website design and will encourage everyone to check out our progress.", "group_id": 345, "id": 565883}]