[{"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307484276.3533659, "message": "Given that a person with a Problem of Oppose doesn't necessarily go around opposing things, but rather, some other more natural trait she has \"opposes\" (She's too nice to be invited into the mafia, say)... how does this extend to the Build Character Window?\n\nIf someone has a Methodology of \"Evaluation\" or a Purpose of \"Aware\"... how does this work?\n\nHow can the way someone does something spark \"Evaluation\" without the character going around evaluating things?\n\nPurpose: Aware -- this seems easy. A character dies using a drug, making everyone aware of its danger. \n\nI've never thought about this. I'm just inviting discussion.", "group_id": 2515, "id": 1328792}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307487780.9676609, "message": "RE: Evaluation, think of a teacher.", "group_id": 2515, "id": 1330246}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307487829.675909, "message": "Or, to see how well she is doing, she is evaluated by her superiors.", "group_id": 2515, "id": 1330262}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307488358.604655, "message": "Like, Chris Rock doing a routine on Blacks vs. Niggers can make us aware of racism inside that community, but he isn't going around making people aware directly...", "group_id": 2515, "id": 1330361}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307488034.279315, "message": "Aware means to be more aware of those around you.  So, you might have a character that runs a charity and wants people to be more aware of the terrible conditions that the local homeless endure.  He might put up a billboard that says, \"One out of every 50 people is homeless.  How many of them do you know?  Where do you think they go at night?  What would you do if you lost your home tomorrow?\"", "group_id": 2515, "id": 1330292}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307487812.895083, "message": "In order to determine how well certain students are doing, she performs evaluations of them.", "group_id": 2515, "id": 1330259}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307488087.771558, "message": "But... that's evaluation as action, as opposed to evaluation as the fall out of some sort of behavior. (Like, death forces awareness.)\n\nMind you, I'm not sure I'm going to get where I'm headed. I'm exploring Dramatica with this topic.", "group_id": 2515, "id": 1330297}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307488448.5772259, "message": "An example of Self-Aware as a purpose would be to make someone realize how many times they say a phrase or make a sound when they speak, um....you know?", "group_id": 2515, "id": 1330384}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307488117.211551, "message": "Ah... doesn't help that I'm using \"aware\" incorrectly and colloquially.", "group_id": 2515, "id": 1330301}, {"user_id": 10814, "stars": [], "topic_id": 38547, "date_created": 1307488344.650811, "message": "It is important to understand that we exist in both the physical and mental worlds.  You'll notice that all the elements are found in EACH of the four domains -- both internal and external.  You may be looking at awareness and evaluation internally or externally.  The context provided by the domain will help you with your aim.\n\nThe element natures do not limit themselves to internal or external usage.", "group_id": 2515, "id": 1330355}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307490252.494118, "message": "I don't think I'm communicating the gist of my question.", "group_id": 2515, "id": 1330820}, {"user_id": 35323, "stars": [], "topic_id": 38547, "date_created": 1307518288.8650119, "message": "Imho it's really hard to discuss characters with only two characteristics defined (like Evaluation and Purpose) On the other hand this specific example can be transalted like this (of course it depends on the domain). \"The character wants to be aware of something going on outside and to achieve that goal he evaluates the circumstances around him.\" He wants to know how his business is going and to achieve that he initiate an internal screening of the company. He wants to know how much his wife loves him and for that he creates situations in which he can test her love. He wants to know the profile of the serial killer and for that he analyzes the previous murder cases.", "group_id": 2515, "id": 1334642}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307553483.8863921, "message": "This whole thing took a left turn right out of the gate. I'm going to try again.", "group_id": 2515, "id": 1339408}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307554276.0688519, "message": "Let's say you've got two groups of high school students. One, a theater group who wants to put on a play, and needs the theater, and their goal is to get a big audience.\n\nThen, you have the B.O. kids. They eat garlic and beans and never shower. A gross bunch.\n\nIn one story, it could be great that they spend all lunchtime in the theater. But in this story, it is hindering the goal of the other kids -- they'll never get a big audience if the smelly kids are in there making the place rank.\n\nNow, nothing about the B.O. kids demands that they embody \"hinder\" -- it is the interaction of their smell and the story goal that makes them \"hinder.\" That is their Purpose in the story, or maybe their Methodology. They don't set out with that Purpose, but it emerges as other factors fall into place.\n\nSo, my question is along the lines of \"how does an interaction similarly result in something like 'an evaluation of possibility'\"? Yet, without someone going out directly to Evaluate something. Or without directly looking at something with an eye toward possibility.", "group_id": 2515, "id": 1339528}, {"user_id": 30951, "stars": [], "topic_id": 38547, "date_created": 1307619978.4124379, "message": "I think I get what @MikeDerk is trying to clarify. We will see..........................\n\nOne thing that has come up in this forum is the mistake some people have made using Dramatica terms too literally. In other words, 'Attitude' doesn't only mean a character has attitude, but for example, the way they react to something. \n\nFor example,  - if every time I fly alone I get scared, but don't deal with it because I think phobias are stupid  - ,  this could be an issue of Attitude. Problem could be Hinder (stopping myself dealing with it), Solution: Help (when a friend comes with me and explains what to do, everything is ok).\n\n@MikeDerk, am I on the right track?\n\nIf so, I think Evaluation could definitely occur with it being direct. How about this....\n\nJohn meets girl, is not good at relationships because he is too fussy. He can't decide if he likes the girl or not, and doesn't commit fully because of this. In the end, her impatience with his lack of progress causes her to leave him.\n\nHis Problem could be Evaluation (he isn't gong out to Evaluate, but that is the effect of him being so fussy), the solution Re-Evaluation (he needs to take a good look at himself and work out how to deal with relationships).", "group_id": 2515, "id": 1348582}, {"user_id": 35323, "stars": [], "topic_id": 38547, "date_created": 1307618158.7525311, "message": "Not very clear what you mean by \"evaluation of possibility\". The Evaluation element is \" the meaning a character finds in a situation or circumstances.\" A character evaluates when he is simply prejudiced (like a racist person who's mean with black folks), a parent evaluates when checking the grades of his kid etc. As your example illustrated Hinder can be a passive or unwanted thing, but Evaluating passively or unwantedly sounds pretty weird for me.", "group_id": 2515, "id": 1348319}, {"user_id": 30951, "stars": [], "topic_id": 38547, "date_created": 1307620017.733181, "message": "The 'with' in \"If so, I think Evaluation could definitely occur with it being direct. How about this....\"  should be 'without'", "group_id": 2515, "id": 1348585}, {"user_id": 35323, "stars": [], "topic_id": 38547, "date_created": 1307621947.0836561, "message": "@Mikeaja: The example is right yet your solution only works because the boy you described doesn't actually do any Evaluation. Or at leas Evaluation is definitely not his Methodology. Taking one step back I don't even see how Evaluation could be the Methodology of a character at all. It's not in that segment of the chart...", "group_id": 2515, "id": 1348929}, {"user_id": 30951, "stars": [], "topic_id": 38547, "date_created": 1307622799.3604529, "message": "I was just talking about the Problem Element, not character traits. I think the boy in the example could have a Problem of Evaluation (he is spending too long making up his mind. To fix this he needs to take a good long look at himself). We don't need to actively do the word used for the Problem element, just that it is the area of the Problem. \n\nI might be on the wrong track anyway as far as @MikeDerk's question.", "group_id": 2515, "id": 1349196}, {"user_id": 7664, "stars": [], "topic_id": 38547, "date_created": 1307637907.3572559, "message": "@Novbert I'm not talking about the element, but the Build Character quadrant of Evaluation.", "group_id": 2515, "id": 1351752}]