[{"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1304890074.906877, "message": "From the D9 topic, I thought I'd initiate a discussion around something that confuses me at times. When Dram talks of Author view, I wonder how deeply this is supposed to go.\n\nFor example, I have read a lot of crime novels, and clearly the authors view knows everything about the crime - who did it, why they did it, and all other elements that are involved, but probably not everything about the deeper motives, and the world around them. In other words, there are levels that may have influenced the story events, but in my opinion are not part of the author's story. \n\nI've always imagined the author's view as being the view of the story that the audience will be told, but from a see-all-at-once perspective, not necessarily a know-everything perspective.", "group_id": 2515, "id": 960956}, {"user_id": 7664, "stars": [], "topic_id": 34283, "date_created": 1304908848.3367641, "message": "I've always approached plays with the idea that we don't need to bring anything else into them in order to stage them well. That makes both views identical.\n\nIf I broaden my perspective, I feel like you're asking a question along the lines of \"why does X story play well during Y time\", like somehow there is a resonance between the story and the period it's made. Like, MASH works because it paralleled the Vietnam war, but today it seems boring. \n\nAre you asking about cultural context?", "group_id": 2515, "id": 964772}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1304925656.1289921, "message": "Yes, I guess you're right about MASH and the reasons. Rather than why it did / didn't work culturally, I was thinking more along the lines of the fictional world. For example, if we analysed one character, we would see what the audience knows, we could guess what the author's intention for that character was. \n\nHowever, in this example, if we took a more psychological route, we could probably identify reasons why the character may have behaved they way he/she did based on other well-known motives. But to me, these may not have been considered in the story by the author. So to me, they are part of a greater world view that should not be part of a storyform.\n\nAs in D9, a number of things we added to the storyform discussion were our own assumptions, connections. And at some point, IMO, we possibly slightly moved from the author's world or intentions for the story, into a wider view incorporating our own beliefs.\n\nI guess the question is, how much should we infer regarding the author's intentions / knowledge of the world they chose (like alien issues, Joberg, prejudice, motives) when creating storyforms from movies? \n\nMore importantly, I see a potential pitfall where a storyform may work for an author in Dram, but not for the audience because the author hasn't told them enough. Dram won't know this.", "group_id": 2515, "id": 968113}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1304925736.4888, "message": "(which would lead the audience to make their own assumptions / conclusions based on their own experiences).", "group_id": 2515, "id": 968116}, {"user_id": 10814, "stars": [], "topic_id": 34283, "date_created": 1305138842.495631, "message": "The storyform is intended as an objective view of the abstract meaning built into the structure and dynamics (dramatics) of a story.  It is a truly all-seeing view, even if the author does not see everything because of his personal biases and blindspots.\n\nStoryforming, however, is only one fourth of the story creation process.  The other three are:\n\n-- Storyencoding, in which the abstract concepts held within the storyform are symbolized by the author through storytelling\n\n-- Storyweaving, in which the illustrations created during Storyencoding are presented temporally (e.g. movies, plays, novels, etc.) and spatially (e.g. graphic novels, art installations, etc.)\n\n-- Story Reception, in which the audience receives the story and decodes it, influenced by its own experiences, biases, and blindspots\n\nSo, when you look at a storyform, make sure to realize it is only a part of the process.  It is not intended, nor can it satisfy, all of the requirements for a complete story.", "group_id": 2515, "id": 1011808}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1305235031.506392, "message": "Thanks Chris, that helps clarify. I have difficulty with the all-seeing view, possibly because I'm a complicated person and could probably find all number of reasons / depths to explain why something happened. \n\nI get it with, for example  crime story where the author knows who did it, why, when, etc. If looking though at the story world, for me an 'all-seeing' view could go well beyond that. For storyforming, I guess I have to choose where that all-seeing view ends in my own stories. Perhaps I am mixing the story and the world that would exist around the story.", "group_id": 2515, "id": 1030113}, {"user_id": 10814, "stars": [], "topic_id": 34283, "date_created": 1305236409.815259, "message": "Sounds like it.  That is a common practice of most writers.  It is difficult to look at one's own work objectively, just as it is difficult to look at oneself objectively.  Dramatica provides that objective perspective, which makes it possible to see an objective view of your story (or you), but it remains difficult to process that objectivity into something that fits in your subjective view.", "group_id": 2515, "id": 1030306}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1305267766.7704091, "message": "I had never thought of it like that.....\n\nI had always seen the Dramatica perspective as not wider than my own view. But what I think you're saying is that my view will be biased because of my own beliefs / experiences (which I'm sure it would be), whereas a Dramatica storyform view is a wider view of the story than my own.", "group_id": 2515, "id": 1036656}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1305268185.3780601, "message": "If I'm on the right track here, then I guess an example would be 'crime doesn't pay' as a theme for a story. I presume then that I should focus the storyform on the question without bias, therefore crime might / might not pay, even though my own complete view (and I guess, naturally subjective) would suggest it doesn't pay.", "group_id": 2515, "id": 1036746}, {"user_id": 10814, "stars": [{"date_created": 1305585474.0989821, "user_id": 7645}], "topic_id": 34283, "date_created": 1305298669.460175, "message": "The example I use are the four throughlines, which represent the I, You, We, and They perspectives.  In our own lives, we experience the I, You, and We perspectives first hand, but we can never get the objectivity of the They perspective of ourselves directly.  In other people's lives, we experience the They, We, and You perspectives first hand, but can never stand in their shoes and experience the I perspective directly.  So, we can experience all four perspectives but not within a single context.\n\nStories give you the I, You, We, and They perspectives within the same context, the same point of reference.", "group_id": 2515, "id": 1042468}, {"user_id": 10814, "stars": [{"date_created": 1305585471.420788, "user_id": 7645}], "topic_id": 34283, "date_created": 1305298325.4328361, "message": "Theme isn't generally black and white, nor is it effective when presented as a statement.  An argument, such as a grand argument story, shows ALL sides of the conflict and it is the culmination of the interactions and by-play between the conflicting sides that results in a summation that \"Crime doesn't pay.\"\n\nOf course, there are many examples where crime DOES pay.  \n\nAnd yes, Dramatica's view of story is wider than we get at one time in real life because STORIES have a wider view than we do in real life.  That's one of the reasons we are drawn to stories -- they give us a more encompassing experience of the world than we normally get...ALL WITHIN THE SAME CONTEXT.  That is the key.  We can see most of the same things that are in stories, of course, but we must shift context to see all of them, and when you shift context you alter the understanding/meaning of whatever it is you look at.", "group_id": 2515, "id": 1042361}, {"user_id": 30951, "stars": [], "topic_id": 34283, "date_created": 1305313146.120156, "message": "Thanks for that explanation, appreciated.", "group_id": 2515, "id": 1045761}]