[{"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158296.7557981, "message": "Knowing that Act order is based in part on the Main Character's Mental Sex and the Story's Judgment I tried clearing the storyform and starting with the things I KNEW were correct. Change, Start, Be-er, Action, Success, Physics, Obtaining, Self-Interest, Pursuit. I then headed over to the Plot Progression window and tried to make the Act order Learning, Understanding, Doing, Obtaining.", "group_id": 2515, "id": 1402499}, {"user_id": 7645, "stars": [{"date_created": 1310341735.6067729, "user_id": 13109}], "topic_id": 39460, "date_created": 1308158401.4230249, "message": "The Judgment of Bad is much easier to argue. For one, the ending of the film has a decidedly bittersweet feeling to it. She survived, yet there is a still a storm coming. Bittersweet endings call for either Success/Bad or Failure/Good. The film certainly has an Outcome of Success. Thus the Bad Judgment would fit better considering the overall feeling of the ending. In addition, if you take the photograph of her as a snapshot of her emotional standing, a Judgment of Bad seems most appropriate. I believe Reese even makes some comment regarding how sad she looks. It's not a particularly joyful we-just-blew-up-the-Death-Star snapshot, but rather something more angst-ridden and down.", "group_id": 2515, "id": 1402519}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158413.9628069, "message": "The really interesting aspect of this is that by flopping the Mental Sex and Story Judgment, the Unique Abilities/Critical Flaws/Catalysts/Inhibitors remain the same!", "group_id": 2515, "id": 1402520}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158436.7976489, "message": "So can someone check my work on this? I don't have Dramatica in front of me right now, but from my recollection this storyform plays out as written above. Any comments regarding this new appreciation of the story's dynamics? With all things considered, I feel this might be a more accurate interpretation of the story's meaning.", "group_id": 2515, "id": 1402524}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158257.2540541, "message": "Taking a closer look at the official storyform for \"Terminator\" (currently http://www.dramatica.com/story/storyforms/storyforms/Terminator_storyform.html), I began to question the plot progression, particularly within the Objective Story.", "group_id": 2515, "id": 1402496}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158266.0757251, "message": "As it stands now the Act order is Learning - Doing - Obtaining - Understanding. This feels very wrong to me. If anything the last Act is all about Obtaining, not Understanding. While watching it last weekend I got the impression that the first half was about Learning and Understanding, and the second half was about Doing and Obtaining. In my head I was thinking, this has to be LUDO, it's so obvious!", "group_id": 2515, "id": 1402497}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158297.130336, "message": "After various different combinations the best I could do was Understanding - Learning - Doing - Obtaining but *only* if the Main Character's Mental Sex was Male and the Story Judgment was Bad.", "group_id": 2515, "id": 1402500}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158392.0677769, "message": "As mentioned in the other Terminator thread the argument for Female Sex listed in the official synopsis is a bit light. Because the Act Order is so clear and because this is essentially a \"boy's film\" (Male audiences take to this film with little to no effort), I'm proposing that Sarah's Mental Sex should be Male/Linear rather than Female/Holistic. It is hard to argue this as she doesn't do a whole heck of a lot of problem-solving. Perhaps calling the police and following their directions could be evidence of a Linear problem solver? She doesn't seem to be shifting balances there.", "group_id": 2515, "id": 1402517}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308158424.953234, "message": "Originally I had thought it was going to be LUDO, this storyform: Change, Start, Be-er, Male, Action, Optionlock, Success, Bad, Physics, Obtaining, Self-Interest, Pursuit forces ULDO. I'm happy with Understanding coming first, and in fact think it is even a stronger argument, when you consider that there is a great bit of misunderstanding going on in the First Act. The Terminator shooting the wrong Sarahs, the police trying to understand the pattern, and so on. Learning is all about Reese telling her everything she needs to know in the car, and also the scenes of his interrogation on the video screen. Doing and Obtaining I was already happy with.", "group_id": 2515, "id": 1402521}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308163697.4116681, "message": "I have immediately run into problems. Putting the MC Domain to Mind forces a Decision story, which I can't support.", "group_id": 2515, "id": 1403227}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308163539.8547781, "message": "FWIW, I'm going to begin by plugging in \"Obtaining\" as the final OS Signpost, and Being as the 3rd SS Signpost. This already forces \"Becoming\" as the SS SP4, which I was hoping for.", "group_id": 2515, "id": 1403180}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308163450.315129, "message": "Very interesting. I was very unhappy that the final OS Signpost wasn't obtaining, and was weakly waving it off as \"Sarah finally understands that she has to kill the Terminator herself,\" which was BS and I knew it.\n\nI like you're arguments. I'll do some poking around.", "group_id": 2515, "id": 1403161}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308166207.133651, "message": "The only problem with that is it is not really how the final Act works. You're describing it as the denouement rather than the final act of a story. That turn into the final act begins when the Terminator shows up at the hotel.", "group_id": 2515, "id": 1403686}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308166343.5066171, "message": "You have to think of it objectively", "group_id": 2515, "id": 1403712}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308164733.1821129, "message": "Very interesting topic!\n\n.@jimhull    This bit you said \"I believe Reese even makes some comment regarding how sad she looks. It's not a particularly joyful we-just-blew-up-the-Death-Star snapshot, but rather something more angst-ridden and down.\"\n\nTo me this points more to Failure/Good. And disagreeing with you is worth a punt!\n\nIn a sense, Failure is always going to happen. But Sarah does everything she can possibly do, including making the decision at the end to tell John who is father is (which is essential because then he sends back Kyle). I think this HAS to be Judgement: Good. Doesn't it?", "group_id": 2515, "id": 1403442}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308165004.711036, "message": "I think one difficulty with the OS plot progression is that the end of the film is MC / OS together. It is only Sarah / reformed-waitress. We don't see anyone else. We don't know what the police think, Kyle is gone, Terminator is gone.\n\nI would argue that Learning - Doing - Obtaining - Understanding is ok. Here's why:\n\n#1 Learning  - Everyone learns something about the terminator and the future (although most don't believe it).\n\n#2 Doing  - Police trying to catch killer, Kyle trying to save Sarah, Sarah trying to survive. She's not ready to understand yet.\n\n#3 Obtaining - This to me goes right near the end of the film, and the killing of the terminator. Kyle gives his life to save Sarah. Terminator fails mission.\n\n#4 Understanding - the only character left is our reformed waitress, and she now knows and understands exactly what she has to do.", "group_id": 2515, "id": 1403475}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308166855.943053, "message": "That's how I began seeing it anyway......", "group_id": 2515, "id": 1403783}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308164467.7391779, "message": "I have to undo \"Being\" to get close to what I want.\nPart of my issue from this point on is that I don't see how Dream works as a Unique ability. (It allows her to take care of the requirement of Understanding.)", "group_id": 2515, "id": 1403421}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308165085.7317619, "message": "in #4, she does the most important thing of all.... now she understands Kyle needs to be sent, so she leaves the message for her son.", "group_id": 2515, "id": 1403483}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308166342.151988, "message": "as far as Failure/Good - Protagonist is clearly Reese - Reese wins so its a Success", "group_id": 2515, "id": 1403710}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308167147.96381, "message": "Reese might hand the final moment over to Sarah, but until that point, he is the one clearly trying to prevent her death, not her. She may be running, but that is \"hinder\" not \"prevent/avoid\" as I see it.\n\nPlus, I think he donning the mantle of protagonist there at the end is just showing us that she has changed.", "group_id": 2515, "id": 1403834}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308166813.7384341, "message": "Right. ok, I see what you mean about the acts. Now I'm a bit confused why Reese is the Protagonist. I get why, in the sense that in that case the Goal is to stop the terminator. I was assuming it was waitress because she effectively takes control nearer the end and it is her that makes it a success. I would say Reese only enables her to survive long enough to finish the job.\n\nWith that in mind, is the Goal killing the terminator? I would have thought it was survival. Only because waitress finally does what she needs to do is the story a success..... If after Reese had died, and waitress had killed the terminator, that's not enough. We need to see her pregnant and starting to prepare John, then we know it was a success.\n\nI've had a lot of practice at arguing about this film!!", "group_id": 2515, "id": 1403782}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308167036.965807, "message": "Totally disagree about the pregnancy.\n\nThe element that goes out of whack, to begin the story, is the arrival of the Terminator. Removing it is how to restore balance. He is removed = success.", "group_id": 2515, "id": 1403815}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308167262.0921061, "message": "Jim, theory question.\n\nI see @Mikeaja 's point that Sarah ends \"understanding\" things -- Movies can end by landing on their final signpost, no? It doesn't have to constitute an entire act?", "group_id": 2515, "id": 1403855}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308167625.603406, "message": "Cool, they don't. Grammar for the win.", "group_id": 2515, "id": 1403910}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308167606.5260141, "message": "This is a test to see how apostrophes affect mentions: @jimhull's", "group_id": 2515, "id": 1403907}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308169155.7969649, "message": "Lol that's not my understanding of the theory. An act represents an area of exploration, and I see them more exploring Obtaining in that Act (killing each other) rather than coming into conflict over Understanding.", "group_id": 2515, "id": 1404079}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308170765.2059031, "message": "Ha! I would say if your last act sucks (sense an inequity) and you feel the need to justify it away (by warping the theory) then I would say Dramatica is doing it's job! Knowing now that that Signpost has to be an exploration of conflict, now you know how to un-suckify your last act -- namely, by encoding that last Signpost with greater instances of conflict.", "group_id": 2515, "id": 1404301}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308169222.7480021, "message": "I'm with you -- I see the act being about Obtaining.\n\nBut, in a story dominated by Journeys, could it start on a signpost (briefly) and end on one -- all the exploration is in the movement?", "group_id": 2515, "id": 1404096}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308169293.884768, "message": "PS. My last act sucks, and this is sort of how I'm justifying it. Whoa!", "group_id": 2515, "id": 1404101}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308171065.9500921, "message": "Re: her Unique Ability of Dream - Unique Ability is more about connecting the MC Throughline with the OS Throughline rather than something specifically *about* the Main Character. I know you know this, but it can be something attributed to her. I actually think the description in the linked synopsis is correct - Kyle's dream about her, a future beyond all expectations, is the driving force behind her Understanding the Terminator, the future, her son, and how she fits into all that.", "group_id": 2515, "id": 1404341}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308172367.830358, "message": "Yeah that makes sense. Both posts...", "group_id": 2515, "id": 1404603}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308175189.8376391, "message": "Ah ok, I didn't know that could happen. But isn't our waitress still in the film? Isn't it important that we are watching the final part of the waitress becoming a soldier?", "group_id": 2515, "id": 1404999}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308175264.5420401, "message": "It's this sense of understanding that keeps going round in my mind....... I think the conflict ends because we know she knows what needs to be done next. Or something like that.", "group_id": 2515, "id": 1405015}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308175005.662396, "message": "I think you both are more up on the theory than I am. But when I look at the film, the ending (what happens Sarah is taken in ambulabe) is a crucial part of the film. The story / film would be weaker and make less sense (imo) without that ending. It tells us that she is a leader, a soldier-to-be and the mother of a the savour of mankind. And that tells us that it was all for something, that our waitress will help save the world. \n\nI appreciate the film could have ended, like some do, while she was being taken to the ambulance (seeing she was ok). We would have assumed the humanity was in safe hands.\n\nHowever, it didn't end that way because, I believe a very important point was being made about the time circle. It completed the journey. A lot of what occurred before suddenly makes more sense (why Kyle was sent, why her eyes were sad, that she is really someone special).\n\nNow, imo, without that ending the story would have been different. For example, I've read some fans say that John Connor must have had a different father in the 'first' timeline. However, I think the ending tells us exactly what, how and why it happened.\n\nMy point is, shouldn't something so important be part of the storyform, even if it isn't the traditional way to end an action film?", "group_id": 2515, "id": 1404967}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308175461.26595, "message": "the waitress becoming a soldier deals with her MC Throughline - the Be-er is becoming a Do-er (taking over Kyle's perspective/approach to solving problems). In a perfect world the throughlines would all end at once, but more often than not there is some delay. Romantic comedies do this ALL the time where the OS will end, and then you have to wait 20-30 minutes for the Relationship Throughline to be resolved! *You've Got Mail* took almost 45 minutes! I think this is also another reason why most men can't stand films set up like this - with no OS they get *very* antsy.", "group_id": 2515, "id": 1405059}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308175104.1786189, "message": "It is part of the storyform - it's the MC Throughline - the OS throughline ends when the Terminator becomes a pancake.", "group_id": 2515, "id": 1404979}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308175683.601532, "message": "Ok.... guess I'm still not looking at throughlines correctly. It makes me want to put MC in Psychology though and Becoming......", "group_id": 2515, "id": 1405126}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308177562.9544079, "message": "Yeah, I think the domains we have are pretty solid. You might be confusing the growth of a Change Main Character with what is truly problematic for that throughline. She is certainly being manipulated, but that comes in her relationship with Kyle.", "group_id": 2515, "id": 1405394}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308178907.700752, "message": "The waitress is gone at the end of the movie; that's my perspective.\n\nIt took me a while to understand this -- it's not highlighted it Dramatica -- but stories typically go through this cycle:\n\n-- Stasis\n-- Not Stasis\n-- Stasis\n\nThe Waitress was part of the first stasis, but she cannot be part of the last stasis. (That's the effect of the Change.)", "group_id": 2515, "id": 1405575}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308179025.4797399, "message": "In my own outlines, I find it very difficult to have all four throughlines close independently. Usually the change in the change character also lines up with the success or failure (usually it's causal).\n\nI only point this out because I think parsing the domains apart at the beginning and the end of stories can be tricky.", "group_id": 2515, "id": 1405606}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308210004.888973, "message": "Have to say, I'm struggling with this. Accepting the OS points, so ending on Obtaining, I don't see the MC plot progression clearly. With Mind, I see the end of the MC thoughline as being The Conscious. This is where the original storyform was.\n\nNot to complicate things, but I could also see the MC final signpost being 'Becoming' or 'Conceptualizing', as we clearly see a soldier-to-be at the end, not a passive waitress, who is putting into action what she has realised she has to do. I only mention this because, to me, they fit better than Subconscious.\n\nWith the new storyform, the MC final act is Subconscious. I can't get my head around that.\n\nI might just be missing something here.\n\nI also think there is a bit of the MC throughline missing in the film. After the Terminator is squashed, we see Sarah taken away in ambulance. Then we get the petrol station scene, where she has clearly developed from waitress-who-came-through-in-the-end, to a much stronger woman who clearly understands her responsibilities. We don't actually see that final growth.", "group_id": 2515, "id": 1408184}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308231668.9233191, "message": "\"We loved a lifetime\" doesn't fit Subconscious?", "group_id": 2515, "id": 1410109}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308234398.590677, "message": "That is hardly explored. I would say the fear of the Terminator at her heels is Subconscious too, though.", "group_id": 2515, "id": 1410524}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308237281.073256, "message": "I guess when I look at this part of the description \"The Subconscious deals with the sum total of a character's experiences\"  I can see how it might fit.", "group_id": 2515, "id": 1411101}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308236931.128989, "message": "@jimhull  yes, I think that statement is.......... but as MikeDerk mentions, is it enough about what's going on? Maybe it's just me, but I find that ending very powerful, very essential, and very much about her becoming (not just in Dramatica sense) the person she needs to be, for John to be the man he needs to be. \n\nI guess it has more power because of where she is at the start...... as you said before, even before the terminator arrives there's work and man issues. Funnily enough, the terminator arriving in a way, solves those issues for her. Just seeing if I can talk myself into understanding this better...........", "group_id": 2515, "id": 1411041}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308238319.170769, "message": "Now, I just need to get clear in my head how Judgement can be Bad. All the sadness at the end seems to me to be about everything she had no power over. There's nothing she could have done to change things. She make the right decision is finishing off the Terminator and taken responsibility for the development of her unborn son.\n\nThe outcome is a failure (sort of) from the start. The war will happen. Not sure that counts as failure in the Dramatica sense though.", "group_id": 2515, "id": 1411288}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308241965.3940771, "message": "@MikeDerk's argument is stronger. Final act starts when the Terminator returns to the hotel. The contemplative nature of her at the gas station is really an excuse to rationalize away the time paradox (\"Hey audience, I know if you really think about it you can find all kinds of holes, probably not a good idea -- you'll go crazy!\")", "group_id": 2515, "id": 1411685}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308242053.5464981, "message": "Inciting Incident (first driver) creates the inequity. Protagonist pursues the Goal which will resolve that inequity. If the Goal has been achieved then the Outcome is a Success. If the Goal hasn't, the Outcome is a Failure. Terminator comes to town = start of inequity. Reese shows up as Protagonist to keep him from killing Sarah. Reese wins, thus the OS is a Success.", "group_id": 2515, "id": 1411693}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308245200.8189449, "message": "@Mikeaja \"The war will happen.\"  Believe it or not, the war is actually part of the backstory, since it has already happened (in the Future) and is the impetus for the trips to the past by the Terminator and human warrior (Kyle).\n\nThat's the tricky thing about time travel stories.  The PLOT does not respect \"real world\" linearity unless the author makes it so.  If you were to line out the plot for The Terminator, it would be something like this...\n\nBackstory:  Machines are attempting to wipe out the human race.  The humans have a leader, John Connor, who may lead them to win the human/machine war (in 2027).\n\nStory:  Machines and humans each send one representative to 1984, one to kill John Connor's mother (Sarah Connor0", "group_id": 2515, "id": 1412170}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308245451.096437, "message": "Oops..  Continuing....\n\nOne to kill John Connor's mother, and one to protect her.  The humans succeed in protecting the mother.\n\nPost story:  The mother, now pregnant with JC, begins to train and plan for the upcoming disaster, knowing that her son will be mankind's savior.", "group_id": 2515, "id": 1412185}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308245579.1915929, "message": "NOTE:  At the end of the backstory, the humans had ALREADY WON.  They had taken control of the mainframes and the war was over, except the machines sent their assassin to change the future by erasing JC from the past just before the humans destroyed Skynet.", "group_id": 2515, "id": 1412190}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308250720.5935049, "message": "Right. I think I see what you and Jim mean. I guess my interest in sci-fi leads me to care more about the end, and I therefore was trying to get it into the storyform. I need to see the story as being from inequity to solving that in equity. All through out initial Terminator discussion I was assuming Sarah was protagonist.\n\nOn a different note, it's Interesting about the humans already winning. Yes, that's clear from what Reese says early in the film. It makes the second film look a bit silly. Also JC is 1 in that, yet Kyle tells Sarah the war is a few years from now.", "group_id": 2515, "id": 1412736}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308253072.242347, "message": "I think the idea was that the technology left over in Terminator 1 changes the future in T2, though T3 sort of does a course correction timeline-wise, which sets up the modified, but still \"on course\" version in T4.", "group_id": 2515, "id": 1413076}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308336967.840975, "message": "Although....... I understood terminator as basically telling us that everything that happened in the film was suppose to happen / needed to happen for Kyle to be there in the first place. And that Skynet actually caused it's own demise because with Arnie going back, Kyle wouldn't have been sent.  The clues to that are the photo at end being the one Kyle had, telling John about Kyle, the fact his the father, Kyle teaching Sarah what she needs to know to learn how to teach John.", "group_id": 2515, "id": 1421589}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308337013.861917, "message": "That being the case, shouldn't everything in the film be part of that? Ok, I', looking at this very 'sci-fi', but if the thing is a loop, then it's all in the loop.", "group_id": 2515, "id": 1421594}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308337077.8629689, "message": "Back to the storyform................ happy that this thread has cleared up some OS / MS understanding for me. I've re-read the thread. I get everything now....... except still have difficulty with the Judgement: Bad. If I was writing this story, that would never occur to me. What don't I know?", "group_id": 2515, "id": 1421603}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308339746.086, "message": "That's the Counterpoint, so yes it is explored but I don't think its the source of the OS problem. You have to look at everything holistically - the elements under the Issue, the relationship with the other throughlines. Faith, Disbelief, Conscience and Temptation really don't describe Terminator the movie. Pursuit, Avoid, Control and Un-controlled do.", "group_id": 2515, "id": 1422009}, {"user_id": 7664, "stars": [], "topic_id": 39460, "date_created": 1308338269.1039059, "message": "I have trouble with Bad too. I think Sarah benefits from waking up to her potential, but the burdens that come with it are \"heavier\". \n\nWhat's tricky, is that that it's symbolized in the coming storm -- it's not coming directly from her. The same thing happens at the beginning of the movie, when the co-waitress says, \"Think about it this way, in a hundred years, none of this will matter.\"\n\nThat's Sarah's irony, but it comes from outside.", "group_id": 2515, "id": 1421783}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308338559.201158, "message": "I might be about to argue with myself here........ I've just been reading the descriptions again about Judgement. Emphasis is made on the resolution of personal problems. Now perhaps things are clearer. Sarah, just looking at her, doesn't resolve her personal problems. She ends the film without a man, and in a way, her actions in the hotel (calling her mother) led the terminator to them and possibly meant the quicker demise of Kyle. That was very bad judgement.\n\nHowever, just to keep annoying you all...... a new issue. Should 'Morality' be the OS Issue, not 'Self-interest'? Everything is explored with a view to doing best for humanity.", "group_id": 2515, "id": 1421821}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308339755.947448, "message": "It is never a single choice made independent of other items because you could easily argue a host of other issues. Fate, Situation, Threat, and so on - all these could be OS Issues, but when seen in the context of how it would relate to everything else they don't fit.", "group_id": 2515, "id": 1422018}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308345058.6055939, "message": "@Mikeaja  A Judgment of Bad means the MC is left with unresolved anxiety (inequity).  This does not mean that her basic MC problem wasn't resolved, but more a judgment of where she ends up angst-wise.\n\nIt's not black and white, meaning Bad can mean anything from \"bad...\" to \"BAD!\"  Some stories leave the MC feeling terrible (Hamlet), while others are left with unresolved business that colors their life (Clarice in The Silence of the Lambs).  Sarah is more like Clarice.  Her new role as Madonna of the human race weighs on her, revealing she is NOT at peace internally.", "group_id": 2515, "id": 1422578}, {"user_id": 7645, "stars": [], "topic_id": 39460, "date_created": 1308346798.7787941, "message": "Yes, that sounds right.", "group_id": 2515, "id": 1422733}, {"user_id": 30951, "stars": [], "topic_id": 39460, "date_created": 1308346729.4235411, "message": "So, Judgement is not about decisions made in the story, more about the internal peace of the character, and whether issues presented are fully resolved or not?\n\nSo, if I understand correctly, although Sarah probably handled things as well as anyone could expect, if not better, the fact that she is not at peace at the end can be seen to determine the judgement (in this case).", "group_id": 2515, "id": 1422724}, {"user_id": 10814, "stars": [], "topic_id": 39460, "date_created": 1308348840.697036, "message": "Yes.", "group_id": 2515, "id": 1422958}]