[{"user_id": 30471, "stars": [], "topic_id": 34388, "date_created": 1304961060.1100249, "message": "So clearly we're going to have some code (C++, Cython, etc.) that needs to be compiled. I see that @scopatz uses distutils, which works for small projects but tends to be extremely cumbersome for larger builds. CMake is rapidly becoming the cross-platform build tool of choice for scientific software projects. Has anyone else experience with CMake for Python?", "group_id": 9127, "id": 974323}, {"user_id": 10421, "stars": [], "topic_id": 34388, "date_created": 1305131690.6477139, "message": "@sethrj I have some experience with CMake for C++ , and I expect that blending some python into a c++ CMake build is trivial. One of my friends ( @spidr ) is about to start working at kitware... maybe he's worked with C/C++/Python combinations using CMake he'll make a comment about it here  ....", "group_id": 9127, "id": 1009859}, {"user_id": 10421, "stars": [], "topic_id": 34388, "date_created": 1305131737.7386301, "message": "typo : ... maybe *if* he's worked ...", "group_id": 9127, "id": 1009866}, {"user_id": 10411, "stars": [], "topic_id": 34388, "date_created": 1305219082.4973869, "message": "@sethrj distutils is cumbersome for all projects.  However, this doesn't preclude its use in large projects (eg scipy).  I'd be interested in using CMake, but we'll still need to use distutils to get onto PyPi.  Also, I don't have a lot of experience in this area, so how well does CMake work on windows?  with Cython?", "group_id": 9127, "id": 1026314}, {"user_id": 10421, "stars": [], "topic_id": 34388, "date_created": 1305309841.2926011, "message": "@scopatz Just to clarify, CMake stands for Crossplatform make and is fairly language inspecific, which is to say, it's intention is to work well on windows/mac/unix alike, with nearly whichever combination of languages you dig. About cython, CMake is already equipped with a findCython.cmake module, so as far as I can tell, it's ready as it's gonna be.", "group_id": 9127, "id": 1044854}, {"user_id": 10421, "stars": [], "topic_id": 34388, "date_created": 1305309877.346462, "message": "typo: *its* intention, not it's .", "group_id": 9127, "id": 1044871}, {"user_id": 32023, "stars": [], "topic_id": 34388, "date_created": 1305310478.0903771, "message": "One of the discussions I've heard on trade offs between autotools (is that distutils?) and Cmake is that the former needs a shell (often missing on Windows machines) and the latter is a compiled application (available and functioning for Windows)", "group_id": 9127, "id": 1045097}, {"user_id": 30471, "stars": [], "topic_id": 34388, "date_created": 1305320543.6463399, "message": "@gonuke autotools is also known as \"autohell\" and is rapidly becoming obsolete. Distutils is another compilation system (a built-in python module) that I've heard is to be avoided at all costs because of the difficulty in performing even simple tasks. Making it cross-platform or even cross-compiler is a chore. CMake has both of those in mind, although its handling of Python-specific stuff is something of an extension.", "group_id": 9127, "id": 1047274}, {"user_id": 10411, "stars": [], "topic_id": 34388, "date_created": 1305369446.4823561, "message": "@katyhuff Ahh so it does.  I am mostly familar with cmake being the thing that has prettier makes than normal make.  I thought the 'C' stood for the lang, as that is all I have ever seen it used for.", "group_id": 9127, "id": 1051297}, {"user_id": 10411, "stars": [], "topic_id": 34388, "date_created": 1305369511.214504, "message": "@sethrj I am not sure I would use the term 'rapidly becoming obsolete'.  It is a pain to use, and might (hopefully) be dying...but it is still everywhere because it is too difficult to change.", "group_id": 9127, "id": 1051306}, {"user_id": 30471, "stars": [], "topic_id": 34388, "date_created": 1305378200.421576, "message": "@scopatz Sure, but a number of groups (Trilinos, Boost, ...) recently have started transitioning to CMake away from older build tools. The cross-platform benefits and maintainability to them is worth the initial investment of rewriting their build code.", "group_id": 9127, "id": 1052104}, {"user_id": 10411, "stars": [], "topic_id": 34388, "date_created": 1305416938.3155379, "message": "@sethrj I'd rather never think about Boost's build system ever again ;)", "group_id": 9127, "id": 1056315}, {"user_id": 10411, "stars": [], "topic_id": 34388, "date_created": 1305698710.89203, "message": "@sethrj  @katyhuff My stance on the build system stuff is that if someone wants to refactor it to use CMake, I am very much OK with this.  I just don't want to do it myself ;).  We can figure out the PyPi and setup.py hooks later.", "group_id": 9127, "id": 1093376}, {"user_id": 11246, "stars": [], "topic_id": 34388, "date_created": 1320000793.3926289, "message": "Hey peeps -- better late than never.  BTW, you have good google juice.  Here it is! :-) https://github.com/thewtex/cython-cmake-example", "group_id": 9127, "id": 2470041}]