[{"user_id": 28671, "stars": [], "topic_id": 32884, "date_created": 1304121862.923511, "message": "Hello, anyone has an idea on how to implement this: I want a contest owner to invite friends and family to rate the participant entries, Im already generating a model on DB with the email and the auto-generated password. Now when the external user comes to the site and tries to login, how should I proceed on saving this temporal session, so I know who is the invited user that's trying to rate some entries", "group_id": 81, "id": 865221}, {"user_id": 23244, "stars": [], "topic_id": 32884, "date_created": 1304146156.975986, "message": "One way might be to create the temporary user, but separate ordinary and temporary users, either by an attribute in a user profile or by placing them", "group_id": 81, "id": 866748}, {"user_id": 23244, "stars": [], "topic_id": 32884, "date_created": 1304146169.924216, "message": "In different user groups.", "group_id": 81, "id": 866749}, {"user_id": 23244, "stars": [], "topic_id": 32884, "date_created": 1304146265.01126, "message": "You can also use the permission system to separate them, giving standard users full permissions and temporary users only \"rating\" permissions.", "group_id": 81, "id": 866755}, {"user_id": 28384, "stars": [{"date_created": 1304777082.8975, "user_id": 14080}, {"date_created": 1308774255.6654401, "user_id": 21184}, {"date_created": 1308851443.3934159, "user_id": 3375}, {"date_created": 1309103092.8885729, "user_id": 24931}], "topic_id": 32884, "date_created": 1304186973.6139629, "message": "I also just saw this yesterday which may be of some help though I haven't really had a chance to check it out https://github.com/danfairs/django-lazysignup", "group_id": 81, "id": 870348}, {"user_id": 28384, "stars": [{"date_created": 1304777074.020314, "user_id": 14080}, {"date_created": 1308774250.3999751, "user_id": 21184}, {"date_created": 1309103094.9569099, "user_id": 24931}], "topic_id": 32884, "date_created": 1304186866.441437, "message": "If you go with temporary users, you might be able to use https://github.com/dziegler/django-urlcrypt to generate a link to email everyone which would log them in as the temporary user when they click the link and redirect them to whatever you want them to do", "group_id": 81, "id": 870341}, {"user_id": 28671, "stars": [{"date_created": 1308774248.8193331, "user_id": 21184}], "topic_id": 32884, "date_created": 1304345899.2260201, "message": "Thank you very much, I'll check the links. I ended up making an Invitation model with an email and random generated password, then send email with link, user logins and we set a COOKIE to keep track of the user actions", "group_id": 81, "id": 883469}, {"user_id": 25337, "stars": [], "topic_id": 32884, "date_created": 1304355564.523313, "message": "@jemerick Yeah, django-lazysignup is mine. Actually on one site I use it in conjunction with something very much like django-urlcrypt (which wasn't around at the time) in order to log people in without needing a password. Works pretty well - thanks for mentioning urlcrypt, I'll look into replacing my home-grown version with that one!", "group_id": 81, "id": 885771}, {"user_id": 28671, "stars": [], "topic_id": 32884, "date_created": 1304524293.886426, "message": "thanks", "group_id": 81, "id": 914659}, {"user_id": 19297, "stars": [], "topic_id": 32884, "date_created": 1308764689.329118, "message": "@danfairs A (late) question regarding django-lazysignup: I've been wondering about not having an email field in the convert form, is it to provide as easy conversion as possible, thus deferring the addition of an email adress until later, or something else?", "group_id": 81, "id": 1458847}, {"user_id": 1147, "stars": [], "topic_id": 32884, "date_created": 1308834016.4307089, "message": "django-lazysignups is very much like how we implemented the same concept (we called anon users) for Voxy.com except we didn't specify a custom authentication backend. We also added some code to merge a user if a user happens to login instead of sign-up. Very nice to have a standard way to do this for a future project. Thanks @danfairs!", "group_id": 81, "id": 1465759}, {"user_id": 31790, "stars": [], "topic_id": 32884, "date_created": 1309029839.1852801, "message": "For that matter, has anyone used django-lazysignups with django-social-auth?", "group_id": 81, "id": 1485313}, {"user_id": 31790, "stars": [], "topic_id": 32884, "date_created": 1309029661.462394, "message": "Has anyone used django-lazysignups with something like Userena or another user profile solution?: http://www.djangopackages.com/grids/g/profiles/", "group_id": 81, "id": 1485309}, {"user_id": 25337, "stars": [], "topic_id": 32884, "date_created": 1310629265.63254, "message": "@lemonad Yeah, that's pretty much it - given the idea of lazysignup was to remove as many obstacles to signup as possible, I just wanted to collect minimal information. You can always pass a different form_class into the convert() view, though - just make sure it has a get_credentials() method to return creds that lazysignup can use to log the user in once they've converted.", "group_id": 81, "id": 1635557}, {"user_id": 25337, "stars": [], "topic_id": 32884, "date_created": 1310629306.745492, "message": "@webmaven I haven't, but if there are any problems that stop it working properly, please raise an issue on the github tracker (or even better, fork/fix/tests/docs :)", "group_id": 81, "id": 1635562}, {"user_id": 25337, "stars": [], "topic_id": 32884, "date_created": 1310629028.9836459, "message": "@edmenendez Interesting - how did you merge work? I think lazysignup gives the user account an unusable password, so it *can't* log in until converted.", "group_id": 81, "id": 1635546}, {"user_id": 19297, "stars": [], "topic_id": 32884, "date_created": 1310728860.4829531, "message": "Thanks @danfairs! (iirc) what I ended up doing was staying in line with collecting minimal information so instead of asking users to pick username, password and email if they want to convert their lazy accounts, I only ask them for their email.\n\nAfter they have verified it, they can pick username/password.", "group_id": 81, "id": 1644416}]