[{"user_id": 30287, "stars": [], "topic_id": 33995, "date_created": 1304686452.622709, "message": "I find that the examples given in the Dramatica software muddy the distinction between an action-driven story and a decision-driven one.  For example, it lists Casablanca as a decision-driven story because of \"Ugarte's decision to entrust Rick with the letters of transit\".  Okay, but could that not also be described as an action:  \"Ugarte gives Rick the letters of transit\"?  How do you determine which is the real driver when every action is necessarily preceded by a decision to take that action?", "group_id": 2515, "id": 941702}, {"user_id": 30287, "stars": [], "topic_id": 33995, "date_created": 1304686188.5249009, "message": "Great new article, Jim.  But it raises an issue I've always had.", "group_id": 2515, "id": 941658}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1304701367.1715109, "message": "I find it easier to look at the final event; they tend to be clearer for me.", "group_id": 2515, "id": 944087}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1304702099.4868159, "message": "But, look at the beginning of The Town, or StarvWars. The action is already in progress. There is no decision.", "group_id": 2515, "id": 944173}, {"user_id": 30287, "stars": [], "topic_id": 33995, "date_created": 1304704891.4661291, "message": "If you take the example of Casablanca again, though, which is provided within the software, the decision to hand over the papers has already been made.  The action is the first thing we see.  And yet it is described as a decision story driver.", "group_id": 2515, "id": 944507}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1304708254.346267, "message": "Thanks, @ScreenwritingScreenwriter -- One way to look at it would be to ask, if it were about the Action of handing over the papers, what decisions did that action force?", "group_id": 2515, "id": 944895}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1304720976.783107, "message": "Jim, are you saying that \"handing over the transit papers\" is just setting up context for the decision?", "group_id": 2515, "id": 947250}, {"user_id": 30951, "stars": [], "topic_id": 33995, "date_created": 1304721149.96222, "message": "I thought Jim meant that to confirm 'handing over papers' was a decision was because it doesn't work the other way round - we can see how that decision leads to an action. but if we see it as an action, it's not clear what decision follows. At least, I think that's what he meant.", "group_id": 2515, "id": 947270}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1304722400.4475629, "message": "I may try to watch it and see if I can actually unriddle it for myself.", "group_id": 2515, "id": 947446}, {"user_id": 30287, "stars": [], "topic_id": 33995, "date_created": 1304722753.506964, "message": "What a chore, having to watch Casablanca, eh?  :)   Believe it or not, I only saw it for the first time about a year ago.  I've watched it about six times since.", "group_id": 2515, "id": 947495}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1304727139.5150521, "message": "@Mikeaja yes that's what I meant", "group_id": 2515, "id": 947882}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305056799.0477641, "message": "@ScreenwritingScreenwriter, I share your issue now. \n\nFor me, I wonder why the opening driver isn't the action of killing the German couriers. This forces Ugarte to hide the letters of transit -- he decides to give them to Rick. (If he doesn't, they'll be found on him, and he won't be able to sell them.)\n\nClearly, the final driver is Decision -- the decision to round up the usual suspects, instead of arrest Rick.\n\nSecond question: Once a decision forces an action... does that action force a decision?", "group_id": 2515, "id": 995100}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305058288.5263519, "message": "If you were to flip back and forth I believe the argument would be less effective.", "group_id": 2515, "id": 995368}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305058559.1550751, "message": "Lastly, Casablanca is an imperfect story as are all stories created by humans for the consumption of other humans. That initial killing is inconsequential to the meaning of the story. Take it out and the story would still have meant the same thing.", "group_id": 2515, "id": 995416}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305058421.025202, "message": "To the first point, murders happen all the time in Casablanca. Why is this one any different. Secondly if those murders hadn't happened would Ugarte have decided to entrust them with Rick? Maybe, maybe not. He certainly has more motivation, but it isn't a forced thing.", "group_id": 2515, "id": 995391}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305058256.5544591, "message": "I would say no to the second. That in a story you're trying to set up a causal relationship to support your argument.", "group_id": 2515, "id": 995362}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305058614.3891301, "message": "Contrast this with the Inciting Incident of The Fugitive. Remove his decision to blow the whistle and suddenly there is no reason for his wife to be murdered.", "group_id": 2515, "id": 995430}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305063438.663233, "message": "Question 3: I know that the Drivers don't have to trickle into the other domains, but if I choose to do so, would you recommend having the same driver?", "group_id": 2515, "id": 996430}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305061295.276819, "message": "I guess it's not made clear that murders happen all the time -- especially of Germans! \n\nI can make the argument that the decision of Laszlo to come to Casablanca is the real driver. It's why Ugarte goes out and gets the letters from the Germans. This seems less than forced, BUT they are the only two letters of transit that De Gaulle has signed, so you could argue that it actually is forced.", "group_id": 2515, "id": 995966}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305064320.2317591, "message": "I understood the usual suspects comment as a farce that Renault does every so often, after any and all crimes. Could be inferring the wrong thing.", "group_id": 2515, "id": 996548}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305064126.958343, "message": "As far as question 3 I have no idea. I would guess it is the same, but it would be only a guess.", "group_id": 2515, "id": 996540}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305064103.1985631, "message": "My mistake, for some reason I always thought the murders of the German couriers happened in Casablanca, but checking it out again I see happened on the train from Oran to Casablanca. Still, I don't think Laszlo's decision to come to Casablanca forced Ugarte to kill the German couriers. I don't see how that is set up within the story. On the other hand, Renault's off-handed remark that he is rounding up the usual suspects tends to suggest that this sort of thing happens more often than not, that it is the usual state of things. Now, deciding to give them to a man of dubious alliances is not.", "group_id": 2515, "id": 996535}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305078840.367595, "message": "Another thing to consider is that Ugartes decision is the first time a decision is made in an effort to Control the situation. Not an act, but a decision of who to give the papers too.", "group_id": 2515, "id": 999552}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305131689.5759039, "message": "Jim, I'm going to take you to task the next time you mention \"meaning\", as in, \"it's incosequential to the meaning of the story.\"\n\nOh, and as for Drivers... I've previously believed that there can only be one inciting incident to a story, and I haven't yet seen a reason to change that. I think the initial driver has a trickle-over effect into the other storylines. Anyway, that's what I'm going to run with for now, but I'm open to anybody having other thoughts.", "group_id": 2515, "id": 1009858}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305134562.836725, "message": "By inconsequential to the meaning, I mean it is irrelevant to the storyform. The given with Dramatica is that a \"complete\" story is written with the purpose of arguing a particular approach to problem-solving. The storyform is a holistic model of what that argument means. If a particular storytelling event happens to have little to no impact on the actual storyform then it is inconsequential to the meaning of the story. Whether it is there or not, the story (storyform) will still mean the same thing.", "group_id": 2515, "id": 1010678}, {"user_id": 7645, "stars": [], "topic_id": 33995, "date_created": 1305134571.6776631, "message": "With Casablanca the storyform is arguing that when faced with the same set of problems, freedom will grant everyone success and you fulfillment. Likewise, with Star Wars the argument is being made that success and fulfillment can only be found when you trust in something without validation. With My Brilliant Career the argument being made is, yes, if you believe in yourself regardless of what proof you may have, you may find fulfillment...but you're gonna screw up everyone else's plans for you. These are far less elegant and easy-to-tear apart points-of-view when compared to the actual storyform, but that's just the point--that's why an Author would turn to a storyform--to argue their particular point-of-view completely.", "group_id": 2515, "id": 1010683}, {"user_id": 7664, "stars": [], "topic_id": 33995, "date_created": 1305135933.2677341, "message": "@jimhull  That's the first time I've ever seen anyone tie a storyform to a colloquial exploration of a story.", "group_id": 2515, "id": 1011026}, {"user_id": 13109, "stars": [], "topic_id": 33995, "date_created": 1306331895.280951, "message": "@MikeDerk \"StarvWars\" - Star Wars universe with Jabba the Hut on a diet? ;-)", "group_id": 2515, "id": 1178290}]