[{"user_id": 30352, "stars": [], "topic_id": 36533, "date_created": 1306211968.2587099, "message": "A woman called the poison control center, upset because her little daughter had eaten some ants. The person at poison control assured her that ants were not dangerous and that her little girl would be fine. The mother was relieved, then (fortunately) mentioned that she had given her daughter some ant poison to kill the ants. She was told to get to the emergency room as quickly as possible.\n\n", "group_id": 9873, "id": 1161697}, {"user_id": 30352, "stars": [], "topic_id": 36533, "date_created": 1306211988.540504, "message": "A nervous pair of robbers entered a record store to rob it. The first one shouted, \"Nobody move!\" When his partner moved, the startled robber shot him.\n\n", "group_id": 9873, "id": 1161700}, {"user_id": 30352, "stars": [], "topic_id": 36533, "date_created": 1306212027.4414871, "message": "A driver was speeding and was unknowingly caught in a speed trap that measured his speed with radar and photographed his car. In the mail, he later received a ticket for $100, along with a photograph of his car. He sent the ticket back with a photograph of a $100 bill. He then received a letter from the police department with a photograph of hand cuffs. He paid the ticket.\n\n", "group_id": 9873, "id": 1161704}, {"user_id": 30352, "stars": [], "topic_id": 36533, "date_created": 1306212057.3223369, "message": "A man decided to steal some beer from a liquor store. He got a cinder block, went to the store, lifted the cinder block over his head and threw it at the window. The cinder block bounced back at him, hit him in the head and knocked him unconscious. The window was made of Plexiglas. The whole thing was caught on video tape.\n\n", "group_id": 9873, "id": 1161706}, {"user_id": 30352, "stars": [], "topic_id": 36533, "date_created": 1306212158.3259301, "message": "Georgia: Investigating a purse snatching, detectives picked up  a man who fit the thief's description and drove him back to the scene. He  was told to exit the car and face the victim for an I.D. The suspect carefully eyed the victim, and blurted, \"Yeah, that's the woman I robbed.\"\n\n", "group_id": 9873, "id": 1161710}]