[{"user_id": 22507, "stars": [], "topic_id": 40657, "date_created": 1309293799.5964301, "message": "Since this is a PS3 exclusive, I may very well be talking to myself about this one.  However, I'm excited and currently downloading this Beta.  I'll give updates, and impressions.  There are a few other games I'm playing through, so I might not get a lot of UC3 in.  BUT.  if you are jumping in on this beta, too... let me know", "group_id": 6442, "id": 1510714}, {"user_id": 23428, "stars": [], "topic_id": 40657, "date_created": 1309300508.405643, "message": "Nah not alone, I'm excited too, although I've only ever played Uncharted for the single player game story.", "group_id": 6442, "id": 1512354}, {"user_id": 22507, "stars": [], "topic_id": 40657, "date_created": 1309368836.296459, "message": "I'm not a big fan of the third person view for multiplayer shooters, so I'd always skipped the multiplayer aspect of these games too.  However, at E3 I played a shitload of this.  With all of the Sony exclusives I was lucky enough to have a lot of one-on-one time playing with devs.  This was one of my favorites, and we did a lot of mission co-op.  So I'm giving multiplayer a shot in beta.\n\nI played a few rounds yesterday and had a good time.  bullet damage seems to be unbalanced still from gun to gun, and the hitbox for headshots seems to be off (but that might be player-skill related).  Movement is good, and feels very \"Uncharted\".  The maps are \"ok\" but I'd need more time with them to know for sure.\n\nThere were also some connection errors, but NaughtyDog addressed them and they seem to have ironed out.", "group_id": 6442, "id": 1518847}, {"user_id": 23428, "stars": [], "topic_id": 40657, "date_created": 1309394688.2311361, "message": "So do you think that they are really trying to push the game as a multiplayer game in addition to the story?  Wondering how it will stack up to things like Battlefield 3.", "group_id": 6442, "id": 1523727}, {"user_id": 22507, "stars": [], "topic_id": 40657, "date_created": 1309468774.3909149, "message": "no, it's an add on as it was in part 2, also.  it has a strange following, but the gem will be the single player, by far.  they are pushing the co-op missions though, and they are pretty fun.  but it will get stomped by other multiplayer shooters.  Honestly, I'll play the single player.. then do some co-op stuff.. then maybe some multiplayer for a couple weeks.  then back to my normal cycle.", "group_id": 6442, "id": 1533516}, {"user_id": 37377, "stars": [], "topic_id": 40657, "date_created": 1309543721.1052649, "message": "you guys are playing this? i might have to check it out i love the sp of uncharted", "group_id": 6442, "id": 1543787}, {"user_id": 23428, "stars": [], "topic_id": 40657, "date_created": 1309548649.695045, "message": "I'm going to give it a shot.", "group_id": 6442, "id": 1544559}]