[{"user_id": 19655, "stars": [], "topic_id": 41298, "date_created": 1309972359.2801731, "message": "Like https://github.com/benliles/chishop", "group_id": 292, "id": 1577238}, {"user_id": 4893, "stars": [{"date_created": 1310025587.1509171, "user_id": 26925}], "topic_id": 41298, "date_created": 1309980693.904844, "message": "Most people use pip + virtualenv but combining that with buildout and djangorecipe is definitely not the worst approach you could take. Personally I prefer the simply approach without buildout but if you have dependencies outside of Python or simply use-cases where buildout makes your life easier, go with it :-)", "group_id": 292, "id": 1578737}, {"user_id": 25337, "stars": [], "topic_id": 41298, "date_created": 1310024562.0987151, "message": "You can use buildout, and I do for the 10% of projects that need it. Start with pip+virtualenv to start with though. Converting a requirements file to a buildout.cfg is very easy (you could probably automate it, actually). Going the other way can be a bit harder.", "group_id": 292, "id": 1582833}, {"user_id": 19519, "stars": [{"date_created": 1311734112.7532051, "user_id": 960}], "topic_id": 41298, "date_created": 1310654519.516067, "message": "Using Zope technology is considered bad practice in general.", "group_id": 292, "id": 1637381}, {"user_id": 32911, "stars": [], "topic_id": 41298, "date_created": 1310738060.8177321, "message": "I've found pip + virtualenv to be enough.  Buildout has a rich set of features... most of which we never needed to use.", "group_id": 292, "id": 1645281}, {"user_id": 12404, "stars": [{"date_created": 1310933922.0852461, "user_id": 18985}], "topic_id": 41298, "date_created": 1310742884.513272, "message": "@pandres_ according to who? hipsters with blogs? buildout is very useful actually, if only for the ability to clone a repo and type 2 commands to be fully functional.", "group_id": 292, "id": 1645997}, {"user_id": 1398, "stars": [{"date_created": 1311020019.7057199, "user_id": 8391}, {"date_created": 1311734130.0561221, "user_id": 960}], "topic_id": 41298, "date_created": 1310801231.6253271, "message": "The problem with zc.buildout is that most Django projects and efforts don't use it. So you'll be doing your configuration and setup different than most groups. Which will make hiring and maintenance that much harder.", "group_id": 292, "id": 1650846}, {"user_id": 35276, "stars": [{"date_created": 1311337694.244946, "user_id": 12404}], "topic_id": 41298, "date_created": 1310997850.6232409, "message": "pip+virtualenv is the popular choice, but buildout *is* used. Buildout automates more than virtualenv+pip, which can be just what you needs. Less manual work. No more environment variable setting to point at the correct settings.py file, for instance, if you use dangorecipe. And you can create apache config files according to templates, etc. So you get a lot for free :-)", "group_id": 292, "id": 1662696}, {"user_id": 11592, "stars": [], "topic_id": 41298, "date_created": 1311058139.2677701, "message": "I'm mostly happy with pip + virtualenv + rather simple buildenv.sh which does all «manual» work for me.", "group_id": 292, "id": 1669552}, {"user_id": 927, "stars": [{"date_created": 1311135964.867377, "user_id": 1736}, {"date_created": 1312037495.2432339, "user_id": 26925}], "topic_id": 41298, "date_created": 1311078934.5738239, "message": "The main thing with buildout is to remember that you *only* use it for Python stuff: pretend cmmi, etc, do not exist. It's technically possible to use it to compile Apache or Postgres, manage your server, etc. but it's better to learn your operating system's customary tools for package management and system administration, both because you won't end up with so many [mostly-square] reinvented wheels and because any sysadmin you hire can be immediately productive.", "group_id": 292, "id": 1670603}, {"user_id": 927, "stars": [{"date_created": 1311135971.250891, "user_id": 1736}, {"date_created": 1311144487.3685601, "user_id": 11592}, {"date_created": 1311174917.6085329, "user_id": 31790}, {"date_created": 1311734184.6675429, "user_id": 960}, {"date_created": 1312037491.825207, "user_id": 26925}], "topic_id": 41298, "date_created": 1311079086.7821479, "message": "An important point which the buildout non-Python camp doesn't take seriously enough: if you don't use e.g. the vendor's Apache / MySQL / etc. you have to repeatedly take the time and expense of building, testing and installing every point update yourself, on someone else's schedule for security updates. You don't want to take on that responsibility lightly.", "group_id": 292, "id": 1670617}, {"user_id": 4383, "stars": [], "topic_id": 41298, "date_created": 1311120114.560755, "message": "As @acdha said, using buildout to manage anything other than the runtime environment (meaning python and app dependencies) of your project is really dumb. Generally you only want to use it for things that pip + virtualenv do so it's just easier to use pip + virtualenv.", "group_id": 292, "id": 1676697}, {"user_id": 1398, "stars": [], "topic_id": 41298, "date_created": 1311142686.414288, "message": "+1 @acdha", "group_id": 292, "id": 1679044}, {"user_id": 35276, "stars": [], "topic_id": 41298, "date_created": 1311155190.097012, "message": "I don't use it for the cmmi stuff. But, like I said, I also don't use it for \"just\" what pip and virtualenv does.", "group_id": 292, "id": 1679601}, {"user_id": 35276, "stars": [], "topic_id": 41298, "date_created": 1311155349.602926, "message": "What I mean: I also use it for the various recipes that are out there for creating apache config files from templates and for easily setting up your django environment and for easily setting up other python tools. IF you only use buildout for its pip+virtualenv part: by all means use pip+virtualenv. IF you investigate buildout more, you can get even more manual work off your plate.", "group_id": 292, "id": 1679607}, {"user_id": 26888, "stars": [], "topic_id": 41298, "date_created": 1311156470.7647381, "message": "For the initial poster, give both virtualenv/pip or buildout a go and use the one that fits for you. Pip is easier to use, newer and have been drawing more attention those day while buildout needs more planning ahead but does more. They answer somewhat different needs.", "group_id": 292, "id": 1679655}, {"user_id": 32144, "stars": [], "topic_id": 41298, "date_created": 1311190327.7016129, "message": "I implemented buildout for a new project several months ago, and though there's a bit of an upfront cost in figuring everything out and setting it up, it has payed for itself a few times over already. Contrary to @acdha's point, I'm actually using it to resolve several cmmi dependencies, and it has worked out wonderfully. Point it case: deploying to a virgin server is as simple as deploying with fabric and running buildout, and setting up a development environment is as simple as pulling from git and running buildout (and that's for Linux *and* OSX). Use your own discretion, though, I think @acdha is still right, in most cases resolving binary dependencies with cmmi and buildout is probably more pain than it's worth.", "group_id": 292, "id": 1684132}, {"user_id": 12404, "stars": [], "topic_id": 41298, "date_created": 1311340373.6776819, "message": "for those who think all you need is pip + virtualenv, try appengine. I'd be curious to see how that works out for you.", "group_id": 292, "id": 1697886}]