[{"user_id": 13194, "stars": [], "topic_id": 21480, "date_created": 1303847691.0138781, "message": "What's the best way for a non-programmer to enlist the assistance of a programmer to get a project rolling?", "group_id": 250, "id": 818233}, {"user_id": 26065, "stars": [], "topic_id": 21480, "date_created": 1303848124.7862511, "message": "regular payments ;-)", "group_id": 250, "id": 818286}, {"user_id": 7259, "stars": [{"date_created": 1303874663.3765781, "user_id": 10694}], "topic_id": 21480, "date_created": 1303848410.1361279, "message": "Find one (a programmer), that you think you can work with. Take them to lunch. Pitch your project.  Offer them equity/ownership (it's very likely you'll require their expertise over the long haul). This is how I got Printpop off the ground 8 years ago. And my \"co-founder\" is our CIO to this day.", "group_id": 250, "id": 818321}, {"user_id": 29253, "stars": [{"date_created": 1303874614.172673, "user_id": 10694}, {"date_created": 1306090782.7058599, "user_id": 30186}], "topic_id": 21480, "date_created": 1303849403.6892271, "message": "Choosing the co-founder is just like choose this partner as your wife, because you will married with them (no offcourse not that) sweet and bleeding with them, so hang over with them and foreseeing the vision together, you would see it along the way. most competent co-founder can bring 2 way conversation if you know what i mean", "group_id": 250, "id": 818450}, {"user_id": 4149, "stars": [], "topic_id": 21480, "date_created": 1303848195.844207, "message": "Trolling forums, finding friends, look on github for someone doing something similar, look at builditwith.me but the community is kinda dead but worth a try, even look at groups on here", "group_id": 250, "id": 818293}, {"user_id": 7259, "stars": [], "topic_id": 21480, "date_created": 1303848746.8266439, "message": "Remember without them, your dream would not come to fruition and your vision provides them the opportunity to be an owner of something that (hopefully) they believe in as much as you do.", "group_id": 250, "id": 818361}, {"user_id": 26065, "stars": [], "topic_id": 21480, "date_created": 1303848882.1176281, "message": "@printpopceo I don't think this will work these days. There are too many people with a vision out there (startups are cool...) and on the other hand there is way more knowledge and capital available for developers than it was 8 years ago, where most of us were still licking our wounds. Funded startups have huge troubles finding the right developers, how far can you get with just an idea and probably no renumeration?", "group_id": 250, "id": 818375}, {"user_id": 7259, "stars": [{"date_created": 1303874603.5754409, "user_id": 10694}, {"date_created": 1304155821.9937689, "user_id": 12551}, {"date_created": 1304480231.8233061, "user_id": 30901}, {"date_created": 1304516158.6736469, "user_id": 32166}, {"date_created": 1305364199.2738941, "user_id": 2376}], "topic_id": 21480, "date_created": 1303849300.8368671, "message": "Being a (successful) serial Entrepreneur, I suggest that what I recommended works today as it did 8 years ago, as it did 80 years ago...start a relationship.  That's what a \"co-founder\" is, a Partner.  If you've got the cash to throw at hiring someone, then great.  The problem is that most start-ups (and I listen to pitches weekly), don't have the capitol to simply hire someone, besides if that's what you do, then you don't really have a co-founder, you have a contract employee...the original poster was looking for a \"Co-founder\".", "group_id": 250, "id": 818440}, {"user_id": 26065, "stars": [], "topic_id": 21480, "date_created": 1303849724.1731269, "message": "\"enlisting the assistance of a programmer\" does not sound like looking for co-founder, more like looking for somebody to make his dream come true. Maybe I have heard that story too many times in my life. And yes, having a co-founder is actually much tougher than marriage. Done that a couple of times, and either it gels or it does not.", "group_id": 250, "id": 818512}, {"user_id": 7259, "stars": [], "topic_id": 21480, "date_created": 1303849489.5348139, "message": "@fauzi Couldn't agree more. Look for someone complimentary.", "group_id": 250, "id": 818469}, {"user_id": 26065, "stars": [], "topic_id": 21480, "date_created": 1303852389.4723909, "message": "yeah, sorry, just read the title, missed that one.", "group_id": 250, "id": 818934}, {"user_id": 13194, "stars": [], "topic_id": 21480, "date_created": 1303852265.0173011, "message": "To clarify, I am indeed looking for a co-founder that I gel with, not a contract employee but someone to share in the vision of the business. (Uh… this is starting to sound like a personals ad.) Great feedback so far.", "group_id": 250, "id": 818915}, {"user_id": 26065, "stars": [{"date_created": 1303874584.098078, "user_id": 10694}, {"date_created": 1303891600.143769, "user_id": 15929}, {"date_created": 1304516267.7534201, "user_id": 32166}, {"date_created": 1309465505.3366499, "user_id": 13194}], "topic_id": 21480, "date_created": 1303853699.333041, "message": "Assuming that you are not planning to create an ubertechnical product but more a business process driven one you should do fine with a better than average ruby or python developer. I would hang out in local user groups, go to hackers and founders meetings. Be prepared. You should treat this like you would a vc meeting, e.g. know your business model, your market and your competition, have already set up a landing page with email sign up and social engagement (no programming required for this). Basically, create an MVP and validate your idea even before you approach a developer. If you can do that you are above 99% of everyone else and you will be welcomed. Have a roadmap prepared and clearly define the next steps in terms of MVPs, e.g what is the first deliverable that you and your co-founder need to build. That's often something that can be done in 2 or 3 weeks, so the risk is manageable.  Also, think about this as a partnership (there are tons of quora posts on the subject), don't be greedy, and be honest with yourself and your potential co-founder about what you bring onto the table. Also fire fast. If something does not smell right, you got a bad feeling then go separate ways. Be upfront about expectations. It is really important that your goals are aligned. If you want a vc funded company and your partner wants a lifestyle business then it is not going to work. Make sure that you are on somewhat the same page in terms of where you are in your life (marriage, kids, financial). And don't forget vesting. There are few things more painful than having to carry dead weight along because you did not vest from the beginning.", "group_id": 250, "id": 819167}, {"user_id": 30931, "stars": [], "topic_id": 21480, "date_created": 1303890240.556103, "message": "PS. Can someone give me a list of good forums. I'm in Australia. I don't ride kangaroos btw.", "group_id": 250, "id": 823106}, {"user_id": 30931, "stars": [], "topic_id": 21480, "date_created": 1303890185.642674, "message": "If they're not as passionate about the idea as YOU are then don't go into business with them. I made this mistake. They treat it like a job, and won't put in the hours.", "group_id": 250, "id": 823101}, {"user_id": 31301, "stars": [], "topic_id": 21480, "date_created": 1303892974.885211, "message": "@ryanthejenks If you are non-programmer who you are? I also don't think this will work these days.", "group_id": 250, "id": 823449}, {"user_id": 15929, "stars": [], "topic_id": 21480, "date_created": 1303892068.415952, "message": "@martin_sunset lengthy but I like. for me, the main focus to look at is the level of commitment. I'd like to differentiate commitment with passionate. the dev may not be married to the idea, s/he still can commit to the product and work as hard as you. I guessed this goes back to 'invest in the person, not the idea'", "group_id": 250, "id": 823350}, {"user_id": 15929, "stars": [], "topic_id": 21480, "date_created": 1303892351.4971499, "message": "@dimitrikotov the only tech forum I know that geographically focus on Australia is whirlpool.net.au -  I use the word 'tech' verrryy loosely", "group_id": 250, "id": 823366}, {"user_id": 3, "stars": [{"date_created": 1303937467.518682, "user_id": 719}, {"date_created": 1309465617.168859, "user_id": 13194}], "topic_id": 21480, "date_created": 1303924053.9688799, "message": "Start learning to program. There's nothing programmers love to do more than condescend about technical things.", "group_id": 250, "id": 828337}, {"user_id": 3, "stars": [{"date_created": 1303937467.5257699, "user_id": 719}, {"date_created": 1309465618.403327, "user_id": 13194}], "topic_id": 21480, "date_created": 1303924089.0738981, "message": "Once they smell a beginner they'll want to hang around you and share their greatness", "group_id": 250, "id": 828340}, {"user_id": 719, "stars": [], "topic_id": 21480, "date_created": 1303937519.850786, "message": "Listen to @defunkt. He's very right in this case.", "group_id": 250, "id": 832399}, {"user_id": 31238, "stars": [{"date_created": 1305877897.7733541, "user_id": 24859}, {"date_created": 1306090918.423557, "user_id": 30186}], "topic_id": 21480, "date_created": 1303938100.250514, "message": "I am picking up programming for my startup. Reason is to show I care for what my other cofounders do and want to be able to understand what is going into the product. It will be a long learning process but at least I am showing I care :)", "group_id": 250, "id": 832561}, {"user_id": 29253, "stars": [], "topic_id": 21480, "date_created": 1303951925.0056281, "message": "@dbuizert hook me up, and tell us about your going product are. might me and my team related and being considered to collaborate.", "group_id": 250, "id": 834641}, {"user_id": 22183, "stars": [], "topic_id": 21480, "date_created": 1303978289.9855721, "message": "local meetup, techcofounder and similar, even through linkedin groups (particularly those for startups and networking)", "group_id": 250, "id": 838182}, {"user_id": 30602, "stars": [], "topic_id": 21480, "date_created": 1304543232.3435521, "message": "Here's my two cents.. don't find a cofounder that you've never worked with before, and haven't been in the trenches with to see how you guys gel.", "group_id": 250, "id": 919840}, {"user_id": 25852, "stars": [{"date_created": 1309465670.6610601, "user_id": 13194}], "topic_id": 21480, "date_created": 1305273050.665808, "message": "@ryanthejenks, if you can't find a co-founder, maybe you can at least laugh a little with our video: http://www.panabee.com/name-domain-name/videos/mgng08DiPm8. We mockingly compare finding a co-founder to finding a soulmate. Hope you like it.", "group_id": 250, "id": 1037867}, {"user_id": 32436, "stars": [{"date_created": 1305913438.36203, "user_id": 26065}], "topic_id": 21480, "date_created": 1305912998.0296891, "message": "A partnership is a marriage, and the goals are different. Instead of kids, a house, and a happy life, you're making critical decisions about company strategy, hr, investments, expenses, office space, etc etc. You don't marry someone without dating them first. In my opinion, do it the hard way. Bring them on with monetary compensation, an agreement to earn equity over time, and a solid vision. That's the best, and most reliable way to bring on a partner... Especially if you don't know them well.", "group_id": 250, "id": 1128181}]