[{"user_id": 11626, "stars": [], "topic_id": 6615, "date_created": 1297896978.5638869, "message": "Smartphones are the new El Dorado for computer criminals and many owners are unaware of the risk or what to do about it, security experts warn.\r\n\r\nAs sales of smartphones and tablets have started to outpace those of personal computers, criminals are increasingly targeting the devices, security companies say.\r\n\r\nIt is a menace for both consumers and businesses because many people use their smartphones or tablets to access corporate networks without authorisation.\r\n\r\n\"This is something which is self-evident in the world of PCs,\" Intel president and chief executive Paul Otellini said at the mobile industry's annual congress in Barcelona.\r\n\r\n\"We all do something to protect our computers and personal information from hackers,\" he said. \"In mobile computing we need this as well.\"\r\n\r\nMobile devices increasingly hold personal and financial information, he warned. \"I believe, I contend that security is one of the most important features,\" the Intel boss said.\r\n\r\nA study for major anti-virus software maker AVG found that six percent of US smartphone owners' devices had been infected with malware that was surreptitiously sending out their credit card details.\r\n\r\n\"The things that people need to be protected from on PCs they now need to be protected from when using their smartphones,\" said Stephen Simpson, consumer products chief at AVG.\r\n\r\n\"The threat is not perceived,\" Simpson said. \"There is a perception that smartphones are more secure than they really are.\"\r\n\r\nThere are already some 1,000 different pieces of malware circulating that target smartphones, according to Kaspersky Lab, a leading computer security firm.\r\n\r\nOne of the most prevalent is malware which has the phone make surreptitious calls or send text messages to premium numbers, landing the criminals fat fees and phone owners with fat bills.\r\n\r\nSmartphones are an attractive target for criminals as \"there is a lot of money involved, it is an easy job and it is low risk,\" said the firm's founder, Eugene Kaspersky,\r\n\r\nA study in four European countries conducted for Kaspersky Lab found that only 12 percent of smartphone owners had installed security software on their phones.\r\n\r\nThis is despite about one-third of people storing valuable data such as access codes and passwords on their phones and one-third using them for online banking.\r\n\r\nWhen Kaspersky first attended the Mobile World Congress five years ago most companies could not understand why he came, although this has since started to change, he said.\r\n\r\nKaspersky said people needed to be educated: \"Don't trust everyone, keep your brain on\" while using smartphone applications.\r\n\r\nSmartphone owners will begin using anti-virus software as they become victims or someone they know does, he said, and \"in a few years 90 percent of people will have anti-malware or mobile security software installed,\" the same level as for PCs.\r\n\r\nKaspersky Lab announced at the Mobile World Congress a new version of its software that supports BlackBerry telephones and smartphones running on the Google-backed Android operating system.\r\n\r\nAVG recently released an app to protect Android phones, which, like its flagship PC product, is free.\r\n\r\nBoth programmes have features that help users pinpoint lost phones and remotely lock and wipe their memory if necessary.\r\n\r\nAnother company, Open Kernel Labs, announced a security suite aimed at the business market.\r\n\r\n\"Mobile devices are the weak link in corporate networks,\" said the company's chief executive and founder, Steve Subar.\r\n\r\nEmployees have bought smartphones and tablets on their own and want to use them for work. These connections, if left unsecured, present risks to companies as infected phones could reveal network access codes as well as confidential documents.\r\n\r\nOpen Kernel's SecureIT Mobile Enterprise allows companies to secure employees' private smartphones -- which also saves the company the price of acquiring and issuing handsets.\r\n\r\nhttp://www.spacemart.com/reports/Smartphones_the_new_El_Dorado_for_computer_criminals_999point.html", "group_id": 3920, "id": 125944}, {"user_id": 11626, "stars": [], "topic_id": 6615, "date_created": 1297897124.3059261, "message": "Speaking of cyberwarfare... Think it was an accident that they made the \"smart\" phone stupid enough to give away your sensitive personal information? Oh, & now enter the need for biometric identification for everything, including Smartphones...", "group_id": 3920, "id": 125973}]