[{"user_id": 30390, "stars": [], "topic_id": 36048, "date_created": 1305849284.2431819, "message": "I'm trying to figure out some 1/2 or full day activities for my team..thinking about things like architecture/museum tour, go-karting, cooking classes. What have you done that you'd recommend?", "group_id": 250, "id": 1117989}, {"user_id": 16152, "stars": [], "topic_id": 36048, "date_created": 1305869901.1119249, "message": "How about trekking?", "group_id": 250, "id": 1120934}, {"user_id": 14142, "stars": [], "topic_id": 36048, "date_created": 1305875599.907902, "message": "Have you consulted your team??", "group_id": 250, "id": 1121775}, {"user_id": 9321, "stars": [], "topic_id": 36048, "date_created": 1305910020.857228, "message": "Some things my company has done over the years: Whirlyball (look it up), renting a box at a baseball or basketball game, dinner/evening at a place like Dave and Busters.", "group_id": 250, "id": 1127731}, {"user_id": 9321, "stars": [], "topic_id": 36048, "date_created": 1305909858.687341, "message": "@Kyanainsweden Agreed. Sample the team for things they are interested in. You will never get everyone to agree, so eventually you'll just have to pick something.", "group_id": 250, "id": 1127714}, {"user_id": 30390, "stars": [], "topic_id": 36048, "date_created": 1305956954.796536, "message": "@Kyanainsweden yes, they are all thinking of ideas too.", "group_id": 250, "id": 1132835}, {"user_id": 14894, "stars": [{"date_created": 1306173579.8387711, "user_id": 26065}, {"date_created": 1306203228.6418209, "user_id": 22200}], "topic_id": 36048, "date_created": 1306172636.6234641, "message": "It depends on the makeup of your team.  If your team is made up of people without kids, then I would encourage regular weekly outings to a happy hour you guys like or weekly basketball or softball game.  Games are great because the competition increases bonding.  If you guys aren't athletically inclined, you can have weekly pool or dart tournaments, blind draw partners are fun because it evens the playing field.  Put money on it that winners will usually use to buy people drinks.", "group_id": 250, "id": 1154924}, {"user_id": 14894, "stars": [], "topic_id": 36048, "date_created": 1306172925.8162971, "message": "If your team has married with kids folks, you'll need to schedule an outing that takes place during work hours.  Go somewhere where you can do something challenging as a team together or break off into smaller groups that you can compete as teams.  An example (not exactly because it was on a weekend) is the Camp Pendleton Mud Run, which has teams of 3 compete.  Another example is leave early on a friday and go bowling, but give people enough advance notice that they won't be working all that day so they can notify their commitments accordingly.", "group_id": 250, "id": 1154962}, {"user_id": 14894, "stars": [], "topic_id": 36048, "date_created": 1306172976.1843979, "message": "In the end you are looking to compress the shared experience and challenge of building your startup into a single day's event.", "group_id": 250, "id": 1154970}]