[{"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713577.220717, "message": "In addition to the usual review niceties (side-by-side diffs, inline comments), it can also allow/disallow merges to a remote master depending on the changeset's vote (from other reviewers).", "group_id": 9753, "id": 1454623}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713708.8669341, "message": "I've only scratched the surface but so far I like it, plus it plays nicely with Jenkins (via a plugin). My only gripe is that it is a major pain to set up and something as simple as deleting a project hasn't been implemented (!!). Gory details here: http://code.google.com/p/gerrit/issues/detail?id=349", "group_id": 9753, "id": 1454630}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713132.3914671, "message": "What are your favorite code review and continuous integration tools? And what is your preferred workflow with these tools?", "group_id": 9753, "id": 1454590}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713360.3894, "message": "Until very recently, I had mixed feelings about code review tools. I used to use Rietveld (http://code.google.com/p/rietveld/) but got tired of it's manual patch uploads. Plus it runs on Google AppEngine and can't be locally hosted (I had a private repo on a Google Apps domain).", "group_id": 9753, "id": 1454611}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713207.4664781, "message": "Jenkins is my fav CI tool for all my projects, I'm yet to find one that is so powerful and easy to set up. I always run it straight from the .war file (java -jar jenkins.war)", "group_id": 9753, "id": 1454594}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1308713446.7857881, "message": "My fav code review tool now is Gerrit (http://code.google.com/p/gerrit/). It's for git projects and the integration is awesome. Submitting changes is basically a 'git push remote_gerrit_host'", "group_id": 9753, "id": 1454613}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1308746608.2204039, "message": "never tried a code review tool. usually pen and paper for me (yikes).  I've used \"integrity\" for my CI stuff and liked it!", "group_id": 9753, "id": 1456632}, {"user_id": 32810, "stars": [], "topic_id": 40072, "date_created": 1308750975.8860841, "message": "as @jevy I haven't tried much of a code review tool yet. I mean, we're always coding new features and have very little time to review code and all. I wish we would. I sometimes feel my coding skills would go through the roof if somebody could tell me what I do wrong.", "group_id": 9753, "id": 1457108}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1308830552.661906, "message": "if there was a simple piece of software that would like me look up commits and make comments (like github) that would help. problem is I'm usually the only ruby guy on the team.", "group_id": 9753, "id": 1465353}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1308853577.56723, "message": "we do some code review using github, but it is quite informal --- if we had a slightly larger team or a more varied mix of developer abilities, I think we would opt for one of the more regimented tool flows", "group_id": 9753, "id": 1469078}, {"user_id": 32938, "stars": [], "topic_id": 40072, "date_created": 1308922009.291559, "message": "We use Crucible for code reviews and it is simply awesome. I was a beta tester of the tool years before they were acquired to by Atlassian. We recently ended up switching to the Atlassian bug tracker and agile project management tools, as well. Still using Hudson for CI. They are commercial tools, but the startup versions are only ten bucks each. ", "group_id": 9753, "id": 1476278}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1309054179.0900359, "message": "@jkealey Liked the atlassian stuff when I was in gov.", "group_id": 9753, "id": 1486790}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1309054231.0199809, "message": "@rvanmelle do you guys host everything on github then?", "group_id": 9753, "id": 1486793}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1309195417.299228, "message": "@jevy we used to run a private git server on a linode slice (gitosis), but now we pretty much put everything on github --- if they don't change their pricing model, we may have to reconsider --- I expect we'll need to call for a custom quote within the next 12 months; which is ridiculous for a tiny services company", "group_id": 9753, "id": 1497412}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1309294950.4936409, "message": "we have around 30 repots, but that was only accomplished by archiving several of the old ones --- I think if we put all of our other bitbucket repots on github and migrated some additional gitosis repots, we would be close to 50", "group_id": 9753, "id": 1511149}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309294486.732636, "message": "@jkealey what's your group's preferred workflow for review/testing etc? I find my workflow changing from project to project: sometimes I prefer review before commiting to the repo, sometimes before commiting. I've never quite settled into \"the one way\", if there is one.", "group_id": 9753, "id": 1510951}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309295311.1203971, "message": "Agreed that github should have a \"suspend/archive\" feature that disables write access to that repo.", "group_id": 9753, "id": 1511246}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1309295098.94491, "message": "and this if for a very small team operating for a couple years --- which is why I think the github pricing model is ridiculous for companies like ours; it should be based on number of active repots int he last 30 days or something --- that scales with the number of users in the company and amount of load/activity on github; we're using a miniscule portion of our disk allowance", "group_id": 9753, "id": 1511194}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309295261.6692481, "message": "I always find that I have the opposite problem: too few repos but too many branches (mostly short-lived but some with a long lifetime)", "group_id": 9753, "id": 1511240}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309294346.8856411, "message": "@phi1rene I like that aspect of code review. Especially when someone points out how my spaghetti code could have been solved in a simpler and much more elegant way. I wish there was a culture of public/anonymous code review where one would post snippets of their code and a random jane/joe (with appropriate community cred) would review it, without having any formal connection to you.", "group_id": 9753, "id": 1510893}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309294879.7521901, "message": "@rvanmelle Is you team already past 20 repos (the largest non-custom plan on github)?", "group_id": 9753, "id": 1511115}, {"user_id": 32942, "stars": [], "topic_id": 40072, "date_created": 1309295191.662256, "message": "How do you organize your repos? 50 seems like a huge number for a small team.", "group_id": 9753, "id": 1511224}, {"user_id": 32938, "stars": [], "topic_id": 40072, "date_created": 1309349723.5503581, "message": "As for github's pricing, I also feel it's too much. We wanted to stay a free solution, but we couldn't pass on Atlassian's startup kit as our team is tiny. Once we reach 5-10 ppl, we'll either pay to upgrade (expensive) or switch to something else. I'm also thinking of trying out https://bitbucket.org/ - anyone have any experience with them?", "group_id": 9753, "id": 1516411}, {"user_id": 32938, "stars": [], "topic_id": 40072, "date_created": 1309349542.312865, "message": "@saidimu I don't think there's a unique way of doing this. We more formally code review everything our new employee does - he commits to a dev branch. We later merge it into the trunk. I informally check some commits made by our lead dev, also in the dev branch. Our weak point: no one double checks me.", "group_id": 9753, "id": 1516393}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1309433816.6638811, "message": "What's wrong with running at gitosis server on a linode/slicehost.  Easy peasy to maintain and free!", "group_id": 9753, "id": 1527157}, {"user_id": 32801, "stars": [], "topic_id": 40072, "date_created": 1309433929.3422201, "message": "Anyone tried gitorious?  Looks pretty sweet and it's FOSS!", "group_id": 9753, "id": 1527167}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1309439120.751364, "message": "@jkealey we went from svn to mercurial and loved it --- we only moved back to git because we were involved in the rails world at the time and the social pressure was overwhelming; bitbucket has unlimited free private repots, but it would be a lot of work to switch off github; + github is a bit more polished and featureful", "group_id": 9753, "id": 1527593}, {"user_id": 1316, "stars": [], "topic_id": 40072, "date_created": 1309439058.397048, "message": "@jevy gitosis was pretty easy; we used it a lot for a while, but there were occasional glitches, and we missed some of other github features like milestones, issues, wiki, etc.", "group_id": 9753, "id": 1527586}, {"user_id": 32938, "stars": [], "topic_id": 40072, "date_created": 1309526492.905112, "message": "@rvanmelle yeah; the .NET world seems to be pushing HG instead. We tried git hosted on our own Windows servers but had various performance issues - won't get into that now. The only \"major\" issue we've had to date with HG is the TortoiseHG GUI screwed us on a couple occasions.There's a checkbox 'discard other branch's changes' that you typically don't want to do when merging branches. The UI said it wasn't checked, but, in the background, it thought it was. Fast forward 5 weeks later and we start hitting bugs we've already fixed - because the merge didn't include the bug fixes.", "group_id": 9753, "id": 1540306}]