[{"user_id": 34431, "stars": [], "topic_id": 45327, "date_created": 1316044925.4478631, "message": "I'm putting together a CMS (with django-cms). Usually, if I had a model that had a relationship with another model (such as a 'project' object might have a relationship with multiple 'award' objects) I would use a manytomanyfield or somesuch.", "group_id": 81, "id": 2129906}, {"user_id": 34431, "stars": [], "topic_id": 45327, "date_created": 1316044988.7428131, "message": "It would be much easier to use generic relations and be able to create relationship between any kind of objects, and recall those relationships. Are there any apps out there that do this?", "group_id": 81, "id": 2129918}, {"user_id": 34431, "stars": [], "topic_id": 45327, "date_created": 1316045051.439115, "message": "I don't think creating an apps like this would be too much work, but if there was something out there that had an intuitive interface for creating those connections it would be great", "group_id": 81, "id": 2129931}, {"user_id": 13325, "stars": [], "topic_id": 45327, "date_created": 1316046627.932848, "message": "Pretty sure you can accomplish something like this with the ContentTypes framework. https://docs.djangoproject.com/en/dev/ref/contrib/contenttypes/", "group_id": 81, "id": 2130129}, {"user_id": 13326, "stars": [], "topic_id": 45327, "date_created": 1316047782.375159, "message": "django-generic-m2m may be what you're looking for: https://github.com/coleifer/django-generic-m2m", "group_id": 81, "id": 2130293}, {"user_id": 34431, "stars": [], "topic_id": 45327, "date_created": 1316071819.21099, "message": "django-generic-m2m looks great although it doesn't seem to easily integrate with the django admin as there is no modelfield and therefore you need to manually add the form fields to every form you are using in your admin", "group_id": 81, "id": 2132342}, {"user_id": 39409, "stars": [], "topic_id": 45327, "date_created": 1316586022.320204, "message": "Probably not what you are looking for, but there is the graph db neo4j which manages generic relationships. I know a python library exists for it: neo4py, but I have no clue if there is Django integration, much less admin integration.", "group_id": 81, "id": 2180181}, {"user_id": 34431, "stars": [], "topic_id": 45327, "date_created": 1316689245.4812939, "message": "I actually forked django-generic-m2m and added admin integration similar to the exapmle in the code. I haven't finished yet but when I do I'll link it here. It works quite nicely.", "group_id": 81, "id": 2188076}]