[{"user_id": 11626, "stars": [], "topic_id": 6706, "date_created": 1297909948.5344181, "message": "Police agencies around the USA soon could have a new tool in their crime-fighting arsenal: unmanned aircraft inspired by the success of such drones on the battlefields of Iraq and Afghanistan.\r\n\r\nLocal governments have been pressing the Federal Aviation Administration for wider use of unmanned aerial vehicles, or UAVs — a demand driven largely by returning veterans who observed the crafts' effectiveness in war, according to experts at New Mexico State University and Auburn University. Police could use the smaller planes to find lost children, hunt illegal marijuana crops and ease traffic jams in evacuations of cities before hurricanes or other natural disasters.\r\n\r\nThe FAA is expected this year to propose new rules for smaller unmanned aircraft, a process that will include input from the public, says FAA spokesman Les Dorr. The agency also is talking with the Justice Department and national law enforcement groups \"about possibly trying to streamline the process of applying for certificates of authorization\" to operate such planes, he says.\r\n\r\nMEXICAN BORDER: House approves more drones to guard border\r\nSECURITY: Naval laser test blasts drones from the sky\r\n\r\nDrones have flown in the USA for several years but have been limited to restricted airspace and to portions of the borders with Canada and Mexico.\r\n\r\nThe FAA authorized the Physical Science Laboratory at New Mexico State University to research the issues involved. \"We're extremely interested in being able to pave the way to integrate unmanned aircraft into the civil airspace,\" says Doug Davis, deputy director of the Technical Analysis and Applications Center at NMSU.\r\n\r\nDavis says UAVs range in size from 15 ounces to 34,000 pounds and a wing span bigger than a Boeing 737.\r\n\r\nOne of the chief obstacles to widespread use of UAVs is their inability to \"see and avoid\" other aircraft as required by federal regulations, a key to flight safety. Davis says he believes operators on the ground can comply with federal rules if they can see the aircraft and the surrounding environment. Wesley Randall, principal investigator on an FAA grant awarded last year to researchers at Auburn University to study the risks associated with unmanned aircraft, predicts drones will be used by police departments in five to 10 years. Randall predicts that much larger unmanned aircraft will be used to transport cargo within 15-20 years.\r\n\r\nNo local police departments have been authorized to use unmanned aircraft, although police departments in Houston and Miami have conducted field tests of such planes, Dorr says.\r\n\r\nThe Miami-Dade Police Department has tested two 18-pound UAVs equipped with a camera for about 18 months, Sgt. Andrew Cohen says. The department has been licensed to operate the craft up to 200 feet in the air, but the drone must remain within 1,000 feet of the operator.\r\n\r\nCohen says the department wants to use the craft to reduce risks to manned aircraft or personnel in circumstances involving a hostage situation or a barricaded suspect. \"It's an opportunity to increase safety for the officers,\" Cohen says.\r\n\r\nhttp://www.usatoday.com/tech/news/surveillance/2011-01-13-drones_N.htm", "group_id": 3920, "id": 128775}]