[{"user_id": 11626, "stars": [], "topic_id": 43068, "date_created": 1312161210.4643559, "message": "INCREDIBLE. \r\n\r\nTHEY ARE REALLY PUSHING THE \"EXTREMIST\" ANGLE ON THIS ONE. \r\n\r\nTHIS IS WHAT HAPPENS WHEN YOU CLICK THE \"LIKE\" BUTTON ON AN ANTI-TYRANNY ARTICLE. \r\n\r\n[url=http://www.wistv.com/story/15176906/extremist-group-shuts-down-phone-lines-at-sheriffs-office][b]Investigators: \"Extremist\" group shuts down phone lines at sheriff's office[/b][/url]\r\n[b]WISTV 10[/b][url=http://www.wistv.com/story/15176906/extremist-group-shuts-down-phone-lines-at-sheriffs-office][/url]\r\nJuly 29, 2011\r\n\r\nKERSHAW COUNTY, SC (WIS) - The phone lines at the Kershaw County Sheriff's Office were shut down Friday afternoon. That's because investigators said callers associated with an \"extremist\" group in the county are angry about one of their own being kicked out of the county GOP....\r\n\r\nThe calls came after the web site stuffedsuits.com published a statement from Mattox, calling for Sheriff Jim Matthews' resignation after the sheriff took offense at the cop shooting article. \"I don't want to give these guys anymore of a platform that they already have,\" said Sheriff Matthews. \"But I do think that people of Kershaw County need to know that there is an extremist group out there some place that are unhappy with me and some others in the county because we didn't like that site, that are kind of going to war with us on this\"....\r\n\r\nInvestigators have opened a case into the calls and think the callers placed them using Internet phone-jamming software. \"These people are using technology to harass us, and we'll use technology at our disposal to find out why they are,\" said Sheriff Matthews. \"And when we do, we will prosecute them to the fullest extent of the law\".... The sheriff has asked SLED to assist his investigators in tracing these calls and serving subpoenas in this investigation.\r\n\r\nhttp://www.wistv.com/story/15176906/extremist-group-shuts-down-phone-lines-at-sheriffs-office", "group_id": 3920, "id": 1762109}]