[{"user_id": 6327, "stars": [], "topic_id": 14389, "date_created": 1300770932.7368369, "message": "Vi que presentaron el Google Nexus S para Sprint, lo que tal vez facilitaría su uso en Mx ya en Telcel o Iusacell. Y la verdá que se me antojó #jarcor hehe. Ustedes quieren iOs? Android? O, no sé, el señor no lo quiera, WP7? =P", "group_id": 965, "id": 404994}, {"user_id": 6327, "stars": [], "topic_id": 14389, "date_created": 1300771972.1288359, "message": "Jaja, yo tengo un Nokia viejo también, que tenía un iPhone hace unos años y como me lo robaron pues ya nunca quise otro cel caro. Pero ahora se me antoja un fockin Androide mal. Y @axel, las terminales no son tan caras para modelos de hace un año, como el Droid 1 o el HTC Desire.", "group_id": 965, "id": 405065}, {"user_id": 6541, "stars": [], "topic_id": 14389, "date_created": 1300771108.9104609, "message": "ja! tengo un alcatel de $90 funciona muy bien como telefono, para tener conectividad en internet uso la maquina. No me agrada la idea de gastar X cantidad al mes por tener internet en el telefono.", "group_id": 965, "id": 405004}, {"user_id": 2984, "stars": [], "topic_id": 14389, "date_created": 1300771828.799247, "message": "WP7 es buenísimo. Yo uso blackberry, pero renuncié a estar pagando por un servicio de datos que sinceramente es más vanidad que otra cosa. Usaría con mucho gusto WP7, iOS o Android, si los precios de las terminales no fueran estupidamente elevados.", "group_id": 965, "id": 405048}, {"user_id": 13316, "stars": [], "topic_id": 14389, "date_created": 1300774295.7722089, "message": "por cierto, yo si tengo plan de datos, y no es vanidad, ya que en mi casa no hay telefono ni internet :-p así que es mi única conexión con el mundo jojojo.", "group_id": 965, "id": 405124}, {"user_id": 13316, "stars": [], "topic_id": 14389, "date_created": 1300774276.7539639, "message": "pues, yo tengo un android y no sé aún si lo que esta mal con mi equipo, es el sistema operativo o el teléfono. Mi teléfono  venía con un android 1.5 (viejisimo)  y motorola jamás lo actualizo a 2.1 como lo prometio así que lo hice yo. Aún así, el telefono es lento, propenso a trabarse,  ni siquiera puedo jugar angry birds en él, la pila le dura una broma.  Así que por ahora estoy encontra de android y de los telefonos motorola en general. :-p", "group_id": 965, "id": 405122}, {"user_id": 20521, "stars": [], "topic_id": 14389, "date_created": 1300801620.568548, "message": "Tengo una palm pre con esos planes ya no existentes de iusa baratos con internet ilimitado :P y quiero la nueva palm(la de hp) cuando salga y mas que  vanidad me ha sacado de apuros el internet en el teléfono cuando ando afuera y necesito conectarme con la lap.", "group_id": 965, "id": 407187}, {"user_id": 22727, "stars": [], "topic_id": 14389, "date_created": 1300806755.392468, "message": "A mí tampoco me gustan las cosas cariño$a$; pero me gustaría tener el Huawei Ideos - http://www.poderpda.com/noticias/huawei-opcion-economica-en-android/ - es económico y ya está disponible en iusacell pero en planes gsm, lo intenté conseguir en su versión para cdma pero no he tenido éxito, creo que tendré que quedarme con el blackberry hasta que termine mi contrato.", "group_id": 965, "id": 408037}, {"user_id": 6327, "stars": [], "topic_id": 14389, "date_created": 1300815986.3857009, "message": "Ese Huawei Ideos es una buena opción de Android, por 300 pesos mensuales en Iusa. Y el OS de Palm se ve de #webos =D Pero quién sabe para cuándo saldrá en MX", "group_id": 965, "id": 409452}, {"user_id": 3107, "stars": [], "topic_id": 14389, "date_created": 1300817975.328696, "message": "Yo tengo un BB Storm2 con iusacell con plan, el plan de datos está muy bueno. La velocidad de navegacion es descente, obviamente no le llega al iPhone pero creo que será mi proximo equipo al final del año.", "group_id": 965, "id": 409858}, {"user_id": 20521, "stars": [], "topic_id": 14389, "date_created": 1300823784.110137, "message": "La primera palm pre le vendia iusacell yo la compre gabacha y pues si sabe hasta cuando sale la siguiente aun que igual la consigo gabacha.", "group_id": 965, "id": 411104}]