[{"user_id": 30016, "stars": [], "topic_id": 20029, "date_created": 1303092977.360575, "message": "I got the black one", "group_id": 1295, "id": 720731}, {"user_id": 28021, "stars": [], "topic_id": 20029, "date_created": 1303119231.0140221, "message": "i do. it's far better than iPad 1 - but i still hope for full telephony functionality. why? then i would take it instead of my iPhone. why that? iPhone and iPad together are a bit weird: two tablet computers. and with my eyesight i desperately look forward for a bigger screen. there are nice bags for the iphone, so i'd carry it around all day long. holding it to my ear? you must be joking, i never hold any phone to my ear. what do i have earbuds for?", "group_id": 1295, "id": 724422}, {"user_id": 30016, "stars": [], "topic_id": 20029, "date_created": 1303157037.097487, "message": "Cool thanks", "group_id": 1295, "id": 730157}, {"user_id": 18485, "stars": [], "topic_id": 20029, "date_created": 1303180097.3389471, "message": "@zbindenap I would also need a better camera to ditch my iPhone 4. If the next iPad is 4g with a phone and a camera at least as good as the iPhone 4 I would be totally down for that and sell my iPhone.", "group_id": 1295, "id": 734946}, {"user_id": 2293, "stars": [], "topic_id": 20029, "date_created": 1303267494.0831001, "message": "@zbindenap Maybe the TouchPad will serve you well then. It apparently pairs with the Pre 3 and Veer and allows you to accept/make calls directly from the tablet and even receive/write SMS.", "group_id": 1295, "id": 750514}, {"user_id": 4149, "stars": [], "topic_id": 20029, "date_created": 1303529103.187145, "message": "@Mustapha they probably won't but if you do buy the ipad from verzion you get a mifi for a low price or free i forgot i rather get that then just the ipad with built in", "group_id": 1295, "id": 787065}, {"user_id": 30684, "stars": [], "topic_id": 20029, "date_created": 1303528941.5049901, "message": "@craigshipp I don't think apple has any plans to develop a GSM enabled iPad. But it would most certainly be welcome.", "group_id": 1295, "id": 787058}]