[{"user_id": 30352, "stars": [], "topic_id": 36535, "date_created": 1306212708.7150021, "message": "• \"How much do Windows cost, and do you have to buy each one separately?\" \n\n• Customer: \"How much do Windows cost?\" \nTech Support: \"Windows costs about $100.\" \nCustomer: \"Oh, that's kind of expensive. Can I buy just one window?\"\n\n• Tech Support: \"Do you have any windows open right now?\" \nCustomer: \"Are you crazy woman, it's twenty below outside...\" \n\n• \"I try to avoid using Microsoft. That's why I use MS-DOS.\"\n\n• Tech Support: \"How can I help you?\" \nCustomer: \"Well, everything is working fine, but there is one program that is not.\" \nTech Support: \"What program is it?\" \nCustomer: \"It's called 'MSDOS Prompt'.\" \nTech Support: \"What's wrong with it?\" \nCustomer: \"Well, I click on it, a black screen shows up with NOTHING but a sign that reads: 'C:\\WINDOWS>', and it just sits there and doesn't do anything. I have to turn off the system to go back to Windows.\"\n\n• Customer: \"File manager? What's that?\" \nTech Support: \"How long have you had your computer?\" \nCustomer: \"Three years.\" \n\n• \"I have a 386 Pentium.\" \n\n• \"My brother has a 486 with a Pentium chip in it.\" \n\n• Customer: \"The computer told me it had contagious memory. Does it have a virus?\" \nTech Support: \"No, that is 'contiguous' memory, as in 'sequential'.\"\nCustomer: \"That is impossible, it said 'contagious'.\" \nTech Support: \"Type 'mem' and hit the 'enter' key.\" Customer: \"Oh.\"\n\n• \"My computer's telling me I performed an illegal abortion.\"\n\n", "group_id": 9873, "id": 1161743}, {"user_id": 30352, "stars": [], "topic_id": 36535, "date_created": 1306212533.52879, "message": "• Tech Support: \"What version of the Mac OS are you using?\"\nCustomer: \"Word 6.0.\" \n\n• Tech Support: \"What browser are you using, Netscape or Microsoft?\" \nCustomer: \"Netscape.\"\nTech Support: \"Could you read to me what it says at the top of the window?\"\nCustomer: \"'Global Travel Conference - Microsoft Internet Explorer'.\" \n\n• Tech Support: \"Are you installing on a Mac?\" \nCustomer: \"No, I'm using a 3.5\" thingee on a disk.\" \n\n• Tech Support: \"This has Windows 98 on it -- did it have Windows 98 or 95 on it when it was sent out for repair?\" \nCustomer: \"I think it had Office 97.\" \n\n• Tech Support: \"How much free space do you have on your hard drive?\" \nCustomer: \"Well, my wife likes to get up there on that Internet, and she downloaded ten hours of free space. Is that enough?\" \n\n• Customer: \"I keep getting an error message whenever I try using the MSDOS mode in Windows 95.\"\nTech Support: \"Can you describe what happens?\" \nCustomer: \"Well, I keep getting a black screen with an error message saying, 'C:\\WINDOWS>'.\" \n\n• Tech Support: \"which drive is your CD ROM?\" \nCustomer: \"the top one.\" \n\n• Customer: \"Do I hit 'F' and '8' at the same time?\" \n\n• Tech Support: \"Your password will be...a small 'a' as in apple, a capital 'V' as in Victor, the number '7' \" \nCustomer: \"Is that a capital '7'?\" \n\n• Tech Support: \"Ok, let's try once more, but use lower case letters...\" \nCustomer: \"Uh, I only have capital letters on my keyboard.\"\n\n", "group_id": 9873, "id": 1161732}, {"user_id": 24734, "stars": [], "topic_id": 36535, "date_created": 1306319407.259546, "message": "Those are funny", "group_id": 9873, "id": 1176349}]