[{"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309087807.437609, "message": "I started thinking about this with regard to MC and IC, specifically determining the roles of each in a few particular movies which has lead to some confusion on my part - however, in doing some research on the Dramatica site, I noticed something which may seem to change ones own perspective (interpretation) of the MC/IC.  \n\nThe problem I've been a bit perplexed by, which I discussed to some degree with @jimhull a few weeks ago, pertains to MC's in movies where we have voice over narration.  Specifically, Shawshank Redemption and Braveheart.  In both of these, I've always looked at the main character as being the opposite as defined in most analysis I've found.", "group_id": 2515, "id": 1488456}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309087928.7025211, "message": "In Shawshank, I went with Red - partly because he's the narrator and prior to learning more about Dramatica, fit the bill as the character who changed most.  In Braveheart, I figured it was Robert the Bruce.  Again, he's the character who's narrating and \"changed the most\".  But as Jim has pointed out via the many wonderful articles on his site, not all MC's need are meant to change.", "group_id": 2515, "id": 1488463}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309088935.4074299, "message": "I know some of (if not all) what determines a MC goes into what the story problem is and who resolves it.  Again, looking at Braveheart - it's freedom, something Robert the Bruce ultimately leads them to.  \n\nAnyway, the the heart of the struggle here for me is more or less within defining the MC's when literary devices such as narration are used because those specifically give you one character's POV which doesn't always match up with the defined MC in the dramatica analysis.  Complicating this is the evolution of the IC term.  Clearly Robert the Bruce is an obstacle for William Wallace, but when we remove part of the term's defining word, obstacle, it only makes me feel more confusion and likely to go with my interpretation.", "group_id": 2515, "id": 1488508}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309089167.73348, "message": "One last movie which came up recently helps me to these conclusions:  No Country for Old Men.  SPOILER AHEAD:  One criticism I've heard from many people about the film is that we follow Llwelyn for much of the movie but then his death happens off screen.  \n\nI say it happens off screen because otherwise, it would confuse us to whom the MC is.  It's the Sheriff's story - he opens with a narration and we end with his ruminations about living in a world that's gone violent and how he can't make any sense of it all.  I thought the ending was a let down until I realized this was really about the Sheriff - we're confused with the ending because we've just viewed the story through the POV of a confused Sheriff.  It's simply not supposed to make sense.", "group_id": 2515, "id": 1488529}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309088170.4964831, "message": "I also look at To Kill a Mockingbird as an example where we have Scout as the narrator and MC.  All of the analysis I've found on this shares this same perspective and I can certainly agree that she shares the main story concern of prejudice.  \n\nDepending on how one interprets the main problem to be solved in Shawshank/Braveheart, I think some arguments *could* be made as to whom the MC is, though I've somewhat taken to Jim's explanation as well.", "group_id": 2515, "id": 1488476}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309088420.4052341, "message": "Braveheart, however, is actually Robert the Bruce.  Knowing this, I went to the dramatica website for the analysis there and wasn't surprised to see William Wallace as MC and Robert the Bruce as... OBSTACLE character.  Makes perfect sense as he does fit the definition, both literally and figuratively.  \n\nHowever, I've noticed Obstacle has been dropped in more recent times to Impact, to now perhaps simply Influence - which, to me, impacts the original analysis somewhat.  If it's not an obstacle character (or seen as such anymore), then really, isn't it feasible to look at William Wallace as being the steadfast Influence Character who finally wins over Robert the Bruce?", "group_id": 2515, "id": 1488484}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309095593.8411069, "message": "@JBarker I think you may be reading too much into the labels we use for the MC and IC/OC, rather than their functions, as well as their change and steadfast stance regarding the problem at the heart of the inequity.", "group_id": 2515, "id": 1488860}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309097154.463676, "message": "No Country for Old Men doesn't work for me because it is constructed like a novel but presented as a film.  What works in one medium does not always translate into another.  The movie leaves out the last act of the Overall Story and immediately proceeds to an overly long epilogue.  IF the MC is the sheriff, then he is fundamentally underdeveloped.  He's there in the beginning as MC, mostly as an objective character during the middle, then back as MC at the end.  This leaves large gaps in his development.  \n\nI felt the ending scenes, one with the sheriff's brother, the other with the sheriff's wife, didn't earn the conclusion that the world in which the sheriff now lived was no country for old men.  It came across like a statement more than an argument.", "group_id": 2515, "id": 1488992}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309097185.7006021, "message": "Sorry about the rambling.", "group_id": 2515, "id": 1488994}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309095912.976089, "message": "Obstacle, impact, and influence each make more sense with a Change MC than a Steadfast MC.  Of the three, impact seems to work the best with Steadfast MC's.  We don't have terms for the \"change\" character and the \"steadfast\" character, though I suppose it would be easier to understand the concept in certain lights if we did.  One of the reasons we DIDN'T is because many writers assume that the MC is the Change character and the IC is the Steadfast character, so parsing them as Change character and Steadfast character really doesn't gain any objectivity, just a quicker understanding of those two concepts.", "group_id": 2515, "id": 1488904}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309096052.5763271, "message": "The other reason we didn't identify the change and steadfast characters was because our use of the term \"change\" is narrower than that of most story paradigms.  Our MC Resolve separates out the process of growth from the ultimate disposition of change or steadfast.", "group_id": 2515, "id": 1488925}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309096207.0132799, "message": "I am not trying to say you suggested we use the change character and steadfast character labels, but the examples you use and your questions about the MC and IC labels is clearer using those concepts.", "group_id": 2515, "id": 1488940}, {"user_id": 10814, "stars": [], "topic_id": 40482, "date_created": 1309096759.381675, "message": "Narrators can have different uses in a story.  A common and comfortable use is as the voice of the MC.  This can be a way to get into the head of the MC as they proceed through the story.  Another is as the voice of the author, offering objective observations about the story.  Yet another is as a storytelling technique to get into the anywhere the author wants, including the MC's head and those of other characters.\n\nWhen a narrator represents the MC, the observations are limited by the narrowed view of the MC.  When the narrator represents a more objective view, even if it is in the MC's voice, then the narrator is speaking for the author and the author's observations, or storyweaving techniques (e.g. \"I didn't know then that would be the last time I'd ever see her alive\").", "group_id": 2515, "id": 1488973}, {"user_id": 33839, "stars": [], "topic_id": 40482, "date_created": 1309108784.1437249, "message": "Thanks Chris, you weren't rambling, lol.  I would agree with NCFOM, especially after I started watching it again the other day.  It does come across as more of a statement/observation more than an argument.  \n\nI understand the principles of the terminology at this point and clearly, Braveheart isn't \"about\" Robert the Bruce which is why I wouldn't qualify him as the MC - it's just the combination of those devices, the film's title, and the shift in how an IC is labeled.  \n\nHas the definition changed as well over the years, or has it remained the same?  I'm guess I'm trying to understand its change from Obstacle to Impact to Influence, each of which mean distinctively different things - especially when looking at Robert the Bruce's character and how the definition is interpreted.  \n\nThanks again.", "group_id": 2515, "id": 1489720}, {"user_id": 7645, "stars": [], "topic_id": 40482, "date_created": 1309118647.4370241, "message": "As far as I understand it, Obstacle was used because that character represented an obstacle to the Main Character continuing on with their justifications. The OC presented a block to their normal way of doing things. Robert works this way because he's more of a politician, William would rather slice and dice.", "group_id": 2515, "id": 1490540}, {"user_id": 7645, "stars": [], "topic_id": 40482, "date_created": 1309118925.4238319, "message": "Impact was a marketing choice because I think people were confusing Obstacle with Antagonist. Influence seems less \"gimmicky\" to me than Impact and probably speaks more to the truth of the term", "group_id": 2515, "id": 1490553}]