[{"user_id": 9108, "stars": [], "topic_id": 5890, "date_created": 1297738227.4691701, "message": "I'm pretty excited to see a lot of the new social aspects being added with BlackBerry Messenger 6. I think BBM is one of the biggest assets that RIM has, and I'm glad to see they're focusing on that pretty heavily. I know a lot of current BlackBerry users who stick with the platform exclusively for physical keyboards and BBM.", "group_id": 97, "id": 108920}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1297758785.3210139, "message": "It is no secret that the BB hardware is the best.  I get reception in places no other phone gets.  The responsiveness to unmatched. The build quality is top notch.  But the apps are atrocious.  And if you do manage to find an app you like, the price is unbelievable.  The iPhone success is not down to its inferior hardware it is purely down to applications and backing from third parties.  RIM need to work on their collaboration with third parties.", "group_id": 97, "id": 109835}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1297758676.836129, "message": "I \"was/am\" the same.  I constantly switch my contract between Blackberry and iPhone depending on my mood.  I normally go 4 months before switching.  But the BIGGEST failing in Blackberry are the apps.", "group_id": 97, "id": 109830}, {"user_id": 3909, "stars": [], "topic_id": 5890, "date_created": 1297758995.734633, "message": "nice", "group_id": 97, "id": 109839}, {"user_id": 9108, "stars": [], "topic_id": 5890, "date_created": 1297769340.925271, "message": "@Kam I agree with you. I was on Android for about 4 months before I switched back to BlackBerry for better battery life and a physical keyboard. Switching back also made me realize the sad state of BB apps. I don't think there are many serious developers left on the platform, and that's something RIM is really going to have to fight. As a result, most of the apps are lackluster at best (assuming you can even find one that does what you need.)", "group_id": 97, "id": 110391}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1297805964.7529099, "message": "The developer problem was brought about by BB.  Google and Apple make it a dream to code for them.  All the support and tutorials.  However, RIM need to develop their own applications and QUICKLY.  Once they have proven they serious AND the platform is near equally provisioned as Android and iPhone, then the developers will come.  BUild it and they will come :)  On top of it all, Android can be coded in Java, same as BB!", "group_id": 97, "id": 115571}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1297805774.266613, "message": "And the thing I don't get is - you don't need to be a genius to figure it out - so why havent they done it already instead of adding multimedia support to BBM and launching it like it is going to change the world.  Or releasing a full touch screen BB with an underpowered processor and a non HD screen - which you could forgive if it had a flagship application.", "group_id": 97, "id": 115527}, {"user_id": 9108, "stars": [], "topic_id": 5890, "date_created": 1297818166.8964839, "message": "@Kam I agree that's what they should have done already. The problem is that RIM became too complacent when it was on top. Instead of innovating and improving, they just kept with their same formula. They released an OS (5.0) that was almost exactly the same as the one before it and kept all of their major applications the same. It wasn't until competitors like Apple, Motorola, and HTC were already gaining solid ground that RIM decided to start making improvements, so they're now behind. I think that handsets like the Bold Touch look great, but I can't help but think about how if RIM hadn't gone stagnant for so long, those devices could already be out. We would also likely be a lot closer to seeing QNX on phones.", "group_id": 97, "id": 117057}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1297849925.8434229, "message": "@JohnFail Totally! BB got complacent.  And even when Apple and Google moved, they didn't flinch.  I do dislike RIM for that as it disrupts my lifestyle.  When I bought my first Blackberry I felt I had everything I needed in a phone.  Battery, keyboard, build quality etc etc.  Unfortunately, the world moved on and RIM stood still.  The world demands we have information almost immediately.  Motorola have the Droid Pro which looks neat, touchscreen AND keyboard in a candy bar not sliding.  Apple look like they will be adding a keyboard to their phones too.  So RIM.....what is so exclusive about you platform nowadays? The security?  Well, that's a shame cos I ain't  the MI5/6. I rag on RIM more than any other company, because I prefer their handsets - just no software. Ho hum....RIM may have a won some respite as Apple have announced their new subscriptions policy which I am hoping will make vendors jump off Apple and onto other platforms.  Seemed moronic that vendors didnt support other OS's - and ultimately consumer - which is why I have no sympathy for them...they danced with the devil...What did they expect?", "group_id": 97, "id": 118640}, {"user_id": 9108, "stars": [], "topic_id": 5890, "date_created": 1297991642.9310901, "message": "@Kam Yep, and now BlackBerry fans are left literally begging for popular software (http://bit.ly/ikzzMA) and developers are straight up shooting them down (http://bit.ly/f6mld5). I think it's pretty safe to say that the biggest chunk of the BlackBerry market (at least in the U.S.) comes from users in corporate environments who are given a BlackBerry, and my own experience is that those users really don't want the device. Anymore it's not because they don't want to constantly have work email bugging them; it's because they figure if they have to carry a phone for work, they would rather have one that will play more of the games and media they want.", "group_id": 97, "id": 138618}, {"user_id": 5993, "stars": [], "topic_id": 5890, "date_created": 1298022440.411782, "message": "Angry Birds on BB?  http://gizmodo.com/?_escaped_fragment_=5640898/this-is-how-angry-birds-would-look-on-blackberry  ;)", "group_id": 97, "id": 141204}, {"user_id": 9108, "stars": [], "topic_id": 5890, "date_created": 1298028929.0071919, "message": "@Kam Haha, that's great! Add in multi-player and it would be an Angry Birds MUD.", "group_id": 97, "id": 141952}]