[{"user_id": 18095, "stars": [{"date_created": 1299459120.4069309, "user_id": 16958}], "topic_id": 11023, "date_created": 1299364936.9854009, "message": "More than 1.5 hours is pushing it a bit, try listening at a faster speed.  Its amazing how many podcasts sound fine at a faster speed.", "group_id": 5074, "id": 277870}, {"user_id": 18780, "stars": [], "topic_id": 11023, "date_created": 1299363622.684299, "message": "Don't you find some of the shows are too long? (more than 1:30 hours)", "group_id": 5074, "id": 277812}, {"user_id": 16886, "stars": [], "topic_id": 11023, "date_created": 1299364297.47421, "message": "no", "group_id": 5074, "id": 277838}, {"user_id": 16886, "stars": [{"date_created": 1299772430.007581, "user_id": 18748}], "topic_id": 11023, "date_created": 1299364315.305644, "message": "it a podcast, not TV", "group_id": 5074, "id": 277839}, {"user_id": 13888, "stars": [], "topic_id": 11023, "date_created": 1299365355.1606491, "message": "are there any android podcast listening apps that allow to play at faster speed?", "group_id": 5074, "id": 277879}, {"user_id": 9448, "stars": [], "topic_id": 11023, "date_created": 1299368672.514158, "message": "I love the length ... BUT ... it often forces me to delete other shows I also really like. It's tough to fit them all in. Add up the hours spent on the top 5 TWiT shows and you'll quickly discover my dilemma.", "group_id": 5074, "id": 277967}, {"user_id": 17097, "stars": [], "topic_id": 11023, "date_created": 1299368700.6306291, "message": "@mickuc, I like that idea of speeding it up and do it often. Pros like Leo don't need it but the wise geeks that haven't done decades of radio sound...smarter. lol You know that if it were pared down to the desired hour or so, folks would want the discards and aside from that, it sounds like a lot of work for the editors to me, thus more expense.", "group_id": 5074, "id": 277971}, {"user_id": 17097, "stars": [], "topic_id": 11023, "date_created": 1299368813.3168111, "message": "I feel your pain revtim - and imagine Leo's dilemma sponsoring Audible for similar reason..and it's paid content.", "group_id": 5074, "id": 277976}, {"user_id": 17097, "stars": [], "topic_id": 11023, "date_created": 1299368628.4222691, "message": "Think of it as a 2-parter, filipecerda - some now, some later. I usually only complain about too much if it's a bad thing..this to me is bonus, extra, premium content.", "group_id": 5074, "id": 277964}, {"user_id": 19032, "stars": [], "topic_id": 11023, "date_created": 1299371724.4362221, "message": "@mickduc How do i speed up the podcast in iTunes?", "group_id": 5074, "id": 278082}, {"user_id": 12689, "stars": [], "topic_id": 11023, "date_created": 1299372518.3956859, "message": "I love the long shows. I have lots of time to kill, so the length is getting better and better... longer and longer that is.", "group_id": 5074, "id": 278102}, {"user_id": 19037, "stars": [], "topic_id": 11023, "date_created": 1299378439.2150071, "message": "I like the detail I get from the longer shows. The more detail the better so up to two hours is ok with me.", "group_id": 5074, "id": 278255}, {"user_id": 15929, "stars": [], "topic_id": 11023, "date_created": 1299389994.0637569, "message": "and  i think twit network covers everything right? twit is the lengthy one, and tnt is the tight and focused one?", "group_id": 5074, "id": 278703}, {"user_id": 17098, "stars": [], "topic_id": 11023, "date_created": 1299388779.950783, "message": "I use a Windows program called \"MP3 Speed\" to speed up to speed up all my podcasts by 30% before transferring them to my Sansa Fuze mp3 player.  http://www.mp3-cutter-splitter.com/mp3_speed.html", "group_id": 5074, "id": 278660}, {"user_id": 15929, "stars": [], "topic_id": 11023, "date_created": 1299390076.0350111, "message": "windows weekly is at a sweet spot, although it isn't a general topic show - hence the title", "group_id": 5074, "id": 278705}, {"user_id": 1, "stars": [{"date_created": 1299874910.950918, "user_id": 17932}], "topic_id": 11023, "date_created": 1299390093.369184, "message": "I almost like it when they go off topic, it's fun.", "group_id": 5074, "id": 278706}, {"user_id": 17555, "stars": [], "topic_id": 11023, "date_created": 1299390063.94765, "message": "@mickduc You're right! You hardly noticed 20% faster.", "group_id": 5074, "id": 278704}, {"user_id": 15929, "stars": [{"date_created": 1299874896.3435819, "user_id": 17932}], "topic_id": 11023, "date_created": 1299389926.301254, "message": "i kinda liked the longer shows as well.\n1. i watch reruns (usually have twit live on atom pc / tv) so i don't put 100% attention on the show.\n2. longer show tends to go off topic, like one of my fav twit ep is where the guests were becky and jcd, they were basically talking about nothing (and twitter).\nso for me, the longer the better.", "group_id": 5074, "id": 278701}, {"user_id": 18257, "stars": [], "topic_id": 11023, "date_created": 1299397517.971905, "message": "The time is no problem for me like others have said I would rather they work through a story rather than rush to finish. We can leave the lazy tech journalism to commercial TV.", "group_id": 5074, "id": 278987}, {"user_id": 18889, "stars": [], "topic_id": 11023, "date_created": 1299397130.8568101, "message": "The long shows are the best. I don't like when it feels rushed. The long format seems perfect, especially for shows like TWiT, TWiG, Macbreak Weekly, and Windows Weekly.", "group_id": 5074, "id": 278956}, {"user_id": 18961, "stars": [], "topic_id": 11023, "date_created": 1299401309.0189559, "message": "As a commuter the show length is one of the features I like. Beats the ever repeating playlists or news rounds on radio. Also, you'll never get the depth (or goofiness) in shorter formats.", "group_id": 5074, "id": 279155}, {"user_id": 17124, "stars": [], "topic_id": 11023, "date_created": 1299414280.507061, "message": "It's often a time management issue. I'd love to watch or listen to every episode of TWiT, MacBreak etc, which often run nearly 2 hours, but there are only 24 hours in a day. Sometimes it's hard to find the suitable time to concentrate on the longer shows, even though I don't watch much TV, either these days. That's why the unwatched episodes tend to stack up, especially during spring and summer. I don't like too rushed formats, either, nor do I want to listen to a show in faster speed. Sometimes it's sort of fun to see/hear the guests going eight miles high, way off topic and finally back again. TNT is a pretty good compromise, and so is IPT.", "group_id": 5074, "id": 279994}, {"user_id": 17937, "stars": [{"date_created": 1299874959.650799, "user_id": 17932}], "topic_id": 11023, "date_created": 1299427321.7340009, "message": "Nothing should be less than 1/2 hour. Perfect for workouts. Cancel cable like I did and you will pray they are all longer.", "group_id": 5074, "id": 280530}, {"user_id": 16859, "stars": [], "topic_id": 11023, "date_created": 1299451376.448256, "message": "No, I don't find it too long, in fact I find them easly too short. I never listen to anything on revision3 because their stuff is usually ultra short (and too many ads)", "group_id": 5074, "id": 282220}, {"user_id": 9448, "stars": [], "topic_id": 11023, "date_created": 1299463747.2834439, "message": "@iurus I agree with what you are saying. I LOVE the TWiT network and want to get a lot of variety from many shows. Since my commute is 10 minutes, I often get \"stuck\" deleting some of my favorites. I also don't like the \"speed-it-up\" option -- not as fun and relaxed. It's a tough call and obviously there is NO WAY to please everyone, right?", "group_id": 5074, "id": 283440}, {"user_id": 17081, "stars": [{"date_created": 1299469893.3780479, "user_id": 1}, {"date_created": 1299632400.552665, "user_id": 16958}], "topic_id": 11023, "date_created": 1299469531.945698, "message": "I like long shows, the more content the better, but I have a job where I can listen while I work.", "group_id": 5074, "id": 283775}, {"user_id": 17912, "stars": [], "topic_id": 11023, "date_created": 1299478354.8544419, "message": "Like everyone else, I do enjoy the programming and love it when they're really diving deep into a topic. That being said, I don't think any episode of any show needs to go more than 90 minutes. There have been some episodes of TWiT and Security Now weighing in at over 2 hours and 15 minutes, which is too long in my opinion. Maybe for some of the \"less focused\" episodes of TWiT or MacBreak, the editors can trim for flow. But that might intrude on the editorial nature of some shows.", "group_id": 5074, "id": 285871}, {"user_id": 17991, "stars": [], "topic_id": 11023, "date_created": 1299531462.9247329, "message": "I agree with @scottperezfox 90minutes should be the limit.  Even for TWiT and MacBreak weekly...", "group_id": 5074, "id": 291048}, {"user_id": 17124, "stars": [], "topic_id": 11023, "date_created": 1299604961.0557389, "message": "90 minutes sounds like a reasonable compromise. Or, TWiT & MBW could run 2+ hours, if they were monthly shows, instead of bi-weekly or even weekly shows.", "group_id": 5074, "id": 297612}, {"user_id": 16859, "stars": [], "topic_id": 11023, "date_created": 1299696650.291296, "message": "Those of you who think its too long, can't you just pause it and resume later?", "group_id": 5074, "id": 307441}, {"user_id": 9448, "stars": [], "topic_id": 11023, "date_created": 1299698641.0237269, "message": "@HateBadDesign For me, the difficulty is to try to get in a lot of shows on a variety of topics in each of my weeks. I just run out of those hours and end up deleting a lot of fun (and informative) listening.", "group_id": 5074, "id": 307618}, {"user_id": 15780, "stars": [], "topic_id": 11023, "date_created": 1299703749.585279, "message": "For me 60-90 is idea. I don't like a lot of banter or vamping... unless i love the people talking. Which IS the case for shows like TWiT and MBW. I could care less if they talk for almost 2 hours. Especially when its Leo, Andy, and Merlin. Same could go for shows like Diggnation and TRS.", "group_id": 5074, "id": 308205}, {"user_id": 19995, "stars": [], "topic_id": 11023, "date_created": 1299710732.097744, "message": "90 minutes for a weekly show makes sense - TNT would be about 5 hours if it were weekly", "group_id": 5074, "id": 309115}, {"user_id": 18382, "stars": [], "topic_id": 11023, "date_created": 1299732685.816133, "message": "Quite a few of the podcasts lack focus, or the guests are constantly going on about themselves rather than the topics - that's what makes them long and a challenge to listen to. The good ones are content heavy like FLOSS or are well paced like TNT.", "group_id": 5074, "id": 310957}, {"user_id": 19821, "stars": [], "topic_id": 11023, "date_created": 1299741255.5050261, "message": "I also like the length. I drive about 20 mins to work and listen to TWiG and NET@Night each week on the way to and from work. I get sad if they are finished by Wednesday / Thursday. Don't make me sad...", "group_id": 5074, "id": 311557}, {"user_id": 17097, "stars": [{"date_created": 1299779299.34355, "user_id": 26}], "topic_id": 11023, "date_created": 1299760479.0948009, "message": "Windows Media Player allows you to speed up the audio w/out affecting the pitch. Before you start, I mention WMP as it has the best sounding \"speed up\" feature I've tried. TWiT netcasts don't need it so much, but many show's less experienced hosts and guests are made much more listenable using this tool.", "group_id": 5074, "id": 312879}, {"user_id": 16859, "stars": [], "topic_id": 11023, "date_created": 1299766313.8481519, "message": "@mcuk Some would say that is how twit is: to go of on all kinds of tangents - if you want focused waffle surely there is enough of that elsewhere? :)", "group_id": 5074, "id": 313430}, {"user_id": 9975, "stars": [], "topic_id": 11023, "date_created": 1299774178.7226839, "message": "When I was filling in for Leo, I got some people thanking me for staying on time and on topic, and others complaining that the shows weren't as fun as when Leo did them, beceuase of that.  It's two different styles, but both work when done right, and Leo is the master of being able to go off topic and have you almost never notice because you're enjoing it so much.", "group_id": 5074, "id": 314635}, {"user_id": 18748, "stars": [], "topic_id": 11023, "date_created": 1299772517.146471, "message": "@thewalter agreed! Podcast, not TV or Radio.", "group_id": 5074, "id": 314450}, {"user_id": 15929, "stars": [], "topic_id": 11023, "date_created": 1299775049.5842509, "message": "@tommerritt it's funny how you are Leo's clone and anti-Leo at the same time", "group_id": 5074, "id": 314696}, {"user_id": 9975, "stars": [], "topic_id": 11023, "date_created": 1299774121.6950841, "message": "You know it's funny.  On BOL the audience would start to criticise when we would go beyond 40 minutes, but the TWiT audience seems fine with longer TNTs.  So some of it is just the culture of the network.  I think focus and pacing take precedence over time.", "group_id": 5074, "id": 314632}, {"user_id": 17255, "stars": [], "topic_id": 11023, "date_created": 1299804324.710037, "message": "Not one bit! Unless hosts habitually make shows that follow them be late.  Oh wait...", "group_id": 5074, "id": 318011}, {"user_id": 17937, "stars": [], "topic_id": 11023, "date_created": 1299806721.4602909, "message": "Tom, you know what topic you guys need to do a show on. When Leo was away you guys had a brief conversation about it. Drum Roll. Topic: Leo and TWiT and how TWiT is turning a new form entertainment away from regular TV. Where it is going.. Where it could go.... What needs to happen, anyone else doing it. Obstacles of TWiT etc", "group_id": 5074, "id": 318248}]