[{"user_id": 921, "stars": [{"date_created": 1298496032.958744, "user_id": 921}], "topic_id": 8452, "date_created": 1298495879.5595541, "message": "Antonio mencionó que está desarrollando software para Android. ¿Podrían compartir el estado de esta plataforma en Panamá? Quiero aprender el soporte que Google le da a está  plataforma en Panamá---por ejemplo, ¿ya puede un Panameño crear una cuenta de desarrollador para crear y vender en el appstore?---; el interés que tienen los Panameños (desarrolladores y usuarios) por ella; y el apollo que los proveedores de telefonía celular le da a Android.", "group_id": 4948, "id": 191301}, {"user_id": 2457, "stars": [], "topic_id": 8452, "date_created": 1298563954.485898, "message": "Pues C&W está empezando a traer teléfonos Android. Pero no les dan el soporte debido creo yo. Por ejemplo, mi cel le llegan las notificaciones de voicemail como mensajes en blanco de texto. Llamé y nadie supo decirme qué pasaba. Lo de la cuenta de Market, no sé si se podría vender. Lo dudo ya que google checkout no acepta vendedores afuera de USA. Siendo el Android nuevo acá. Casi nadie sabe de su existencia así que no veo mucho interés general aparte de los geeks.", "group_id": 4948, "id": 198681}, {"user_id": 15632, "stars": [], "topic_id": 8452, "date_created": 1298579926.6753981, "message": "han probado Claro? solo he escuchado cosas buenas...", "group_id": 4948, "id": 201884}, {"user_id": 2457, "stars": [], "topic_id": 8452, "date_created": 1298579413.772032, "message": "En mi experiencia, la data de C&W nunca me ha dado problemas. Pero sólo la tengo desde diciembre. Bien fast y cuando la he necesitado, ha respondido. Así que no tengo muchas quejas.", "group_id": 4948, "id": 201758}, {"user_id": 15739, "stars": [], "topic_id": 8452, "date_created": 1298580402.344147, "message": "yo tengo claro y me funciona bien :D", "group_id": 4948, "id": 201945}, {"user_id": 15614, "stars": [], "topic_id": 8452, "date_created": 1298578763.5661831, "message": "El android market no lo vas a poder usar, a mi me toca usar un software que se llama market enabler y fingir que estoy usando t-mobile para comprar, soporte de los carriers = nulo, y C&W tiene la peor data de Panamá", "group_id": 4948, "id": 201640}, {"user_id": 2457, "stars": [], "topic_id": 8452, "date_created": 1298579535.1330421, "message": "@di3gopa voy a chequear ese app del market enabler! Que hace rato quiero bajar el kindle y no puedo.. :(", "group_id": 4948, "id": 201790}, {"user_id": 2052, "stars": [], "topic_id": 8452, "date_created": 1298579537.127816, "message": "yo tengo data con CW desde hace mas de 5 años y no tengo problemas tampoco...", "group_id": 4948, "id": 201791}, {"user_id": 15614, "stars": [], "topic_id": 8452, "date_created": 1298579675.5800979, "message": "de veras? todos mis amigos me dan queja de la data de C&W y el \"3G\" es demasiado dificil que me tire buenas velocidades, aveces ni 80k me tira", "group_id": 4948, "id": 201831}, {"user_id": 15288, "stars": [], "topic_id": 8452, "date_created": 1298580112.5108981, "message": "@Pako Igualmente, he escuchado buenos comentarios.", "group_id": 4948, "id": 201916}, {"user_id": 15614, "stars": [], "topic_id": 8452, "date_created": 1298580096.6388869, "message": "@pako supuestamente claro es el mejor", "group_id": 4948, "id": 201911}, {"user_id": 921, "stars": [], "topic_id": 8452, "date_created": 1298582295.0183711, "message": "Es una lástima que Google no tenga, a estas alturas, ni el appstore ni cuentas de desarrolladores en Panamá. Además, yo pensaba que con la popularidad del iPhone, los proveedores le prestarían atención a Android.", "group_id": 4948, "id": 202224}, {"user_id": 921, "stars": [], "topic_id": 8452, "date_created": 1298582352.7519851, "message": "Imagino que la situación cambiará dentro de poco, ya que Android finalmente tiene un mercado mayor que el iPhone.", "group_id": 4948, "id": 202233}]