[{"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308010438.1987751, "message": "BTW, my PSR says that my ACT 1 is Understanding- explored in terms of \"State of Being\",Situation,Circumstances,Sense of Self-  And THOSE show up in MY Manipulation- M/I Throughline (when I look at Theme Browser) under Developing a Plan-and diagonal from  THAT is \"Conceiving a plan\"!  AND UNDERSTANDING IS INDEED IN OS  (another quad)! Where is the tequila bottle- I need LOTS!", "group_id": 2515, "id": 1386246}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308009342.803478, "message": "I'm looking at Armando's book p 156. That being said (written) the chapter deals with \"How to Get a Complete Plot) And in his example he gives an example of OS Signpost 1 Memory  and sugggests if \"we\"want to turn that sequence into three scenes we Consult the PSR. He then gives the example (I'm assuming that his software shows) and states that In Act One Recollections (Memories) are explored in terms of Investigation, Appraisal, REappraisal, and doubt.  He says we should print this and then turn to the Theme Browser to see which \"variations are aligned diagonally and which are not. THE EXAMPLE HE SHOWS is \"Fixed  Attitude\" with Memories, Impulsive Responses, Inner Most Desires, Contemplation. I. AND insdide the CONTEMPLATION is Investigation,Appraisal,Reappraisal, and Doubt. These FOUR elements are in CONTEMPLATION which is DIAGONAL from Memories.  \r\nWhat am I missing since my frontal lobotomy? Those four elements are in CONTEMPLATION and yet he says to look at memories. Is this right? Is this Armando's example gone awry, is this the case each time that we must look at the Theme browser and then make a quantum leap like a \"Knight\" on a chesssboard.  \r\nOf course he goes on to sya on the next page: \"The rest is simple....\"\r\nAnd of course when I look at my \"PSR\" I have to do a cut and paste of the \"definitions just to attempt to make sense... Circumstances(an emotional assessment of one's environment) etc. I'm glad I'm trying to write because I've failed at trying to read...<g>\r\nGordon", "group_id": 2515, "id": 1386153}, {"user_id": 7645, "stars": [], "topic_id": 39267, "date_created": 1308011527.4549699, "message": "A more appropriate use of the PSR would be to write with the storyform in mind (the Story Engine Settings report) and then after you complete your first draft, go ahead and take a look at the PSR and see how it predicted what you were going to write. Where there are issues or missing pieces you can easily fill them in.", "group_id": 2515, "id": 1386313}, {"user_id": 7645, "stars": [], "topic_id": 39267, "date_created": 1308011321.67751, "message": "Don't use the PSR.", "group_id": 2515, "id": 1386293}, {"user_id": 7645, "stars": [], "topic_id": 39267, "date_created": 1308011423.1918709, "message": "The PSR shows the screwed-up version of the model - how the model looks from *within* your story. It's a compelling report, but if you trust your instincts and write with the storyform in mind, your story will work itself out.", "group_id": 2515, "id": 1386305}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308024740.2035201, "message": "The theme browser is the picture of a world in balance. A story is about putting an element back where it belongs -- to put the world into balance. \n\nBut that misplaced element is not the only element that gets shifted -- the whole world gets shifted, and that's what puts elements that are normally Contemplation into Memories.\n\nLet's take for granted that looking at something like a Situation in terms of Past, Present, Future and Progress makes sense and covers all the bases. By *attempting* to describe a situation with Preconscious, Subconscious, Conscious and Memory, you will fail. You make progress (I suppose) but you fail -- this means that there is constant learning and also constant dramatic tension. \n\nBy twisting the elements around, this progress/tension combo is present throughout the whole story.", "group_id": 2515, "id": 1387260}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308269278.7471931, "message": "@mp131 I'm doing a rewrite and am relying heavily on the PSR, and am going to strongly second @jimhull's advice to avoid it. For now at least.", "group_id": 2515, "id": 1414772}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308279665.1429031, "message": "Here's the thing. I found Armando's book helpful in many ways, but misleading in others. (Nothing he says is technically wrong, but he outlines only one of many ways to use Dramatica.) \n\nOne of the things that I found misleading was the way that he encouraged us to use the PSR. \n\nFrom what I have learned from reading Melanie's site, the 1:1 correlation that Armando uses for scenes is not at all necessary. It works for Armando, while outlining movies -- which you are not writing -- because he is a very experienced writer on top of being very good at Dramatica.\n\nA novel might have 38 or 43 or 7 scenes in any given exploration of a signpost. The four ways that the PSR gives you to explore those scenes won't go into those numbers evenly, but they will if you let them smear out.\n\nI have found in my own rewrite that the thematic explorations are not neatly contained in each scene, but one leads to the next very nicely. Because I have already iron out my flow in the first two drafts, I can very specifically look at what the PSR is telling me and hone what is already there. Typically I don't have to create anything new, but sometimes I do.\n\nHaving tried to use the PSR earlier in the process, I find this much easier. And, much more pertinent and powerful.\n\nSo, to reiterate, I would highly recommend writing a draft before calling on the PSR. It won't be so frustrating then.", "group_id": 2515, "id": 1415834}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308340429.80494, "message": "Because then you'll want to know all about the PRCO.", "group_id": 2515, "id": 1422129}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308340406.049912, "message": "If you don't know, you don't want to know.", "group_id": 2515, "id": 1422119}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308340351.6261799, "message": "PSR?", "group_id": 2515, "id": 1422102}, {"user_id": 10814, "stars": [], "topic_id": 39267, "date_created": 1308345128.9043391, "message": "@Buck   The Plot Sequence report in Dramatica Pro.  Look to the Dramatica tips on Dramatica.com for basic enlightenment.", "group_id": 2515, "id": 1422582}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308346640.7635131, "message": "@Chris_Huntley. Got it. Thanks.", "group_id": 2515, "id": 1422711}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308569373.2089629, "message": "So some recommend NOT to use PSR. Some recommend NOT to follow Armando. In another topic \"Query\" was (heavily) downplayed. Some have suggested DP might not be a good vehicle for novels. At this rate I'm beginning to wonder whether DP has value for any writer except a VERY small audience who write very limited types of \"stories.\"", "group_id": 2515, "id": 1437697}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308569947.4167211, "message": "That all being said (silly me I can't get my thoughts into the sort space of a Tweet) I have a story. I have tried (lord knows I've tried...) to get it into DP. I've tried to understand it through DP and theory. It seems that the more I try the more frustrated I've become and the more confused. It is no wonder (to me) that there are three \"camps\" of DP folks- those who use it in a limited way and like it- those who have it and still hope it has value as they beat their heads on a wall- and those who refuse to admit they tried it and couldn't use it.", "group_id": 2515, "id": 1437742}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308569630.8202479, "message": "We have 31 members \"discussing\" theory and software and I get the feeling that more are using maybe 5% of the software and force fitting an analysis of a \"story\" into Dram. Reminds me of classes years ago where some would suggest one type of critique such as \"Psychological\" just because THAT made sense to them though there was absolutely NO indication that the author was thinking that way. Like the Freudian interpretation of fairy tales.", "group_id": 2515, "id": 1437709}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308570324.6720021, "message": "WHO  actually has used the software to START a story, gone through the software steps, and written a story using DP as a REAL guiding force? Those who use it to \"fix\" problems during re-write need not apply. If it is just a \"limited re-write tool\" then maybe my critique group is a better approach- at least we have fun... Paint me very frustrated and a bit more disappointed.", "group_id": 2515, "id": 1437795}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308570061.2527061, "message": "Maybe my problem is I worked in IT for years and had high expectations when I came across the blurbs. Maybe I have expectations of the software that can never be met. Maybe I'm just not a writer.", "group_id": 2515, "id": 1437760}, {"user_id": 30951, "stars": [], "topic_id": 39267, "date_created": 1308573398.961277, "message": "I like these type of posts. Throws up challenges. Not experienced enough yet with Dramatica to try to answer them, but I would like to add my own experience. \n\nFirst thing is, even if I stopped using Dramatica now, I believe I would be a better / more knowledgeable writer for the experience. I'm also an IT person, and I have come to the conclusion that to make Dramatica work, you've got to find out how it works for you. \n\nFor example, I can't use Armando's instant Dramatica at all. I can't use the query system from the beginning. I need to quickly work out the static appreciations, answer what I can, get an idea for my throughlines, then get to the theme browser. This is the place that makes sense to me. I need that visual aspect. I'm gradually getting used to using the Plot Progression as well to storyform.\n\nI use it for novels. I'm  concurrently writing two (I know that's a bad idea), so jump backwards and forwards to these two storyforms. I've probably changed each one about 5 times now. But mainly because I'm learning.", "group_id": 2515, "id": 1438111}, {"user_id": 7645, "stars": [], "topic_id": 39267, "date_created": 1308576800.5706201, "message": "The fourth camp would be those who study it, use it from the beginning of the writing process to the end, and have managed to sell the final product because of it.", "group_id": 2515, "id": 1438378}, {"user_id": 7645, "stars": [], "topic_id": 39267, "date_created": 1308576020.1627829, "message": "I use Dramatica all the time to start a story, not just rewriting. If you're having difficulty understanding the theory the PSR is definitely not the place to start. All that matters is the deep thinking the theory challenges you to experience while writing your story.", "group_id": 2515, "id": 1438281}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308583442.4295969, "message": "I do not interpret the word theory to mean unalterable postulaic formula, but rather as something presenting a concept for discussion and exploration.", "group_id": 2515, "id": 1439275}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308582999.974915, "message": "During that semester, I used the program to create stories for the class assignments, and continued to use it to create new stories for the screenwriting class I took last semester.", "group_id": 2515, "id": 1439183}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308583150.1315031, "message": "While all of that has been going on, I'm also plugging other stories that I began writing as early as 2005 into DP, and although that's a tedious process, I'm not only producing a ton of new material for the stories but it's \"quality\" material, material that is actually usable and will most likely be printed in the final manuscript.", "group_id": 2515, "id": 1439210}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308583339.4712479, "message": "I too, have noticed the differences that you have noticed. In the beginning I found those differences to be quite irksome, because when it comes right down to it, following a linear, technical path is easier for me than not... but now perhaps 9 months after I became involved in the DP communities, I enjoy the differences. I find that they are helpful in my understanding of what I believe to be the key word in Dramatica that many seem to overlook: Theory.", "group_id": 2515, "id": 1439247}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308582949.2165191, "message": "@mp131 Hi. I purchased DP in 2005, was overwhelmed, and promptly closed the program. I then began to take college courses in writing, work through other books about writing story, and along the way opened and closed the program on many occasions until last Fall Semester 2010. At that time everything clicked into place, and I was finally able to begin using the program.", "group_id": 2515, "id": 1439170}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308586627.7262549, "message": "@mp131 I feel like you're leveling a lot of this at me, which makes me feel like I haven't been very clear.\n\nI'm not saying \"Don't use the PSR.\" I'm saying that it's complicated, and that there are more effective ways and places to spend your time inside Dramatica. And, once you have written a draft, you'll see that you have probably already done much of the work the PSR would have suggested anyway, without bursting an aneurysm. \n\nI'm not saying, \"Don't follow Armando.\" His book provides a very important thing: a foothold to get started. But it isn't a guide to using Dramatica from alpha to omega. It provides a limited window in how to write a good outline for a movie. (That's my take, anyway.) But it's not a \"do this\" guide. It's a \"this way works\" guide.\n\nI'm not saying Dramatica is bad for a novel. I'm saying that the linearity that Armando suggests in his book (that the PSR generates 48 scenes) implies a rigid design of stories that isn't true. (I would add that I think this is something we all infer, perhaps out of desperation, and not something he implies is true.)\n\nNobody is saying that the Query system is bad, or downplaying it. The program is written very intentionally with massive redundancies so that we can all find the way we are most comfortable using it. I use the Query system a lot. I also use Word simultaneously. Others would find my system mindnumbingly stupid. C'est la vie.", "group_id": 2515, "id": 1439921}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308587167.665803, "message": "So, now that that is out of the way, the real question remains: how can you use Dramatica to get your story into shape?\n\nI have no idea where you are in your process, so the only things I can suggest are very basic:\n1. Can you answer the major questions? What goes into what domain, does your main character change, how does he/she prefer to solve problems? What is the problem in the OS? What is the MC's problem? And, of course, what do they *think* the problem is? [Don't worry about start/stop.]\n2. Do you know how to write a scene? Can you pit forces against each other that create conflict and force the story to be redirected?\n\nEverything in (1) is Dramatica. (2) isn't Dramatica, and that is what your writing group is for. But, if you can't do (2), (1) isn't going to get you very far, in my opinion.", "group_id": 2515, "id": 1440015}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308587797.3287411, "message": "@mp131 Once several months ago, MikeDerk told me not to use the Four Throughlines Theme Report (FTTR?) because it was cheating... so now I use it all the time (hahahaha).", "group_id": 2515, "id": 1440075}, {"user_id": 7712, "stars": [], "topic_id": 39267, "date_created": 1308587811.9667799, "message": "@mp131 (and Mike was joking, of course).", "group_id": 2515, "id": 1440076}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308595251.7222121, "message": "FWIW, I'm currently rewriting with Dram, but I started this whole thing with an idea, then pulled up Dram and had an outline before I started writing.", "group_id": 2515, "id": 1441163}, {"user_id": 7664, "stars": [], "topic_id": 39267, "date_created": 1308595561.723006, "message": "But, what I came here to ask: have you written a novel before? Are you aware that you are about to type out 500 pages of crap?\n\nWe all do it. All the time. It's got a bunch of different names: vomit draft, shit draft, bin food, and of course, the first draft.\n\nI don't think that there is any way to avoid this, and Dramatica certainly isn't going to help. (In my ideal world, I'm hoping it will cut my number of drafts down by 50%)\n\nIf that's what you are trying to avoid, then you've just got to plunge in. Dramatica can help you clarify your thoughts, but so will writing, agonizing and hating every word you put on the page. \n\nThink of it as the price the muses demand of you to see if you're serious.", "group_id": 2515, "id": 1441241}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308706354.8896439, "message": "I might have tossed more than you. Big deal.  I'd hoped you might help.  Quantity. quality. Perception. All subjective.", "group_id": 2515, "id": 1453850}, {"user_id": 13650, "stars": [], "topic_id": 39267, "date_created": 1308706410.324194, "message": "I'm guessing there will soon be one less quantity.", "group_id": 2515, "id": 1453858}]