[{"user_id": 9411, "stars": [], "topic_id": 5520, "date_created": 1297697144.562875, "message": "my current pet project is going to require all sorts of real-world marketing. bus ads, bus stop ads, flyers, etc. anybody ever see a comparison table of these tools? pros, cons, costs, etc", "group_id": 95, "id": 100635}, {"user_id": 8501, "stars": [], "topic_id": 5520, "date_created": 1297705095.5862191, "message": "the roi of flyers sent to mailboxes en masse can be very high. consider your costs. a 12\" x 10\" 2-sided flyer on thick card stock costs ~ $0.35 per flyer, grand total, including shipping ($0.24) and printing. a bulk mail license costs $180/year. you can get a list of all the mailing addresses in your area, from the post office. your designer can do a mail merge in adobe indesign. for $3500, 10k people will have to hold and consider your 12\" x 10\" ad. in terms of roi and converting those impressions into customers, much depends on the ad itself and the extent to which your service/product helps customers. good luck!", "group_id": 95, "id": 101979}, {"user_id": 9326, "stars": [], "topic_id": 5520, "date_created": 1297737023.1835029, "message": "I recommend Get Clients Now http://amzn.to/aHh9iA It has a great explanation of which marketing methods will work best for you and the clients you want to reach. It has a great pros and cons list for different types of marketing. While it is geared towards professional services companies I think it has some valid points for other types of companies as well.", "group_id": 95, "id": 108834}, {"user_id": 4212, "stars": [], "topic_id": 5520, "date_created": 1297751996.0062311, "message": "@orenmazor If you plan on plastering Ottawa with ads for a \"pet project\" your going to quickly realize that advertising in the \"real-world\" can be extremely costly. If your project is something that might interest the local demographic or be worth the peoples while, try to get a story about in in some local news papers or even local TV. I know of a few start ups that got great traction in Canada via news stories.", "group_id": 95, "id": 109562}]