[{"user_id": 11626, "stars": [], "topic_id": 6667, "date_created": 1297904372.5512669, "message": "While Homeland Security is busy telling Americans to spy on each other and insisting that domestic extremists are a national security threat, a truck of twelve uniformed Mexican soldiers armed to the teeth brazenly violates national sovereignty to conduct searches of vehicles on U.S. soil.\r\n\r\nThe incursion was captured on surveillance footage taken at the Anzalduas International Bridge. The clip shows at least a dozen armed soldiers in Mexican military uniforms cross into U.S. territory at high speed.\r\n\r\n“The vehicle travels down the bridge toward the U.S. Customs checkpoint. Its driver makes a U-turn just before reaching the lines of cars there. It then starts back south toward Mexico. The men pull over and search a vehicle for a few minutes then resume their trek south,” reports KRGV.\r\n\r\nHaving spent around 10 minutes on U.S. soil conducting an impromptu search of a vehicle, including a search of the trunk of the car, the soldiers head back to Mexico.\r\n\r\nThe car that was searched then also heads south, confirming that it was traveling from the United States into Mexico, and raising the possibility that the Mexican soldiers had targeting American citizens for the search, not to mention the fact that they were agents of a foreign power exercising law enforcement duties inside the U.S., which would normally be sufficient to cause an international diplomatic spat in any other country.\r\n\r\nHowever, when KRGV interviewed Chief Leo Longoria of the Mission Police Department, he defended the Mexican soldiers by saying they might have been unsure that they were crossing into the United States, before stating “we applaud their efforts”.\r\n\r\nLongoria politely asked the soldiers to “coordinate those approaches, particularly coming into the United States,” failing completely to acknowledge that the action was an illegal violation of U.S. sovereignty.\r\n\r\n    * A d v e r t i s e m e n t\r\n    *\r\n\r\nDespite the video footage clearly documenting the fact that the Mexican troops crossed into U.S. territory, Mexican authorities lied to KRGV by insisting it didn’t happen.\r\n\r\nThis is by no means the first time that the Mexican military has violated the U.S. border to conduct operations on American soil.\r\n\r\nOn March 10 last year, residents of Falcon Heights, a south Texas border town, saw a Mexican helicopter hovering over a house shortly after 6pm. The chopper conducted surveillance for about 15 minutes before flying back to Mexico.\r\n\r\n“They had armored individuals in the chopper, open ramp, very military looking, in style and preparation,” said Zapata County Sheriff Sigifredo Gonzalez Jr.\r\n\r\n“It’s proof the Mexican military sees no boundaries,” reported local KRGV News’ Stephanie Stone, adding that the incident wasn’t the first of its kind and wouldn’t be the last.\r\n\r\n“The markings I understand read ‘La Marina’ which is equivalent to the Mexican Navy,” said Gonzalez.\r\n\r\nKRGV contacted nearly a dozen government agencies in an attempt to get answers. After contacting the the FAA about the chopper, KRGV were told to talk to the Customs and Border Protection, who said they knew about the incursion but were apparently unconcerned. State and local authorities refused to return phone calls about the incident after they were also contacted by KRGV.\r\n\r\n“A U.S. Customs and Border Protection spokesman says that a Mexican military helicopter crossed the border into south Texas late Wednesday afternoon before returning to Mexico without landing,” an Associated Press report later confirmed.\r\n\r\nMexican military helicopters invaded U.S. airspace at least three times last year, prompting Texas Congressman Ted Poe to make an official complaint during a speech in front of the House.\r\n\r\n“The Federal Government is MIA on our borders. Our government ought to spend less time protesting States like Arizona, trying to protect their citizens from border violence, and start getting some answers from Mexico about their military helicopters flying into the United States,” said Poe.\r\n\r\nStock up with Fresh Food that lasts with eFoodsDirect (Ad)\r\n\r\nIn 2007, the U.S. Border Patrol warned its agents to look out for Mexican military units crossing into U.S. territory that could pose a threat to their lives.\r\n\r\nhttp://www.infowars.com/mexican-troops-conduct-vehicle-search-on-u-s-soil", "group_id": 3920, "id": 127718}]