[{"user_id": 13543, "stars": [], "topic_id": 21797, "date_created": 1303997642.4122341, "message": "I'll be travelling to San Francisco (from the UK) in August this year on my Honeymoon and am thinking about getting a new Macbook Air from an Apple Store there. The UK price for the model I want is about $2568 (£1540), whereas the US price is $1799 (£1078).", "group_id": 1295, "id": 841025}, {"user_id": 13543, "stars": [], "topic_id": 21797, "date_created": 1303997761.5915489, "message": "What do I need to think about regarding local sales tax, or possibly paying duty when I come back? I know sales tax is 8.5%, but will this be charges at POS as I'm a visitor? Will I have to declare this to customs or can I get through without worrying? Even paying VAT (20%) it would be cheaper than buying in the UK.", "group_id": 1295, "id": 841072}, {"user_id": 30354, "stars": [{"date_created": 1304006108.3492241, "user_id": 141}], "topic_id": 21797, "date_created": 1303999155.331979, "message": "Hypothetically if I bought a MBA in the US and bought it back to the UK I think I could walk right through customs as long as I left the box and the charger in the USA; so that I had plausible deniability. Cough cough. I did not do this with a 64GB iPad. Cough.", "group_id": 1295, "id": 841447}, {"user_id": 22060, "stars": [], "topic_id": 21797, "date_created": 1304009259.3613999, "message": "Remove from box and hide receipt. You will be fine. Price doesn't include tax but it's still cheaper. If you wanna take a trip to Portland there is no sales tax.", "group_id": 1295, "id": 843507}, {"user_id": 18780, "stars": [], "topic_id": 21797, "date_created": 1304023891.8532109, "message": "Like  @chrisonhismac  said, just leave the box in the states and you'll be fine. I did the same 2 years ago and got my MacBook from San Francisco to Chile without problems.", "group_id": 1295, "id": 847134}, {"user_id": 23385, "stars": [], "topic_id": 21797, "date_created": 1304031341.726702, "message": "@Lloyd LMAO", "group_id": 1295, "id": 848157}, {"user_id": 12346, "stars": [], "topic_id": 21797, "date_created": 1304053366.495662, "message": "Why would you have to leave the charger in the US? Without a charger, a laptop is basically useless. Was it a miss-typing?", "group_id": 1295, "id": 851979}, {"user_id": 23385, "stars": [], "topic_id": 21797, "date_created": 1304060424.6104441, "message": "@apfeljonas different voltage", "group_id": 1295, "id": 852834}, {"user_id": 31119, "stars": [], "topic_id": 21797, "date_created": 1304069349.4817121, "message": "@marle no, there is no problem with the charger, it cans work under different voltage, it's a transformer, you can input from 100Volts to 240Volts (50Hz or 60Hz), the output will be quite the same. The only difference may be the connector, but you can change it easily and it's cheap.", "group_id": 1295, "id": 854009}, {"user_id": 12709, "stars": [], "topic_id": 21797, "date_created": 1304075134.241359, "message": "I'm not sure how US tax system works, but in Aus you can claim back the GST (10%) at the airport. I did this when I bought my iPad. Bought it here in Aus (strong AUD$ meant it was pretty cheap), then I claimed back the GST as I flew to wwdc. Saved $100 or so off the 64GB 3G ;p.", "group_id": 1295, "id": 854431}, {"user_id": 12709, "stars": [], "topic_id": 21797, "date_created": 1304075214.584655, "message": "Also, the MacBook chargers have a transformer in, so work pretty much everywhere. You just need to buy the correct duckhead / cable for it.", "group_id": 1295, "id": 854436}]