[{"user_id": 11626, "stars": [], "topic_id": 8697, "date_created": 1298531495.894707, "message": "Store tactical military data on distributed servers, accessible through networked computers or mobile devices? Ask most officers about cloud computing and they’ll look at you patronizingly and say: Yes, Google Docs is nice, but it’s not secure enough for our secrets. (I write from experience.) But Darpa’s new budget shows that it wants the military all the way up into the cloud, and plans to set up mobile wireless hotspots so troops can reach the cloud from the most connectivity-forsaken places.\r\n\r\nAppropriately, the goal of getting big data files to troops on the move in the middle of nowhere is, well, distributed between two new programs from the Pentagon’s blue-sky researchers. Cloud to the Edge looks to essentially ape Google’s tools (other than search) to create a military cloud. And Mobile Hot Spots wants to carry connectivity anywhere troops need to share those big data files.\r\n\r\nWherever the military goes, it brings bandwidth with it. But it’s easier to set up networks around big bases than it is to have them follow troops in the field, especially if those troops have to send or receive large data packets, like video from drones overhead. Some companies are combating the problem by mounting cell towers under the bellies of drones, beaming connectivity below.\r\n\r\nMobile Hot Spots is Darpa’s way to even out what it calls the “100-1000x mismatch of data needs and available network capacity.” Starting out with a $10 million request to Congress, it looks to “create high-capacity and secure wireless technologies by exploiting advances in high-frequency and new security paradigms using RF, millimeter wave (MMW) and/or optical transmission.” If approved, it’ll spend its first year of life developing hardware and network architecture for the mission. And it’s considering going the under-drone route, proposing to “explore hardware, software, and waveform options to include unmanned aerial systems, soldiers, and mobile platforms connected into network topologies.”\r\n\r\nThen there’s the place where the data carried over those networks will reside. Cloud to the Edge has no problem distributing that around through the ether. Unlike Mobile Hot Spots, it’s not even asking for money yet — perhaps because what it’s proposing is so ambitious it first needs to see about feasibility. Not only will it store data in “distributed servers and advanced networking and information database technologies,” it seeks to minimize human interaction in retrieving the data, “autonomously seek[ing] out relevant information and mov[ing] it to where it is needed in a timely and assured manner.”\r\n\r\nThe budget proposal doesn’t give any hint about how it’ll do that yet, proposing for now just to study “information flow patterns through the regional and localized network” and write software for “distributed data dissemination.”\r\n\r\nNeither does Darpa explain how to keep its Cloud secure. Instead, it flips the security question back around, asserting that the “current centralized or regional storage and dissemination of information presents security, reliability, and capacity challenges in identifying and getting relevant information to users at the edge.”\r\n\r\nAt a time when Special Operations Forces are turning to Android-powered tablets to read their data in the middle of nowhere, Darpa looks to be focused on setting up the supporting infrastructure that lets U.S. troops access more information in more remote areas. It might not be Google Docs. But it’s something.\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/AFpanel.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/pentagon-cloud/", "group_id": 3920, "id": 195861}]