[{"user_id": 17517, "stars": [], "topic_id": 13952, "date_created": 1300540137.346241, "message": "La idea es que ustedes también se presenten y nos comenten a todos a que se dedican y cual es su campo de acción laboral.", "group_id": 7153, "id": 388201}, {"user_id": 17517, "stars": [], "topic_id": 13952, "date_created": 1300540070.617605, "message": "Hola compañeros, es un verdadero placer poder presentarme, para los que no me conocen me llamo Javier Sneider Bautista, soy comunicador social, trabajando con el tema de inclusión digital hace 6 años, hace 2 años lo hago en la academia como tutor de la UNAD en", "group_id": 7153, "id": 388198}, {"user_id": 22846, "stars": [], "topic_id": 13952, "date_created": 1300541705.239651, "message": "Reportandome! Jorge Gómez Triana, Arquitecto, dedicado la agricultura, y de vez en cuando al diseño+construccion.", "group_id": 7153, "id": 388329}, {"user_id": 22792, "stars": [], "topic_id": 13952, "date_created": 1300561029.6225431, "message": "HELLO...My name is Víctor Espinosa,I am twenty two years old,I am student,my phone number is 312-434-Callme-Please. My favorite sport is footballl,my favorite color is purple, my favorite actress is Ana Victoria Beltrán, my group favorite is La Tigresa del Oriente, my favorite movie is Titanic. Thanks.", "group_id": 7153, "id": 389115}, {"user_id": 22913, "stars": [], "topic_id": 13952, "date_created": 1300582375.245733, "message": "Rodrigo Castro, experto en Hardware, aficionado desde hace más de 3 años a la web 2.0. Bienvenidos a todos y gracias por incluirme.", "group_id": 7153, "id": 390046}, {"user_id": 22998, "stars": [], "topic_id": 13952, "date_created": 1300640566.069114, "message": "Mi nombre es Angélica Gómez soy comunicadora social con una inherente facilidad para las relaciones públicas y sociales, mantengo una respetuosa y solidaiia relación con los periodistas y medios de comunicación locales y algunos nacionales.", "group_id": 7153, "id": 392704}, {"user_id": 23166, "stars": [], "topic_id": 13952, "date_created": 1300717009.1638751, "message": "Un saludo para todos, soy Angela Pinzón administradora de empresas y fotógrafa, la verdad más lo segundo que lo primero. Vivo fuera de Boyacá hace mas de 12 años pero siempre busco mantener un vínculo con la tierrita, cuenten conmigo para desarrollar acciones propositivas y para un tinto también.", "group_id": 7153, "id": 398300}, {"user_id": 20876, "stars": [], "topic_id": 13952, "date_created": 1300760170.5377779, "message": "Soy Aura Mercedes Bautista Poveda @aumebapo, enamorada de la TIC y de la Pedagogía, me desempeño como Directora de Núcleo Educativo Provincial; oriento programas  en 18 Instituciones Educativas oficiales y 16 privadas de la Provincia del Tundama, Boyacá.", "group_id": 7153, "id": 404435}, {"user_id": 25252, "stars": [], "topic_id": 13952, "date_created": 1301067372.2061789, "message": "Hola, Mi nombre es Jaime López, vivo en Sogamoso, soy Administrador de Empresas, y Diseñador Web y junto a mi socio @favarcar, formamos SEIFI (www.seificol.com), Aca estaremos para apoyar este grupo con Toda la Buena Energia.", "group_id": 7153, "id": 439471}, {"user_id": 28127, "stars": [], "topic_id": 13952, "date_created": 1304683909.1125309, "message": "Buen día TuiterosBoyaca, Mi nombre es Carlos González, soy un veterinario que se dedica al marketing vía internet, espero poder aportar y ayudar al crecimiento del grupo, Hasta pronto", "group_id": 7153, "id": 941168}, {"user_id": 17517, "stars": [], "topic_id": 13952, "date_created": 1304696762.145175, "message": "Gracias Carlos, que bueno tenerlo por acá, bienvenido.", "group_id": 7153, "id": 943198}, {"user_id": 22913, "stars": [], "topic_id": 13952, "date_created": 1304708530.0888009, "message": "Bienvenido :D", "group_id": 7153, "id": 944956}, {"user_id": 16580, "stars": [], "topic_id": 13952, "date_created": 1306129442.436322, "message": "Buenas German Danilo Bernal Sanchez mgs en Planeacion Urbana y Regional asesor en temas de Planeacion del desarrollo y ordenamiento territorial. Miembro de grupos de investigación sobre TIC's y desarrollo territorial", "group_id": 7153, "id": 1148728}, {"user_id": 17517, "stars": [], "topic_id": 13952, "date_created": 1306236574.6721289, "message": "Hola German, bienvenido!", "group_id": 7153, "id": 1164996}, {"user_id": 23166, "stars": [], "topic_id": 13952, "date_created": 1306329093.5402761, "message": "Un saludo para todos los que se integran al grupo. Los invito a estar visitando frecuentemente Convore para que se enteren y participen proactivamente de las propuestas que estamos planteando y desarrollando.", "group_id": 7153, "id": 1177477}, {"user_id": 22913, "stars": [], "topic_id": 13952, "date_created": 1306346810.275125, "message": "Ya somos más, saludos a todos :D", "group_id": 7153, "id": 1181712}, {"user_id": 22865, "stars": [], "topic_id": 13952, "date_created": 1306392514.927496, "message": "jum creo que me registre y olvide presentarme por estos lares para quienes no me conocen soy CARLOS Machado  SOY PERIODISTA  trabajo temas de inclusion social desde medios de comunicacion todo lo que es socialmedia y teletrabajo soy pionero en boyaca en espacios enfocados a la participacion de la discapacidad en medios de comunicacion actualmente trabajo en mi propia marca y colaboro como asesor de accesibiliidad de la brigada digital mintic desde los escuadrones de emprendimiento y turismo  especialista en temas de teletrabajo como referente y experto internacional", "group_id": 7153, "id": 1189062}, {"user_id": 23166, "stars": [], "topic_id": 13952, "date_created": 1306413077.2416179, "message": "Que honor contar con expertos internacionales ;)", "group_id": 7153, "id": 1191347}, {"user_id": 22913, "stars": [], "topic_id": 13952, "date_created": 1306501516.104553, "message": "Bienvenido :D", "group_id": 7153, "id": 1204568}, {"user_id": 17517, "stars": [], "topic_id": 13952, "date_created": 1306984605.1039879, "message": "Tenemos a una eminencia en el tema de accesibilidad para personas en situación de discapacidad, es el que necesitamos para unas nuevas propuestas que están en el tintero... Bienvenido Carlos", "group_id": 7153, "id": 1262287}]