[{"user_id": 831, "stars": [], "topic_id": 6060, "date_created": 1297780757.569701, "message": "Well this week's European ties start today.  The silly Spurs are up against Milan.  We have to wait until tomorrow for Barcelona's visit to the Emirates.  What you reckon folks?", "group_id": 858, "id": 111648}, {"user_id": 6225, "stars": [], "topic_id": 6060, "date_created": 1297782141.3466539, "message": "Maybe I'm being over optimistic, but I see Arsenal beating Barca tomorrow by a narrow margin like 2-1. My concern however is the return as I see Barca scoring over both legs and fear we may lose out on aggregate or even worse away goals.", "group_id": 858, "id": 111946}, {"user_id": 831, "stars": [], "topic_id": 6060, "date_created": 1297794715.698688, "message": "@anibe I'm cautiously optimistic. Biggest reason is what Lady Arsenal summed up today http://ladyarse.co.uk/2011/02/tell-me-something-i-dont-know/", "group_id": 858, "id": 113410}, {"user_id": 831, "stars": [], "topic_id": 6060, "date_created": 1297794754.622534, "message": "\"[Last year] The second leg was a nightmare. Starting off so well, we took the lead and then Messi showed up. But, what the score-line, or performance, doesn’t tell you, is about the team we sent over there. Unlike Spurs, who are without (possibly) three players and it’s a ‘crisis’ as they head to Milan, we were without Fabregas, Song, Gallas, Van Persie, and Arshavin. We went to Barcelona and played Silvestre. Silvestre! Our bench consisted of Fabianski, Eboue, Eastmond, Campbell, Traore, Merida, and Eduardo.\n\nEven on their best days, to start a team at the home of the Barcelona Globetrotters which includes Almunia, Silvestre, Denilson, and Bendtner, and to only leave with a three goal deficit is some sort of miracle. This was my preview from last season.\n\nCould Man United do any better out there without Vidic, Fletcher, Scholes, Rooney (on last season’s form) and Nani? What about Chelsea without Terry, Essien, Lampard, Drogba, and Anelka? What if they had practically zero fit first-team players for the bench? You can be dam sure you would hear about it more than you did in the lead up to our match their last season.\"", "group_id": 858, "id": 113419}, {"user_id": 6225, "stars": [], "topic_id": 6060, "date_created": 1297861899.593514, "message": "@uche Yeah LadyArse is right. The team we have now is way better than last year and I'm definitely confident we will get the result tonight. Predicting JD to have a legendary performance too. Let's see the team we take to Barcelona and i'll place my bet.", "group_id": 858, "id": 119556}, {"user_id": 719, "stars": [], "topic_id": 6060, "date_created": 1297897277.6098659, "message": "PARTY TIME! :D", "group_id": 858, "id": 125989}, {"user_id": 831, "stars": [], "topic_id": 6060, "date_created": 1298183239.1878309, "message": "One last bit before turning attention to the FA Cup http://copia.posterous.com/never-mind-back-then-never-mind-that-next-enj", "group_id": 858, "id": 152418}]