[{"user_id": 41694, "stars": [], "topic_id": 46441, "date_created": 1318377145.5001609, "message": "First question: After reading Web-Based Distance Learning Technology: The Impacts of Web Module Length and Format, what do you want to know more about?  Particularly what they would change about the methods of the study to make it more directly relevant to the course that you're designing?", "group_id": 11791, "id": 2328411}, {"user_id": 41694, "stars": [], "topic_id": 46441, "date_created": 1318377162.1458571, "message": "Second question: How pertinent are those results to those who are teaching in the arts & humanities? Do you feel certain disciplines are much more difficult to teach using diagrams, photos, and other visuals? For example, how can we use effective visuals given the more abstract nature of the humanities?", "group_id": 11791, "id": 2328414}, {"user_id": 42226, "stars": [], "topic_id": 46441, "date_created": 1318605865.4462271, "message": "First question: After reading Web-Based Distance Learning Technology: The Impacts of Web Module Length and Format, what do you want to know more about? Particularly what they would change about the methods of the study to make it more directly relevant to the course that you're designing?\nSecond question: How pertinent are those results to those who are teaching in the arts & humanities? Do you feel certain disciplines are much more difficult to teach using diagrams, photos, and other visuals? For example, how can we use effective visuals given the more abstract nature of the humanities? \n\n", "group_id": 11791, "id": 2346749}, {"user_id": 41694, "stars": [], "topic_id": 46441, "date_created": 1318612182.2145121, "message": "Hey, should we open a new discussion just for the synchronous chat?", "group_id": 11791, "id": 2347449}, {"user_id": 42226, "stars": [], "topic_id": 46441, "date_created": 1318612093.4493041, "message": "Welcome to the sychronous discussion. I would like to comment on the second question. I found the article on WBDL interesting and could understand how important the length/format  of modules used as well as the aesthetic design are in making online learning effective. However, I couldn't help but think, okay so how can I bring these results in the course which I am designing which is a much more theoretical/conceptually based course? That requires some thinking and creativity - which I think is probably good.", "group_id": 11791, "id": 2347428}, {"user_id": 41694, "stars": [], "topic_id": 46441, "date_created": 1318612190.83269, "message": "Then everyone could be in the same discussion.", "group_id": 11791, "id": 2347452}, {"user_id": 42226, "stars": [], "topic_id": 46441, "date_created": 1318612563.6843979, "message": "You mean instead of having a group 1 and group 3. if so, yes!!", "group_id": 11791, "id": 2347544}]