[{"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305842022.0584159, "message": "I'm having trouble with \"Cause\"...\n\nI tend to think of \"viruses cause disease\" and get stuck. Is someone's belief that they are a \"lost cause\" on the right track? \"having a cause\" doesn't get me much further because... well, having someone walk the 10K to raise money for cancer research isn't something I'm having much luck generalizing into something I can use...\n\nOn the flip side, \"Effect\" is no better. Like, someone focuses on their lost weight (effect) instead of paying attention to the exercise or paleo-diet they've tried to adopt?", "group_id": 2515, "id": 1117086}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305842267.9239149, "message": "Those are both great examples...if they somehow created problems. How does focusing on the 10K run create problems? How does focusing on the weight create problems?", "group_id": 2515, "id": 1117147}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305843174.2793751, "message": "I don't know! I just sort of pulled those out of a hat.", "group_id": 2515, "id": 1117266}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305844291.5478461, "message": "Thank you, both. \n\nAnd good guess about the context, Chris. It is MC Pr/Sol.", "group_id": 2515, "id": 1117541}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305843997.4870739, "message": "The hardest thing about Dramatica is getting over the idea that the appreciations are subject matter, when in reality they are speaking *about* the subject matter. Impact Character Concern of Memory? Oh yeah, such-and-such remembers some pretty crazy things...yeah, but how does that create problems?", "group_id": 2515, "id": 1117444}, {"user_id": 10814, "stars": [], "topic_id": 36019, "date_created": 1305844025.9282739, "message": "First of all, you must identify the context in which you use Cause.  For example:\n\nMC Problem: Cause -- Amanda was so concerned with her weight that she stopped eating altogether, since she believe eating caused obesity.  This caused life-threatening weight loss.\n\nMC Solution: Effect -- Once Amanda stopped looking at eating as the cause of weight gain and focused her attention of the effects of eating different foods, she found she could eat as many vegetables and other healthy foodstuffs as she wanted.  This had the effect of bringing her up to a healthy weight.", "group_id": 2515, "id": 1117452}, {"user_id": 30287, "stars": [], "topic_id": 36019, "date_created": 1305906542.944823, "message": "@jimhull, as so often happens with Dramatica, something you said made a little light bulb go on in my head. \"Getting over the idea that the appreciations are subject matter, when in reality they are speaking *about* the subject matter.\"  Can you elaborate on that?", "group_id": 2515, "id": 1127157}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305910998.8634551, "message": "I think you've nailed the exact reason I ended up here asking about Cause/Effect in the first place.", "group_id": 2515, "id": 1127915}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305909653.17185, "message": "I'll throw in here, because if nothing else, Jim can correct my misconceptions if I get this wrong.\n\nI'm asking about cause/effect. Having that BE subject matter would have me deriving a plot like this:\n\nErin is in love with John, and wants him to notice her. So, she joins a \"walk for the cause\" event that he organized, and spends Saturday yucking it up with fellow trotters as they walk the 10K. But John doesn't notice her. So she decides to find something more effective, like changing the way she dresses.\n\nBut, having it comment on the story would be something like this:\nErin wants John to notice her, so she joins a an event that he planned. Unfortunately, this *causes* John to think that she is a joiner, willing to do anything, and has no passions of her own -- and he ignores her. Furious about being ignored, Erin goes to her studio and paints a giant mural. Her bad mood vanishes -- an effect of the painting -- and John, who is stopping by to return a gift she'd given him, sees the fire in his eyes and (effect) falls in love with her.", "group_id": 2515, "id": 1127683}, {"user_id": 30951, "stars": [], "topic_id": 36019, "date_created": 1305909401.580466, "message": "Yes, I was interested in that comment as well. Makes sense, but would love elaboration.", "group_id": 2515, "id": 1127647}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305909739.2432721, "message": "(What's going on in the background here is that I'm trying to brainstorm something, and I keep going 'what's an interesting *cause* (or whatever)' instead of saying \"what's an interesting thing this character could be doing\" and then figuring out what that *causes*.)", "group_id": 2515, "id": 1127691}, {"user_id": 30287, "stars": [], "topic_id": 36019, "date_created": 1305910741.3553071, "message": "Okay, I get that.\n\nBut in terms of terminology, \"cause/effect\" is a confusing one because, in theory, we have to think of EVERY element as a cause. Yes, Erin joining the even \"causes\" John to think she is a joiner. But if the MC problem was \"feeling\", and Erin made some mistake with regards to emotions, that would \"cause\" John to think she is a joiner. No matter what the specific element is, it is ALWAYS a cause of the problems. \n\nSo while your example seems to be a \"cause/effect\" element pair, I would say it's closer to \"perception/actuality\".  John's perception of Erin is wrong, and the actuality brings them together.\n\nSo I'm still confused how to make use of \"cause/effect\" as elements in themselves.", "group_id": 2515, "id": 1127878}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305913982.1097641, "message": "Also, context. What's funny is Mike's example shows Cause and Effect as if they were Erin's Problem and Solution (or perhaps Relationship Story), as if she were the MC. Your example of Perception and Actuality is looking at John's Throughline, perhaps as Impact Character, or perhaps as MC in his own story. The context within which to look at these is important because it will color how they are seen.", "group_id": 2515, "id": 1128433}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305914596.6909249, "message": "What takes a rather long time to figure out is that the storyform is telling you what is wrong with your story (in more ways than one! :)) It's saying remembering is a problem, getting something is a problem, overcoming the past is a problem, and dreaming when there is no chance is a problem. The Author still has to figure out how to make these problems \"work\", as they have always done. Dramatica just helps keep their mind straight.", "group_id": 2515, "id": 1128563}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305913835.8531489, "message": "If you're writing a story about the problems with cause and effect, you're writing a story where the character experience difficulty because they are making evaluations based on cause, or making evaluations based on effect. This ties in with the other post on subject matter. These are inequities that find their source within cause or within effect. Taking your viewpoint that we look at every element as a cause for difficulty, then this one particular cause is caused by cause. :)", "group_id": 2515, "id": 1128388}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305915565.8473849, "message": "LOL, flee you dolt.", "group_id": 2515, "id": 1128716}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305915110.5401349, "message": "When things glee, I'd rather be eaten.", "group_id": 2515, "id": 1128660}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305914757.675777, "message": "I'm going to start using a \"template character\" -- a hunter trying to get food -- before I examine anything. \n\nI know what this guy does: he hunts for food. Now I can apply any problem:\nCause: His gunfire causes all the game to flee, leaving him with nothing. \nOR", "group_id": 2515, "id": 1128591}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305914879.671555, "message": "He walks out alone without his gun because it Causes the game to glee...thats when he gets eaten.", "group_id": 2515, "id": 1128615}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305914463.1532061, "message": "As far as the subject matter question goes. Those who look at Dramatica as \"mad-libs\" are looking at it as if the theory is telling you what you should write. As if Memory, Obtaining, The Past and Dream are telling you you should write a story about remembering something, or getting something, or going back in time, or dreaming about better days.", "group_id": 2515, "id": 1128546}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305914855.5755479, "message": "Effect: The effect of hunting is that Erin (she's everywhere!) hates him.\nOR\nProjection: Imagining that he will always live like this, he fails to learn a skill to fall back on when the government re-claims his land.", "group_id": 2515, "id": 1128607}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305914868.9617391, "message": "I started this as sort-of a joke, but I think it might just work!", "group_id": 2515, "id": 1128611}, {"user_id": 7645, "stars": [], "topic_id": 36019, "date_created": 1305914958.866545, "message": "If instead he figured out how to create a silencer (Effect), then he could hunt and still keep his legs!", "group_id": 2515, "id": 1128631}, {"user_id": 7664, "stars": [], "topic_id": 36019, "date_created": 1305915813.0020571, "message": "Too bad. I was looking forward to the song where they devour the hunter.", "group_id": 2515, "id": 1128759}]