[{"user_id": 16719, "stars": [], "topic_id": 32928, "date_created": 1304163359.647176, "message": "I am a developer, wannabe designer. If you handed me a PSD, I can convert the design to HTML/CSS (roughly), but not a wireframe to nice looking HTML/CSS. I have always feared the design process. My question is how do you chose colors, use images, turn a wireframe into nice design. Would you share your web design process? Am i clear on my question? I use Photoshop for general image editing.", "group_id": 182, "id": 867515}, {"user_id": 30354, "stars": [], "topic_id": 32928, "date_created": 1304169098.0331781, "message": "Grab fonts from dafont.com, color palettes from colourlovers.com and find free images to use on Compfight. Hope that helped, happy to answer any design-specific questions if you DM me.", "group_id": 182, "id": 867932}, {"user_id": 30354, "stars": [{"date_created": 1304277015.4335051, "user_id": 16719}], "topic_id": 32928, "date_created": 1304168778.0162389, "message": "I'm going to sound a bit dodgy here; but I started off by copying and modifying designs that were similar to how I wanted them. Over time you learn what works and what doesn't, it comes second nature to you. Then over time you switch from copying palettes and layouts etc to copying specific ideas - this stroke on that button, this dropshadow on text like this.. bla bla  bla. Until eventually you've built up an arsenal of things you KNOW work well within a site because you've been replicating, and you'll be able to nail any design.", "group_id": 182, "id": 867897}, {"user_id": 30354, "stars": [{"date_created": 1307728303.454227, "user_id": 30289}], "topic_id": 32928, "date_created": 1304168986.6900859, "message": "In terms of layout.. I dunno, you can never be right with layout but you can be wrong. It's not a bad idea to try things out, especially these days - web devsigners are in a constant race to see who can build the coolest things with the coolest technologies and the coolest new concepts. It's okay to try things out and be wrong, just don't forget that.", "group_id": 182, "id": 867919}, {"user_id": 30354, "stars": [], "topic_id": 32928, "date_created": 1304168909.866116, "message": "In terms of design process.. draw and draw and draw. I'd suggest that you find some cool looking layer styles online, and learn how to use them - it'll save you time and you'll be able to create more polished looking buttons etc - plus by tweaking the styles individually you can learn more about how they work and why.", "group_id": 182, "id": 867911}, {"user_id": 16719, "stars": [], "topic_id": 32928, "date_created": 1304276980.3052869, "message": "@Lloyd thanks.. i will keep your suggestions in mind on my next design attempt. thanks a lot", "group_id": 182, "id": 877336}, {"user_id": 15652, "stars": [], "topic_id": 32928, "date_created": 1304345568.1504719, "message": "@Lloyd, this was an awesomely detailed response. Thanks.", "group_id": 182, "id": 883388}]