[{"user_id": 11626, "stars": [], "topic_id": 7439, "date_created": 1298102199.6600709, "message": "http://www.henrymakow.com/facebook-CIA.gif\r\n\r\nhttp://www.henrymakow.com/google-nsa-665.jpg\r\n\r\nIn the case of both Google and Facebook, three talented students in their 20's came out of obscurity to establish multi-billion dollar enterprises. Do you suppose they had some help?\r\n\r\nBY SANDEEP PARWAGA\r\n(FOR HENRYMAKOW.COM)\r\n\r\nThere used to be a saying: ''No one makes a name for himself without giving something up''\r\n\r\nAs a youngster, I was awed by people who ''made it to the top'' by creating and innovating corporations, technologies, or simply establishing themselves through sports, music, entertainment, etc. thus becoming millionaires.\r\n\r\nNow as I have grown older, I realize how illusory this paradigm really is. I came to the conclusion that if you want to reach the ''top',' you have to give up your soul. \r\n\r\nTake Mark Zuckerberg for example. He is one of the most ''successful entrepreneurs'' in the last decade. Having made a fortune through his Facebook empire, he reaches more than 500 million people worldwide. It seems like a fairytale. A student creates a new interface to connect the people throughout the world. Well, it sounds great doesn't it? It would, if we were true. \r\n\r\nHere is a good video that demonstrates that Facebook was indirectly funded by the CIA with the goal of learning and storing everything there is to know about you. Why? To monitor and ultimately control.  \r\n\r\nAgain, the people have been totally duped by the Facebook-mania and can only see what they are told to see. As my friends say: ''It is to connect people and share information''. In the wake of the recent crisis in Egypt, we might add that Facebook has become not just a data-mining operation, but also a soft power proxy for crisis-creation.\r\n\r\nLet's look at headlines that should cast no doubt about the true character of CIAbook:\r\n\r\nFacebook's Zuckerberg Says The Age of Privacy is Over -\r\n\r\nFacebook's Mark Zuckerberg says privacy is no longer a 'social norm'\r\n\r\nFacebook - the CIA conspiracy\r\n\r\nThe Face of Facebook -  (Pay particular notice to the IMs that got leaked and confirmed to be true by the New Yorker)\r\n\r\nFacebook & Social Media: A Convenient Cover For Spying -\r\n\r\nUS spies invest in internet monitoring technology - Quoted from this article: ''In an attempt to sift through the blizzard of information, the investment arm of the CIA, In-Q-Tel, has invested in a software firm that monitors social media.''\r\n\r\nNihilists of The World Unite: Wikileaks Is The \"Cognitive Infiltration\" Operation Demanded by Cass Sunstein -\r\n\r\nTIME Mag Person of the Year 2010 - This link is just a mere reminder of past history and the perversion of ''honoring''those who don't deserve it. Would you like to share this front cover with Hitler, Stalin, Kissinger, etc.? I sure wouldn't. Obviously Zuckerberg has done something ''great''. Just my 2 cents about this garbage.\r\n\r\nGoogle has come under scrutiny over its attempt to eliminate competing search engines and block ''controversial'' sites and people, but the biggest controversy came over its alleged ties to the CIA and NSA.\r\n\r\nGoogle founders Sergey M. Brin and Lawrence E. Page are portrayed as average folks, Stanford University students, who teamed up to create a ''superior search engine''. Their attempt to do just that turned out to be so successful that they started to get funding from big players, for example Sun Microsystems. (http://en.wikipedia.org/wiki/Sergey_Brin#Search_engine_development)\r\n\r\nIt can be assumed that the CIA and NSA funded them as well. As in the above example of Facebook, don't forget the Google scandal connected to China last year, where Google simply evaded censorship laws by moving to Hong Kong.\r\n\r\nThe CIA might have used Google as a soft power proxy in China as well for destabilization operations. Here are a few issues that made the news regarding Google:\r\n\r\nTarpley: US Gov uses Google proxy to attack China - (Vid)\r\n\r\nGoogle-NSA collaboration draws alarm -\r\n\r\nYouTube's Parent Google is a Corporate Member of the Council on Foreign Relations -\r\n\r\nEx-Agent: CIA Seed Money Helped Launch Google -\r\n\r\nThe Google-NSA Alliance: Questions and Answers -\r\n\r\nCONCLUSION\r\n\r\nI admit I have Facebook. I am not particularly happy about it, but it does facilitate being connected with friends from other places. I try to keep a low profile. Don't reveal anything or don't click on trivial buttons, for example the ''Likes''.\r\n\r\nUse alternatives to make contact if you can, e.g. email or other messengers. If you have Facebook, you have probably realized how people have literally sold their lives over to it.\r\n\r\nEvery time I see people revealing things to the finest detail, they don't think about any consequences, or let's say, they are not smart enough to care. The scientific dictatorship has done a ''good'' job in brainwashing and manipulating the masses. Don't be fooled by the deceit. The mainstream media has been very reluctant to cover the disturbing Google/Facebook ties as it would expose important assets for the Big Brother machine and its secret use to destabilize.\r\n\r\n Zuckerberg or the Google founders would never have gotten the publicity, wealth and success without a CIA or NSA  connection. To elaborate on the opening quote, I assume they have been initiated into the Illuminati Order and sold their soul. \r\n\r\nhttp://www.henrymakow.com/social_networking_dupes_the_ma.html", "group_id": 3920, "id": 149056}]