[{"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308743707.446749, "message": "Yes....I know...another new topic, but I've been reading 1 Samuel and each day I'm finding bits that I thought I might share.", "group_id": 9787, "id": 1456295}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308744390.1698971, "message": "1 Sam 5 & 6 - I won't quote it all here, go read it yourself!\n\nMy summary:\nThe Philistine take the Ark of the Covenant and put it in their temple next to the statue of their god Dagon.\nDagon ends up on his face\nAnd then Dagon ends up on his face again with hands and head cut off and those lying on the threshold\nThen they move the Ark around and wherever it stays people suffer from boils\nEventually they put it on a cart and devise a test to see if it is God doing all this. If the cart goes to Beth-shemesh on it's own then it is God. If not, it is coincidence.\nWell, the 2 cows pull the cart all the way to Beth-shemeth on their own.\n\nNow after all this miraculous revelation of God's power, what do the Philistines do?\nDo they turn to God? No", "group_id": 9787, "id": 1456395}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308743943.4401929, "message": "\"As she continued praying before the LORD, Eli observed her mouth. Hannah was speaking in her heart; only her lips moved, and her voice was not heard. Therefore Eli took her to be a drunken woman. And Eli said to her, \"How long will you go on being drunk? Put your wine away from you.\" But Hannah answered, \"No, my lord, I am a woman troubled in spirit. I have drunk neither wine nor strong drink, but I have been pouring out my soul before the LORD. Do not regard your servant as a worthless woman, for all along I have been speaking out of my great anxiety and vexation.\" 1 Sam 1:12-16\n\nI am saddened by the state of our visible prayer lives. How often is it that we seek the Lord in such a state, crying out to him in anguish, so much that people think we're drunk or disturbed? I've sat in so many prayer meetings, praying for the lost of nations and for the persecuted... in monotone.... :(", "group_id": 9787, "id": 1456334}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308744461.5050859, "message": "Do they stop worshiping Dagon? No\nTheir priest still consider Dagon so holy that from then on they never step on the threshold of their temple...\n\nSo, what value is miracles against the stubbornness of man?", "group_id": 9787, "id": 1456411}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308744108.6909211, "message": "\"And I declare to him(Eli) that I am about to punish his house forever, for the iniquity that he knew, because his sons were blaspheming God, and he did not restrain them. Therefore I swear to the house of Eli that the iniquity of Eli’s house shall not be atoned for by sacrifice or offering forever.\" 1 Sam 3:13-14\n\nI raised this elsewhere, but add it here again for completeness; the question of the limits of God's Grace.", "group_id": 9787, "id": 1456350}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308744594.4872861, "message": "And now on to today's...", "group_id": 9787, "id": 1456419}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308744832.9708531, "message": "\"So they gathered at Mizpah and drew water and poured it out before the LORD and fasted on that day and said there, \"We have sinned against the LORD.\" And Samuel judged the people of Israel at Mizpah.\" 1 Sam 7:6\n\nDo we know that Samuel the prophet was also Samuel the judge. I'm trying to figure out what it means that Samuel judges Israel. This is used multiple times in 1 Samuel 7.\n\nAnyone want to try an explanation?", "group_id": 9787, "id": 1456452}, {"user_id": 32888, "stars": [], "topic_id": 40102, "date_created": 1308763422.5891581, "message": "wesleys full verses notes follow1; Samuel 7:6  Poured it out - As an external sign, whereby they testified, both their own filthiness and need of washing by the grace and Spirit of God, and blood of the covenant, and their sincere desire to pour out their hearts before the Lord, in true repentance, and to cleanse themselves from all filthiness of flesh and spirit. Before the Lord - That is, in the public assembly, where God is in a special manner present. Judged - That is, governed them, reformed all abuses against God or man, took care that the laws of God should be observed, and wilful transgressions punished.", "group_id": 9787, "id": 1458730}, {"user_id": 32888, "stars": [], "topic_id": 40102, "date_created": 1308763375.4233019, "message": "Wesley explains it like this;  Judged - That is, governed them, reformed all abuses against God or man, took care that the laws of God should be observed, and wilful transgressions punished.", "group_id": 9787, "id": 1458724}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308828142.5812421, "message": "So by Wesley's definition our Director judged us this morning at our prayer meeting. Awesome.", "group_id": 9787, "id": 1465185}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308828448.124249, "message": "1 Samuel 8: Israel demands a king.\n\nI can't avoid the whole predestination issue here. So what was God's will? The people demand a king so that they can be like anyone else. It could be said, based on God's response via Samuel that God's will was different for them. But God submits(?) to their demands...\n\nSo Israel gets their way against God's will.\n\nAnd this way leads to David.....and the whole royal line leading to Jesus, which was a necessary part of identifying the Messiah..... Like David sinning with Bethsheba producing Solomon in the line of Jesus this again illustrates how complex God's will is!", "group_id": 9787, "id": 1465198}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1308914948.160728, "message": "1 Samuel 9: Introducing Saul\n\nSaul's good looks seemed to play a big role in his selection as king - look how well THAT worked out. How much do we emphasize outward appearance?", "group_id": 9787, "id": 1475706}, {"user_id": 32900, "stars": [], "topic_id": 40102, "date_created": 1309431655.413825, "message": "Saul the coward:\nSo in 1 Samuel 9, Samuel anoints Saul. God has chosen him as king and gives the promise that he will deliver Israel from the Philistines.\nThen we find Saul hiding amongst the baggage in 1 Samuel 10, when Samuel wants to introduce him to the people. Not a very courageous guy!\nSamuel gives a long story to Saul about how God will give him a new heart, I guess one of courage? Which seems to work because Saul does a bang-up job of uniting Israel and killing the Philistine in 1 Samuel 11.\n\nThen after all this Saul falls flat on his face in 1 Samuel 12. Is this a result of his new found courage? Has it bred impatience. He forgets that it's God who did the work and he tries to do his own thing. Instead of waiting for Samuel he tries to offer sacrifices himself. Sacrifices are not what God wants. He wants obedience. Saul took what God had given him and abused it...\n\nMakes me wonder how many times I've set off to do my own thing because I've been impatient with god, because I want things NOW!", "group_id": 9787, "id": 1527074}, {"user_id": 32888, "stars": [], "topic_id": 40102, "date_created": 1309495645.32566, "message": "take your convicting questions elsewhere dude. I want comfort, ok? thanks.", "group_id": 9787, "id": 1537557}]