[{"user_id": 2946, "stars": [], "topic_id": 43136, "date_created": 1312264868.0393219, "message": "Imagino que contpaq es prohibitivo (a mi me parece infernalmente feo y horriblemente caro), pero no conozco alternativas opensource.  En español es preferente, por aquello de la mano de obra abrata :P", "group_id": 965, "id": 1772956}, {"user_id": 37911, "stars": [], "topic_id": 43136, "date_created": 1312294952.526217, "message": "Contpaq es una solución modular y los precios se ajustan a las necesidades, no es necesariamente caro, además la mejor ventaja que tiene, es que siempre están al día con las actualizaciones del SAT... cosa que es muy difícil que una solución OpenSource te ofrezca..\n\nBueno, en cuanto a las soluciones OpenSource, que yo sepa no existe ningúna tan completa, hace poco desa\u007frrollé un ERP para una empresa desde cero y estuve investigando aplicaciones OpenSource antes de hacerlo, encontréde las mejorcitas y mas completas que encontre esta EdgeERP/webERP que tienen también una interfáz de usuario espantosa, pero cuenta con muchos conceptos y funciones..\n\nLa mayoría de las veces es mejor definir cuales son las necesidades exactamente y desarrollarla desde cero, ya que la mayoría de los ERPs estan sobrados..", "group_id": 965, "id": 1775166}, {"user_id": 37911, "stars": [], "topic_id": 43136, "date_created": 1312295080.359442, "message": "Me parece que la estructura de la base de datos de EdgeERP/webERP es muy completa, algún interesado en iniciar un proyecto OpenSource en Español a partir de este schema?' yo desarrollo en cakePHP y MySQL, actualmente tengo tiempo disponible y estoy dispuesto a poner a disposición un servidor de desarrollo así como un repositorio de SVN.., sería ideal incluir facturación electrónica.. me hace falta ya sea un programador más o un diseñador para los views... alguien se anima?'", "group_id": 965, "id": 1775179}, {"user_id": 12133, "stars": [], "topic_id": 43136, "date_created": 1312296992.745126, "message": "el openerp tiene su implementacion para mexico y tiene soporte para factura electronica.", "group_id": 965, "id": 1775452}, {"user_id": 12133, "stars": [], "topic_id": 43136, "date_created": 1312296994.1325569, "message": "o algo asi", "group_id": 965, "id": 1775453}, {"user_id": 12133, "stars": [], "topic_id": 43136, "date_created": 1312297019.0586629, "message": "ahora te recomiendo www.tryton.org es un erp simple sencillo y muy estable", "group_id": 965, "id": 1775460}, {"user_id": 2946, "stars": [], "topic_id": 43136, "date_created": 1312348367.2632771, "message": "\"Tryton\nTryton is a three-tiers high-level general purpose application platform under the license GPL-3 written in Python and using PostgreSQL as database engine.\nIt is the core base of a complete business solution providing modularity, scalability and security.\" Whaaa? Jargon too much.", "group_id": 965, "id": 1782303}, {"user_id": 26638, "stars": [], "topic_id": 43136, "date_created": 1312417310.4137101, "message": "@netors Nosotros hemos estado discutiendo una app sobre este tema, aunque más hacia pop que hacia contabilidad, somos diseñadores con experiencia amplia", "group_id": 965, "id": 1789616}, {"user_id": 35000, "stars": [], "topic_id": 43136, "date_created": 1312866551.204942, "message": "Depende del tipo de operacion que tengas, pero existe openbravo.com", "group_id": 965, "id": 1828559}, {"user_id": 40418, "stars": [], "topic_id": 43136, "date_created": 1314664604.6289189, "message": "OpenERP.com es un producto mucho mejor desarrollado que Aspel o Contpaq, puedes llevar toda la parte contable sin problemas (si el módulo para México no se ajusta al 100% se puede tomar de base). En cuanto a los reportes del SAT nosotros lo hemos hecho modificando los reportes por default, de verdad es un producto que te recomiendo checar, su crecimiento a nivel mundial lo dice todo.", "group_id": 965, "id": 1998073}, {"user_id": 36952, "stars": [], "topic_id": 43136, "date_created": 1316713173.502043, "message": "el año pasado conoci a los creadores de WAM y realmente es una promesa muy interesante http://www.ready2fill.com/", "group_id": 965, "id": 2190134}, {"user_id": 26089, "stars": [], "topic_id": 43136, "date_created": 1316824541.557987, "message": "Hola @soska, que de la parte \"Administrativa\"? en mi empresa optamos por mejor contratar un buffete de contadores para llevarnos esa parte. Hasta ahora nos ha funcionado muy bien y realmente nos ayuda en no preocuparnos por ese detalle, tampoco ha sido caro.", "group_id": 965, "id": 2200325}, {"user_id": 20146, "stars": [], "topic_id": 43136, "date_created": 1316870595.774771, "message": "@JoseJimenez Sí yo personalmente he seguido el trabajo de read2Fill de echo es una empresa Oaxaqueña, ganaron el premio 2009 de inovación,  son muy buenos haciendo su trabajo, se adaptan rápidamente a requerimientos del mercado Mexicano(p.e. la facturación electrónica la fueron desarrollando conforme se dieron las especificaciones legales), sólo pagas por el servicio (approx) 500 al mes que es bastante accesible, el cofundador es un amigo muy apegado al Software Libre Angel Reyes (valedor también de sandino q x aqui antes ya lo habian mencionado) le pueden preguntar cualquier cosa via twitter (@angelreyes) seguro les contesta, suerte.", "group_id": 965, "id": 2202939}]