[{"user_id": 1101, "stars": [], "topic_id": 44988, "date_created": 1315412442.3993831, "message": "Ouch, parser messed some whitespace :( Sorry.", "group_id": 160, "id": 2068718}, {"user_id": 1101, "stars": [], "topic_id": 44988, "date_created": 1315412345.7009261, "message": "There is an app I need to develop which runs as a popup in windows web wrapper. The whole required structure of data <-> interactivity calls for the use of Backbone. However, there is no RESTful API or anything webby for that matter. There is a certain `window.external` object, that has a method to retrieve data (as string, needs custom parsing) and a method to push the data (again, as custom ugly string).\n\nSo, let's say that to retrieve the data that can then be parsed to become set of models I will call: `var models = window.external.pull()` and in order to save models, I'd call `window.external.push( models.customToString() );`", "group_id": 160, "id": 2068708}, {"user_id": 1101, "stars": [], "topic_id": 44988, "date_created": 1315412446.3819089, "message": "My question is how would I rewrite the Backbone.sync in order to let Model and Collection to still use the Backbone API?", "group_id": 160, "id": 2068719}, {"user_id": 23244, "stars": [], "topic_id": 44988, "date_created": 1315454798.247309, "message": "I'd make special Model and Collection subclasses and check for those in Backbone.sync to select code path.", "group_id": 160, "id": 2073364}, {"user_id": 23244, "stars": [], "topic_id": 44988, "date_created": 1315454930.2494061, "message": "The actual syncing should be pretty straightforward. Construct the ugly string and do the save/fetch and then call the success or error functions accordingly", "group_id": 160, "id": 2073370}, {"user_id": 41744, "stars": [], "topic_id": 44988, "date_created": 1317509297.2043729, "message": "Here's another approach I'm considering for a similar need I have: make base \"classes\" of Model and Collection and override their sync to delegate to some facade(s), those facades can then decide how to adapt the CRUD invocations to the service tier per model type and/or model type + collection type; I havent anything working to show yet, though; 'hth", "group_id": 160, "id": 2257050}]