[{"user_id": 7463, "stars": [], "topic_id": 9267, "date_created": 1298742662.6724191, "message": "Let's use this as a discussion area for the new site... thoughts?", "group_id": 5192, "id": 215027}, {"user_id": 3348, "stars": [], "topic_id": 9267, "date_created": 1298928902.1241369, "message": "could try making this link more prominent :)", "group_id": 5192, "id": 229701}, {"user_id": 3348, "stars": [], "topic_id": 9267, "date_created": 1298928912.9262519, "message": "looks great man, really interesting idea", "group_id": 5192, "id": 229702}, {"user_id": 3348, "stars": [], "topic_id": 9267, "date_created": 1298929273.886138, "message": "Would it be OTT/cheesy to have the contribute UI inline under the current argument?", "group_id": 5192, "id": 229732}, {"user_id": 7463, "stars": [], "topic_id": 9267, "date_created": 1298933071.207304, "message": "Hi Keeran - yes you're probably right! I'll make it a little larger. Was considering sticky at the top of the page. Contribute is there if you're logged in, but I could do something like \"Sign in to contribute\" there... actually let's just do that now.", "group_id": 5192, "id": 230037}, {"user_id": 7463, "stars": [], "topic_id": 9267, "date_created": 1298934905.574909, "message": "Okay - I've added that and now I'm just looking for some nice icons before I put it live...", "group_id": 5192, "id": 230198}, {"user_id": 19564, "stars": [], "topic_id": 9267, "date_created": 1299580856.06181, "message": "The back button takes you out of the site - any way of making it take you back a step?", "group_id": 5192, "id": 295242}, {"user_id": 7463, "stars": [], "topic_id": 9267, "date_created": 1299654186.9713831, "message": "Thanks Paul - I'll update the hash on the debate page, shouldn't be a problem!", "group_id": 5192, "id": 302403}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300823505.4480331, "message": "Broken for me, for creating a debate, on MSIE (\"error on page\") and Firefox (\"start your debate\" button yields a blank page)\r\nWhich is frustrating, after I've filled in all the info.", "group_id": 5192, "id": 411066}, {"user_id": 7463, "stars": [], "topic_id": 9267, "date_created": 1300868205.2175291, "message": "@ahaynes ah. I've had a few small errors with IE, and it sounds like you've run into one. Firefox I'm a little confused about because I've built the site to work well in Chrome, Safari, Firefox and am not able to reproduce the error here. If you've created a public Wrangl you should see a link to it on the home page, which should at least get you going again...", "group_id": 5192, "id": 415373}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300914579.4585409, "message": "It worked just now (FF); I use NoScript (but enable stuff as needed); perhaps I hadn't enabled the right \"blocked object\"...?", "group_id": 5192, "id": 420903}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300935802.892309, "message": "This is good... but could we have arrows please, in the link between argument and counterargument?  When the arguments start flying, you can't see in which direction.  (http://wrangl.com/isclimatescienceusable)", "group_id": 5192, "id": 423533}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300939586.7857771, "message": "In the top-level \"for\" and \"against\" summaries, I'd like the \"Against\" to start on a new line below the \"for\" text (while having both \"for\" and \"against\" summaries visible), but haven't been able to make this happen.", "group_id": 5192, "id": 423934}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300939452.4127891, "message": "...or maybe not arrows; maybe have the line that's going to a \"response\" counterargument sprout from lower down in the box.", "group_id": 5192, "id": 423923}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300940582.7692399, "message": "\"import\" and \"export\" capabilities & formats?  (import, to pull these in: skepticalscience.com/argument.php )", "group_id": 5192, "id": 423989}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300940831.3142071, "message": "... plus import&export might facilitate more editing flexibility, e.g. allow splitting a compound argument into multiple ones, when it already has counterarguments.", "group_id": 5192, "id": 424015}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300940887.3267989, "message": "p.s. something I forgot to mention - THANK YOU.", "group_id": 5192, "id": 424028}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300943974.7737229, "message": "A structural issue, IMO the logic isn't quite captured yet: maybe a 3rd arg type, \"supporting argument\"?  Say the top-level argument is \"People do Q, since they think that if notQ, then X and Y\";\r\nits counterarguments are \"notQ and not X\", \"notQ and not Y\". Wrangl lets me do all these.  But there's also [purportedly] supporting evidence for the top-level arg: \"Privately, people say this\" - where can/should I put it?", "group_id": 5192, "id": 424268}, {"user_id": 23706, "stars": [], "topic_id": 9267, "date_created": 1300944147.6073811, "message": "(...though a solution may already exist, it's been a long time since I did any formal logic.)", "group_id": 5192, "id": 424271}, {"user_id": 21734, "stars": [], "topic_id": 9267, "date_created": 1301368597.0229759, "message": "i like the idea that you should exclusively place your argument on one side. it probably helps to bring the argument without distancing bullshit. still, i can see subversive use of the sides. you just go on the other side and post some gibberish. voting up & down arguments could do something about that.", "group_id": 5192, "id": 465022}, {"user_id": 42566, "stars": [], "topic_id": 9267, "date_created": 1319236373.7300589, "message": "Very very cool site. It's the most unique thing I've seen on the web in a while. I really want alerts to know if there were new responses to my debate. Maybe choices for daily or weekly digests? Also, there should be a way to tell how the debate is going by tallying up counter points?", "group_id": 5192, "id": 2403475}, {"user_id": 42903, "stars": [], "topic_id": 9267, "date_created": 1319875631.894278, "message": "Shouldn't you be using wrangle for this discussion? Something about eat your own dog food and all that.....also, I want feeds - i want scrolling banners - what are the latest discussions, arguments and shit - I want to feel the buzz of activity. Absolutely Awesome idea though!!!", "group_id": 5192, "id": 2460075}, {"user_id": 43636, "stars": [], "topic_id": 9267, "date_created": 1321605188.586077, "message": "Great site! But translation into different languages is a must. You could crowdsource that. (I, personally, could help with Russian).", "group_id": 5192, "id": 2594018}]