[{"user_id": 11626, "stars": [], "topic_id": 7604, "date_created": 1298188765.364145, "message": "Wisconsin tea party activists are now weighing in on the ongoing state worker protests, bussing in picketers to counter protest today and exploring measures to recall the Democratic senators that have fled to boycott the vote on Governor Scott Walker's budget bill.\r\n\r\nMadison police have said that they expect approximately 100,000 people to fill the square outside the capitol building Saturday as tea party members' voices will be added to the chorus of dissent as the protests enter their fifth day.\r\n\r\nThe counter-rally, which was announced by the Virginia and Wisconsin-based conservative group American Majority, is dubbed the I Stand with Scott Walker Rally, and was organized by American Majority's Executive Director Matt Batzel.\r\n\r\n\"I think we're in for something special tomorrow,\" Batzel told WISC-TV in Madison. \"We're expecting to have thousands of conservatives and tea party people representing the majority of Wisconsin who stand behind Gov. Walker on this bill.\"\r\n\r\nMeanwhile, tea party members are forming two exploratory committees to recall two of the Wisconsin Democrats that fled the state on Thursday to protest the vote on the certain-to-pass bill, which will drastically cut state worker benefits and eliminate union bargaining rights.\r\n\r\nFollowing today's protests, the tea party group Northwood Patriots will meet tomorrow to discuss the recall of Senator Jim Holperin, while a separate group in Kenosha, Wisconsin called the Robert Wirch Exploratory Committee is looking into recalling Senator Robert Wirch.\r\n\r\nAccording to Madison's The Capital Times, a recall effort would require the exploratory committees to collect 15,000 to 20,000 petition signatures.\r\n\r\n\"[Wirch] needs to get back on the job,\" Dan Hunt, a self-proclaimed tea party member told The Capitol Times. \"This has angered a lot of us. What you see in the capitol is just a bunch of out-of-state people being paid by the unions.\"\r\n\r\nhttp://abcnews.go.com/News/tea-party-descends-madison-protests/story?id=12956342", "group_id": 3920, "id": 152495}]