[{"user_id": 1822, "stars": [], "topic_id": 9088, "date_created": 1298652836.2171559, "message": "If you've remapped the caps lock key - what did you choose.  For those who've tried both, what did you end up with?", "group_id": 100, "id": 209550}, {"user_id": 1822, "stars": [], "topic_id": 9088, "date_created": 1298652797.135932, "message": "I've remapped my caps-lock key to control for a while for Vim use and mostly happy with it, I map jj to esc.  I use control most with the following p,n,], [h,j,k,l (window moves)] etc.", "group_id": 100, "id": 209547}, {"user_id": 9242, "stars": [{"date_created": 1298701083.010329, "user_id": 4859}], "topic_id": 9088, "date_created": 1298655058.3850219, "message": "I started with it mapped to Escape but recently changed to Control.  I will never go back.  Control is far more useful across applications and yet it makes <C-[> easier to type as an alternate Escape.", "group_id": 100, "id": 209847}, {"user_id": 4631, "stars": [], "topic_id": 9088, "date_created": 1298664481.234091, "message": "I'm with @rson, having control easily reachable is much more useful then escape. Plus I use <C-[> to escape in vim.", "group_id": 100, "id": 211009}, {"user_id": 6415, "stars": [], "topic_id": 9088, "date_created": 1298680860.32604, "message": "I've tried both, having control on the home row makes more sense as it is used with other keys. Redefining esc to jj is great too :)", "group_id": 100, "id": 212281}, {"user_id": 12619, "stars": [], "topic_id": 9088, "date_created": 1298690151.3243549, "message": "I haven't gone down this road, but I know I'm occasionally in the mood for a conventional text editor (e.g., Kate) because I have habits compatible with how they work (like CTRL + SHIFT + RIGHT ARROW = select to end of line). It all pivots on how to get to ESC. I think I'm gonna try remapping to jj.", "group_id": 100, "id": 212682}, {"user_id": 14470, "stars": [], "topic_id": 9088, "date_created": 1298699353.242275, "message": "+1 on jj and caps lock to control", "group_id": 100, "id": 212890}, {"user_id": 12677, "stars": [], "topic_id": 9088, "date_created": 1298700108.3133681, "message": "It looks like people are missing the Sun keyboards days here ... I used to use Ctrl-C to escape in vi but now I just do straight Escape. Got used to it plus it works in a Terminal with vim keybindings.", "group_id": 100, "id": 212913}, {"user_id": 14470, "stars": [], "topic_id": 9088, "date_created": 1298701094.972703, "message": "jj can be bound in the terminal too (zsh here). bindkey \"jj\" vi-cmd-mode", "group_id": 100, "id": 212933}, {"user_id": 5575, "stars": [], "topic_id": 9088, "date_created": 1298785656.2840331, "message": "It's gotta be control. I've got pretty big hands, so I can reach up to Esc comfortable, but curling my fingers down to reach Ctrl gets pretty uncomfortable.  Not to mention having both ^[ and ^c.", "group_id": 100, "id": 216627}, {"user_id": 4130, "stars": [], "topic_id": 9088, "date_created": 1298858802.1048911, "message": "When I was on a Thinkpad w/ nipple and Linux, I had caps=esc. I LOVED this and it made my Vim'ing much more productive. Because I hack on a day to day basis with a lot of people on Macs now, including myself, I find it much easier to bind it to ctrl and deal with reaching for the escape key. I may play with using <C-[> again.  jj seems to repetitive to use every time I need to change modes.", "group_id": 100, "id": 223298}, {"user_id": 11223, "stars": [], "topic_id": 9088, "date_created": 1298871258.525099, "message": "i get annoyed with the lag-time typing \"j\" when \"jj\" is remapped to esc.", "group_id": 100, "id": 223689}, {"user_id": 11223, "stars": [], "topic_id": 9088, "date_created": 1298872195.7779319, "message": "if you have jj remapped, typing just \"j\" will lag unless you type a key other than \"j\" right afterward - so when typing fast you effectively don't get the first j until you hit the next character.", "group_id": 100, "id": 223719}, {"user_id": 2457, "stars": [], "topic_id": 9088, "date_created": 1298871540.2366841, "message": "The only time that the lag time would be an issue is if you actually needed to type jj in insert mode. Otherwise, it shouldn't be an issue at all. (Assuming you use inoremap for your mapping)", "group_id": 100, "id": 223695}, {"user_id": 11223, "stars": [], "topic_id": 9088, "date_created": 1298872429.8544641, "message": "sorry, just tested  - the j appears, but the cursor doesn't advance.", "group_id": 100, "id": 223738}, {"user_id": 11277, "stars": [], "topic_id": 9088, "date_created": 1298873232.8689449, "message": "I'll put in another vote for Ctrl. Its usual placement is a lot more problematic, and I spend a lot of time in Firefox and Bash, where it's a major bonus. I don't much like the idea of chording for Esc, but I did recently map it to a foot pedal. Not sure whether that one's gonna stick...", "group_id": 100, "id": 223786}, {"user_id": 14145, "stars": [], "topic_id": 9088, "date_created": 1298915662.7605491, "message": "I've mapped esc to caps-lock on my Kinesis Advantage. Already got ctrl keys for my left and right thumbs so esc -> caps-lock was the natural remap. Don't know how I would remap it using an ordinary keyboard though.", "group_id": 100, "id": 227632}, {"user_id": 11646, "stars": [], "topic_id": 9088, "date_created": 1299336502.544807, "message": "I like to use caps in insert mode, but always forget about it when I enter command mode. So I've created a python script that disables caps-lock when I leave insert mode.", "group_id": 100, "id": 276324}, {"user_id": 6704, "stars": [], "topic_id": 9088, "date_created": 1307025263.3777001, "message": "I always map Left-Alt to Ctrl because it is vastly important for me to be able to enter Ctrl sequences without moving my fingers from home row and twisting my wrists around unnaturally — so my thumbs stay busy modulating Ctrl (left thumb) and Alt (right thumb) while my fingers can keep humming away at their normal keys. So I was free to map Caps Lock to \"Compose\" and can enter fancy Unicode characters like → with “Compose - >” and ë with “Compose e double-quote.”", "group_id": 100, "id": 1267471}, {"user_id": 6704, "stars": [], "topic_id": 9088, "date_created": 1307025412.829886, "message": "Important clarification: under X Windows, “Compose” is NOT a modifier key; you do not have to keep it held down while typing all of those other characters! Instead, you press and release it, then enter the additional characters that add together to make the code for a fancy Unicode character.", "group_id": 100, "id": 1267519}, {"user_id": 12843, "stars": [], "topic_id": 9088, "date_created": 1307028527.2341321, "message": "Another caps->ctrl user. I have also tried jk as an esc binding, but gradually reverted to the esc key since I use vim on several remote machines - and alternating between the two badly breaks the flow.", "group_id": 100, "id": 1268009}, {"user_id": 12843, "stars": [], "topic_id": 9088, "date_created": 1307028580.4374809, "message": "Interestingly, when I need to use another keyboard with the normal caps/ctrl keys, I don't find it too painful to adjust", "group_id": 100, "id": 1268019}, {"user_id": 31883, "stars": [], "topic_id": 9088, "date_created": 1307034070.629493, "message": "@brandon_rhodes I also find compose immensely helpful, but I use right alt for it – can't remember why just now though, probably the default/example where I saw it", "group_id": 100, "id": 1268730}, {"user_id": 33725, "stars": [], "topic_id": 9088, "date_created": 1307038436.8553021, "message": "I have caps and escaped swapped. But only when Vim is the active window.", "group_id": 100, "id": 1269494}, {"user_id": 1175, "stars": [], "topic_id": 9088, "date_created": 1307132998.412339, "message": "Does using caps lock get awkward? I know some keyboards click and others light up (Mac laptop).", "group_id": 100, "id": 1280883}, {"user_id": 31883, "stars": [], "topic_id": 9088, "date_created": 1307241673.1500781, "message": "@mwhooker my leds are under software control; for example, I swap left-ctrl and caps and the caps led is toggled by ctrl", "group_id": 100, "id": 1290885}, {"user_id": 7080, "stars": [], "topic_id": 9088, "date_created": 1307546030.216027, "message": "I have kj mapped to esc, which is cool except when I try to paste an ssh-key or something that contains kj.  Then it's a PITA.  inoremap kj <Esc>", "group_id": 100, "id": 1338073}, {"user_id": 19985, "stars": [{"date_created": 1307719535.863591, "user_id": 1175}], "topic_id": 9088, "date_created": 1307568328.9131491, "message": "@mwhooker the light on caps lock key no longer lights up when it is mapped to control.", "group_id": 100, "id": 1342863}, {"user_id": 31883, "stars": [{"date_created": 1307654557.1868141, "user_id": 7080}], "topic_id": 9088, "date_created": 1307599446.3853481, "message": "@doki_pen: I believe gvim handles that correctly for middle-click or ctrl-v pastes, but in a terminal vim can't tell the difference between that and typing. you can look at :help 'paste', or use \"*p or \"+p (from normal mode) or ctrl-r * or ctrl-r + (from insert mode) instead of pasting in insert mode", "group_id": 100, "id": 1346736}]