[{"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300145904.5272369, "message": "Is this what we want to achieve with this convore group?", "group_id": 6727, "id": 351997}, {"user_id": 8649, "stars": [{"date_created": 1300300951.9825301, "user_id": 10411}], "topic_id": 13112, "date_created": 1300250830.1769519, "message": "I think so... This may also end up just being a staging ground for that scientific community.  The key point is that it is not centered around a particular toolkit or library.  There are plenty of those to go around.  Rather, just like the SciPy conference is an umbrella for a wide variety of scientific computing in Python, I would like for us to build some online resource that has a similar breadth of users.", "group_id": 6727, "id": 362675}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300293781.8341811, "message": "I would like to contribute for the development of such a community.  I am wondering should we start with a name to identify ourselves?", "group_id": 6727, "id": 367487}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300293576.443516, "message": "It's good.  Since the scipy-user list seems to be for SciPy package, I hesitate to ask or share information on my work, which is pretty remote to the scenarios that SciPy applies on.  A more generic community focusing on just Python for science will be more suitable for me.", "group_id": 6727, "id": 367469}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300300350.950392, "message": "@matthewturk Perhaps we can view the convore group as a starting point.  Information is nicely archived on convore.  We can also have frequent interaction on the twitter-like interface.  I personally feel it's a good place for further development of the community.", "group_id": 6727, "id": 368422}, {"user_id": 10411, "stars": [], "topic_id": 13112, "date_created": 1300301095.8608861, "message": "Peter mentioned to me and others recently, that maybe we should advertise this convore group on all of those lists that are much more specific.  \n\nThe question is \"Are we going to stick with convore?\"  In the short term, I think the answer is that we are, because doing anything else requires much more work.", "group_id": 6727, "id": 368508}, {"user_id": 10348, "stars": [], "topic_id": 13112, "date_created": 1300299345.541636, "message": "I'd also be interested in a broader place for discussion.  The HPC mailing list on python.org is interesting, but not very well-subscribed.  Convore seems very cool, but isn't it a bit worrisome that it's (currently?) a somewhat isolated system?", "group_id": 6727, "id": 368231}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300300246.095804, "message": "I don't even know there's a HPC list at python.org.  Just subscribed it anyway.", "group_id": 6727, "id": 368410}, {"user_id": 20326, "stars": [], "topic_id": 13112, "date_created": 1300307559.311178, "message": "The impression I got about the convore when originally proposed was that it would be used to bootstrap another type of online presence. Convore is easy, free, and social, but it's also terse and ephemeral, so hopefully we can one day supplement it.", "group_id": 6727, "id": 369307}, {"user_id": 10348, "stars": [], "topic_id": 13112, "date_created": 1300313459.20649, "message": "@mikegraham I agree, I hope it can be supplemented with something less ephemeral at some point.  @scopatz In the short term, I think that sounds reasonable.", "group_id": 6727, "id": 369747}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300315198.0738909, "message": "I see Convore as an enhanced IRC.  Writing and responding to messages are easy, like what IRC offers, but messages in Convore are better organized than in IRC.", "group_id": 6727, "id": 369840}, {"user_id": 10348, "stars": [], "topic_id": 13112, "date_created": 1300313591.771822, "message": "I suppose one question I have is, is this a forum that will serve for discussions that are ill-served elsewhere?  Or is it meant to have an overlap?  There are a number of topics in scientific applications of Python that don't really have homes: provenance, deployment, homegrown viz, community development, and so on.  But is Convore the right venue?", "group_id": 6727, "id": 369754}, {"user_id": 7688, "stars": [], "topic_id": 13112, "date_created": 1300315287.207001, "message": "I guess it could be too demanding for Convore to be the main venue of serious discussion.  But Convore should be able to serve well as an important component of a vibrant community.", "group_id": 6727, "id": 369850}]