[{"user_id": 11626, "stars": [], "topic_id": 7412, "date_created": 1298087342.784673, "message": "Teachers in Oaxaca, Mexico, attempted to confront installed president Felipe Calderon yesterday. In the resulting clashes with police, 15 people, including three photographers, were injured.\r\n\r\nhttp://www.youtube.com/watch?v=j6GVCcEQkg0\r\n\r\nCalderon was in Oaxaca for the inauguration of a private university for the children of Mexico’s elite.\r\n\r\nCalderon lost the election to Andrés Manuel López Obrador. Calderon, however, was the bankster choice, so the election was fixed in his favor (see A Full Recount Would Show that López Obrador Won Mexico’s Presidency by More than One Million Votes).\r\n\r\nAs the above video reveals, the street battles between the cops and protesters were pitched. The police fired rubber bullets at rock throwing teachers and their supporters. They threatened more protests and roadblocks in response to the police crackdown.\r\n\r\nIn 2006, educators in Oaxaca demanded higher pay. The demonstration turned into a larger movement against then-Oaxaca Gov. Ulises Ruiz, who was accused of rigging his election. Several people were killed when thousands of state and federal police attacked the encampment of striking teachers in the central square of the Mexican city.\r\n\r\nObservers accused the Mexican government of engineering a strategy of tension event by sending in thousands of paramilitary police ahead of the election of dedicated globalist Vicente Fox.\r\n\r\nSection 22 leaders said Tuesday they were protesting a decree that Calderon signed Monday giving parents of Mexico’s tiny elite tax breaks on private school tuition. The union leaders argue the measure undermines Mexico’s already struggling public schools.\r\n\r\nThe battle coincided with a United Nations report warning that countries in Latin America and Africa, including Bolivia and Mozambique, are most at risk of food riots as prices advance.\r\n\r\nRecent protests in North Africa and the Middle East were partly linked to agriculture costs. World food prices climbed to a record in January.\r\n\r\nhttp://www.infowars.com/teachers-and-police-battle-in-oaxaca-mexico", "group_id": 3920, "id": 148803}]