[{"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310241948.6127801, "message": "Me and my sister have been working on a project for the last two months. At this moment there is a web developer joining me as well as an internet marketer. Both are interested in the project and they would like to be paid with equity. They are both really talented people and I see them staying in the \"company\" for the long run. What is the rule when it comes to something like this? How much is just right? And how do you even calculate this at such an early stage?", "group_id": 250, "id": 1600478}, {"user_id": 10406, "stars": [{"date_created": 1310331714.9275489, "user_id": 36971}, {"date_created": 1310836380.0898161, "user_id": 21305}], "topic_id": 41540, "date_created": 1310247025.1546781, "message": "Hope this can help you to have an idea: http://bit.ly/qp3saZ  \nIt is called the founders' pie calculator.", "group_id": 250, "id": 1600930}, {"user_id": 26103, "stars": [], "topic_id": 41540, "date_created": 1310278266.8887279, "message": "I'd think long and hard about bringing on a marketer this early.", "group_id": 250, "id": 1603403}, {"user_id": 33127, "stars": [], "topic_id": 41540, "date_created": 1310278841.427115, "message": "that said, if you don't know how to monetize your product, and neither does your sister - and that's why you're thinking of giving equity to a marketing person... then I'd re-evalutate your business plan before giving away equity to anyone", "group_id": 250, "id": 1603420}, {"user_id": 19409, "stars": [{"date_created": 1310331719.833019, "user_id": 36971}], "topic_id": 41540, "date_created": 1310287118.577487, "message": "3 good articles on the subject here: http://bitly.com/r9OdH1", "group_id": 250, "id": 1603607}, {"user_id": 23098, "stars": [], "topic_id": 41540, "date_created": 1310367896.543828, "message": "I agree with the above replies. I've been around a few times, and made a ton of mistakes. So my lessons are, 1. don't give away equity to just anyone, especially someone who isn't going to bring a ton of value early on. 2. if you are going to give away *any* equity, make sure it's vested, with AT LEAST a 1 year cliff (if you don't know what this is, it's 110% worth looking up), and 3. if you are going to bring someone on board make sure they have work, and a solid understanding of their **daily** tasks.", "group_id": 250, "id": 1610105}, {"user_id": 22183, "stars": [], "topic_id": 41540, "date_created": 1310389914.550843, "message": "Also checkout slide 22 - http://www.slideshare.net/joestump/starting-your-startup", "group_id": 250, "id": 1611716}, {"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310422106.6702111, "message": "I found this yesterday (founders calculator) http://foundrs.com/calculator/index.php - I'm not going to say its 100% accurate but it helps put many things in perspective and give you an idea of how and how much to offer.", "group_id": 250, "id": 1615956}, {"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310421686.117645, "message": "Thank you all for your help and all those great articles!", "group_id": 250, "id": 1615915}, {"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310421987.6333089, "message": "@william Yes, vesting is a huge part... I didnt know about that until yesterday!", "group_id": 250, "id": 1615946}, {"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310424093.475785, "message": "@AndrewCurioso The web developer will take care of writing the code while i will be the one doing the designs. At this point I'm thinking of offering a 5% once the product is completed and launched and offer another 5-7% (vested) to keep him in the team as the service evolves and needs to be modified and hopefully grows.", "group_id": 250, "id": 1616106}, {"user_id": 37768, "stars": [], "topic_id": 41540, "date_created": 1310423093.7237101, "message": "@avillabon Watch out for the difference between a co-founder and an employee. Unless these new team members are contributing significant effort: they may fall into the later. (If neither you are your sister are technical then you may be looking for a \"technical co-founder\" rather than a web developer).", "group_id": 250, "id": 1616033}, {"user_id": 37768, "stars": [], "topic_id": 41540, "date_created": 1310436824.631319, "message": "@avillabon Without knowing too much about your situation, that seems extremely high for a developer (a CTO or VP, Engineering -- maybe). Make sure you've looked at the slideshow that @glorithm posted (especially slide #24).", "group_id": 250, "id": 1617182}, {"user_id": 37768, "stars": [], "topic_id": 41540, "date_created": 1310437576.47774, "message": "@avillabon This is pretty decent summary http://news.ycombinator.com/item?id=973060", "group_id": 250, "id": 1617238}, {"user_id": 32259, "stars": [], "topic_id": 41540, "date_created": 1310490419.2287791, "message": "@AndrewCurioso In this case the dev will also manage some resposabilities a CTO would have. He will have plenty to do an look over at the same time, and all this without any payment other than equity (for now). He is however keeping his day job but promises to deliver around 30-40 hrs of work per week. Being this the case, do you still think its too high? ....  Thanks for the link to the summary, great stuff", "group_id": 250, "id": 1621198}]