[{"user_id": 11626, "stars": [], "topic_id": 43121, "date_created": 1312237852.728781, "message": "MARTIAL LAW MONDAY 8/1/11\r\n\r\nIt is with great sadness that we've had to create the \"Martial Law Monday\" edition of SCMLA's News Digest...\r\n\r\n\r\nMilitary Train Convoy Of Tanks And Jeeps Seen Near Bakersfield California – Photos\r\nThe Intel Hub\r\nJuly 30, 2011\r\n\r\nAfter multiple requests for pictures and or video of the many descriptions of military movements we get on a daily we have finally received photographic proof of one of the tips Rather then make ANY sort of conclusion I will simply ask: What do you think? Recently seen traveling from Tehachapi California while headed northbound on HWY 99 near Bakersfield California. All the vehicles were pointed south bound. Note: All photos of videos and troop movements that appear on The Intel Hub are taken in public areas and public roadways.\r\nhttp://theintelhub.com/2011/07/30/military-train-convoy-of-tanks-and-jeeps-seen-near-bakersfield-california-photos\r\n\r\n\r\n\r\nRule: ‘Martial Law’ – Obama To Use Dictatorial Powers To Raise Debt Ceiling If Need Be\r\nThe Intel Hub\r\nJuly 29. 2011\r\n\r\nThe U.S. debt is totally out of control — now sitting at $14.3 Trillion, raising the debt ceiling will only buy a little more time until a massive crash takes place and total chaos ensues (economic and physical), a total fall of the republic. The agenda seems to be to push for raising the debt limit ceiling to save this once great nation’s AAA credit rating — but what does a AAA credit rating mean if you go totally broke later and fall even harder? The 14th Amendment states: “The validity of the public debt of the United States, authorized by law, including debts incurred for payment of pensions and bounties for services in suppressing insurrection or rebellion, shall not be questioned.” This is the new tactic that the powers that be plan on using to obtain their goal (create more debt). Obama can also use PDD51 or other Executive Orders provided to him under Pandemic Level 6 (which was extended by Obama until March of 2012) to raise the debt ceiling. Pandemic Level 6 gives them all they need to do what ever they want, we are technically in a silent martial law. Obama stated the other day that “Any solution to avoid the default must be bipartisan,  supported by both parties and the American people, not just one faction.” But yet one faction (Obama and the powers that be) will use Executive Orders to get this passed. Doublespeak at it’s best. Listen to this FOX News clip of a public threat being made.\r\nhttp://theintelhub.com/2011/07/29/obama-to-use-dictatorial-powers-to-raise-debt-ceiling-if-need-be\r\n\r\n\r\n\r\n‘Rule Titled ‘Martial Law’ to be Issued by Rules Committee for New Debt Bill’\r\nGulag Bound\r\nJuly 29, 2011\r\n\r\nWhat in blazes is this, now? Note to Congress’ Republicans as well as Democrats: Don’t mess with us one inch further. Don’t do one more stupid thing, infringing upon the natural rights of the Sovereign People you serve, nor violating the Constitution you are sworn to uphold and protect and the terms of which you so egregiously and constantly violate. Don’t plan for martial law. Don’t prepare for it. Don’t even discuss it in your furtive meetings. If you become aggressive, that is what the Second Amendment and the “duty” charged us in the Declaration of Independence, are about. We need to find out why that irresponsible and inflammatory title was issued to this legislation.  Is it just a nickname for their internal rule?  Whatever it was, the use of that term must be condemned. To verify that government should never use that phrase unless there are very extraordinary conditions, which threaten the freedom of the people — and never as a part of such a threat, we recommend, “A Primer on ‘Martial Law,’” by constitutional scholar, Edwin Vieira, Jr., Ph.D., J.D.\r\nhttp://networkedblogs.com/l1Fvk\r\n\r\n\r\n\r\nObama Says Becoming A Dictator Is Very Tempting As La Raza Crowd Cheers\r\nThe Intel Hub\r\nJuly 29, 2011\r\n\r\nPresident Obama, speaking to the Council of La Raza, has admitted that it is very tempting to do things on his own and bypass Congress. This outright scary remark has received little attention in the corporate controlled media. The crowd cheers as Obama essentially says its tempting to become a dictator and give you all amnesty as well as half of America but we have a Constitution that doesn’t allow that. On top of the obviously stunning comments by Obama, the fact that they were said at a La Raza conference is outright anti American. La Raza, funded by major organizations such as The Bill and Melinda Gates Foundation, has openly called for multiple states to be returned to Mexico and have even stopped the Arizona attorney general from doing an interview! The fact is, the corporate media and the U.S. government refuse to even acknowledge that the Plan of San Diego is promoted by a large minority of illegal alien groups. This is the classic divide and conquer strategy: Fund the openly racist group La Raza in order to rile up the more extreme right wingers in a bid to start an outright race war. Groups such as La Raza are openly funded by the globalists in a move to further the divide between races while they carry out their public eugenics operation and installation of a world government.\r\nhttp://theintelhub.com/2011/07/29/obama-says-becoming-a-dictator-is-very-tempting-as-la-raza-crowd-cheers\r\n\r\n\r\n\r\nExclusive: ATF Intimidates Gun Owners With Home Visits\r\nFederal agency attempts to make firearms retailers spy on their customers under new illegal directive\r\nInfowars.com\r\nJuly 29, 2011\r\n\r\nEven as it finds itself embroiled in a scandal that saw weapons being deliberately sent to criminal gangs in Mexico, the ATF has issued a letter ordering firearms dealers in border states to report sales of two or more semi-automatic rifles, and is following it up by harassing gun owners with intimidating home visits as well as threatening gun dealers to spy on their customers. As the Justice Department announced earlier this month, “All gun shops in four Southwest border states (Texas, California, Arizona and New Mexico) will be required to alert the federal government to frequent buyers of high-powered rifles.” However, what the media failed to report at the time was the most shocking part of the ATF letter, which orders gun dealers to also report to the feds sales of “two or more pistols or revolvers, or any combination of pistols or revolvers totaling two or more.” The ATF letter, which was subsequently sent out to gun dealers and has since entered the public domain, orders firearms retailers to “Submit to ATF reports of multiple sales or other dispositions whenever, at one time or during any five consecutive business days, you sell to an unlicensed person or otherwise dispose of two or more semi-automatic rifles capable of accepting a detachable magazine and with a caliber greater than .22 (including .223/5.56 caliber).” The directive takes effect from August 14, 2011. However, what the federal agency isn’t keen to make public is how its agents are using these reports to make threatening home visits to firearms owners, while ordering gun store owners to become de facto informants by telling them to spy on their customers.\r\nhttp://theintelhub.com/2011/07/29/exclusive-atf-intimidates-gun-owners-with-home-visits\r\n\r\n\r\nQuartzsite, Arizona: Blueprint For A Police State\r\nDeadline Live\r\nJuly 28, 2011\r\n\r\nFirst the town Mayor is forced out of office, then a state of emergency is declared in secret and if matters couldn’t get any worse for the unfortunate townspeople of Quartzsite, the majority of the police force is now being forced to stay in their own homes during working hours. Nine out of a total of fourteen Quartzsite, Arizona police officers have been suspended, all of which just happened to be whistle blowers who exposed their corrupt police chief. The Mayor, Ed Foster, was elected on the platform of investigating the corrupt goings-on in the Quartzsite city council. Therefore, it is not quite surprising that they would force out the man who intends to prove them to be criminals. The city has now become a fascist authoritarian police state with the criminal police chief Jeff Gilbert at the helm. Gilbert has been accused of violating federal medical privacy laws, intimidation of officers and members of the community with whom he disagrees, using police resources to find “dirt” on political candidates and citizens with whom he disagrees, favoritism to the point of not arresting friends who have warrants, targeting certain citizens for traffic stops and arrests due to their beliefs or political ideas, disciplining officers not on merit but “loyalty” to Gilbert and his illegal activity, publicly humiliating officers he decides are “unfit,” and last but not least selectively promotes his friends in direct violation of police department regulations. A detailed letter explaining the chief’s illicit activities issued by the Quartzsite Police Officers Association can be read here.\r\nhttp://deadlinelive.info/2011/07/28/quartzsite-arizona-blueprint-for-a-police-state\r\n\r\n\r\nBusting Posse Comitatus: Military Cops Arrest Civilians in Florida City\r\nInfowars.com\r\nJuly 28, 2011\r\n\r\nIntel Hub Note: This startling information comes to light just days after our report about the Pentagons plan for a 20,000 strong internal army force to take on the American people. In Homestead, Florida, Posse Comitatus is dead. The Air Force now responds to civilian crime in the small city, population around 30,000. Military “crime stoppers” violate Posse Comitatus in Florida. Photo from Homestead ARB website. “Here at Homestead Air Reserve Base we have the Crime Stop hotline that allows anyone either on base or off the installation to anonymously report a crime,” explains the Homestead Air Reserve Base website. “If you know of a crime that has been committed, if you see a crime in progress, or if you see a suspicious person, vehicle, or situation that makes you feel a crime may be occurring, call the Security Forces Crime Stop Hotline…” On July 15, military police – known as Security Forces patrolmen – detained a criminal suspect at a Circle K in until Miami-Dade police arrived. “Crime prevention is everyone’s responsibility, the better informed we are the safer we can make the installation and the surrounding community,” said t. Juan Lemus, Security Forces Police Services Chief. Crime prevention off military bases is the responsibility of civilian police, not the military. In 1878, following Reconstruction, the Posse Comitatus Act was passed. It limited the powers of the federal government to use the military for law enforcement.\r\nhttp://theintelhub.com/2011/07/28/busting-posse-comitatus-military-cops-arrest-civilians-in-florida-city\r\n\r\n\r\n\r\nBlack Helicopters Seen In Multiple States As Pentagons Deployment Of 20,000 Troops Inside United States Set To Be Ready This Year\r\nThe Intel Hub\r\nJuly 27, 2011\r\n\r\nNote: Both The Washington Post and Russia Today reported in 2008 that the Pentagon was training 20,000 troops to be deployed inside The United States to serve as a response to a mass terror attack or civil unrest following an economic collapse. Since our groundbreaking article, Pentagon To Deploy 20,000 Troops In CONUS For Civil Unrest, we have received many different tips and eye witness accounts related to the possible deployment of foreign and/or American military to quell civil unrest inside the United States as well as a reports of a growing number of large, unmarked black helicopters. Activist Post, a great website that has supported The Intel Hub from the beginning, also received some significant tips from their version of our article that they posted: \"There have been massive large black helicopters flying over my city of Boulder, Colorado at sunrise; the helicopters have two large propellers,they appear to be transport helicopters. This hasn’t happened before; they fly in groups of three and not more than 150 feet above the rooftops…very stealth. I’ve had dozens of people complain about it, it wakes most of the 100,000 people that live in Boulder. Peace..\"\r\nhttp://theintelhub.com/2011/07/27/black-helicopters-seen-in-multiple-states-as-pentagons-deployment-of-20000-troops-inside-united-states-set-to-be-ready-this-year\r\n\r\n\r\n\r\nThird World Arizona: A Municipal Quarrel Leads to Martial Law?\r\nRepublic Magazine\r\nJuly 26, 2011\r\n\r\nIt seems like a spectacle out of a Third World dictatorship: A frail woman, trying to address a public meeting, is set upon by police, who tear the microphone from her hands, jack her arms up behind her back in a painful compliance hold, and drag her off to jail. After being monetarily silenced by sheer astonishment, the audience at the meeting begins to express outrage and disgust. They are joined by the top elected official – in this case, the City Mayor – who orders the police to stand down and leave the woman alone. The Town Council, on the other hand, votes the silence the woman, and the police carry out that decree. This wasn’t a scene from North Korea, Libya, Iran, or Venezuela. Instead, it happened on June 28 in Quartzsite, Arizona, a town of about 3,600 in the western part of the state. Once known as the “Rock Capital of the World,” and a refuge for thrifty people fleeing the expense and corruption of larger cities. “People come here to live cheaply; they know how to live within their means and they want their government to do so, too,” local activist and reporter Jennifer “Jade” Jones recently told the New York Times. It Ms. Jones who was arrested and brutalized during the June 28 public Town Council meeting. That event was captured in a video subsequently broadcast to millions via YouTube and Judge Andrew Napolitano’s Fox News program, Freedom Watch. As a result, this obscure western Arizona town – and the escalating feud between a reformist mayor and an entrenched Town Council and police chief – has become an international controversy.\r\nhttp://www.republicmagazine.com/news/third-world-arizona-a-municipal-quarrel-leads-to-martial-law.html\r\n\r\n\r\n\r\n﻿Russia, U.S. to hold nuclear security drills in August﻿\r\nRIA Novosti\r\nJuly 26, 2011\r\n\r\nRussia and the United States will hold joint nuclear security drills under the auspices of the bilateral military cooperation committee, the U.S. Department of State said. The exercise, codename Crimson Rider, will take place at the Camp Guernsey base in Wyoming. The exact date of the exercise is yet to be announced. The drills, focusing on counter-terrorism measures, will involve a vehicle used for transporting nuclear warheads. The drills are aimed at exchanging tactical and technical experience in providing security for nuclear materials. Russian and U.S. servicemen will also train to prevent proliferation of self-made explosive devices.\r\nhttp://en.rian.ru/mlitary_news/20110726/165390227.html\r\n\r\n\r\n\r\n**MEDIA ALERT** Military Training Exercises to Take Place In and Around Boston\r\nCity of Boston\r\nJuly 25, 2011\r\n\r\nJoint federal military training exercises will take place within and around the Boston area between July 26th and August 5th. Military personnel will conduct training exercises to ensure the military's ability to operate in urban environments, prepare forces for upcoming overseas deployments, and meet mandatory training certification requirements. Helicopters will be used in some exercises. The Boston Police Department is working with military personnel to coordinate training sites that will minimize negative impacts on our Boston citizens and their daily routines. Safety precautions have been taken to prevent risk to the general public and the military personnel involved.  With that, training site locations are not open to the public and will be guarded by uniformed personnel to provide additional safety.\r\nhttp://www.cityofboston.gov/news/Default.aspx?id=5212\r\n\r\n\r\n\r\nPentagon To Deploy 20,000 Troops In CONUS For Civil Unrest, Possible Threats To Populace\r\nThe Intel Hub\r\nJuly 24, 2011\r\n\r\nNote: I want to preface this article with the following statement — “Please get this information out to everyone. It is better to be safe than sorry.”  —  Shepard In 2008 The Pentagon announced plans to deploy a 20,000 strong internal troop force inside the continental United States (CONUS) that was set to be trained by 2011, thus dovetailing into the current troop and equipment movements around the country reported by truckers as well as many more troop sightings by everyday citizens. Interestingly enough, this plan directly correlates with a 2009, Army funded, Rand Corporation study that called for an internal United States police force to combat civil unrest..... It is openly admitted that the internal force will be used to quell civil unrest due to massive large scale terror attacks and/or economic collapse.\r\nhttp://theintelhub.com/2011/07/24/20000-troops-to-deploy-in-conus-for-civil-unrest-possible-threats\r\n\r\n\r\n\r\nUn Troops In America Doing Martial Law Drills (video)\r\nGGN News Bulletin\r\nJuly 12, 2011\r\n\r\nhttp://wn.com/un_troops_in_america_doing_martial_law_drills", "group_id": 3920, "id": 1770386}]