[{"user_id": 6559, "stars": [], "topic_id": 5428, "date_created": 1297688401.944622, "message": "why not give it a try?", "group_id": 81, "id": 98991}, {"user_id": 6559, "stars": [], "topic_id": 5428, "date_created": 1297688419.8883519, "message": "if you like it, go with it. if you don't, try something else.", "group_id": 81, "id": 98998}, {"user_id": 7501, "stars": [], "topic_id": 5428, "date_created": 1297689096.7872369, "message": "A few years ago, when I had to choose a language to switch from desktop standalone apps (and _very_ low level devs) to \"web\" distributed devs, I chose python because I didn't want PHP and didn't find another good alternative. After 3 years with a homemade framework and 2 years of Django, I feel myself at ease with this choice.", "group_id": 81, "id": 99090}, {"user_id": 10074, "stars": [], "topic_id": 5428, "date_created": 1297688196.9063909, "message": "Hey guys. I'm relative new to djano. I have some experience with php and python. But just for some private projects. At the moment I'm learning django with python. Can you just brainstorm a bit, what are the benefits if you compare it to php. On what scale you can see diferences. Why you would choose php, python or another language? I know, that this topic is annoying, but I want to learn more about web development. Thank you :D", "group_id": 81, "id": 98937}, {"user_id": 719, "stars": [], "topic_id": 5428, "date_created": 1297688799.8520529, "message": "@Samuirai I'd say it depends on what you're working on. It'd be difficult to advise without any sense of what your needs are.", "group_id": 81, "id": 99051}, {"user_id": 7501, "stars": [{"date_created": 1297693733.4223571, "user_id": 5388}, {"date_created": 1297781561.6741991, "user_id": 4156}], "topic_id": 5428, "date_created": 1297689118.2224751, "message": "The issue I had with PHP is that it's like BASIC in the 80's : anybody does it, and it's hard to sort ressources and code snippets found on the web. There's more ugly than pretty.", "group_id": 81, "id": 99098}, {"user_id": 10074, "stars": [], "topic_id": 5428, "date_created": 1297688715.8087881, "message": "I try/tried everything :D django was very strange at the beginning, when I came from php. But I don't know if my php programming style is like how usually php web-development works. You are the guys with experience in the professional area. I'm just a student, and never developed in a professional way. I thought, it would be nice to hear some thoughts about this topic from really good developers... I stay with django and python, I love it. This topic is not to find a language for me, it's just about brainstorming and hear new thoughts and examples to get a feeling :)", "group_id": 81, "id": 99033}, {"user_id": 7501, "stars": [], "topic_id": 5428, "date_created": 1297688738.5788691, "message": "Choosing a language is, IMHO and legacy or imposed choices constraints put aside, a matter of taste. If a language doesn't match your own neuron scheme, you'll have a hard time having fun developing.", "group_id": 81, "id": 99036}, {"user_id": 10074, "stars": [], "topic_id": 5428, "date_created": 1297689061.267422, "message": "@micrypt I know. Sorry for my english, It's difficult to say for me what I really want from you :D... I don't want advices for a language. I love python and django, and I liked php. I just want to hear some of your thoughts. For example I can imagine, that sb would say: \"django is more difficult to set up than php\" or \"A professional website in php has the same difficulty for setting up the server like you would have with django\". I just want some thoughts. Some experience you made - hear some thoughts about reallife problems.", "group_id": 81, "id": 99081}, {"user_id": 927, "stars": [], "topic_id": 5428, "date_created": 1297778695.9678919, "message": "@Samuirai I gave up on PHP entirely a couple years back after using it from the early 3.0 days due to dysfunctional core developers (arguing over whether crashes or breaking documented behaviour should be fixed?)", "group_id": 81, "id": 111364}, {"user_id": 927, "stars": [], "topic_id": 5428, "date_created": 1297778808.907686, "message": "and due to the basic language design issues never getting fixed. i.e. in Python, errors are handled using exceptions and your code is cleaner because you don't have so much error handling; in PHP they might [rarely] be exceptions or a status code you have to check or some other library function to call for a particular family of functions - nothing insurmountable but it's a ton of cognitive overhead for such a basic need", "group_id": 81, "id": 111393}]