[{"user_id": 12900, "stars": [], "topic_id": 15160, "date_created": 1301027693.021075, "message": "Ever since upgrading to iOS 4.2 on my iPhone 4, the screen animations and general scrolling performance has been pretty poor—and it actually seems worse with 4.3. Here are a few examples of what I'm seeing:\n\n- Takes an abnormal amount of time to exit \"jiggle\" mode.\n- The physics seem to be off, in that a soft, slow swipe makes the items on the screen fly by really fast. When scrolling through apps in springboard, the elasticity of each screen is off, in that the new page scrolls WAY off the page before bouncing back.\n- When opening apps, it will skip the animation where all the other app icons fly off the screen and the app you tapped flies toward you from the center. It's as if all those frames of the animation are dropped, there's a slight hang, and then the app I tapped is there full screen. It just doesn't look right.\n- Maybe unrelated, but today when I received a call, I could slide the \"slide to answer\" icon over, but for about 8-10 seconds it did nothing and my phone just kept ringing. It finally worked, but probably right before it was about to go to voicemail.\n\nAnyone else seeing these types of problems?", "group_id": 1295, "id": 435579}, {"user_id": 24988, "stars": [], "topic_id": 15160, "date_created": 1301032555.5674009, "message": "From your list, I have only one problem: the scrolls now work too slow for me. But I have 2 other problems: \n- the battery performance is down by about 25% \n- when the phone wakes up - irrespective of whether it is user induced or app induced - some part of the screen will be jagged. This is before I unlock the phone, and the problem goes away the moment I do so.", "group_id": 1295, "id": 436145}, {"user_id": 23385, "stars": [], "topic_id": 15160, "date_created": 1301040621.370657, "message": "My jiggle mode got worse with 4.2 and improved with 4.3. The issue that I'm having with both iOS devices is with them hanging in the middle of a sync for an interminable amount of time until I assist them or something they reappear for download even though I had just downloaded them. There are times when it would rake 3 efforts to download one update. Not cool. I've had the elasticity issues you've mentioned but it seems to have stopped for now. I also noticed with one call that I received that I couldn't seem to get the slider to work. One final note about syncing is that the image of the icons are sometimes aren't full rendered.", "group_id": 1295, "id": 436651}]