[{"user_id": 11626, "stars": [], "topic_id": 7701, "date_created": 1298237562.894876, "message": "http://www.newscientist.com/data/images/ns/cms/mg20927995.600/mg20927995.600-1_300.jpg\r\n\r\nTHE US army is planning to field \"rubber bullets\" for machine guns. Military officials claim the ammunition will allow them to more effectively quell violent protests without loss of life, but human rights campaigners are alarmed by the new weapon.\r\n\r\nThe final design for the XM1044 round has not been selected, according to an order placed on the Federal Business Opportunities website last month, but the army's Joint Non-Lethal Weapons Directorate has been working on a ring aerofoil projectile for some years. The round is a hollow plastic cylinder 40 millimetres across, looking something like a short toilet-paper roll. In flight its shape generates lift, giving it a longer range.\r\n\r\nThe army's existing crowd-control rounds are single shots fired from handheld grenade launchers with a range of about 50 metres - the XM1044 would double this range. It would be supplied in belts for the Mk19 grenade launcher, a truck-mounted weapon that can fire almost six rounds per second. The Mk19 has been exported to some 30 countries, including Egypt.\r\n\r\n\"The US army has a requirement for a rapid-fire non-lethal capability,\" says Ken Schulters, project manager for close combat systems at Picatinny Arsenal in New Jersey. \"All currently fielded non-lethal ammunition is single shot.\"\r\n\r\nFiring rapidly at long range is likely to be dangerously inaccurate, says Angela Wright of Amnesty International. \"Such a weapon system would allow for a burst of non-accurate fire at a crowd, with high risk of hitting bystanders, ricochets and of hitting vulnerable areas of the body,\" she says.\r\n\r\nDespite being hollow and plastic, if a round were to strike someone in the head, it could severely injure or kill them, she adds.\r\n\r\nhttp://www.newscientist.com/article/mg20927995.600-army-wants-rapidfire-rubber-bullets-for-crowd-control.html", "group_id": 3920, "id": 154781}]