[{"user_id": 11626, "stars": [], "topic_id": 40714, "date_created": 1309354972.308296, "message": "Fire Threatens Plutonium and Uranium Release at Los Alamos National Laboratory\nWashington’s Blog\nJune 29, 2011\n\nA raging wildfire is threatening to engulf the Los Alamos National Laboratory. Los Alamos has likely tested more nuclear weapons than any other facility in the world. Los Alamos.... Lab spokesman Steve Sandoval declined to confirm that there were any such drums currently on the property. Later, Los Alamos confirmed the allegation.... The Los Alamos Study Group alleges that the waste is not all from the Cold War, because the facility is cranking out more nuclear weapons than ever. The lab has called in a special team to test plutonium and uranium levels in the air as a “precaution”. One area within the Los Alamos complex already suffered a temporary fire, which was doused.... The Wall Street Journal notes that the surrounding canyons also contain radioactivity from past bomb tests....\nhttp://www.washingtonsblog.com/2011/06/fire-threatens-nuclear-weapons-and.html\n\nTowns Near N.M. Fire, Nuclear Lab Fear Radioactive Smoke Plume\nFoxNews\nJune 29, 2011\n\nTowns Near N.M. Fire, Nuclear Lab Fear Radioactive Smoke Plume 29 Jun 2011 Residents downwind of a wildfire that is threatening the nation's premier nuclear-weapons laboratory are worried about the potential of a radioactive smoke plume if the flames reach thousands of barrels of waste stored in above-ground tents. Lab Director Charles McMillan said the barrels contain transuranic waste -- gloves, toolboxes, tools -- and other items that may have been contaminated through contact with radioactive materials. Top lab officials declined to say how many barrels were on site or how they are stored. An anti-nuclear group has estimated there could be up to 30,000 gallon-drums.\nhttp://www.foxnews.com/us/2011/06/29/wildfire-advances-toward-nm-nuke-lab-raising-contamination-concerns\n\nLos Alamos scurries to protect nuclear lab from fire\nReuters\nJune 29, 2011\n\nLos Alamos scurries to protect nuclear lab from fire --Nuclear weapons lab closes due to fire danger -- Fire has potential to double or triple in size 28 Jun 2011 New Mexico fire managers scrambled on Tuesday to reinforce crews battling a third day against an out-of-control blaze at the edge of one of the nation's top nuclear weapons production centers. The fire's leading edge burned to within a few miles (kilometres) of a dump site where some 20,000 barrels of plutonium-contaminated waste is stored at the Los Alamos National Laboratory, fire officials said.\nhttp://www.reuters.com/article/2011/06/28/usa-wildfires-nuclear-idUSN1E75R1KH20110628\n\nLos Alamos nuclear lab: New Mexico fire forces closure\nBBC\n28 June 2011\n\nDoug Tucker, Los Alamos fire chief: \"We're doing our best to keep it off the lab.\" One of the top nuclear weapons research facilities in the US will remain closed until Thursday as fire fighters battle a wildfire raging at its boundary. Only \"essential-duties\" staff at Los Alamos National Laboratory will be permitted on site on Wednesday. Officials at the New Mexico facility have said they detected \"no off-site releases of contamination\". The town outside the laboratory in the state of New Mexico was evacuated on Monday as the fire raged nearby. Officials said the nuclear facilities faced \"no immediate threat\" but warned of damage to houses. The lab, opened during World War II, led the development of the atomic bomb. Possible toxic plume....\nhttp://www.bbc.co.uk/news/world-us-canada-13937781\n\nWildfire Pushes Toward Nuclear Lab\nWall Street Journal\nJune 28, 2011\n\nWildfire Pushes Toward Nuclear Lab --Safety Officials Take Precautions as Northern New Mexico Blaze Nears Los Alamos Research Complex --Officials bringing in extra radiation monitors 29 Jun 2011 A large wildfire moving across northern New Mexico Tuesday had authorities watching for a potential release of radiation around the nation's main nuclear-weapons lab in Los Alamos. The fire, covering some 60,740 acres, was headed north toward the Los Alamos National Laboratory, the nuclear-research facility that sprawls across 36 square miles and contains 2,000 buildings.\nhttp://online.wsj.com/article/SB10001424052702304447804576413653582814850.html\n\nFire inches toward Los Alamos\nKRQE\nJune 28, 2011\n\nFire inches toward Los Alamos --Type I incident command team took over fire Monday afternoon; additional team expected Tuesday 28 Jun 2011 The Las Conchas fire continued to inch closer to Los Alamos on Monday night, this was hours after officials made the decision to evacuate citizens. Members from the New Mexico National Guard and the State Police are patrolling the town of Los Alamos in the absence of those residents. The main road into Los Alamos, NM 502 is blocked. Only essential personnel for the fire or essential workers at the Los Alamos National Labs are allowed entrance.\nhttp://www.krqe.com/dpp/weather/wildfires/Fire-inches-towards-Los-Alamos-dr\n\nFirefighters beat back flames on plutonium lab property\nReuters\nJune 27, 2011\n\nFirefighters beat back flames on plutonium lab property 27 Jun 2011 A raging wildfire in Los Alamos on Monday briefly entered the property of the nation's preeminent nuclear facility, Los Alamos National Laboratory, a vast complex that houses research laboratories and a plutonium facility. A mandatory evacuation has been ordered for the town of Los Alamos, which has a population of about 12,000. Firefighters were able to douse the flames on the one-acre \"spot fire\" just inside the southwestern boundary of the lab site, about 25 miles outside Santa Fe, authorities said.\nhttp://www.reuters.com/article/2011/06/27/us-wildfires-los-alamos-idUSTRE75Q6R120110627\n\nLos Alamos National Laboratory moving to protect radioactive material from fire\nMSNBC\nJune 27, 2011\n\nLos Alamos National Laboratory moving to protect radioactive material from fire --Up to 2,500 evacuated as blaze nears site where world's first atomic bomb was built 27 Jun 2011 A raging wildfire spread to within one mile of the nation's preeminent nuclear weapons facility on Monday, as officials at Los Alamos National Laboratory scrambled to make sure that radioactive and hazardous material were protected from the wind-driven fire that has forced the installation to close. The number one priority at the moment is to make sure all the radioactive and hazardous material is protected, Janet Bettinger, deputy manager of finance, told NBC News. She said she couldn't confirm that it is protected at this point. The fire has burned around 44,000 acres and was threatening buildings, power lines and natural gas lines, Bettinger said.\nhttp://www.msnbc.msn.com/id/43544283/ns/weather", "group_id": 3920, "id": 1516861}]