[{"user_id": 12619, "stars": [], "topic_id": 7599, "date_created": 1298184935.07603, "message": "Read lots of reviews, but I'm not sure how seriously to take them. I won't need VNC; just wanna get into my home Linux box.", "group_id": 97, "id": 152445}, {"user_id": 5582, "stars": [], "topic_id": 7599, "date_created": 1298185011.5590789, "message": "I'd love to see some screenshots of ssh apps on the iPad. I'm curious how much space you have with the keyboard being shown.", "group_id": 97, "id": 152447}, {"user_id": 9060, "stars": [], "topic_id": 7599, "date_created": 1298201803.8380489, "message": "also curious here", "group_id": 97, "id": 153059}, {"user_id": 651, "stars": [], "topic_id": 7599, "date_created": 1298205631.6928861, "message": "I'm also looking for a good SSH client. Seems like iSSH is the most popular. Not sure if it is so much better than the others (like SSH Term pro) to justify the higher price.", "group_id": 97, "id": 153186}, {"user_id": 3291, "stars": [], "topic_id": 7599, "date_created": 1298212020.6358421, "message": "I found this review - http://webdesign.about.com/od/iphoneapps/tp/iphone_ssh_tools.htm", "group_id": 97, "id": 153622}, {"user_id": 3291, "stars": [{"date_created": 1298463102.872453, "user_id": 5711}], "topic_id": 7599, "date_created": 1298212093.0200551, "message": "By the way, I also found that you can connect your Apple Bluetooth keyboard to your iPhone, and it can almost completely replace your laptop for remote work.", "group_id": 97, "id": 153623}, {"user_id": 13232, "stars": [], "topic_id": 7599, "date_created": 1298217485.825202, "message": "sshuttle (https://github.com/apenwarr/sshuttle) isn't a GUI app but it uses SSH to make a kind of pseduo-VPN and it doesn't require you setup anything crazy on the destination machine.  Really awesome tool.", "group_id": 97, "id": 153915}, {"user_id": 12619, "stars": [], "topic_id": 7599, "date_created": 1298223653.0710621, "message": "Using zaTelnet, a free iOS app, just to seenif I want to be doing stuff at my terminal from my iPhone. It suffices, but it's probably not as polished as other apps.", "group_id": 97, "id": 154241}, {"user_id": 4935, "stars": [], "topic_id": 7599, "date_created": 1298258826.827275, "message": "iSSH works. I investigated them all a few months ago, and it's the only one reviewers thought was really comfortable and reliable.", "group_id": 97, "id": 155859}, {"user_id": 1202, "stars": [], "topic_id": 7599, "date_created": 1298257654.441268, "message": "I've used iSSH forever.  So far, I have no complaints (I've used both the iPhone and iPad version).  I really enjoy using the transparent keyboard, as it allows you to utilize the screen size to its fullest.", "group_id": 97, "id": 155825}, {"user_id": 12641, "stars": [], "topic_id": 7599, "date_created": 1298258655.1573241, "message": "I use iSSH. It works well, and it's a universal app so I've used it with success from my iPhone and iPad. I don't use all of the fancy features of it but it was well worth the relatively small price IMHO.", "group_id": 97, "id": 155855}, {"user_id": 3531, "stars": [], "topic_id": 7599, "date_created": 1298261364.684947, "message": "I'll chime in with a 'me too!' on iSSH. Pretty nice app, good for wanting to get a peek at you irssi session while on-the-go.", "group_id": 97, "id": 155962}, {"user_id": 14896, "stars": [], "topic_id": 7599, "date_created": 1298420258.165035, "message": "Another vote for iSSH. I use it infrequently but it does the job when I need it. Keep in mind that YMMV, of course. This is an SSH app on an iPhone (though I have to imagine that there's now and iPad version?) so the UX is not going to be ideal. It's a very delicate balancing act on the display between keyboard and shell and this can get annoying when you really really just need to restart that server NOW (which is usually the only time I need to use iSSH). Though I've little experience with other iOS SSH clients I suspect they all share this same shortcoming.", "group_id": 97, "id": 185219}]