[{"user_id": 11626, "stars": [], "topic_id": 41909, "date_created": 1310622727.4360831, "message": "How to protect your mobile phone & computer from illegal police searches\r\nJ. D. Heyes\r\nNatural News\r\nJuly 13, 2011\r\n\r\n(NaturalNews) The U.S. Constitution is clear about the issue of privacy. In fact, the Fourth Amendment states, in part, \"The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated...\"\r\n\r\nWith that in mind, it's safe to say it's more than just a little disturbing to know that, in certain circumstances, police can search your cell phone and computer(s), even if you don't want them to and even if they don't yet have a warrant to do so.\r\n\r\nThe good news is, someone out there has recognized the problem and has taken steps to help you protect that vast amount of data you have stored on your smart phone or laptop.\r\n\r\nThe Electronic Frontier Foundation, long defenders of electronic rights, has written a legal guide designed to help you better understand your rights and, more importantly, when police can - and cannot - legally confiscate and search your personal electronic devices.\r\n\r\n\"In the heat of the moment, it can be hard to remember what your rights are and how to exercise them,\" says EFF Senior Staff Attorney Marcia Hofmann. \"Sometimes police can search your computer whether you like it or not, but sometimes they can't. We wrote this guide to help you tell the difference and to empower you to assert your rights when the police come knocking.\"\r\n\r\nAdds EFF Staff Attorney Hanni Fakhoury, \"With smart phones, tablet computers, and laptops, we carry around with us an unprecedented amount of sensitive personal information.\r\n\r\n\"That smart phone in your pocket right now could contain email from your doctor or your kid's teacher, not to mention detailed contact information for all of your friends and family members,\" Fakhoury continued. \"Your laptop probably holds even more data -- your Internet browsing history, family photo albums, and maybe even things like an electronic copy of your taxes or your employment agreement. This is sensitive data that's worth protecting from prying eyes.\"\r\n\r\nAccording to a summary of full EFF legal guide:\r\n\r\n· Always say \"no\" when police ask if they can search your server, personal computer or cell phone because if you give them permission to search, they don't need a warrant - even to enter your home;\r\n\r\n· If police tell you they have a search warrant, ask to see it because you have a right to;\r\n\r\n· Make sure police are only searching the areas outlined in the warrant;\r\n\r\n· Be silent - you don't have to help the police or answer their questions, and that means you don't have to give them your encryption keys or passwords;\r\n\r\n· If you do decide to talk, don't lie because lying to the police is a crime;\r\n\r\n· Finally, if you can consult with a lawyer before police conduct a search or even just talk to you, that's ideal.\r\n\r\nThis guide is extremely helpful in this digital age when being secure in our \"papers\" and effects now includes our data-filled electronic devices. Know your rights; that is your best protection.\r\n\r\nhttp://www.naturalnews.com/032985_illegal_searches_mobile_phones.html", "group_id": 3920, "id": 1635217}]