[{"user_id": 25703, "stars": [], "topic_id": 37753, "date_created": 1306975254.4679019, "message": "First look at Windows 8: http://www.youtube.com/watch?v=p92QfWOw88I", "group_id": 9493, "id": 1260778}, {"user_id": 25703, "stars": [], "topic_id": 37753, "date_created": 1306975260.127871, "message": "Hrm.", "group_id": 9493, "id": 1260780}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1306999614.42294, "message": "So we're looking at a unified OS for desktops and tablet devices?  If so, nice… I didn't expect them to get there this quickly.", "group_id": 9493, "id": 1264102}, {"user_id": 32057, "stars": [], "topic_id": 37753, "date_created": 1307001152.4524651, "message": "Yup nothing I can see either. last talk MS had on their own hardware was the courier (still sad that idea never came to fruition). \nWell listening to what has been said the guy keeps saying pc and not much mention of tablet, or am I remembering incorrectly? He does go on about how touch is where people are headed etc...\nAlthough looking at the thumb keyboard \"They developed\" Even though there is an android app for that already. It does look like it's targeted clearly at Tablet too. Oh wait at about 4 min in he does say it will run on laptops, pc, slates etc..", "group_id": 9493, "id": 1264197}, {"user_id": 32057, "stars": [], "topic_id": 37753, "date_created": 1307000354.3361659, "message": "WP7 for pc. I wonder what hardware they were running it on?", "group_id": 9493, "id": 1264156}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307000795.150593, "message": "Nothing so far has suggested that MS wants to make devices.", "group_id": 9493, "id": 1264181}, {"user_id": 32057, "stars": [], "topic_id": 37753, "date_created": 1307000727.301748, "message": "It would seem so, it would explain why the UI between windows 8 and WP7 are pretty much the same thing. Easier for the user to adapt.\n\nBut now would MS go the google route and just get the OS onto other devices or Apple route and make their own only?", "group_id": 9493, "id": 1264174}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307000430.871738, "message": "Well there's been this whole brouhaha of how ARM will be supported.  Maybe they're getting serious about the tablet market?", "group_id": 9493, "id": 1264163}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307002566.572443, "message": "I simply love this graph of PC grown rates… if you count the iPad as a PC:\n\nhttp://www.asymco.com/2011/04/14/first-quarter-pc-forecast-windows-down-2-macipad-up-250/", "group_id": 9493, "id": 1264323}, {"user_id": 32057, "stars": [], "topic_id": 37753, "date_created": 1307002405.3930111, "message": "No argument there. Seems the lappy is to become the new desktop and tablet the new lappy.", "group_id": 9493, "id": 1264307}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307002126.494807, "message": "Thing is, the tablet IS the future of the PC…", "group_id": 9493, "id": 1264269}, {"user_id": 31852, "stars": [], "topic_id": 37753, "date_created": 1307002802.9729359, "message": "I'm hoping that future arrives sooner, rather than later. The one thing that's been keeping me from buying a tablet (iPad or otherwise) is because at present, despite all the cool stuff they can do, there's still just too much they can't do which I need my PC to be able to do. That's why I bought a laptop last month, instead of the iPad which I wanted way more...\n\nI know there are a couple of Windows 7 tablets on the market (basically just netbooks forced into a tablet configuration), but those have the drawback of not being able to do all the cool media-, gaming- and entertainment type stuff you'd use an iPad for. I want something that has all the functionality of an iPad and a netbook both.", "group_id": 9493, "id": 1264357}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307003087.1357789, "message": "I doubt you'll get that (soon).  At least not in a form that doesn't suck.  Part of the reason Apple can make the iPad experience so awesome is because of the amount of control they have over it.\n\nI think what's happening here is a bit of a redefinition of what a (very) personal computer is, and what people use it for.  I find it hard to predict the future of computing right now, with things being as in flux as they are, but it's possible that us who want a computer that \"does more\" than a locked-down tablet are destined to be an ever smaller niche audience.\n\nI mean, I don't know exactly what the things are that you want to do on the laptop that you can't do on an iPad (maybe you can list a few), but think about them for a minute: how many people out there (people like… your parents) actually need to do those things on a computer?  I'm guessing not many.", "group_id": 9493, "id": 1264400}, {"user_id": 31852, "stars": [], "topic_id": 37753, "date_created": 1307003358.7121439, "message": "No, you're right. For me, personally, it's the need to run SQL Server and full-featured office productivity software. Which is basically all I use my laptop for :/", "group_id": 9493, "id": 1264433}, {"user_id": 32282, "stars": [], "topic_id": 37753, "date_created": 1307004876.8623121, "message": "I use my iPad as a media consumption device and as a mobile gaming device. For those things, it's unbeatable and changes life in a very subtle but awesome way. I no longer turn a computer when I', not working, because the iPad is perfect for reading in bed, on a couch, over breakfast etc.  The next time I go on holiday, I'll leave the laptop behind because a tablet perfect for email and Web access. If I'm on a business trip and need to work it's not going to help. I'm not sitting writing 2000 words of copy on a touchscreen, especially if there is finnicky formatting to worry about.", "group_id": 9493, "id": 1264557}, {"user_id": 31753, "stars": [], "topic_id": 37753, "date_created": 1307006418.1422751, "message": "My wife was overseas last week, and took her iPad with instead of her laptop. Her work set up a Windows Terminal for her to connect to over the VPN with Remote Desktop, so she was able to do some of her work this way. I don't think she'd want to do extended hours of work like this, but it performed quite well for the little bits she needed to do.", "group_id": 9493, "id": 1264663}, {"user_id": 31852, "stars": [], "topic_id": 37753, "date_created": 1307006532.0873139, "message": "Oh wow, that's already quite impressive -- I hadn't known that this was even possible on iPad.", "group_id": 9493, "id": 1264667}, {"user_id": 31753, "stars": [], "topic_id": 37753, "date_created": 1307009024.127497, "message": "I knew it worked, but I was pretty impressed with how well it worked when I saw it for myself.", "group_id": 9493, "id": 1264837}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307010597.3597391, "message": "The whole \"business travel\" aspects is one of the best arguments in favour of an iPad, as per Broken's wife's example.  I mean, when I go to conferences, the work things I use my laptop for are (a) email, (b) taking notes and (c) possibly making some last-minute changes to my own slides.  All of the above can easily be achieved on an iPad.  Moreover, the iPad is a great mobile terminal if you do need to do more.  Unfortunately my work's VPN isn't natively supported by iOS, but… there are ways and means.\n\nOn the other hand, I often get inspired at conferences and then I want my entire development environment with me…", "group_id": 9493, "id": 1265034}, {"user_id": 31927, "stars": [], "topic_id": 37753, "date_created": 1307011333.8480029, "message": "John Gruber has an interesting take on exactly what we're discussing here:\n\nhttp://daringfireball.net/2011/06/windows_8_fundamentally_flawed", "group_id": 9493, "id": 1265169}]