[{"user_id": 21579, "stars": [{"date_created": 1300396992.1635821, "user_id": 14562}], "topic_id": 13075, "date_created": 1300137771.701556, "message": "Piotr Zolnierczuk mentioned a library called Luban (http://docs.danse.us/pyre/luban/sphinx/). ", "group_id": 6727, "id": 351258}, {"user_id": 10348, "stars": [], "topic_id": 13075, "date_created": 1300137882.6280019, "message": "Wow, Luban looks pretty cool.  We've been building for our project a very simple GUI using qooxdoo to interface with a Python REPL that exposes an RPC.", "group_id": 6727, "id": 351269}, {"user_id": 21579, "stars": [], "topic_id": 13075, "date_created": 1300137634.4028361, "message": "Hello, What is the easiest way to create scientific web gui's? (Possibly with least coding and interactive plots.)", "group_id": 6727, "id": 351249}, {"user_id": 21579, "stars": [], "topic_id": 13075, "date_created": 1300137802.6208949, "message": "Is there anybody around experienced with this one?", "group_id": 6727, "id": 351262}, {"user_id": 21579, "stars": [], "topic_id": 13075, "date_created": 1300140094.8368821, "message": "Being able to run matplotlib as a plotter would be fantastic from within luban. mpl html5 backend seems too experimental at this stage, can't get all the examples running fully functional.", "group_id": 6727, "id": 351418}, {"user_id": 10411, "stars": [], "topic_id": 13075, "date_created": 1300139673.804405, "message": "@gsever I have some experience with other Danse projects.  Mike McKerns' lightening talk on dill from last year's SciPy was pretty awesome.", "group_id": 6727, "id": 351383}, {"user_id": 10348, "stars": [], "topic_id": 13075, "date_created": 1300141170.9309781, "message": "Yeah, the MPL HTML5 backend I think has a little ways to go.  The way we opted to go is probably pretty primitive compared to other options, but we opted to write out PNG files to cStringIO, then serve those directly by adding an additional piece of content into a routing table.", "group_id": 6727, "id": 351539}, {"user_id": 8649, "stars": [], "topic_id": 13075, "date_created": 1300144504.069258, "message": "Actually the author of Luban talked about it at SciPy last year.  He's been working on it for several years now and it's really grown up nicely.", "group_id": 6727, "id": 351911}, {"user_id": 10348, "stars": [], "topic_id": 13075, "date_created": 1300146265.110414, "message": "Oh, I guess I didn't realize Luban had an MPL backend implementation; I thought we were talking about the HTML5 one that is hosted in the mplh5canvas project on Google Code, which I think is still experimental.  I agree that Luban seems extremely impressive, especially since it leverages pyre to do a number of cool things.", "group_id": 6727, "id": 352055}, {"user_id": 21579, "stars": [], "topic_id": 13075, "date_created": 1300153138.4883871, "message": "Pyjamas project (http://pyjs.org/) seems like easy to use. I wonder it could be easily integrated with mpl. @matthewturk, unfortunately no mpl backend for luban :( and only supports some primitive plotting as far as I can see.", "group_id": 6727, "id": 352744}, {"user_id": 23030, "stars": [], "topic_id": 13075, "date_created": 1302941307.9231751, "message": "@matthewturk The HTML5 Canvas backend is in 1.0.0 mainline AFAIK.", "group_id": 6727, "id": 709824}, {"user_id": 21728, "stars": [], "topic_id": 13075, "date_created": 1305326775.4019589, "message": "For those of you who have seen protovis, the author has a new library called d3 that provides a data transformation framework: http://mbostock.github.com/d3/", "group_id": 6727, "id": 1048359}]