[{"user_id": 11626, "stars": [], "topic_id": 7381, "date_created": 1298075804.985209, "message": "http://www.skyvalleychronicle.com/999/news/thm201102181211371347233936.jpg\r\n\r\n(NATIONAL) -- Could it be the U.S. government thinks peaceful, civilian protest against government is fine on the streets of Cairo, Egypt but not on U.S. soil?\r\n\r\nAs Secretary of State Hillary Clinton gave a speech at George Washington University yesterday condemning governments that arrest protestors and do not allow free expression - and lauding freedom of speech on the Internet - 71-year-old military veteran Ray McGovern was grabbed from the audience in plain view of her by police and an unidentified official in plain clothes and hustled out of the building and, according to McGovern and his supporters, was “brutalized and left bleeding in jail.”\r\n\r\nWhat McGovern did was simply remain standing silently in the audience and turned his back on her as Secretary Clinton began her speech.\r\n\r\nThat was it.\r\n\r\nMcGovern, a veteran Army officer who also worked as a C.I.A. analyst for 27 years, was wearing Veterans for Peace t-shirt.\r\n\r\nBlind-sided by security officers who pounced upon him, McGovern remarked, as he was hauled out the door, \"So this is America?\"\r\n\r\nAccording to Mara Verheyden-Hilliard, attorney with the Partnership for Civil Justice Fund, “For this peaceful expression of dissent, he ended up bruised, bloodied, arrested, and jailed. Secretary Clinton never paused, continuing her speech lecturing other countries about the need to allow freedom of expression and dissent, while Mr. McGovern was hauled out in front of her.”\r\n\r\nMcGovern was later found to have his arm covered with bruises. The metal handcuffs were fastened so tightly that his wrists were cut and some blood flowed from the cuts.\r\n\r\nAfter being held by local police, McGovern was told he was being charged with disorderly conduct.\r\n\r\nWatch the incident in the video below.\r\n\r\nVeterans for Peace is demanding an apology from Secretary of State Clinton.\r\n\r\nhttp://www.skyvalleychronicle.com/BREAKING-NEWS/VETERAN-S-GROUP-DEMANDS-APOLOGY-FROM-SEC-OF-STATE-CLINTON-BR-Claims-vet-was-manhandled-for-silent-protest-596038", "group_id": 3920, "id": 147805}]