[{"user_id": 15676, "stars": [], "topic_id": 40810, "date_created": 1309414868.3967209, "message": "I'm fairly new to the not-self-hosted Python world. Ever since I started with Django, I've been configuring my own servers… I've got the setup down to a nice mix of nginx, postgres, gunicorn, and supervisord. I'm about ready to launch a fairly large client project, and I've been considering delegating server maintenance to a third party. Woud there be any reason why I wouldn't want to use ep.io?", "group_id": 2873, "id": 1525993}, {"user_id": 15676, "stars": [], "topic_id": 40810, "date_created": 1309415011.7450039, "message": "I should note: I've been testing out Gondor.io and was quite impressed at the ease of setup and deployment. The only thing I'm not too crazy about it that they're a full-on Rackspace crowd, and I'm writing directly to S3 and using SES to handle outgoing mail, so I want to keep it on Amazon servers to keep costs down.", "group_id": 2873, "id": 1526026}, {"user_id": 8740, "stars": [], "topic_id": 40810, "date_created": 1309428195.2899711, "message": "However, technically there's no reason why you shouldn't use us - we already run several medium-size production-level sites, and we're keeping an EC2 node around even after we move the majority of the sites to our own hardware, though obviously the costs to run on EC2 will be higher", "group_id": 2873, "id": 1526814}, {"user_id": 8740, "stars": [], "topic_id": 40810, "date_created": 1309428291.0452931, "message": "Also, my comment about being free is more full disclosure rather than reality - we run an as-production service at the moment, including rude awakenings at 3 in the morning if needs be", "group_id": 2873, "id": 1526822}, {"user_id": 8740, "stars": [], "topic_id": 40810, "date_created": 1309428116.6735649, "message": "So, my first point would be that since neither we nor Gondor accept money yet (though we plan to very soon), you'll be using a \"free\" service for production, which means there's not really as much guarantee of support", "group_id": 2873, "id": 1526808}]