[{"user_id": 30951, "stars": [], "topic_id": 35003, "date_created": 1305225982.104712, "message": "Oh.... I didn't know:\n\n    \"how does his Impact on the MC embody this Concern.\"\n\nwas how we were supposed to do it.", "group_id": 2515, "id": 1027850}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305225428.7850311, "message": "I'm re-visioning how I included my IC into the movie. I had previously treated him like the MC, thinking about his Concern like \"this is his concern\" as opposed to \"how does his Impact on the MC embody this Concern.\" So, I'm switching that up, and putting as much as I can through the eyes of the MC.", "group_id": 2515, "id": 1027681}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305225718.052165, "message": "However, I can't yet wrap my head around what that means for the Problem/Solution/Symptom/Reactio Quad. (Is there a term for that quad? The IC Sore Spot?) \n\nThe IC has a Symptom of Disbelief, and a response of Faith, and I can see how to treat this as \"What is the impact on the Captain of someone responding to Disbelief with Faith.\" \n\nBut, when things switch over to the Problem/Solution... who sees that? Is it the MC who says, \"Ah-ha... this isn't a Disbelief problem at all... it's Oppose!\" Or is it the IC who does it?\n\nI suppose it's possible that nobody becomes aware of the change-over, but behavior is going to change somewhere, and I'm wondering if that centers on the MC or the IC.\n\n(Any lack of clarity in my question is a reflection of the lack of clarity in my head.)", "group_id": 2515, "id": 1027773}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305226169.656992, "message": "How are you doing it? Mind you, too, that there is more than one way to skin an IC.", "group_id": 2515, "id": 1027919}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305225889.7827621, "message": "Here is another possible way to go. Does the MC know the real Problem, and is getting impacted by \"what it's like to see a person not dealing with their real problem, but instead dealing with the symptom?\"", "group_id": 2515, "id": 1027821}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305226475.833082, "message": "I think some context will help. \nMy movie is about a ship's captain and problems he has with the crew. The captain is not respected, and his throughline is about dealing with that. The IC is a very popular guy.\n\nIn the first couple of drafts, I dealt with the IC directly motivated to stay popular. But I'm switching that over to \"how does his popularity affect the captain?\" Because, the strain on the captain I'm trying to explore (in part) is \"man, wouldn't it be nice to be well liked?\" I want him tempted to give in to that... but it runs at cross-purposes to what he needs to do to be respected. That's part of his struggle.", "group_id": 2515, "id": 1028018}, {"user_id": 30951, "stars": [], "topic_id": 35003, "date_created": 1305230652.9244001, "message": "Well, I didn't know the IC concern was the concern as far as impact on the MC. I thought it was just the IC's concern, much like the MC's. \n\nSo with your story, the Concern is about his effect on the MC, rather than his own popularity and that effect on the OS? What you are saying makes sense, I just didn't realise that.", "group_id": 2515, "id": 1028882}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305233609.592361, "message": "@jimhull, doesn't feel like it, though.", "group_id": 2515, "id": 1029683}, {"user_id": 7645, "stars": [], "topic_id": 35003, "date_created": 1305233488.060931, "message": "I believe that your approach with the previous draft and your approach with the current draft are both *correct* uses of the Impact Character Concern. Whether it is their individual concern or directly attributed to him, they will have the same effect on the Main Character.", "group_id": 2515, "id": 1029645}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305233555.129174, "message": "I can grok it now", "group_id": 2515, "id": 1029670}, {"user_id": 7664, "stars": [], "topic_id": 35003, "date_created": 1305233530.4092009, "message": "I knew it before, in an abstract, unusable way. It's been a long time coming; I think", "group_id": 2515, "id": 1029660}, {"user_id": 10814, "stars": [{"date_created": 1305585364.6506481, "user_id": 7645}], "topic_id": 35003, "date_created": 1305236200.755542, "message": "Keep in mind that the \"problem\" seems different if he is a change character versus a steadfast character.  \n\nWith Change characters, the problem seems like the source of the character's difficulties -- the area that motivates him to deal with his troubles.\n\nWith Steadfast characters, the problem seems like the source of the character's drive.\n\nThis is true for both MC's and IC's.\n\nOne of the purposes of the Impact Character is to point out the MC's problem to him.  The IC does this by chaffing the MC's world view.  This results in the tearing down (Change MC) or building up (Steadfast MC) the blinders around the MC's Problem.", "group_id": 2515, "id": 1030275}]