[{"user_id": 25438, "stars": [], "topic_id": 36585, "date_created": 1306250827.8072131, "message": "An overall goal of ar is to be flexible: rather than presenting one monolithic interface that you have to use, instead it should be made up of functions that you can decide to load, or not load, or modify or extend as you wish.\n\nWe have this flexibility with arc.arc: the definitions simply get loaded one after the other, so it would be easy to for example split arc.arc into smaller parts, or write a loader which didn't load particular definitions, or write a test framework which only loaded definitions up to the point where we wanted to test.\n\nThe be able to get this kind of flexibility with the compiler as well, I'm looking at the following steps:\n\n- Replace all usages of \"ac-def\" with putting the compiler definitions in the Arc namespace, such as by using \"ar-def\".\n\n- Make the compiler definitions something that can be loaded with \"aload\"; rewrite ac-test so that it loads the compiler definitions up to the point of the definition being tested.  (The end result of rewriting ac-test is that \"add-ac-build-step\" can go away).\n\n- The result if everything works is that we end up with an \"ac.arc\" file (which is mostly written in Racket using e.g. \"racket\" or \"racket-code\", but is loaded with Arc's loader, is processed by Arc's compiler, and the definitions are in Arc's namespace.  Thus any definition you see in \"ac.arc\" you could, if you wanted to, load yourself in Arc.\n\n- By now \"ac.ss\" is much smaller, and doesn't contain most of the compiler... and so perhaps might be renamed.\n\nThis is all speculative of course, since I may run into some problem that I haven't thought of.", "group_id": 9739, "id": 1167048}, {"user_id": 25438, "stars": [{"date_created": 1306343763.1589079, "user_id": 32943}], "topic_id": 36585, "date_created": 1306341368.019176, "message": "This is going to be messy for a while, and I'm not sure if it's going to work, so I've created a new branch for this work: https://github.com/awwx/ar/tree/ail", "group_id": 9739, "id": 1180508}, {"user_id": 32943, "stars": [], "topic_id": 36585, "date_created": 1306343769.9641509, "message": "Good idea. ^_^", "group_id": 9739, "id": 1181064}]