[{"user_id": 11626, "stars": [], "topic_id": 7756, "date_created": 1298255643.469888, "message": "Houston Police Chief Charles McClelland is worried, very worried. People are using \"anti-police\" rhetoric and are actually daring to criticize the criminal actions of cops. People are recording their actions with video cameras and attempting to hold them accountable. Clearly, this is a sign they're preparing to mass murder police.\r\n\r\nThank god we have our wonderful Chief of Police Charles McClelland on the job, he's ferreted out the real meaning behind this \"anti-police sentiment,\" and he's here to let everyone know he's not going to stand for it.\r\n\r\nFrom the Houston Chronicle's 'Residents videotaping officers worries HPD's chief':\r\n\r\n    Houston Police Chief Charles McClelland went on the defensive Thursday during a meeting with local journalists, saying officers have made recent traffic stops in which residents leave their vehicles to take pictures or shoot video — encounters he says could endanger officers and that have increased following the release of the Chad Holley beating footage.\r\n\r\n    \"Officers are telling me that they're being provoked,\" the chief said. \"Even when they try to write a simple traffic ticket, people are jumping out with cell phone cameras scanning their badge numbers and their nametags. And I've asked them to remain calm and treat people with respect and dignity.\"\r\n\r\n    McClelland said he is concerned that an intensifying anti-police sentiment in the community could increase negative interactions between Houston Police Department officers and residents.\r\n\r\n    \"This rhetoric can give someone a free pass to try to assault a police officer or kill a police officer, and I'm not going to allow that,\" he said. \"My officers should be able to go out here and work in the neighborhoods and keep this city safe without fear and without hesitation.\"\r\n\r\n    And, the chief implored the community - naming himself, activists and journalists - to \"lower the rhetoric.\"\r\n\r\nIn other words, criticizing the police for violently assaulting and killing strangers is clearly a sign you may be secretly plotting to kill cops! So put down your camera citizen, return to your normal position as hapless subject under our dominion!\r\n\r\nClearly, these buffoons don't like the scrutiny they're getting as a result of your average Joe being able to videotape their abuses and put them on YouTube. I guess, like any thug, their only reaction is to resort to intimidation.\r\n\r\nhttp://www.informationliberation.com/?id=34442", "group_id": 3920, "id": 155627}, {"user_id": 11626, "stars": [], "topic_id": 7756, "date_created": 1298527935.076633, "message": "Using their logic: Videotaping or Criticizing the People May be Sign You're a People-Killer...?", "group_id": 3920, "id": 195726}]