[{"user_id": 35139, "stars": [], "topic_id": 44956, "date_created": 1315343970.582799, "message": "I had the germ of an idea for a story, and it's KIND of sprouted, but I realized that 1) I'm not sure how to encode it in Dramatica, and 2) it's sort of been done already.", "group_id": 2515, "id": 2062151}, {"user_id": 35139, "stars": [], "topic_id": 44956, "date_created": 1315344269.7246759, "message": "(damnit, I forgot that Convore handles carriage returns strangely. Moving right along...)\n\nThe story with the similar structure is \"Down Periscope.\" I don't know if you remember that one, but it starts with two high-ranking naval officers making a bet. THEN you're introduced to the main character, and though 85% of the time you're following the crew of that one submarine, and the actions of that crew give the story its resolution, the conflict starts with those first two characters.\n\nHow do I code something like that? Who's the main character, one of those first two characters, or the character you're following through the vast majority of the story?", "group_id": 2515, "id": 2062192}, {"user_id": 10814, "stars": [], "topic_id": 44956, "date_created": 1315351584.7541511, "message": "I think you have a bookend that is somewhat external to the main story.  They do the same thing in Trading Places.\n\nIf the two making the bet are part of the Overall Story throughline, then just treat them that way, understanding that you use a little part of your screen/page time to setup of inciting incident, which is based on the bet, most likely.", "group_id": 2515, "id": 2063054}, {"user_id": 36525, "stars": [], "topic_id": 44956, "date_created": 1315430996.119415, "message": "I've actually been developing a story with a similar structure.  There are two factions, and the MC belongs to one and the IC to the other, but the two major characters also come into conflict with the other members of their own faction and each others' factions, especially one who is higher-ranking and giving them orders.  I can't really comment on what throughline to put that in, since I don't try to use the four-throughlies part of the Dramatica theory any more, but it's a nice story type.", "group_id": 2515, "id": 2070429}]