[{"user_id": 13817, "stars": [], "topic_id": 35160, "date_created": 1305308478.9670441, "message": "The other day I was talking to some people and the one person shared about a gay Christian friend that they had.\n\nThey were contemplating not continuing the relationship out of fear that they were opening themselves to demonic attack/oppression.\n\nIt's not the first time I've heard this stuff. Where does it come from? I've never heard it taught and I think it's a load of junk.", "group_id": 9787, "id": 1044536}, {"user_id": 13817, "stars": [], "topic_id": 35160, "date_created": 1305308550.6960199, "message": "I mean is their any scriptural backing for this in any way? I'd think Jesus spending time with the sinners would be an easy way to show that it's trash?", "group_id": 9787, "id": 1044553}, {"user_id": 32900, "stars": [], "topic_id": 35160, "date_created": 1305356885.304471, "message": "I think it's an extension of the quest for Holiness. We need to purify ourselves. Be careful what we read. Be careful what movies we watch. The natural extension is to be careful what company we keep. All of which is based on the totally incorrect assumption that we make ourselves Holy. The result is an exclusivist community that has no witness in the world.", "group_id": 9787, "id": 1050720}, {"user_id": 32888, "stars": [], "topic_id": 35160, "date_created": 1305550392.293102, "message": "Here is a facebook status i saw, it kind of ties to this... the comments are the more interesting to read, one specifically********* Lioness Mikay\nNB IfUrBornAgain: a friend told me ukuthi curses that do transmit thru intercourse...tjo, so it's not only HIV risk!\nMay 1 at 3:46pm via Mobile Web · Like · \nLioness Mikay and EMfashion Week like this.\nSarah Masinamela That's true.\nMay 1 at 4:57pm · Like ·  1 person\nMandy Nompumelelo Mtyelwa yes sisi your friend is soooo correct. Remember that the origin of the curse is the disobedience to the Word of God. That is why we are advised to be watchmen over our personal, family, neighbourhood, city, national and global gates. Personal gates are the most crucial gates. Personal gates consist of the gate of the eye, the gate of the ear, the gate of the mouth, the gate of the heart and the gate of the sexual organs. Just look at David; a good example of how curses can be transmitted, to the next generation just because he failed to properly mend his gates, the gate of the eye and the gate of the sexual organs. The weakness(curse) concerning women started with David and Solomon inherited the same curse, which led to his downfall. David's great grandfather (Boaz), grandfather (Obed) and his father (Jesse) didn't have a weakness for women. So this curse started when David decided to look at Bathesba with lust instead of joining other men in the war (instead of joining other men in prayer), which led to the gate of the sexual organs opening up and eventually murder was committed. Most people fail to grasp that a sexual act is more than just a physical act; it is more spiritual than just physical. It is a joining of spirits into becoming one. Anyway that is another topic for another day. It is vital that we properly guard our personal gates. Once the personal gates are closed; the enemy will not have a foothold over one's life.\nMay 1 at 5:07pm · Like ·  1 person\nMandy Nompumelelo Mtyelwa it becomes easier to mend other gates such as family, neighbourhood, city etc, if personal gates are tightly closed.\nMay 1 at 5:11pm · Like ·  1 person", "group_id": 9787, "id": 1070289}, {"user_id": 32900, "stars": [], "topic_id": 35160, "date_created": 1305551219.9241469, "message": "@LintonCaldecott Opening and closing gates gave me COMPLETELY the wrong mental image.....thanks a lot!", "group_id": 9787, "id": 1070429}]