[{"user_id": 31342, "stars": [], "topic_id": 38833, "date_created": 1307651367.595644, "message": "anyone plan on meeting up @ the labs tonight?", "group_id": 868, "id": 1353389}, {"user_id": 30460, "stars": [], "topic_id": 38833, "date_created": 1307653497.5549819, "message": "im down for a conference call, but dunno if im going to come out tonight.  anyone reading this, i left a burrito on the bench next to drill press, please throw it out, sry.", "group_id": 868, "id": 1353829}, {"user_id": 30460, "stars": [], "topic_id": 38833, "date_created": 1307663748.464232, "message": "My 2 cents: maybe bring the rep-rap, it's good eye-candy.  Do we have a big cardboard box that it can live in for its travels?  Maybe have a laptop showing flickr slideshow of the space?  Email sign-up list.  I can bring two pick sets and I think 2 or 3 locks.  If we can't have a great showing for presentation of lockpicks, I don't think we should even have them.  I know the space, and it's not like last year, where there was vendor space.  This is all one big room.  People are going to be absorbed by the talks for the most part.  I dunno.", "group_id": 868, "id": 1356006}, {"user_id": 3019, "stars": [], "topic_id": 38833, "date_created": 1307676685.96382, "message": "I'm thinking a big bowl near the registration with \"free robot\" visitor packages (Laser cut robot, business card, member application and invitation to the party. A small  \"locksport hut\", If we can have 5 lock pick sets on a table in the back that would be a great start. We're working on a good sign to attract people's attention.", "group_id": 868, "id": 1357012}, {"user_id": 3019, "stars": [], "topic_id": 38833, "date_created": 1307681986.2225029, "message": "@A1Ari you are welcome to bring the RepRap and laptop if you want.  I have a bunch I'm bringing already.", "group_id": 868, "id": 1357456}, {"user_id": 31506, "stars": [], "topic_id": 38833, "date_created": 1307714123.522289, "message": "I have a lock pick set that you can use (and maybe a couple of small locks). I'll leave it on the table by the projector this evening.", "group_id": 868, "id": 1361128}]