[{"user_id": 21257, "stars": [], "topic_id": 16186, "date_created": 1301469572.059808, "message": "I'm doing a (non-CS) PhD with a strong interest in translating my research into a startup after defending. Anyone else following this route? Also, I created a convore group for PhD students if anyone is interested. Cheers!", "group_id": 95, "id": 479307}, {"user_id": 10406, "stars": [], "topic_id": 16186, "date_created": 1301516451.7050431, "message": "If it's a high tech startup I think it's a good option but if not you can miss the opportunity", "group_id": 95, "id": 484846}, {"user_id": 21257, "stars": [{"date_created": 1301618901.7048531, "user_id": 10406}], "topic_id": 16186, "date_created": 1301529130.372262, "message": "I agree. If your goal is to build yet another social media web application, the relative value of completing (or even starting) a PhD seems questionable. The benefit is for technologies that require significant technical sophistication and exploratory work. I'm interested in the brain-computer interface, which is not really something you can work on in your garage.", "group_id": 95, "id": 485918}, {"user_id": 776, "stars": [], "topic_id": 16186, "date_created": 1301531289.087534, "message": "what are you going to be studying for your phd?", "group_id": 95, "id": 486100}, {"user_id": 21257, "stars": [], "topic_id": 16186, "date_created": 1301532311.048558, "message": "@rookie coursework has focused on computational models of perception and motor control from a neuroscience perspective. the project i'm starting soon will explore using noninvasive BCI (i.e. EEG) for robotic control.", "group_id": 95, "id": 486186}, {"user_id": 26244, "stars": [], "topic_id": 16186, "date_created": 1301532062.0646341, "message": "I’d suggest creating a small start-up project which you think is disposable and do this as a ‘hobby’ to learn the rules of the road before you take on a major project.  Cheaper to make mistakes that way.", "group_id": 95, "id": 486165}, {"user_id": 26244, "stars": [], "topic_id": 16186, "date_created": 1301533358.866539, "message": "Great and you can consider that a disposable learning experience, unless you invent the next consumer internet god :-)", "group_id": 95, "id": 486301}, {"user_id": 21257, "stars": [], "topic_id": 16186, "date_created": 1301532440.6380091, "message": "@hashbo that's a great idea and one i've been giving considerable thought to recently. i have a more traditional HN-style startup idea that i've been kicking around, and may actively pursue once the semester winds down.", "group_id": 95, "id": 486204}, {"user_id": 776, "stars": [], "topic_id": 16186, "date_created": 1301592074.4811881, "message": "@bgalbraith sounds like a useful phd for getting into that type of market. do you have embedded electronics experience to build something like that? maybe some side projects in that direction might be a good start. small projects are definitely a great way to go.", "group_id": 95, "id": 493909}, {"user_id": 25457, "stars": [], "topic_id": 16186, "date_created": 1301597858.8334761, "message": "I'm dropping out of a nanoengineering phd program to build a web 3.0 Q&A site (tons of overlap, I know). I do research on medical diagnostics and I love it, but the window of opportunity for my web startup open now and it would kill me to spend 3+ more years on a phd when I could have a site up and running within a year.", "group_id": 95, "id": 494810}]