[{"user_id": 18425, "stars": [], "topic_id": 10561, "date_created": 1299179283.821981, "message": "I am thinking about getting Minecraft on my next paycheck. can someone give me a good description of how it actually works or what it is?", "group_id": 1103, "id": 262540}, {"user_id": 3609, "stars": [], "topic_id": 10561, "date_created": 1299188402.3402929, "message": "It's an integrated sandbox game essentially. There are multiplayer and single player modes (I prefer multiplayer now) and multitudes of ways you can customize the game play with mods, etc.  You gather resources and use them to create shelter, food, light, etc. Every evening, monsters spawn and can hurt you as well as your items (well, Creepers can hurt your items/structures).  So you're essentially working to survive and thrive in this new world. If you play multiplayer, other players can help you. There are also different modes so if killing monsters (or dealing with them) isn't your thing, you can turn that off as well.", "group_id": 1103, "id": 264020}, {"user_id": 3609, "stars": [], "topic_id": 10561, "date_created": 1299188441.3223341, "message": "I hope I described it somewhat well! It's basically a fantastic game and appeals to nearly every type of gamer/person. Even people who didn't think they'd like it at first ended up enjoying it.", "group_id": 1103, "id": 264036}, {"user_id": 581, "stars": [], "topic_id": 10561, "date_created": 1299191638.7643521, "message": "My friend back in London started a multiplayer server and we all play collaboratively on that. We're about to start a wild west mission to find other kinds of lands... hopefully!", "group_id": 1103, "id": 264687}, {"user_id": 581, "stars": [], "topic_id": 10561, "date_created": 1299191594.8309431, "message": "I like it because it's kind of like computer lego. You can make pretty much whatever ou dream up and the added challenge is the creepers, etc who can mess up your stuff.", "group_id": 1103, "id": 264681}, {"user_id": 18425, "stars": [], "topic_id": 10561, "date_created": 1299197432.825906, "message": "This definitely looks like something I would like to try. :)", "group_id": 1103, "id": 265169}, {"user_id": 18425, "stars": [], "topic_id": 10561, "date_created": 1299298791.436563, "message": "Alright, I broke down and bought it early lol.", "group_id": 1103, "id": 275076}]