[{"user_id": 8365, "stars": [], "topic_id": 4828, "date_created": 1297602015.1525071, "message": "like? dislike? from here it seems like a potentially complementary channel to Twitter, an opportunity to expand discussions from there to a medium with a bit more space to move around. you?", "group_id": 2747, "id": 90511}, {"user_id": 3456, "stars": [], "topic_id": 4828, "date_created": 1297604487.625499, "message": "reminds me a lot of FriendFeed Groups in that you can isolate the discussion to those who are part of the group.", "group_id": 2747, "id": 90816}, {"user_id": 8365, "stars": [], "topic_id": 4828, "date_created": 1297616594.1363969, "message": "hadn't thought of the FriendFeed comparison, but that is actually pretty apt. particularly from a segmentation perspective. this seems slightly lower friction in that it's less ambitious, but i take the point.", "group_id": 2747, "id": 92088}, {"user_id": 56, "stars": [], "topic_id": 4828, "date_created": 1297629632.6639359, "message": "supports different kinds of conversation from an email mailing list", "group_id": 2747, "id": 93241}, {"user_id": 56, "stars": [], "topic_id": 4828, "date_created": 1297629610.0450931, "message": "it's been working amazingly well for our YC group", "group_id": 2747, "id": 93237}, {"user_id": 56, "stars": [], "topic_id": 4828, "date_created": 1297633284.352916, "message": "really it fits the same niche as IRC, but much less annoying to use", "group_id": 2747, "id": 93947}, {"user_id": 56, "stars": [], "topic_id": 4828, "date_created": 1297633302.6384859, "message": "also being able to kick off a conversation then come back to it a day later is great, much better than IRC", "group_id": 2747, "id": 93952}, {"user_id": 3456, "stars": [], "topic_id": 4828, "date_created": 1297642513.7829659, "message": "my hunch is that the \"being able to come back to it later\" quaility will be negated once the user count increases - but yes, right now that is one of it's benefits.", "group_id": 2747, "id": 94819}, {"user_id": 3456, "stars": [], "topic_id": 4828, "date_created": 1297642599.7977691, "message": "the other benefit i'm seeing is discoverability - because it hooks into my social networks.  this makes me want to score it as an incremental improvement over IRC (but that's also my bias of \"OMG Yet Another Protocol Being Subsumed By HTTP!\"", "group_id": 2747, "id": 94823}, {"user_id": 9883, "stars": [], "topic_id": 4828, "date_created": 1297677905.579819, "message": "hearing @simonw i am all in. I guess a lot depends on how well they store and search- still the friendfeed sweetspot even as an orphan service", "group_id": 2747, "id": 97568}, {"user_id": 8365, "stars": [], "topic_id": 4828, "date_created": 1297699213.3594191, "message": "@simonw: interesting. if it's working well for the YC crowd - IRC fans if ever there were any - i'd count that as good news for Convore.", "group_id": 2747, "id": 100953}, {"user_id": 20554, "stars": [], "topic_id": 4828, "date_created": 1299989854.7363131, "message": "Convore kinda feels like what Google Wave was supposed to be like. My only concern for convore is how they'll deal with keeping up the signal -- moderating spam and trolls. In Twitter, you can unfollow/block. In IRC, you can kick someone out. What's the convore equivalent?", "group_id": 2747, "id": 338931}]