[{"user_id": 11626, "stars": [], "topic_id": 41906, "date_created": 1310621117.4648349, "message": "U.S. Government Builds First Law Enforcement Base in Puebla, Mexico\r\nA new ‘state-of-the-art’ U.S. base, currently under construction in Puebla, would be used to launch covert operations against drug cartels, says the Mexican opposition party.\r\nMario Andrade\r\nDeadlineLive.info\r\nJuly 12, 2011\r\n\r\nEarlier this year, in May, the governor of the Mexican State of Puebla, Rafael Moreno Valle, and the U.S. Coordinator for Plan Merida in Mexico, Keith W. Mines, held an inauguration ceremony for what they described as the most ‘sophisticated and modernized’ police academy in Mexico.\r\n\r\nThe 54-acre facility will cost $22 million. It will have barracks for about 500 personnel, two conference auditoriums, two chow halls, a helicopter landing area, four watch towers, a gun range, a forensic lab, a training court room, as well as smoke and fire simulation buildings, according to Mexican journalist Raul Rodriguez Cortes.\r\n\r\nAt first glimpse, to most Mexicans, it would seem logical to modernize the federal police; after all, there is an unprecedented crisis of violence and corruption throughout the country. Therefore, building a militarized police training base would seem like the best solution to tackle the problem… or so it seems.\r\n\r\nAccording to local activists in Puebla, the new ‘Ignacio Zaragoza Militarized Academy’ or AMIZ will serve as a covert U.S. Military base, where U.S. Special forces will train, rehearse, and launch black operations against Mexican drug cartels. Many Mexicans are in favor of this idea. However, there are many who oppose what they call a violation of their national sovereignty.\r\n\r\nOthers accuse the Mexican Government and the United States Government of building ‘a school of the Americas on steroids,’ even if the facility was only going to serve as a police academy.\r\n\r\nLocal Mexican Congressman from the ‘Convergence Party,’ José Juan Espinosa Torres is one of the biggest opponents of opening any military base in Puebla -whether Mexican or foreign. Also, a representative from the PRD Party, Enrique Alcántara Dzgaip has been organizing street protests against the construction of the base, calling it an ‘American intervention.’\r\n\r\nThe U.S. Coordinator for Plan Merida in Mexico, Keith W. Mines, the Governor of Puebla, and other pubic officials have admitted that many U.S. federal agents will serve as instructors at the base in order to ‘modernize’ the Mexican police force. Some U.S. Agencies will include the FBI, DEA, BATF and even NCIS, which is a military organization since it’s part of the U.S. Navy.\r\n\r\nSome of the street protesters in Puebla accuse the BATF (Bureau of Alcohol Tobacco and Firearms) of destabilizing Mexico because of the notorious ‘operation gunrunner’ or ‘fast and furious,’ where BATF agents sold weapons to the drug cartels. Using bullhorns in the streets of Puebla, the protesters are saying that the new ‘militarized police base’ will serve as a point of U.S. Government weapons distribution for the drug cartels. Furthermore, they claim that the so-called ‘modernized’ training will be received by many future police or military officers that will eventually switch sides and join the drug cartels. This has happened many times before in Mexico, like the time when Los Zetas deserted from the military and became the strike team for the Gulf Drug Cartel (which consists mostly, at least at the leadership level, of former state police officers from Tamaulipas).\r\n\r\nBut even if Mexicans were to oppose this, they may ‘supposedly’ not have a voice any longer. Last October, DeadlineLive.info reported that the Mexican Government -or at least the Mexican military and law enforcement- is now under under the command of NORTHCOM and the CIA through the ‘Office of Binational Intelligence.’\r\n\r\nThe CIA, the Department of Defense, the FBI, DEA, BATF, and many other U.S. Government federal agencies have been operating in Mexico for a long time. In fact, the U.S. Government recently built an intelligence super center at Paseo de la Reforma in Mexico City, not very far from the U.S. Embassy. Furthermore, the death of ICE Agent Jaime Zapata in San Luis Potosi, or even further back: the death of DEA Agent Kiki Camarena in the 1980′s demonstrates that U.S. Federal Agents have been operating in Mexico for decades.\r\n\r\nHow did this happen? And how was it even possible? One of the biggest root causes of this problem is the prohibition and criminalization of narcotics, which causes the prices of drugs to increase in the black market, which causes the drug cartels to increase their profits and become more powerful, which enables them to bribe politicians, public servants, military generals, law enforcement officials, and even intelligence agents on both sides of the border. All of these events happen as part of one gigantic vicious circle called the ‘War on Drugs,’ which is used as a pretext to carry out the agenda of the globalists and the international banks as they advance in one of their most significant steps: the integration of Canada, Mexico, and the United States, as well as the creation of what’s called ‘the North American Union.’\r\n\r\n\r\nhttp://deadlinelive.info/2011/07/12/deadline-live-exclusive-u-s-government-builds-first-law-enforcement-base-in-puebla-mexico", "group_id": 3920, "id": 1635093}]