[{"user_id": 11626, "stars": [], "topic_id": 6540, "date_created": 1297891388.0918109, "message": "The Russian space agency suggested Monday that a foreign power may have been behind the space accident that disabled one of the country's most modern military satellites earlier this month.\r\n\r\nRussia on February 1 launched a high-tech Geo-IK-2 craft to help the military draw a three-dimensional map of the Earth and locate the precise positions of various targets.\r\n\r\nNews reports said the satellite was a vital part of Russia's effort to match the United States and NATO's ability to target its missiles from space.\r\n\r\nBut the craft briefly went missing after its launch only to re-emerge in a wrong orbit that left the craft unable to complete its assigned task.\r\n\r\nThe Russian military and space agency set up a joint task force to probe the accident but it has presented no official results thus far.\r\n\r\nOne unnamed space official told Interfax however that initial evidence suggested that the craft went off target after one of its booster rockets inexplicably reversed course.\r\n\r\n\"The probable cause may involve electromagnetic intrusion on the automatic controls,\" the unnamed space official said.\r\n\r\nThe official did not identify the country he suspected of trying to derail the Russian military mission. But Moscow frequently accuses Washington of attempting to \"militarise\" space.\r\n\r\nThe space official conceded that there may have been other reasons for the launch failure. These included the wrong operations being programmed into the guidance system and other software mistakes.\r\n\r\nBut the Russian source stressed that the accident occurred between the first and second burns of the Briz-KM upper-stage booster rocket -- an area in which the craft makes no contact with ground control.\r\n\r\nThe official suggested that the electromagnetic pulse may have been aimed at the Russian craft \"from a land, sea, air or space vehicle.\"\r\n\r\nThe Geo-IK-2 mishap came less than five weeks after President Dmitry Medvedev fired two top space officials for a launch failure caused Russia to delay the deployment of its own navigation system.\r\n\r\nInvestigators said that accident was caused by a basic fuel miscalculation that made the craft too heavy to reach its required height.\r\n\r\nThe three Glonass satellites would have completed a system whose research had been started by the Soviet Union in 1976.\r\n\r\nhttp://www.spacedaily.com/reports/Russia_says_foreign_power_may_have_caused_spy_satellite_loss_999.html", "group_id": 3920, "id": 124577}]