[{"user_id": 9013, "stars": [], "topic_id": 11330, "date_created": 1299521090.8063071, "message": "What roles exist in a typical software tech startup? I want users to be able to set their “focus.” The groups I have identified so far are backend devs, frontend devs, designers, and business people. The last one is too broad I think.", "group_id": 95, "id": 289253}, {"user_id": 9013, "stars": [], "topic_id": 11330, "date_created": 1299521770.158802, "message": "I'm thinking of using a system where “Bf” means strong focus on backend, but knowledge in frontend development; “Fd” means strong focus on frontend/UX and some interest in design/gfx work; and “D” means only interested in design.", "group_id": 95, "id": 289355}, {"user_id": 15929, "stars": [], "topic_id": 11330, "date_created": 1299556785.801069, "message": "i think everyone in the team should sit in the middle spectrum of 2 or more role... like the backend guy also understand ui/ux, frontend guy also understand business / sales / marketing... and the business guy should (have to) be the jack of all trade to take the 'ceo' role...", "group_id": 95, "id": 293299}, {"user_id": 15929, "stars": [], "topic_id": 11330, "date_created": 1299556830.6185801, "message": "i think there's an article awhile back from YC blog about this... (/me off to google)", "group_id": 95, "id": 293303}, {"user_id": 13404, "stars": [], "topic_id": 11330, "date_created": 1299577594.6357009, "message": "It depends on the size of the startup. If you are starting small one or two talented people can do most of the things. Maybe with some help from freelancers where needed, e.g. design. Business is too general. What you really need is someone who can do marketing and customer development. And a developer that can build a prototype.", "group_id": 95, "id": 295095}, {"user_id": 7110, "stars": [], "topic_id": 11330, "date_created": 1299609921.170855, "message": "it's also helpful to have a clear delineation of roles and responsibilities before starting a venture with one ore more people, as things can get muddied quickly and feet get stepped on", "group_id": 95, "id": 298351}, {"user_id": 374, "stars": [{"date_created": 1299873227.7217, "user_id": 9018}], "topic_id": 11330, "date_created": 1299715021.9816921, "message": "In the earliest stages, startups need only two roles: building things and selling things. Both of those encompass what could be lots of roles: building things could be frontend, backend, ux design; selling things could be direct sales, PR, fundraising,recruiting. But it's best if you don't specialize to that level of granularity early on.", "group_id": 95, "id": 309427}, {"user_id": 16194, "stars": [], "topic_id": 11330, "date_created": 1299881541.73053, "message": "It also depends on your market. Sales people are more needed in an enterprise type of business from the beginning compared to a consumer one", "group_id": 95, "id": 327950}, {"user_id": 18129, "stars": [{"date_created": 1299889853.579416, "user_id": 719}, {"date_created": 1299900966.6803639, "user_id": 8327}, {"date_created": 1299946624.6428339, "user_id": 10406}, {"date_created": 1300028795.420099, "user_id": 1264}], "topic_id": 11330, "date_created": 1299884746.5265379, "message": "Just make sure employees don't start referring to themselves as director of this or manager of that if they don't actually direct or manage anyone.  At divvyshot we referred to ourselves as \"The designer\", \"The developer\" and \"The founder\".  The roles should emphasize \"doing\" as opposed to \"managing\"", "group_id": 95, "id": 328554}, {"user_id": 16271, "stars": [], "topic_id": 11330, "date_created": 1299892002.5182769, "message": "@pcardune when I was at Napster all the tech people had \"Member Technical Staff\" on our business cards. For very early stage I think that makes sense as the organization needs to be flexible and fancy titles cause politics. Although let me be clear we certainly did have a management structure and peoples jobs were pretty well defined., albeit flexible But MTS on the business card works. Don't recall what we put on the marketing business cards although really it was just two people in marketing when I was there. Well and Charlie but I think he was an intern or something.", "group_id": 95, "id": 329330}]