[{"user_id": 11626, "stars": [], "topic_id": 8688, "date_created": 1298529595.9271121, "message": "If technology advisers to online activists have their way, the mobile phones in the pockets of the democracy protesters reshaping the Middle East will have circumvention and anonymity tools built in to them, and they’ll be able to go blank if pro-regime goons confiscate them. The State Department wants to fund the development of precisely such activist tools. Only the activists aren’t exactly jumping to take the government’s cash.\r\n\r\nIn a speech last week, Secretary of State Hillary Rodham Clinton said she’d make available $25 million for a “venture capital approach” to underwriting new tools to keep the Internet open in repressive nations. She singled out mobile technologies as increasingly important. But some observers and developers, while lauding the move, aren’t so sure the rigid bureaucracy of the State Department can accommodate the approach.\r\n\r\nNathan Freitas of the Guardian Project, which designs Android-based tools for mobile anonymity, says he’s not going to apply for any of State’s money. “Accounting complexity of process means we’d have to spend 25 percent of it” on an accountant, he says, while praising the idea in theory.\r\n\r\nSame goes for Katrin Verclas of MobileActive.org, which advises activists and non-governmental organizations on how to minimize security risks on their mobile devices. Verclas likes where State is coming from, as she thinks it’ll expand the pool of government funding recipients beyond the typical Beltway aid groups who “know how to navigate the system.” But she’s not seeking the aid herself until she has a “really great project” ready to pitch.\r\n\r\nWhich might be surprising, because both of them have lots of ideas for how activists need to protect themselves when using their mobile devices. The basic problem is that mobiles are “highly traceable, trackable and centralized,” as Verclas puts it, with carriers possessing a lot of information on their users and without many circumvention tools developed for mobile phones. One of Freitas’ efforts is Orbot, a proxy tool for Android phones that uses Tor to block mobile carriers from accessing their data usage.\r\n\r\nAnd the phones are potential security risks even when they’re switched off. Verclas sees a big need for a remotely activated “kill switch” that can cleanse a phone of its stored contacts or its recent Twitter or SMS activity when an activist gets arrested, so as not to alert authorities to the names of other dissidents. Activists tell her they’d like to have some kind of phone wiping occur “with a simple command while an arrest is taking place, or for an ally to do that remotely via SMS or something.”\r\n\r\nFreitas worries about the proliferation of camera phones — a somewhat counterintuitive concern, given the power of viral videos to inspire a protest movement or galvanize outside support. But impromptu video can reveal sensitive information like people’s faces. He sees a need to “tap on these faces and blur them out” before an innocent upload accidentally gives away someone’s identity and puts them in the crosshairs of a regime.\r\n\r\nThese are the kinds of ideas that the State Department says it wants to fund. But it’s just not clear how nimble the department can really be in dishing out money responsibly — a good-government encumbrance, remember — or even what it really means by a “venture capital approach,” says Sheldon Himmelfarb, a technology expert at the U.S. Institute of Peace.\r\n\r\nWhen venture capital firms find a promising technology, they’re “able to turn lots of focus, attention, people, brainpower and resources to taking that to market, and the State Department doesn’t work that way,” Himmelfarb says. “It’s really interesting to hear them talk about a venture capital-style approach, but try to unpack that. Apparently, they’re going to give money to lots of organizations in the hope of bringing about breakthrough technologies, but how are they going to bring them to market?”\r\n\r\nIndeed, just last week, Sen. Richard Lugar identified at least $8 million in money the department hadn’t spent that Congress provided to help Chinese Internet users evade restrictions.\r\n\r\nThat’s not to say State’s approach doesn’t have its virtues. “Venture capital firms own half your company, while [here] the U.S. government owns nothing,” Freitas says, “so there is that benefit if you figure out how to make it work.”\r\n\r\nAnd Himmelfarb notes that the $25 million pot of cash is a “significant amount of money for this effort.” According to his research, the Tor Project’s 2009 budget was $1.25 million, so it’s not as if these tools are particularly expensive to develop. Rather, he says, “we have to make sure the approach is one we’re in position to take advantage of.” After the success of the Egyptian and Tunisian revolutions, there’s not going to be any shortage of demand for tools that can keep activists off the radar of the tyrants they’re trying to overthrow.\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/mobileactivists.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/mobile-tech-activists-wary-of-state-department-cash/", "group_id": 3920, "id": 195812}]