[{"user_id": 25716, "stars": [], "topic_id": 19877, "date_created": 1302996028.0383091, "message": "Hmm, un combinacion de SMS y cuenta de pago, tal vez...", "group_id": 965, "id": 713906}, {"user_id": 3665, "stars": [], "topic_id": 19877, "date_created": 1302995817.101522, "message": "Una forma es como cuando envías saldo. Cada changarro tiene un número al cual le envías el dinero. Aunque no sé si esto demore mucho la compra", "group_id": 965, "id": 713889}, {"user_id": 25716, "stars": [], "topic_id": 19877, "date_created": 1302996170.6104269, "message": "pero los changarros necesitos seguridad del pago", "group_id": 965, "id": 713922}, {"user_id": 26088, "stars": [], "topic_id": 19877, "date_created": 1302996928.897516, "message": "tarjetas de prepago?", "group_id": 965, "id": 714002}, {"user_id": 3665, "stars": [], "topic_id": 19877, "date_created": 1302995579.937042, "message": "Creo que la única opción es algo con el celular, por ende tiene que ser algo que funcione con todos los celulares, entonces. Creo que SMS's es la respuesta, ahora solo falta desarrollar el funcionamiento", "group_id": 965, "id": 713853}, {"user_id": 3665, "stars": [], "topic_id": 19877, "date_created": 1302995916.970438, "message": "Es el modelo de PayPal llevado a SMS's", "group_id": 965, "id": 713900}, {"user_id": 3665, "stars": [], "topic_id": 19877, "date_created": 1302995751.139375, "message": "Cualquier otra cosa implica \"darle\" algo al comprador y al vendedor...y tenemos que usar algo que ya tengan.", "group_id": 965, "id": 713876}, {"user_id": 25716, "stars": [], "topic_id": 19877, "date_created": 1302995897.267031, "message": "@Krator SMS tiena mucho limitaciones por pago, y tambien puede haber tarifas caras", "group_id": 965, "id": 713896}, {"user_id": 3084, "stars": [], "topic_id": 19877, "date_created": 1303000100.9226699, "message": "Se de una compañía fundada por un profesor del MIT que manejan pagos a través de móviles en la India", "group_id": 965, "id": 714165}, {"user_id": 3084, "stars": [{"date_created": 1303006659.7967041, "user_id": 25716}, {"date_created": 1303403767.882241, "user_id": 6227}], "topic_id": 19877, "date_created": 1303000465.0789599, "message": "http://www.technologyreview.in/business/26650/", "group_id": 965, "id": 714171}, {"user_id": 25716, "stars": [], "topic_id": 19877, "date_created": 1303006670.004873, "message": "@willygru gracias", "group_id": 965, "id": 714890}, {"user_id": 2946, "stars": [], "topic_id": 19877, "date_created": 1303016961.4721971, "message": "yo hace tiempo tuve una idea medio fumada que no me dejaba dormir. #1 una cuenta única relacionada a una dirección de e-mail. #2 tarjetas de prepago que linkeas a tu cuenta mediante sms o web. #3 Offline puedes pagar con tus tarjetas cuyo código QR puede ser leído hasta con un nokia viejito. #4 Online pagas con tu cuenta mediante una API súper facil de implementar.", "group_id": 965, "id": 715520}, {"user_id": 2946, "stars": [], "topic_id": 19877, "date_created": 1303017070.515429, "message": "El problema con una idea asi es que se necesita mucha, mucha, mucha lana. Relaciones comerciales y alianzas estratégicas con mucha gente de esas de las que cierran negocios en lúgares de table dance.", "group_id": 965, "id": 715543}, {"user_id": 2946, "stars": [], "topic_id": 19877, "date_created": 1303017130.655067, "message": "Y una infraestructura y  logística impecable porque en realidad solo hay una ventana de oportunidad muy pequeña de hacerlo bien.", "group_id": 965, "id": 715551}, {"user_id": 27753, "stars": [], "topic_id": 19877, "date_created": 1303046989.010947, "message": "La idea del SMS es correcta, en efecto YellowPepper lo hizo y tienen presencia en el país aunque no operaciones aún. Consulta su sitio YellowPepper.com", "group_id": 965, "id": 716738}, {"user_id": 29866, "stars": [], "topic_id": 19877, "date_created": 1303050856.288034, "message": "El problema de los SMS son los proveedores, por ejemplo Telcel te cobra el 60% de comisión si quieres ser \"agregador de telcel\", ofrecer servicios como esos de envía un SMS con la palabra \"X\". Es una empresa que difícilmente te ofrece algo para ganar y esos costos no pueden sustentar ningún modelo de negocio. Hay una empresa con la que puedes realizar pagos desde el celular via SMS, www.zong.com.   Lo realmente interesante podría ser tener el mismo modelo de Paypal pero con las cuentas corrientes o de debito, eso podría abrir mucho mercado.", "group_id": 965, "id": 716867}, {"user_id": 29866, "stars": [], "topic_id": 19877, "date_created": 1303051049.5092311, "message": "Conozco una empresa en Europa que funciona realizando cargos directamente a cuenta corriente y tarjetas de Debito, eso aun no existe en Latinoamerica. Se llaman www.webbilling.com", "group_id": 965, "id": 716870}, {"user_id": 19938, "stars": [], "topic_id": 19877, "date_created": 1303052559.350141, "message": "Pagos en changarros? define changarro. Si es la tiendita de la esquina, creo que el problema más grande no es uno tecnológico. Hay menos gente con celular y tarjeta de crédito de lo que  crees. Creo que hay más lana en soluciones como https://squareup.com/ para México.", "group_id": 965, "id": 716967}, {"user_id": 29866, "stars": [], "topic_id": 19877, "date_created": 1303053838.3576789, "message": "@edmz squareup.com funciona muy bien en USA porque allí hay cerca de 600 millones de tarjetas de crédito, 2.5 tarjetas de crédito por cada ciudadano y en México funcionaria solo para 13.2 millones de mexicanos que tienen tarjeta de crédito, la idea aquí es darle un servicio para \"pagos sin efectivo\" a los otros 100 millones de mexicanos. Recientemente la Condusef salio a decir que los mexicanos no saben usarla y que la tasa de morosidad es muy alta.", "group_id": 965, "id": 717075}, {"user_id": 29866, "stars": [{"date_created": 1303404934.2363541, "user_id": 6227}], "topic_id": 19877, "date_created": 1303054264.5934589, "message": "Tarjetas de crédito USA: http://bit.ly/g1Jg1a\nTarjetas de crédito MX: http://bit.ly/g3IRRJ", "group_id": 965, "id": 717124}, {"user_id": 19938, "stars": [], "topic_id": 19877, "date_created": 1303054341.7581761, "message": "@josuegio Estoy de acuerdo contigo. Creo que no me expliqué bien. En fin. Crees tú que hay suficiente gente que tiene acceso a celulares con saldo suficiente para hacer pagos? Yo me atreveria a decir que la mayoria son prepago y que traen lo suficiente para hacer llamadas. Si no fueran prepago, estamos casi en el mismo punto que usar tarjetas de crédito, porque el pago via sms con abono a una cuenta no-prepago es venta a crédito.", "group_id": 965, "id": 717131}, {"user_id": 29866, "stars": [{"date_created": 1303511734.1338511, "user_id": 12343}], "topic_id": 19877, "date_created": 1303057181.832468, "message": "@edmz No creo que la solución sea usar el saldo del celular, sino conectar tu banco o cuenta corriente al celular, haciendo que este SMS funcione como un (IPN) instant payment notification que envía una \"transferencia bancaria al usuario que esta vendiendo\" ejemplo de SMS: \"numero de comercio afiliado[espacio]monto[espacio] PIN\" el banco recibe la solicitud y revisa los fondos. Confirma y envía el (IPN) al comercio con \"Autorizado\". El usuario recibe una confirmación del pago y un SMS con su saldo.", "group_id": 965, "id": 717384}, {"user_id": 20146, "stars": [], "topic_id": 19877, "date_created": 1303168670.8773251, "message": "Los bitsCoins se me hace una buena idea ( + info http://www.bitcoin.org/ ), lo desarrollo un Japones expongo esto por que: se me hace muy interesante como plantea el problema de dinero/valor y la distribución de la riqueza desde una visión más socio-economica la cual resuelve vía \"algoritmos de confianza\" con computo distribuido en redes p2p.", "group_id": 965, "id": 733021}, {"user_id": 19720, "stars": [{"date_created": 1303405207.6248641, "user_id": 6227}], "topic_id": 19877, "date_created": 1303316360.2482071, "message": "A mi un sistema que se me hace super interesante es m-pesa (http://en.wikipedia.org/wiki/M-Pesa), transferencias de dinero por SMSM, que opera en Africa y es super popular por allá. El sistema es bien simple, la gente manda sus pagos desde su cel y recibe efectivo en la tiendita de la esquina. (un documental de 5min http://www.youtube.com/watch?v=zQo4VoLyHe0).", "group_id": 965, "id": 756541}, {"user_id": 6541, "stars": [], "topic_id": 19877, "date_created": 1303320068.0290899, "message": "@fitorec pero los bitsCoins estan regulados por alguna institucion? sino es asi no son seguros", "group_id": 965, "id": 757675}, {"user_id": 20521, "stars": [], "topic_id": 19877, "date_created": 1303324003.761838, "message": "No están regulados es como un p2p de pagos todo descentralizado según recuerdo y anónimo.", "group_id": 965, "id": 759016}, {"user_id": 2946, "stars": [], "topic_id": 19877, "date_created": 1303324921.303854, "message": "Yo no he podido entender como funciona bitcoins, si alguien quiere hacer un tldr; en español en algun blog se o agradecere. De preferencia con monitos.", "group_id": 965, "id": 759321}, {"user_id": 20146, "stars": [{"date_created": 1303405557.9376371, "user_id": 6227}], "topic_id": 19877, "date_created": 1303326799.1849711, "message": "@nekrox @jyr Sí los pagos son descentralizados, dejo parte de la conversación que sostuve con algunos compas en un hacklab respecto al tema. Espero mas tarde hacer un resumen de la conversación (q es bastante larga):\n\nBasicamente es una divisa que se llama Bitcoin, que se transmite de forma peer-to-peer, encriptada, anónima (incluso la persona que recibe el pago no sabe quién lo mandó). El dinero es creado por la misma red, ósea que cada quien participa en la creación progresiva de este dinero, dedicando tiempo de cálculo de parte de su CPU. Cuando corres el programa, puedes crear una o varias direcciones, a la cual te pueden mandar unos bitcoins, por ejemplo para apoyarte o contra un servicio.\n\n\nPara conseguir este dinero, también puedes generar monedas a través del programa. El dinero que generes es tuyo, te hecho te conviertes es una impresora de billetes, nada más que es legal y es la forma normal de producir este dinero (pero es lenta, no te creas).\n\nLos bitcoins tienen valor, no porque lo decidió un banco, sino porque la gente, entre sí, decidió que tiene. También hay gente que los empezó a cambiar contra otras divisas (actualmente dólares, euros y rubles), que también es una forma de conseguirlos. Actualmente 4 bitcoins valen 1 dólar. La transferencia de bitcoins entre la gente se hace por el programa. Es gratuita, anónima, cifrada, y totalmente descentralizada. Por lo tanto no se puede para, no se puede controlar. Incluso puedes tener muchas direcciones diferentes si no quieres que las conecten una con la otra.\n\nActualmente puedes comprar o vender servicios por bitcoins p.e.:\n\nhttps://vekja.net/", "group_id": 965, "id": 759714}, {"user_id": 6541, "stars": [], "topic_id": 19877, "date_created": 1303329239.6208739, "message": "@fitorec a lo que voy, no existe institucion que me ayude a reclamar mi dinero en caso de fraude por más circulo de confianza exista no hay garantia", "group_id": 965, "id": 760376}, {"user_id": 20146, "stars": [], "topic_id": 19877, "date_created": 1303338881.5114679, "message": "@jyr Sí de echo es el mismo problema que existe con el papel moneda en otra entidades, p.e. las 1ras emisiones del  dolar decían explícitamente que el valor de ese papel moneda se encontraba respaldado por un fideicomiso(un tesoro en bonos el cual desapareció con el lapso del tiempo), este mismo fenómeno a desatado otros temores como el conocido como \"el temor de los ahorrarores\"(revisar la crisis de la Gran depresión de EUA), sín mas este  mismo fenómeno se extendió a la representación del dinero digital.", "group_id": 965, "id": 762353}, {"user_id": 26088, "stars": [], "topic_id": 19877, "date_created": 1303341032.451319, "message": "Me suena como al Tumin pero digital :)", "group_id": 965, "id": 762652}, {"user_id": 26088, "stars": [], "topic_id": 19877, "date_created": 1303341401.416539, "message": "Estoy generando una  moneda dice 5 conexiones, como 10 mil bloques.. mm como cuanto tarda? usa como 10-20% del procesador :)", "group_id": 965, "id": 762678}, {"user_id": 29866, "stars": [], "topic_id": 19877, "date_created": 1303342867.9123249, "message": "@keoz Nunca generar dinero ha sido fácil, no creo que el digital sea la excepción. ;)", "group_id": 965, "id": 762882}, {"user_id": 26088, "stars": [], "topic_id": 19877, "date_created": 1303343308.3989971, "message": "@josuegio jeje ok sere paciente", "group_id": 965, "id": 762940}, {"user_id": 6541, "stars": [], "topic_id": 19877, "date_created": 1303353924.1253059, "message": "@fitorec de acuerdo, pero los brokers de bitcoins en su mayoria son online (desconozco si hay fisicos) supongamos que invierto mis 1000USD en \"x\" broker y al otro dia el sitio dejo de operar, ademas de que puso informacion falsa en el dominio ¿donde los localizo? y si toda moneda debe estar respaldado por algo, en México no estoy seguro si el peso lo respaldo el PIB pero ademas de eso esta la condusef donde podemos ver si algun broker es legal.", "group_id": 965, "id": 764842}, {"user_id": 6227, "stars": [], "topic_id": 19877, "date_created": 1303405714.6791539, "message": "@jyr es como que cerrara una casa de cambio donde cambiaste tus $1000USD por Pesos ¿que importa? ya tienes tus Pesos", "group_id": 965, "id": 773037}, {"user_id": 6541, "stars": [], "topic_id": 19877, "date_created": 1303406075.253226, "message": "@mariorz no, mas bien lo veo del lado que mis $1000USD los cambio a bitcoins y empezara a generar más entonces llegar al momento en que los brokers de bitcoins dejaran de operar (en el pero de los casos) ¿A quien le cobro mi inversion?", "group_id": 965, "id": 773067}, {"user_id": 6227, "stars": [], "topic_id": 19877, "date_created": 1303411515.036371, "message": "@jyr tus bitcoins son una moneda, si quiebra la economía de los bitcoins la moneda pierde todo valor, como en cualquier economía", "group_id": 965, "id": 774102}]