[{"user_id": 15743, "stars": [], "topic_id": 8869, "date_created": 1298580632.5121529, "message": "Greetings all!  I started this topic for anyone interested in porting their Flash games to mobile devices, a subject I am actively pursuing.  I have plenty to share and am eager to learn more. Send word if you're interested in meeting up at FGS.", "group_id": 4419, "id": 201973}, {"user_id": 15763, "stars": [], "topic_id": 8869, "date_created": 1298581964.5508001, "message": "I've compiled a flash game to Android and iPhone so far, I look forward to any tips...", "group_id": 4419, "id": 202181}, {"user_id": 15786, "stars": [], "topic_id": 8869, "date_created": 1298586428.583797, "message": "Super Rewards has both a lighweight platform for the deployment, distribution, and monetization of flash games to mobile (iOS and Android) - absolutely open to discussing at the show!", "group_id": 4419, "id": 202975}, {"user_id": 15824, "stars": [], "topic_id": 8869, "date_created": 1298594198.5174861, "message": "I'm developing a kid's mobile fun/educational and addictive game....target age is 6-9....think kids play on parent's iPhone while parent drives.....anyone interested in joint development; the game design is in development now....would love to meet others interested in this area....note, the game has NOT violence...that is a key philosophy of the company.  MJK", "group_id": 4419, "id": 204488}, {"user_id": 15763, "stars": [], "topic_id": 8869, "date_created": 1298610408.74157, "message": "@maryjean you may benefit from attending Startup Camp Game Edition starting tomorrow. Its like a mini game jam. http://san-francisco.startupcamper.com/", "group_id": 4419, "id": 206020}, {"user_id": 15824, "stars": [], "topic_id": 8869, "date_created": 1298651413.364552, "message": "Hi Thanks, but are company is a legal entity, with a game design and storyboard....e.g. we are further ahead then a Startup Camp....I've done one of these before and at this point can't afford to bring others into the process unless I have legal protections, meaning people are hired as \"work for hire\" on the project....I know I could always work on other projects, BUT it's a bit too much for me to give up the whole weekend....have a kid, university teaching/grading and the Flash conference on Sunday....perhaps I can view the Sunday demos and meet future potential programmers.", "group_id": 4419, "id": 209334}, {"user_id": 16236, "stars": [], "topic_id": 8869, "date_created": 1298781957.515363, "message": "The only issue I've had with using Flash CS5 to directly deploy to iOS and Android via AIR is screen size issues. I usually have to start a new document for different screen sizes.", "group_id": 4419, "id": 216451}, {"user_id": 15743, "stars": [], "topic_id": 8869, "date_created": 1298786162.447958, "message": "@yosunchang Adapting to variable screen sizes is a challenge for any mobile development project. With smaller screens, it's sometimes necessary to develop new solutions or ways for the user to interact (for example, in my latest mobile project I actually coded an entire suite of UI components based on Adobe's CS3 UI components (list, combo box, color picker, etc.).  Depending on the complexity of your application, you can also design fluid interfaces that adapt automatically to variable screen resolution and DPI. Here's a great article that explains how to do so: http://www.adobe.com/devnet/flash/articles/authoring_for_multiple_screen_sizes.html\n\nThe beauty of CS5 is that you have one coding language and one suite capable of handling all your needs vs. having to recode your entire game's source code over again. I'd love to chat more with you and others at FGS interested in learning and sharing more about mobile game development using Flash.", "group_id": 4419, "id": 216647}, {"user_id": 15743, "stars": [], "topic_id": 8869, "date_created": 1298786738.3235519, "message": "@lavonwoods I know you from Twitter! Let's talk more tomorrow.", "group_id": 4419, "id": 216660}, {"user_id": 15763, "stars": [], "topic_id": 8869, "date_created": 1298794825.713762, "message": "@rossD20Studios sure, email me at lavon [at] gamebuilderstudio.com, I will shoot you my contact info back", "group_id": 4419, "id": 216823}, {"user_id": 15889, "stars": [], "topic_id": 8869, "date_created": 1298795640.4984419, "message": "@lavonwoods  ! Hey , I went through your website. I want toknow more. add me at skype : nileegames or mail me anand.jha@nileegames.com", "group_id": 4419, "id": 216832}]