[{"user_id": 11626, "stars": [], "topic_id": 7455, "date_created": 1298107701.505477, "message": "http://i.dailymail.co.uk/i/pix/2011/02/17/article-0-0D3E0D81000005DC-534_634x541.jpg\r\n\r\nhttp://i.dailymail.co.uk/i/pix/2011/02/17/article-0-0D3E0D88000005DC-44_634x563.jpg\r\n\r\nhttp://i.dailymail.co.uk/i/pix/2011/02/17/article-0-0D3E3971000005DC-959_634x414.jpg\r\n\r\nA pocket-sized spy drone disguised as a hummingbird has been unveiled by a major Pentagon contractor measuring just 16 centimetres and weighing less than an AA battery.\r\n\r\nThe mini spy plane can fly up to 11 miles an hour and took five years to develop at a cost of $4million.\r\n\r\nArmy chiefs hope to use the drone’s tiny camera to spy on enemy positions in war zones without arousing detection and eventually deploy it into both rural and urban environments.\r\n \r\nUnsuspecting: The tiny hummingbird spy drone has a wingspan of just 16 centimetres and propels itself like a real bird - just by flapping its little wings\r\n\r\nExperts hope the drone, which can fly just by flapping its wings, compared with current models which rely on propellers, will eventually be able to swoop through open windows and perch on power lines.\r\n\r\nThe demonstration by AeroVironment – one of the world’s biggest drone suppliers – lasted eight minutes and saw the new creation fly through a door into an building and out again, and withstand winds of five miles per hour.\r\n\r\nTodd Hylton, Hummingbird programme manager for the Pentagon’s research arm said it ‘paves the way for a new generation of aircraft with the agility and appearance of small birds.’\r\n \r\n\r\nTest: The $4million project has taken five years. The latest demonstration saw the drone fly into and out of a building at 11mph, and withstand 5mph winds for the eight minute flight\r\n\r\nMatt Keennon, AeroVironment’s manager on the project, said the milestone of building a machine inspired by nature pushes the limits of aerodynamics.\r\n\r\nHe added: ‘This is a new form of man-made flight’.\r\n\r\nTwo years ago the company showed off its first Hummingbird prototype, managing just 20 seconds. The latest flight lasted eight minutes, with engineers expecting longer flights as development continues.\r\n\r\nAeroVironment already produces a number of different drones for the US Army.\r\n\r\nLast year it had 2,182 orders from the army for its Raven drone, which weighs four pounds with a wingspan of four-and-a-half feet.\r\n \r\nCurrent drones, like the $30million Global Observer, pictured, are shaped like planes - but the new hummingbird creation is aimed at going unnoticed behind enemy lines\r\n\r\nAround 86 per cent of its orders come from the Government, meaning last year it was paid a whopping $215million from the Department of Defense.\r\n\r\nThe company, based in California with 732 full-time employees, expects to sell even more drones to the Government once rules are relaxed to allow spying within America.\r\n\r\nThe unveiling of the Hummingbird comes just weeks after the same company launched its $30million Global Observer with a wingspan similar to a Boeing 747 which can survey an area as large as Afghanistan.\r\n\r\nChris Fisher, project manager at AeroVironment explained: ‘It gives the guy on the ground the opportunity to see what’s on the other side of the hill.  There’s only so much you can see with binoculars.  A small [drone] can get up and go over the hill. That gives the ground soldier a capability that is huge.\r\n\r\nHe added: ‘One of the things we benefit from is the average young person in the military has hours and hours of video games experience. They are attuned to holding these things in their hands; moving the joysticks around with their thumbs and that’s how our planes are flown. To an 18-year-old it’s extremely simple.’\r\n\r\nhttp://www.dailymail.co.uk/sciencetech/article-1358078/Is-bird-Is-plane-No-armys-latest-4million-spy-drone-disguised-hummingbird-measuring-just-16-centimetres.html", "group_id": 3920, "id": 149123}]