[{"user_id": 11626, "stars": [], "topic_id": 6292, "date_created": 1297838088.6881001, "message": "One of the reasons I listen closely to Gen. James Mattis is that he is an avid student of history, and uses lessons from past wars to guide the work he and other folks down at Joint Forces Command are doing to re-craft operational concepts.\r\n\r\nMattis says future wars will be of the hybrid variety, characterized by a mixture of conventional and unconventional operations blending both high-tech attacks, such as cyber, and low tech, such as IEDs, all on the same battlefield.\r\n\r\nBecause of a hybrid enemys adaptability and fluid nature there is no single template for the threat, such as there was in Cold War days when one could template a Soviet Motorized Rifle Battalion down to the individual vehicle. But there is a textbook example of a hybrid war, Mattis says: Israels fight in south Lebanon against Hezbollah in 2006. Frank Hoffman, who writes extensively on hybrid threats, said the Lebanon war is the Grozny for the 21st century; a contemporary war that will be picked apart and analyzed for potential lessons.\r\n\r\nIn our continuing exploration of hybrid threats and their implications for doctrine and organization, we drill down a bit deeper into some of the lessons Israel took from that conflict. Long revered as one of the most formidable militaries in the world, military professionals took notice when the IDF was roughly handled by Hezbollah. The Israeli military itself launched some 50 internal probes to determine what went wrong.\r\n\r\nIDF Brig. Gen. Itai Brun, former leader of the IDFs Intelligences Research Division, was tasked with re-writing IDF doctrine and operational methods to avoid a repeat of the militarys dismal performance. I was passed along a briefing given last year by Brun summarizing lessons learned. He called the war a wake-up call, and his analysis of the Hezbollah hybrid archetype is interesting.\r\n\r\nBrun defined Hezbollah as a terrorist organization with the structure and capabilities of a state-like regular army and with a guerrilla mode of operation. Hezbollahs strategic concept was victory through non-defeat; which meant Israels tactical victories were of little to no importance. Hezbollah began the war with some 10,000 fighters equipped with vast quantities of anti-tank guided missiles, anti-aircraft missiles, a large arsenal of rockets, some 1,000 long range (up to 250 km) and 13,000 shorter range, an air unit equipped with aerial drones and a naval unit with anti-ship missiles. Hezbollahs operational concept was the continuous launching of rockets into Israels cities even in the face of a significant IDF ground maneuver.\r\n\r\nHezbollah pursued what Brun called a strategy of disappearance: command posts and arms stored in civilian buildings; launching rockets from civilian surroundings and sensitive sites such as mosques and schools; use of low signature weapons including rockets, mortars and anti-tank missiles; and Hezbollah employed extensive camouflage and field fortifications such as tunnels and bunkers. As military analyst and former general Bob Scales told me, Hezbollahs ability to fire rockets, move fighters and resupply when the Israeli Air Force had complete air dominance, was one of the big surprises of the war.\r\n\r\nRead the rest of this story over at DoD Buzz…\r\n\r\nhttp://defensetech.org/2009/06/09/israeli-lessons-on-hybrid-war", "group_id": 3920, "id": 117998}]