[{"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307521705.189733, "message": "I'm one month away from releasing a platform similar to Airbnb's. The website design/revenue model/value is all really solid, I just need to get fundi somehow. Anyone have any recommendations, or can anyone connect me?", "group_id": 250, "id": 1334894}, {"user_id": 30354, "stars": [{"date_created": 1307540589.5019281, "user_id": 26065}], "topic_id": 38591, "date_created": 1307540116.6914141, "message": "Angel List!", "group_id": 250, "id": 1337034}, {"user_id": 26065, "stars": [{"date_created": 1307649160.983371, "user_id": 5928}, {"date_created": 1308384277.975909, "user_id": 25414}, {"date_created": 1309243692.80777, "user_id": 36971}], "topic_id": 38591, "date_created": 1307540516.523689, "message": ":P Seriously, go to quora.com and read everything you can about startups,.. go to bothsidesofthetable.com, steveblank.com and Fred Wilsons blog. Check out Venture Hacks. Read all from start to end. Do NOT post anything on Angellist before you have done so, angellist is a one shot deal per company, if you don't know what you are doing you will be burnt.", "group_id": 250, "id": 1337165}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307548245.4438961, "message": "I read most of those blogs, all of them are great. I work at a tech startup in sf too, so I feel up to date with the news also. I just need an investor to believe in me, but meeting one has been kinda tough. The idea is solid though, no other site does this, and there's a huge market. I just needa get connected with an investor before we launch in 3.5 weeks", "group_id": 250, "id": 1338619}, {"user_id": 26065, "stars": [], "topic_id": 38591, "date_created": 1307551836.9163561, "message": "May I ask why you need funding when you are ready to launch in 4 weeks?", "group_id": 250, "id": 1339193}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307554391.3345039, "message": "A big part of our site is just showing people that they can make money with our service, and although advertising/etc might not be too expensive, I'd prefer not to have our growth limited  at the beginning just because of funding limitations", "group_id": 250, "id": 1339542}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307554140.6264279, "message": "We pretty much used up all our funds for the project, and won't have much to work with when we start. Funding would help us with marketing, possibly hiring another coder, and just overall growth of firm with things that we'd need to purchase when starting (seo/advertising/renting a small office so our team is actually working together)", "group_id": 250, "id": 1339508}, {"user_id": 26065, "stars": [], "topic_id": 38591, "date_created": 1307554859.487313, "message": "Now without knowing any details I think that most of the items on your list are not really necessary for a successful launch. Asking for funding 4 weeks before a launch AND in the dead Summer season is not good and puts you in a tough spot valuation wise. It will be much easier if you launch and have traction (most sites don't anyways). Once you have real users things will start to look totally different. Still it will take some time to convince people to invest in your company especially if they have never met you before. If I'd be in your position I would hang out at all those startup meetups, get to know fellow Entrepreneurs and pitch your product to everyone. When people know you they might refer you to Angels But again, this will be much more valuable if you have the product online.", "group_id": 250, "id": 1339614}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307556279.9451301, "message": "The service we provide actually fits well with summer.  I understand and agree with all of your points, but at the end of the day, if we don't even have more than 5k to work with after we launch, our overall ability to grow and adjust will not reach full potential", "group_id": 250, "id": 1339853}, {"user_id": 26065, "stars": [], "topic_id": 38591, "date_created": 1307558558.4470479, "message": "I cannot give you valuation advice, as this is always a matter of negotiation. But I give you another advice. Be very careful how you pitch it. If you say 'platform similar to airbnb' you put yourself in the wrong spot (no one invests in a airbnb competitor). Instead explain it like 'we created a marketplace that allows people to directly trade in XXX instead of having to go through a middleman. This creates a new market or significantly changes the cost structure in an existing market, whose size right now is YYY. Something along those lines, obviously refined and adapted to your situation.", "group_id": 250, "id": 1340481}, {"user_id": 26065, "stars": [], "topic_id": 38591, "date_created": 1307556964.274893, "message": "Ok, the amount you need changes it of course :P Frankly, you can do a quick tripple F which is probably the easiest, or try kickstarter (be creative in what you offer), or just ask fellow Entrepreneurs. A lot of people are able to and sometimes willing to write a cheque over 5k. Or do some consulting.", "group_id": 250, "id": 1339975}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307558018.869338, "message": "Thanks a bunch for all your advice. 20k would be ideal. Do u know how much equity in the company would be fair for 20k? Assuming it's a platform similar to airbnb", "group_id": 250, "id": 1340322}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307563540.8276629, "message": "Thank u . That helped a lot!", "group_id": 250, "id": 1341924}, {"user_id": 35591, "stars": [], "topic_id": 38591, "date_created": 1307644360.6275289, "message": "anyone know any Angels near sf ? Our platform has a very defined revenue stream /high demand", "group_id": 250, "id": 1352443}, {"user_id": 14161, "stars": [], "topic_id": 38591, "date_created": 1307741511.9642749, "message": "Hey Sneaks, I'm more-or-less in your same position, raising an angel round (Just cashed our first check for $75k today), and I would echo most of what @martin_sunset said.  I'd be careful not to sound like the success of your business relies on raising this $20k.  That never sounds good.  Based on my experience, I'd also say that you'll have WAY more luck attracting funding after you launch, as opposed to before you launch.  In fact, I can't stress that enough.  Investors don't really fund business plans and/or ideas these days, unless you have a really strong and proven track record.  As for finding investors, I'd recommend meetups for tech/startups/entrepreneurship and ask other founders who's funding them, and perhaps they'll refer you.", "group_id": 250, "id": 1366211}, {"user_id": 14161, "stars": [], "topic_id": 38591, "date_created": 1307741728.5111899, "message": "And here's a good post on the subject that was just published today:  http://cdixon.org/2011/06/09/notes-on-raising-seed-financing/", "group_id": 250, "id": 1366259}, {"user_id": 26065, "stars": [], "topic_id": 38591, "date_created": 1307745347.8075171, "message": "@MyWorld_by_Ryan thanks for posting that link, and congrats. The first check is always the sweetest, treasure that moment.", "group_id": 250, "id": 1366816}, {"user_id": 14681, "stars": [], "topic_id": 38591, "date_created": 1308227373.527436, "message": "friends and family would be a lot better for you then an VC or Angel.  You are going to be giving up a lot for a very little, unless you already have high traction with revenue coming in or if you have built something in the past that was successful.", "group_id": 250, "id": 1409395}, {"user_id": 15929, "stars": [], "topic_id": 38591, "date_created": 1308247557.074903, "message": "@jeremy1217 unless it was the friends / family money that's running out and need a \"wee-bit\" more...", "group_id": 250, "id": 1412361}, {"user_id": 15929, "stars": [], "topic_id": 38591, "date_created": 1308248255.2610919, "message": "imho, do a quick side job,.. depends on how big your team is, it's possible to pull together 5-10k fast enough...", "group_id": 250, "id": 1412445}, {"user_id": 23304, "stars": [], "topic_id": 38591, "date_created": 1308312867.5794671, "message": "I agree with unwrangle. Try not to take investors for very small amounts of money because they screw up va", "group_id": 250, "id": 1418375}]