[{"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303127658.3952, "message": "I need to use a nonrel database for a certain type of data in my models that requires a different number of properties/columns per object, which MongoDB is great for this. But also I would like to use Postgres if possible with the rest of my models, is that possible?", "group_id": 81, "id": 725391}, {"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303127803.851337, "message": "I'll be able to do \"JOIN\"s (or at least select_related() ) between databases?", "group_id": 81, "id": 725410}, {"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303128554.6378379, "message": "@micrypt yes, I was thinking on use MongoEngine, I've heard good things about it", "group_id": 81, "id": 725484}, {"user_id": 719, "stars": [], "topic_id": 20082, "date_created": 1303127960.2693119, "message": "@Leech Unlikely. You could check out http://mongoengine.org, which has a similar API to the Django ORM. However, I believe you'd still need handle \"JOIN\"s yourself.", "group_id": 81, "id": 725429}, {"user_id": 3354, "stars": [], "topic_id": 20082, "date_created": 1303128125.876236, "message": "I'd say the nature of MongoDB's document store is such that JOINing with relational data might not be a natural thing to do anyway. Just an observation in ignorance of your data or application. I'd retain MongoDB IDs as \"foreign keys\" from relational tables, then build an appropriate layer over MongoDB for the non-relational stuff entirely separately from the ORM.", "group_id": 81, "id": 725443}, {"user_id": 3965, "stars": [], "topic_id": 20082, "date_created": 1303129145.2686851, "message": "@leech I've been working on something similar with https://github.com/cmheisel/django-jamsession and from what I can tell you'll have to implement your own admin. That said I'm hoping to be able to extract a non-rel capable admin out of jamsession at some point.", "group_id": 81, "id": 725535}, {"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303128676.83582, "message": "@holdenweb thanks, what do you think about using the whole database in MongoDB? managing by myself all the JOINs, this way would be even better, but I'm not sure about several things like Django's Admin interface, and other default stuff that I may need, working under MongoDB.", "group_id": 81, "id": 725500}, {"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303243818.111901, "message": "We've finally decided to leave Django run in postgres (as it is doing now) and use MongoDB for specific stuff we need to, and then create our own admin views for this data.", "group_id": 81, "id": 746289}, {"user_id": 7179, "stars": [], "topic_id": 20082, "date_created": 1303243845.9128449, "message": "This way we wouldn't deal with problems in current admin logic running in MongoDB", "group_id": 81, "id": 746303}]