[{"user_id": 22052, "stars": [], "topic_id": 20705, "date_created": 1303396605.0120859, "message": "If I owned a slice from slicehost and wanted to split it into 5 websites, what would be the best way? I could use chef to setup my server (thanks to the presentation via @fnichol), but for me it gets murky in the web server area. What's the best one to use? What's the easiest way to setup different websites on a server? What's the easiest way to push to each website individually?", "group_id": 4606, "id": 770702}, {"user_id": 22052, "stars": [], "topic_id": 20705, "date_created": 1303396825.282197, "message": "In C# we'd create a new IIS server, create a website and then push up the website via visual studio (rinse repeat for many sites). It basically holds my hand and says \"you're awesome at uploading web sites\". I'd like something like that for rails :D\\", "group_id": 4606, "id": 770752}, {"user_id": 21842, "stars": [], "topic_id": 20705, "date_created": 1303402384.6913829, "message": "Interesting... I guess you would need rvm to keep the environments independent too.", "group_id": 4606, "id": 772121}, {"user_id": 22052, "stars": [], "topic_id": 20705, "date_created": 1303403801.3705959, "message": "Damn, good point. I think there's a way you can package the gem within the actual application or something like that. Freezing? So maybe you'd have to do that if you were hosting it.", "group_id": 4606, "id": 772612}, {"user_id": 2633, "stars": [], "topic_id": 20705, "date_created": 1303414612.1563959, "message": "Depends on what the sites are. You could use mongrel2 with basic proxies and run all the sites (assuming they have some built in webserver) separately, or setup nginx with various sites", "group_id": 4606, "id": 774762}, {"user_id": 21842, "stars": [], "topic_id": 20705, "date_created": 1303417494.3134689, "message": "@RyanOnRails Hmmmm, I wasn't thinking that you could freeze rails, but that's a good point.  Anyone know if freezing rails works?  What gets executed when you use \"rails <command>\" commands if you freeze rails?", "group_id": 4606, "id": 775299}, {"user_id": 21834, "stars": [], "topic_id": 20705, "date_created": 1303489950.7362511, "message": "Nginx/passenger/bundler/rvm should be all you need.", "group_id": 4606, "id": 782704}, {"user_id": 14826, "stars": [], "topic_id": 20705, "date_created": 1303512284.2035639, "message": "@benzittlau @RyanOnRails Don't bother freezing rails.  Just \"bundle install --deployment\" and your gems will get installed to the vendor/bundle folder.  It keeps your apps nice and separate.  You don't even need RVM unless you want different rubies.  http://gembundler.com/deploying.html", "group_id": 4606, "id": 785840}, {"user_id": 14826, "stars": [], "topic_id": 20705, "date_created": 1303512475.054703, "message": "@RyanOnRails The biggest issue that you're going to have with 5 apps on a slice is that you're going to run out of resources unless you go for a bigger slice.  At work, we have a staging environment with 5 or 6 rails apps and the 512MB Linode wasn't enough.  At 1GB it works pretty well but also has a really light load.  If you're looking at production apps, stick with a slice per app.  Even that won't be enough if you get any kind of load.", "group_id": 4606, "id": 785856}, {"user_id": 14826, "stars": [], "topic_id": 20705, "date_created": 1303512063.8506241, "message": "@Blaze I prefer unicorn over passenger but agree with the stack.", "group_id": 4606, "id": 785824}, {"user_id": 22052, "stars": [], "topic_id": 20705, "date_created": 1303743308.1108999, "message": "@mm53bar Thanks for the awesome advice :)", "group_id": 4606, "id": 803962}]