[{"user_id": 11626, "stars": [], "topic_id": 21572, "date_created": 1303882798.9801071, "message": "Also cross-posted on SCMLA Meetup for those of you who don't do Facebook:\r\n\r\nhttp://www.meetup.com/socalmartiallawalerts/messages/boards/thread/10756329", "group_id": 3920, "id": 822299}, {"user_id": 11626, "stars": [], "topic_id": 21572, "date_created": 1303882494.7728491, "message": "https://www.facebook.com/?sk=messages&tid=10150165547588048#!/notes/warren-yeh/please-share-current-radiation-danger-and-ideas-for-preparation/10150226483204595\r\n\r\n[PLEASE SHARE!] Current Radiation Danger & Ideas for Preparation", "group_id": 3920, "id": 822283}, {"user_id": 11626, "stars": [], "topic_id": 21572, "date_created": 1303882566.272738, "message": "[PLEASE SHARE!] Current Radiation Danger & Ideas for Preparation\r\nby Warren Yeh\r\nApril 26, 2011\r\n\r\nTo all whom this may concern~\r\n\r\nThis thread is written to raise awareness so all of us can make the best decisions for ourselves and loved ones. Everyone is welcome to add their own research to this thread. I update my facebook daily with posts/articles so if any of you are interested, you can add my e-mail: warrenyeh@ymail.com. My FB wall is a lot easier/graphic place to post up links. I will update this as much as I can.\r\n\r\n(Disclaimer: This thread is for educational purposes only and is not liable to any consequences that may derive. None of this should be taken as medical advice and readers are encouraged to act accordingly to their own research. Also, I am not an expert of any sort so please correct me wherever I may be mistaken).\r\n\r\n1. The nuclear disaster in Japan is NOT YET CONTAINED. TEPCO estimates that they will need about 9 months to contain the situation. (http://finance.yahoo.com/news/Japanese-government-under-apf-2730099735.html?x=0) This means that radiation is still leaking. California radiation levels in rainwater are at the highest it's ever been since the beginning of the crisis. http://enenews.com/new-epa-tests-show-cesium-california-rainwater-highest-level-fukushima  Also Japan has been bombarded with hundreds of earthquakes since the initial 9.0 on March 11, 2011, with many of them being over 5.0. They are having a 5.0 earthquake as I type this. I don't see this situation being resolved any time soon. http://earthquake.usgs.gov/earthquakes/recenteqsww/Quakes/quakes_all.php\r\n\r\n2. Wind patterns are blowing the radiation east from Japan  towards the US. The professors/researchers I've spoken with all said with confidence that unless we are in the immediate proximity of Japan, we should not worry about the fall-out at all. One of them even went so far to say \"As for me, I will continue to enjoy drinking my milk\".. This professor actually worked with the state department of health in Seattle, WA and has informed me that because levels are so low, they are shutting down their monitoring campaign. This was three weeks ago. Forecasts have since been continuously showing large plumes of radiation covering the US. Here is the most recent one: http://enenews.com/new-type-fukushima-forecast-shows-cesium-iodine-clouds-canada-april-25-videos Now is not the time to be shutting down any form of radiation monitoring.\r\n\r\n3. ANY RADIATION IS BAD! Countless research has shown that any increased exposure to radiation has strongly correlated with higher rates of cancer/disease/mortality. (http://www.cheec.uiowa.edu/misc/radon.html , http://www.euradcom.org/2003/execsumm.htm , http://www.nejm.org/doi/full/10.1056/NEJMoa0901249 ,  http://toxnet.nlm.nih.gov/cgi-bin/sis/search/a?dbs+hsdb%3A%40term+%40DOCNO+7389)\r\n\r\n4. Misleading comparisons between Internal & External Radiation. The Gov't, Media, and \"Experts\" have all made statements such as \"you have to drink x amount of milk to receive the same amount of radiation from a roundtrip flight in the continental US\". This is misleading because having radiation inside your body, constantly irradiating you inside out, is different than background radiation from, say, standing next to a rock. Even getting an x-ray takes only a matter of seconds. Ingesting/inhaling radioactive particles or foods that has been contaminated with radiation means having that radiation in your body for a long time. It takes an extremely long time to excrete all the radiation out. The professors I spoken to ALL CONFIRMED that there is a difference between internal and external radiation, and that internal is worse. That doesn't stop them from reassuring me though that everything is okay because levels are so low. Unfortunately, they DO stop replying after I ask about bio-accumulation and how misleading comparisons are not accurate.\r\n\r\n5. Bio-accumulation? Remember, we will not drop dead from drinking one glass of milk. What we are concerned about here is having the radiation accumulate inside your body. It is the amount of exposure we are trying to limit and quite frankly, I can imagine a person innocently drinking one glass of milk a week here and there for a whole year. Maybe eating cheese here and there also or a garden salad. Remember, this is all on TOP of normal background radiation. And background radiation, is still nevertheless external. \r\n\r\n6. Radiation is in our food chain. I think a simple way to look at it is that all foods that are grown/harvested/produced after March 2011 that are exposed to rain/air have already been contaminated. Rainwater: http://enenews.com/new-epa-tests-show-cesium-california-rainwater-highest-level-fukushima Tap Water: http://enenews.com/new-epa-data-shows-iodine-131-los-angeles-tap-water-testing-radioactive-cesium Milk: along with spinach, arugula, mushrooms, etc. (http://enenews.com/latest-ucb-test-results-first-time-radioactive-cesium-found-arugala-kale-spinach-around-san-francisco) http://www.nuc.berkeley.edu/node/2174\r\n\r\nWhat does all this mean?\r\n\r\n \r\n\r\n1. DO NOT TRUST THE GOVERNMENT AND ANY FORM OF MAINSTREAM NEWS!!! Unless you want to believe Ann Coulter that radiation is good (http://articles.nydailynews.com/2011-03-18/news/29179537_1_radiation-nuclear-reactor-japan).\r\n\r\n \r\n\r\n2. \"Experts\" even in Academia are just as brainwashed as those in the media. The professors I've spoken to all have focused on Iodine 131's short half life, low/negligible levels, and how there is nothing to worry about. There is a whole range of isotopes leaking out of those reactors. Cesium has already been found in raw milk in SF. They all stop responding after I ask about bio-accumulation and about the misleading comparisons between internal vs external radiation.\r\n\r\n3. The EPA is not on our side. They are making the same statements as UCB and their data is incompetent. The EPA has also been trying to raise acceptable levels of radiation for YEARS!!! If they succeed in updating their PAGS, we will be able to drink a year's worth of radiation in one glass of tap water and that will actually be LEGAL.\r\n\r\nhttp://www.peer.org/news/news_id.php?row_id=1325 Michael Ruppert supposedly also interviewed Daniel Hirsch over the phone about this issue (http://www.collapsenet.com/free-resources/collapsenet-public-access/item/723-fallout).\r\n\r\n4. Independent ground level geiger counters (such as Idaho: http://www.ustream.tv/channel/radiation-detection---dri\r\n\r\nggs-idaho , http://www.simplyhydroponic.com/geiger-counters-abroad.php , West L.A: http://www.ustream.tv/channel/live-radiation-monitoring-from-west-la )  have been inconsistent with readings from sites such as blackcatsystems, www.radiationnetwork.com , and even the www.EPA.gov. There has been recorded spikes in radiation from all over yet sites such as radiationnetwork or blackcatsystems continue to show \"normal\". April 12, Idaho's CPM level was close to 200 (from above link) and radiationnetwork did not detect such spikes. Similar spikes were seen in many other places yet radiationnetwork and blackcatsystems data are inconsistent. I understand that there are many reasons for detected spikes in radiation and that these spikes might not have resulted from Japan but shouldn't the readings from given examples be consistent with sites that are largely advocated such as radiationnetwork? This is one of the main reasons I'm having a hard time trusting these monitors.\r\n\r\n \r\n\r\n5. Therefore, I would argue that radiation monitors from EPA, radiationnetwork, and blackcatsystems are incompetent and the reasons are two-fold. One reason is what I explained above. The second more important reason is that there are not enough radiation monitors to truly gauge accurate data. I understand that this is why there are a number of networks in place to fill the void, yet around the week of March 25, 8 out 18 of EPA's West Coast radiation monitors were undergoing \"quality review\". The timing couldn't have been better. Although I'm not an expert in science, I do understand that more data = more accurate findings. The EPA has radiation monitors that can detect instantly and could have been putting more along the West Coast instead of taking them down.The West Coast is a very large land mass for only 10 monitors to handle. Shouldn't we be implementing more monitors? Is it fair to say that these monitors are not completely accurate? (they are also not able to detect the full range of isotopes being carried over). \r\n\r\nSo what can we do?\r\n\r\n \r\n\r\nChanging our lifestyles. Surviving a nuclear disaster can be easy if you know how to change simple lifestyle habits and are prepared. Remember, younger people are most susceptible, especially those that have not been born yet.\r\n\r\n1. supply of food & water that were produced/harvested/bottled prior March 2011.  \r\n\r\n2. stay inside as much as possible.\r\n\r\n3. When driving, keep the windows up with the air conditionining/fan circulating the air as opposed to getting air from the outside.  \r\n\r\n4. Quarantine protocols inside the home and try to keep radiation levels in your living environment as low as possible. This means, not walking around with shoes that have be exposed to the outside. Clothes that are worn for the outside are kept separate from clothes worn inside the house. Simple rule, KEEP IT OUT as much as possible.\r\n\r\n5. Staying away from vegetables, dairy products, and tap water. Drinking distilled/purified/bottled water is best. Water that has gone under reverse osmosis and distillation will have removed 90% of radiation in the water but not all.\r\n\r\n6. Doing research on the water/food I drink and where it comes from.\r\n\r\n7. Something that has not been metioned, depending on when the tobacco was harvested, it might also be contaminated with radiation from Japan. Nevertheless, tobacco products already HAVE radiation such as lead. Just food for thought. Also, smoke attaches to radioactive particles easily so smoking outside might be reconsidered.\r\n\r\n8. Use the AC if you need air inside the house. Keep windows closed as much as possible. Best if you can circulate the air instead of having fresh air from outside flow in. There are certain vents you can buy that can also aid in filtering radiation. The vents/filters will definitely be radioactive overtime and should take proper measures when replacing it.\r\n\r\n9. Doing research on water filters that are most effective in filtering radiation. Remember, FOOD AND WATER will be the most important assets in helping you survive the storm. Especially as our social structure decays, buying food/water in bulk might not be such a bad idea. It's actually a lot cheapter than buying it from the store also. I personally have stocked up on freeze-dried foods and MRE's that were produced PRIOR to March 2011.\r\n\r\n10. Stock up on natural remedies such as vitamins and minerals. Detoxifying the body as much as we can is best we can do! Stay healthy, strong, exercise, etc. \r\n\r\n11. Remember you are not crazy. We can only hope for the best while preparing for the worst. By making a few adjustments in your daily life, you will be in a much better position than most people.\r\n\r\nhttp://www.telegraph.co.uk/news/worldnews/asia/japan/8472416/Chernobyl-recovery-officer-criticises-Japans-efforts-at-Fukushima.html\r\n\r\n12. Do as much research as you can. The more you know, the better position you hold when making decisions for you and your loved ones.\r\n\r\n13. Stay out of the rain! Have an umbrella handy in case it showers. If your clothes do get contaminated with rainwater, utilize quarantine protocols such as taking off contaminated clothes outside the house and immediately rinsing off with a cold shower. Keep contaminated clothes and clean clothes separate both during wear and wash. Do not hang dry clothes outside.\r\n\r\nIn peace and solidarity,\r\n\r\n~Warren\r\n\r\nOther important link:\r\n\r\n  \r\n\r\n www.fairewinds.com Arnold Gunderson is a nuclear expert that has been providing great information/analysis of the current situation. He has already recommended people at the beginning of April to avoid dairy products, leafy vegetables and tap water. That was almost a month ago. Let's pick it up folks.\r\n\r\nwww.enenews.com is a great website that gathers articles/data. Always up to date.\r\n\r\nwww.idealist.ws is a good blog that provides basic background history/knowledge of nuclear infrastructure across the globe.\r\n\r\nhttp://hisz.rsoe.hu/alertmap/index2.php?lang= shows disasters/incidents around the globe in real time.\r\n\r\nhttp://www.nuc.berkeley.edu/node/2174 UCB radiation monitoring site", "group_id": 3920, "id": 822286}]