[{"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302454596.7555981, "message": "Hello guys. I'll be a new-grad in computer engineering in a couple of months. The real problem is I'm not living in the US, but I would love to try anything to move to San Francisco. What would you do, if you were me? I'm a Python/Django and Android programmer from Europe. Thank you ^_^", "group_id": 614, "id": 610954}, {"user_id": 4078, "stars": [], "topic_id": 18385, "date_created": 1302491430.0570171, "message": "I say just go for it.  Even if you're just here for a few weeks on vacation, and a good python/django developer after a few interviews you'll be able to get a job quickly.  (btw... we're hiring http://j.mp/esS5if :)", "group_id": 614, "id": 617892}, {"user_id": 4078, "stars": [], "topic_id": 18385, "date_created": 1302491887.673069, "message": "Honestly though, even if you don't get a job with us, just go to either the Django http://j.mp/5KOXuM or Python http://j.mp/6NTNV meetups and you'll see how it's actually gotten comical that EVERYONE is hiring and competing for talented developers.", "group_id": 614, "id": 617937}, {"user_id": 96, "stars": [{"date_created": 1302502476.8382759, "user_id": 4078}], "topic_id": 18385, "date_created": 1302501309.389209, "message": "The high rate of employment amongst software engineers here gives you a pretty good opportunity. Most of us with jobs are hassled regularly by recruiters, and companies big and small are looking for people (and of course, some of less glamourous companies are bleeding staff as a consequence.)\n\nIn my experience, you'll find that only companies of a certain size will be able to handle the legal work and hassle to get you a visa. H1-B applications for this October started on April 1st, and in recent years due to various tweaks in legislation and eligibility, they aren't immediately allocated (back in 2008, all H1-Bs for the year would be allocated on the first day.) If you find the right company, they should be able to bring you over.\n\nAnother option is to work for an international organization with an office in europe for 12 months, and they can then transfer you over on an L1 visa. Faster route to a green card, but less stability and no flexibility once you're here.\n\nThe final option is that if you happen to be absolutely shit-hot and notable (books published, invited expert within the industry, other specialisms, awards won) then you might qualify for an O-visa (alien of extraordinary ability.) That's unusual, of course (extraordinary, you might say.)", "group_id": 614, "id": 620323}, {"user_id": 96, "stars": [], "topic_id": 18385, "date_created": 1302501374.6691389, "message": "Trawl job sites for interesting companies, push your portfolio and project contributions, make applications, expect to do a larger than usual number of phone interviews and screen-sharing exercises to get invited over. Coming over for a vacation and joining local user groups also sounds like a great suggestion.", "group_id": 614, "id": 620333}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302520055.326093, "message": "I've joined Convore few days ago and I'm already loving this community. Thank you guys for the precious informations you gave me.", "group_id": 614, "id": 622892}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302534099.671988, "message": "@daliz if you want to find companies who are looking for devs, Django Gigs is a good place to start http://djangogigs.com/", "group_id": 614, "id": 624900}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302534237.2432489, "message": "An alternative to an H1B is an internship. Last summer my company hired a guy from Germany on a paid internship then moved him to H1B after a few months.", "group_id": 614, "id": 624918}, {"user_id": 27989, "stars": [], "topic_id": 18385, "date_created": 1302535271.183563, "message": "Hi!", "group_id": 614, "id": 625061}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302543059.1499901, "message": "@berryp Thank you for the link.", "group_id": 614, "id": 626740}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302543168.1594751, "message": "@daliz good luck. hope it works out.", "group_id": 614, "id": 626773}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302543233.3266079, "message": "Oh, you should also try to attend python and django conferences (preferably in the US) as there are always companies recruiting - this can be expensive though.", "group_id": 614, "id": 626785}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302543591.274327, "message": "And if you can afford it, come to the valley for a few months, attend the meet ups (of which there are a lot in both the city and the suburbs), get to know other developers, and whatever you can to get to meet the right people.", "group_id": 614, "id": 626871}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302543409.8218601, "message": "I hope I'll be able to participate at DjangoCon 2011 in Amsterdam. Unfortunately in June I'll be probably discussing my thesis and I can't buy tickets until I know the day. Sigh!! :-)", "group_id": 614, "id": 626827}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302543192.5167789, "message": "@berryp I'll be searching for an internship, then. I have some time to search (finishing university just in these days). Meanwhile, have you any good resources to help me in my research? Do conventional job searching websites offer internship, too?", "group_id": 614, "id": 626777}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302543490.4681661, "message": "I'm not sure about internships being advertised - you may have better luck meeting or approaching people and companies and discussing this. Also, similar to what @tinio suggests, become active in the various communication and social circles; such things as IRC, services like Convore, Google Groups, etc.", "group_id": 614, "id": 626852}, {"user_id": 20584, "stars": [], "topic_id": 18385, "date_created": 1302543784.703455, "message": "That's about as much advice I can give as I only moved here a couple of month's ago (intracompany transfer). Oh, there are also expat forums; I found the UK one (britishexpats.com) very helpful - and you don't need to be from the UK (if that is the case) to benefit from the advice on that site.", "group_id": 614, "id": 626926}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1302621739.555944, "message": "Thank you again. I'm definitely following your hints.", "group_id": 614, "id": 643989}, {"user_id": 13719, "stars": [], "topic_id": 18385, "date_created": 1303115269.1552789, "message": "@daliz try my blog http://20minus.com has some usefull tips...", "group_id": 614, "id": 724166}, {"user_id": 28506, "stars": [], "topic_id": 18385, "date_created": 1303207452.339149, "message": "@thanpolas t.y.", "group_id": 614, "id": 739520}, {"user_id": 22183, "stars": [], "topic_id": 18385, "date_created": 1303800675.9595439, "message": "@BenWard for L1 visa, you have to be part of that International organization for at least 12 months before applying.", "group_id": 614, "id": 811187}]