[{"user_id": 11626, "stars": [], "topic_id": 7443, "date_created": 1298102617.316767, "message": "HOUSTON - A Harris County Sheriff’s deputy is in the hot seat on grounds he engaged in some unnecessary rough housing while apprehending a woman at a Target store.\r\n\r\nAccording to the surveillance tape, it appears the deputy grabs the woman, slams her up against a wall and tackles her to the ground.\r\n\r\nAttorney Rick Detoto, on behalf of Veronica Gonzalez, has filed a federal lawsuit against that deputy.\r\n\r\n== Woman, Attorney Subpoenaed Surveillance Vid ==\r\n\r\nGonzales and her son were walking in front of a Target store in northwest Houston back in June 2010.\r\n\r\nThe deputy was in uniform, but not on the job. He was walking into the store in the 21000 block of Tomball Parkway.\r\n\r\n\"I don't know. I was talking to him and then next thing I know, I'm in handcuffs. Beaten up,\" said Gonzalez. \"He says I resisted arrest and failed to (show my identification), which none of those are true.\"\r\n\r\nTo prove her innocence, Gonzalez first hired attorney Kelly Benavides.\r\n\r\n\"We had to subpoena the video from Target,\" Benavides said.\r\n\r\nBefore Benavides got her hands on the tape, all she knew was her client faced two criminal charges.\r\n\r\nAccording to the deputy's report, Benavides said, her client was the one being rough.\r\n\r\n== Attorney: Video Disproves Deputy’s Story ==\r\n\r\nAfter watching the video, the Harris County District Attorney’s Office dropped both charges against Gonzalez.\r\n\r\nNow Benavides is working with Detoto to file that federal lawsuit. Detoto said the video disproves the deputy’s stated version of what happened:\r\n\r\n-- The deputy said Gonzales was arrested after she threw her hands in his face, screaming and cursing at him.\r\n\r\n“Watch the video. That’s make-believe,” Detoto said. “It’s not there.”\r\n\r\n-- The deputy said while he was detaining Gonzales, she was swinging wildly attempting to hit him.\r\n\r\n\"Again, that's make-believe. It's nowhere on the video,\" Detoto said.\r\n\r\n== Benavides: Deputy should be Charged, Fired ==\r\n\r\n“The officer basically lied to the district attorney's office as well as wrote this in a police report to get her arrested. She had to go to jail. She had to post bond in two cases. She had to make numerous court appearances. She was charged with a criminal offense.\"\r\n\r\nGonzalez said it took months to clear her name and was forced to take a lot of time off from work.\r\n\r\nThe result?\r\n\r\n\"She lost her job based on this false arrest that was eventually dismissed by the DA's office,\" Detoto said.\r\n\r\nBenavides said the accused deputy should also be criminally charged for Filing a False Police Report and Tampering with Government Records. He should also be disciplined and fired.\r\n\r\n“If he's out there, it begs the question: How many times had he done this where there hasn't been a video’?” she asked. “Where someone didn't have the funds to afford an attorney to fight this case and were wrongly convicted.\"\r\n\r\n== Sheriff’s Office Investigating Woman’s Claim ==\r\n\r\nGonzalez agreed saying what the deputy did to her was unjustifiable.\r\n\r\n\"I mean I didn't do anything to this guy. I didn't do anything at all to anybody,\" Gonzales said.\r\n\r\nA spokesperson for the Harris County Sheriff's Department said the office has received a complaint from Veronica Gonzalez, and is investigating.\r\n\r\nIn the meantime, the deputy, who did not answer our request for an interview, remains on the job.\r\n\r\nhttp://www.myfoxhouston.com/dpp/news/local/110214-woman-video-proves-deputys-guilt", "group_id": 3920, "id": 149066}]