[{"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305529812.2703199, "message": "But it's EPIC perfume..   ;)", "group_id": 9787, "id": 1068301}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305529611.56546, "message": "For instance, I saw this on Facebook: \"tonight is going to be EPIC @ Liberty Church | Discovery we have STOMP THE STREETS preview at 5:45pm and then awesome worship, powerful poem by Dee-Ann Etchells & challenging message from Edgar Ramsami & perfume giveaways 4 guys & girls ... come be part of an EPIC evening\"", "group_id": 9787, "id": 1068290}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305530721.043849, "message": "There's a challenge hey.. If I'm doing my job properly there shouldn't be advertising. The thing about our church is that the membership are pretty much all located a few km.s away from the church. I guess advertising would be a way of connecting with people in the immediate vicinity..", "group_id": 9787, "id": 1068345}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305530955.9863081, "message": "@EdwinGarden For sure. \"Hey dude, come to my church tonight... we're giving away perfume.\"", "group_id": 9787, "id": 1068359}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305529517.266974, "message": "This is something I have been thinking about lately. The PR of the church. When I say church I mean the actual admin side and not the members. The side that decides whether or not to put posters up on the road etc. To what extent should the church try use advertising to woo people to come see what's there?", "group_id": 9787, "id": 1068288}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305529645.511544, "message": "Perfume giveaways? Really?", "group_id": 9787, "id": 1068292}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305530906.5461659, "message": "Maybe it's the type of advertising? How do you effectively advertise what the church is? To me it seems almost impossible. I know of people that go to churches because the band is AWESOME. Little is said for the teaching. The community. Is it possible to create a false sense of church when the advertising has little to do with God?", "group_id": 9787, "id": 1068352}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305530066.2980421, "message": "@EdwinGarden maybe I'm jealous I did not see it sooner so I never went and got me some of them nice smelling things :(", "group_id": 9787, "id": 1068316}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305530326.7574799, "message": "That's a big issue facing our church at the moment. People just aren't interested in the traditional church model. I think it's not great, but there is an element of living in the society we're in that says church should be all that it is AND entertaining. Obviously that's not what it's all about, but it is the world we find ourselves in. The architecture (of our church anyway) is all wrong for today. It's all inward looking. I guess posters & stuff could help with that, but I kind of wish we could knock a few walls down & add a stack of glass.. Seriously though, I'm not too sure about the giveaways..", "group_id": 9787, "id": 1068323}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305530381.0739689, "message": "Do you think the \"admin\" church takes it upon itself to do this sort of advertising cause it cannot connect to individuals because it's members are not connecting outside the church bubble properly?", "group_id": 9787, "id": 1068325}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305531213.0372601, "message": "Not that there is anything super wrong with that, but not sure what they are advertising? Come to Jesus for a \"Magic Life\". Is that right? Is that ok?", "group_id": 9787, "id": 1068378}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305530902.1109171, "message": "I guess in answer to your question, church admin should be using as many means as possible. The trick then would be knowing where to draw the line.. I'd be interested to hear what people think about the giveaway idea..", "group_id": 9787, "id": 1068351}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305531124.1126089, "message": "@EdwinGarden The same church has posters up on the main roads as well simply saying something along the lines of... \"Magnificent People, Magic Life, Liberty Church\"", "group_id": 9787, "id": 1068371}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305531223.3003509, "message": "Yeesh.. No pressure on them then.. ;)  The alpha course might be a good model of advertising something locally that actually brings people in & teaches them. For all our problems we've never tried that.. hmmm..", "group_id": 9787, "id": 1068379}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305531504.7493961, "message": "@penkin Yes, that's the hassle with poster advertising. You have to be so careful with what you say that you can't say anything really. I can see where they're coming from, but it means that you need to be in with the slang. Slang that in this case that is age, race & probably gender specific..", "group_id": 9787, "id": 1068398}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305539240.7621119, "message": "“Missions is not the ultimate goal of the Church. Worship is. Missions exists because worship doesn’t. Worship is ultimate, not missions, because God is ultimate, not man. When this age is over, and the countless millions of the redeemed fall on their faces before the throne of God, missions will be no more. It is a temporary necessity. But worship abides forever.\n\nWorship, therefore, is the fuel and goal of missions. It’s the goal of missions because in missions we simply aim to bring the nations into the white hot enjoyment of God’s glory. The goal of missions is the gladness of the peoples in the greatness of God. “The Lord reigns; let the earth rejoice; let the many coastlands be glad!” (Ps 97:1). “Let the peoples praise thee, O God; let all the peoples praise thee! Let the nations be glad and sing for joy!” (Ps 67:3-4).\n\nBut worship is also the fuel of missions. Passion for God in worship precedes the offer of God in preaching. You can’t commend what you don’t cherish. Missionaries will never call out, “Let the nations be glad!” who cannot say from the heart, “I rejoice in the Lord…I will be glad and exult in thee, I will sing praise to thy name, O Most High” (Ps 104:34, 9:2). Missions begins and ends in worship.” John Piper", "group_id": 9787, "id": 1069270}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305539282.624855, "message": "That may not appear to be relevant to the subject, but think on it and I think the relevance will become clear", "group_id": 9787, "id": 1069271}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543576.523278, "message": "BAH! enter to post! that's stupid", "group_id": 9787, "id": 1069510}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305545677.0989051, "message": "Everybody wants to be like Oprah", "group_id": 9787, "id": 1069653}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543740.675667, "message": "ok, so i think that the church model is flawed... basically. i think that strictly speaking, church gatherings are for communal praise and worship. the local body of believers come to worship and fellowship... that should be the focus of the gathering. As this happens, we are strengthened and equipped to go OUT to gather people IN. What is happening now is that we structure the communal worship for the non believers, make it attractive for them... which really just means we take the focus off worshipping God and praising him, and we put it on SAVING SOULS!", "group_id": 9787, "id": 1069531}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543827.8404779, "message": "when the body gathers to evangelise on a sunday, and that is the ONLY time it gathers... then there is something wrong. Evangelism can happen through the message, for sure. but that should not be the focus. We gather in to worship, be equipped and edified, and we scatter to evangelise.", "group_id": 9787, "id": 1069544}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543839.0030301, "message": "yes, i have said the same thing with only slightly different words.", "group_id": 9787, "id": 1069548}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543856.066798, "message": "i hope to sway you to my line of thinking by disguised attrition.", "group_id": 9787, "id": 1069551}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543862.4360001, "message": "and volume of posts.", "group_id": 9787, "id": 1069553}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543564.9424479, "message": "I think, without reading paul's thing cause i have to scroll", "group_id": 9787, "id": 1069506}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305543865.224406, "message": "that is all.", "group_id": 9787, "id": 1069554}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305544658.4129319, "message": "ok i lied, that is not all. Get someone interested in coming for the free purfume, but now you have to keep them there, and keep them coming back, which means structuring your service so that it is attractive to the perfume desiring masses. Ok, fine. They probably dig U2, so let's make it a U2 concert style thing, yea. with lights and funky music. They must feel entertained by the music... now the music is over, and some guy needs to speak so he has to be charismatic as heck! His message also has to be as attractive as possible, or as nonboring as possible, which would probably extend to life coaching... cause exegesis of scripture is boring right? Hey, people even like challenging and controversial, some might stay if they get to be all offended and indignant, so be as controversial as possible. Or my pet peeve for a while is the method a mega multi site church here uses. Be as cool and open about sex as possible, \"sex is in the bible, women sleep at christians feet! just look at ruth! we know how to get chicks to sleep with us AND serve us! hahaha come to jesus lol kidding lol... but am i? lol\"", "group_id": 9787, "id": 1069602}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305544698.193598, "message": "your worship service is no longer. it has transmogrified into the christian sunday circus... now with free gifts.", "group_id": 9787, "id": 1069606}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305552902.2484889, "message": "@pevans_om As far as I know though, he is a continuist :D", "group_id": 9787, "id": 1070701}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305553533.571233, "message": "@LintonCaldecott I don't think so either. What I am saying is that is how it seems to be peddled.", "group_id": 9787, "id": 1070799}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553716.8937709, "message": "you know, if you had to ask Paul (of tarsus not  of pretoria) i would recon he would also say that his life was magnificent... and might also say that relationship with Jesus gives this... but his point might be a little different.", "group_id": 9787, "id": 1070852}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305553243.2303891, "message": "\"You still at X?\" \"No no, I go to Y. You should check their band, it's awesome. They're just so relevant to me\"", "group_id": 9787, "id": 1070739}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305552769.7451069, "message": "@pevans_om Wow Paul, John Piper. A calvanist baptist :) I thought you hated baptists? https://convore.com/christian-thinking/the-crazees/1058287/ :D", "group_id": 9787, "id": 1070670}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553635.462224, "message": "it is about God the lazyboy. our church has God JUST right, cause he can make everything perfectly comfortable... MAGNIFICENT LIFE!", "group_id": 9787, "id": 1070833}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305553702.4093659, "message": "@LintonCaldecott Those Liberty posters are outside Rhema as well. And they don't have an arrow on them saying there is a church right here :)", "group_id": 9787, "id": 1070849}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305554210.4766719, "message": "@LintonCaldecott Not so sure. Paul seemed to enjoy telling people how miserable he was... How he's the worst sinner, etc.", "group_id": 9787, "id": 1070974}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305554460.8483729, "message": "@pevans_om he didnt stop at the \"i'm pretty bad\" stuff, he continued, and the continuation seems pretty positive to me.", "group_id": 9787, "id": 1071042}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553489.4911771, "message": "i don't think.", "group_id": 9787, "id": 1070787}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305553037.1233201, "message": "Back to the topic at hand :) I agree with @LintonCaldecott. I personally don't think advertising helps in any way. At least not get noobs in the door. It may get Christians jumping community to community.", "group_id": 9787, "id": 1070710}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553449.4512889, "message": "While that statement isn't untrue, worship benefits us more than it does God, I think... it's not the purpose, and shouldn't be the goal. If it IS the goal, then the feeding is an emotional massage and not really the kind of thing you get when you actually worship...", "group_id": 9787, "id": 1070782}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553373.93856, "message": "I really just didn't feel the worship.. I need to FEEL the worship! It needs to feed me...", "group_id": 9787, "id": 1070754}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305553448.6897471, "message": "I sometimes wonder how much of the motivation of church advertising is toward \"winning lost souls\" and how much is to just get the numbers up. A thriving community is all about how many people go there every Sunday right?", "group_id": 9787, "id": 1070781}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305553486.53233, "message": "communal fellowship and worship should not have the primary goal of \"winning souls\"", "group_id": 9787, "id": 1070786}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305553527.1738491, "message": "Last night at my church the guy was preaching about \"What is the church\". I was happy with what he preached. I wasn't happy with some video clip he played as introduction. A slick american production with people all talking about what the church is for them. It was always about me, myself and I. Every statement! That's how people view the church and even God these days. My personal God that solves my personal problems. I keep him in this little book and pull him out when I need something. Wanna see? :/\n\nAs for advertising? Ja I think @penkin has it right. A feature to grab bench-warmers from other churches", "group_id": 9787, "id": 1070795}, {"user_id": 13817, "stars": [], "topic_id": 35460, "date_created": 1305554283.765398, "message": "@pevans_om He was. I'd never believe anything that dude says.", "group_id": 9787, "id": 1070998}, {"user_id": 32888, "stars": [], "topic_id": 35460, "date_created": 1305615350.5302689, "message": "@EdwinGarden what is your interpretation of the model of the church now, generally?", "group_id": 9787, "id": 1079524}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305617361.389169, "message": "@pevans_om ooooohhh. That's one I've been thinking about recently. For the first couple of months this year I was crazy busy. All of it between work & church. Work you can't do much about, but looking at the church stuff it was all work for the church institution (council meetings, synod, property meetings) & almost nothing for the furtherance of God's Kingdom. Some of those 'church' meetings were downright ungodly. So I think Adrian's church has definitely got something in the 'Organic Church' thing.. Looking at the people in our circuit who are doing Kingdom work, I see that it's all people who manage to keep out of the institution net. Power to them!", "group_id": 9787, "id": 1079870}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305616842.5290849, "message": "Why does the church (institution) fail to produce people actively living out their salvation?", "group_id": 9787, "id": 1079806}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305616624.0918341, "message": "@LintonCaldecott Ours is much the same as it's always been.. Traditional Methodist morning service, contemporary (i.e. straight out of the 90's) service in the evening. Pretty much zero local community interaction (to be fair though, we do try stuff but none of it's been wildly successful).]", "group_id": 9787, "id": 1079742}, {"user_id": 32891, "stars": [], "topic_id": 35460, "date_created": 1305617606.831531, "message": "Me. I need to learn to say no.", "group_id": 9787, "id": 1079898}, {"user_id": 32900, "stars": [], "topic_id": 35460, "date_created": 1305645856.9025159, "message": "Do we need a rethink about church?", "group_id": 9787, "id": 1084257}]