[{"user_id": 11626, "stars": [], "topic_id": 43374, "date_created": 1312592692.9679589, "message": "RAW FOOD RAID DIGEST 8/5/11\n\nWelcome to the special \"Raw Food Raid\" edition of SCMLA's News Digest!\n\nWe pray that we never have to issue a digest like this again.\n\n\nBreaking news: Multi-agency armed raid hits Rawesome Foods, Healthy Family Farms for selling raw milk and cheese\nNaturalNews\nAugust 3, 2011\n\nA multi-agency SWAT-style armed raid was conducted this morning by helmet-wearing, gun-carrying enforcement agents from the LA County Sheriff's Office, the FDA, the Dept. of Agriculture and the CDC (Centers for Disease Control)... Rawesome Foods, a private buying club offering wholesome, natural raw milk and raw cheese products (among other wholesome foods) is founded by James Stewart, a pioneer in bringing wholesome raw foods directly to consumers through a buying club. James was followed from his private residence by law enforcement, and when he entered his store, the raid was launched. Law enforcement demanded that all customers (members) of the store vacate the premises, then they demanded to know how much cash James had at the store. When James explained the amount of cash he had at the store -- which is used to purchase product for selling there -- agents demanded to know why he had such an amount of cash and where it came from. James was handcuffed, was never read his rights and was stuffed into an unmarked car. While agents said they would leave behind a warrant, no one has yet had any opportunity to even see if such a warrant exists or if it is a complete warrant. Law enforcement then proceeded to destroy the inventory of the story by pouring the milk down the drain and / or confiscating raw cheese and fresh produce for destruction. Video now posted at NaturalNews.TV: http://www.naturalnews.tv/v.asp?v=A5A53BF2F844A0BB9FE1BD9C20E51684\nhttp://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html\n\nRawesome Food raid videos begin to emerge from the scene where federal terrorists vandalized raw milk business\nNaturalNews\nAugust 3, 2011\n\nFrom the SWAT-style armed raid on the raw milk buying club known as Rawesome Foods, clandestine video footage is starting to emerge. Although the footage is shaky and low quality (from a cell phone), it shows law enforcement thugs stealing raw milk, cheese, vegetables and even mangos from the Rawesome Foods store and loading them up into a large truck. NaturalNews was sent these videos by people on the scene. Watch them at: http://www.naturalnews.tv/v.asp?v=A5A53BF2F844A0BB9FE1BD9C20E51684\nThe same people from the raid also told us that they witnessed law enforcement pouring all their raw milk down the drain. Essentially, the cops, FDA and CDC were engaged in VANDALISM against a health food business. Make no mistake: This is law enforcement engaged in acts of terrorism against small farmers and honest raw foods retailers. These are mob-style tactics of intimidation, business disruption, cash confiscation and inventory destruction. Chicago gangster mobs couldn't have done a better job! Watch these videos yourself and you'll see some of what happened on the scene. More videos and photos are being sent to NaturalNews, and we will keep you posted on this story. Again, the short video of raw footage is available at: http://www.naturalnews.tv/v.asp?v=A5A53BF2F844A0BB9FE1BD9C20E51684\nhttp://www.naturalnews.com/033221_Rawesome_Foods_raw_milk.html\n\nTrio of Los Angeles raw food advocates reportedly charged with raw milk conspiracy (update 1)\nNaturalNews\nAugust 3, 2011\n\nThe raid on Rawesome Foods by a combined force of agents from the FDA, LA County Dept of Agriculture, CDC and the LA County Sheriff's office wasn't the only SWAT-style armed raid that took place today. Sharon Palmer, a mom and owner of Healthy Family Farms was also arrested and taken to jail. A third woman, Victoria Bloch, the LA County liaison for the Weston A Price Foundation (www.WestonaPrice.org) , was also reportedly arrested, NaturalNews has learned. Sharon Palmer is being charged with \"mislabeling cheese,\" NaturalNews has learned. (Yes, mislabeling cheese! This earns you an armed raid in America today, even while the real crooks in Washington run free...) This is on top of the conspiracy charge which has been leveled against all three (James, Sharon and Victoria). Victoria Bloch is being charged with conspiracy under Section 182A of the California penal code (http://law.onecle.com/california/pe...), which states that that law applies \"If two or more persons conspire to commit any crime.\"\nhttp://www.naturalnews.com/033222_raw_food_conspiracy.html\n\nMassive public protest announced against government-sponsored terrorism of Rawesome Foods in California\nNaturalNews\nAugust 3, 2011\n\nAs promised, a massive public protest is now being announced to give the members of the public an opportunity to voice their outrage against today's arrest of three raw foods advocates who are all being charged with conspiracy. The protest will be held at the LA County Courthouse located at: 210 West Temple, Division 30 Los Angeles Arrive there at 7:45 am to join the protest, which needs to be in full swing early, because the court hearing for James is scheduled at 8:30.\nhttp://www.naturalnews.com/033223_Rawesome_Foods_public_protest.html\n\nNaturalNews publishes Rawesome Foods raid search warrant; reveals government agents violated search guidelines\nNaturalNews\nAugust 3, 2011\n\nThe recent act of government-sponsored terrorism against Rawesome Foods in Venice, California was authorized by a woman named Michelle LeCavalier. She signed the warrant which stated that she believed there was property at Rawesome Foods that was \"used as the means of committing a felony.\" (What, the raw cheese? Did someone cut the cheese and cause a silent-but-deadly felony nuisance?) The warrant goes on to state that the law enforcement agents should search \"all rooms, attics, refrigerators, freezers... purses, wallets, briefcases and vehicles of both James Stewart (Rawesome Foods) and Sharon Palmer (Healthy Family Farms).\" The warrant also grants them the permission to inspect, copy and even seize all computer files, video camera files, audio recording files and all the data of all computers. Additional items to be seized, as described in the warrant, include: • Any evidence of \"interstate transportation\" (so they can charge these people with felony FEDERAL crimes). • All membership agreements of their current members (customers); this way they can intimidate customers, too. • Documents concerning the Right To Choose Healthy Foods (RTCHF) organization, which fights for food freedom at www.RawMilk.org (the government is going after these advocacy groups, too, with their terrorist tactics). • All tax records (so they can try to find some tax error and then charge them with federal tax fraud). • All real estate transactions, billing records, purchasing records and club records. • All emails, receipts, cash register data, credit cards receipts, inventory records and so on. • All computers and electronic devices. The warrant shows that government terrorists stole both Dell and Apple computers from Rawesome. • All address books, telephone numbers, contacts, client lists, business cards, etc. This is so the government terrorists can contact Rawesome Foods customers and then conduct illegal raids on their homes for buying \"contraband\" raw milk... and a lot more, including prescription medication bottles, employment records, keys and much more. Read the warrant yourself at: http://www.naturalnews.com/files/RawWarrant1088-NoSSN.pdf\nhttp://www.naturalnews.com/033224_Rawesome_Foods_search_warrant.html\n\nPhotos from Rawesome Foods raid prove government agents illegally stole entire inventory of buyer's club\nNaturalNews\nAugust 4, 2011\n\nNaturalNews is now publishing some of the very first photos taken in the aftermath of the Rawesome Food raids, which involved a multi-agency raid against Rawesome Foods for selling unpasteurized milk and raw cheese (http://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html ) These photos show how Rawesome Foods has been stripped bare by state and federal agents who engaged in what can only be called an act of government-sponsored terrorism against innocent small business owners. As NaturalNews reported earlier, the warrant that was issued to authorize the Rawesome Foods raid specifically stated that \"various samples of any food products present may be taken for laboratory analysis.\" (http://www.naturalnews.com/033224_Rawesome_Foods_search_warrant.html ) But instead of taking only \"various samples,\" the LA County Dept. of Agriculture authorities engaged in the wholesale theft of the entirety of Rawesome Foods' inventory. (See photos below.) This, of course, has the effect of instantly putting Rawesome Foods out of business through the government-achieved destruction of their entire inventory. The scene at Rawesome Foods earlier today, in fact, saw California state agents pouring raw milk down the drain and gathering up the rest of the products to be hauled off to be destroyed. This is not a lawful search of a facility for the purpose of protecting public health; it's a mob style government-engineered economic hit on a small business that provides a valuable service to society.\nhttp://www.naturalnews.com/033225_Rawesome_Foods_photos.html\n\nPost-raid video features interviews of Rawesome Foods members; sense of dismay over police state destruction of natural food\nNaturalNews\nAugust 4, 2011\n\nTroy Casey is known as the \"Certified Health Nut\" (http://www.youtube.com/user/certifiedhealthnut ), and he's been a long-time member of Rawesome Foods which was just hit with a SWAT-style armed raid (http://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html ). After the raid, Troy leapt into action with his video camera to interview people who were protesting outside Rawesome Foods, including Mariel Hemingway (www.marielhemingway.com) , one of the most outspoken celebrity supporters of healthy living and wholesome foods. The video is available to be viewed in full at: http://www.naturalnews.tv/v.asp?v=D26E2CE9C7B0E0690977F89688E6D713 Some of the comments from Rawesome members, \"I saw FDA, FBI, California Dept. of Agriculture, come in and just pillage and rape all of our product here at Rawesome today. They started around 7:00 banging on the doors, saying 'police' and threw a search warrant out, they came after James Stewart, they did not read him his rights.\" \"Regardless of legalities, people need to eat health food. If it's illegal to eat food that's healthy, then we're all criminals. And I would prefer to continue eating healthy food regardless of what anyone tells me.\"\nhttp://www.naturalnews.com/033226_Rawesome_foods_videos.html\n\nIn time of accelerating economic collapse, the police state targets health food buying clubs rather than real criminals\nNaturalNews\nAugust 4, 2011\n\nOne of the most astounding elements of yesterday's SWAT-style armed raid on Rawesome Foods in Venice, California is the simple fact that both California and the U.S. government are completely and utterly bankrupt. They're running on financial fumes, and at the federal level, a total debt default was just narrowly avoided (and it will come back again in a few months). But even though these government entities are fiscally and morally bankrupt, when it comes to making decisions about how to spend the money they're confiscated from taxpayers, they prioritize things like terrorizing health food buyer's clubs such as Rawesome Foods. (http://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html ) On the scale of harm to the public, the actions of the FDA and the pharmaceutical industry are legendary. Over 100,000 Americans are killed each year by FDA-approved drugs, and yet there's absolutely no action whatsoever being taken to arrest the CEOs of the drug companies who knowingly sell dangerous drugs that kill people. Where are the arrests of the CDC officials who pushed useless flu vaccines, knowing that they, too, would cause neurological destruction and even death in some children? Where are the arrests of the food company executives who knowingly lace their products with MSG, aspartame, sodium nitrite, hydrogenated oils and other poisons that promote degenerative disease? How about the crackdowns on the evil GMO corporations that have unleashed genetic pollution across our planet in their greedy quest for profit at the expense of life on Earth? No, the great police state government that now runs America doesn't bother the real criminals who get away with murder every single day by poisoning the food, the medicine and the crops. They all have legal immunity because the system won't bother dealing with their large-scale crimes. Instead, the power of the corrupt police state is exercised against small, local farms and food businesses which remain the only option through which everyday people can find real food that isn't artificially modified or contaminated with chemical additives.\nhttp://www.naturalnews.com/033232_police_state_raw_foods.html\n\nRawesome Foods founder to be prosecuted under special environmental crimes unit in LA\nNaturalNews\nAugust 4, 2011\n\nDetails are still sketchy on this, as we're breaking this news straight from the front lines in the aftermath of the government raid on Rawesome Foods in Venice, California (http://www.naturalnews.com/033220_Rawesome_Foods_armed_raids.html ), but NaturalNews is now being told that the LA County District Attorney will not be prosecuting James Stewart and the other \"conspirators\" who were arrested yesterday for selling raw milk. Instead, a special \"environmental crimes\" prosecutor will reportedly be prosecuting the case, which now consists of 13 criminal charges, some of which are felony crimes. NaturalNews has not yet learned the name of this special environmental prosecutor, but the explanation smacks of the new environmental police who have been promoted through various propaganda outlets as being upstanding protect-the-Earth cops who arrest people for burning too much gas or using non-recyclable cups to drink beverages. The issue of environmental police has been covered extensively by Alex Jones at InfoWars.com, where he refers to them as eco fascists. See this page to read more about how propaganda ads are being used to get people comfortable with the idea that \"environmental crimes\" should result in police slamming your face into the ground and handcuffing you: http://www.infowars.com/audis-eco-fascism-ads The videos on that page have been disabled, but here's an alternate link of the green police Superbowl Ad: http://www.youtube.com/watch?v=Wq58zS4_jvM (Astonishing ad. You MUST watch it.)\nhttp://www.naturalnews.com/033233_green_police_environmental_crimes.html\n\nRawesome Foods small victory: James Stewart bail reduced to $30,000, Victoria Bloch released from jail\nNaturalNews\nAugust 4, 2011\n\nKeep up the great work, NaturalNews readers! In the hours following the public protests and global attention being paid to the Rawesome Food raids, an LA County Judge reduced James Stewart's bail from $123,000 to $30,000. By all indications, James Stewart will be out of jail Friday morning (if not sooner). A condition of his release is that he not engage in the sale of unpasteurized milk and cheese -- a condition which is, by itself, completely unconstitutional and a violation of natural law. But nevertheless, this is the condition being set by the LA County courts. In addition, Victoria Bloch, the L.A. liaison to the Weston A. Price Foundation, has been released and is reportedly at home this evening. We hope to speak with Victoria Friday in a phone interview and bring you her report, if she's ready to share that story publicly. This ordeal has no doubt been extremely stressful for all those involved, and it's nowhere near over: The charges of conspiracy against all three persons (James, Victoria, Sharon) still exist and will reportedly be prosecuted by a special \"environmental prosecutor\" from the FDA. (We are still working on confirming that tip so we can't 100% support that yet...) (http://www.naturalnews.com/033233_green_police_environmental_crimes.html )\nhttp://www.naturalnews.com/033234_Rawesome_Foods_news_update.html\n\nRaw Food Co-op Is Raided in California\nNew York Times\nAugust 4, 2011\n\nLOS ANGELES — Raw food enthusiasts fit right in here, in the earthy, health-conscious beach communities of Venice and Santa Monica, along with the farmers’ markets, health food stores and vegan restaurants. But this week, the police cleared the shelves of Rawesome, an establishment in Venice Beach, loading $70,000 of raw, organic produce and dairy products on the back of a flatbed truck. And then, on Thursday, James Stewart, the proprietor, was arraigned on charges of illegally making, improperly labeling and illegally selling raw milk products, as well as other charges related to Rawesome’s operations. Two farmers who work with Rawesome were also named in the district attorney’s complaint. Though it is legal to sell unpasteurized milk products in California, Rawesome, which has operated in Venice for more than six years, never obtained a license to do so — or, indeed, any type of business license.\nhttp://www.nytimes.com/2011/08/05/us/05raw.html\n\nRepulsed by raw: FDA, CDC lies about unpasteurized milk\nNaturalNews\nAugust 5, 2011\n\nBoth the FDA and CDC continue to allege that raw milk is dangerous and that it leads to disease, all while propagating the false notion that the only safe milk is pasteurized milk. They often cite seemingly-scientific numbers and data about outbreaks allegedly related to raw milk in defense of these claims, and many people eat up this misinformation without giving it a second thought. As a result, a general public bias against raw milk has been firmly established and in motion for many decades now, despite the fact that the parents and grandparents of many of those who today decry raw milk actually drank raw milk when they were growing up (and many lived healthy, vibrant lives as a result). Dispelling the myths and taboos surrounding raw milk is no easy task, as most of the \"official\" information coming from government sources is biased against raw milk. By continually denouncing the safety of raw milk and scaring the public with (false) statistics, the war against this wholesome food appears to be a success -- except for the fact that the truth is finally coming out, and increasing numbers of people are awakening and turning to raw milk for improved nutrition and better health. In 2007, the FDA and CDC jointly issued a press release entitled, FDA and CDC Remind Consumers of the Dangers of Drinking Raw Milk. This report contains frightening statistics, which claim that between 1998 and 2005, there were 45 outbreaks, 1007 cases of reported illness, 104 hospitalizations, and two deaths \"associated\" with the consumption of raw milk. Sounds scary, right? Well, it might be if the figures were actually true. The report cites an issue of the CDC's Morbidity and Mortality Weekly Report from March 2, 2007, as the source of this data. But a quick look at this cited report reveals that the numbers used by the FDA and CDC in their own report do not even exist.\nhttp://www.naturalnews.com/033242_CDC_unpasteurized_milk.html\n\t\nJoin the social media revolt against government raids on raw milk\nNaturalNews\nAugust 5, 2011\n\nIn conjunction with the Weston A. Price Foundation and the creators of the Farmageddon movie (www.FarmageddonMovie.com), NaturalNews is spearheading an online social media revolt against the FDA's insidious assaults on raw milk and raw dairy farms. You can join in the revolution by tweeting the hash mark terms #rawesome and #Farmageddon as you post links to the stories, interviews and videos surrounding this case.\nhttp://www.naturalnews.com/033243_raw_milk_social_media.html\n\nInfowars Special with Mike Adams: FDA & CDC Perpetuating Culture of Sickness and Death (video)\nTheAlexJonesChannel\nAugust 5, 2011\n\nMike Adams examines why healthy, raw food has come under the cross-hairs.\nhttp://www.infowars.com/infowars-special-with-mike-adams-fda-cdc-perpetuating-culture-of-sickness-and-death", "group_id": 3920, "id": 1806706}]