[{"user_id": 11626, "stars": [], "topic_id": 6713, "date_created": 1297910855.765254, "message": "Early iPhone app Shazam was unmistakably cool. Hold a phone up while a song was playing in the background and Shazam could name that tune.\r\n\r\nThe IntoNow iPhone app recognizes the television show you're watching based on the audio it detects.\r\n\r\nNow there's a clever and free iPhone app called IntoNow that works similar magic with television. Tap a green button, and four to 12 seconds later IntoNow can figure out from the audio what you're watching. IntoNow can tell whether the show is live. It serves up a brief descriptor of the episode.\r\n\r\nImpressive stuff. Except, you're probably thinking, \"OK, now what? How do you get beyond the high-tech equivalent of a Letterman Stupid Pet Trick?\" Shazam makes sense, because you either don't know or forgot the name of a song you might want to buy.\r\n\r\nBut you almost always know the name of the TV show you're watching.\r\n\r\nIntoNow's answer to the \"now what?\" question is to add a social element. What you're watching may be of interest to other people and, eventually, possibly advertisers. It makes it simple for you to bond with folks who love the same shows you do, many of whom are tweeting when the show is on.\r\n\r\nIntoNow CEO Adam Cahan says the app is a little bit like a mash-up of TiVo and Facebook. From within the app, you can share tagged shows on Facebook or Twitter. TV certainly is social. According to Nielsen, 60% of people watch TV while on the Web. Other iPhone apps such as Miso and GetGlue, which let you \"check in\" on favorite shows, tap into the social fabric of TV.\r\n\r\nWhat draws you to IntoNow is that cool ability to identify the program beaming from your TV.\r\n\r\n•How it works. IntoNow's patented SoundPrint technology recognizes and indexes an audio signature, or fingerprint, unique to each program. It can recognize 130 live channels, and the company's database references programs that aired in the past five years, totaling 266 years of video. IntoNow says the average person watches more than 135,000 hours of TV in their lifetime, less than 6% of the company index. The IntoNow catalog has more than 2.6 million individual airings. It can also detect a program that is being broadcast for the first time.\r\n\r\nIn my tests, the app was able to detect, for example, that I was watching CNN coverage of the Egyptian revolution last week, even though an on-air commentator had barely chimed in. When I switched to Fox, it correctly identified the new channel. The app also correctly tagged other programs, including Two and a Half Menand The Office.\r\n\r\n•What it can't do. There are limitations. It failed to identify an episode of the original Hawaii Five-O series on YouTube. With few exceptions, IntoNow can't recognize what's on local channels. When I watched a New York Knicks-Los Angeles Lakers basketball game over the Knicks' home MSG network, IntoNow was unable to identify the telecast. When I switched to ESPN, broadcasting the same game, IntoNow got it right.\r\n\r\nIntoNow also recognizes when a commercial is playing, but it can't identify the specific content. Not yet anyway. Cahan hinted at future possibilities for advertisers. You might press the green button while watching, say, an Audi or Coke commercial, and the advertiser could send a link to the phone with product information or maybe a coupon.\r\n\r\nMeanwhile, IntoNow is teaming with Viacom's MTV Networks on a Jersey Shore promotion. Fans who tag all six upcoming episodes will be entered for a chance to win a trip to the Season 4 premiere\r\n\r\nThe company is also in trials with an unnamed TV maker about adding IntoNow to an Internet TV.\r\n\r\nFor now it's all about making social connections. From a user's profile page, you can see all the shows they've watched and the shows you have in common. If you find a match, you can invite a person to be your friend. You can exchange comments about a show. The IntoNow link that accompanied an episode of The Dick Van Dyke Show I shared over Twitter included a button to watch online at Hulu.\r\n\r\nIf a show interests you, you can click on an IMDB link to learn more about the cast or a Netflix button to add the program to your queue. You can also jump to iTunes if a show is available for purchase.\r\n\r\nI have a few concerns about privacy. Though IntoNow says it's not sending any of the audio you're watching, whenever you tap the green button to identify a show, it's shared in a public feed (for example, \"Ed B is watching House\"). Though you can delete the information, the company needs more stringent privacy controls about who can see what and when. Do you really want everyone to know you're watching Jersey Shore? For now comments and notifications are limited to your friends within the app. IntoNow says more granular privacy controls are coming. Also coming: a version for Android devices.\r\n\r\nIf you're a TV junkie, IntoNow is worth a look. You might make friends with people who share your passion for Glee or Modern Family. At the very least, you'll be impressed as IntoNow figures out what you're into now.\r\n\r\nhttp://www.usatoday.com/tech/columnist/edwardbaig/2011-02-16-intonow_N.htm", "group_id": 3920, "id": 128916}, {"user_id": 11626, "stars": [], "topic_id": 6713, "date_created": 1297910933.4843099, "message": "Oh yeah. They want to know EVERYTHING. Think it's just listening to your TV? (cue evil laugh)", "group_id": 3920, "id": 128928}, {"user_id": 9018, "stars": [], "topic_id": 6713, "date_created": 1304919234.308347, "message": "its neat but there are some serious limitations here (also it's not able to be patented though certain processes may).\n\nAlso it's limited to the USA unless the spend some serious serious money in setting up an audio stream/server for every channel in every country they want.\n\nBeen working on these very issues so trust me it's a tough nut to crack.", "group_id": 3920, "id": 967351}, {"user_id": 11626, "stars": [], "topic_id": 6713, "date_created": 1309354908.8079181, "message": "Thanks, Dean. Be interested to hear more when you get a chance!", "group_id": 3920, "id": 1516855}]