[{"user_id": 4077, "stars": [], "topic_id": 13205, "date_created": 1300203926.5060749, "message": "I haven't used Celery with Django for anything, but for backends, I've used Rabbit and 'Ghetto', where the ghetto backend was MySQL.  Obviously, the ghetto backend wasn't high impact, it was just a way to get some slower operations out of band so that pages loaded faster, but it worked okay.  Don't know how it would have held up if I'd pushed it.", "group_id": 81, "id": 357547}, {"user_id": 3580, "stars": [{"date_created": 1300213611.5804701, "user_id": 141}], "topic_id": 13205, "date_created": 1300203097.624475, "message": "It's time for us to stand up Celery (or some other job server, but Celery seems like the way to go).. I'm wondering how mature the alternative backends are?", "group_id": 81, "id": 357383}, {"user_id": 4077, "stars": [], "topic_id": 13205, "date_created": 1300204026.586298, "message": "On the flip side, I have pushed rabbit+celery, and never really even noticed that it was under load.  Some poorly written tasks every now and again caused rabbit to fail somewhat spectacularly, but that all got worked out early.", "group_id": 81, "id": 357584}, {"user_id": 3580, "stars": [], "topic_id": 13205, "date_created": 1300203140.958576, "message": "I don't mind RabbitMQ at all.. but if Redis support is solid, then I'd be tempted by it since I'll get lots of other uses out of it as well, compared to rabbit.", "group_id": 81, "id": 357390}, {"user_id": 18129, "stars": [], "topic_id": 13205, "date_created": 1300212779.946996, "message": "Celery and RabbitMQ worked well at Divvyshot.  Every now and then though there would be some minor problem with RabbitMQ and you would have to read an erlang stack trace which is incredibly ugly.  It was also kind of painful getting it to work on a mac.", "group_id": 81, "id": 359109}, {"user_id": 1736, "stars": [{"date_created": 1300222009.394774, "user_id": 3580}, {"date_created": 1300228913.0319359, "user_id": 5778}, {"date_created": 1300528557.834367, "user_id": 38}], "topic_id": 13205, "date_created": 1300216332.72914, "message": "The Redis router backend is fine, and is my recommended results backend actually (over Rabbit). I always start out using Redis and only move to Rabbit if my load gets too high (which is a transparent swap anyway).", "group_id": 81, "id": 359530}, {"user_id": 8, "stars": [{"date_created": 1300218742.400336, "user_id": 141}, {"date_created": 1300265417.970001, "user_id": 5367}, {"date_created": 1301502418.4417119, "user_id": 24931}], "topic_id": 13205, "date_created": 1300217788.0222421, "message": "thrilled with the redis backend here. with rabbitmq, i lived in terror that one random day it would fail with some cryptic ungoogleable erlang error message, like it tends to do often.", "group_id": 81, "id": 359692}, {"user_id": 3580, "stars": [], "topic_id": 13205, "date_created": 1300222048.8268061, "message": "@coderanger @zain that's very, very exciting news. I'd really like to use Redis.", "group_id": 81, "id": 360098}, {"user_id": 3580, "stars": [{"date_created": 1300228995.9344349, "user_id": 8}], "topic_id": 13205, "date_created": 1300222081.80791, "message": "In other news, makes complete sense but it wouldn't have occurred to me that stack traces might be a reason for me to care what language my messaging server is written in", "group_id": 81, "id": 360100}, {"user_id": 928, "stars": [], "topic_id": 13205, "date_created": 1300253033.024744, "message": "I dont have any problems with rabbitmq + celery, works quite robustly", "group_id": 81, "id": 362932}, {"user_id": 18537, "stars": [{"date_created": 1300289173.042608, "user_id": 141}], "topic_id": 13205, "date_created": 1300283590.1638589, "message": "We've been using RabbitMQ at Yipit for about 9 months with no major problems yet.  Stick to the brew versions for Mac and aptitude versions for Ubuntu.  Their documentation is pretty poor I know, but the system does work very well when it's up and running.", "group_id": 81, "id": 365838}, {"user_id": 3748, "stars": [], "topic_id": 13205, "date_created": 1300410622.25331, "message": "Before launching celery, be sure redis is working well.  Do a ping from the client or from a python interpreter session.", "group_id": 81, "id": 378917}, {"user_id": 3580, "stars": [], "topic_id": 13205, "date_created": 1300415221.133492, "message": "@jdaguilera do you mean.. institutionalize the check in front of every Celery startup?", "group_id": 81, "id": 379221}, {"user_id": 12780, "stars": [], "topic_id": 13205, "date_created": 1300426571.2106631, "message": "If you have redis instances 1 master and several slaves with some failover logic ensure a master is always running and slaves are pointing to it.  How can celery use this setup?  Even if you have logic in the celeryconfig.py to find the master, how can it dynamically reconfigure itself during runtime to point to the new master?", "group_id": 81, "id": 380062}, {"user_id": 257, "stars": [], "topic_id": 13205, "date_created": 1301428768.152092, "message": "@jdaguilera Latest Kombu calls INFO when it connects, so celeryd doesn't enter the busy loop bug trying to reconnect", "group_id": 81, "id": 471957}, {"user_id": 257, "stars": [], "topic_id": 13205, "date_created": 1301428839.051851, "message": "@bryanweingarten You use keepalive or similar to automatically switch the IP address of the server when it's down.  Then celeryd will re-establish the connection and recover", "group_id": 81, "id": 471966}, {"user_id": 1883, "stars": [], "topic_id": 13205, "date_created": 1301445080.8470891, "message": "@asksol link to keepalive? It's kind of a bad name to google.   Is it like http://www.backhand.org/wackamole/ ?", "group_id": 81, "id": 474434}, {"user_id": 257, "stars": [], "topic_id": 13205, "date_created": 1301476934.416369, "message": "@jdunck: http://www.keepalived.org/  wackamole seems similar.   See also Pacemaker: http://clusterlabs.org/wiki/Main_Page", "group_id": 81, "id": 480224}]