[{"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306347618.171993, "message": "Here I am with yet another terminology question. I thought I was clear on this one, but now I find that I am not.\n\nObtaining seems obvious: striving towards obtaining or achieving something. But Doing is much more vague.\n\nI always thought it had to do with engaging in an activity without a specific goal, like exploring an unknown territory or working out. But some of the examples confuse me. \"Star Wars\", for example, has an OS concern of Doing, defined as \"the Empire is searching for the location of the rebels, and the rebels are attempting to transport the plans to their home base\". Both of those can just as easily be described as Obtaining... finding the rebel base, obtaining the plans.\n\nSome of the other very general examples have the same issue. \"Searching for a job\" is listed as an example. Isn't that Obtaining because the objective is to obtain a job? \"Climbing the Alps\" is striving towards achieving something. \"Running an election campaign\" is striving to win an election. \n\nWhere is the distinction?", "group_id": 2515, "id": 1181919}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306357048.7414401, "message": "I will just offer a view, but this may be wrong. To me the Star Wars example is quite good. When I consider all the OS characters, I can't see Obtaining. The farm boy is trying to become a jedi, his mentor is trying to make up for a past mistake, the empire are searching for the rebel base, and the rebels are trying to get the plans and find a way to destroy the death star.\n\nThe empire is not trying to obtain the base, and the rebels are not trying to obtain the death star. I can see they are both trying to be victorious, but I don't see that as being as clear cut as the Dramatica example of 'winning an election'.\n\n In Star Wars the doing is where all the action is. It's the process that makes farm boy have faith, it's the trying to escape that shows his mentor how he can be more powerful, and its the attempt to destroy the rebel base that makes Darth vader aware of this new competition.", "group_id": 2515, "id": 1184253}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306357124.5009489, "message": "Just to add, when I said \"The farm boy is trying to become a jedi, \". I think Luke (MC) thinks that is obtaining at first, but in the OS we learn that it is the process, and probably a process that never ends.", "group_id": 2515, "id": 1184262}, {"user_id": 7664, "stars": [], "topic_id": 36784, "date_created": 1306362636.559726, "message": "Do they want to destroy the Death Starv (to continue a theme) from the beginning?\n\nI've had this question about SW for a while, too, btw. \n\nDoes Luke want to become a Jedi, or does he want to engage in the war? One would be obtaining, one would be doing.", "group_id": 2515, "id": 1184943}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306362336.9260941, "message": "But then again, I suppose obtaining the plans is only one step on the path. Their ultimate goal is to destroy the Death Star. But still, since Obtaining is defined in part as \"achieving something\", doesn't destroying the Death Star fall better within Obtaining?  They have a specific objective, so they're not just Doing something. They're working towards achieving something.", "group_id": 2515, "id": 1184895}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306362203.207495, "message": "Becoming a jedi... that's more like Gathering Information. But acquiring the plans to the Death Star... if that ain't Obtaining, what is?  :)", "group_id": 2515, "id": 1184871}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306362350.878242, "message": "There just seems to be a lot of overlap between the two.", "group_id": 2515, "id": 1184897}, {"user_id": 7664, "stars": [], "topic_id": 36784, "date_created": 1306363207.3091249, "message": "Growth happens here because of Doing, while the more obvious goal appears to be Obtaining.\nTo bring in our Groundhog Day discussion, growth happens there because of Learning, while the more obvious goal appears to be Obtaining (bedding Rita, saving the Old Man, Killing himself.)\nMaybe the shortcoming here is that we desperately want things to be Obtaining, and it blinds us.", "group_id": 2515, "id": 1185052}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306362993.3041351, "message": "In fact, destroying the death star didn't really help at all. It was stopping the empire destroying the rebel base that mattered.", "group_id": 2515, "id": 1185029}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306362919.141922, "message": "I think there is an issue here with what we assume the characters want and how the story unfolds. I see star wars as very much a 'Journey' movie. Everyone develops because of what they are doing, not through what they are trying to achieve (if they didn't destroy the death star, Luke would still know about the force, Ben would still be 'more powerful', Han would still turn good).", "group_id": 2515, "id": 1185017}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306363208.0725081, "message": "The Goal is a static appreciation, meaning it doesn't change throughout the entire story. If the Goal of Star Wars was Obtaining, how would you describe it?", "group_id": 2515, "id": 1185053}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306363533.1619129, "message": "I think if we work hard we can get Groundhog Day in every thread! :)", "group_id": 2515, "id": 1185101}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306364528.91956, "message": "I should also add that the nature of the model is such that in every quad two items will seem to exist along an analog scale while the other two will seem to be more binary. Progress and Future overlap to a certain extent, whereas the Past and Present have very defined edges.", "group_id": 2515, "id": 1185247}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306363573.9160869, "message": "Jim, could you explain what you mean by 'static appreciation' in this context?", "group_id": 2515, "id": 1185106}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306364096.9079361, "message": "Plot has both Static Appreciations and Progressive Appreciations. Goal, Consequence, and Requirement are static -- they remain constant throughout the entire throughline. Progressive Appreciations are Acts, Sequences and so on. These are different in that it is more important how they relate to one another rather than what they are.", "group_id": 2515, "id": 1185195}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306369719.017621, "message": "If the goal of Star Wars were obtaining, I would say that the Empire wants to find and destroy the rebel base, and the rebels want to stop them.", "group_id": 2515, "id": 1186149}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306369641.9557731, "message": "So my perceiving an overlap is a result of them being the more analog pair. Interesting!", "group_id": 2515, "id": 1186135}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306377510.716877, "message": "\"...if they didn't destroy the death star, Luke would still know about the force, Ben would still be 'more powerful', Han would still turn good\".  Ah, but knowing about the force isn't the goal, neither is using it... is it?  Restoring balance to the force is the ultimate goal, so it would be obtaining, wouldn't it?  It's hard to simply look at Star Wars within the context of Episode IV itself since we all know how it turns out - but really, Luke's learning the force is tempered by Obi-Wan's perception that he's reckless, impatient, and too much like his father.  Learning to trust the force is the climax of Episode IV: without that, Luke wouldn't have successfully destroyed the Deathstar.  When Luke ventures down the dark path in Episode V, Obi-Wan and Yoda refer that all hope may not be lost, that there is yet another  - Leia, again with the overall goal of obtaining balance to the force and defeating the Empire.  Darth Vader presents what at first appears to be the same approach to solving the problem at the climax of Episode V by defeating the Emperor, however, his view differs from Luke's/Obi-Wan's/Yoda's in that he envisions the galaxy still needing someone to rule it... which still means it would be an Empire.      ", "group_id": 2515, "id": 1187155}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306379973.2329581, "message": "Assuming the Goal of Star Wars is stopping the Empire from destroying the rebel base, how do you see the Protagonist working to resolve that problem from the very beginning? How would you identify an Inciting Incident that created this problem?", "group_id": 2515, "id": 1187348}, {"user_id": 7664, "stars": [], "topic_id": 36784, "date_created": 1306382845.4900739, "message": "I would argue that \"when X happens, balance will be returned to the force\" which removes \"obtaining\" as the goal.\n\nThis is sort of the same as saying \"when a stop character moves an element in the external world, balance is returned to the theme browser\" -- that could be any element.", "group_id": 2515, "id": 1187593}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306408107.5031061, "message": "About this bit, and looking just at the OS:\n\n' \"...if they didn't destroy the death star, farm boy would still know about the force, Ben would still be 'more powerful', Han would still turn good\". Ah, but knowing about the force isn't the goal, neither is using it... is it? Restoring balance to the force is the ultimate goal, so it would be obtaining, wouldn't it?  '\n\nThe problem I see just on this bit with 'Obtaining', is that balance can not be obtained as such. The balance comes about through each character doing the thing they need to do, assuming the Goal is 'restoring balance to the force'. \n\nI might be wrong, but here's an example that I think explains my view, with 2 alternative results in the story:\n\n1) Everything is as normal except farm boy does not destroy the death star\n\n2) Farm boy destroys the death star but without trusting Ben (so using the computer)\n\nIn 1), that would mean the rebel base is destroyed, but farm boy would still have his Jedi knowledge, his knowledge of the force. There would still be a rebellion with a potentially powerful leader.\n\nIn 2), Farm boy has failed as a Jedi. The death star is gone, the rebel base survived. But the protagonist would be a failure in view of the Goal.", "group_id": 2515, "id": 1190991}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306413198.6000199, "message": "I've always looked at balancing the force as an inner-issue, one that is ultimately fulfilled with learning to trust.  If Luke doesn't learn to trust his feelings and \"use the force\", there's an imbalance.  Luke WANTS to be a doer - that's his issue; he's too impatient to balance his desire for action with the required mindset.  He thinks by doing all these things, jumping into battle, etc., will get him to the desired outcome.  But Obi-Wan's the one who tempers those feelings, using caution (and as we know, Darth Vader is essentially a future path incarnation of Luke failing).  All of the events that happen to Luke are like little tests of his raw talent, to see if he has the means to \"become\" a Jedi by obtaining a balance within, not using the force which can be accomplished for \"evil\" purposes as demonstrated by Darth Vader.  If the rebel base were destroyed, we would have had Luke w/failure.  He would still have what knowledge he does, but it's untempered and he most likely would have started suffering from feelings of doubt, guilt, anger, suffering, etc., all of which throw that balance out of whack and lead down to the path of the dark side.  By destroying the Death Star, he fulfills a step in his journey - still not complete - while the Rebel Alliance lives to fight another day.", "group_id": 2515, "id": 1191360}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306413910.9163001, "message": "\"Assuming the Goal of Star Wars is stopping the Empire from destroying the rebel base, how do you see the Protagonist working to resolve that problem from the very beginning? How would you identify an Inciting Incident that created this problem?\"\n\nWell, here's the thing... I'm not even sure Luke is the protagonist of \"Star Wars\". He's rarely the driving force, but is always taking orders/advice from either Leia or Obi Wan.  Leia is the only one of the three who is actually in the story from the very beginning.\n\nThe inciting incident would be the attack on Leia's blockade runner. And the Story Goal would remain Obtaining--the Empire searching for the rebel base, and the rebels trying to stop them.", "group_id": 2515, "id": 1191423}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306417451.138474, "message": "But it is ultimately Luke's decision and effort that results in the Goal being achieved (and I think that applies to any of the Goal's mentioned in this thread).", "group_id": 2515, "id": 1191820}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306419011.0624509, "message": "I would say looking at it from how Mikeaja just stated it above, it is reasonable to conclude Obi-Wan is the protagonist and Luke is the main character.  Obi-Wan is the one who's proposed the task by Leia, so he's the one who's given the goal of seeing the plans in the droids to the Alliance.  He does not, however, have the skills that Luke has flying a fighter and ultimately manipulates Luke to an extent - they both have a common goal, but in order for the mission to succeed, Obi-Wan needs for Luke to trust the force.  Luke is the main character because he's the one the audience more or less \"witnesses\" the story through.  We don't know what it's like to be \"an old wizard\" who knows the force, but we can experience learning it through a young farm boy who's torn between an emotional-ruling side vs. one that requires consideration.  As such, Luke isn't required to drive the story - it's Obi-Wan who does... he's the one making the decisions - even the one for self-sacrifice for a greater good.", "group_id": 2515, "id": 1192071}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306417353.395726, "message": "I think this is the crux of the differences here. I can not see how Luke can not be the protagonist.\n\nIf the goal is destroying the death star, he is the driving force and solution, albeit with considerable help.\n\nIf the goal is restoring balance to the force, it is ultimately Luke's faith that brings that about, and with considerable help.\n\nLeia could not have been there, and either of the above Goals could still have been achieved. I would say Leia's main impact on the goal was being the reason R2 found Obi-wan. She has no direct impact on Luke blowing up the death star, or trusting the force.\n\nI think there is a reasonable argument that Obi-wan is very close to a protagonist. Clearly Luke would not have succeeded without Obi, and Obi would have had nothing without Luke.", "group_id": 2515, "id": 1191808}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306422014.088341, "message": "That's an interesting take on it. Can Obi-wan be the protagonist though when it is ultimately Luke that makes the decision that achieves the Goal. What I mean is, Obi-wan makes a lot of the decisions, but the most important one comes from Luke.", "group_id": 2515, "id": 1192747}, {"user_id": 10814, "stars": [{"date_created": 1306426912.189297, "user_id": 7645}], "topic_id": 36784, "date_created": 1306422494.363723, "message": "RE: Obtaining, the rebels have the Death Star plans before the movie even opens.  It says so in the credits.  So Obtaining them isn't the issue, it is getting them to the rebel base and trying to find a way to exploit a weakness in order to fight the Empire more effectively.", "group_id": 2515, "id": 1192891}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306423239.1527491, "message": "As for obtaining - the rebels have the plans, but even so - those aren't enough as no other fighter pilot can get their shots in perfect.  Luke, with all his skill, can't either.  So, from that perspective, isn't the answer to resolving the problem - the death star destroying the rebel alliance -  for Luke to trust the force?  Which is sort of like obtaining faith in something, correct?", "group_id": 2515, "id": 1192994}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306422937.226028, "message": "Sure (Obi-Wan can be protagonist), I don't think the definition of protagonist is limited to a singular character - it's a function played within the confines of a story.  In this case, the entire Alliance acts as the protagonists.  Obi-Wan gives us the subjective story throughline and acts as something of an impact character to the Luke (did I get that right?  I'm still learning this stuff and don't have the software - so I'm often \"thinking out loud\".", "group_id": 2515, "id": 1192959}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306422729.9801819, "message": "The moment in Star Wars where the four throughlines click together is when Luke hears the secret message stored in R2D2.  From that moment on, he acts as protagonist to lead the effort, even though he is not in charge.  Everything before that introduces the world of Star Wars to the audience and gives us some perspective on the universe in which the story exists.  The film could just as easily have opened with Luke and his guardians on Tatooine, but then the audience would not have a sense of the world (and stakes) involved.", "group_id": 2515, "id": 1192934}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306427847.9164381, "message": "I don't think that is how Doing is defined. The \"doing\" of the activity IS the objective. There are some writers whose goal is to write more effectively. Whether they lack the experience or the skills necessary, their goal is to write better because in the past they couldn't do it. They are not concerned with actually finishing the book or selling it, etc.", "group_id": 2515, "id": 1193787}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306426939.0594079, "message": "\"Obtaining them isn't the issue, it is getting them to the rebel base and trying to find a way to exploit a weakness in order to fight the Empire more effectively.\" \n\nBut by the definition in the book/software, isn't that still Obtaining? It is activity directed towards a specific objective.  Doing, on the other hand, is defined as having no specific objective.", "group_id": 2515, "id": 1193619}, {"user_id": 10814, "stars": [{"date_created": 1306428367.7791131, "user_id": 7645}], "topic_id": 36784, "date_created": 1306428168.386111, "message": "By definition, a Story Goal is a form of accomplishment.  Do not confuse the nature of the story point with the methodology to reach it.  Otherwise, EVERY goal would be an obtaining goal, and that does not accurately reflect the way many stories are intended.\n\nPart of the problem lies in our cultural bias.  We tend to look at the end as the point, and not the means.  For example, many people look to the reports that Dramatica spits out at the end as the point of using it, not realizing going through the process is as important, and arguably more important, than the end result.", "group_id": 2515, "id": 1193835}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306428404.118057, "message": "If you look at the OS Concern, which is the same structural item as that of the Story Goal, it is easier to see things without the need for accomplishment.  So, the OS Concern in Star Wars is the constant battling between the empire and rebel forces, which is a Doing concern more than an Obtaining concern.", "group_id": 2515, "id": 1193885}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306428565.9348569, "message": "Also remember that a Concern implies trouble or conflict, so it is the trouble or conflict created by the battling parties that is of concern to many of the folk in Star Wars.  Uncle Owen and Aunt Beru are concerned with running the farm, which is a Doing concern.  Luke, as the farm boy with big hopes, is concerned with fighting with the rebels, and so on.", "group_id": 2515, "id": 1193914}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306428930.347338, "message": "That is how an OS Concern is different than a Story Goal.  The OS characters share the nature of their individual concerns with the OS Concern, whereas they share the SAME instance of concern as the Story Goal.", "group_id": 2515, "id": 1193962}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306528712.8357511, "message": "I think it's more that the Protagonist pursues the Story Goal, while the other characters are there to show the relative value of that pursuit in accordance with their own individual approaches.  A Sidekick isn't necessarily competing to achieve that same Goal.", "group_id": 2515, "id": 1208685}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306527378.474113, "message": "So if, for example, the OS Concern was Obtaining, all the OS characters would be concerned with obtaining in their own way... obtaining money, possessions, etc. But when it comes to the story goal, they'd all be concerned with Obtaining the same thing, a specific object or achievement that they all compete to acquire. Is that right?", "group_id": 2515, "id": 1208557}, {"user_id": 7664, "stars": [], "topic_id": 36784, "date_created": 1306533280.3528011, "message": "\"relative value\" being the key words. Although it needn't be highlighted.", "group_id": 2515, "id": 1209252}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306544167.1435659, "message": "But yes, in general the example is correct.  With the goal, they are all interested in the achievement of the story goal (which is about possessing or losing something), whether they are for it, against it, or somewhere in between.", "group_id": 2515, "id": 1210478}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306545418.241863, "message": "Correct?", "group_id": 2515, "id": 1210574}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306545402.6217091, "message": "Okay, so then if the OS Concern is Doing, all OS characters are engaging in some kind of activity, though not necessarily the *same* activity. But when it comes to the Goal, they're all involved in the same activity. (Like, for example, the war against the Empire.) But not necessarily with the same specific objectives.", "group_id": 2515, "id": 1210573}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306548865.9483571, "message": "That sounds right.", "group_id": 2515, "id": 1210757}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306556467.7790749, "message": "Ok, I'm watching Star Wars right now.  Since I'm not an authority on Dramatica, I'll use terms where I can but perhaps somebody can \"translate\" some of the ideas I have into \"Dramatica form\" since I feel as though I'm interpreting the story correctly, just not speaking the same language.  The MC is easy: Luke.  Aside from the story, we have other elements within the film itself, such as the theme music, which point this out.  The Protagonist is Ben.  I say this because as I mentioned before, he's the one given the task by Princess Leia to see the plans to the Rebels.  Once the full impact of her message is given, he turns to Luke and says \"You must learn the ways of the force if you are to come with me to Alderaan\".  It's Ben's mission and it has been defined:  get the droids to Alderaan... the plans contained within, as stated in the opening scrawl, \"can save (Leia's) people and restore freedom to the galaxy\".  Leia refers to Obi-Wan as being her only hope which I believe sets up showing us, the audience, what path/option/strategy is the only solution for solving this problem - and as Ben succinctly says, Luke must learn the ways of the force.  When, in the same scene, Luke pushes back and ponders aloud how he's going to explain all this, Ben replies \"Learn about the force, Luke\", as if it were the answer to everything.  Once Luke comes across his aunt and uncle killed, he makes the decision to go with Ben, to train and become a Jedi.  While it's his decision, it's still Ben's mission - one he (presumably) would have gone on regardless.  But of course, this isn't a story about an Old Jedi saving the day, it's a story about a young farm boy learning the ways of the force and having trust in it.  Time and time again, when confronted with obstacles, Ben displays to Luke that the force is the answer for solving them, whether it's playing a mind trick to get past imperial troopers, or using his lightsaber in the Cantina to ward off aggressors.  From the antagonist side (or contagonist), Darth Vader espouses the power of the force being much stronger than the Death Start - so we're now seeing the same argument being made by the enemy, reinforcing what we're ultimately suppose to believe.  Han provides a counter approach, stating what he believes:  \"Hokey religions and ancient weapons are no match for a blaster at your side\", however, out of all the characters, Han seems to be the one always finding himself in the most trouble... mostly because he sees his blaster as the answer to everything.  Once on Alderaan, the plans are revealed and the notion that a precise hit will set off a chain reaction, giving them the best opportunity of blowing the Death Star up.  Luke notes the size of it isn't impossible, but... nobody is successful in their attempts because something is missing, once again proving technology alone isn't the answer to solving a problem (though they do need the ship and its firepower).  Ben says \"Use the force.  Let go.  Luke, trust me...\".  Luke does so, shutting off his computer and firing away, using the force to guide him to successfully destroying the Death Star.  So while Luke had the technology - the x-wing fighter and its firepower - and the skill to fly it, what he lacked up to that moment was trust in his feelings and believe in the force.  So, that being said, is Star Wars a grand argument story because there was only one way of blowing up the Death Star?  One thing Obi-Wan clearly is, is an Impact Character.  If the OS Concern is doing, can it be said that from the SS level, the concern is obtaining?  It's pretty clear that the relationship at the heart of the story is between Luke and Obi-Wan, representing the Subjective Story.  So... does the SS have a concern like the OS does, and if so, would it be obtaining?  I seem to be hung up on the fact that the key to destroying the Death Star is Luke's trusting Obi-Wan... and trusting, to me, feels like obtaining - it's something you either have, or you don't.  There's no doing involved.  In fact, trust would only be obtained via the positive outcome.  Ok, it's late... I'm rambling.  Sorry for the long post!", "group_id": 2515, "id": 1211123}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306568339.8618679, "message": "Holy mackeral, I would try to keep the posts here short and sweet. It's hard to follow a big post like that given the format here.", "group_id": 2515, "id": 1211617}, {"user_id": 7645, "stars": [], "topic_id": 36784, "date_created": 1306568450.89258, "message": "That said, the SS does indeed have its own concern, though it usually is of a much different type then the OS concern. I would highly suggest reading the theory book, it may help answer many of these questions.", "group_id": 2515, "id": 1211623}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306576294.43452, "message": "But I would say this is where the significance of Obi-wan's impact comes in. It is because of this initial mission (which can't be completed because Alderaan doesn't exist anymore), that gets Luke to discover what his actual mission is - blow up the death star / being balance to the force.", "group_id": 2515, "id": 1212013}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306576127.414861, "message": "...I disagree. I don't think that is the mission. It is Leia's mission, who then passes it to Ben, but it is not the mission of the film. Plus, as Chris highlighted earlier, some of that mission has been completed before the film starts.", "group_id": 2515, "id": 1212010}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306575988.5840909, "message": "@JBarker, this seems to sums things up quite well. Re. this bit:\n\n\"The Protagonist is Ben. I say this because as I mentioned before, he's the one given the task by Princess Leia to see the plans to the Rebels. Once the full impact of her message is given, he turns to Luke and says \"You must learn the ways of the force if you are to come with me to Alderaan\". It's Ben's mission and it has been defined: get the droids to Alderaan...\"\n\nI", "group_id": 2515, "id": 1212007}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306581957.9101341, "message": "But don't confuse \"mission\" with the goal of the story - that's where I'm trying to relate it to Dramatica terms.  The goal isn't to get the droids to the Alliance... that doesn't solve anything, really, otherwise the story would stop.", "group_id": 2515, "id": 1212164}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306582195.4186299, "message": "For instance, Leia's owns the \"mission\" much like Doug owns the wedding in The Hangover.  Those are the contexts which the story is set in, however, in both cases, we don't experience the story from their standpoints because they both are imprisoned.  In Star Wars, we would have watched Leia in a cell and in The Hangover we would have watched Doug throw a mattress off a roof and get baked in the sun.", "group_id": 2515, "id": 1212168}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306582035.3445041, "message": "And while it's Leia's mission to start, she cannot finish it.  So within the context of the OS, who we choose as a protagonist/main character has a huge ramification on what angle of the we're trying to tell the story from.", "group_id": 2515, "id": 1212165}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306582682.636152, "message": "So while the overall goal of the story remains the same, the challenges/trials/tribulations etc. all change depending on whom we actually set the story around.  So in that context, what part of Dramatica and its theory would we call Obi-Wan's need to get the droids to the rebels?  It's part of the OS, but it's not necessarily the SS, which is mentoring Luke.  The journey itself, however, provides the opportunity for the SS to take place.", "group_id": 2515, "id": 1212217}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306585856.8280711, "message": "Just had this pop in my mind while walking the dog.  If we use the SS to compliment the OS, we have the movie's premise: An old wizard helps a young, naive farm boy fulfill his destiny by teaching him the ways of the force so he can destroy the Death Star, thus saving the Rebel Alliance.  I must say, I've always hated writing these things out, but I think viewing it within the context of Dramatica, it makes total sense now.", "group_id": 2515, "id": 1212356}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306598458.344456, "message": "A couple of points:\n\n\"But don't confuse \"mission\" with the goal of the story - that's where I'm trying to relate it to Dramatica terms. \"\n\nExactly. That's was the point I wanted to make. Ben's mission is not the Goal, but it certainly helps Luke achieve the Goal. \n\nI think much of what you have written is the difference between the MC, IC, and SS throughlines compared to the OS. That's fine, but I don't think the issue of who is protagonist & Being vs Obtaining is to do with that. The question was, is he the protagonist or Ben. I would say it is clearly Luke, given the fact that the Goal is not Ben's initial mission. \n\nThis bit:\n\n\"So in that context, what part of Dramatica and its theory would we call Obi-Wan's need to get the droids to the rebels?\"\n\nWell, we have the Obi-wan, the IC, and we have old mentor, OS. So, I would say this is part of the OS thoughline as it gets the OS story going, and the part of it that influences Luke, the IC thoughline.", "group_id": 2515, "id": 1212950}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306599776.5009761, "message": "I think I've got it, albeit still somewhat hung up on one issue.  From Dramatica Book, \"In this regard, the archetypal Protagonist is the chief proponent and principal driver of the effort to achieve the story's goal.\"  Working backward from the story goal, Luke is the one who accomplishes this particular story's goal.  It's also ultimately his decision to go with Obi-Wan, who as with the best of teachers, lets the students choose for themselves, guiding them (his words echo this as he says \"you must do as you see fit\"... or some variation of that).", "group_id": 2515, "id": 1213022}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306600466.3360901, "message": "Where I've been hung up is separating the function, the role of the character himself, from the actions he takes.  From the things Luke says to some of his actions, one doesn't get the sense he's driving the story goal, but that's because the story goal takes a backseat to the the SS storyline for much of the film.  He has a desire early on, but then raises doubts when first given the opportunity.  Once he returns from the scene of his aunt and uncle's slaughter and tells Obi-Wan \"there's nothing for me here now.  I want to learn the ways of the force and become a Jedi, like my father\" ---> well, this sets up the SS, which ultimately intersects with the OS when he uses the force to resolve the story goal at the climax.  That makes much more sense now.", "group_id": 2515, "id": 1213069}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306603097.0450079, "message": "As I understand it re. Dramatica, what you said here is a key point:\n\n\"Working backward from the story goal, Luke is the one who accomplishes this particular story's goal.\"   \n\nbecause Dramatica takes a complete, already told story view.\n\nAnd re. this:\n\n\"Once he returns from the scene of his aunt and uncle's slaughter and tells Obi-Wan \"there's nothing for me here now. I want to learn the ways of the force and become a Jedi, like my father\" ---> well, this sets up the SS,\"\n\nI would say, although I might be wrong here, that this sets up the OS as much as the SS. We now see farm boy determined to make a difference, and that ultimately leads to him being someone capable of succeeding.\n\nWithout that incident, we would only have the SS, because Luke would not be part of the OS due to him remaining to help his uncle, while most likely still having contact with Obi-wan.", "group_id": 2515, "id": 1213323}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306635269.3421421, "message": "So what, specifically, *is* the story goal?", "group_id": 2515, "id": 1215763}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306642779.119164, "message": "Virtually all of Obi-wan's time in the story is as part of the IC and Relationship throughline, with some perfunctory, but key OS involvement as Guardian (help and conscience).", "group_id": 2515, "id": 1216075}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306643035.419811, "message": "Luke is the protagonist because he is the one constantly wanting to move forward (weighing pros and cons and pursuing through proaction).  It is especially true if you take into account the parts of the script that were deleted.  In those he watches the space battle from the ground and tells his pals that he wants to join the rebellion, plus I think I remember him mentioning to his uncle that he wants to go off planet to get training.", "group_id": 2515, "id": 1216079}, {"user_id": 10814, "stars": [], "topic_id": 36784, "date_created": 1306643079.0522289, "message": "Everyone has their own agendas, but Luke wants to kick ass from the beginning.", "group_id": 2515, "id": 1216081}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306673711.0979781, "message": "\"So what, specifically, *is* the story goal?\" - For the Rebel Alliance thwart the Empire's attempt to annihilate them with their Death Star.  They don't know how to go about accomplishing this yet, though, until they get the plans in the droids into the hands of the right people (and even then, it's a combination of technology and the force that accomplishes the goal).", "group_id": 2515, "id": 1217330}, {"user_id": 30287, "stars": [], "topic_id": 36784, "date_created": 1306674076.9120469, "message": "@JBarker But the story goal is a static appreciation. The protagonist needs to have the goal from the very beginning. Luke doesn't have that goal until well into the story.", "group_id": 2515, "id": 1217355}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306677340.1027329, "message": "Uncle Owen acts as an obstacle, hindering his efforts and shielding him from any knowledge regarding his father and subsequently Obi-Wan when his name comes up, all in an effort to prevent Luke from pursuing his goal.", "group_id": 2515, "id": 1217529}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306677694.2697489, "message": "I would agree it feels somewhat vague because he doesn't have a concrete, specific goal early on (to help the Rebel Alliance and defeat the Empire), but as the story progresses, Darth Vader obtains the name of the planet; the droids deliver the secrets; and the Rebel Alliance formulate a specific approach to solving their dilemma ----> all in step with the overall story goal of saving the Rebel Alliance.", "group_id": 2515, "id": 1217547}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306676991.7222481, "message": "But the story goal does exist at the very beginning - it's even in the scroll setting it up:  Save Princess Leia's people, which is implied from the Empire's Death Star since they've already accomplished a victory in stealing the plans.   I would say as Chris has noted, Luke has wanted to kick the Empire's ass from the beginning as well (beginning as being since he was younger, before we meet him in THIS story).  I think the story's design plays into this being somewhat misleading because the first 10 minutes or so of the move put the entire OS into context, then we're introduced to Luke who doesn't appear to be actively involved in pursuing this goal - he's just a farm boy... but his goal is revealed at the dinner table with his agreement with Uncle Owen: he's fulfilling it to receive permission to join the academy and fight the Empire.", "group_id": 2515, "id": 1217512}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306679870.0257599, "message": "I would say the overall OS Goal includes these factors, but as a stated Goal I don't think it is clear enough. Also, I don't think the Goal is saving the Rebel alliance, because they don't know they in direct danger until the base is discovered. Also this certainly doesn't involve the main OS characters until much later.\n\nI would say the OS Goal is simpler, and it is 'to restore freedom to the galaxy'. This is the last part of the credits.\n\nThis involves everyone from the beginning, even farm boy. Even though he is unable to do anything about it straight away, it is still his Goal.", "group_id": 2515, "id": 1217685}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306683901.6737461, "message": "I was thinking \"to restore freedom to the galaxy\" as well, but it just seemed felt too vague within the context of what we see as a finished product on the screen (it could be earlier drafts were more elaborate).  But it does work looking at the three characters who are trapped or enslaved in the movie and how this goal impacts them directly (Leia, Luke, Han).  It's no accident that existentialism and being play a huge role in the themes presented throughout, and freedom is certainly one of the primary elements found in existentialism.", "group_id": 2515, "id": 1218161}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306685607.141057, "message": "This is becoming a nice form of procrastination from writing, that's for sure.  On further thought, the story goal for this story can't be freedom, can it?  Otherwise, the result is a false positive because Darth Vader escapes, flying off to fight another day with the Empire Striking back meaning a story goal of freedom would have been unresolved. The only thing it resolved was saving the Rebels.  Perhaps this is taking into consideration the sequels, for which we would certainly say the trilogy goal is freedom.  Does that sound reasonable?  Again, it's kind of hard to subject an analysis to just one story when we know what happens later.", "group_id": 2515, "id": 1218274}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306686396.5354991, "message": "Interesting point. I think if we isolate the first film then the Goal could be freedom. I don't think the assumption (before knowing of ESB) was that Vader was going to form a new Empire, or that the Emperor was still alive or still able to operate. To me, the first film ended with the suggestion that only Vader survived.\n\nIn that sense, ESB takes a whole new turn as suddenly there is a powerful evil force again.\n\nTwo points of interest here, 1) I think this is why, in the new films, the storm troopers were shown to be a clone army, hence explaining how they rebuilt so fast, and 2) I heard that George Lucas made Star Wars as an individual film with no bigger backstory, and primarily as a children's film. In 1977, it was called Star Wars, not Star Wars IV. That only came when Empire Strikes Back was made, after realising the success of the first film.", "group_id": 2515, "id": 1218336}, {"user_id": 33839, "stars": [], "topic_id": 36784, "date_created": 1306690006.047365, "message": "I'm not sure what the genesis of the trilogy actually was.  I could have sworn at one time I heard it was written all as one movie, but it was just too big, so it was broken down into three separate movies which sort of mirror act divisions, really.  Of course, I've said that elsewhere and have been dismissed that the character arcs, especially Darth's, didn't exist and the big revelation in Empire wasn't even firmly decided upon until well into filming (Empire was my first movie-going experience, by the way...)  Whether it existed on paper or not, it seems like there was some inkling where it was all going from the get-go.  That being said, I think episode IV is a complete story unto itself, even though with Darth Vader fleeing implying, to a certain extent, the lack of closure.", "group_id": 2515, "id": 1218672}, {"user_id": 30951, "stars": [], "topic_id": 36784, "date_created": 1306691550.6965179, "message": "I've heard various, including that George Lucas only came up with the 'it was all a grand plan' much later. Personally, I saw nothing in the first film that suggested there was any inkling of an idea that Vader would turn out to be his father, or that the Empire would be 're-born'. \\I think the Vader getting a way was just a bit of Hollywood being Hollywood. It worked out well though.", "group_id": 2515, "id": 1218809}]