[{"user_id": 11626, "stars": [], "topic_id": 7410, "date_created": 1298086361.834888, "message": "Oaxaca –  At least 15 men, three of them photographers, were injured in the southern Mexican state of Oaxaca in a clash between teachers and police when the latter blocked the educators from approaching an event being participated in by President Felipe Calderon.\r\n\r\nThe police fired rubber bullets and tear gas at the protesters during the incident on Tuesday.\r\n\r\nThe demonstrators hurled rocks and held three female police officers hostage for a brief time.\r\n\r\nTwo teachers are hospitalized in serious condition, SNTE teachers union Local 22 secretary Gabriel Lopez said.\r\n\r\nTeachers and police confronted one another on three occasions when the educators belonging to Local 22 tried to break the security cordon set up around the Governor's Palace, where Calderon was meeting with Oaxaca Gov. Gabino Cue.\r\n\r\nPolice did not permit the teachers to enter the palace and repelled them with tear gas, whereupon the demonstrators threw stones at the officers.\r\n\r\nTwelve teachers were injured along with photographers Dario Nolasco, Jaime Garcia and Gildardo Mota.\r\n\r\nThe three reporters filed a criminal complaint against the state and federal police for assault.\r\n\r\nSome officers were also injured, but that has not been officially confirmed, the press reported.\r\n\r\nCalderon carried out his activities, among which were the inauguration of a private university, without any further incident in Oaxaca city.\r\n\r\nLocal 22 members staged a revolt in 2006 to demand the resignation of Gov. Ulises Ruiz and they said they have broken off all dialogue with Cue, who is the first governor to come from a coalition opposed to the Institutional Revolutionary Party, which governed the state of Oaxaca for 80 years.\r\n\r\nThe state government issued a statement in which it said it regretted these acts and \"is in solidarity with professors Gabriel Meliton Santiago and Raymundo Santiago Sanchez,\" who are hospitalized.\r\n\r\nhttp://latino.foxnews.com/latino/news/2011/02/16/injured-clash-teachers-police-mexico", "group_id": 3920, "id": 148780}]