[{"user_id": 37168, "stars": [], "topic_id": 43002, "date_created": 1312044350.375196, "message": "I've created detailed synopses for all four throughlines, and I've just read the Dramatica for Screenwriters book. I'm wondering if anyone has used the Z-pattern to develop his or her scenes. If so, you would come up with 48 scenes per throughline, right? Obviously, some scenes will have to account for more than one throughline.", "group_id": 2515, "id": 1755057}, {"user_id": 37168, "stars": [], "topic_id": 43002, "date_created": 1312044352.946697, "message": " My question is this: won't those scenes that are double-dipping be accounting for different elements (referring here to the elements developed in the Z-pattern of each throughline)? If so, how can I be sure that the final story-woven script accounts for all 64 elements? To be honest, I'm not even sure if I'm asking the right question here...", "group_id": 2515, "id": 1755058}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312048065.2717309, "message": "I also found that the themes are often explored anyway, and in unexpected ways. Sometimes it's better just to let your subconscious do the work, and see what it has to say.", "group_id": 2515, "id": 1755238}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312046866.6676879, "message": "If you've already got a detailed outline, I wouldn't worry about using the Z-pattern (or whatever pattern the PSR suggests -- they aren't all Zs).\n\nI would recommend writing the story out, and then when rewriting it, see what the PSR has to say. I recommend this for a bunch of reasons -- it's too easy to put off writing, for one thing, and Dramatica offers a lot of attractive distractions.", "group_id": 2515, "id": 1755168}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312048275.3843839, "message": "Technical thing: the PSR lays out how themes are explored, and it provides 48 scenes on average -- that's for all 4 throughlines combined. \n\nWhen I used it I found that it actually worked better when I let it be fluid. A scene wouldn't be specifically about one thing (Fate). It would cover Fate and then bleed into Interdiction. When I returned to that throughline, I'd pick up interdiction, move into Prediction... It's not so discrete.", "group_id": 2515, "id": 1755258}, {"user_id": 37168, "stars": [], "topic_id": 43002, "date_created": 1312051017.9728751, "message": "Thanks for the response; it is helpful. That said, I'm confused when you say \"it provides 48 scenes on average.\" I see it break down each throughline into four acts, and each act into four issues, which makes for 64 scenes. Of course, the issues can be broken down to the elemental level, which would make for 64 scenes per throughline for a total of 256 scenes. So I'm curious: how are you arriving at 48? I'm probably being too detailed, but i just want to make sure I understand all of this.", "group_id": 2515, "id": 1755399}, {"user_id": 37586, "stars": [], "topic_id": 43002, "date_created": 1312051688.2010341, "message": "I like the sequence paradigm.  4 thoughlines, each with 4 signposts and 3 journeys.  7 sequences per through line. 7 x 4 =28. 28 sequences and the sequences have as many scenes as you need to cover that storypoint.", "group_id": 2515, "id": 1755438}, {"user_id": 37586, "stars": [], "topic_id": 43002, "date_created": 1312052988.4532449, "message": "(I am doing this for my own edification because I am learning) example: if your OS was in Fixed Attitude and signpost 1 was Impulsive Responses and the OS benchmark was Innermost desires and the OS goal/concern is Memories then Your scenes in your first sequence for the OS would cover Impulsive Responses in light of the issues Value vs Worth and Worry vs Confidence and the problems beneath those but the whole sequence is all in the light and shadows of the OS Concern Memories and Issues of Evidence with OS Problem of Self-aware and OS symptom of Desire.  The benchmark of Innermost Desire could be shown as fears which are really strong in signpost one in regard to Memories.", "group_id": 2515, "id": 1755516}, {"user_id": 37586, "stars": [], "topic_id": 43002, "date_created": 1312054326.4903591, "message": "That is confusing and one could get lost in that and never write anything.  My hope is that it would help make a good outline.  That said, sometimes restrictions or limitations can bring out some of the greatest inspired ideas and creativity.", "group_id": 2515, "id": 1755588}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312056560.2014389, "message": "That said, I still advise writing your story first since you've got a good outline.", "group_id": 2515, "id": 1755741}, {"user_id": 38869, "stars": [], "topic_id": 43002, "date_created": 1312055332.510359, "message": "I tend not to think of the PSR as \"scenes\" rather movements of plot or events that happen as the story begins to it's end. \"Scene\" contains these events, and sometimes these events when employing characters are meaty with story points.\n\nI like to think of scenes as \"what we see\" but \"what actually happens\" can be derived from the PSR. I must emphasize \"can\" since one can forgo using the PSR and just rely on the throughline progressions. Example, Obtaining --> Learning.", "group_id": 2515, "id": 1755654}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312056368.15274, "message": "Let's say that Learning is explored in terms of Fate, Interdiction, Prediction and Destiny. \n\nIf you look at the browser, Interdiction and Prediction are a dynamic pair -- they are the diagonal of the Z in the Z pattern.\n\nWhen exploring them, Fate would be looked at alone. The dynamic pair is looked at together and Destiny is looked at alone.\n\nThat gives 3 \"scenes\" to that Signpost. 3 x 4 = 12.", "group_id": 2515, "id": 1755726}, {"user_id": 7664, "stars": [], "topic_id": 43002, "date_created": 1312056489.164861, "message": "12 x 4 throughlines = 48.\n\nSometimes though, you get things like Fate, Destiny, Interdiction, Prediction. That's an X-patten, and only two scenes.\n\nOr Fate, Interdiction, Destiny, Prediction. A U-pattern. 4 scenes.\n\nThat's why it's not always 48 scenes.", "group_id": 2515, "id": 1755733}, {"user_id": 37586, "stars": [], "topic_id": 43002, "date_created": 1312145804.912076, "message": "just so I am clear.  PSR = Plot Sequence Report, right?", "group_id": 2515, "id": 1760489}, {"user_id": 36437, "stars": [], "topic_id": 43002, "date_created": 1312147975.4752901, "message": "@sam_potter Yes, PSR is Plot Sequence Report.", "group_id": 2515, "id": 1760679}]