[{"user_id": 13501, "stars": [], "topic_id": 5476, "date_created": 1298058370.5920739, "message": "just comparing to chat.stackoverflow and the likes, when you hit reply, it actually not refer to someone (@*) but refer to a specific message like \":123\" where 123 = msg_id", "group_id": 88, "id": 145836}, {"user_id": 1866, "stars": [], "topic_id": 5476, "date_created": 1298138023.3382909, "message": "+1.  The ability to do some limited amount of threading within a topic would give Convore a huge leg up on forums/IRC/Twitter in my book.  It would be great if you could click reply on a specific message, and have your reply show up right below that message, indented a bit.  To prevent things from devolving, I think a reasonable depth limit (e.g., 4-8) would be fine.  IIRC Hacker News does this.", "group_id": 88, "id": 150032}, {"user_id": 1866, "stars": [], "topic_id": 5476, "date_created": 1298138825.2733669, "message": "@itsnotvalid Thanks for the heads-up, I should have checked again before listing them; my experience with Twitter was with the (old) default web client, which gives a flat list of messages like Convore.  I guess I'd reclassify this feature request as #keepingupwiththejones' rather than a differentiator, then.", "group_id": 88, "id": 150083}, {"user_id": 13501, "stars": [], "topic_id": 5476, "date_created": 1298138618.8130319, "message": "@sparky actually twitter implicitly stores the msg id of the message you're replying to... and #NewTwitter also fetches them (and many client does that way before twitter does)", "group_id": 88, "id": 150065}, {"user_id": 13501, "stars": [], "topic_id": 5476, "date_created": 1298138892.1941421, "message": "@sparky it seems that half of the \"suggestions\" fall into this category ;-)", "group_id": 88, "id": 150086}, {"user_id": 14022, "stars": [], "topic_id": 5476, "date_created": 1298232934.1682529, "message": "Right now Convore is more like an instant message web application. It scrolls you to the bottom assuming that you're caught up with what's going on in the topic. It's actually kind of a pain to catch up on long topics(for instance, the 'Feedback about Convore' topic). You have to hit the 'Load previous messages' button about 10 times to get to the beginning. I don't see threading working very well with the real time updating it does with the messages.", "group_id": 88, "id": 154676}, {"user_id": 14022, "stars": [], "topic_id": 5476, "date_created": 1298233343.2440529, "message": "Having a thread link on messages with replies that takes you to a page with the replies indented is the closest thing I can think of that might work. It would actually be kind of neat with the real time updating. You would see out of context replies pop up and then you could click on the thread link to see the whole conversation.", "group_id": 88, "id": 154689}, {"user_id": 67, "stars": [], "topic_id": 5476, "date_created": 1298288898.8371489, "message": "use forum type buttons: First. 1>2>3>4> Last. Previous. Next.", "group_id": 88, "id": 158056}]