[{"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300051529.7003291, "message": "Si usted conoce un fiscal, un periodista, un legislador, una organización que esté dispuesta a trabajar para extirpar activamente el cáncer del maltrato a la mujer, convoquelo a trabajar con nosotros para construir historias, en donde el sistema proteja act", "group_id": 2696, "id": 343672}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300051383.974179, "message": "El día de hoy convoco a la brigadadigital ha hacer un frente común, que convoque activamente estamentos vivos de la sociedad, para darle visibilidad al enorme problema que como sociedad tenemos y que pone en riesgo lamintegridad del núcleo básico sobre lo que se cimienta todo LA FAMILIA", "group_id": 2696, "id": 343669}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300050663.423573, "message": "Cientos de mujeres se ven todos los días expuestas a situaciones de maltrato físico y psicológico que ponen en riesgo su integridad y la de sus familias. Yo soy te", "group_id": 2696, "id": 343563}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300051229.755111, "message": "Mi familia se ha visto sometida al infierno que genera el ver expuestos a las personas que más amamos, al continuo acoso, la continua violencia, los reiterados vejámenes, que un individuo maltratador infringe a una mujer indefensa. Se ha actuado con todos los medios legales a nuestro alcance, pero desafortunadamente en mi caso, pareciera que el sistema le hiciera la vida sumamente fácil al abusador y tremendamente complicada a la víctima", "group_id": 2696, "id": 343654}, {"user_id": 18844, "stars": [], "topic_id": 12881, "date_created": 1300050766.2756979, "message": "Hola!  @juandacorrea existe ya el escuadrón como tal? Me cuentas y... cuenta conmigo para lo que necesites!", "group_id": 2696, "id": 343592}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300051550.6106219, "message": "Proteja activamente a la mujer maltratada", "group_id": 2696, "id": 343673}, {"user_id": 13453, "stars": [], "topic_id": 12881, "date_created": 1300071732.873909, "message": "JuanDa, creo que deberias revisar este tema con @tifis y @pieranghela quienes coordinan el escuadron de #geekgirls podría ser una línea de trabajo en el marco de ese escuadrón. La información salva vidas, la información pertinente y oportuna tanto en prevención como en qué hacer en casos de empodera a las mujeres. Por favor cuadra con ellas.", "group_id": 2696, "id": 344717}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300124039.02865, "message": "muchas gracias @rosacris.  Ya les envié un tweet a ver como nos articulamos. Hoy estoy solicitando si alguien tiene el texto de la ley Ley 2257 de 2008: sobre la ELIMINACIÓN DE TODAS LAS FORMAS DE VIOLENCIA CONTRA LA MUJER.  Me la tengo que estudiar, porque voy a empezar a ver si sus mecanismos realmente son efectivos o no.", "group_id": 2696, "id": 349438}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300130676.246438, "message": "El texto de la ley contra el maltrato a la mujer provee mucha esperanza http://www.secretariasenado.gov.co/senado/basedoc/ley/2008/ley_1257_2008.html ahora pasaremos a la acción para probar si los mecanismos son realmente efectivos", "group_id": 2696, "id": 350040}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300131922.3968091, "message": "Estoy recolectando información que nos ayude a luchar contra este flagelo http://www.delicious.com/knowledgefactory/maltrato_a_la_mujer", "group_id": 2696, "id": 350253}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300284831.291101, "message": "Relatos de una tarde de acción intentando frenar (sin resultados) el flagelo del maltrato a la mujer: http://juandacorrea.tumblr.com/post/3898631063/relatos-de-una-tarde-de-accion-para-intentar-frenar-el", "group_id": 2696, "id": 366136}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300284884.1099451, "message": "La convocatoria sigue abierta: necesito fiscales, legisladores y periodistas para ver si podemos impulsar una aplicación efectiva de la Ley", "group_id": 2696, "id": 366144}, {"user_id": 16684, "stars": [], "topic_id": 12881, "date_created": 1300671419.1252601, "message": "Hola, envie estos docs a las geekgirls para lectura y creo que te pueden interesar:  \"Because I am a Girl\" http://bit.ly/gCr6Fz ; Bridging the Gender Divide: How Technology Can Advance Women Economically http://bit.ly/daASfB ; White paper: Why girls are still not attracted to ICT studies and careers http://bit.ly/hODdBK ; Innovation for Women's Empowerment and Gender Equality http://t.co/cFmFeHL", "group_id": 2696, "id": 394699}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1300803755.0406661, "message": "Les cuento que como producto de mi imposibilidad de realizar una denuncia efectiva la semana pasada, los reiterados maltratos contra mi mujer y contra mi han continuado.  Reflexiono con suma preocupación, si estas falencias del sistema encargado de proteger a las mujeres maltratadas y conminar a los maltratadores a que cesen sus prácticas, pueden realmente poner en grave peligro a muchas mujeres que tienen esta problemática.  Tenemos que actuar para lograr mecanismos más expeditos para proteger a nuestras mujeres; podemos con estas acciones estar salvando muchas vidas.  Mi llamado sigue en pie: NECESITO AYUDA!!", "group_id": 2696, "id": 407519}, {"user_id": 17223, "stars": [], "topic_id": 12881, "date_created": 1300831076.0310459, "message": "Juanda apenas estoy leyendo lo que escribes,  empecemos a mover a todos los que conozcamos y que te puedan ayudar..pero pues pregunto para orientarme mejor, se trata de violencia fisica o algo por el estilo?.. tenemos una fundación acá en sta marta que tiene algunos contactos y quizas podamos dar con alguno de ellos pero necesitaria claridad del asunto.. desde mi correo personal te respondí algo del mail de #geekgirls si gustas me puedes contactar por ahí.", "group_id": 2696, "id": 412239}, {"user_id": 15483, "stars": [], "topic_id": 12881, "date_created": 1301069315.5696239, "message": "Es brutal violencia verbal y psicológica, con conatos (en épocas recientes) de violencia física (en el pasado si sucedió).", "group_id": 2696, "id": 439691}, {"user_id": 24653, "stars": [], "topic_id": 12881, "date_created": 1301152632.9294729, "message": "Acabamos de leer juanda y en todo lo que necesites conta con nosotros, que podemos hacer para ayudar a la causa, Saludos!", "group_id": 2696, "id": 446275}]