[{"user_id": 12133, "stars": [], "topic_id": 39693, "date_created": 1308364575.190521, "message": "alguien sabe mas de este modelo ademas de lo que dice wikipedia ?¿", "group_id": 965, "id": 1424506}, {"user_id": 2946, "stars": [], "topic_id": 39693, "date_created": 1308585309.946805, "message": "Al parecer no. Pero puedes actualizar este topic con lo que vayas aprendiendo. O mejor aún, escribirlo en algún lado.", "group_id": 965, "id": 1439689}, {"user_id": 35000, "stars": [{"date_created": 1309017577.5836289, "user_id": 19921}], "topic_id": 39693, "date_created": 1308937683.789629, "message": "Es un modelo usado para la industria musical y del cine aunque creo que puede aplicar para cualquier tipo de arte que se comercialice. Basicamente consiste en vincular a los que hacen el contenido, bandas, grupos, artistas con su publico final y asi \"quitar\" a los intermediarios o bien en llegar mas rapido al mercado. Es muy comun en bandas independientes quienes regalan su musica por varios lados en internet y asi descubren mercados en otras latitudes y entonces ellos ya son pagados por presentaciones en vez de tocar puertas con grandes disqueras y pagar comisiones a ellos y blabla... Sin embargo tambien hay grandes disqueras que empiezan a apoyar este tipo de vinculacion ya que requiere muy poca inversion y asi se prueba la aceptacion de nuevos talentos en mercados globales", "group_id": 965, "id": 1478273}, {"user_id": 35000, "stars": [], "topic_id": 39693, "date_created": 1308937940.7117431, "message": "Rodrigo y Gabriela http://www.rodgab.com/ son un ejemplo de ello solo que ellos lo hicieron a la antigua usanza, ellos se fueron directo a dublin a tocar en bares y descubrieron que el mercado que no encontraban en Mexico lo abrieron en Europa pegando duricimo por alla. Cada vez son mas artistas de musica y cine que optan por herramientas digitales ya que son mucho mas baratas y asi ellos mismo evaluan a donde les conviene ir a hacer presentaciones segun sea la latitud que mas baja su musica gratis", "group_id": 965, "id": 1478306}, {"user_id": 26088, "stars": [], "topic_id": 39693, "date_created": 1308939201.9333291, "message": "Lastima que los que promueven el ACTA no conocen el modelo o se hacen que no lo conocen", "group_id": 965, "id": 1478484}, {"user_id": 35000, "stars": [], "topic_id": 39693, "date_created": 1308944121.9439249, "message": "como empresa no, ningua solo artistas o productores de contenido, solo Sony  music USA esta experimentando con ello", "group_id": 965, "id": 1479323}, {"user_id": 12133, "stars": [], "topic_id": 39693, "date_created": 1308944656.7022779, "message": "yo estoy empezando una tienda online de musica para bandas independientes(norecordlabel.net) y el direct-to-fan se apega a mucho a mi idea .. que opinas hacerca de aplicar el directo-to-fan a mexico @cjserrato ?¿", "group_id": 965, "id": 1479423}, {"user_id": 12133, "stars": [], "topic_id": 39693, "date_created": 1308944040.30427, "message": "sabes de alguna empresa en mexico q ya lo este ejecutando ? @cjserrato ?", "group_id": 965, "id": 1479312}, {"user_id": 35000, "stars": [], "topic_id": 39693, "date_created": 1308946688.1085479, "message": "uhmm si se aplica en mexico y funcion tambien bien en las tiendas de musica aunque creo que para competir con itunes store es complicado, ya que bandas independientes sube su musica sin broncas no necesitan disquera para subir su material y tiene exposicion a millones de usuarios., hay sitios somo http://soundcloud.com que se enfocan en la disponibilidad de la musica y hacerla un tanto social. creo que proyectos como este funcionarian mejor o servicios de tiendas de musica donde la musica no tuviera coste para el publico ni para la banda, el reto seria armar un modelo de negocios para ello, el simple podria ser publicidad aunque seria pensarle mas a detalle. Otro factor a considerar es el hecho que la mayoria de personas no escucha la musica en su computadora, asi que compra o baja canciones y de ahi las pasa a su ipod o reproductor, lo que hace itunes para bajar y comprar musica desde el dispositivo es super funcional e incremento el consumo en un 56%, creo que seria buena una tienda de musica gratuita para bandas y fans que permitiera bajar la musica desde el dipositivo movil", "group_id": 965, "id": 1479831}, {"user_id": 29866, "stars": [], "topic_id": 39693, "date_created": 1308949685.1801071, "message": "No se si es de lo que están hablando exactamente pero con la descripción que hace @cjserrato me parece el modelo que están usando http://www.nogeno.com/ y http://vibedeck.com/  si es así podría ser interesante, pero antes habría que analizar cual es el mercado en México de las personas que compran música por internet y cuales son los medios que usan, creo que habría que ver si existen números de iTunes en México, por otro lado, tomando en cuenta que la música es universal, no tendría porque estar dirigido solo al mercado mexicano, VibeDeck recibió hace poco 2 MDD en inversión, así que el \"modelo\" esta comprobado.", "group_id": 965, "id": 1480293}, {"user_id": 10406, "stars": [], "topic_id": 39693, "date_created": 1309017536.8144369, "message": "@zodman Había estado siguiendo tu propuesta desde el primer post acerca de ella y algunos días atrás la enlace con otra que vi por acá; pude platicar un poco con los creadores de la plataforma http://es.herzio.com/ que en España esta teniendo mucho éxito e inversión. La propuesta que ellos tienen se basa en el principio de que el modelo de negocio de la música independiente no tiene su fortaleza en la venta de música en si, sino en la experiencia creada alrededor de las bandas implicadas, desde los conciertos, playeras, cd's de colección etc. combinados con una capa social de interacción que les provee a los nuevos artistas la capacidad de interactuar de manera sencilla y rápida con su audiencia. Me gusto mucho el equipo que tienen pero el problema que deberías considerar es no solo el modelo de negocio (que esta mas que probado) sino la dificultad que representa las relaciones publicas en este sector (parte interna del modelo) y después la adquisición de los usuarios (parte externa del modelo).", "group_id": 965, "id": 1484568}, {"user_id": 36952, "stars": [], "topic_id": 39693, "date_created": 1309454672.031347, "message": "Creo que https://www.sellaband.com/ utiliza este mismo modelo. Es como kickstarter pero para musicos independientes. A mi esta pagina me encanta. Me he encontrado algunas joyitas musicales muy interesantes.", "group_id": 965, "id": 1529842}, {"user_id": 36952, "stars": [], "topic_id": 39693, "date_created": 1309454760.368216, "message": "googleando me encontre tambien este http://www.guguchu.com/", "group_id": 965, "id": 1529847}, {"user_id": 12133, "stars": [], "topic_id": 39693, "date_created": 1309975577.63587, "message": "topspinmedia.com  creo que usa el mismo modelo direct-to-fan pero ya se enfoca mas en manejar bandas que generar dinero para la banda.", "group_id": 965, "id": 1577845}, {"user_id": 29866, "stars": [], "topic_id": 39693, "date_created": 1310136832.6400371, "message": "De los 10 proyectos que eligió \"Wayra\" en Colombia, uno de ellos usa este modelo, de nombre  \"YIMUP\" http://wayra.org/proyectos-colombia", "group_id": 965, "id": 1593331}, {"user_id": 2946, "stars": [], "topic_id": 39693, "date_created": 1310195160.0278361, "message": "@josuegio que horrible nombre", "group_id": 965, "id": 1597933}, {"user_id": 29866, "stars": [], "topic_id": 39693, "date_created": 1310221782.078861, "message": "@soska estoy de acuerdo", "group_id": 965, "id": 1599000}]