[{"user_id": 1661, "stars": [{"date_created": 1297577386.7685051, "user_id": 3923}, {"date_created": 1297716312.5014229, "user_id": 1516}, {"date_created": 1299857006.671757, "user_id": 10087}], "topic_id": 3477, "date_created": 1297470584.2763231, "message": "Introitus: There is nothing in existence that isn't in imagination. There is nothing in imagination that isn't in existence. Middle part: Imagination is more than any realm of rationalization. The Digression: What is a formal rationalization? Of logic? Or by formal by we mean Aristotle's formal cause? Fin: There can be no formal rationalization of existence Aristotelian or otherwise because of the relationship between existence and imagination. Brought to you by the McDonald's of Information,  The Internet.", "group_id": 175, "id": 84728}, {"user_id": 3923, "stars": [], "topic_id": 3477, "date_created": 1297577583.00806, "message": "@barce i ll need a week to get it another to think of a reply and another to put it in words:)", "group_id": 175, "id": 88366}, {"user_id": 1523, "stars": [], "topic_id": 3477, "date_created": 1299853299.4257481, "message": "Where the one chooses to question (as one always should) the quality of all sources of information, nothing can be accepted as metaphysically true. The question is unsolvable.", "group_id": 175, "id": 322436}, {"user_id": 1523, "stars": [], "topic_id": 3477, "date_created": 1299853722.5044661, "message": "But since I can so safely assume that I am me, I can then infer the following priorities. 1. my relationship with myself. 2. my relationships with people who improve me. 3 my attitudes towards people who don't improve me.", "group_id": 175, "id": 322485}, {"user_id": 1523, "stars": [], "topic_id": 3477, "date_created": 1299853739.7322869, "message": "seems like a rational enough basis for a good quality life.", "group_id": 175, "id": 322488}, {"user_id": 1523, "stars": [], "topic_id": 3477, "date_created": 1299853420.981986, "message": "If we accept that our sense could fool us into believing we are in a dream world, then no evidence we can collect can possibly prove otherwise, since our only abilities to collect evidence depend on our senses. Such as the 'brain in the jar' or 'matrix' examples.", "group_id": 175, "id": 322447}, {"user_id": 1523, "stars": [], "topic_id": 3477, "date_created": 1299853559.87677, "message": "However, if the dreamworld is consistent enough for us to plan, act, react, and lead a meaningful experience of life, then it doesn't matter. The only thing I can safely assume is that 'I' exist. In what form is open for debate. I cannot be sure that anything around me is real.", "group_id": 175, "id": 322464}, {"user_id": 10087, "stars": [], "topic_id": 3477, "date_created": 1299856442.3687201, "message": "We just know there is something instead of nothing, because if ther was nothing, there wouldn't be this topic (or my experience of it) either. All our methods of gaining information operate in this world (whatever its nature, be it a computer simulation, imagination or whatever), so we can only gain knowledge of this world, and not of what the world is and 'why' it exists. If we could gain knowledge of a higher lever reality, for example the hypothetical world where this wolrd's simulation is being run, we would still have the exact same problem with the higher level reality. Therefore, asking why anything exists, is meaningless, since it would only lead to an endless sequence of why's.", "group_id": 175, "id": 322953}, {"user_id": 10087, "stars": [], "topic_id": 3477, "date_created": 1299861022.593833, "message": "Observing requires existence, but does existence require observing? I would say existence requires potential for observing, but then again it might be argued that potential for observing is always actualized, at least as indirect observing.", "group_id": 175, "id": 324020}]