[{"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305559208.862704, "message": "In the past I never have...always build everything from scratch. But I don't really see the need to build yet another database abstraction layer, template engine, etc. Sure I can pull code from other projects for those things, but that's basically the same as using a framework...", "group_id": 499, "id": 1071970}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305557647.5356729, "message": "Anybody use it? I just picked it up over the weekend. It seems pretty cool. Any thoughts? Any better frameworks for PHP?", "group_id": 499, "id": 1071719}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305558788.0060329, "message": "CI is good for blogs, CMS and things like that, but if your building a custom app i wouldn't use that framework, i don't ever use frameworks", "group_id": 499, "id": 1071899}, {"user_id": 8637, "stars": [], "topic_id": 35502, "date_created": 1305589049.446156, "message": "I've used it extensively in the past and found it to be enjoyable and pleasant experience", "group_id": 499, "id": 1076120}, {"user_id": 8637, "stars": [], "topic_id": 35502, "date_created": 1305589241.0176461, "message": "And you are right about reinventing the wheel too I think you can't possibly write a better framework/db abstraction than what's already out there. I've also seen plenty of sites that don't use frameworks and they are mostly disasters so be careful if you decide not to use one", "group_id": 499, "id": 1076139}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305590013.4127049, "message": "@benpjohnson Totally. The nice thing about CI is that you don't have to load all the libraries...You only load what you need. If you need a Database, load the the library, if you don't, then don't. Pretty cool if you ask me.", "group_id": 499, "id": 1076241}, {"user_id": 528, "stars": [], "topic_id": 35502, "date_created": 1305617642.662708, "message": "love CI, make sure you're using reactor https://bitbucket.org/ellislab/codeigniter-reactor", "group_id": 499, "id": 1079900}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305648583.7268009, "message": "Whats the difference between codeigniter-reactor and codeigniter?", "group_id": 499, "id": 1084569}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305649001.3877511, "message": "@CrowderSoup I've been developing with CI for a while, and its a lie that CI its just for blogs or CMS, I just developed complex ERP & CRM web apps, with financial analytics, accounting budgets, real time reporting, e-commerce and more. I recommend you to try it, and make your own opinion, mine is CI rocks!", "group_id": 499, "id": 1084622}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305648684.5783801, "message": "@antihistaminico I'd like to know the same thing...  @liveink ?", "group_id": 499, "id": 1084579}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305649289.894753, "message": "@antihistaminico From what I've seen of it so far I'm loving it!", "group_id": 499, "id": 1084665}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305650616.7884331, "message": "@antihistaminico bs I never seen a huge complex site say they use CI so it is just for CMS and Blogs", "group_id": 499, "id": 1084907}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305653313.6434629, "message": "@italiano40 CI its a framework, and you have the prerogative to choose kind of projects you use it. I write based on my expertise, then I can say (and repeat) that  its a lie that CI its just for blogs or CMS.", "group_id": 499, "id": 1085293}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305653618.6276779, "message": "@antihistaminico it is a framework for blogs and CMS show me a site that uses it and is something cool, like digg or google or yahoo, there is no site like that that uses all it is good for is blogs and CMS", "group_id": 499, "id": 1085348}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305654932.9515231, "message": "http://www.myclientbase.com/ http://www.mediaroost.com/ http://www.wittygraphy.com/ http://www.escrowizard.com/ http://bestpartyever.com/ ", "group_id": 499, "id": 1085595}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305655711.4356229, "message": "@antihistaminico nice! What do you have to say now  @italiano40 ? Just because you THINK something doesn't make it true.", "group_id": 499, "id": 1085747}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305656975.051506, "message": "I have a friend who participated in the development of a pretty cool application. Its a CRM with call center manager. It handles all calls, incoming and outgoing through a Asterisk PBX (like a managed phone switch), and it provides to managers real-time reports, sales forecasts, KPIs, and so on...\nAnd... guess what? It was developed using CodeIgniter n__n", "group_id": 499, "id": 1086108}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305662220.202486, "message": "@CrowderSoup  @antihistaminico what i have to say is first off at the base of all those sites is CMS type of structure, i meant a BIG company, like facebook, google, or twitter start using it for something outside of a blog or CMS which most those sites/software was, i think you guys need to look up the definition of CMS which content management system those were all content management system, i am sorry but CI will never be used in a high scaled web site, it isn't that strong and not that usable maybe it can safe space that is about it, but if it works for you guys then good but just know huge web sites will never use it, also this site http://bestpartyever.com/ says it was built with wordpress?? double check your facts nice try", "group_id": 499, "id": 1087391}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305663722.5164399, "message": "@italiano40 Ok, first of all...next time I plan on building the next facebook I'll consider using something else. Second: CI CAN be used outside of a CMS / Blog type solution. How about the example @antihistaminico gave? A CRM with a call center manager is certainly NOT a CMS. But with your loose definition of a CMS we could even classify Facebook as a CMS...it's managing content isn't it!?! (No, I don't think facebook is a CMS).", "group_id": 499, "id": 1087694}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305665308.2991509, "message": "@CrowderSoup so you said it isn't just use as a CMS framework and now your saying it is a CMS type of framework, ok i am not going to debate this anymore, but you just proved my point it is for blogs and CMS and if you think about it Facebook is kinda a CMS it holds alot of post and stuff so yea plus there blogs are written in php, so i think we are done here", "group_id": 499, "id": 1088101}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305667324.0390711, "message": "@italiano40 I believe you've just proved how completely clueless you are. To quote from my post: \"No, I don't think facebook is a CMS\". I was stating that with your loose definition of what a CMS is I can classify any type of application as such. Try not to open your mouth unless you know what you're talking about next time", "group_id": 499, "id": 1088399}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305669481.3956089, "message": "@CrowderSoup LOL you think i am clueless because I just pointed out your flawed explanation where you disprove yourself and prove me to be correct. Also I have used CI and the MVC pattern of it can only be use for CMS/blogs that is why i am right the framework is written in that way, maybe you need to check your fact. Plus we are chatting not talking my mouth is closed LMAO", "group_id": 499, "id": 1088796}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305673214.6391139, "message": "@italiano40 Dumbass, that is all.", "group_id": 499, "id": 1089675}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305685859.786864, "message": "@CrowderSoup classy LOL don't worry i bet people who read this know who is right and who can't debate LMAO", "group_id": 499, "id": 1091829}, {"user_id": 15486, "stars": [], "topic_id": 35502, "date_created": 1305705354.9869881, "message": "CI it's a framework that can be used for anything. It has a very small footprint, and it's faster than most available PHP frameworks. Saying it can only be used for a CMS/blog is just silly. You can pretty much build any app with any framework. @italiano40 I would really like to hear why you think CI is only for small sites and blogs. Regarding your statement about facebook like apps, I think PHP in general is not a good solution, but It could be done with CI, as with any other PHP framework.", "group_id": 499, "id": 1094437}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305727636.52332, "message": "@italiano40 haha, because you're the only one so far who thinks CI is only for building blogs/CMS.", "group_id": 499, "id": 1097384}, {"user_id": 19708, "stars": [], "topic_id": 35502, "date_created": 1305731674.51, "message": "I'm working on an api using codeigniter. JSON XML etc...", "group_id": 499, "id": 1098701}, {"user_id": 28882, "stars": [], "topic_id": 35502, "date_created": 1305733937.4960871, "message": "Perhaps he confused with codeigniter and wordpress xD", "group_id": 499, "id": 1099385}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305732210.040904, "message": "@jpwdesigns really? That's pretty cool.", "group_id": 499, "id": 1098902}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305735075.995116, "message": "Haha, that very well could be...But even wordpress can do a social network, message boards, etc. with the right plugins. But the point is this: CodeIgniter is awesome :)", "group_id": 499, "id": 1099701}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305743648.758229, "message": "@jpwdesigns I think @antihistaminico meant that @italiano40 is confused about CI VS WordPress.", "group_id": 499, "id": 1101130}, {"user_id": 19708, "stars": [], "topic_id": 35502, "date_created": 1305743120.930263, "message": "@CrowderSoup @antihistaminico yes really! No not confused with wordpress. API for other web sites to interact with data from our website.", "group_id": 499, "id": 1101046}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305744225.3753331, "message": "now you all talk about how you using it for different projects, show me something that is not a blog or CMS, CI was meant to build blog/CMS  @CrowderSoup and i can tell the different between wordpress, but you are so dumb because you need other people to point things out and you flawed your explaination before so i think you should be quiet and read on CI, i have read CI i have try it, i hate it, there is nothing there that could be use to build php sites that wouldn't be a blog or CMS", "group_id": 499, "id": 1101260}, {"user_id": 19708, "stars": [], "topic_id": 35502, "date_created": 1305745766.5450599, "message": "@CrowderSoup well that would make more sense. ;)", "group_id": 499, "id": 1101760}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305747577.7746291, "message": "this is the CodeIgniter topic, didn't see the part where you had to love it LOL and second you guys can't even prove what it can be used and how it can be used for other than blogs/cms", "group_id": 499, "id": 1102285}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305745650.5716081, "message": "@italiano40 If you hate CI then please no longer take part in this discussion. We all love it and are / have used it in our projects. Just because you can't see the value in it doesn't mean it isn't there.", "group_id": 499, "id": 1101719}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305746240.265008, "message": "@jpwdesigns For reals :)", "group_id": 499, "id": 1101892}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305753394.9155719, "message": "@italiano40 http://codeigniter.com/wiki/Applications_Using_Code_Igniter/ Sure there are a lot of blog / cms type applications there. But there is also a financial management application, a link directory, a knowledge base, a booking application, and Invoice manager. And that's just the ones that have the source code available. There are lots of others that are closed source.", "group_id": 499, "id": 1103362}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305759006.6759601, "message": "@CrowderSoup are you seriously right now, like i didn't even know about that part of the site, and yet you are dumb to show most of the projects are CMS or based on CMS WOW your dumb please don't write any websites you would be that dumb person to no to use a salted MD5 hash LOL", "group_id": 499, "id": 1104162}, {"user_id": 20889, "stars": [], "topic_id": 35502, "date_created": 1305786706.6136191, "message": "@jpwdesigns Do you simulate a REST API or you only use GET & POST? I love CodeIgniter but for an API, I'd prefer to use Sinatra or Rails.", "group_id": 499, "id": 1108901}, {"user_id": 19708, "stars": [], "topic_id": 35502, "date_created": 1305871998.443326, "message": "@OyoKooN i'm using this http://net.tutsplus.com/tutorials/php/working-with-restful-services-in-codeigniter-2/ For my application I don't need Put / Delete but could if need be", "group_id": 499, "id": 1121267}, {"user_id": 20889, "stars": [], "topic_id": 35502, "date_created": 1305879771.7590261, "message": "@jpwdesigns Ah nice! Thank you for the info =)", "group_id": 499, "id": 1122615}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1305896628.46298, "message": "@jpwdesigns Very cool! So much you can do with CI :)", "group_id": 499, "id": 1125220}, {"user_id": 25286, "stars": [], "topic_id": 35502, "date_created": 1305907281.322408, "message": "@italiano40 Don't be stupid, dude. Of course google, yahoo and the big fishes would'nt even use PHP, even facebook doesn't use PHP anymore since they turned into C++ (read about HipHop for PHP). A framework is a \"toolkit\" to turn the coder life simple. That's it. But it has its limitations and isn't suitable for everything you do. Even Rails, Django and all frameworks has its limitations. So please, don't be stuck in your thoughts about frameworks. And BTW, I'd appreciate if you show me some of your big works with pure PHP code that you're talking about.", "group_id": 499, "id": 1127259}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305912305.651576, "message": "@kriansa I am not stupid, if i was stupid i be taking your side. Actually depending on some of the things google does use a version of php (google search it and read about it) and facebook, writtes pure PHP then HipHop turns it into a php, C++ hybird so may you need to read about hiphop or use it like i do LOL and rails and django can be used to make so many things CI is a toolkit for cms/blogs maybe you all need to get your facts striaght and for showing you my big works, cant show them since i would lose my job and my funding for college so yea", "group_id": 499, "id": 1128045}, {"user_id": 25286, "stars": [], "topic_id": 35502, "date_created": 1305996850.9201961, "message": "@italiano40 PHP C++ hybrid code? Stupid and dumbass. Plz read http://en.wikipedia.org/wiki/HipHop_for_PHP. And where did you find that google uses php? Save your dumb words for yourself. CI, Kohana, CakePHP, Rails and Django are both WEB FRAMEWORKS, asshole. They both are suposed to do the same thing: help the user to build whatever they want faster(and secure) than building from scratch. Your atrophied brain does not let you think?\n---\nI'm so sorry to change the subject of the thread. CI is a great framework, I still use it in my projects. Its documentation is the best I ever found. Framework is a personal thing. You use what you like. I'm using Kohana and FuelPHP too, both awesome, but i don't think you can just say one is better than other.", "group_id": 499, "id": 1135050}, {"user_id": 4149, "stars": [], "topic_id": 35502, "date_created": 1305997043.9826331, "message": "@kriansa and i quote from that \"HipHop programmatically transforms PHP source code into highly optimized C++ and then uses g++ to compile it to machine code.\" Yes it is a hybird and for the name calling clearly your the dumbass, and i never said it wasn't a web framework i just said it is geared for blogs and CMS maybe you need to read more, or get back in the kitchen like you should be :P", "group_id": 499, "id": 1135071}, {"user_id": 20889, "stars": [], "topic_id": 35502, "date_created": 1306024817.98947, "message": "@kriansa I agree for the documentation which is sipmly awesome.", "group_id": 499, "id": 1139023}, {"user_id": 25286, "stars": [], "topic_id": 35502, "date_created": 1306078096.8611929, "message": "@italiano40 ok, go on.\n@OyoKooN also, you can check Sparks, a package manager for CI, with lots of useful plugins. > http://getsparks.org/", "group_id": 499, "id": 1142420}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1306079567.684258, "message": "So what exactly is CodeIgniter Reactor? How is it different from the CI base?", "group_id": 499, "id": 1142502}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1306085575.18045, "message": "Gotcha, can I use Sparks with the CI base? if not, where do I get CI Reactor?", "group_id": 499, "id": 1142926}, {"user_id": 20889, "stars": [], "topic_id": 35502, "date_created": 1306084814.601687, "message": "@CrowderSoup CI Base is developped by the core team working at EllisLab while CI Reactor is developped by community members chosen by EllisLab.", "group_id": 499, "id": 1142876}, {"user_id": 20889, "stars": [], "topic_id": 35502, "date_created": 1306089879.547797, "message": "@CrowderSoup If I'm right, you can't download the CI Reactor because it is merged with CI Base for the new releases. I'm not sure.", "group_id": 499, "id": 1143256}, {"user_id": 22060, "stars": [], "topic_id": 35502, "date_created": 1306095308.7517071, "message": "You can get reactor from github fork I think.", "group_id": 499, "id": 1143793}, {"user_id": 15486, "stars": [], "topic_id": 35502, "date_created": 1306135734.7785029, "message": "You can get CI reactor here: http://codeigniter.com/downloads/ or the tip here: https://bitbucket.org/ellislab/codeigniter-reactor", "group_id": 499, "id": 1149702}, {"user_id": 3444, "stars": [], "topic_id": 35502, "date_created": 1306156353.270088, "message": "@strija Thanks for the linkage, according to the page on codeigniter.com CI Reactor is the default download, so that's what I got :) It just doesn't call itself CI Reactor.", "group_id": 499, "id": 1152046}]