[{"user_id": 11626, "stars": [], "topic_id": 6643, "date_created": 1297901477.8689439, "message": "Two hearings tomorrow—one in court and one in Congress—will highlight the brewing debate over whether Congress should expand federal surveillance laws to force Internet communications service providers like Facebook, Google and Skype to build technical backdoors into their systems to enable government wiretapping.\r\n\r\n• First, at 10:00 AM EST on Capitol Hill, the House Judiciary Committee will hold a hearing entitled ”Going Dark: Lawful Electronic Surveillance in the Face of New Technologies”, where law enforcement representatives are expected to make their case for expanded Internet wiretapping capabilities.\r\n\r\n• Then, at 1:30 PST in San Francisco, EFF Staff Attorney Jennifer Lynch will argue in federal court for an end to the government’s stalling on the release of documents about the government's Internet surveillance plan that EFF is seeking under the Freedom of Information Act.\r\n\r\nWe filed that FOIA lawsuit last fall, shortly after the New York Times first revealed the FBI’s push to convince Congress to expand “CALEA”—the Communications Assistance for Law Enforcement Act of 1994—to require online communications service providers to redesign their systems to accommodate the government’s interception of internet communications. As we’ve said before, EFF thinks that any expansion of CALEA would be the very definition of a bad idea, an “anti-privacy, anti-security, anti-innovation solution in search of a problem.”\r\n\r\nThe exact contours of the forthcoming proposal are unclear—the White House, the Justice Department and various agencies are apparently still internally haggling over what the Administration’s position is. However, the FBI’s wish list as reported in the New York Times is dangerously expansive:\r\n\r\n    Essentially, officials want Congress to require all services that enable communications — including encrypted e-mail transmitters like BlackBerry, social networking Web sites like Facebook and software that allows direct “peer to peer” messaging like Skype — to be technically capable of complying if served with a wiretap order. The mandate would include being able to intercept and unscramble encrypted messages.\r\n\r\nHopefully, the FBI’s top lawyer Valerie Caproni—the primary source for the Times’ reporting—will give more specifics about the forthcoming proposal in tomorrow morning’s Congressional hearing, as she is one of two law enforcement representatives there to plead the government’s case. Thankfully, the third witness will be renowned security and surveillance expert Dr. Susan Landau, who will be sounding alarms about the security risks posed by building wiretap-ability into our communications services.\r\n\r\nIronically, the very same morning that the Justice Department will testify to Congress on the issue of Internet wiretapping, it will also argue in court that the issue is not of such public concern as to warrant expedited release of CALEA-related documents in response to EFF’s FOIA lawsuit. The government says it won’t be able to release the documents that EFF is entitled to until August of 2012, by which time the debate over CALEA may have already ended; we will be asking the court to order the documents released within ten days, so that Congress and the public are fully informed on this critical and time-sensitive issue.\r\n\r\nAs tomorrow’s two hearings makes clear, the fight over the future of wiretapping on the Internet is just beginning. So stay tuned to the Deeplinks Blog to hear about the results of both hearings, as we continue to try to get to the bottom of the FBI’s plan to turn our Internet into their surveillance network.\r\n\r\nhttps://www.eff.org/deeplinks/2011/02/congress-and-court-long-simmering-debate-over", "group_id": 3920, "id": 126984}]