[{"user_id": 19720, "stars": [], "topic_id": 39558, "date_created": 1308241247.283983, "message": "Hola, soy Ruy Cervantes. Estoy haciendo una etnografía de la industria de internet en México, y como está cambiando de ser una industria de servicios a crear productos globales. Estoy haciendo mi doctorado en la Universidad de California, Irvine, en el departamento de informática.", "group_id": 10646, "id": 1411619}, {"user_id": 36344, "stars": [], "topic_id": 39558, "date_created": 1308242410.022438, "message": "Hola, soy Toño, estoy estudiando en la UOC el máster en Sociedad de la información y el conocimiento, ya estoy con el trabajo de tesis, es un ejercicio de etnografía sobre producciones audiovisuales en youtube y las nuevas formas de producción y consumo de productos culturales... espero terminar en octubre. Trabajo en el Sistema de Universidad Virtual de la UdG en el Instituto de Investigación.  Saludos!", "group_id": 10646, "id": 1411751}, {"user_id": 19729, "stars": [], "topic_id": 39558, "date_created": 1308242229.849592, "message": "Yo soy Lizette Campechano, estoy estudiando la maestría en la U de G en el DECS. Mi tesis es sobre grupos de milenarismo maya (del 2012, a favor y en contra) y cómo se utiliza internet para hacer circular lo referente a la profecía. Aunque también me interesaría abordar lo referente al consumo de ese tipo de contenido.... en eso ando afinando...", "group_id": 10646, "id": 1411717}, {"user_id": 29903, "stars": [], "topic_id": 39558, "date_created": 1308243199.170469, "message": "Hola, yo soy Rocío, soy internacionalista del Colmex por estudios, pero antropóloga por vocación y en algún punto adquirí un inexplicable gusto por la cultura árabe. MI tésis es sobre el impacto de las redes sociales en los levantamientos de Tahrir (Cairo). Además, llevo poco más de un año trabajando en un startup que intenta resolver el problema de seguridad en México llamado N-talk. ¡Un gusto conocerlos a todos!, suena a que nos vamos a divertir discutiendo :)", "group_id": 10646, "id": 1411820}, {"user_id": 36346, "stars": [], "topic_id": 39558, "date_created": 1308250257.407717, "message": "Soy Francisco Javier Cortazar Rodríguez. Investigador de la Universidad de Guadalajara.Trabajo sobre los usos sociales de las TIC; Consumos culturales; Imaginarios, rumores y leyendas urbanas por Internet; y Socio-antropología del cuerpo.", "group_id": 10646, "id": 1412687}, {"user_id": 36347, "stars": [], "topic_id": 39558, "date_created": 1308369136.004724, "message": "Soy Nora López Mascorro, estudiante de la maestría en Comunicación de la Universidad de Guadalajara. Mi proyecto de tesis es investigar las participaciones de los lectores en los espacios que los diarios les proporcionan (tanto en linea como en impreso) para conocer las implicaciones de estas contribuciones en la participación ciudadana y los espacios públicos mediáticos. Saludos y un gusto", "group_id": 10646, "id": 1424836}, {"user_id": 36334, "stars": [], "topic_id": 39558, "date_created": 1308404757.8998549, "message": "Saludos a todos. Soy Alma Leticia Flores Ávila, soy profesora en la Universidad de Guadalajara. A mi me interesa comprender el papel de las TIC en la comunicación entre los migrantes que viven Estados Unidos y sus familiares en México. Particularmente aquellos que utilizan Skype. Las TIC están contribuyendo en el manejo de la nostalgia, sobre todo en quienes no pueden movilizarse entre ambos países. Es un tema nuevo para mi, y me encantaría que hubiera un espacio para la discusión de estos asuntos.", "group_id": 10646, "id": 1426629}, {"user_id": 36485, "stars": [], "topic_id": 39558, "date_created": 1308439458.063668, "message": "Hola mi nombre es Julia Pérez Naranjo estudiante de la Maestría en Comunicación de la Uiversidad de Guadalajara y mi tema de tesis es sobre la apropiación de la red social Facebook en jóvenes de Guadalajara, un gusto y saludos a todos!", "group_id": 10646, "id": 1428965}, {"user_id": 36363, "stars": [], "topic_id": 39558, "date_created": 1308505972.2277131, "message": "¡Hola! me llamo Ricardo Acosta Torres soy filósofo de profesión e ingresaré a la maestría de Relaciones Económicas Internacionales y Cooperación con un proyecto de tesis sobre la relación de las redes sociales y la educación desde el marco de las relaciones económicas internacionales. Saludos a todos.", "group_id": 10646, "id": 1432580}, {"user_id": 36563, "stars": [], "topic_id": 39558, "date_created": 1308588717.3559761, "message": "Hola soy César Torres, estoy por presentar mi examen de grado en el doctorado en C.S del CUCSH-UDG, mi tesis va sobre el impacto político de las redes sociales en Internet. Actualmente trabajo como como profesor de tiempo completo en la UPN 141. Saludos...", "group_id": 10646, "id": 1440211}, {"user_id": 36608, "stars": [], "topic_id": 39558, "date_created": 1308638657.3964691, "message": "Qué tal, me llamo Víctor, soy maestro en Comunicación por la UDG. Mi tesis fue sobre relaciones sociales, generación de sentido y construcción de la presencia de jóvenes en Facebook. Un placer entrarle a las pláticas que se armen aquí!! saludos!", "group_id": 10646, "id": 1446227}, {"user_id": 36790, "stars": [], "topic_id": 39558, "date_created": 1308849635.6110179, "message": "Hola, soy Alejandra Rocha, soy profesora e investigadora de la Universidad de Colima. Mi línea de investigación es Nuevas Tecnologías de la Comunicación, pero desde hace muchos años el interés está centrado en la comunicación, a través de Internet entre los que emigran y los que se quedan", "group_id": 10646, "id": 1468243}, {"user_id": 37213, "stars": [], "topic_id": 39558, "date_created": 1309362785.7897611, "message": "Hola, me llamo María de Lourdes trabajo mi tesis doctoral, sobre la relación que existe entre el sentimiento nostálgico de los migrantes y los patrones migratorios; gran parte de la investigación se ha centrado en el uso de las TIC por parte de los migrantes y en el análisis de los mensajes que se generan en los libros de visitas online. Saludos!", "group_id": 10646, "id": 1517910}, {"user_id": 37237, "stars": [], "topic_id": 39558, "date_created": 1309372146.668509, "message": "Hola, me llamo María de Lourdes trabajo mi tesis doctoral, sobre la relación que existe entre el sentimiento nostálgico de los migrantes y los patrones migratorios; gran parte de la investigación se ha centrado en el uso de las TIC por parte de los migrantes y en el análisis de los mensajes que se generan en los libros de visitas online. Saludos!\n", "group_id": 10646, "id": 1519721}]