[{"user_id": 11626, "stars": [], "topic_id": 7609, "date_created": 1298192330.1355131, "message": "http://fortunebrainstormtech.files.wordpress.com/2011/02/hybrid_aircraft.jpg?w=340&h=255\r\n\r\nGeneral Motors pulled the plug on its first electric car, but supplier AeroVironment used some of that experience to build a very different kind of vehicle for the U.S. military.\r\n\r\nAeroVironment, a firm based in Monrovia, Calif., whose products include gear for electric, hydrogen, and hybrid cars, is applying its environmentally friendly research to a technology that at first blush might make some tree huggers tremble: a military drone that could be used to assist in battle.\r\n\r\nIn January one of the company's pilotless aircraft, powered by a hydrogen hybrid engine that can keep it aloft for up to a week, took off from Edwards Air Force Base in California for its second test flight. (The drone, dubbed the Global Observer, isn't particularly fearsome: It is meant for surveillance and communications.) AeroVironment hopes the U.S. will like the equipment enough to deploy it and order more.\r\n\r\nMuch of AeroVironment's eclectic portfolio traces its lineage to 30-year-old experiments by the company's founder, the late Paul MacReady. MacReady's Gossamer Condor was the first human-powered aircraft to achieve sustained flight. (It hangs in the Smithsonian National Air and Space Museum.) He went on to develop a solar-powered version of the Condor, which led to a number of so-called clean-tech projects, including the design for the prototype of General Motors' (GM) now defunct electric car, the EV1.\r\n\r\nSome of the learning from the EV1 has found its way into the Global Observer. The drone's power plant works like a mash-up of the EV1, a Chrysler Hemi, and a Honda Clarity fuel cell: an internal-combustion engine that runs on hydrogen, producing electricity that turns the plane's four propellers.\r\n\r\nAeroVironment faces stiff competition as it tries to woo the military. The U.S. already uses Northrop Grumman's (NOC) Global Hawk and General Atomics' Predator for some surveillance missions. Boeing (BA) is also testing a hydrogen-powered drone.\r\n\r\nAeroVironment says its big advantage is flight endurance: Not only is the hydrogen engine an environmentalist's dream, but it also enables the Global Observer to outlast other drones. Hydrogen has a high rate of energy density -- it doesn't consume as much volume as, say, jet fuel. As a result the drone weighs less, enabling it to stay in the air for a week.\r\n\r\nAeroVironment's system is designed so that two planes work in tandem, providing continuous observation over a 270,000-square-mile circular area. After a Global Observer has been in the air for a week or so, a second would take off to relieve the first, allowing its partner to return to base for refueling and maintenance. And, of course, it's a pilotless plane -- a most remarkable product for a company whose first aircraft was powered by the pilot.\r\n\r\nhttp://tech.fortune.cnn.com/2011/02/17/from-electric-cars-to-military-ops", "group_id": 3920, "id": 152516}]