[{"user_id": 17417, "stars": [], "topic_id": 13842, "date_created": 1300479086.5314569, "message": "Would it even be possible to create an objective frame of reference from which to consider the rights of humanity.", "group_id": 175, "id": 384986}, {"user_id": 17417, "stars": [], "topic_id": 13842, "date_created": 1300479020.318856, "message": "Is it possible, or could it be possible, for every human being to have their rights clearly articulated by one document.  Is it possible that everyone country would agree on the same set of principles? Could that document then be used to spread basic human rights to countries where they may not exist?  I guess what I'm asking is, if we can agree that a human being is necessarily an empathic creature with some fundamental knowledge of right and wrong, why then is there no global mission to promote some basic rights for all of humanity?  Why aren't countries policing each other regarding the way their citizens are being treated.", "group_id": 175, "id": 384977}, {"user_id": 544, "stars": [], "topic_id": 13842, "date_created": 1300491102.358228, "message": "Uh, yea, it’s called the Universal Declaration of Human Rights, was done in 1948, and serves these exact purposes already: http://www.un.org/en/documents/udhr/index.shtml", "group_id": 175, "id": 385943}, {"user_id": 2937, "stars": [], "topic_id": 13842, "date_created": 1300581855.919724, "message": "But it's still interesting to talk about whether it's based on an objective frame of reference and to what extent we can justify telling a society whose culture clashes with the Declaration that they're wrong and we're right.", "group_id": 175, "id": 390022}, {"user_id": 17417, "stars": [], "topic_id": 13842, "date_created": 1300821826.1837029, "message": "I guess the number of non-member states is fairly minimal.", "group_id": 175, "id": 410819}, {"user_id": 17417, "stars": [], "topic_id": 13842, "date_created": 1300821721.0008631, "message": "@jackowayed I think this was the part I was driving at.  Is it possible to write a document that everyone agrees on, not just those countries involved in the UN.", "group_id": 175, "id": 410805}, {"user_id": 10087, "stars": [], "topic_id": 13842, "date_created": 1300826566.8680739, "message": "The thing is, not everyone even seems to agree that every human has any value as anything else than a tool. A lot of those people have a lot of power too...", "group_id": 175, "id": 411544}, {"user_id": 545, "stars": [], "topic_id": 13842, "date_created": 1301894758.2322259, "message": "@Tarandon I think that pretty much everyone would agree with the Universal Declaration of Human Rights. It's a pretty good objective frame of reference. I'd be curious to see if people thought there were things missing from it.", "group_id": 175, "id": 520759}]