[{"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302022114.2994511, "message": "This is a general question, but it pertains in my case to having a Psych OS. It's very easy to have concrete items when a goal is \"obtaining\" -- get the girl, kill the dragon, etc. But, there are times when a character doesn't know their goal per se. \n\nYou want to be happy in your job -- but you don't know how, or you would just do it, or change jobs. So, how does one go about having a character pursue a goal they haven't defined yet?", "group_id": 2515, "id": 543281}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302024497.8749781, "message": "When you're thinking about the Story Goal in the OS, it's important not to focus all your attention on the one central character (especially when you've got the OS in Psych or Mind).", "group_id": 2515, "id": 543634}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302022197.990907, "message": "Presumably, as the story goes on, they learn what they want. Or they learn what they don't want. So it gets easier to have them go for the goal towards the end. (Does Harry running for Sally count as a guy who only figures it out right before the end of the movie?)\n\nAnyway, my question is really about Act One goings-on.", "group_id": 2515, "id": 543295}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302024339.448595, "message": "Is one of the characters the community-at-large?  Is there a goal defined there?", "group_id": 2515, "id": 543595}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302024267.5174279, "message": "Sometimes the Protagonist-and-or-Main Character doesn't always know what the goal is.  Try thinking about the entire cast of characters -- in particular, who is your Antagonist?  What is that person's goal?", "group_id": 2515, "id": 543575}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302042860.7987771, "message": "Thanks, Sandy. I think going about this via thinking about the protagonist is the right way to go. There isn't a clearly defined, archetypal antagonist, but looking at who is doing the avoiding is probably going to help a lot.\n\nThe goal everyone has in mind is \"being happier\" (to put it generally), and it's easy to see that everyone needs that. I just don't want to be quite that vague, and it's weird to think that someone is involved in the \"avoidance\" of being happier. Although... if someone's goal is to have you work so hard as to not be happy... hmmm... maybe you've made me hit on something....", "group_id": 2515, "id": 549163}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302052610.4051399, "message": "To this end, was Wei-Tung the MC and the \"Avoid\" character in The Wedding Banquet?", "group_id": 2515, "id": 552049}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1302067950.380749, "message": "Sandys responses here need to be rebroadcasted. Great stuff!", "group_id": 2515, "id": 555097}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302071072.833216, "message": "The OS concern is \"Being\".", "group_id": 2515, "id": 555364}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302071239.847331, "message": "@MikeDerk So, \"Playing a Role\" or \"Adopting a Lifestyle\" ... or one of the other synonyms for \"Being\"...  Do any of those ring true?", "group_id": 2515, "id": 555389}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302071271.0486341, "message": "@jimhull Aww, thanks Jim!", "group_id": 2515, "id": 555391}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302071130.9253011, "message": "This has its own issues, which I will freely admit are personal and show my naivety: I like goals being concrete. And Being seems fake, meaning, I don't like being fake with people myself, so why would I want my characters to be fake?", "group_id": 2515, "id": 555374}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302070956.038461, "message": "<<The goal everyone has in mind is \"being happier\" (to put it generally), and it's easy to see that everyone needs that. I just don't want to be quite that vague>>  To respond to that, I'm curious if you've tried to apply an OS Concern term to that goal -- Being, Becoming, Conceptualizing or Conceiving? (Or maybe it's one of the \"Mind\" concerns -- Subconscious, etc.) That might help you define your Story Goal in more concrete terms.", "group_id": 2515, "id": 555348}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302071074.0681551, "message": "@MikeDerk << To this end, was Wei-Tung the MC and the \"Avoid\" character in The Wedding Banquet?>>\nGosh...it wasn't that long ago, but I don't remember it that well... Which one was Wei-Tung?", "group_id": 2515, "id": 555365}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302072594.6535959, "message": "Weird, I was on line, but your posts didn't show up. Oh well. \n\nMaybe \"adopting a lifestyle\" will work. (I know they're just synonyms.) But, clearly I need to get my head into this a bit more. \n\n\"Wei-Tung\" was the Main Character... the Asian son who got married.", "group_id": 2515, "id": 555557}, {"user_id": 10814, "stars": [], "topic_id": 17420, "date_created": 1302108837.3555429, "message": "Being (Playing a Role) speaks to the temporary condition one is in, as opposed to the more transformative \"Becoming\" (Changing One's Nature).  So, being happy is most likely a \"Being\" Concern, while being content would more likely be a \"Becoming\" concern.", "group_id": 2515, "id": 561449}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302125996.9393959, "message": "Yes, so it feels odd having a goal be \"getting into a temporary condition\"... \n\nAlthough, I guess the end of GATTACA has him getting away with pretending to be a genetically-designed person, even though he can't actually become one...", "group_id": 2515, "id": 565610}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302126120.6757929, "message": "Here is something that could work: \"Finding out that what you thought was a permanent condition is only temporary.\" ?? Or would that be \"Becoming\" in the negative?", "group_id": 2515, "id": 565627}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302127631.8507011, "message": "Also, having read up on Tootsie's goal of Being: The common goal of the objective characters is for Michael to be himself.... How is this not \"Becoming\"?\n\nIs it because he's finally rejecting the appellations of \"great waiter\" or \"great actor\", which are temporary?", "group_id": 2515, "id": 565820}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1302152448.9683659, "message": "I don't know if this is going to help you or not, but some recent big movies had Being Objective Story Concerns: Black Swan -- for Nina to assume the role of the Black Swan, to embody that sensuality, and The King's Speech - for the Duke to be, to play-act the role of the leader his subjects need him to be. In both examples they're not fully transforming, not completely losing some part of themselves, or at the least, thats not essential to the story's meaning. For them to \"be\" though is. The Incredibles is another great example - the Goal for the Supers to be all they can be. They're not changing who they are, they're just prevented from being, from living up to their potential.  I don't know, hope that helps somehow.", "group_id": 2515, "id": 571624}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302152647.05774, "message": "I'm finding that I think better through analogy, so yes, that helps.", "group_id": 2515, "id": 571654}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302152735.4364181, "message": "I re-conceived the story today, changing \"Progress\" to \"The Future\" and I'm nervous that I'm doing that simply because I am better at thinking in those terms. Not because it's actually a better way to capture the story I'm trying to tell.", "group_id": 2515, "id": 571664}, {"user_id": 7669, "stars": [{"date_created": 1305585586.3763549, "user_id": 7645}], "topic_id": 17420, "date_created": 1302155254.2190571, "message": "On some of the above points, one thing I want to mention is that if your Concern is Being, you could have a BENCHMARK of Becoming, which means both can play out very strongly in the story (the Concern is more \"static\" in nature and the Benchmark is more \"dynamic\", meaning it can get more and more prominent as the story approaches the end).", "group_id": 2515, "id": 572168}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1302240253.7073641, "message": "Sandy and his Benchmarks....!", "group_id": 2515, "id": 586879}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1302242467.733463, "message": "The thing that is so frustrating is that Dram is so all-encompassing that we all latch onto things that grok with us. When we try to share or encourage other people to use our tools,... basically, I'm like \"what's a benchmark?\"", "group_id": 2515, "id": 587168}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1302269169.054847, "message": "Re my comment, a lot of tines in the DUG meeting, we will be struggling between picking two Concerns and Sandy will usually add what he said above about Benchmarks. That's when I usually have a revelation, \"Ahhh, yes\" as if I've never heard of the concept before.", "group_id": 2515, "id": 589599}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1302269236.2158661, "message": "Gets me every time.", "group_id": 2515, "id": 589616}, {"user_id": 7669, "stars": [], "topic_id": 17420, "date_created": 1302332541.056179, "message": "Actually, maybe that's just a splinter in your Benchmark...", "group_id": 2515, "id": 600463}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1303675376.8498039, "message": "I have been thinking a lot about goals myself recently, particularly an OS goal. I feel I fell into the trap of thinking too broadly with goals. For example, the 'being happier' or 'being more content' type goals both me a lot. I mean this could apply to almost every situation / story. I also wonder if not being able to think of a good goal mean the story idea is not strong enough??", "group_id": 2515, "id": 796484}, {"user_id": 7645, "stars": [], "topic_id": 17420, "date_created": 1303683532.3502669, "message": "Perhaps, but some stories emphasize some aspects of structure over others. The goal could be broad. I think the bigger problem is making sure it's tied into resolving an actual problem at hand.", "group_id": 2515, "id": 797205}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1303690291.247402, "message": "I think the thing that was irking me was this: the grandfather is satisfied (at the end of the Wedding Banquet) because he was getting a grandchild. Passing on the family name was mentioned one time previously, from which we know that HE would be satisfied with that. However, nobody is aiming for this goal. It comes to pass, but it was nobody's objective. \n\nHow does one hit a goal nobody is aiming for?", "group_id": 2515, "id": 797544}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306358752.0741179, "message": "@SandyStone Now I have another movie to add to this. I really feel like the Story Goal of Groundhog Day (Get to Feb 3) is not pursued. Phil has *no idea* how to make it happen, and he doesn't do anything even approaching trying to find out. Yet, in the podcast, you state that as the Story Goal. (And, as much as that seems like Obtaining, the Goal is one of Learning.)\n\nI get that Learning unlocks the timeloop... but does Phil even know that's the right way to go? Or does he just luck out? (Luck out is a bit harsh. I know he's doing everything he can to make his time fulfilling.)", "group_id": 2515, "id": 1184487}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306360170.1529911, "message": "Interesting also that the Dramatica OS Goal for this storyform is 'Gathering Information / Learning'. That to me suggests more about becoming a better person, or working out how to operate in the environment. Or perhaps it could also be seen as something related to the 'wanting to be wanted'. That seems more connected with Learning.", "group_id": 2515, "id": 1184596}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306359590.5091641, "message": "Not got to that bit yet, but that also confuses me. Only Phil / reporter knows about repeating day. So as an OS Goal I'm not sure. But I've noticed a couple of stories where the OS Goal seems to be the protagonists goal, rather than everyone's goal.", "group_id": 2515, "id": 1184564}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306360017.9121721, "message": "The OS goal is (at least) the protagonist's goal. \"Everyone\" doesn't have a goal; they have concerns.\n\nSandy states that this is the goal pretty near the front.", "group_id": 2515, "id": 1184583}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306362675.6246641, "message": "The harder I grasp, the more slips through my fingers.", "group_id": 2515, "id": 1184951}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306362713.2138419, "message": "I think with Groundhog, there is a difficult connection between the OS goal and actually what brings the story to an end.\n\nIf ending the day is the Goal, well 3/4 of the way through the film is stops trying to end the day. He starts trying to live it successfully, we see no attempt to end it. If anything, he doesn't want it to end until he saves the old man. \n\nIf the Goal is learning how to get on with his environment, then he achieves that before the days stops repeating.\n\nThe story ends because he lived the day to the best of his ability, but he wasn't trying to do that until about 3/4 of the way through.", "group_id": 2515, "id": 1184965}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306363273.421335, "message": "Although his pursuit of Rita, Rita being his 'saviour' is more MC or MC/IC than OS.", "group_id": 2515, "id": 1185059}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306363425.800307, "message": "So can the OS Goal be one that the protagonist is unaware of, even if they are actually working towards it (in a roundabout way)?", "group_id": 2515, "id": 1185082}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306363054.6415341, "message": "I think this may have something to do with an objective (author) view vs. protagonist view.\n\nThe author knows what must be done before the day will end; Phil doesn't. He exercises every single option he can, and one day (like magic) it ends. \n\nYet, it were really *random* then that would have been sooooo unsatisfying. He somehow steers himself in the right direction, a direction we like, and everyone in the town likes.\n\nI can only point to Rita as the guiding force here. His pursuit of her (as fake as it starts) wears off on him, influences him, and then viòla, saves him.\n\nSo... it's not magic. It's Rita. \n\nHave I just convinced myself that the goal -- while unknown to Phil -- is not vague? \n\nMaybe.", "group_id": 2515, "id": 1185037}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306363369.4743781, "message": "When obnoxious reporter has, as you say, tried out every option, he eventually decides the best route is the good one. He learns that himself I would say. The OS characters are affected greatly by his new approach to them.", "group_id": 2515, "id": 1185075}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306363388.565599, "message": "But none of that answers the Goal question.", "group_id": 2515, "id": 1185080}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306363641.8940279, "message": "Ooops.", "group_id": 2515, "id": 1185115}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306363505.31302, "message": "That's the question I opened the thread with.", "group_id": 2515, "id": 1185098}, {"user_id": 7669, "stars": [{"date_created": 1306427006.4077761, "user_id": 7645}], "topic_id": 17420, "date_created": 1306395019.174607, "message": "It's true, sometimes the Protagonist is not aware at first of what mission he is on, but certainly by the time he's deep into the second act he has a pretty good idea.  In the case of Groundhog Day, the Story Goal is set by the \"invisible hand of fate\", and it's only until Phil's living out the day for the second time that he finds himself engaged in \"Learning\" in spite of himself.  He's trying to figure out what will stop this loop -- this doesn't work so try this -- can't kill myself so maybe I'll try being happy...  Are all the other characters involved in activities of Learning?  I think you'll find they are -- everyone is either learning something or teaching something, or being \"learned about\" (even inadvertently) -- consider Phil's conversation about the girl he slept with.  Anyway, he does finally \"learn\" what he needs to, and that is how to make Rita genuinely fall in love with him.  And yes, that definitely crosses over into the Subjective Story and the MC and IC throughlines, so many of the plot points are multi-appreciational.  Anyway, hopefully the podcast has some further illuminating discussion about this, if you have time to listen...", "group_id": 2515, "id": 1189571}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306407366.498004, "message": "So, if I understand correctly, we are sort of back to the Audience vs Author thing. The writer new the OS Goal, he set up the characters to (unwittingly) work towards the OS goal, even though they weren't aware of it themselves? Phil becomes more aware, but in fact all the other OS characters are not even aware of the repeating day, and therefore not even aware there is a Goal at all.\n\nBut the writer knew it, and I guess from Dramatica's point of view that's what matters, Am I making sense?", "group_id": 2515, "id": 1190920}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306422554.0473559, "message": "The interesting thing here is how the goal is achieved before the day ends. Reporter and Phil are at ease / living life to the full. The day ending is almost a sub-plot to confirm this to the audience.", "group_id": 2515, "id": 1192902}, {"user_id": 10814, "stars": [], "topic_id": 17420, "date_created": 1306422119.192611, "message": "I think that is the point.  The goal isn't trying to achieve something, but to learn how to live the best you can each and every day.  When the reporter does that, as does Phil, the time loop disappears as mysteriously as it came.", "group_id": 2515, "id": 1192781}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306424958.684273, "message": "Although, it is the last thing he says, right? \"Right now, I'm happy.\"", "group_id": 2515, "id": 1193283}, {"user_id": 30951, "stars": [], "topic_id": 17420, "date_created": 1306429689.855737, "message": "Yes, but we knew that already. We knew because we saw him as MC, we also new in the OS because he clearly looked content with what he was doing.", "group_id": 2515, "id": 1194101}, {"user_id": 7664, "stars": [], "topic_id": 17420, "date_created": 1306439877.0452621, "message": "I'm pretty content with my life, but there are few times that I'm through-and-through happy, holding a beautiful woman in my arms.", "group_id": 2515, "id": 1195444}]