[{"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1304980150.7509191, "message": "I'm doing something unusual and stressful -- I'm re-storyforming my story between drafts.", "group_id": 2515, "id": 979282}, {"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1304980382.657047, "message": "The way that I have approached this is that I plugged in the things I know are not changing -- including the Plot Progression. \n\nThis leaves me with 16 storyforms to play with, but they are all over the place. For instance, I can still choose any Concern for the OS Throughline. When I go through and knock out a few that really don't seem right, I'm left with 5 possible storyforms.\n\nNow, when I plug in a possible answer (sometimes in the Story Engine, sometimes in the Query System) to see how that affects other choices, I immediately go to 1 storyform. The problem is that when I want to go back a step, I end up with 16 storyforms again. Sometimes 8. But never the 5 I want.\n\nIs there any way to lock in those 5 as a default? Particularly in the Query System.", "group_id": 2515, "id": 979393}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1304999085.8241391, "message": "You should lock in the storyform choices you are sure about (in the Story Engine or Query System), and THEN go into Plot Progression and see what choices you have.", "group_id": 2515, "id": 983730}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1304998958.5598929, "message": "You wouldn't be able to lock in those 5 until you undo your Plot Progression selections.", "group_id": 2515, "id": 983680}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1304999019.7528701, "message": "When you pick Signposts directly, you do get some weird and interesting results ... sometimes, not always.  There are some very complex algorithms at play there.", "group_id": 2515, "id": 983705}, {"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1305005310.7842231, "message": "I did pick the storyform choices I was sure about. I'm also on the third draft of my script, so I'm fairly confident about the plot progression. I pick two, and the rest are filled in automatically.\n\nBut, okay, say I don't go into the plot progression, and I winnow down to five storyform possibilities... how do I lock those in?\n\nLet's make this even simpler. If I go into the query system and pick The Past, The Present and The Future for potential OS concerns, I don't think there's even a way to lock that in.", "group_id": 2515, "id": 985231}, {"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1305006647.43946, "message": "You know how when you get down to the details, it says, \"Any of 4 choices\"? Generally, in that case, you have nailed down the upper levels.\n\nBut, I was experimenting with reversing the Concern and the Benchmark to see how that would play out -- this left me with an MC Concern of Future or Past. When I chose to look at how selecting \"Uncontrolled\" as an MC Problem to see which Symptom/Response pair would be forced [it also forces a concern of Past], I found that I couldn't \"undo\" -- I had to go and manually reselect The Future as a potential Concern.", "group_id": 2515, "id": 985489}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1305006023.1883481, "message": "The only real \"lock\" is those check boxes in the Story Engine, which you use when you want to use the Clear button.", "group_id": 2515, "id": 985377}, {"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1305006446.510735, "message": "I think you're misunderstanding something.\n\nI like all my choices -- nothing is incompatible. It's just that I want to be able to experiment with the last five storyforms without having to recreate them (from 16) every time I choose to look at one more specifically.", "group_id": 2515, "id": 985462}, {"user_id": 7664, "stars": [], "topic_id": 34449, "date_created": 1305006766.5030899, "message": "Anyway, if the only way to lock things in is using the checkboxes, then my question is answered. What I want to do cannot be done.", "group_id": 2515, "id": 985506}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1305006898.5818181, "message": "Yeah, other than saving different versions of your storyform file, I don't know a shortcut around that process.", "group_id": 2515, "id": 985526}, {"user_id": 7669, "stars": [], "topic_id": 34449, "date_created": 1305006299.1657331, "message": "Apparently your Plot Progression choice are simply incompatible with your other storyforming choices, so you may need to rethink something somewhere.  Often when my Signpost order comes out differently than what I expect or desire, I either: a) ignore it; or b) rethink my definitions of the Signposts (maybe \"Obtaining\" means something different as an OS Signpost 2 than it does as an OS Concern); occasionally I'll consider c) restructuring my plot sequence, but I'm usually happier with changing my definitions.", "group_id": 2515, "id": 985422}, {"user_id": 30951, "stars": [], "topic_id": 34449, "date_created": 1305010138.1769791, "message": "I think this probably comes down to how I imagine the main part of Dramatica works. I assume the calculations that determine what choices are available are not linear, therefore only a limited number (those in the story engine) are able to be locked. \n\nI tried the same thing myself a while back, and ended up doing as Sandy suggested - saving versions.", "group_id": 2515, "id": 986006}]