[{"user_id": 11626, "stars": [], "topic_id": 42399, "date_created": 1311215466.7810781, "message": "Multiple Nuclear Whistleblowers Claim TVA Nuke Plant Officials Harassed And Threatened Them\r\nThe Intel Hub\r\nJuly 20, 2011\r\n\r\nIn part two of a CBS special investigation, multiple whistleblowers came forward with reports and documentation that TVA management has routinely threatened whistleblowers who threatened to expose vulnerabilities and problems at nuclear power plants owned by TVA.\r\n\r\n    CBS\r\n\r\n    Linda Nadeau worked for more than 20 years as a security guard for the Tennessee Valley Authority, the government-owned electricity corporation, patrolling the most secure areas of its nuclear power plants, including Watts Bar.\r\n\r\n    “I want people to know how we were treated,” she told Keteyian. “I’m not the only one. There was other people.”\r\n\r\n    ******\r\n\r\n    A crying Janice Overall told CBS News her husband, Curtis, “paid the ultimate price.”\r\n\r\n    In the comfort of Harris’s kitchen, Overall spoke of Curtis, an award-winning employee who helped run Watts Bar’s unique ice containment system, designed to prevent a nuclear meltdown.\r\n\r\n    But in 1995, after Overall discovered what he believed were problems with the system on the eve of Watts Bar’s long-delayed startup, he got harassed with threatening notes, and even a fake bomb discovered in the back of his pickup. Battling a bad heart and deep depression, Overall died in 2007 at the age of 56, without any proof of who had harassed him.\r\n\r\nTo some this comes as no surprise considering the power of the nuclear industry and the amount of money they stand to lose if problems are exposed.\r\n\r\nAs we reported yesterday, Ann Harris, a Watts Bar nuclear power plant whistleblower who has won 6 lawsuits against the plant, claims that the books are being cooked at Watts Bar and that it is only a matter of time before a Fukushima type disaster happens in America.\r\n\r\nHarris also claims that she was threatened and that her car was even ran off the road in a possible attempted murder.\r\n\r\n    “They ran me off the road, they wired my car for fireboming, they dropped the universal joint off my car”\r\n\r\nThis report only strengthens her claims as well as the extensive amount of documentation that has been put forward in regards to corruption within the nuclear power industry as well as the NRC itself.\r\n\r\nhttp://theintelhub.com/2011/07/20/multiple-nuclear-whistleblowers-claim-tva-nuke-plant-officials-harassed-and-threatened-them", "group_id": 3920, "id": 1686724}]