[{"user_id": 4917, "stars": [{"date_created": 1297589288.343015, "user_id": 7742}], "topic_id": 4700, "date_created": 1297584100.4402561, "message": "As we've all seen in Egypt and now in Algeria, evil governments tend to shut off the internet, effectively blocking Facebook Groups and Twitter to prevent mass communication.\n\nIn Egypt people created SMS chains to create mass communcation networks. I'm asking you this: How would you design an app for a smartphone (Android, iPhone whatever), which would make use of any connection it finds (Bluetooth, Wireless, Cellphone signal) to create an ad hoc mass communication network?", "group_id": 95, "id": 88832}, {"user_id": 4689, "stars": [], "topic_id": 4700, "date_created": 1297584597.8117099, "message": "There are bunch of great comments on this blog post http://www.brepettis.com/blog/2011/1/28/apps-for-the-appocolypse.html", "group_id": 95, "id": 88860}, {"user_id": 4689, "stars": [{"date_created": 1297585175.515626, "user_id": 1}, {"date_created": 1297782753.262748, "user_id": 10694}], "topic_id": 4700, "date_created": 1297585064.9882729, "message": "I can see an android app that would allow each node/phone to carry a message until it reaches its destination.  Work just like the internet does with packets. Start with small messages SMS sized, and allow the ability to carry larger \"messages\" in exchange for some cred/woffie. Ad-hoc sneaker net.\n\nThe system would work in areas that have no infrastructure or the people are to poor to pay for cell service.", "group_id": 95, "id": 88879}, {"user_id": 1, "stars": [], "topic_id": 4700, "date_created": 1297585195.321655, "message": "@ChristianBurns That would be cool--a mesh network of phones, in essence?", "group_id": 95, "id": 88891}, {"user_id": 7998, "stars": [], "topic_id": 4700, "date_created": 1297593711.5849969, "message": "There's a fair amount of talk about mesh or distributed networking being the future, where wireless devices would act as nodes of the network, serving as both receivers and access points. This would probably be the ideal mass communication network, as at least in theory, there would be no overbearing authority.", "group_id": 95, "id": 89711}, {"user_id": 7985, "stars": [], "topic_id": 4700, "date_created": 1297611477.2200699, "message": "just transmitting raw text is fraught with difficulty. So, some people are using expressions to encode data. So, that 2 or more equations can be used to get the original result, leading to redundancy.", "group_id": 95, "id": 91463}, {"user_id": 7985, "stars": [], "topic_id": 4700, "date_created": 1297611378.8592751, "message": "The problem really is with packet loss and bandwidth. If you send too many copies of the same packet then you have the problem of choking up the network. If you send too little then the accuracy goes down. So, the answer really isn't in just forwarding, but finding ways how to forward it", "group_id": 95, "id": 91462}, {"user_id": 7985, "stars": [], "topic_id": 4700, "date_created": 1297611481.1995821, "message": "check this out; http://www.scientificamerican.com/article.cfm?id=the-rise-of-instant-wireless-networks", "group_id": 95, "id": 91464}, {"user_id": 8013, "stars": [], "topic_id": 4700, "date_created": 1297631357.116379, "message": "I think a better approach would be to design DIY aerostats that can broadcast wifi or some other wireless network easily. Instructions to make them should be very easy to follow and they should be cheap, sub $100.", "group_id": 95, "id": 93690}, {"user_id": 2934, "stars": [], "topic_id": 4700, "date_created": 1297715962.195601, "message": "Guess you could try something like gossip protocol with TTL messages,,", "group_id": 95, "id": 104551}, {"user_id": 2934, "stars": [], "topic_id": 4700, "date_created": 1297716321.7716601, "message": "And when someone re-sends (retweet) a particular message, lifetime of the message extends, thus more people can see the message. (if your goal is to broadcast important message to masses without centralized server/control)", "group_id": 95, "id": 104675}, {"user_id": 10585, "stars": [], "topic_id": 4700, "date_created": 1297723184.740669, "message": "but how do you sync nodes :?", "group_id": 95, "id": 106931}, {"user_id": 10585, "stars": [], "topic_id": 4700, "date_created": 1297723151.6066439, "message": "hmm, something equal could be apply to files", "group_id": 95, "id": 106919}, {"user_id": 11530, "stars": [], "topic_id": 4700, "date_created": 1297787567.7552791, "message": "First start with a mass transportation media (eg. automobiles, radios, RF, WFI). A protocol that holds and transmits to other devices. Leap-frogging from car down a highway until it reaches a WFI / internet.", "group_id": 95, "id": 112601}]