[{"user_id": 2109, "stars": [], "topic_id": 37931, "date_created": 1307074041.0442071, "message": "Steve's recent Security Now segment on creating a brute force resistant password is brilliant. Here's an idea I thought about on a methodology to create passwords based on it. Think of a word, let's say Leo's bad password \"Monkey\", add a 2 digit number like 46. So Monkey46 would sort of be the memorable hint. Then the actual password would be something like $$$$Monkey))))))46 - 4 Symbols padded in front, 6 Symbols padded behind. Then add the 46 for another hundred billion years of a unbrute forceable password. The only downside is forgetting the symbols you used for the padding. So, 1.28 hundred billion trillion centuries until the password is cracked. http://www.grc.com/haystack.htm", "group_id": 5074, "id": 1274330}, {"user_id": 19071, "stars": [], "topic_id": 37931, "date_created": 1307093802.8930709, "message": "It's a terrific technique for memorable, secure passwords!", "group_id": 5074, "id": 1276071}, {"user_id": 15929, "stars": [], "topic_id": 37931, "date_created": 1307094648.175153, "message": "I haven't listen to the show yet, but wouldn't this make it harder to type in? thus easier for someone to just look over your shoulder and steal it that way…", "group_id": 5074, "id": 1276105}, {"user_id": 18478, "stars": [], "topic_id": 37931, "date_created": 1307101791.8283429, "message": "I love this technique and have changed all my passwords", "group_id": 5074, "id": 1276505}, {"user_id": 2109, "stars": [], "topic_id": 37931, "date_created": 1307115065.234906, "message": "@unwrangle if someone is looking over your shoulder I don't think it matters what password you use or technique. If they can see you type in \"password\" as your password they're going to see it no matter. Discretion in entering your password would go without saying.", "group_id": 5074, "id": 1278306}, {"user_id": 15929, "stars": [], "topic_id": 37931, "date_created": 1307117152.9159241, "message": "@spaceguy1 if it's complex enough and yet  still easy to type, it'll be too fast for prying eyes to catch up. I guessed i'll just need to keep using the complex password on top of the pad. just wished my bank updates their system and allows more than 8 characters for password :S", "group_id": 5074, "id": 1278524}, {"user_id": 27581, "stars": [], "topic_id": 37931, "date_created": 1307151765.732053, "message": "What's wrong with 1Password?", "group_id": 5074, "id": 1283842}, {"user_id": 17371, "stars": [], "topic_id": 37931, "date_created": 1307155914.3269219, "message": "Well not only is $$$$Monkey))))))46 easier to type than !@@#$%^&*()_-0987654wetywefikethlm,erjhijJNEFPLWERITHLBk][][ (password for my luggage), $$$$Monkey))))))46 is much more un-crackable.  Agreed, though in this case, no matter how simple OR difficult the password, OTS usually trumps all password creation efforts (and remember, OTS isn't just eyes, it can be cameras, etc.)", "group_id": 5074, "id": 1284233}, {"user_id": 17371, "stars": [], "topic_id": 37931, "date_created": 1307156575.7721851, "message": "Remember the old Netware days when you could even use Function Keys, extended ASCII (Clt/Alt combos), the Carriage Return (ENTER KEY) as  'characters' in a password string?  There was a 3 or 4 simul-key combination used to  \"STOP NOW\"  to end recording the string. Very effective, until you forgot that you used the RETURN key when you made the password! Fun times.", "group_id": 5074, "id": 1284283}, {"user_id": 17371, "stars": [], "topic_id": 37931, "date_created": 1307156207.179352, "message": "@unwrangle WOW! A bank that gives you 8 characters, that's a lot for a bank!  Our bank STILL uses our Soc number for verification with online banking, how frickin assinine.  And t8 characters, too, but ONLY numbers and letters, NO special characters! Huh!? Really!?Yes, banks and all must stop un-defaulting password apps (most of the PW packafges I have seen are out-of-the box set up for high entropy/complexity).  Drives me nuts. Just as bad are the morons that un-default normal email strings, such as DIS-allowing the use of the '+' sign - are they kidding? Another bad practice, afaiac.", "group_id": 5074, "id": 1284262}, {"user_id": 17371, "stars": [], "topic_id": 37931, "date_created": 1307156319.2443991, "message": "@kittyque1 Clever girl, but better than \"1Password?\" would be \"1    Passw0rD      /    ?\" Yes, spaces are special, too!", "group_id": 5074, "id": 1284270}, {"user_id": 17371, "stars": [], "topic_id": 37931, "date_created": 1307156406.7302301, "message": "Dangit, I had put way more spaces in that password, and the Convore ATE THEM!  Not good for discussing topics such as these!", "group_id": 5074, "id": 1284275}, {"user_id": 15929, "stars": [{"date_created": 1309505048.0718751, "user_id": 29698}], "topic_id": 37931, "date_created": 1307157206.3036201, "message": "1. we don't have SSN in Australia. I guessed the banks here are pretty decent then? for business account I got the RSA dongle thingy. not a fan but  it's locked down.\n2. 1Password is another service like LastPass and @kittyque1 you'll still need the master password no?\n3. it's HTML that ate all the white spaces :)", "group_id": 5074, "id": 1284319}]