[{"user_id": 7645, "stars": [], "topic_id": 45318, "date_created": 1316026775.4735701, "message": "You could do it - you would just need to have some sort of development in the OS, right? Sharks, ship wreckage, storms, ocean currents -- assuming the OS is in Situation. I always thought it had the potential for a cool story, but have unfortunately heard otherwise about this take on it.", "group_id": 2515, "id": 2127654}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316026505.1098399, "message": "For those of you who don't know, Open Water is a movie about two people who are left behind in the ocean after a SCUBA trip to some reefs. Nobody notices, and they are left essentially until they die.\n\nI found the movie very dull, I think because there was no way for the people in the predicament to do anything about it. There was nothing they could even attempt. The only thing they could do was hold on, and wait for someone to notice that they were missing.", "group_id": 2515, "id": 2127599}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316026574.0674059, "message": "So, the question is, is there any way to make a movie like this into GAS? What would the OS have to be like? Would it have to be dominated by an SS?\n\nI'm not concerned about sticking anywhere near the original movie. This is just a theoretical thing...", "group_id": 2515, "id": 2127618}, {"user_id": 7645, "stars": [], "topic_id": 45318, "date_created": 1316027351.2879469, "message": "It would be cool - in your hypothetical story, -- if there were only a certain amount of rations (Optionlock) or whatever, and the IC -- in Psychology -- manipulates the MC into coming up with the idea to sacrifice himself to save the other. Change/Failure/Good -- the MC sinks to the bottom of the ocean content with his noble sacrifice, while the IC happily accepts the hand of the Coast Guard rescuer", "group_id": 2515, "id": 2127721}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316027212.5293989, "message": "I think that is probably right, actually.", "group_id": 2515, "id": 2127701}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316026955.409796, "message": "There is literally no story in the movie. But, there is development, sort of. Sharks appear at one point... at another point, the two drift apart from each other. \n\nI'm curious if the thing holding it up though is the lack of any sort of goal. Although, maybe it's because we know nobody is looking for them... it makes the goal pointless. They don't even play it like, \"Someone is about to notice that they are missing!\"", "group_id": 2515, "id": 2127673}, {"user_id": 7645, "stars": [], "topic_id": 45318, "date_created": 1316027058.2331331, "message": "Weird - I would assume it's Present with Work and Attempt working as they stay afloat, move with the currents, etc. and Attract and Repel having to do with various sea life, planes flying overhead, and so on", "group_id": 2515, "id": 2127686}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316027728.948066, "message": "See, that would be cool.\n\nAlthough, I never bought the ending of Ten Little Indians were the last survivor kills himself on the island. Self-sacrifice is tough. (It used to be a part of \"Cargo\" btw.)", "group_id": 2515, "id": 2127771}, {"user_id": 36437, "stars": [], "topic_id": 45318, "date_created": 1316030335.4901609, "message": "If I watch this film I'm never going to dive again. But now I want to, just so I know what you're talking about...", "group_id": 2515, "id": 2128175}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316032767.5905011, "message": "Buried doesn't have legs, so whatever if you didn't finish it. And Brooke, don't watch the movie. It's bad.", "group_id": 2515, "id": 2128451}, {"user_id": 33839, "stars": [], "topic_id": 45318, "date_created": 1316032487.3478119, "message": "I tuned out of Buried somewhere in the middle, but you might find that to have more elements as Ryan Reynolds character has a cell phone which leads to all these interactions in an attempt to find out where he is/help him.  Like I said, I haven't seen the whole thing so I don't know how it plays out, but certainly it takes the single character/single setting and pushes it for all its worth (I would think).", "group_id": 2515, "id": 2128420}, {"user_id": 7645, "stars": [], "topic_id": 45318, "date_created": 1316032652.368794, "message": "Read the script for Buried - its short, and for a reason - no IC/no SS (which could have been easily done with someone on the phone). Another cool idea that needed a complete story.", "group_id": 2515, "id": 2128440}, {"user_id": 33839, "stars": [], "topic_id": 45318, "date_created": 1316037006.3249559, "message": "Good to hear I wasn't missing much.  I tend to feel guilty starting a movie and not finishing it.  It's been a long time since I've seen Hitch's Lifeboat, maybe I'll revisit that one to see if there's a storyform there.", "group_id": 2515, "id": 2128973}, {"user_id": 36437, "stars": [], "topic_id": 45318, "date_created": 1316040286.6690121, "message": "Thanks for saving me a couple hours.", "group_id": 2515, "id": 2129290}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316128195.400986, "message": "@JBarker No, don't. I was watching that yesterday, which is what made me think of Opne Water. No storyform.", "group_id": 2515, "id": 2137275}, {"user_id": 33839, "stars": [], "topic_id": 45318, "date_created": 1316132954.9217391, "message": "@MikeDerk too late!  Watched it last night, but agree.  Slight bits and pieces.  By the way, the convore app on iPhone is lightning quick!", "group_id": 2515, "id": 2138300}, {"user_id": 33839, "stars": [], "topic_id": 45318, "date_created": 1316141969.1799569, "message": "I've noticed falling in love during the 30's and 40's was the equivalent of breathing today.", "group_id": 2515, "id": 2139593}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316141541.3121619, "message": "\"Lifeboat\" has many elements of bad story telling that I can't stand. People falling in love for no reason. Tragic moments that carry little weight. boo.", "group_id": 2515, "id": 2139571}, {"user_id": 7664, "stars": [], "topic_id": 45318, "date_created": 1316193353.044678, "message": "That explains the divorce rate.", "group_id": 2515, "id": 2143879}]