[{"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302014225.6364739, "message": "sorry for the beginning of my topic. I meant \"I created this topic...\"", "group_id": 175, "id": 541550}, {"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302014086.3423071, "message": "I creat this topic to discuss the use of analysis for doing philosophy. It seems there lies some doubts to be answered regarding that kind of method. It is supposed that, to analyze a concept or proposition, the philosophers don't need to look for empirical data, which means the justification she has for the philosophical analysis is apriori. Why it is supposed to be so? Probably because the proposition expressing the analysis relation (in which the \"iff\" operator is crucial) just require semantic understanding of the relata (analysans and analysandum). But, if that is the case, how can analysis be informative?", "group_id": 175, "id": 541518}, {"user_id": 10087, "stars": [], "topic_id": 17388, "date_created": 1302015595.1411259, "message": "Even in physics, we have to rely on things working out as they did in some other conditions, we never have any meaningful direct empirical knowledge of anything. I think it's kinda the same thing to test some idea in one's head, on paper or in a computer simulation", "group_id": 175, "id": 541804}, {"user_id": 10087, "stars": [], "topic_id": 17388, "date_created": 1302015254.514868, "message": "can't we also think of analysis as an empirical method?", "group_id": 175, "id": 541775}, {"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302015717.61657, "message": "right, but physics use inductive method. when you conceive a thought experiment to test if it is a counter-example to a certain analysis, that does not mean that this analysis is a result from inductive reasoning.", "group_id": 175, "id": 541821}, {"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302015582.7809639, "message": "how's that?", "group_id": 175, "id": 541800}, {"user_id": 1661, "stars": [], "topic_id": 17388, "date_created": 1302166985.980098, "message": "Let's back up kids. Is it fair to ask what is analysis? Doesn't analysis or empiricism have their own metaphysical assumptions?", "group_id": 175, "id": 573799}, {"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302198934.1159379, "message": "Yes, I think it is fair. We could answer the question \"what is analysis?\" with: a relation R is a relation of analysis between two concepts, [P] and [Q&R] such that: (i) [P] and [Q&R] are necessarily coextensive; (ii) it is possible to know apriori that (i); (iii) [P] and [Q&R] are synonyms, and (iv) [Q&R] informs how [P] is conceptually constituted", "group_id": 175, "id": 578083}, {"user_id": 26842, "stars": [], "topic_id": 17388, "date_created": 1302272182.8555551, "message": "I think the problem with analysis is the following: to give an analysis for a concept, the philosopher must already know the truth conditions and the meaning of the concept to be analyzed, but without knowing the analysis of a concept, I can't know its meaning.", "group_id": 175, "id": 590355}]