[{"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304104444.0964041, "message": "I wanted to see if anyone was interested in helping to set up a  vegetable garden on the rooftop. I've taken care of most of the plants, but we still need to build wind barriers and an automatic watering system.", "group_id": 868, "id": 861552}, {"user_id": 15469, "stars": [], "topic_id": 22065, "date_created": 1304104890.2660141, "message": "I am absolutely interested.  I just inherited a roof deck of my own and am actively setting it up now, including a solar powered drip system.  I haven't been to the new digs yet -- is there water pressure on the roof?  If so, things will be much easier.  If not, we'll have to use a cistern.", "group_id": 868, "id": 861674}, {"user_id": 15469, "stars": [], "topic_id": 22065, "date_created": 1304105047.670512, "message": "I've also got a green thumb.  I'm open to any/all veggies, and I will have extra seedlings from my own deck.  I've already got two Sweet 100 cherry tomato babies that need a home, and will have surplus beefsteak tomatoes, Golden Honey cantalopes, and lemon cucumber sprouts shortly.  I started them two days ago.  I've also got two varieties of beans I haven't started yet, and corn.", "group_id": 868, "id": 861724}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304109929.6577029, "message": "whafa, unfortunately there's no water source on the roof, so we'll have to lug water up there. I've already started building a setup using self-watering containers hacked from Home Depot buckets, that are fed from a large water source- elevated 5 gallon water cooler bottles. The water feeding is controlled by float valves.", "group_id": 868, "id": 863487}, {"user_id": 30460, "stars": [], "topic_id": 22065, "date_created": 1304108268.632282, "message": "Here is a moisture sensor that might be hackable.  http://store.thesimplegarden.com/  (WaterStick)", "group_id": 868, "id": 862812}, {"user_id": 30460, "stars": [], "topic_id": 22065, "date_created": 1304108328.9470539, "message": "And I'm sure you may have seen this, but the project may give ideas for sensors, and provide some code.  http://www.sparkfun.com/products/10334", "group_id": 868, "id": 862836}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304110472.683944, "message": "Oh, I also started a chipin if anyone wants to donate a couple bucks. Especially since this is a \"communal\" garden and the fruits and vegetables are to be shared with everyone in the group. http://alphaonerooftopgarden.chipin.com/alphaone-rooftop-vegetable-garden", "group_id": 868, "id": 863677}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304110000.7655649, "message": "whafa, right now there's about a dozen plants- tomatoes, figs, raspberries, and blueberries. I'm always open to expanding, provided that people are willing to donate time and money.", "group_id": 868, "id": 863517}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304110088.2702601, "message": "Ari, looks very cool. I think psytek was working on a moisture sensor from another project- it'd be cool to hook up a thermometer and arduino and have it tweet conditions each day. Once the basic garden is set up, we can start adding the bells and whistles", "group_id": 868, "id": 863526}, {"user_id": 4330, "stars": [], "topic_id": 22065, "date_created": 1304110342.4317369, "message": "You may benefit from improvised weapons & booby trap army field manuals. They'd probably be available in PDF free lots of places, or I have hard copies. They're all about making sensors & actuators out of stuff you find lying around.", "group_id": 868, "id": 863612}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304110206.2233801, "message": "If anyone is free this weekend, a couple of us are going to work to set up the garden Sunday (May 1) at 3:30pm. Just let me know if you'd like to come help out.", "group_id": 868, "id": 863559}, {"user_id": 31506, "stars": [], "topic_id": 22065, "date_created": 1304110532.9456191, "message": "Mick, you mean to guard our vegetables from birds? Airmines?", "group_id": 868, "id": 863704}, {"user_id": 3019, "stars": [], "topic_id": 22065, "date_created": 1304118365.5779221, "message": "Yeah, I made a sensor out of plaster of Paris and 2 zinc coated nails.  I'd be interested to see how it works out, we also have a bunch of solar panels we can use and a wishield could probably reach the lab from the roof.", "group_id": 868, "id": 864844}, {"user_id": 4330, "stars": [], "topic_id": 22065, "date_created": 1304170861.3383501, "message": "Nah, I don't mean weaponry. I mean creative approaches to moisture/sun/wind sensors... But the sound of a bunch of birds taking flight may inspire others.", "group_id": 868, "id": 868082}, {"user_id": 31501, "stars": [], "topic_id": 22065, "date_created": 1304188540.234508, "message": "I'll be there with Jason on Sunday, would love a few extra hands", "group_id": 868, "id": 870590}]