[{"user_id": 20284, "stars": [{"date_created": 1302050239.1011331, "user_id": 14070}], "topic_id": 17461, "date_created": 1302037380.4348259, "message": "http://notedup.com/ is a quick and dirty prototype I put together to track and share what you are reading with others.  Idea came about while working as a research assistant.  Wanted to see what people are reading, but also wanted to be able to \"note up\" and tag/categorize my research finds.  Would love any and all feedback!!!  Thanks!", "group_id": 250, "id": 546757}, {"user_id": 3712, "stars": [], "topic_id": 17461, "date_created": 1302037495.8051479, "message": "I would look around to see what your competition is doing or what it's not doing and then work from there... this sort of thing seems to be gaining in popularity", "group_id": 250, "id": 546775}, {"user_id": 25942, "stars": [], "topic_id": 17461, "date_created": 1302047412.4701719, "message": "a quick and dirty prototype with all this neat design? Good job there!", "group_id": 250, "id": 550483}, {"user_id": 1941, "stars": [], "topic_id": 17461, "date_created": 1302048306.838778, "message": "seriously! this is a rough and dirty prototype? can I pay you to do mine!? sheesh!", "group_id": 250, "id": 550750}, {"user_id": 20284, "stars": [], "topic_id": 17461, "date_created": 1302051080.064646, "message": "Thanks all :)  Built this in 2.5 weeks, but I'm stuck in exams now.  Trying to determine whether to spend the time this summer and build this idea out more or not.  I really appreciate your time and feedback.", "group_id": 250, "id": 551388}, {"user_id": 6812, "stars": [], "topic_id": 17461, "date_created": 1302121318.2843609, "message": "@nvanexan really impressive design work. did you use some template as base, or did it from scratch?", "group_id": 250, "id": 564874}, {"user_id": 20284, "stars": [], "topic_id": 17461, "date_created": 1302123911.892046, "message": "@arikfr thanks so much!  I built from scratch in Ruby on Rails.  In full disclosure I am more designer than dev - design is my background.  That's why it probably looks nicer than it performs and need some help kicking the tires :)", "group_id": 250, "id": 565255}, {"user_id": 6812, "stars": [], "topic_id": 17461, "date_created": 1302197258.6188509, "message": "@nvanexan yeah, after asking I looked at your profile and saw that you're a designer. Nice work nonetheless :)", "group_id": 250, "id": 577665}]