[{"user_id": 39911, "stars": [], "topic_id": 48073, "date_created": 1322063184.9561419, "message": "Quien no ha soñado alguna ves estar en un startup open source?, hagamos una lluvia de ideas y encontremos las mejores propuestas en este topic", "group_id": 965, "id": 2625038}, {"user_id": 6541, "stars": [], "topic_id": 48073, "date_created": 1322148423.880162, "message": "Más que ideas se necesita código que resuelva algún problema", "group_id": 965, "id": 2630812}, {"user_id": 41528, "stars": [], "topic_id": 48073, "date_created": 1322160139.6256549, "message": "Que tal, yo he estado anotando ideas por cerca de 6 meses sobre productos o servicios en línea que se requieren actualmente, me gustaría platicarlas con mas gente y que me den su retroalimentación y por ultimo ver si es viable crear un grupo que lleve a cabo la idea o al menos un prototipo", "group_id": 965, "id": 2631681}, {"user_id": 2946, "stars": [{"date_created": 1322163782.484947, "user_id": 10406}], "topic_id": 48073, "date_created": 1322162422.9494891, "message": "Estás haciendo las cosas al revés. Primero necesitas un problema que se pueda resolver con software. Luego ves si tiene sentido de negocio que sea opensource, si no es negocio y es escalable no es una startup.", "group_id": 965, "id": 2631895}, {"user_id": 6541, "stars": [], "topic_id": 48073, "date_created": 1322162416.8422949, "message": "¿Cual seria la razon para que otra persona haga tu proyecto open source sin codigo inicial?", "group_id": 965, "id": 2631894}, {"user_id": 41528, "stars": [], "topic_id": 48073, "date_created": 1322232084.160476, "message": "No me refería a que alguien mas lo hiciera, la idea es hacerlo en conjunto a quienes les interese.", "group_id": 965, "id": 2637527}, {"user_id": 39911, "stars": [], "topic_id": 48073, "date_created": 1322233920.9949341, "message": "Que ideas tienes q sean rentables", "group_id": 965, "id": 2637814}, {"user_id": 41528, "stars": [], "topic_id": 48073, "date_created": 1322234991.0212541, "message": "no se que tan rentable sea, una de las ideas es crear un servicio web donde la gente pueda dar de alta \"entradas\" las cuales pueden ser cualquier contenido en texto (e-mails, twitter, RSS, etc ...) y la salida sea audio pero en su movil, de esta manera puedes ir en tu carro escuchando tus correos no leidos, las noticias de CNN a traves de su RSS, o puedes salir a correr y estar leyendo los tweets de tus amigos, etc ... esta es una de las ideas", "group_id": 965, "id": 2637942}]