[{"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1297372263.2158999, "message": "He is quoted as saying, \"It is better to rise from life as from a banquet — neither thirsty nor drunken.\"", "group_id": 175, "id": 74687}, {"user_id": 5995, "stars": [], "topic_id": 3918, "date_created": 1297372329.778893, "message": "Moderation, the middle ground, the average, the compromise.. to me it is nearly always the way to a contented, but average, life :-)", "group_id": 175, "id": 74695}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1297372186.7729371, "message": "One of the core tenets of Aristotelian thought, moderation is espoused consistently by Aristotle as the method by which an individual can reach happiness.", "group_id": 175, "id": 74680}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1297372281.3604951, "message": "What do you believe in regards to moderation in your life?", "group_id": 175, "id": 74689}, {"user_id": 6381, "stars": [], "topic_id": 3918, "date_created": 1297375950.537921, "message": "@mattharwood Agreed, moderation is for liberal compromisors", "group_id": 175, "id": 75356}, {"user_id": 544, "stars": [{"date_created": 1297824165.3006361, "user_id": 545}], "topic_id": 3918, "date_created": 1297777190.2129099, "message": "I think that's silly. Moderation has nothing to do with being average. It's about avoiding excessiveness, not eccentricity.", "group_id": 175, "id": 111155}, {"user_id": 544, "stars": [], "topic_id": 3918, "date_created": 1297777254.072134, "message": "I think moderation is a good rationale to keep in mind as you do things. Do you really need to buy a bucket of 20 hot wings, or would 12 suffice just fine? (aka the junk food example)", "group_id": 175, "id": 111162}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1297824213.2131979, "message": "I'm with @KuraFire on this one. I don't believe Aristotle was referring at all to constant compromise. He definitely had a lot of beliefs that would not be considered a \"middle-ground\" or \"average.\"", "group_id": 175, "id": 117326}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1297824289.8798029, "message": "And I'm assuming @ianjsilvera really belongs in https://convore.com/trolling/", "group_id": 175, "id": 117331}, {"user_id": 544, "stars": [], "topic_id": 3918, "date_created": 1298379815.83441, "message": "Also: Stay Hungry, Stay Foolish.  Some of the wisest words ever.", "group_id": 175, "id": 178891}, {"user_id": 1661, "stars": [], "topic_id": 3918, "date_created": 1298423888.4078951, "message": "Where does Aristotle write that moderation is the method by which an individual can reach happiness?", "group_id": 175, "id": 185355}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525169.209023, "message": "Therefore, Aristotle is defining \"The Good\" and \"Happiness\" to be the act of living in a state of virtuosity.", "group_id": 175, "id": 195519}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525439.1880159, "message": "Aristotle goes on to describe the various reasons why virtue is neither a passion or a faculty, following this with: \"If, then, the virtues are neither passions nor faculties, all that remains is that they should be states of character.\"", "group_id": 175, "id": 195538}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525128.0388601, "message": "Also, \"He is happy who lives in accordance with complete virtue and is sufficiently equipped with external goods, not for some chance period but throughout a complete life. \"", "group_id": 175, "id": 195517}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525123.7922831, "message": "In Nicomachean Ethics, Aristotle writes: \"If we define the function of Man as a kind of life, and this life as an activity of soul, or a course of action in conformity with reason, if the function of a good man is such activity or action of a good and noble kind, and if everything is successfully performed when it is performed in accordance with its proper excellence, it follows that the good of Man is an activity of the soul in accordance with virtue.\"", "group_id": 175, "id": 195516}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525483.7394891, "message": "In the chapter following this that discusses exactly what this state of character is, he states: \"Virtue, then, is a state of character concerned with choice, lying in a mean, i.e. the mean relative to us, this being determined by a rational principle, and by that principle by which the man of practical wisdom would determine it.\"", "group_id": 175, "id": 195544}, {"user_id": 545, "stars": [{"date_created": 1298737558.215322, "user_id": 544}, {"date_created": 1298837654.671068, "user_id": 1661}], "topic_id": 3918, "date_created": 1298525553.347882, "message": "Therefore, living in a state of virtuosity is living in a state of moderation based in rationality.", "group_id": 175, "id": 195548}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525314.1803551, "message": "Furthermore, Aristotle goes on to define virtue (also in Nicomachean Ethics): \"Next we must consider what virtue is. Since things that are found in the soul are of three kinds -- passions, faculties, states of character -- virtue must be one of these. By passions I mean appetite, anger, fear, confidence, envy, joy, friendly feeling, hatred, longing, emulation, pity, and in general the feelings that are accompanied by pleasure or pain; by faculties the things in virtue of which we are said to be capable of feeling these, e.g. of becoming angry or being pained or feeling pity; by states of character the things in virtue of which we stand well or badly with reference to the passions, e.g. with reference to anger we stand badly if we feel it violently or too weakly, and well if we feel it moderately; and similarly with reference to the other passions.\"", "group_id": 175, "id": 195531}, {"user_id": 545, "stars": [], "topic_id": 3918, "date_created": 1298525636.9083619, "message": "By this line of reasoning, it is inferred that living in a state of moderation is \"The Good\" or \"Happiness\"—there is no explicit distinction where Aristotle states \"Moderation is the method by which an individual can reach happiness.\" My first statement was a paraphrasing of this line of reasoning.", "group_id": 175, "id": 195556}]