[{"user_id": 4027, "stars": [{"date_created": 1305464605.970659, "user_id": 2941}], "topic_id": 35302, "date_created": 1305400650.9565649, "message": "Who else is amused at the fact that DICE and Activision are basically publically attacking each other's games these days? Also, how many of you think Activision will be able to create a decent game out of MW3?", "group_id": 857, "id": 1054216}, {"user_id": 520, "stars": [], "topic_id": 35302, "date_created": 1305402328.834723, "message": "I don't", "group_id": 857, "id": 1054368}, {"user_id": 3315, "stars": [{"date_created": 1305418953.358516, "user_id": 508}], "topic_id": 35302, "date_created": 1305410952.734673, "message": "From a marketing standpoint I get it, they want to edge each other out. But they are two entirely different styles of first-person shooter.  The only thing that is similar is the whole modern warfare shtick.  But other than that, not much.  It is kind of amusing to watch though.\n\nThat aside, CoD has been essentially garbage since World at War. 4 was the last decent game. Everything after that has been beyond sub-par, especially compared to the first two games. I don't think that will change with MW3. People will still buy it in droves, though.", "group_id": 857, "id": 1055505}, {"user_id": 3315, "stars": [], "topic_id": 35302, "date_created": 1305410975.135783, "message": "Aaaand my posts are showing up weird for some reason.  Hrm =/", "group_id": 857, "id": 1055507}, {"user_id": 508, "stars": [], "topic_id": 35302, "date_created": 1305419039.9098091, "message": "I think it was because you wrote so much?  But yeah, totally agree.  Activision has a fetish for ruining great series until they stop selling, and it's still selling.  Battlefield is the obvious higher quality product with not as much exposure (outside of PC circles)", "group_id": 857, "id": 1056538}, {"user_id": 508, "stars": [], "topic_id": 35302, "date_created": 1305419472.105597, "message": "I mean, these are the people that thought attack dogs were a great idea just because the internet thought so.", "group_id": 857, "id": 1056588}, {"user_id": 3740, "stars": [], "topic_id": 35302, "date_created": 1305478537.2490261, "message": "Battlefield 3", "group_id": 857, "id": 1060885}, {"user_id": 4027, "stars": [], "topic_id": 35302, "date_created": 1305493521.782506, "message": "Haha, is that really why the attack dogs were put into the game?", "group_id": 857, "id": 1063434}, {"user_id": 508, "stars": [], "topic_id": 35302, "date_created": 1305518124.312999, "message": "I think so, more or less.", "group_id": 857, "id": 1066664}, {"user_id": 4027, "stars": [], "topic_id": 35302, "date_created": 1305553973.657757, "message": "What a sexy reason...but...back to the original topic. Battlefield has also made some shitty ports for the console that may have turned people off to the series in the past, such as, Battlefield 2: Modern Combat.", "group_id": 857, "id": 1070919}, {"user_id": 4027, "stars": [], "topic_id": 35302, "date_created": 1305554732.8479459, "message": "Hopefully, the fact that BF3 is being made to run on high-end PC systems doesn't diminish the console version too much. I would assume they are taking scalability into consideration very heavily with this game, but we will see. Especially since BF3 is running on DirectX 11, while Xbox 360 is only capable of DirectX 9.", "group_id": 857, "id": 1071087}, {"user_id": 3315, "stars": [], "topic_id": 35302, "date_created": 1305571920.5976789, "message": "DX10 and up only for PC is what I've heard.  Which honestly any modern pc should be able to do, but it will still leave some people bitter and angry.", "group_id": 857, "id": 1073466}]