[{"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297203024.2764089, "message": "For reference: http://en.wikipedia.org/wiki/Technological_singularity", "group_id": 175, "id": 49755}, {"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297203623.5326941, "message": "What are your thoughts surrounding a singularity? Recent advances like those in regenerative medicine, augmented cognition, neural networks, and genetic engineering point to technology reaching a point at which the humans of today are very dissimilar to those of years past. As we reach this new level of interaction, whether through external devices such as near-field communications or through internal devices such as neural implants, how do we define the point at which a human is no longer simply \"human\" but \"transhuman?\"", "group_id": 175, "id": 49777}, {"user_id": 272, "stars": [], "topic_id": 1926, "date_created": 1297236810.9240079, "message": "No.", "group_id": 175, "id": 50956}, {"user_id": 938, "stars": [{"date_created": 1297280059.975759, "user_id": 938}], "topic_id": 1926, "date_created": 1297280028.0233631, "message": "According to Mayan mythology the threshold will be the point at which time ceases to hold the relevance it once did.", "group_id": 175, "id": 53264}, {"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297281025.279043, "message": "@KevBurnsJr Are you saying that 2012 is the year of the transhuman or are you saying that this is pretty much just as relevant as the 2012 doomsaying? Because that's unclear.", "group_id": 175, "id": 53800}, {"user_id": 1523, "stars": [], "topic_id": 1926, "date_created": 1297281646.9180801, "message": "As long as intelligent people benefit from coordinating their efforts with each other, there will be a need to measure time.", "group_id": 175, "id": 54128}, {"user_id": 1523, "stars": [], "topic_id": 1926, "date_created": 1297282099.573216, "message": "Based on your use of the word, 'transhuman' I'd assume that you consider that state to be transitional to some other life form 'superhuman.'", "group_id": 175, "id": 54287}, {"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297282214.951148, "message": "@sunnymolini I'd agree with the term \"Transhuman\" being simply a transitional stage in the evolutionary chain, but it's technically derived from the phrase \"Transcendental Human.\"", "group_id": 175, "id": 54336}, {"user_id": 1523, "stars": [], "topic_id": 1926, "date_created": 1297282714.364872, "message": "Lets shuffle that subject to another topic thread. I imagine that over the next 100 years, AI, computer simulation of the human brain, and neural implanting, will start changing the human experience from all of us relatively equally equipped, to Huge differences in mental capacity. Anybody have a problem with that.", "group_id": 175, "id": 54585}, {"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297289832.346256, "message": "@sunnymolini So my point is that does that huge difference in mental capacity equate to that point? Also, I believe that this thread should stay intact here, as your other thread is about the definition of a human, while this in regards to a specific topic that is simply influenced by the definition of a human.", "group_id": 175, "id": 58945}, {"user_id": 1661, "stars": [], "topic_id": 1926, "date_created": 1297290649.1250811, "message": "Since the Internet is the McDonald's of information, I think an easy demarcation for singularity is the point at which classical wisdom, e.g. the Gita, the Dao, the Iliad, etc., no longer makes sense to people now. Those works deal with people and their mortality. As soon as we can no longer relate to mortality because of advances in biology, e.g. head transplants, we can say we've achieved a marked transhuman stage.", "group_id": 175, "id": 59185}, {"user_id": 1523, "stars": [], "topic_id": 1926, "date_created": 1297345619.4070489, "message": "Eternal life. I agree, there are hundreds of cases in that body of literature of 'gods' which are quite human, but with the character differences implied by immortality. Considered godlike by people of the past by the wisdom their extreme age afforded them. Though I'm sure that we will find a way to get 500+ years old and be just as infantile as ever, its rather the human condition. he he", "group_id": 175, "id": 69349}, {"user_id": 545, "stars": [], "topic_id": 1926, "date_created": 1297359995.629247, "message": "@barce That's a pretty good method of demarcation.", "group_id": 175, "id": 71935}, {"user_id": 938, "stars": [], "topic_id": 1926, "date_created": 1297592599.433444, "message": "@mko Just noting specifics of another singularity prophecy in the hopes that the two might inform each other.", "group_id": 175, "id": 89552}]