[{"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305926916.9723339, "message": "I've just reached a point in storyforming which I am unsure about regarding the Manipulation (Psychology) domain.\n\nThe characters are clear - the MC gets manipulated (literally) by the IC. The IC is not manipulated by anyone. This does lead to a change in the MC. No OS characters are involved in this manipulation (although they are affected by the change in the MC which mostly due to the manipulation). The OS theme is not connected with this, so I'm quite sure the Manipulation domain is not OS.  \n\nTherefore, is it the MC domain, because the MC gets manipulated. \n\nOr is it the IC domain because the IC does the manipulation.", "group_id": 2515, "id": 1130541}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305926950.48493, "message": "Or is it the M/I domain because one gets and one does?", "group_id": 2515, "id": 1130552}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305927057.025218, "message": "Using the extents of my huge intellectual capabilities........ (what??) .......... I would guess it is the MC domain simply because it is the MC who gets changed by the manipulation. But I'm not sure.", "group_id": 2515, "id": 1130578}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305927071.56164, "message": "what is their relationship?", "group_id": 2515, "id": 1130581}, {"user_id": 30287, "stars": [], "topic_id": 36186, "date_created": 1305929270.672883, "message": "Sounds a lot like it's the M/I throughline. It's of concern to the MC and the IC.", "group_id": 2515, "id": 1131061}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305930409.9465959, "message": "They don't know each other very well. It's pure mind manipulation (this is a sci fi story), but for the good of the MC.", "group_id": 2515, "id": 1131119}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305931424.5854211, "message": "Without the context of the other domains it's really hard to say. Can you describe their relationship at all, like teacher/student, lovers, father/son, that kind of thing?", "group_id": 2515, "id": 1131217}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305932767.3011761, "message": "They are strangers. They meet, but don't know each other. But I guess the IC is the IC because he does the manipulation that causes the MC to change. The IC is an angel type character.", "group_id": 2515, "id": 1131305}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305933773.6382749, "message": "But from a certain point-of-view all ICs manipulate Change Main Characters to Change. They're not always in the Psychology domain. The reason I keep asking about their relationship is because it is *super* important to establish what it is before you start asking these questions. You need to know what kind of relationship they have (is it growing, is it declining) so that you can look and see where the source of the problems in their relationship come from.", "group_id": 2515, "id": 1131340}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305934703.5965221, "message": "Manipulating through magic sounds like an external Activities problem, but it could be Psychology. Are they closer at the end or farther apart?", "group_id": 2515, "id": 1131368}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305933796.975626, "message": "It's separate from the the Impact Character's throughline of influence.", "group_id": 2515, "id": 1131342}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305934407.8503709, "message": "Sorry, I'm explaining this badly. The IC literally manipulates the MC - with, you could say, magic. The actual change in the MC comes from the MC. But it is instigated by the IC using this magic to initially have an effect on the MC. This is sci-fi and the IC is not human.", "group_id": 2515, "id": 1131360}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305936211.938668, "message": "Neither. Well, the MC sort of realises he has been influenced by the IC, therefore developing a curiosity about the IC, but they only meet at the start, and so far, their relationship doesn't evolve (other than their own understanding of each other). The IC sees the MC change, but has no further influence.\n\nAs it is at the moment, the IC is the protagonist, and wants to stop the MC destroying himself because in doing so he will destroy his environment (so the goal I think is saving the MC). The IC does this by uses 'magic' to make MC rethink. \n\nThe reason I made the goal 'saving the MC' and not the environment is because there's an antagonist who is trying to stop the MC changing, although unaware that this means the destruction of the environment. (I'm not sure yet what OS role the MC character has)\n\nDoes that make more sense?", "group_id": 2515, "id": 1131413}, {"user_id": 7645, "stars": [], "topic_id": 36186, "date_created": 1305937994.767554, "message": "If their relationship doesn't evolve, then there is no relationship,", "group_id": 2515, "id": 1131474}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305937473.865133, "message": "When I read back my own words....... maybe ScreenwritingScreenwriter is right..... M/I domain.", "group_id": 2515, "id": 1131460}, {"user_id": 7664, "stars": [], "topic_id": 36186, "date_created": 1305944286.693172, "message": "I'm curious if the non-human could be *just* the inciting incident, or the inciting incident and the protagonist, but not the IC.\n\nFor instance, if the MC learns that the non-human has initiated some change in him, and he fights it; then, if there were someone who tells him to accept the change... that would be the IC.", "group_id": 2515, "id": 1131831}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305966767.302969, "message": "Well..... re. the previous paragraph, the MC is aware internally that he is going down the wrong path (which will lead to his destruction). So a part of him wants to change. It so happens that he is more important than even he realises, therefore his end will be the end of his world. \n\nThe protagonist's (IC?) goal is to save the man, therefore saving the world. The protagonist also has a personal reason for wanting to help the man, and is able to manipulate the thinking of the man to make him more aware of this destructive path, which leads the MC to question it.  \n\nA colleague (antagonist?) of the MC wants him to stay on the same path as there is a benefit to the colleague, who loses a lot if the MC changes.\n\nSo the goal is to stop the destruction of the MC.", "group_id": 2515, "id": 1133284}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305967002.1625509, "message": "So the protagonist (driving towards the goal of saving the MC) is in place to have much more impact on the MC than any other character or group or environmental factor, although elements here also push the MC in one direction or another.", "group_id": 2515, "id": 1133293}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305966920.7855711, "message": "The relationship, although not a physical one, I suppose does develop between the MC and the non-human character. I mean, they are both aware of each, and both are affected by each other, and ultimately the MC realises it was the IC that helped him to change, and saved him. They don't actually meet again though.", "group_id": 2515, "id": 1133288}, {"user_id": 30951, "stars": [], "topic_id": 36186, "date_created": 1305967151.5094681, "message": "The MC is the MC because we follow the story from the point of view of the struggle of this character who may destroy himself.\n\nI hope that's not too much that you're now sleeping........", "group_id": 2515, "id": 1133296}]