[{"user_id": 8539, "stars": [], "topic_id": 9310, "date_created": 1298779080.3678861, "message": "For me - I love - https://github.com/carlhuda/janus", "group_id": 100, "id": 216403}, {"user_id": 5575, "stars": [{"date_created": 1298785496.2669771, "user_id": 4156}, {"date_created": 1298816995.9362569, "user_id": 2457}, {"date_created": 1298882724.3266571, "user_id": 6396}], "topic_id": 9310, "date_created": 1298785155.7769091, "message": "The best one is the one you've developed and customized for your own use. I've never really understood the use case for things like Janus, or other config packages intended for distribution.  If you're going to invest the time to using an editor such as vim, you should also show some interest in how it works and how to get it to do what YOU want it to do, not what someone else wants.", "group_id": 100, "id": 216623}, {"user_id": 5575, "stars": [], "topic_id": 9310, "date_created": 1298785406.4800799, "message": "Plugins and vimrc lines should all solve problems.  Each one should be a personal response to a perceived deficiency. It's one thing to see examples and use someone else's code to do things you didn't even know were possible, but to start with a large pre-build config package and not understand what it's doing just seems irresponsible.", "group_id": 100, "id": 216625}, {"user_id": 1355, "stars": [], "topic_id": 9310, "date_created": 1298786661.4002531, "message": "@nat well said.", "group_id": 100, "id": 216658}, {"user_id": 15162, "stars": [], "topic_id": 9310, "date_created": 1298787957.416496, "message": "@nat I agree. That said, it does have a nice collection of plugins. it took me a long time to hunt down the ones I'm using today", "group_id": 100, "id": 216684}, {"user_id": 15162, "stars": [], "topic_id": 9310, "date_created": 1298788184.8713069, "message": "I think everyone should have their own .vimrc though, at least for key mappings and settings", "group_id": 100, "id": 216688}, {"user_id": 2457, "stars": [], "topic_id": 9310, "date_created": 1298817139.5707779, "message": "The real advantage of those public vim configs is being able to pick and choose ideas that make sense in your development workflow, or discover plugins that you didn't know existed. But yes, you do need to understand what all your settings do or it would be a bit pointless to have them in the first place.", "group_id": 100, "id": 217249}, {"user_id": 8224, "stars": [], "topic_id": 9310, "date_created": 1298829497.367873, "message": "I think that janus is a wonderful starting point, not only does it include most of the add ons that I want it has a great Rakefile to keep them updated and organized.  Fork and customize if you want more or less.", "group_id": 100, "id": 218669}, {"user_id": 9317, "stars": [], "topic_id": 9310, "date_created": 1298936512.5518301, "message": "I've been using this: https://github.com/akitaonrails/vimfiles has anyone tried that and janus? Curious how different they are.", "group_id": 100, "id": 230355}]