[{"user_id": 14970, "stars": [], "topic_id": 8980, "date_created": 1298613528.252291, "message": "Hi all, I'd like to get your suggestions on an open-source or low-cost e-commerce software that I can use to setup a series of web stores quickly. They need to be scalable and have a clean back-end so when its time for me to change the e-commerce script or modify the code I can do so easily. \n\nSome things I was looking for: \n- Shipping calculators are necessary (i.e. FedEx, USPS, UPS, CanadaPost) with intuitive options for specifying when shipping costs can vary\n- Promotion/Coupon code system\n- Related products\n- Reseller support\n- Social login (Google, Facebook, Twitter)\n- Good analytics\n- Easy to skin for branding and customization\n- Multiple dashboard views (pending orders, administration, product catalog management, etc)\n\nSuggestions and discussion about favorites are welcome. The programming languages I am very familiar with are PHP and MySQL or ASP and MSSQL, but currently the server I have ready to go would support PHP, MySQL out of the box. Also your feedback as to maybe choosing a system with a programming language/database that supports scaling in the future would help as well.", "group_id": 250, "id": 206257}, {"user_id": 5041, "stars": [], "topic_id": 8980, "date_created": 1298627859.108845, "message": "You might want to try Magento or Ubercart in Drupal", "group_id": 250, "id": 206899}, {"user_id": 2458, "stars": [], "topic_id": 8980, "date_created": 1298637148.8103681, "message": "+1 for Magento. They're becoming the Wordpress of ecommerce sites.", "group_id": 250, "id": 207455}, {"user_id": 7723, "stars": [], "topic_id": 8980, "date_created": 1298652108.292876, "message": "Look into nopCommerce.  It's open source, built on .NET framework, feature rich and scalable", "group_id": 250, "id": 209422}, {"user_id": 14970, "stars": [], "topic_id": 8980, "date_created": 1298652392.8143649, "message": "Thanks guys. Was looking for a quick solution for a client of mine, Magento definitely looks like the way to go. Probably will have him opt for the paid version. Any reviews on the professional?", "group_id": 250, "id": 209469}, {"user_id": 3859, "stars": [], "topic_id": 8980, "date_created": 1298675978.4158659, "message": "The Drupal e-commerce system Ubercart has evolved into Drupal Commerce. The new Drupal 7 based system was just announced as ready to use today: http://www.commerceguys.com/resources/articles/Drupal-Commerce-ready-to-build-stable-Drupal-7-Online-Stores", "group_id": 250, "id": 212019}, {"user_id": 1381, "stars": [], "topic_id": 8980, "date_created": 1298678245.336642, "message": "Magento can be kind of a headache. Unless they need all of that power, they could also check out Shopify.", "group_id": 250, "id": 212162}, {"user_id": 896, "stars": [], "topic_id": 8980, "date_created": 1298876505.1520841, "message": "spree does a nice job, and  very easy to start with, I'm not sure if it does offer reseller support though", "group_id": 250, "id": 223982}, {"user_id": 14970, "stars": [], "topic_id": 8980, "date_created": 1298997941.9565921, "message": "Between the three, while I'm sure they are skin-able, Magento seems to do some core things (like breadcrumbs) properly.", "group_id": 250, "id": 236215}, {"user_id": 15661, "stars": [], "topic_id": 8980, "date_created": 1299048868.410713, "message": "drupalcommerce +1 - the commerce guys have a cool free service called checkoutmonitoring.com which I think totally rocks!", "group_id": 250, "id": 245439}, {"user_id": 14970, "stars": [], "topic_id": 8980, "date_created": 1299160677.1172819, "message": "How easy is it to modify Drupal Commerce to add steps or modules in the checkout process?", "group_id": 250, "id": 260181}, {"user_id": 15661, "stars": [], "topic_id": 8980, "date_created": 1299225727.737675, "message": "It takes some knowhow but there is a lot of preconfiguration in there.", "group_id": 250, "id": 267743}, {"user_id": 15156, "stars": [], "topic_id": 8980, "date_created": 1299705259.1033101, "message": "@ AroonUp i would suggest ubercart if it's a single administrator market (payments go to the admin who then disperses to sellers) you're targetting.. mainly because almost the entire ubercart API is available to be used as drupal hooks and you can programmatically alter and customise a lot of stuff.", "group_id": 250, "id": 308401}, {"user_id": 15156, "stars": [], "topic_id": 8980, "date_created": 1299705357.239537, "message": "and also coz most of your specs come out of the box", "group_id": 250, "id": 308420}]