[{"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302547358.986366, "message": "I’m looking for a designer who is as passionate about design as I am technology and as passionate about creating and executing on a product as I am. Our website is http://hashbo.com (as the footer says it’s less than a month old from conception) and what you see is just the beginning - the idea is to take on the concept of forums and completely rewrite the rulebook.", "group_id": 629, "id": 627804}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302547506.1982689, "message": "Tall order hey! But please let me know if you feel you fit the bill, maybe over at http://hashbo.com/_/#IThinkICouldMakeThisLookBetter", "group_id": 629, "id": 627840}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302547455.4541061, "message": "However, as you can tell, great design is not my forte and I’m wary of designers who design for the sake of design (like technologists who live for technology). So I’m looking for someone who values execution more than kerning :-) but values good design, UX over bad design and UX.", "group_id": 629, "id": 627827}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551433.6917689, "message": "Okay so what I’m trying to achieve is to take forums into the Web 2.0 of realtime lightweight communication, I’m experimenting with this idea at the moment with HashBo. What I’m looking for is someone who thinks that’s a cool idea too and would like to join forces to make this happen.", "group_id": 629, "id": 628550}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551622.5403841, "message": ".. yeah who knows where an idea will take you!", "group_id": 629, "id": 628604}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551973.884114, "message": "Okay fantastic, and I’ll immediately put your company name on the site and am happy to swap ideas etc. we can follow up offline I’m neil.ellis@mangala.co.uk. Yeah I’ve done a reall, really basic page for iPhone, but absolutely.", "group_id": 629, "id": 628730}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551293.449209, "message": "Well you have got my respect back pretty quickly, most folk don’t apologise on the web fullstop :-) Not being a designer myself I’m not really versed in the problems you face, programmers are usually exploited by business folk so I can see you’d face similar problems. The life of a skilled artisan hey!", "group_id": 629, "id": 628510}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302549629.726805, "message": "So basically what you are after is some newbie to design to give their ideas, so that you can use them, and then what? How will you pay this designer? I think what you need is to do some more research, on what it is that you want to do and how you want to \"be portrayed\" to be honest this is just another \"twitter\" with a less than desirable name. Hashbo sounds like some sort sort of smoking apparatus.", "group_id": 629, "id": 628313}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302550838.923893, "message": "Or a new style of forum, which I wrote before I came across Convore and I do actually think this field is stagnant with no definitive big player. The field being conversation based interaction in a public and persistent manner - like forums. Twitter is a personal publishing system and doesn’t really work well with conversations so isn’t a particularly good comparison. Anyway, off back to hack on it again now.", "group_id": 629, "id": 628433}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302550224.6395061, "message": "Wow, what an incredible cynical view, I’m an experienced programmer who is just trying to do something more interesting with his life and was looking to see if someone else wanted to join in. Actually I’m more than happy to work an equity deal with someone and have no desire to use anyone. I’m pretty disappointed to see such a response, this place seemed to have a lot of sensible people on it.", "group_id": 629, "id": 628350}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302550264.208312, "message": "And HashBo - HashBoard is actually a wiki-style approach to chat.", "group_id": 629, "id": 628352}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551126.9970591, "message": "My apologies @hashbo, it seems I was wrong, you are actually genuine and that is what I wanted to find out based on my answer. You see most like designers I like to design stuff really well, but hate the thought of a designer's work being used and the only credit he / she gets is that of \"on your portfolio\" I support No Spec http://www.no-spec.com/. For a design to work there are generally a bunch of questions that need to be answered, and as you are so passionate about it, it certainly seems that you may be able to answer them.", "group_id": 629, "id": 628478}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551140.8755021, "message": "What is it that you are really wanting to achieve?", "group_id": 629, "id": 628480}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551156.1808679, "message": "Who is your target audience?", "group_id": 629, "id": 628482}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551507.6474209, "message": "Target audience is consumer internet, with the ability for commerical or special interest sites to embed the software into their sites too. Again like forum software, but without the formality and complexity. Best analogy would be how Twitter is to blogs I’d like to be to forums.", "group_id": 629, "id": 628577}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302551660.7253239, "message": "Hey geography doesn’t matter much these days does it?", "group_id": 629, "id": 628629}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551632.610549, "message": "Ok so you're idea has piqued an interest in me, this is my site www.azcreative.co.nz I might not be what you are looking for, as I am in NZ, I know a lot of designers and developers so I might be able to help you out regardless.", "group_id": 629, "id": 628611}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551763.196177, "message": "Ha ha... I wouldn't have thought so... but some people tend to be a bit meh about it, anyway I can design a splash screen for you, and then we can work out how the other part - the actual forum design feel works I quite like the look of this one", "group_id": 629, "id": 628667}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302553083.4382329, "message": "thanks sent you an email", "group_id": 629, "id": 629149}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551886.0074921, "message": "I would imagine that a iphone/ android design would also be of use?", "group_id": 629, "id": 628707}, {"user_id": 12525, "stars": [], "topic_id": 18644, "date_created": 1302551551.6925321, "message": "Hey I think anyone that actually has an idea on the web these days is worthwhile listening too...", "group_id": 629, "id": 628587}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302552027.180202, "message": "Basically, we can move forward bit by bit and see where this takes us, as I said I’m more interested in producing a cool product than messing someone about so we can work something out offline :-)", "group_id": 629, "id": 628738}, {"user_id": 26244, "stars": [], "topic_id": 18644, "date_created": 1302552065.772697, "message": "And yep I saw your site straight away and love the style :)", "group_id": 629, "id": 628745}, {"user_id": 29210, "stars": [], "topic_id": 18644, "date_created": 1302674748.151495, "message": "hu", "group_id": 629, "id": 659937}]