[{"user_id": 29866, "stars": [], "topic_id": 48841, "date_created": 1324336281.6679311, "message": "Hola, espero que se encuentren todos bien en sus emprendimientos, habia andado un poco ausente de este espacio aun cuando he leido todos los temas y comentarios. Les escribo porque tengo una consulta, me gustaria saber de aquellos que tienen experiencia con la API de Facebook u otras Api's , o que desarrollen juegos basados en flash o HTML5 que tipo de infraestructura se requiere para implementar este tipo de juegos.", "group_id": 965, "id": 2744691}, {"user_id": 42145, "stars": [], "topic_id": 48841, "date_created": 1324362960.7440071, "message": "A que te refieres con Infraestructura? Servidores?", "group_id": 965, "id": 2744760}, {"user_id": 29866, "stars": [], "topic_id": 48841, "date_created": 1324393784.7177451, "message": "Si, me refiero a las características que debería de tener un servidor para permitir que corran las aplicaciones, si es necesario algo en especial o los desarrolladores tienen sus servidores donde corren sus aplicaciones.", "group_id": 965, "id": 2744890}, {"user_id": 42145, "stars": [], "topic_id": 48841, "date_created": 1324400900.140451, "message": "Bueno, lo que yo creo que es igual que cualquier aplicacion web: depende del trafico de usuarios y  ancho de banda estimado, nivel de concurrencia, etc. Si no tienes estimada la capacidad esperada, empieza pequeño pero visualiza hacia que plataformas puedes crecer... empieza inclusive con un hosting compartido, luego virtual, cloud .. en ese orden. Aunque igual puedes analizar cloud desde el principio..", "group_id": 965, "id": 2744933}, {"user_id": 29866, "stars": [], "topic_id": 48841, "date_created": 1324411161.635047, "message": "Ok, muchas gracia, pero desearía que sean un poco más específicos, se requiere de alguna licencia para correr por ejemplo juegos en flash? he leído del FMIS que rondan los $4500 USD por licencia, la capacidad del servidor no es el tema, sino los addons que requiere para correr este tipo de aplicaciones. Alguien con experiencia en el tema?", "group_id": 965, "id": 2744989}, {"user_id": 2946, "stars": [{"date_created": 1324477218.64764, "user_id": 29866}], "topic_id": 48841, "date_created": 1324450668.715344, "message": "Yo no creo que necesites flash en el servidor. El frontend puede estar en Flash o HTML5 y el backend en cualqueir cosa. No tengo idea de qué precisamente necesita un juego, pero supongo que necesitas alta concurrencia. He escuchado buenas cosas de node.js + redis + mongodb. \n\nSi necesitas obtener estadísticas yo te recomiendo que pruebes primero MixPanel antes de hacer algo desde cero.\n\nA mi me gusta RackSpace Cloud, pero quizá construir toda tu infraestructura sobre AWS sea mejor idea ya que puedes automatizar el deployment completo con algo tipo RightScale y es relativamente barato.\n\nLa infraestructura es mi nueva obsesión :)", "group_id": 965, "id": 2745108}, {"user_id": 29866, "stars": [], "topic_id": 48841, "date_created": 1324477269.6429319, "message": "@soska Gracias! Este tipo de respuesta buscaba. De gente obsesionada!", "group_id": 965, "id": 2745295}]