[{"user_id": 15434, "stars": [], "topic_id": 13564, "date_created": 1300362941.093154, "message": "One question that I'm going to ask is around Connected Services. Specifically Sage's path to cloud computing appears to be one where they mix and match their on-premise Sage products with off-premise cloud offerings -- they're calling this connected services.", "group_id": 5002, "id": 373058}, {"user_id": 15434, "stars": [], "topic_id": 13564, "date_created": 1300363104.3336971, "message": "My question is - how do customers and partners develop a sense of security that these connected partners will continue to be supported in future years. On the Sage MAS side of the fence we've already seen Extended Solutions, FRX, F9, and a host of other former integration partners cast off with customers expected to fend for themselves.\n\nWhy shouldn't customers and partners expect that after the initial marketing of Connected Services dies down that perhaps the same thing will happen in two or three years.\n\nHasn't the market shifted to where customers are going to want more single source (all-in-one) solutions versus going to several different publishers (with separate maintenance, upgrade schedules)? \n\nConnected Services seems like a band aid given the past history of Sage with other integration partners.", "group_id": 5002, "id": 373065}, {"user_id": 15434, "stars": [], "topic_id": 13564, "date_created": 1300363265.3094649, "message": "Add Starship/VTechnologies to the list of once VERY prominent integration partners where the relationship suddenly ended (though the integration remains). Some of these separations were apparently not Sage's doing (FRX discontinued, I hear V-Tech walked away) --- but regardless of who left who - how do customers/partners get the comfort feeling that history is not going to repeat itself? The weak link in this chain is the use of multiple products from different publishers. It seems that the market has started to look down upon this and now would prefer all-in-one type solutions that make minimal use of third party \"bolt ons\".", "group_id": 5002, "id": 373082}]