[{"user_id": 40342, "stars": [], "topic_id": 44598, "date_created": 1314572265.8568439, "message": "I am using the Dramatica Pro, I know he determines some choices and some of these are mandatory as the dynamic pairs of  Througlines, but it also determines the plots progression  and does not allow to change them, however there is nothing in theory that says that such and such a plot progression  has to be accepted. In other words, it chooses the best progression of plots or the only possible?", "group_id": 2515, "id": 1987918}, {"user_id": 7645, "stars": [], "topic_id": 44598, "date_created": 1314572623.445688, "message": "In order for the story to make sense and feel correct for the dynamics you have chosen - yes you need to follow those signposts. Of course, as a writer, you can do whatever you want -- just know that your audience might have a hard time following you.", "group_id": 2515, "id": 1987959}, {"user_id": 38500, "stars": [{"date_created": 1314797596.787709, "user_id": 7645}], "topic_id": 44598, "date_created": 1314791186.0816369, "message": "I see no point in viewing the storyform Dramatica gives you as a straight jacket. Rather, the software is telling you that, according to the Dramatica theory, this is the \"perfect\" storyform given the priorities you expressed. As a composer, I know that many of the works we today regard as masterpieces were full of formal surprises, red-herrings, delays-of-gratification where the form is concerned, etc. Let's remember that form in any art form is a tool, not a decree.", "group_id": 2515, "id": 2010340}, {"user_id": 7645, "stars": [], "topic_id": 44598, "date_created": 1314797602.778357, "message": "Well said.", "group_id": 2515, "id": 2011043}, {"user_id": 10814, "stars": [{"date_created": 1314806002.719156, "user_id": 7645}, {"date_created": 1314821546.3004529, "user_id": 38500}], "topic_id": 44598, "date_created": 1314804937.387182, "message": "@PhillyJeff   Yes.  Remember, Dramatica Pro is a set of tools to HELP you with your story development.  It is not supposed to DICTATE your story to you.  The theory describes a 'perfect' world.  Real people do not live in perfect worlds, nor do they tell perfectly formed stories.  Even if they did, the process of converting the ideas (storyform) into a form understandable by an audience is messy, as is the potential process of interpretation by the audience.\n\nLet Dramatica help you where you feel you need help.  Leave the rest to your intuition.", "group_id": 2515, "id": 2011951}]