[{"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306654277.8160379, "message": "A lot has been made of Rob Bell's new book lately. I haven't read it yet. This is NOT a discussion on Rob Bell's book!!!! This is a discussion on the nature of Love and this God of ours who we say is Love.", "group_id": 9787, "id": 1216387}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306654307.8289011, "message": "For those who don't read well.... This is NOT a discussion about Rob Bell's new book or what it contains", "group_id": 9787, "id": 1216388}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306654666.517935, "message": "I was thinking this morning about the woman that was brought before Jesus, caught in the act of adultery. She did not come to Jesus looking for forgiveness. She didn't even ask. Yet Jesus offered it to her in refusing to condemn her. How does this gel with our thoughts around a God who would condemn sinners to hell? Where is the Love the in that? Jesus never condemned anyone, except those who were religious and outwardly pious of their religiousity. We accept that Jesus was God. We accept that Jesus himself said that if we've seen Him then we've seen the Father. So how did Jesus react towards sinners? If He was God then how could God react differently?", "group_id": 9787, "id": 1216395}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306684391.5967121, "message": "@pevans_om What I've learnt in all these sorts of conversations is to define terms. I have realized is that different people understand the same thing differently. So to avoid talking past each other maybe define what you mean by 1. God is love and 2. What love is.", "group_id": 9787, "id": 1218194}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306688898.989157, "message": "@penkin I think that fits into what this discussion is about. The question of Love. I think it also fits in with the predestination and election discussion. It's pretty closely related to how we understand the attribute, \"God is Love\".", "group_id": 9787, "id": 1218550}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306692532.865643, "message": "@LintonCaldecott I just wonder if saying \"God is Love\" leads people to think of God as a one dimensional all loving character. For me it seems impossible to take one character of God and come to a full conclusion of who He is and how He deals with people in light of that one character. Now I know 1 John 4:8 says that God is love but we also know in the light of scripture that He is also just. So maybe this conversation needs to happen in the light of everything. In the light of God saying He hates all who do iniquity as well as the redemptive work offered by Christ to all who would accept it.", "group_id": 9787, "id": 1218942}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306692554.869379, "message": "@pevans_om Is this by any chance a discussion on Rob Bell's book? :P", "group_id": 9787, "id": 1218946}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306693616.473655, "message": "@penkin That is why the topic is created. How do we understand the nature of God and His Love for us", "group_id": 9787, "id": 1219086}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306696396.024271, "message": "If you look at the skewed idea that some might have of love, then perhaps... Love can be said to be complex. If you take the parent child relationship, a parent that truly loves their child doesn't allow all kinds of behaviour to continue. The anthropomorphising of God doesn't work perfectly, but hey, we are made in his image... so our attributes are of him, even if they are imperfect. We have justice and the desire for justice, it's just imperfect. Our love is the same thing. I dislike the direction that some people take when it comes to God. It almost seems a knee jerk reaction to highlight some God that is full of vengeance and anger when Love is mentioned. The bible tells the story of the redemptive plan that God has had, and continues to have I guess. In that light, he does indeed seem to be a God that is Love.", "group_id": 9787, "id": 1219445}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306700233.1721499, "message": "Purely for clarity and to avoid confusion we're talking about 'Agape'", "group_id": 9787, "id": 1220084}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306734589.40924, "message": "@pevans_om When I try get a definition on the net for \"Agape\" it gives me:\n\na·gape, a·ga·pe/əˈgāp/, /äˈgäˌpā/\nAdjective: (of the mouth) Wide open, esp. with surprise or wonder.\nNoun: A communal meal in token of Christian fellowship, as held by early Christians in commemoration of the Last Supper.\n\nI'm assuming it's none of these?", "group_id": 9787, "id": 1224484}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306738816.475683, "message": "http://en.wikipedia.org/wiki/Agape", "group_id": 9787, "id": 1224892}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306738941.592767, "message": "as in, eros, philia and agape.", "group_id": 9787, "id": 1224908}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306744694.5576799, "message": "@pevans_om Ok, with you. So start with your understanding and we can go from there?", "group_id": 9787, "id": 1225330}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306748274.670963, "message": "Where is the Love the in that? Jesus never condemned \nanyone, except those who were religious and outwardly \npious of their religiousity...\n\nthat's basically saying Jesus didn't condemn anyone except those\n who he condemned. Which means that there are those that will be \ncondemned, the ones that trust in their own righteousness, I guess. \nThat comes in all kinds of forms.", "group_id": 9787, "id": 1225695}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306756634.366286, "message": "@LintonCaldecott The condemnation came to those who sought to exclude people from God's grace. Jesus seemed to like to include people. (sliding off topic tho)", "group_id": 9787, "id": 1226591}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306757242.799073, "message": "I don't want to give my definition of Agape, because I want to hear what other people think. I don't just want my idea critiqued.\n\nHowever, let me say the following. We have a picture of salvation. It goes something like this. I'm a sinner. Sinners go to hell. Jesus died so that sinners don't go to hell. If I believe in Jesus then I don't go to hell, but I go to heaven - where God is. Now here we may diverge. This situation exists either because God demands that sins be punished OR the situation exists because those who deny God by sinning belong to the devil (Ransom vs Satisfaction)\n\nSo what we have is a God who loves me, but he's going to stand by and let me get punished....no wait.....He's not standing by, He sent Jesus to accept the punishment/be the ransom. But we only benefit from this transaction if we say we believe.... ok so far...but.....is this loving God really going to let His precious creation suffer for all eternity for poor choices here on earth? There is consequences to rejecting God, sure, but for all eternity? I struggle with that!\n\nLet's extend the Father/Son metaphor. Will a loving earthly father really banish his son forever from his home just because the son rebels? Where is that father watching the road for his son's return?", "group_id": 9787, "id": 1226631}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306759650.0851059, "message": "@pevans_om yea well... again, if a parent knows his kid just murdered someone, just because they love them doesn't mean they wouldn't let their kid go to jail.", "group_id": 9787, "id": 1226794}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306760681.7695351, "message": "So now the ignorant are in hell for Eternity, no more chances. sorry!", "group_id": 9787, "id": 1226940}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306759462.0921111, "message": "@LintonCaldecott Yes, but hell does not allow people to return....once you're there that's the end....or so we are taught", "group_id": 9787, "id": 1226767}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306759591.415637, "message": "I understand the Agape love to be pretty much as you described it, combining the ransom and satisfaction doctrines magically for now (because scripture has both pictures there) there is a break, the loving God knows that he has to fix it, that no one else can fix it. So he fixes it. He fixes it so that we have no excuse not to come, it's not too hard or too complicated. He does all the work and tries to show that he has done all the work. His call continues, his call or his romancing... however you might describe it. We know that there is a choice now, the narrow gate with the narrow way, and the broad gate and way that lead to destruction (leaving out for now what that means exactly). Anthropomorphising God's attributes, or using OUR love as a picture for His love is dangerous, cause we are horribly broken and all but if we take an ideal parent with a rebellious child, the parent knows that if he chases the child, flogs him back home and then locks him in a room to stop him from making bad decisions that it will not work. He has to come to the realisation that he is on the path to destruction and must choose to change before it is too late.", "group_id": 9787, "id": 1226788}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306759707.523746, "message": "my picture of Agape love leans heavily on the idea that we have free will.", "group_id": 9787, "id": 1226810}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306759059.194231, "message": "The loving father doesn't force the son to come home, but allows him to do so, if he chooses to return.", "group_id": 9787, "id": 1226712}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306759751.3785961, "message": "i guess for me, free will is a subset of Agape, without it the whole concept of Agape love disappears.", "group_id": 9787, "id": 1226817}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306760547.639318, "message": "@LintonCaldecott I don't have an issue with any of that. I struggle with the 'eternity in hell' idea....no more chance of redemption. 3 strikes and you're out. I can't fit that into the picture of a loving God", "group_id": 9787, "id": 1226928}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761084.0105939, "message": "It's not like scripture doesn't speak about eternal torment...", "group_id": 9787, "id": 1226964}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306760653.2049799, "message": "especially when you consider the hard-line view that everyone who doesn't believe in Jesus goes to hell, doesn't matter if you even heard about Him", "group_id": 9787, "id": 1226937}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761217.7833791, "message": "annihilation", "group_id": 9787, "id": 1226995}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306760997.760807, "message": "We have reports of miraculous conversions to Christianity from people who have no contact with missionaries... Scripture speaks to the idea that all know that there is a God, that it is a given... That the ones that seek him, will find him. So, perhaps the ones that come to some point realise that on their own they are lost, that they are totally at the mercy of God's grace. Seemed to work for pretty much every godly figure in the old testament.", "group_id": 9787, "id": 1226955}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761056.666503, "message": "I wonder if there is a legal requirement to say the NAME Jesus, or whether there should just be a surrender. On my own strength I am doomed... kind of thing.", "group_id": 9787, "id": 1226962}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761161.68449, "message": "He's not just love, he is justice.", "group_id": 9787, "id": 1226976}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306760843.7594349, "message": "We are made in God's image, the way we relate to others is an image of the way God relates to us, only our relation is imperfect... perhaps incomplete. We have the concept of justice because God is Just, we can love because God is love... etc. \nOur picture of the attributes of God comes from scripture, but we relate to it because we have those attributes. Our picture of Love must in some way mirror the way God loves... When people say they cannot love a God like that is that a broken definition of Love? Why do we suddenly love so radially differently to the way God does? Or do we just not have a clear comprehension of the issue?\n\nI think it's a comprehension issue, for the most part. Eternity in hell is a consequence, it's clearly spelled out. Trust in Christ because without him you have no perfection, you cannot enter God's presence without Christ's protection, basically. The numerous encounters people had with just angels attests to the scaryness of God. A full revelation of his presence would crush us, some say because of our own imperfection. QueryNote; Adam didn't seem to have this problem? Moses being facedown on the mountain even had to veil his face when he came down.\n\nAgape is God's attempt to address the situation, that we might have unbroken fellowship with him?", "group_id": 9787, "id": 1226948}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761479.8356459, "message": "What if hell is a process of purification?", "group_id": 9787, "id": 1227040}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761006.974704, "message": "I think part of the issue is that we don't understand what hell is", "group_id": 9787, "id": 1226957}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306762529.9652441, "message": "That contrasts life with punishment, both being eternal", "group_id": 9787, "id": 1227239}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761094.065177, "message": "@LintonCaldecott All of your rhetoric still hasn't helped me deal with the issue of an 'eternity in hell' and God can allow that", "group_id": 9787, "id": 1226967}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761919.4663639, "message": "The point is, many (most?) feared hell, but probably also found some Love there and turned... The ones being tortured without rest day and night would only turn to get out of the pain. Trials on earth are a purification process, we suffer and learn and grow. But our suffering is not eternal, we have periods to learn from our hardship.", "group_id": 9787, "id": 1227127}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761996.494622, "message": "Interestingly our Minister preached (well...it was more a discussion) on this on Sunday night, after I posted this topic. Scripture really doesn't have a very well defined picture of hell. OT has none at all, just Sheol, which was the place where all souls went (good or bad). The in NT we find the reference to hades (straight from greek mythology) which is a place for the sould of the dead (again it's not good or bad distinction). Finally in 7 verses is referred to Gehenna, the place of fire.", "group_id": 9787, "id": 1227150}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761200.8228099, "message": "well, there could just be annihalation, instead of eternal torment", "group_id": 9787, "id": 1226991}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306762755.6443701, "message": "Matt 19:16—\"And someone came to Him and said, 'Teacher, what good thing shall I do that I may obtain eternal life?'\"\nMatt 19:29-30—\"And everyone who has left houses or brothers or sisters or father or mother or children or farms for My name's sake, will receive many times as much, and will inherit eternal life.\"\nMatt 25:46—\"These will go away into eternal punishment, but the righteous into eternal life.\"\nJohn 3:16—\"For God so loved the world that He gave His only begotten Son, that whoever believes in Him shall not perish, but have eternal life.\"\nJohn 3:36—\"He who believes in the Son has eternal life; but he who does not obey the Son will not see life, but the wrath of God abides on him.\"\nJohn 4:14—\"...but whoever drinks of the water that I will give him shall never thirst; but the water that I will give him will become in him a well of water springing up to eternal life.\"\nJohn 5:24—\"Truly, truly, I say to you, he who hears My word, and believes Him who sent Me, has eternal life, and does not come into judgment, but has passed out of death into life.\"\nJohn 6:40—\"For this is the will of My Father, that everyone who beholds the Son and believes in Him will have eternal life, and I Myself will raise him up on the last day.\"\nJohn 6:47—\"Truly, truly, I say to you, he who believes has eternal life.\"\nJohn 6:54—\"He who eats My flesh and drinks My blood has eternal life, and I will raise him up on the last day.\"\nJohn 6:68—\"and Simon Peter answered Him, 'Lord, to whom shall we go? You have words of eternal life.'\"\nJohn 10:28—\"and I give eternal life to them, and they will never perish; and no one will snatch them out of My hand.\"\nRom 5:21—\"so that, as sin reigned in death, even so grace would reign through righteousness to eternal life through Jesus Christ our Lord.\"\nRom 6:23—\"For the wages of sin is death, but the gift of God is eternal life in Christ Jesus our Lord.\"\nGal 6:8—\"For the one who sows to his own flesh will from the flesh reap corruption, but the one who sows to the Spirit will from the Spirit reap eternal life.\"\nTitus 3:7—\"so that being justified by His grace we would be made heirs according to the hope of eternal life.\"\n1 John 3:15—\"Everyone who hates his brother is a murderer; and you know that no murderer has eternal life abiding in him.\"\n1 John 5:11—\"And the testimony is this, that God has given us eternal life, and this life is in His Son.\"\nRom 2:6-7—\"[God] will render to each person according to his deeds: to those who by perseverance in doing good seek for glory and honor and immortality, eternal life...\"\n1 Cor 15:53—\"For this perishable must put on the imperishable, and this mortal must put on immortality.\"\n1 Tim 6:15-16—\"He who is the blessed and only Sovereign, the King of kings and Lord of lords, who alone possesses immortality...\"\n", "group_id": 9787, "id": 1227286}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761791.0249619, "message": "@pevans_om As I said, that's probably a component of many peoples conversion. I don't know if it is the whole.", "group_id": 9787, "id": 1227109}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761778.8275771, "message": "The last century whole denominations were focussed on hell and damnation preaching", "group_id": 9787, "id": 1227107}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761740.9647801, "message": "How many people have turned to Jesus out of the fear of hell? Many lots I'd guess", "group_id": 9787, "id": 1227098}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761587.485811, "message": "Revelation 14:9-14 talks about those being tormented, and the smoke of their torment will rise forever and ever, and they will receive no rest day or night. \n\nOk, now some metaphysics? Jesus went and we received his spirit? God is omnipresent, does that mean all 3 beings are identical, Jesus the physically risen one is omnipresent? He will watch this torture for eternity? Maybe that indicates that it is not an eternal punishment, but an annihilation.", "group_id": 9787, "id": 1227063}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306761637.2085099, "message": "\"But I will show you whom you should fear: Fear him who, after your body has been killed, has authority to throw you into hell. Yes, I tell you, fear him.\" Luke 12:5\nThis hell being referred to is Gehenna, which references a valley in Jesus time where garbage was burned", "group_id": 9787, "id": 1227072}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761757.1576631, "message": "@pevans_om So, fear the one that can throw your spiritual *something* onto the garbage heap?", "group_id": 9787, "id": 1227099}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306762707.722682, "message": "Their eternal punishment would be death. Death is for eternity, as is life", "group_id": 9787, "id": 1227278}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306762728.951226, "message": "being dead is pretty hard to bounce back from... I only know of one person that has done it so far.", "group_id": 9787, "id": 1227282}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761697.6606779, "message": "Those that are tortured rarely come to love their pain benefactors. They might bow to Christ, but only to escape their current painful predicament. That creates the idea that we can't come to Jesus just to escape the flames... But maybe that is true, surely part of it is escaping the fire, but part of it is also because we Love God.", "group_id": 9787, "id": 1227085}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306763669.626399, "message": "@pevans_om \"\nOf course, the idea that someone could escape hell must then equally be supported by the idea that someone can fall from heaven\" \n\nWhy? If hell is a process of refining, then once refined you get to go to heaven. It's not necessary to reverse the process... You just have balancing the equation as an axiom", "group_id": 9787, "id": 1227413}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306762514.8856289, "message": "\"Then they will go away to eternal punishment, but the righteous to eternal life.\" matt 25:46", "group_id": 9787, "id": 1227237}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306763350.792922, "message": "eternal punishment = death would then support annihilation sort of", "group_id": 9787, "id": 1227367}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306761932.4181509, "message": "I can't see a case for hell being a purification ritual.", "group_id": 9787, "id": 1227131}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306762793.8749361, "message": "that is a quick look for the words 'eternal life'.", "group_id": 9787, "id": 1227293}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306762422.851254, "message": "I, like CS Lewis, struggle with the idea that instant perfection awaits me on death. Along with that comes the struggle that anyone who dies without Christ is forever lost", "group_id": 9787, "id": 1227218}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306762392.8045011, "message": "ALSO, tied into this discussion of hell, rather than love, is the idea of Eternal Life. \nIf hell is eternal, then what are the beings there? We define life as... what exactly? \nThe wages of sin is Death, but the gift of God is eternal life. Great. Adam and eve will \nsurely die if they eat the fruit, from which we get the idea that nothing died before \nAdam's sin... great. All the passages talking of attaining eternal life, what does that \nmean if everyone has eternal life, only some have it in a bad place? Wouldn't scripture \nread something like \"The wages of sin is eternal torment in hell, but the gift of God is \neternal paradise\"?", "group_id": 9787, "id": 1227211}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306763443.523077, "message": "Jesus has that power...no reason why he can't still have it for eternity", "group_id": 9787, "id": 1227376}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306763477.4513559, "message": "Of course, the idea that someone could escape hell must then equally be supported by the idea that someone can fall from heaven", "group_id": 9787, "id": 1227383}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306764930.7776871, "message": "So angels enjoy more privilege than humans for eternity?", "group_id": 9787, "id": 1227568}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766148.703737, "message": "but there is some, which makes it interesting", "group_id": 9787, "id": 1227806}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306765907.486109, "message": "The thing with annihilation is that then the Atheists have a valid case to never come to salvation as they want to live now, enjoy what they have and then call it quits. No problem. Once dead they are gone. Happiness.\n\nSo what do we say as Christians, if you wanna live forever in a place we have no idea what we're gonna do (some will say sing praises to God) then accept Jesus as Lord and Saviour. If you wanna call it quits then don't worry. You'll be annihilated and you'll never know.\n\nDoes not seem to me what the Bible is teaching?", "group_id": 9787, "id": 1227765}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306763381.3914061, "message": "Lazarus bounced back from death, and jairus' daughter and....", "group_id": 9787, "id": 1227372}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306763471.0835149, "message": "Jesus bounced them, it's not like they decided to just come back themselves", "group_id": 9787, "id": 1227380}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306763533.32442, "message": "ALSO! we have some people going up to heaven physically, right? So... we are required to get this physical body when we go to heaven, unless it's just the 3 of them up there with physical bodies? The rest of us just kind of... leak ectoplasm on the furniture.", "group_id": 9787, "id": 1227394}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766367.3124571, "message": "@LintonCaldecott How much is enough scriptural reference?", "group_id": 9787, "id": 1227847}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306764441.732476, "message": "lucifer wasn't human, it's not a pattern we can work from.", "group_id": 9787, "id": 1227509}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306764050.125246, "message": "Well, we are told that Lucifer fell from heaven. So there remains the possibility. It boils down to choice. Does our freedom to choose end at death?", "group_id": 9787, "id": 1227455}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306765174.4627011, "message": "@pevans_om Scripture reports this one time event, and then goes on to say that the participants in this one time event will also be cast into the lake of fire... that is lucifer and all his cronies as another one time event. It doesn't suggest that this is a pattern, or that this will happen again.", "group_id": 9787, "id": 1227602}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306765757.026871, "message": "Wow, seems I have missed a lot. Been a day of meetings :(", "group_id": 9787, "id": 1227732}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766794.5055051, "message": "\"46  \"These will go away into eternal punishment, but the righteous into eternal life.\"\" Matthew 25:46", "group_id": 9787, "id": 1227921}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306765947.901953, "message": "@LintonCaldecott Why not? If it can happen once, can't it happen again?", "group_id": 9787, "id": 1227773}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766140.4304171, "message": "lots of reference to eternal life, not so much eternal punishment.", "group_id": 9787, "id": 1227804}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766117.6041069, "message": "It doesn't? I don't see a very clear picture in the bible that hell is a place of ETERNAL PUNISHMENT!", "group_id": 9787, "id": 1227799}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306766126.688879, "message": "@penkin And a bit of free choice in there too", "group_id": 9787, "id": 1227802}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766265.6628489, "message": "@pevans_om yah, that's the thing... New heaven and a New earth, perfect, like an eternal Garden of Eden... New bodies with no disease, sin or death.", "group_id": 9787, "id": 1227831}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766036.95766, "message": "@pevans_om I don't think we have. You have been tackling how Hell can be in the love of God and the possibilities of what Hell is?", "group_id": 9787, "id": 1227792}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766198.06213, "message": "What i like to see here is all the new faces! So glad you could join us and include your valuable and interesting opinions!", "group_id": 9787, "id": 1227816}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306767393.9661419, "message": "I don't see the need to reconcile love with consequences...", "group_id": 9787, "id": 1228029}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766413.941474, "message": "@penkin Go banana's. Post as much as you can find here.", "group_id": 9787, "id": 1227853}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306765965.4054899, "message": "@penkin We've wandered totally off topic now", "group_id": 9787, "id": 1227775}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306766189.269979, "message": "In terms of eternity there is scriptural evidence that the earth will be restored", "group_id": 9787, "id": 1227813}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306766634.7999129, "message": "Eternal destruction.......annihilationism again", "group_id": 9787, "id": 1227892}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766741.8227, "message": "\"10  he also will drink of the wine of the wrath of God, which is mixed in full strength in the cup of His anger; and he will be tormented with fire and brimstone in the presence of the holy angels and in the presence of the Lamb.11  \"And the smoke of their torment goes up forever and ever; they have no rest day and night, those who worship the beast and his image, and whoever receives the mark of his name.\"\" Revelation 14:10", "group_id": 9787, "id": 1227912}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306766334.8009861, "message": "http://en.wikipedia.org/wiki/Seven_Heavens", "group_id": 9787, "id": 1227840}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306767631.5287709, "message": "For me though... no matter who you are or what you've done, Hell is terrible.", "group_id": 9787, "id": 1228090}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306766344.8956101, "message": "There's an interesting bit to add more confusion", "group_id": 9787, "id": 1227842}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766554.2449219, "message": "\"7  and to give relief to you who are afflicted and to us as well when the Lord Jesus will be revealed from heaven with His mighty angels in flaming fire,8  dealing out retribution to those who do not know God and to those who do not obey the gospel of our Lord Jesus.9  These will pay the penalty of eternal destruction, away from the presence of the Lord and from the glory of His power,\" 2 Thessalonians 1:7", "group_id": 9787, "id": 1227870}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766554.791626, "message": "Gehenna\nIn the OT the word for hell is 'ge-hinnom', meaning \"Valley of Hinnom.\"  It was a place to the southwest of Jerusalem.  This place was once \"called 'Topheth' and derived from an Aramaic word meaning 'fireplace.'  It was here that some pagan kings practiced human sacrifice by fire (2 Chron. 28:3; 33:6; Jer. 7:31; 32:35).1 This is probably why in the NT the word came to be associated with destruction by fire.  The word 'gehenna' is found in the NT 12 times and every instance is spoken of by Jesus. In the NT, \"gehenna\" is used of a condition and never of a place.", "group_id": 9787, "id": 1227871}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766617.4378109, "message": "Eternal destruction... that doesn't mean eternally being punished.", "group_id": 9787, "id": 1227890}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766828.9086499, "message": "\"8  \"If your hand or your foot causes you to stumble, cut it off and throw it from you; it is better for you to enter life crippled or lame, than to have two hands or two feet and be cast into the eternal fire.\" Matthew  18:8", "group_id": 9787, "id": 1227931}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766839.544364, "message": "You need to read the rest of the conversation", "group_id": 9787, "id": 1227935}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766865.924453, "message": "Hell is an eternal place, doesn't imply that the torture goes on forever.", "group_id": 9787, "id": 1227943}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306766921.569119, "message": "So it's an unquenchable fire for no reason?", "group_id": 9787, "id": 1227953}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306767080.335798, "message": "@pevans_om God's need for Justice?", "group_id": 9787, "id": 1227987}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306767635.0454049, "message": "Ok, assuming eternal punishment. God is perfect and eternal, sinning against that eternal perfection invites eternal punishment. It's maybe a picture of who exactly we are sinning against.", "group_id": 9787, "id": 1228093}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306767704.1602299, "message": "LOVE WINS!", "group_id": 9787, "id": 1228104}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306768572.738642, "message": "@LintonCaldecott If I slap you, I get my ass kicked. If I slap President Zuma, I go to jail.\n\nI think you're right. There is a sense of who the offence is against. Maybe we also do not fully understand the gravity of sin in light of the greatness of God, creator of everything we know?", "group_id": 9787, "id": 1228226}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766946.295537, "message": "fire and brimstone in the presence of the holy angels and in the presence of the Lamb.11 \"And the smoke of their torment goes up forever and ever; they have no rest day and night, those who worship the beast and his image, and whoever receives the mark of his name\n\nSo, Jesus' full time job for eternity is to be present at the eternal suffering and torture?", "group_id": 9787, "id": 1227959}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306766973.220612, "message": "how do you autowrap the text when you copy paste something?", "group_id": 9787, "id": 1227968}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306767002.8595901, "message": "@LintonCaldecott cant'?", "group_id": 9787, "id": 1227973}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306767014.4154911, "message": "A moment, if you will. The issue isn't about hell or punishment....not exactly.....it is about Love. And how our Loving creator who Agape's us unconditionally can allow a situation where eventually you will be either with him or suffer eternal torment. How can this Loving creator of ours allow His creation to suffer for ever? I do not doubt that there are consequences to sin. But how do we reconcile this apparent behaviour with the god of Love?", "group_id": 9787, "id": 1227975}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306767430.038902, "message": "@LintonCaldecott even consequences that are eternal....all other consequences are transient", "group_id": 9787, "id": 1228039}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306767433.6293499, "message": "?", "group_id": 9787, "id": 1228042}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306767592.2381811, "message": "@pevans_om I've heard though, some people make a case that hell is not the same for everyone? I need to go and find the verses they use though. I don't know the case they make. So like Hitler will have a different Hell punishment experience to Gandhi?", "group_id": 9787, "id": 1228075}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306767701.775146, "message": "There IS a way to not invite this consequence that we all deserve, accept that way and you receive God's mercy, otherwise you do not. Justice meets Love and finds a way!", "group_id": 9787, "id": 1228103}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306770188.258131, "message": "Having witnessed to quite a few Muslims I can vouch for how blinded they are, deceived, indoctrinated. This all as a consequence of their upbringing, birth-place and environment. Some are able to break out and we give God the glory, but if some, why not all? So many of them are not rejecting God out of any force of will themselves, much like so many people are indoctrinated as Christians. Brain washing it's called and the world is good at it. Sure we must take responsibility for our choices, but why is the choice for them so hard?", "group_id": 9787, "id": 1228462}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306770219.1375389, "message": "I don't know if I'm getting the idea of my thoughts across here. I just see so many lost people that don't really seem to have the choice we imagine them to have...", "group_id": 9787, "id": 1228468}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306770453.5363779, "message": "The trite answer is that God can call them out of it - and does, but why one and not the other? And now we border on predestination... :/", "group_id": 9787, "id": 1228517}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306770551.7417381, "message": "am I making sense yet?", "group_id": 9787, "id": 1228534}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306770544.815387, "message": "See, the point is that, unlike atheists, many of the worlds lost are actually brainwashed. They can't imagine a different way to what they've been taught", "group_id": 9787, "id": 1228532}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306771031.8450339, "message": "It's unfair that Christians are going to heaven. It's fair that the rest are going to hell. If that makes sense?", "group_id": 9787, "id": 1228613}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306770998.030652, "message": "We all deserve hell though. So the unfair is more on the side of the people being pardoned.", "group_id": 9787, "id": 1228605}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306771663.150754, "message": "that's a lot of guess work mixed in with some personal suspicions", "group_id": 9787, "id": 1228671}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306770955.9437771, "message": "yes, quite. the problem is not what God does with those that have heard, but the ignorant.", "group_id": 9787, "id": 1228596}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306771371.297267, "message": "And so I wonder if the catholic system of purgatory doesn't actually have some merit....", "group_id": 9787, "id": 1228644}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306771471.5157609, "message": "@pevans_om I don't know enough about it to comment :(", "group_id": 9787, "id": 1228657}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306771642.7524791, "message": "@penkin I'm a little hazy on the details myself, but I gather it relates somewhat to the idea of sheol as described in the OT. A place where all souls go after death. There you face your punishment for sin. They believe you can actually pray for people in purgatory to help lessen the punishment - appease God? Anyway, the sense is of terrible torment, that will end. Better to follow Jesus than suffer in the fires of Gehenna. Jesus steps in and you are cover so no punishment", "group_id": 9787, "id": 1228668}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306778309.4120171, "message": "@pevans_om Only issue is though is we read about the destruction? Does not seem to fit?", "group_id": 9787, "id": 1229528}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306783134.0531321, "message": "When we were younger it seemed so obvious that people who don't believe go to hell...then you meet those people and suddenly it all starts becoming complex. We may need faith like a child, but people are complex - God knows this I think, since He made us this way.", "group_id": 9787, "id": 1230091}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306781612.831923, "message": "There is confusion, because the story of lazarus and the rich man (king?) the guy asks abraham if he can get some water to wet his lips, abraham says it's unpossible... but in OT good old Saul raises the spirit of Samuel... which gets him into all kinds of hot water.", "group_id": 9787, "id": 1229965}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306808096.4264629, "message": "@pevans_om I still believe that people that don't believe in the saving grace of Jesus will go to hell. The Bible is clear on that. \n\nWhat is difficult for me is what seems so clear to me seems so absurd to others. They fight against it. Kicking and screaming.\n\nI'm also fully aware that I don't get God fully. How He works things out but He's definitely on top of things. God its mighty to save. His word does not return without accomplishing what it desires.", "group_id": 9787, "id": 1233816}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306808497.9126389, "message": "@pevans_om I don't mean that callously. I'm concerned for them otherwise I would not talk to them about it.", "group_id": 9787, "id": 1233826}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306817089.5452089, "message": "@penkin Do you think that someone can come to the realisation that they require help, without hearing about Jesus?", "group_id": 9787, "id": 1234463}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306817402.618454, "message": "dude, the classical case of Grog and his family in the jungles of Ansalon... gets to thinking about the nature of God, what God must be like... realises he's in trouble.", "group_id": 9787, "id": 1234516}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306817908.9725101, "message": "@LintonCaldecott in that case... yes. I believe God can make a plan for whom ever He desires to make a plan for. I rate they will come to a full knowledge. There are recorded cases of this already.", "group_id": 9787, "id": 1234596}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306817323.3448069, "message": "@LintonCaldecott Define hearing about Jesus? I have not read a lot of CS Lewis but it seems from what I have heard that he had desires for more. For help. Not sure though if he knew about Jesus at the time.\n\nCan Jesus come to someone and tell them they need Him? No \"human\" intervention? Is that hearing about Jesus?", "group_id": 9787, "id": 1234504}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306835143.5236399, "message": "@penkin Nope. I've never claimed to be able to explain anything here. mostly I've asked questions and suggested that maybe we're looking at things wrong. I have no understanding of how to resolve the discrepancies, but I cannot ignore that they exist (which is how so many seem to approach these things)", "group_id": 9787, "id": 1236323}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306835725.914314, "message": "@penkin I think you've misunderstood the fence metaphor. You said: 'What is difficult for me is what seems so clear to me seems so absurd to others. They fight against it. Kicking and screaming.' I'm one of those who tends to kick and scream against things. Thus I'm on the other side of the fence from you. I'm unwilling to just accept the indoctrination I've received as, say a methodist, without first putting it through the wringer....and then putting THAT through the wringer too and when I'm getting to think I've figured it all out I put THAT through the wringer too.", "group_id": 9787, "id": 1236383}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306835607.814517, "message": "@pevans_om I don't think God minds fist shaking at all. That is not my issue. You created this topic. And when I asked you to start you did not want to. You wanted other people to start cause you did not want \"my idea critiqued\"? Why? We are possibly all wrong. We can only search the scriptures, pray and hope we do well in God's eyes.", "group_id": 9787, "id": 1236365}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306833521.389102, "message": "@penkin So we return to concept that God chooses some and not others", "group_id": 9787, "id": 1236183}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306833522.770431, "message": "Does He love them the same? The chosen and unchosen? How can He love them the same if He chooses some but not others?", "group_id": 9787, "id": 1236186}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306833627.3426571, "message": "@penkin I sit on the opposite side of the fence. I can't understand how people accept things so easily when there seems obvious conflict.", "group_id": 9787, "id": 1236195}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306834894.679903, "message": "@pevans_om Explain to me how your \"side of the fence\" solves the issue?", "group_id": 9787, "id": 1236298}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306835850.44526, "message": "I want to hear how other people reconcile the Loving God with eternal damnation and hell", "group_id": 9787, "id": 1236397}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306835847.6488171, "message": "@pevans_om I was referring to my chats with Atheists that cannot see the Truth I see in creation of a creator, that cannot see any evidence of any design.", "group_id": 9787, "id": 1236396}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306836282.7603359, "message": "@pevans_om Maybe we should take this a step at a time. What is your main complaint against how you see things now?", "group_id": 9787, "id": 1236442}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306834878.158814, "message": "@pevans_om Ok so now you're saying you have this awesome understanding that solves this problem and cannot understand how people can be so foolish to \"JUST\" accept this without any thinking? You say the most incredible things?", "group_id": 9787, "id": 1236297}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306836621.44575, "message": "@LintonCaldecott You cannot quote the Bible as a whole. You need to be able to show that the Bible says certain things and then check the context. Fits. Ok, lets see how this fits into the theme of it all?", "group_id": 9787, "id": 1236491}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306835289.480267, "message": "I can't agree with a 'No hell' concept, but equally I struggle with the eternal damnation of souls. Now maybe I'm just a little flea shaking my fist at God over this and in the end I just have to accept it..... or maybe our doctrine is skew..... I'll happily shake my fist at God if it allows clearer thinking on our doctrine. (And I don't think God minds a bit of fist shaking!)", "group_id": 9787, "id": 1236342}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306836416.3254249, "message": "Healthy.", "group_id": 9787, "id": 1236460}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306835415.4278791, "message": "@pevans_om So why bring up anything about a fence and how everyone on that side is wrong and so accepting of things that makes no sense in light of such a conflict. Stand somewhere and make statements instead of telling everyone everything is wrong. That they do not seem to think through anything. Give scripture and make some assertions. If the reformed view is so wrong, then tell me what you think is right.\n\nWhen you use language like \"that side of the fence is wrong\" I can only assume that the other side must be right? How do I take your statements and get to... \"Nope. I've never claimed to be able to explain anything here.\"", "group_id": 9787, "id": 1236350}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306836165.588659, "message": "@pevans_om Question is, how much have any of us looked at this? What scripture do you point to for you ideas or is this all subject to how we feel? I don't like how God is running the show so I don't want to read scripture about Him hating people. I don't want to see scripture saying that as a natural man I cannot choose Him. I'm important. I have free will. They don't line up with any of the nice sounding cloud hopping scriptures.\n\nWe cannot be that subjective. We need to see how it all fits together. And like I said before we then need to do the best we can by that.", "group_id": 9787, "id": 1236432}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306835807.2780199, "message": "@penkin As far as the idea critiquing.....I wanted to hear fresh input. Yes I have my own ideas, but my ideas are so hazy right now that I wanted to hear if anyone else could offer better clarity - I mean....have your READ through my thoughts on this....they're all over the place", "group_id": 9787, "id": 1236392}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306836533.828923, "message": "Difficult sometimes to just grab a couple proof texts and try to out scripture someone.", "group_id": 9787, "id": 1236476}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306836584.701956, "message": "@penkin It's a mixture. On one side what I've been taught in church over the years. On the other side scriptures that conflict with those teachings. Some of the scriptures re hell and eternal damnation have been posted. But you provide another example. We're taught over and over that God loves everyone yet then we have Psalm 11, for example, \n\"5 The LORD examines the righteous, \n   but the wicked, those who love violence, \n   he hates with a passion.\"\nWhoa, and it then goes on to describe ho God rains down fiery coals and burning sulphur on the wicked.....Not exactly loving.\n\nSomething doesn't add up. (That's one example)", "group_id": 9787, "id": 1236482}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838350.725647, "message": "The doctrine of Paul", "group_id": 9787, "id": 1236692}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838362.069206, "message": "Anything else is just mist", "group_id": 9787, "id": 1236693}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306836424.374862, "message": "Well, I think it is.", "group_id": 9787, "id": 1236461}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306837153.4347379, "message": "@penkin I think the one problem with your desire re these discussions is that much of what we are raising has been debated by the church for centuries.....and there are still no definite answers....at some point (and I get here a lot these days) we have to accept that God remains beyond our understanding. Many of His ways are a mystery and will remain so.\n\nI still enjoying thrashing it out though! :)", "group_id": 9787, "id": 1236562}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306836412.447139, "message": "people frown on the idea of systematic theologies for a few reasons, one reason is that the bible speaks of God's interaction throughout our history, and to separate and compartmentalise things into neat lines is often wrong. The different doctrines and theologies are all interconnected. So, if you are a calvinist reformer, or borderline calvinist, then there is no conflict with eternal damnation and torture and the idea of a loving God. Most will just get to a certain point and throw up their hands in defeat... citing that God must just sort it all out and we don't understand the big picture. Some want to go further. The point of these conversations, at least for me, is to not clearly define what I believe or don't believe and set up a fortress watching as the enemies arguments shatter uselessly on my walls of presupposition and assumption. I do state what I think sometimes, but a lot of what I think and believe in terms of doctrine is imperfect, I don't have the answers to the questions even I can see in my theological constructs... so I often pose them for myself.", "group_id": 9787, "id": 1236458}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306836708.3143899, "message": "@pevans_om Ok, so the question then is, how can God \"be love\" and \"all loving\" and then hate people? If that's right, lets look into that?", "group_id": 9787, "id": 1236504}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306837023.0331681, "message": "Well, perhaps it's not the loving father at all.", "group_id": 9787, "id": 1236542}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306836517.4924159, "message": "The problem is also not just single individual scriptures, it's the whole flow of scripture, our understanding of the bible as a whole has huge momentum, the people that read scripture that prefer the idea of ransom atonement will find much in scripture to support it, not specific words perhaps, but themes and idea's etc.", "group_id": 9787, "id": 1236473}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306837712.4895091, "message": "@penkin Do not mistake taking a contrary position to being 'shot out of the water', especially with @LintonCaldecott. He likes to do that to make you think. I do too sometimes. :)\n\nI don't find simple answers anymore - and you seem to want simple answers - but the deeper I go with God the less simple it becomes. My current journey is one where I am discovering how much I DON'T understand. I am....unlearning....and finding that I can enjoy loving a God who is so much BIGGER and more un-understandable than ever", "group_id": 9787, "id": 1236633}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306837043.009748, "message": "Christians are children by adoption through Christ. Everyone else is just ... er, not?", "group_id": 9787, "id": 1236546}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306837103.887821, "message": "@LintonCaldecott Yeah. I have to constantly remember to SHIFT + ENTER :(", "group_id": 9787, "id": 1236557}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306837608.9323969, "message": "When there are 3 people typing and 2 are telling you you're an idiot for thinking that it might look blue, I resign and move on. I am too lazy to FIGHTFIGHTFIGHT!", "group_id": 9787, "id": 1236623}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306836934.2112579, "message": "@pevans_om We can see what others say. What the Bible says. Come to a conclusion? Either that or this is all useless? We can all just shout what we think and come to no conclusion. That is not what I want to do here. I want to read the Bible, see what it says. See if I understand right. Ask you guys questions on you understanding on the topic (via scripture) and see where we go.\n\nWe are all on the same side. Jesus is LORD! We love Him. We are saved by Him! He is Risen!\n\nNow let's reason with the tools we have.", "group_id": 9787, "id": 1236527}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306837132.0864379, "message": "@LintonCaldecott Should auto line feed when you enter and Ctrl + S for Send or something.", "group_id": 9787, "id": 1236560}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306836946.4216771, "message": "God also goes and chooses one nation to the exclusion of all others (in OT times). He supporters this nation, even requiring them to slaughter other nations, men, women, children and livestock and punished Israel when they don't. That doesn't fit the doctrine of a Loving God.\n\nSo what is the issue?\nEither I don't understand Love (Agape) - which is likely\nOr we're missing some parts of the puzzle\n\nSome valid points have been made here: I.e. that we need to consider the Holiness of God and the Justice of God, which is true, but I still come back to the mental image of a Loving father standing by watching His beloved creation suffer eternal torment for all eternity......that's a hard picture to fit into my brain.\n\nand maybe that's because my brain isn't big enough", "group_id": 9787, "id": 1236530}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306837011.690928, "message": "@pevans_om Your head is pretty small.", "group_id": 9787, "id": 1236540}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306837068.733001, "message": "(p.s. i hate the enter to post thing for convore... if it's multi line capable, then it should have a decent text input control)", "group_id": 9787, "id": 1236552}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306837424.4883211, "message": "@pevans_om I enjoy constructive \"thrashing\". I unfortunately still do not know my Bible well enough. I try though. I look a lot. I try see why there are both sides. See if there is merit.\n\nI tried that on the cessationist one but you guys sort of shot me out the water. There are a lot of people who are \"no gifts anymore\" people. But we were not allowed to look at the greek to see if it could bring something to the text. So I gave up. I may never know why they are so convinced now :P", "group_id": 9787, "id": 1236597}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306837502.178376, "message": "Don't be so easily shot out of the water! FIGHTFIGHTFIGHT!", "group_id": 9787, "id": 1236607}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306838975.5117941, "message": "@pevans_om I don't think anyone can really give a \"clinical scriptural analysis\" but what I want is... I don't believe in Hell because God is love like it says in Penkin 3:4 and if we check the context He is talking about how He never hates people ever cause...\n\nOr jeepers guys, this love thing is hectic. Cause we know God is a loving God but then He also seems to hate people. Let's see why He hates, when He hates. What are the influences. How do we tie that up with His love?\n\nMaybe cause He requires justice? Why does He no auto-save humanity? Why does it seem He hates some less? Love some more? How can we tie this up as best we can for now? In our understanding? In prayer?\n\nMaybe a crimes punishment is never decided with the time it takes to do the crime. Maybe Hell is eternal because of the gravity of the crime? Maybe I don't understand the greatness of God enough and maybe that's why I cannot understand the punishment? Maybe I don't understand how bad sin really is?\n\nAnother 2c self pity party by Penkin.", "group_id": 9787, "id": 1236733}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838305.908114, "message": "Coming back to that fence.....I don't know why anyone is totally convinced about very much to do with God and Scripture. Here's my list of what I am convinced of:\n\nThere is a God\nHe created everything and He is amazingly hugely incomprehensible\nWe sin\nGod made a plan to reconcile us to Him by sending Jesus who died and rose again\nGod sent His Spirit who does all sorts of neat things through us", "group_id": 9787, "id": 1236688}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838580.7026501, "message": "@penkin Right. Simple. Only...I can't provide any of that because it's a tangled mess of experience, teaching, scripture, emotion and probably more. Not a clinical scriptural analysis.", "group_id": 9787, "id": 1236718}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306839143.1112499, "message": "yeah....well...I thought we were doing that here....not as neatly, sure......but the cut and thrust of debate isn't going to be neat.\n\nI already picked out two key mentions from this topic that temper our understanding of the God of Love. \n1) He is also Just\n2) He is also Holy\n\nsee, we're learning", "group_id": 9787, "id": 1236744}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838343.3209119, "message": "oh and one last one\n\nWe must Love God & Love others as much as we Love ourselves", "group_id": 9787, "id": 1236691}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1306838459.67608, "message": "@pevans_om You both say that about each other. I think it's unhelpful personally.\n\nI don't think you're getting what I'm saying. Which means I suck at communication since I cannot get my point across. I am not looking for easy answers. I am also not going to just give ground on my current stance just because either of you don't think it's \"fair\" for God to send anyone to hell (just an example, not the actual issue).\n\nI want evidence of why you think what you think (assuming you state what you think). How you got there. Otherwise I cannot make an informed decision.", "group_id": 9787, "id": 1236712}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306838730.512815, "message": "sorry for being human", "group_id": 9787, "id": 1236725}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306839414.3448949, "message": "We have also raised a variety of scriptural evidence of hell and eternal damnation - although most of the hell references seem to leave much open to interpretation\nLinton added a bunch of references to eternal life and we raised the issue that eternal life is compared to eternal suffering\nAnd today I added Psalm 11 - although no one has attempted to explain this God of hate yet...", "group_id": 9787, "id": 1236757}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306839506.751709, "message": "So to continue my summary for new readers:\nHow can this God of Love send His creation He Loves to a place of eternal suffering?\nand new today\nHow can this God of Love, hate?", "group_id": 9787, "id": 1236762}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306840704.381623, "message": "Does God command what he can or will not do?\n\nA new command I give you: Love one another. As I have loved you, so you must love one another (John 13:34).\n\nBut I tell you who hear me: Love your enemies, do good to those who hate you, bless those who curse you, pray for those who mistreat you (Luke 6:27-28).\n\nBless those who persecute you; bless and do not curse (Romans 12:14).\n\nWe work hard with our own hands. When we are cursed, we bless; when we are persecuted, we endure it (1 Corinthians 4:12).\n\nAnd if you lend to those from whom you expect repayment, what credit is that to you? Even sinners lend to sinners, expecting to be repaid in full. 35 But love your enemies, do good to them, and lend to them without expecting to get anything back. Then your reward will be great, and you will be children of the Most High, because he is kind to the ungrateful and wicked. 36 Be merciful, just as your Father is merciful. (Luke 6:34-36\n\n\nDo not repay evil with evil or insult with insult, but with blessing, because to this you were called so that you may inherit a blessing (1 Peter 3:9).\n\nAnyone who claims to be in the light but hates his brother is still in the darkness. Whoever loves his brother lives in the light, and there is nothing in him to make him stumble (1 John 2:9-10).", "group_id": 9787, "id": 1236858}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306840852.7184539, "message": "and then...\nDo not repay anyone evil for evil. Be careful to do what is right in the eyes of everybody. If it is possible, as far as it depends on you, live at peace with everyone. Do not take revenge, my friends, but leave room for God's wrath, for it is written: \"It is mine to avenge; I will repay,\" says the Lord. On the contrary: \"If your enemy is hungry, feed him; if he is thirsty, give him something to drink. In doing this, you will heap burning coals on his head.\" Do not be overcome by evil, but overcome evil with good (Romans 12:17-21).", "group_id": 9787, "id": 1236863}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306842814.918498, "message": "God Loves all:\nJohn 3:16 (of course)\nRomans 5:8\nJohn 15:13 (although it could be said that He laid down His life for Christians only)\n1 John 3:16\n1 John 4:8\n\nA lot of this theology seems to come from John's view", "group_id": 9787, "id": 1236966}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306842889.3147869, "message": "God hates:\nLeviticus 20:23\nAnd ye shall not walk in the manners of the nation, which I cast out before you: for they committed all these things, and therefore I abhorred them.\nPsalm 5:5\nThe foolish shall not stand in thy sight: thou hatest all workers of iniquity.\nPsalm 11:5\nThe LORD trieth the righteous: but the wicked and him that loveth violence his soul hateth.\nProverbs 6:16, 19\nThese six things doth the LORD hate ... A false witness that speaketh lies, and he that soweth discord among brethren.\nHosea 9:15\nI hated them: for the wickedness of their doings.\nMalachi 1:3\nAnd I hated Esau, and laid his mountains and his heritage waste for the dragons of the wilderness.\nRomans 9:13\nAs it is written, Jacob have I loved, but Esau have I hated.\n\nWhat's interesting to me is that these are mostly OT with the exception of Romans where Paul is quoting what is probably an OT saying.\n\nWhat does this say to us?", "group_id": 9787, "id": 1236974}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306843068.2690859, "message": "new covenant is different to the old.", "group_id": 9787, "id": 1236983}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306843169.479104, "message": "http://www.gotquestions.org/does-God-love-everyone.html\nSums up our modern version of salvation with the appropriate scriptures.", "group_id": 9787, "id": 1236988}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306843379.126406, "message": "This piece (stupid enter button!)\n'God’s love for the world is manifested in the fact that He gives people the opportunity to repent' for me provides one solution to the problem. If this statement is true, then everyone who rejects God does so out of a conscious decision to do so after having been afforded every possible opportunity to repent.\n\nIt's drawn from 2 Peter 3:9\n\"The Lord is not slow in keeping his promise, as some understand slowness. Instead he is patient with you, not wanting anyone to perish, but everyone to come to repentance.\"\n\nThe only way I can accept a Loving Father God who would watch His creation suffer eternal torment is if those in torment have been given every possible proof of His existence and His Love and they still reject Him.", "group_id": 9787, "id": 1237006}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306843680.7228949, "message": "To add some weight to this is 1 Peter 3:18-20\n\"Christ suffered for our sins once for all time. He never sinned, but he died for sinners to bring you safely home to God. He suffered physical death, but he was raised to life in the Spirit.\n\n 19 So he went and preached to the spirits in prison—20 those who disobeyed God long ago when God waited patiently while Noah was building his boat. Only eight people were saved from drowning in that terrible flood.\"\n\nHere Peter seems to suggest that those who went before had an opportunity to hear from Jesus. Again it supports the theory that there may be a place for departed souls that is not the same as hell?", "group_id": 9787, "id": 1237022}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306843704.374151, "message": "@penkin Good enough yet or do you want more...?", "group_id": 9787, "id": 1237023}, {"user_id": 32900, "stars": [], "topic_id": 37241, "date_created": 1306857212.630908, "message": "I think I chased everyone away - must be my oderant", "group_id": 9787, "id": 1238406}, {"user_id": 32888, "stars": [], "topic_id": 37241, "date_created": 1306875292.271606, "message": "So, I picked up on the concept of the second death. The idea is found here; Revelation 2:11, 20:6, 20:14, 21:8. \nSo, there is a second death, what is it? I found some places that spoke of the second death in terms of the \nsecond life, first life was being physically born, second life is spiritually born, therefore death follows the \nsame pattern, just in reverse. Physical and then spiritual death. I don't know if I would agree or not with that\n idea. But what then is the second death? Ecclesiastes 9 says that the dead are without thought, 5For the living\n know that they will die, but(A) the dead know nothing, and they have no more reward, for(B) the memory of them \nis forgotten. If that's true, then there can't really be eternal torment because, well, I think you have to think\n something to be eternally tormented... for instance \"ow, this is really tormenting me\".\n\nFurther to this, the greek word translated or understood to mean eternal, isn't always used for eternity, it means\n pretty much \"age lasting\" It is used to describe both the long standing but temporal and the eternal. The word used\n in the septaguant (Greek translation of the original hebrew old testament) in Hebrew is Olam, it get's translated \nas aionios. When looking at how the greeks use the word Aionios extra biblically, they just never use it to denote \na sense of eternity (http://www.tentmaker.org/books/Aion_lim.html). So why would the seventy who translated the hebrew\nto greek translate the hebrew olam to mean eternal if that is not what the common usage of the word was understood to \nmean? This is true until it is applied to a subject that adds to the words intrinsic meaning, example, God.\n\nSome things to which the word Aion and its derivatives have been applied to which you can say have passed away. \n\n Now the Jews have lost their eternal excellency; Aaron and his sons have ceased from their priesthood; the Mosaic \nsystem is superseded by Christianity; the Jews no longer possess Canaan; David and his house have lost the throne \nof Israel; the Jewish temple is destroyed, and Jerusalem is wiped out as the holy city; the servants who were to \nbe bondmen forever are all free from their masters; Gehazi is cured of his leprosy; the stones are removed from \nJordan, and the smoke of Idumea no longer rises; the righteous do not posses the land promised them forever; \nsome of the hills and mountains have fallen, and the tooth of Time will one day gnaw the last of them into dust;\n the fire has expired from the Jewish altar; Jonah has escaped from his imprisonment; all these and numerous \nother eternal, everlasting things -- things that were to last forever, and to which the various aionian words \nare applied -- have now ended, and if these hundreds of instances must denote limited duration why should the \nfew times in which punishments are spoken of have any other meaning? \n\nIn the last third or so I took heavily from the url referenced above... but that was an interesting read for me, \neven if I did skim some of the material. \nI also pretty much got sidetracked from the idea of the second death except to link that idea of second death \nwith the idea of death and eternity in scripture, death being a state of no thought, no consciousness at \nall ... I'll return to that tomorrow I hope", "group_id": 9787, "id": 1241667}, {"user_id": 13817, "stars": [], "topic_id": 37241, "date_created": 1307025959.3071611, "message": "Wow, I missed a lot here.", "group_id": 9787, "id": 1267622}]