[{"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313432442.5339711, "message": "I want a way to keep the actors enthused about the dram theory, storyform, and storybuilding, while filming the improv scenes.", "group_id": 2515, "id": 1877455}, {"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313432154.0316341, "message": "During my acting classes, I am amazed at the charming dialogue and actions created by the actors during improvs.  I want to come up with the story, yet let the actors improv the dialogue.  That would be fun.", "group_id": 2515, "id": 1877431}, {"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313432987.291713, "message": "I guess I should emphasize one concept at a time.  However, it would be great if I could hand actors a dram breakdown of the story and let them run with it.  Maybe this would be a good tool to build up a troupe.  It is always such a dilemma figuring out how to make money in the arts, isn't it?  I wonder if the key is constant practice.", "group_id": 2515, "id": 1877572}, {"user_id": 7669, "stars": [], "topic_id": 43842, "date_created": 1313436632.338793, "message": "Hi Prish, good to see you here!  I don't know if you would want to bombard your actor friends with a bunch of Dramatica language if they're not already familiar with it.  But you could certainly use Dramatica to build up a story structure; in other words, design a sequence of scenes each in which something needs to happen--and characters need to evolve in certain ways--in order to advance the story toward the intended conclusion.  And then they can improv within that scene structure and story direction.  Does that make sense?  Basically I'm recommending that you do all the analysis work yourself, and then give them the results... the fun stuff!", "group_id": 2515, "id": 1877929}, {"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313470032.8823941, "message": "There is a group of us taking classes, who are signed up with a specific agent.  I got to thinking maybe I could do an embroidery exercise, then film our improv scenes.  The public library said I could have a crew of 5, including actors, in any part of the library that is empty of visitors, for scenes, also.  I am talking about using a small canon vixia hf200, no professional equipment.  Every acting class has me mulling over the wheel of human society, repeating what has happened before.  I wonder if the wandering players system (that drove Edmund Kean crazy, but I don't want to think about that <G>) and the Vaudeville system, and all the types of acting and writing that reached the masses, is coming to the fore, again.  With a tool like Dramatica, we should be able to crank out unlimited stories and entertain, since story is everything, right?  These are just dreams.", "group_id": 2515, "id": 1881211}, {"user_id": 38500, "stars": [], "topic_id": 43842, "date_created": 1313538105.095551, "message": "What about Dramatica for *Directors*?", "group_id": 2515, "id": 1887416}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313536326.6279099, "message": "My work with actors has sometimes been a surprising look at how actors look at a script. For one thing, they all tend to think they are the main character or protagonist -- and they should, since to them, their own characters wants and obstacles are the most important, and it's up to the director to combine things.\n\nSometimes, this is great. Sometimes, letting an actor know that her role is just to come in, say something comedic and get out is jarring to them, because they think they're more vital than that.\n\nSo, I'm not sure letting an actor know that they are just The Sidekick will pay off better than giving them a very specific goal to make sure their buddy always feels like someone has their back. It's probably very actor specific.", "group_id": 2515, "id": 1887245}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313536943.754931, "message": "There have always been a bunch of forms that actors fill in to create entertainment. Commedia dell'arte, Improv Games. \n\nI don't know how these could be \"resized\" to 90-120 minutes, but that would be another place to look for some sort of scaffolding.", "group_id": 2515, "id": 1887292}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313536075.5758691, "message": "So, I have a ton of thoughts and questions.\n\nHave you done anything like Storyform an improvised movie? (Or, play, but those are harder to find.) Ones that come to mind are essentially anything by Mike Leigh or Christopher Guest.\n\nI have no doubt that these are storyformable -- or as likely to be a GAS as any movie -- but an analysis might highlight where these movies put their weight -- into the themes, into the personal issues, into more complex characters, something.", "group_id": 2515, "id": 1887222}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313542414.462081, "message": "What's the difference?", "group_id": 2515, "id": 1887874}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313553643.750169, "message": "@MikeDerk But even if they are the sidekick, they are still 4 dimensional.  If a story is an analogy of a single mind trying to solve an inequity then each character(as a single mind) has their own inequity they are trying to solve. Each character has all 4 throughlines going on and each is either a do-er or a be-er and tend toward male mental sex or female mental sex.", "group_id": 2515, "id": 1889532}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313553831.2194271, "message": "ME THINKING OUT LOUD AGAIN:\nOK, for some reason this topic kept me awake most of the night and it occurred to me again to think of this from the perspective as an actor. The elements of a character make a 4 dimensional being. A character is not linear but but exists within a 3 dimensional linear world. So what I am saying is perhaps as a character moves forward within a story she has all these elements at her disposal (Internal and External or consciously or unconsciously) and they react to the given circumstances presented to them at the time. In my mind I see 4 tiers. Purposes on top and Motivations under that. Those two are a constant no matter where they are in the story. Then below Motivation is Methodology (or tactics) and below that is Evaluation. The Methods are constantly being Evaluated at any given moment in respect to how well the Methods are bringing her closer to her Purpose because of her Motivations, closer to her goal. \nI haven't explored yet the difference in Internal Elements and External Elements but here is an article that may help:\nhttp://dramaticapedia.com/2010/04/08/the-dramatica-structure-elements/\n\nbelow is an example of how I see character elements working:\nCasalbanca:\nIlsa (wife of Lazlo and one time lover of Rick\nPURPOSE: Desire, Change\nMOTIVATION: Consider, Feeling, Faith, Help\nMETHODOLOGY: Protection\nEVALUATION: Hunch, Test\n\nIlsa's goal or purpose is to acquire desire. \nAs defined by Dramatica, desire is the motivation toward something better. So Ilsa's purpose is not to acquire something better but it is to 'acquire the motivation toward something better. She doesn't care about anything anymore. Ilsa also has a goal or purpose toward Change. If Rick is a Change/start Character and a logical be-er than most likely Ilsa as the impact character is a steadfast/stop character who is an intuitive do-er. So her goal in the story is for Rick to change, to stop hating her. For Rick to care again. (maybe her goal of desire is for Rick not herself, after all she is the impact character.) \nIlsa's motivation or drive is to get Rick to consider the pros and cons (appeal to his logical thinking). Her intuition tells her and motivates her to get Rick to help her husband to America. Her feelings or emotional sense of how things are going. She is motivated in her faith(accepting something as certain without proof) that Rick still cares about people, that he still loves her and will help Lazlo for her sake. She is motivated by Help. She has to have Ricks help. He has the passport. He is the only one who can get them out of this country away from the Nazis.\nIlsa's methods or tactics to achieve her goals is protection (an effort to prevent interference with ones concerns.) In a strange way she does this by avoiding Rick's painful jabs at her character. If she sees his concerns as not wanting to be hurt by love again then maybe she protects him as long as she can by letting him be angry and hateful. She is also protecting her husband by using her connection, all-be-it a strained connection, with Rick to get Lazlo a passport to save his life.\n\nShe evaluates her efforts and her progress by her hunches or understandings based on insufficient circumstantial evidence. She also evaluates her progess by testing or trials to determine something validity. SO, she has a hunch Rick is not happy for disappearing on him in Paris after they proclaimed their love for each other and she is right, but she keeps testing to see if he still cares for her. She smiles, flirts, she gets hurt by Rick's remarks, she tells him the truth. She is testing to see if he is approachable. If she can get close to him again to tell him she loves him and she is sorry and to get his help.\n\nsee thread:\nhttp://forums.screenplay.com/viewtopic.php?f=21&t=4135", "group_id": 2515, "id": 1889562}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313556307.3177581, "message": "7. can you do the story embroidery without assigning main and impact characters?  Would it be more fun to let that happen organically?", "group_id": 2515, "id": 1889883}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313556159.2452769, "message": "@prish So I am really intrigued by this.  1. Use a story form. 2. Maybe you assign 8 actors. One for each archetype for now to keep it simple. 3. You all get together to do the story embroidery (leaving no story point blank). 4. Have each actor go through their 4 dimensions, being very clear on their Purposes, Motivations, Methodologies, and Evaluations and distinguishing internal elements from external elements. (Like the Ilsa example above) so that they have each of those tools available to them at all times.  and be strict, the sidekick is supportive no matter who he is with, etc. 5. Maybe you could use the 38 scenes from the step list and story points report so you would know what through-line you were working on and what elements were needed for each scene.  6. Maybe use only the actor/characters for each scene who posses the elements needed for that scene.\nand one last idea, i don't know how possible this is", "group_id": 2515, "id": 1889855}, {"user_id": 10814, "stars": [], "topic_id": 43842, "date_created": 1313595522.191741, "message": "It won't have much meaning for an audience without the personal side of the story, i.e. the MC throughline.  The MC won't be challenged without the IC throughline.  And don't forget that the emotional center of the story resides in the Relationship throughline.", "group_id": 2515, "id": 1893271}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313597168.505754, "message": "@sam_potter I agree that even a sidekick can have depth. My inclination is that working with an actor on their dimensions will be more effective than explaining their narrative role.", "group_id": 2515, "id": 1893450}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313608806.6585801, "message": "@Chris_Huntley You r right. A full embroidery couldn't be done without naming the MC & IC. I was thinking about the improv and wondering if it would b fun to let the MC & IC grow out of & b discovered out of the i", "group_id": 2515, "id": 1894748}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313610386.60817, "message": "Although when time is a factor, just give them a script.", "group_id": 2515, "id": 1894937}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313609257.7317941, "message": "(clumsy iPhone fingers) ... Out of the improv. But without a complete storyform probably not.  What if you had the MC & IC in the equation but not assigned to any archetype? So all the players who decided they were be-ers r possibly on one side of the equation and all the do-ers r possible candidates for the other side of the equation?", "group_id": 2515, "id": 1894800}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313609438.4312899, "message": "@MikeDerk I agree, Mike, much more effective to explore the dimensions (though not always efficient when time is a factor)", "group_id": 2515, "id": 1894818}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313610443.083473, "message": "Or, just give them all assignments to work on at home, and then release them on stage for one big long improv and transcribe it all. \n\nThere's a play called 'The Question' (I think) that did this.", "group_id": 2515, "id": 1894941}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313681289.8806109, "message": "Different main characters with the same Problem, but different character traits?", "group_id": 2515, "id": 1902346}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313685899.7249291, "message": "I was thinking one time through with protagonist as MC, another time through with sidekick as MC, etc. And yes keep the overall story the same. I guess the IC would change as well.", "group_id": 2515, "id": 1902817}, {"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313687618.512985, "message": "Wow, just checking in in -- I've been in the middle of a house emergency.  These responses take me to a whole other level.  Have to run and clean the house before the guy comes to change out our light switches, so the mother in the other duplex doesn't freak out that he came into our usual whirlwind of clothes and thingies and dust and dog hair.  more later today", "group_id": 2515, "id": 1903050}, {"user_id": 7645, "stars": [], "topic_id": 43842, "date_created": 1313692916.9411139, "message": "I've created a new Convore group - Experimental Dramatica - where conversations like this can continue. If you are interested in further discussing variations of the theory, or its use in other applications besides the creation or analysis of story, that would be the place to go. The link is https://convore.com/experimental-dramatica/", "group_id": 2515, "id": 1903705}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313705519.8547771, "message": "If we spirits have offended, think but this and all is mended.  We are but shadows passing here.  To Experimental Dramatica we disappear.", "group_id": 2515, "id": 1905143}, {"user_id": 37586, "stars": [], "topic_id": 43842, "date_created": 1313708340.0501831, "message": "@jimhull Just me trying to be clever again.  I understand.  I should be stopped from late night posting and long entries. :o)", "group_id": 2515, "id": 1905345}, {"user_id": 7645, "stars": [], "topic_id": 43842, "date_created": 1313707810.5935061, "message": "No offense, just trying to make sure the conversation here stays focused on the writing and analysis of stories within the context of Dramatica.", "group_id": 2515, "id": 1905310}, {"user_id": 7664, "stars": [], "topic_id": 43842, "date_created": 1313711988.187511, "message": "Prish, have you ever done the same improv twice in a row? Or twice a week apart with the same actors?", "group_id": 2515, "id": 1905613}, {"user_id": 39675, "stars": [], "topic_id": 43842, "date_created": 1313711862.1539841, "message": "My point with this topic is using the dram theory to create a story embroidery/storyform/storyencoding,then using actors improvs to flush out the dialogue ideas, with the actors taking part in the embroidery, probably.  I am very much a using-by-the-numbers dram person.", "group_id": 2515, "id": 1905601}, {"user_id": 7645, "stars": [], "topic_id": 43842, "date_created": 1313712612.525115, "message": "Hey guys I really want to keep the discussion here limited to practical application of Dramatica. If you could finish it up over in the other group that would be great. Thank you", "group_id": 2515, "id": 1905668}]