[{"user_id": 24590, "stars": [], "topic_id": 14958, "date_created": 1300976306.053879, "message": "oh good topic!", "group_id": 7210, "id": 426939}, {"user_id": 24589, "stars": [{"date_created": 1300996284.48423, "user_id": 24590}], "topic_id": 14958, "date_created": 1300977269.6893179, "message": "Needless to say, we booked right away and the executive chef absolutely lived up to his word. Since it requires special preparation, we did have to decide on our meal times each evening with the executive chef, Marlon, but he just simply stopped by our table and made suggestions for the following day. It was an amazing experience and Marlon was the reason it was so incredible. There's nothing like having an executive chef prepare every meal for you personally! The only complaint we had is that desserts quickly went from caramelized sugar cups with sorbet (what we enjoyed the first night), to just fruit, but over all the food was fantastic. I have no doubt that if Marlon is still running the Dreams Los Cabos resort kitchens, he would be excited to prepare food to any number of dietary restrictions (vegan, vegan fat-free, etc.). He even encouraged us to spread the word to our vegan friends so that others with special diets would also visit his resort.", "group_id": 7210, "id": 427142}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1300976787.138823, "message": "In preparation for our honeymoon which was scheduled for July 2009, my partner emailed at least two dozen resorts trying to find one that would commit to preparing quality vegan meals before we booked with them.  Our hope was for it to be an All-Inclusive resort in either Mexico or the Caribbean.  Most resorts ignored his emails, but one chef stood out from the pack and here was his reply to our inquiry:", "group_id": 7210, "id": 427033}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1300976802.561996, "message": "My name is Marlon Petrick and i,am the executive chef of the Dreams Hotel\nLos Cabos .\nRegarding to your request of vegetarian dining options in our resort ,i,am\nglad to tell you that we have good choices to satisfy your needs.\nHere a list of vegetarian food items and some menu suggestions.\n1, Bruschetta with vegetable ragout, ministrone soup ( soup will be made of\nvegetable stock), Vegetarian lasagna ( without cheese and cream etc. ,with\ntofu) , poached pear with strawberry sauce\n2, Vegetarian sushi roll ,green lettuce with thai spring roll, sweet and\nsour tofu with steamed rice,o vegetarian stir fry , caramelized orange\n3, Eggplant roll , onion soup, sundried tomato risotto with marinated and\ngrilled tofu, poached peach with grapefruit grenatine\n4, Guacamole ( avocado pure ) mexican salsa and fried tortilla chips, black\nbean quesadilla with mexican rice ,roasted peppers and steamed chayotes\n5, Caprese salad ( tomato ,pesto and tofu) , grilled polenta with mushroom\nragout and spinach stuffed tomato\n6, garden greens with ,artichoke ,asparagos and cherry tomato with a\nbalsamic live oil dressing, marinated tofu kabobs on ratatouille with olive\npotato chips, fruit salad\n We have a good selection  of vegetables ,and fruits.\nFood items like:pasta ( \"cecco\"),tofu,udon pasta, olive oil,sesame seed oil,\nrice,wild rice, quinoa,sweet potato,garbanzo,soy beans and products  , etc.\nI think the best way is to create a daily menu for the time of your stay in\nthe hotel .\nPlease can you tell me what you usually have for breakfast or things would\nyou would like to have on the menu ?!\nWhat about , the bread ( we are using yeast and margarine ( \"flex \")?\nRegarding to the options what i send to you, i will be flexible for any\nchanges and suggestions, also i have other  choices of dishes .\nSo ,i hope this will help you for your vacation planning.\nHave a good day!", "group_id": 7210, "id": 427040}, {"user_id": 24609, "stars": [], "topic_id": 14958, "date_created": 1300977964.934227, "message": "Mii Amo spa and resort in Sedona, Ariz. The food was to die for, and it was the best week of my life! The scenery is unbelievable, and the only clothing requirement was a robe. That's it, just the robe. I've never felt more relaxed in my whole life.", "group_id": 7210, "id": 427330}, {"user_id": 24609, "stars": [], "topic_id": 14958, "date_created": 1300978911.3805339, "message": "Agave/chipotle glazed tofu with wild rice stands out (it was almost six years ago, sob!). I also remember a lunch of blue corn tortillas with roasted veggies and tomatillo salsa. It's a lovely place, very peaceful. And of course the spa services are outstanding! I was rubbed, stretched, oiled, washed, and moisturized the whole time. Ahhhhh, I miss it.", "group_id": 7210, "id": 427515}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1300978070.638911, "message": "That sounds amazing.  What types of meals did you enjoy?", "group_id": 7210, "id": 427362}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1300979757.1094689, "message": "Superb!", "group_id": 7210, "id": 427639}, {"user_id": 22946, "stars": [], "topic_id": 14958, "date_created": 1300984414.726645, "message": "@MsChoiceAlways, based on that letter, and your experience, I totally plan to book a trip there now!!", "group_id": 7210, "id": 428439}, {"user_id": 22946, "stars": [], "topic_id": 14958, "date_created": 1300984452.8445959, "message": "Scott & I went on a cruise with Costa, and every night the chef prepared something special for us. All they ask is that you notify the cruise line customer service 30 days in advance for special dietary needs.", "group_id": 7210, "id": 428442}, {"user_id": 12716, "stars": [], "topic_id": 14958, "date_created": 1300986760.0293219, "message": "@MsChoiceAlways I believe this is the hotel you are refering to. Just wanted to make a link available. http://www.dreamsresorts.com/drelc/daily-activities.html", "group_id": 7210, "id": 428863}, {"user_id": 24661, "stars": [], "topic_id": 14958, "date_created": 1300986692.15622, "message": "I had a lot of luck with Sandals in St. Lucia - it was  a little work to get sombody's attention before we left, but once we were there the chefs were great and the food was as well.  They even bough soy milk special for just me!", "group_id": 7210, "id": 428855}, {"user_id": 12716, "stars": [], "topic_id": 14958, "date_created": 1300986904.9586761, "message": "@Dirk Sedona is a cool area and want to go back.", "group_id": 7210, "id": 428882}, {"user_id": 12716, "stars": [], "topic_id": 14958, "date_created": 1300986870.4340229, "message": "@MsChoiceAlways This might be a better link. http://www.dreamsresorts.com/drelc/dining.html", "group_id": 7210, "id": 428878}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1301093523.1086681, "message": "@LindsayNixon That's great!  If the executive chef Marlon still runs the place I bet he would love to hear from you!", "group_id": 7210, "id": 443095}, {"user_id": 24589, "stars": [], "topic_id": 14958, "date_created": 1301093545.28514, "message": "@citadelgrad  Thanks for including the links!  That's the place :)", "group_id": 7210, "id": 443096}]