[{"user_id": 15211, "stars": [], "topic_id": 15461, "date_created": 1301139255.3252499, "message": "I'm wondering how I should keep my secret stuff (like api-keys etc) hidden from my git-repo. Cause I'm not quite sure how to make this possible since everything must be in the git-repo to make it to ep.io. Local_settings.py or similar would be nice, someone with a tips?", "group_id": 2873, "id": 445952}, {"user_id": 25573, "stars": [], "topic_id": 15461, "date_created": 1301141833.8362279, "message": "I would just use two repos. One for the developers and another one for your servers. Use a CI tool like Jenkins two manage the second repo for your servers. Putting in your secrets and stuff.", "group_id": 2873, "id": 445982}, {"user_id": 15211, "stars": [], "topic_id": 15461, "date_created": 1301163598.5574119, "message": "Sounds like a way that could work, but it's a bit overkill for me right now;-) So maybe I'll make a fabric-script that does something like similar. Thanks for the tips!", "group_id": 2873, "id": 446814}, {"user_id": 8740, "stars": [], "topic_id": 15461, "date_created": 1301166676.3745461, "message": "I'd say that's the best way for now (you can easily set up an automated merge between the two repos). If you have any other ideas that we can help make easier, I'd love to hear them", "group_id": 2873, "id": 447063}, {"user_id": 15211, "stars": [], "topic_id": 15461, "date_created": 1301222535.522691, "message": "I made a small bat-script that solves this for me, feel free to check it out, and improvements are more than welcome=)\n\nhttp://p.bergqvi.st/deploying-to-epio-with-secret-stuff", "group_id": 2873, "id": 450594}, {"user_id": 8740, "stars": [], "topic_id": 15461, "date_created": 1301230066.4255221, "message": "@peppelorum Excellent. One point of note is that you don't have to have stuff in a git repo - \"epio upload\" just uses the current directory contents - but it probably doesn't work too well on Windows...", "group_id": 2873, "id": 450895}, {"user_id": 15211, "stars": [], "topic_id": 15461, "date_created": 1301242132.8847809, "message": "@andrewgodwin Aha, then I know. Yeah, the epio-command line tool doesn't work to well under Windows, but some \"reverse engineering\" will solve that. I'm running some commands with plink for example now.", "group_id": 2873, "id": 451820}, {"user_id": 9153, "stars": [], "topic_id": 15461, "date_created": 1312314550.696095, "message": "you can just use a local_settings.py and import it from settings.py. Then use .gitignore to ignore it.", "group_id": 2873, "id": 1778703}]