[{"user_id": 32801, "stars": [], "topic_id": 35739, "date_created": 1305689800.7519121, "message": "Why do those Django peeps get all the fun.  Ruby Ottawa represent!", "group_id": 9753, "id": 1092233}, {"user_id": 32806, "stars": [], "topic_id": 35739, "date_created": 1305724435.720417, "message": "I'll play along - how is railsconf going?", "group_id": 9753, "id": 1096775}, {"user_id": 32937, "stars": [], "topic_id": 35739, "date_created": 1306157395.472115, "message": "RailsConf was great... trippy even (see: 50 in 50 keynote). That was probably the most polarizing keynote I can ever recall that may have bordered on too geeky for the uber-est of uber-geeks", "group_id": 9753, "id": 1152210}, {"user_id": 1316, "stars": [], "topic_id": 35739, "date_created": 1306159225.062304, "message": "does it work well as a networking opportunity?", "group_id": 9753, "id": 1152608}, {"user_id": 32937, "stars": [], "topic_id": 35739, "date_created": 1306159734.6470051, "message": "It's like anything - it's what you make of it. I went down with a couple of objectives in mind on both the research and networking side. Certainly one thing I noticed this year was the number of recruiters - if one were looking for a job, you'd be hard pressed not to come away with multiple interviews lined up. The job board was crammed and the recruiters were actively working the hallways looking for people not in sessions.", "group_id": 9753, "id": 1152707}, {"user_id": 1316, "stars": [], "topic_id": 35739, "date_created": 1306161768.4134619, "message": "who can offer the best in-office chef", "group_id": 9753, "id": 1153329}, {"user_id": 32801, "stars": [], "topic_id": 35739, "date_created": 1306161355.6888051, "message": "agree with the recruiting hype. one company's full tradeshow display was exclusively for the perks of the company. I had to ask them: \"what does your company do other than hire people?\"  they thought it was funny and proceeded to tell me how Canadian friendly they are.", "group_id": 9753, "id": 1153191}, {"user_id": 1316, "stars": [], "topic_id": 35739, "date_created": 1306161728.262502, "message": "this kind of \"we have a lot of money and let's hire hire hire\" feels a lot like things back in around 2009/2010", "group_id": 9753, "id": 1153316}, {"user_id": 32937, "stars": [], "topic_id": 35739, "date_created": 1306161884.0247359, "message": "Totally agree: so much money being thrown around. I really had the thought that they were so desperate for bodies that the hiring process was probably to cast a wide net, hire people who might not even be qualified but hope that you have a success rate of snagging a few good ones in the process.", "group_id": 9753, "id": 1153362}, {"user_id": 32801, "stars": [], "topic_id": 35739, "date_created": 1306164870.3007751, "message": "I asked a bunch of companies if they were open to hiring freelance. most were saying no. only one of the guys I was chatting with at the airport asked if I was interested in contract work.", "group_id": 9753, "id": 1153930}, {"user_id": 1316, "stars": [], "topic_id": 35739, "date_created": 1306164066.722661, "message": "that means its a good time to be a contractor; except that sometimes the money chases building a large workforce to make an acquisition more lucrative", "group_id": 9753, "id": 1153780}, {"user_id": 32937, "stars": [], "topic_id": 35739, "date_created": 1306166384.735431, "message": "That's just it Reid. Employees are an asset to be tallied as part of what a company is offering. Back to my point that it almost seemed as if quality might be a secondary consideration.", "group_id": 9753, "id": 1154124}, {"user_id": 32801, "stars": [], "topic_id": 35739, "date_created": 1306168128.5212109, "message": "I get that exact same sense.", "group_id": 9753, "id": 1154331}, {"user_id": 34024, "stars": [], "topic_id": 35739, "date_created": 1306168724.127876, "message": "2 words \"rails kool-aid\"", "group_id": 9753, "id": 1154397}]