[{"user_id": 14086, "stars": [], "topic_id": 37601, "date_created": 1306880226.6525631, "message": "Hey HN'ers, what are some of the best ways to advertise a new startup? My startup, http://talentopoly.com/ has ~1400 users and I'm looking for new ways to grow it through advertising. I have tried Yoggrt, Influads, and Stumbleupon so far. This month I am running an ad on AdPacks. I'd love to hear any suggestions members of this community have. Thank you.", "group_id": 95, "id": 1243280}, {"user_id": 21218, "stars": [{"date_created": 1307025401.080791, "user_id": 3444}], "topic_id": 37601, "date_created": 1306886728.301106, "message": "I think you're doing it right now.  But having just checked your site, get rid of the fuckin' landing page, show me the goods right away because my attention span is...  what was I just saying?  If it's something I want to sign up for I'll find a way to do it, don't worry.  There's actually a few things on there that I want to read but almost didn't see them because of the stupid web 2.0 sign up thing that was in my face as soon as I clicked the link.  Also if you're looking to expand, why should I need an invite?  Too late, I've already lost interest.  A good voting system should keep the good stuff up top and the jerk-offs at the bottom.  Remember that the people who submit the good stuff are just as lazy as the jerk-offs.  Also remember that you're competing with hackernews and  reddit/r/programming so you'd better offer something that they don't and it better be really fuckin' good.", "group_id": 95, "id": 1245034}, {"user_id": 14086, "stars": [], "topic_id": 37601, "date_created": 1306936978.2282259, "message": "@jthomasbailey Thanks for the reply.", "group_id": 95, "id": 1253381}, {"user_id": 14086, "stars": [], "topic_id": 37601, "date_created": 1306937279.4172871, "message": "@jthomasbailey Thanks for the reply.", "group_id": 95, "id": 1253429}, {"user_id": 8282, "stars": [], "topic_id": 37601, "date_created": 1307005861.7952809, "message": "in these days, chrome web store is a good traffic resource. I'm pretty unfamiliar with marketing but tried it with multiplayerchess.com and increased my traffic suddenly", "group_id": 95, "id": 1264639}, {"user_id": 8282, "stars": [], "topic_id": 37601, "date_created": 1307005912.626189, "message": "also you can take a look at the google io session, there are really impressive success stories", "group_id": 95, "id": 1264641}, {"user_id": 3444, "stars": [], "topic_id": 37601, "date_created": 1307025424.1305101, "message": "@jthomasbailey +1 for you good sir.", "group_id": 95, "id": 1267525}, {"user_id": 33347, "stars": [{"date_created": 1307061331.4691191, "user_id": 26088}], "topic_id": 37601, "date_created": 1307058329.0088339, "message": "I don't really like advertising, but I would say some good ways to *promote* your start up would be to get involved with your market/audience. Offer them something of value for free, have your startup do something fun or creative that gets attention. A little buzz goes a long way.", "group_id": 95, "id": 1272754}, {"user_id": 33347, "stars": [], "topic_id": 37601, "date_created": 1307058421.9768701, "message": "use your brand to contribute to a community or discussion, rather than add to the clutter of advertisement.", "group_id": 95, "id": 1272764}]