[{"user_id": 11626, "stars": [], "topic_id": 6234, "date_created": 1297811658.918503, "message": "Information began coming out in mid-January that the Iranian government was preparing to file a law suit against Israel for crimes against their nuclear scientists including the one that was named to head the Stuxnet cyber attack investigation. The regime went on to warn “Western Nations” if they had a hand in such terror effort. As you may recall from our earlier blog post, Majid Shahriari, one of Iran’s leading nuclear scientists who also was the leader for Iran’s investigation into the Stuxnet cyber attack on their nuclear enrichment program, was assassinated on November 29, 2010 while in his car and on his way to work in Tehran.\r\n\r\nIntelligence analysis suggests that this action is the direct result of the arrest and subsequent investigation of what Iranian officials call a ten person spy ring that was said to be operating within Iran and involved in Stuxnet cyber espionage. Iran’s Intelligence Minister has been quoted as saying, “The network of spies and terrorists linked to Mossad was destroyed.” He went on to say the alleged spies “have confessed to being trained by the Mossad and receiving all of their equipment from that agency.”\r\n\r\nIt is difficult to say how deep this litigation will get into the details of the Stuxnet code and attack; but given Majid Shahriari was so involved with the Stuxnet investigation it is bound to be introduced into any court action that might occur. If court action does take place some interesting issues might arise due to all the attention Stuxnet has received.  For instance could this mean that Jeff Carr who received headlines like — ‘Jeff Carr: China Most Likely Candidate for Stuxnet’s Origin’ found on The New New Internet web site be called to testify for the defense?\r\n\r\nIranian Foreign Ministry Spokesman Ramin Mehmanparast disclosed few details about Iran’s litigation strategy and no mention has been made as to what international court will be called upon to address this challenging legal issue. We should all keep in mind that there is very little case law when it comes to acts of cyber aggression, let alone case law addressing murder and cyber espionage.  One thing is certain – this will be worth watching as it could set a legal precedent for future actions!\r\n\r\nhttp://defensetech.org/2011/01/18/cyber-war-crimes", "group_id": 3920, "id": 116624}]