[{"user_id": 7664, "stars": [], "topic_id": 42436, "date_created": 1311270747.1105289, "message": "Can \"Memory\" be construed as imagination as in... A guy gets to a new phase in his life (college, a job, marriage) and thinks, \"This isn't what I imagined it would be.\"?\n\nHe's judging it based on a memory (what he used to think) but that memory isn't based on anything real.", "group_id": 2515, "id": 1691233}, {"user_id": 33839, "stars": [], "topic_id": 42436, "date_created": 1311274120.6171379, "message": "Yes, though I would say it's more perception.  \n\nA lot of things get colored with time - for instance, a lot of times where people struggle they perceive the grass is greener on the other side (where ever that may be).  But those experiences shape them and as they go on through life and look back, people tend to perceive those very same times as being \"good\" times, or \"the good old days\", despite how they may have felt about them at that particular moment.  \n\nOr, in terms of what you're referring to, someone who perceives the grass is greener elsewhere because of their own situation and ultimately finds out it isn't because they have previously viewed it objectively, but now that they're \"on the other side\", it's subjective and doesn't live up to their expectation based on perception.", "group_id": 2515, "id": 1691516}, {"user_id": 7664, "stars": [], "topic_id": 42436, "date_created": 1311291206.119215, "message": "That sounds like a NO to me.", "group_id": 2515, "id": 1693374}, {"user_id": 33839, "stars": [], "topic_id": 42436, "date_created": 1311292149.1324711, "message": "\"He's judging it based on a memory (what he used to think) but that memory isn't based on anything real.\"", "group_id": 2515, "id": 1693446}, {"user_id": 33839, "stars": [], "topic_id": 42436, "date_created": 1311293450.9860971, "message": "Ooops, follow that quote with: it happens quite often, especially in terms of repression.  There's a book, Unchained Memories: True Stories of Traumatic Memories Lost and Found that deal with several case studies.\n\nI guess the key here is \"anything real\" vs. what the objective truth is: 100% total fictitious imagination, or something being misinterpreted that is based on, or has elements of, an actual event.   \n\nThe simple answer is we lie to ourselves ALL the time, tell ourselves stories about the things we CHOOSE to believe, finding a way to fit a piece of information and construe it into a certain schema we have about someone or something else or the world in general.  \n\nOnce we have a schema formed, we associate anything that validates that opinion as a way of justifying our own behaviors toward the individual or situation.  That memory could be total BS and not be based on anything real at all - but it's that individuals way of coping with their own inadequacies/issues and can serve as a defense mechanism.  Opinions --> Beliefs --> Attitudes --> Behaviors.", "group_id": 2515, "id": 1693599}, {"user_id": 7664, "stars": [], "topic_id": 42436, "date_created": 1311309755.887996, "message": "You've found the overlap -- memories and imaginations are both subjective, and have a source. I guess maybe it comes down to what the sources are?", "group_id": 2515, "id": 1695307}, {"user_id": 33839, "stars": [], "topic_id": 42436, "date_created": 1311337351.9652779, "message": "Here's an article re: the most famous case study in the book.  It's pretty fascinating and ultimately, the objective truth isn't really known but you can get a feel of how this works as the article approaches the subject objectively and explores different sides of a murder.  \n\nhttp://www.qcc.cuny.edu/SocialSciences/JCulkin/SS510/eileen_franklin_case.asp", "group_id": 2515, "id": 1697671}, {"user_id": 10814, "stars": [], "topic_id": 42436, "date_created": 1311352538.7342539, "message": "I think your use of \"Imagination\" is as subject matter, in which case it can be explored anyway you want.  \n\nIf you don't mean to use imagination as subject matter, then memory is probably not the best description because memory is tied to knowledge (experience).  Conscious or Contemplation might be more appropriate since it relates to thought.", "group_id": 2515, "id": 1699685}]