[{"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300375482.5594809, "message": "PPK es de derecha y esta rodeado de derecha conservadora, encima tiene a un \"pastor\"(Humberto Lay) en su cúpula, no me parece, yo quiero un estado laico.", "group_id": 7021, "id": 374936}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300377775.3212421, "message": "Yo voy a votar nulo, ningun candidato merece mi voto", "group_id": 7021, "id": 375142}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300377449.7267971, "message": "@Slayer_X Perfecto.. yo también quiero un estado laico.. pero haciendo un balance ¿eso hace que votar por Toledo o por Castañeda sea una mejor opción?", "group_id": 7021, "id": 375119}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300379368.437238, "message": "@mariellam ya quisiera yo tener un candidato con 100% con concordancia, yo apenas aspiro a un 40% o 50% pero ningún candidato llega a eso", "group_id": 7021, "id": 375241}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300377502.0565569, "message": "@Slayer_X Se habla mucho de que PPK es la mejor opción, el voto de conciencia, pero también podría ser para mi el menos malo.. no es perfecto, yo apuesto por él porque me parece mejor que los otros nada más...", "group_id": 7021, "id": 375125}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300378982.7875781, "message": "@pvaldivia Si, eso de la nacionalidad suena a cuento.. el dice que \"ha iniciado el trámite\" faltaría que la prensa investigue más sobre como es ese proceso...", "group_id": 7021, "id": 375201}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379262.8388569, "message": "@polkas_palabras Este sitio web está hecho en Python con varias herramientas opensource y debe estar corriendo sobre Linux.. pero es una plataforma válida para hablar de lo que sea..", "group_id": 7021, "id": 375232}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379364.717124, "message": "@polkas_palabras Pero invita a más gente a que se una a la conversa desde tu Twitter pues :)", "group_id": 7021, "id": 375239}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379611.151655, "message": "@polkas_palabras Osea bacán con todo el rollo de que PPK es honesto.. debemos suponerlo.. pero tampoco yo tendría porque poner las manos al fuego por él y menos por la gente de su Alianza.. la cosa es más simple para mi... quien propone las cosas más coherentes y quien conoce mejor los temas de gobierno...", "group_id": 7021, "id": 375261}, {"user_id": 12105, "stars": [], "topic_id": 13597, "date_created": 1300377883.242274, "message": "Yo voy a votar por PPK. Hasta ahora me parece la mejor opción, si bien es de derecha, fueron sus políticas económicas las que nos han llevado al punto en el que estamos ahora.", "group_id": 7021, "id": 375153}, {"user_id": 22456, "stars": [], "topic_id": 13597, "date_created": 1300379028.766289, "message": "@pvaldivia @gnrfan eso de renunciar a su nacionalidad norteamericana, recuerdo que fue claro en decir que lo haría si es que salía elegido presidente...  pero... eso de ponerlo como determinante... no me parece.", "group_id": 7021, "id": 375206}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379368.9022081, "message": "yo creo q PPK tiene la experiencia adecuada y mas q suficiente porq recordemos q hace no mucho Toledo admitio q ya \"aprendio\" y q ahora el MEF no manejara el pais, a quien se referia? a PPK", "group_id": 7021, "id": 375242}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379543.2431459, "message": "@Slayer_X: si, pero para mi el juego no es buscar pulgas a los candidatos e ir restándoles puntos.. es ver que proponen hacer y como impactarían esas propuestas en el futuro del Perú y ahí es donde veo que PPK y su equipo son los que la tienen más clara", "group_id": 7021, "id": 375252}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300380435.004971, "message": "@gnrfan eso me parece interesante, esto viendo el video que me envian para poder opinar, Grcs por el enlace", "group_id": 7021, "id": 375398}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300378647.3546269, "message": "El 2006 no vendieron como el menos malo o el mal menor a un presunto corrupto y genecida que espero prescribiera sus delitos para regresar y candidatear", "group_id": 7021, "id": 375184}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300378862.8114231, "message": "el peruano-norteamericano PPK hace meses nos viene con el cuento que renunciará a su nacionalidad norteamerica, Ojo: ya tenemos experiencia con el peruano-japones Fujimori", "group_id": 7021, "id": 375192}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300379089.4814799, "message": "Les recuerdo que PPK solo estuvo año y medio como ministro de economina de Toledo, es por eso que los Toledistas le piden a PPK que no mienta y que no le quite réditos a los demás ministros y colaboradores del periodo del ex-presidente Toledo", "group_id": 7021, "id": 375212}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379604.8789451, "message": "si, PPK propone hacer la tan esperada reforma del estado, para q manejar el pais no sea una improvisacion del gobierno d turno sino q ya se maneje una politica claro y definida siempre", "group_id": 7021, "id": 375260}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300378178.642549, "message": "@Mariellam si fuera por eso tendría que votar por Toledo porque fué el quien goberno, no PPK, ademas que no fué el único ministro de Economía, y no me apetece votar por Toledo.", "group_id": 7021, "id": 375170}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300378491.6749821, "message": "@Slayer_X: Yo no pienso que nos podamos dar ese lujo.. yo si quisiera que al menos PPK y Toledo lleguen a la segunda vuelta.. prefiero que gane PPK pero si sale al final Toledo tampoco va a estar taaaaan mal...", "group_id": 7021, "id": 375176}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300378556.2760429, "message": "@gnrfan te doy la razón en que PPK y Toledo son los menos malos, pero honestamente me gustaría votar por alguien en quien viera reflejado mis intereses y que me diera la confianza de sacar adelante este pais", "group_id": 7021, "id": 375179}, {"user_id": 22456, "stars": [], "topic_id": 13597, "date_created": 1300379112.5137911, "message": "una persona puede ponerse a los pies de los norteamericanos teniendo o no su nacionalidad... no es algo que pueda definir o encasillar a una persona... sin importar de que candidato se trate... mejor es analizar su capacidad y sus propuestas.", "group_id": 7021, "id": 375215}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379143.0238931, "message": "el tiene la doble nacionalidad por chamba por no amor extremo a ese pais", "group_id": 7021, "id": 375222}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379318.3586929, "message": "@gnrfan si claro, yo uso archlinux, bien x la iniciativa", "group_id": 7021, "id": 375234}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300378730.9366391, "message": "PPK Coquetea con Alan: Kuczynski sostuvo que el régimen aprista \"no ha sido un gobierno tan corrupto\",  deberia mostrarse firme respecto el cancer que aqueja al Perú llamado corrupción", "group_id": 7021, "id": 375187}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300378911.4784069, "message": "Toledo reconoce habilidades de PPK en lobbies y Carlos Bruce indica que PPK es un mentiroso y un mentiroso no puede ser presidente", "group_id": 7021, "id": 375193}, {"user_id": 12105, "stars": [], "topic_id": 13597, "date_created": 1300379041.1969719, "message": "@Slayer_X no votaría por Toledo porque viene con todo el familión. No creo que haya aprendido la lección.", "group_id": 7021, "id": 375208}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379104.7536299, "message": "PPK no solo es el menos malo sino q simplemente es una persona altamente capacitada para realmente reformar este pais, y no solo manejarlo en piloto automatico como se ha estado haciendo ultimamente", "group_id": 7021, "id": 375214}, {"user_id": 12105, "stars": [], "topic_id": 13597, "date_created": 1300379121.2656369, "message": "@pvaldivia cual es el problema con la doble nacionalidad? Tengo varios amigos que tambien la tienen y no es ningún problema para que se sientan bien peruanos.", "group_id": 7021, "id": 375217}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379195.1546609, "message": "off-topic: mas linux q lo d costumbre x aca", "group_id": 7021, "id": 375228}, {"user_id": 12105, "stars": [], "topic_id": 13597, "date_created": 1300379250.0242479, "message": "@Slayer_X sería lo ideal votar por alguien que concuerde 100% contigo. Pero en este caso es votar por quien esté mejor preparado para conducir el país. Los otros candidatos no me parecen lo suficientemente buenos siquiera para ser considerados.", "group_id": 7021, "id": 375231}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379555.9559081, "message": "@gnrfan ya avise, tengo problemas con mi cuenta d twitter, a veces puedo comentar publicamente a veces no", "group_id": 7021, "id": 375254}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379660.322464, "message": "ok, si lo quieres ver desd la parte esa yo creo q PPK tb es el mas convincente, dije eso por la comparacion con otro extranjero, el chino, q fugo", "group_id": 7021, "id": 375267}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379932.617171, "message": "tb propone q al bajar los impuestos y aumentar la actividad recaudatoria mas personas contribuiran al impuesto, x lo q pronostica q la recaudacion aumentara", "group_id": 7021, "id": 375297}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300380867.8917711, "message": "ta chevere y funciona bien", "group_id": 7021, "id": 375481}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300380868.3344171, "message": "@gnrfan: prefiero el IRC :P", "group_id": 7021, "id": 375482}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300381244.0965979, "message": "si una buena idea porq uno accede rapidamente y sin complicaciones", "group_id": 7021, "id": 375513}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300379425.7736311, "message": "Lo de la doble nacionalidad es un temor latente por la mala experiencia del pasado con Fujimori, fugó y fué acogido en Japon gracias a su nacionalidad.", "group_id": 7021, "id": 375247}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379514.3023779, "message": "el chino es un cobarde, estaba totalmente inmerso en la corrupcion y x eso fugo pero si tienes una persona honesta en el cargo no va a pasar eso", "group_id": 7021, "id": 375250}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300379593.0650361, "message": "¿que tiene de malo que Alan nos haya llevado a la peor crisis economica en lso 90'? 2006: Elijamolo de nuevo presidente por que pinta bien con su oratoria, es le menos malo.. 2011: ¿que tiene que PPK sea estanounidense, no importa que nosmienta y venda el cuento que renunciará a su nacionalidad? por que pinta bien su curriculum es el menos malo.. No pues, por eso el Perú no avanza", "group_id": 7021, "id": 375257}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300379658.286483, "message": "en las propuestas todos lso candidatos parecen tener muchas coincidencias esto es el ¿QUE?, la pregunta que deben responder es el ¿COMO? cumpliran sus promesas", "group_id": 7021, "id": 375265}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300379887.2755511, "message": "de todas las mineras actualmente solo 2 pagan las regalias porque hicieron sus contratos antes q se haga esa ley", "group_id": 7021, "id": 375290}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379913.991667, "message": "@pvaldivia: http://sites.willax.tv/ceciliavalenzuela/entrevistas/el-plan-economico-de-ppk.html#more", "group_id": 7021, "id": 375293}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300379787.2803271, "message": "les pregunto a los que apoyan a PPK, por favor convensanme, como es que este seño Reduciendo el ingreso del fisco reduciendo el IGV del 18% al 15%, indicando que no revisara contratos de empresas extranejras y que no cobrara nuevos impuestos a mineras, etc... ¿con que dinero hara lo promete?.", "group_id": 7021, "id": 375279}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379754.4127851, "message": "@pvaldivia Esa lógica que mencionas aplicaría si pudiéramos declarar la presidencia vacante y no pasara nada pero eso no es realista.. alguno de los 11 candidatos tiene que y VA a terminar sentado en Palacio.. ¿qué alternativa es mejor? Si crees que Castañeda lo puede hacer mejor allá tu.. pero honesto y capaz.. no estoy muy convencido ah...", "group_id": 7021, "id": 375272}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379829.7802639, "message": "@pvalvidia: si justamente eso es lo que se pasa explicando.. .te voy a buscar el video donde su jefe del plan de gobierno explica JUSTAMENTE eso...", "group_id": 7021, "id": 375283}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380011.982249, "message": "He creado otro topic", "group_id": 7021, "id": 375312}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300380067.633204, "message": "el ingreso que se recaudaria con lo que propone PPK en su plan son solo migajas en terminos reales, tu sabes cuantos millones se dejara de percibir al reducir el IGV del 18 al 15%, cuantos millones deja de percibir el estado por no cobrar impuesto a las sobregancias mineras, etc.. lo que planta PPK es un engaña muchachos.. el sueña que con una bariat magica entrara mas gente a tarbajar ajustan un par de leyes laborales.. todos tenemos derecho a soñar", "group_id": 7021, "id": 375318}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300380174.9227109, "message": "de otro lado el IGV lo pagamos todos cuando compramos en la tienda de la esquina una gaseosa una pan etc, estos se llaman impuestos indirectos y afectan a todos por igual, lo que se deberia plantear y PPK NO lo hace es ajustar de forma equitaitva los impuestos directos como el de la RENTA, esto ni lo menciona su entorno ¿por que será?", "group_id": 7021, "id": 375344}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380621.153156, "message": "¿Más bien saben algo de la movida sobre PPK en Facebook? Aún no he entrado a ver por allá...", "group_id": 7021, "id": 375444}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300379872.3650751, "message": "@pvalvidia: pero te puedo adelantar que es haciendo que más gente entre a trabajar con trabajos dignos y pagando sus impuestos... con eso se recauda más y se hacen las obras..", "group_id": 7021, "id": 375288}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380481.128619, "message": "@polkas_palabras De eso se trata todo esto.. yo no estoy fanatizado con el tema de PPK yo realmente quiero escuchar argumentos convincentes que me lleven a votar por otro de los candidatos.. si es que los hay...", "group_id": 7021, "id": 375412}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300381183.077235, "message": "jaja.. de donde salió esa tilde :)", "group_id": 7021, "id": 375508}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300380538.6340189, "message": "@gnrfan claro lo ideal es informarse recontra bien, de acuerdo con eso", "group_id": 7021, "id": 375416}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300380128.304832, "message": "lo q pasa es q los impuestos a las mineras ya son altos en este pais, las regalias q van a empezar a pagar desde el prox año va a ser un monton de plata", "group_id": 7021, "id": 375332}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300382137.8731711, "message": "yo escuche solo un rato y Secada me parecio el q dio soluciones mas puntuales q los demas", "group_id": 7021, "id": 375593}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380288.6541929, "message": "@pvaldivia Ayer por ejemplo Marco Sifuentes en la La Mula le estuvo preguntando eso en un transmisión en vivo por Internet.. esa es una oportunidad para preguntarle eso directamente", "group_id": 7021, "id": 375364}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380322.213068, "message": "@pvaldivia también lo podemos hacer por Twitter.. hay que preguntar.. directamente.. aclarar todas las dudas.. o en todo caso conocer las posturas sobre los temas que nos importan", "group_id": 7021, "id": 375371}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300380342.691057, "message": "@pvaldivia si ayer le hicieron preguntas d todo tipo y respondio todas bien, ya me gustaria q todos los candidatos tuvieran esa soltura con preguntas tan puntuales", "group_id": 7021, "id": 375377}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380518.749429, "message": "@polkas_palabras Ayúden pues pasando la voz desde sus cuentas Twitter para que mas gente venga a conversar por acá", "group_id": 7021, "id": 375414}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380634.763932, "message": "Hoy día habrá algo en Barranco.. no se si va el mismo PPK.. pero yo si no voy a poder ir :/", "group_id": 7021, "id": 375446}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300380653.0315671, "message": "http://www.facebook.com/ppkoficial yo creo q si va a ir porque le ha hecho harta propaganda en su pagina", "group_id": 7021, "id": 375449}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380808.8323629, "message": "Creo que la cosa en Facebook está media monse... lo que falta es más conversación.. como estamos teniendo acá..", "group_id": 7021, "id": 375473}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300380824.1136551, "message": "¿Qué tal les parece convore? Si funciona bien ¿no?", "group_id": 7021, "id": 375477}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300381269.413352, "message": "sin instalar nada extra, lo cual amplia la posible base d usuarios", "group_id": 7021, "id": 375520}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300380942.121558, "message": "@gnrfan esta estupendo esto de convore!", "group_id": 7021, "id": 375493}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300381136.6745591, "message": "@Slayer_X Yo también prefiero el IRC para grupos que se reunen siempre y para proyectos opensource.. pero para discutir sobre un tema X creo que Convore es una alternativa bastante válida y útil", "group_id": 7021, "id": 375504}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300381169.7054131, "message": "@pvaldivia Si te parece bueno ayúda a otros a descubrir convore pasando la voz", "group_id": 7021, "id": 375506}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300383011.1009481, "message": "a todo esto @pvaldivia tu por q candidato t inclinas mas?", "group_id": 7021, "id": 375678}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300382192.677851, "message": "@pvaldivia Puede ser.. tienes razón en que faltaría explicar todo eso en detalle..", "group_id": 7021, "id": 375598}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300382973.6451621, "message": "@pvalvidia Yo no lo veo así.. creo que tomas una posición muy escéptica sobre todos esos puntos.. la tecnología bien aplicada si puede ser una gran herramienta de fiscalización y control.. incluso en manos de los ciudadanos", "group_id": 7021, "id": 375672}, {"user_id": 22460, "stars": [], "topic_id": 13597, "date_created": 1300382975.2641261, "message": "x ejemplo lo d la corrupcion PPK ha dicho q va a mejorar la carrera publica con examenes d ingreso, capacitaciones constantes para q sea un personal mas o menos fijo y no entren en mancha con el gobierno de turno", "group_id": 7021, "id": 375673}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300382993.6587579, "message": "sigo tecleando mal tu user", "group_id": 7021, "id": 375676}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300382997.9461639, "message": "es @pvaldivia :)", "group_id": 7021, "id": 375677}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300382848.4137859, "message": "@gnrfan exacto, a eso voy, no hay nada nuevo en lo que plantean estan simplemente tomando un libreto conocido - q' no digo sea malo - cuando digo q' nos venden cebo de culebra me refiero a que sus propuestas parecen sacadas de una revista empresarial, pero por ninguna lado atacan los problemas de fondo que aquejan al país, como politicas de inclusion, lucha frontal contra la corrupcion.. pero no como ellos lo plantean: \"dotando de tecnología el poder judicial (es decir dotar de tecnologia a un poder del estado corrupto)\", sus propuestas por donde lo veas no solucionan o no atacan los problemas de fondo.. la razon parece ser simplemente que no existe un interes real en hacerlo, hay mas bien otros intereses que para verlos hay que hacer un analisis mas profundo que muchos no hacemos.", "group_id": 7021, "id": 375659}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300383873.0375221, "message": "@gnrfan de otro lado, en lo particular considero que los profesionales estaremos bien sin importar quien nos gobierne, mi posicion va mas por optar por candidato con politicas + claras respecto impulsar y defender al empresariado nacional, y orientado a solucionar problemas de fondo de la educacion que es lo que en el largo plazo nos hara un pais mas homogeneo, con igualdad de oportunidades, que no tenga miedo a proponer o negociar reglas mas justas a las inversiones foráneas, que no tenga miedo a hablar de corrupcion, estas son algunas de los pilares que me hacen inclinarme por la candidatoa de #Ollanta, como dicen el Perú segira creciendo ingrese quien ingrese, el tema es como se distriburira ese creciemiento para convertirlo en desarrollo.", "group_id": 7021, "id": 375844}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300382064.4130449, "message": "@gnrfan viendo los videos http://bit.ly/f6KLY0 Video1: me parece una burla, El Sr. Secada no dice nada en concreto, que demuestre seriedad esgrimiendo cifras concretas, ¿De cuantos ingresos hablamos detras de sus propuestas para programas sociales?, menciona lanzar normas, leyes, el Perú es el país donde abundas las leyes  .. Video2: Por los comentarios del equipo de campaña de Toledo sobre PPK queda claro que este ó se olvida las cosas o está desinformado de las leyes laborales actuales y creo que con sustento y alturadamente los sres de la chakana demuestran que PPK nos quiere vender cebo de culebra, el Sr. secada NO reponde por ningun lado nada sólo balbusea oraciones, nada concreto y bueno como es tipico ningunea a quienes los empleazan a reponder el ¿Como?", "group_id": 7021, "id": 375582}, {"user_id": 22433, "stars": [], "topic_id": 13597, "date_created": 1300383050.8817289, "message": "@gnrfan si le das en la flechita de \"reply\" te pone el user ;)", "group_id": 7021, "id": 375681}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300382350.239399, "message": "@pvalvidia pero no coincido contigo en que balbucee tonterías.. es un rollo bien parecido al de Hernando de Soto y es lo que dijeron muchos empresarios extranjeros cuando vinieron a al cumbre Asia-Pacífico en Perú..", "group_id": 7021, "id": 375611}, {"user_id": 20005, "stars": [], "topic_id": 13597, "date_created": 1300383494.078335, "message": "@Slayer_X Así lo hice varias veces.. pero no todas :)", "group_id": 7021, "id": 375766}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300383852.6658061, "message": "@gnrfan De acuerdo respecto las ventajas del BUEN uso de la tecnología, pero esto no soluciona el problema de fondo, Toledo nos dejo el gobierno electronico (SEACE, CONSUCODE, etc) que permitió una mayor de transparencia en negocios con el estado, complicando actos de corrupcion, sin embargo hoy se burla estos mecanismos de otras maneras, por que no existe mano dura contra aquellos que cometen actos de corrupcion, las propuestasde los candidatos deben ser completas, integrales y no solo marketeras.", "group_id": 7021, "id": 375838}, {"user_id": 22455, "stars": [], "topic_id": 13597, "date_created": 1300407351.2643931, "message": "Wikileaks confirma: PPK lobbista de trasnacionales y agente de gobiernos extranjeros http://bit.ly/i3FbJw", "group_id": 7021, "id": 378741}]