[{"user_id": 29251, "stars": [], "topic_id": 19168, "date_created": 1302694145.9994459, "message": "Ideally I'd want multiple sizes, and the smaller the better.", "group_id": 8728, "id": 663291}, {"user_id": 29251, "stars": [], "topic_id": 19168, "date_created": 1302692078.82955, "message": "Tiny LEDs ... best used for something along these lines: http://www.etsy.com/listing/64714102/diy-light-up-embroidery-kit-ursa-minor.   Sparkfun appears to have many kinds, any suggestions on which would best meet my needs?", "group_id": 8728, "id": 662960}, {"user_id": 1924, "stars": [], "topic_id": 19168, "date_created": 1302703233.8621149, "message": "A couple years ago at Target's dollar section I got a string of LED's connected to a AAA batteries.  They aren't tiny though, standard size.  I'll bring them in.  This is the closest I could find in a quick search: http://www.batteryoperatedcandles.net/pink-rice-p-floral-mini-lights.html?gdftrk=gdfV2875_a_7c73_a_7c172_a_7cpink_d_rice but I bet $8 is unfeesible", "group_id": 8728, "id": 665294}, {"user_id": 29165, "stars": [], "topic_id": 19168, "date_created": 1302706329.451128, "message": "I'd look to Mouser (http://www.mouser.com/Optoelectronics/LED-Indication/Standard-LED-Through-Hole/_/N-75pv5?Keyword=led&FS=True). You will find everything from ultra tiny to honkin huge and every color you can imagine. The only thing to keep in mind is that the resistor you use is important. All you need to know is you supply voltage (1.5V per battery, or wall wart output), desired current and the LED's voltage drop which is in it's data sheet. Mouser has data sheet links right on the table you use for shopping. With these numbers you can calculate the resistor needed (http://www.hebeiltd.com.cn/?p=zz.led.resistor.calculator). The current determines the brightness but be sure not to exceed the LEDs rated current or it will be toasted. Max current is also in the data sheet, but 10-20 milliamps is usually safe for most leds.", "group_id": 8728, "id": 665863}, {"user_id": 29251, "stars": [], "topic_id": 19168, "date_created": 1302736522.1736641, "message": "@ponderings - thanks, I've seen those but since I'd need to cut them apart it would probably be more cost effective to get individual ones.", "group_id": 8728, "id": 673575}, {"user_id": 29251, "stars": [], "topic_id": 19168, "date_created": 1302737016.913866, "message": "@mswanson - oooh, it's like a candy store.  Thanks much for the resistor reminder too.", "group_id": 8728, "id": 673644}]