[{"user_id": 30714, "stars": [], "topic_id": 39580, "date_created": 1308254137.058939, "message": "As the number of startups mushrooms, it seems like ideas for startups are being executed faster than the \"space\" of possible ideas for startups is growing, implyin that the somewhat limtied resource of \"ideas for startups\" is dwindling.  For almost anything you can think of (with some exceptions), there exists \"a webapp for that\" - Everything from dating based on music preference (http://tastebuds.fm/) to .. well, i cant think of any other ideas off the top of my head - but, do people in the industry have this 'feeling'?", "group_id": 142, "id": 1413215}, {"user_id": 38000, "stars": [], "topic_id": 39580, "date_created": 1310589390.671077, "message": "Nope.", "group_id": 142, "id": 1631688}, {"user_id": 34653, "stars": [], "topic_id": 39580, "date_created": 1310636083.914381, "message": "startups are like music, there are a lot of duplicates, but there will always be something new to create!", "group_id": 142, "id": 1635787}, {"user_id": 34189, "stars": [], "topic_id": 39580, "date_created": 1310651587.395524, "message": "I bet there were a lot of people asking this same question when Gutenburg printed his first book, or when the first Model T came off the line, too.", "group_id": 142, "id": 1637030}, {"user_id": 6539, "stars": [], "topic_id": 39580, "date_created": 1310735229.3836279, "message": "In the small business space, startups are just starting to heat up, it seems - at least around these parts. I hope to see more!", "group_id": 142, "id": 1644808}, {"user_id": 37070, "stars": [], "topic_id": 39580, "date_created": 1310738499.1729391, "message": "there's no limit to creativity!", "group_id": 142, "id": 1645395}, {"user_id": 22988, "stars": [], "topic_id": 39580, "date_created": 1310757546.9688649, "message": "Part of truth in point you'd referred is that a lot of \"new\" ideas are just a slight modification in implementation of another already existing ideas. Thus saying evolution in true innovation represented by start-ups is slow. When then user expectations of game changing stories are high - we might have a feeling that something is ending, but I personally do not believe we're at peak right now. Still climbing.", "group_id": 142, "id": 1648059}]