[{"user_id": 1597, "stars": [], "topic_id": 8304, "date_created": 1298466171.2844059, "message": "Yesterday, in addition to clearing out my email backlog, I got some time to think about our coming work and work on the specs a little. More thought required there, of course.\n\nToday, I'll be putting in what thought I can there. I've got a bunch of meetings on my plate for today (including the weekly devtools meeting at 9am PST) and I need to schedule a couple more.\n\nThe only thing blocking me today is that TaskPaper's synchronization method ate my todo list, and I had to use Time Machine to recover one from yesterday morning. bleah", "group_id": 491, "id": 187351}, {"user_id": 1723, "stars": [], "topic_id": 8304, "date_created": 1298467469.148484, "message": "Yesterday was largely a thinking and bugmail reading day interspersed with a phone screen, impromptu meetings and a trip to the bank. Additional free time was spent taking my dogs out for walks. (I'm alone here this week so I'm on the hook for all things house-related — and it ain't pretty)", "group_id": 491, "id": 187437}, {"user_id": 2929, "stars": [], "topic_id": 8304, "date_created": 1298469805.386076, "message": "Would be good to have a way to demo it.", "group_id": 491, "id": 187616}, {"user_id": 1723, "stars": [], "topic_id": 8304, "date_created": 1298467748.659869, "message": "oh, and meetings and a phonescreen and maybe another trip to the bank.", "group_id": 491, "id": 187452}, {"user_id": 1723, "stars": [], "topic_id": 8304, "date_created": 1298467719.9588709, "message": "must remember to use shift-enter.\n\nToday is going to be More Bugmail. Fixing up and relanding the net panel filter bug 632817 and asking dao for a review of bug 611795 (ulp).\n\nOther things on my plate are some UI mockups for the Inspector and a screencast for Workspaces.", "group_id": 491, "id": 187448}, {"user_id": 1597, "stars": [], "topic_id": 8304, "date_created": 1298470215.0131979, "message": "@joewalker that sounds cool, even with the squinting", "group_id": 491, "id": 187667}, {"user_id": 2929, "stars": [], "topic_id": 8304, "date_created": 1298469782.3194449, "message": "Status: Cockpit now has a GUI which (if you squint in the right direction) will update the CLI and v-v. I'm hard at work trying to make it so you can open your eyes properly", "group_id": 491, "id": 187614}, {"user_id": 5276, "stars": [], "topic_id": 8304, "date_created": 1298476973.0618279, "message": "Yesterday I spent the day with a bit of Ace action, and I started work on \"porting\" Rob's Workspace extension to Jetpack. It's cool stuff, I am liking Jetpack. Also, spent a bit of time re-testing the patch from bug 626455 which was about to land, but now it has a test failure.\n\nToday I am going to try to fix the test failure in the patch for bug 626455 and move on to continue work on the Jetpack port of Workspace. That means, basically, \"read more of the jetpack docs\" - yay! I'll start actual code writing once I have a good overview of the available APIs (I hope to get to that some time tomorrow, actually).", "group_id": 491, "id": 188295}, {"user_id": 14576, "stars": [], "topic_id": 8304, "date_created": 1298477429.323245, "message": "Yesterday was a lot of code reading (about:compartments, atul's memory-profiler, jsapi, etc), and some thinking through use cases.", "group_id": 491, "id": 188321}, {"user_id": 14576, "stars": [], "topic_id": 8304, "date_created": 1298477436.403007, "message": "Today is likely to be more of the same.", "group_id": 491, "id": 188322}, {"user_id": 14576, "stars": [], "topic_id": 8304, "date_created": 1298477713.8726201, "message": "But probably more weighted toward use cases than code reading.", "group_id": 491, "id": 188343}]