[{"user_id": 7712, "stars": [], "topic_id": 4948, "date_created": 1297620948.566704, "message": "Sanctum opens by telling the audience it is based on true events, and follows with an introduction to the main character, Josh, who is floating alone underneath the dark water of the cave without a breather. \n\nThe opening message, combined with the main character introduction, creates a prevailing sense of depression and doom that lasts throughout the entire film, and unfortunately, throughout the film, the audience knows which character is most likely to survive. \n\nThe photography was wonderful, so wonderful that it would have been nice to have experienced more joy at discovering undiscovered parts of a cave, and even learning some information about what the various colors of rocks within a cave mean, but that was not given to the audience. Instead, the audience is given predictable conflict, predictable lines from each character.", "group_id": 2515, "id": 92530}, {"user_id": 7645, "stars": [], "topic_id": 4948, "date_created": 1297634847.649662, "message": "No desire whatsoever to see this. You're a brave man.", "group_id": 2515, "id": 94128}, {"user_id": 7712, "stars": [], "topic_id": 4948, "date_created": 1297636945.421881, "message": "Well, it wasn't my choice (not that it matters). I've noticed that there are a lot of films that follow the usual Hollywood formula with excellent writing as far as scripts are concerned, but the final product fails.", "group_id": 2515, "id": 94312}, {"user_id": 7664, "stars": [], "topic_id": 4948, "date_created": 1297654424.4485581, "message": "How would you call this excellent writing if it's predictable?", "group_id": 2515, "id": 95960}, {"user_id": 7712, "stars": [], "topic_id": 4948, "date_created": 1297656103.239769, "message": "I attend a screenwriters group here in San Francisco that sports about 16+ regular attendees, some of whom are in the Writers Guild, and  their advice to the new screenwriters is to not hold onto the work if it sells because it will inevitably be changed by others. That, and combined with new skills gained during my last few weeks in a college screenwriting course, I feel that on paper the spec script would have read quite well, and that it may have been due to re-writes and the director's prerogative that caused the movie to fail.", "group_id": 2515, "id": 96105}, {"user_id": 7664, "stars": [], "topic_id": 4948, "date_created": 1297703111.135129, "message": "It's true that you can't hold on to anything once you sell your script, but I think it's unlikely that Sanctum began as a spec.", "group_id": 2515, "id": 101414}, {"user_id": 7712, "stars": [], "topic_id": 4948, "date_created": 1297706636.2889819, "message": "John Garvin and Andrew Wight look like they are new writers according to IMDB. How does their first film being a flop affect their careers?", "group_id": 2515, "id": 102467}, {"user_id": 7664, "stars": [], "topic_id": 4948, "date_created": 1297710023.7371171, "message": "There is no way to answer that. Like you said, maybe the original script is awesome.", "group_id": 2515, "id": 103368}, {"user_id": 7712, "stars": [], "topic_id": 4948, "date_created": 1297753340.7942879, "message": "That's one I want to see. Bayardo (the other half) and I will try to see it next weekend.", "group_id": 2515, "id": 109609}, {"user_id": 7664, "stars": [], "topic_id": 4948, "date_created": 1297741515.880955, "message": "If you see \"The Eagle\" we can talk about that... I saw it over the weekend.  @Buck", "group_id": 2515, "id": 109114}]