[{"user_id": 11626, "stars": [], "topic_id": 40781, "date_created": 1309389273.8470621, "message": "All these n. plants having probs at the same time is starting to feel a bit false flaggy?", "group_id": 3920, "id": 1522792}, {"user_id": 11626, "stars": [], "topic_id": 40781, "date_created": 1309387746.889617, "message": "June 28, 2011, 1:20 AM\nBill Gallo Jr./Today's Sunbeam By Bill Gallo Jr./Today's Sunbeam\nFollow\nTweet\nShare Email Print\nlac.jpgSunbeam file photoSalem Unit 2 at Artificial Island in Lower Alloways Creek Township shut down after a cooling pump failed Sunday night.\nLOWER ALLOWAYS CREEK TWP. — The Salem Unit 2 nuclear plant remained shut down this afternoon following a problem with a reactor coolant pump, according to a spokesman for the plant’s operator.\n\nSalem 2 automatically went offline Sunday at 6:01 p.m. when the coolant pump tripped, said Joe Delmar, spokesman for PSEG Nuclear.\n\nWhen the pump shut down, the auxiliary pump system automatically started to provide water to cool the reactor.\n\nThe cause of the pump failure is still being investigated, according to Delmar. The plant functioned as designed, he said.\n\nThe plant remained in “hot shutdown” mode this afternoon.\n\nFederal Nuclear Regulatory Commission resident inspectors assigned to the Salem site responded to Salem 2 and verified that the plant was stable and operator actions were consistent with procedures and that appropriate troubleshooting was being performed by PSEG Nuclear, according to NRC Spokesman Neil Sheehan.\n\nThe shutdown will count as a hit on the plant’s performance indicator for unplanned shutdowns per 7,000 hours of online operations, according to Sheehan. If a plant experiences more than three unplanned shutdowns during the previous 7,000 hours of operation, it will receive additional NRC oversight.\n\n “This event shows why we need to have independent reviews of nuclear power plants and these plants need additional backup systems,” said New Jersey Sierra Club Director Jeff Tittel.\n\nSalem 2 is one of three reactors operated by PSEG Nuclear at its generating site on Artificial Island here.\n\nMeanwhile, Salem Unit 1 and Hope Creek plants continue to operate at full power.\n\nAt full power the three plants provide enough electricity to supply three million homes.\n\nhttp://www.nj.com/salem/index.ssf/2011/06/sakem_unit_2_nuclear_reactor_s.html", "group_id": 3920, "id": 1522654}]