[{"user_id": 24160, "stars": [{"date_created": 1301463744.4847479, "user_id": 26200}], "topic_id": 15885, "date_created": 1301352215.5220981, "message": "Es legal?", "group_id": 965, "id": 462861}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301352256.235189, "message": "¿Si fueras comisionado a hacer ésta labor, cómo empezarías?", "group_id": 965, "id": 462869}, {"user_id": 19938, "stars": [], "topic_id": 15885, "date_created": 1301353343.853313, "message": "@cesarsalazar César, pues si se vale soñar, todo es posible.", "group_id": 965, "id": 462949}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301352218.330466, "message": "Es rentable?", "group_id": 965, "id": 462862}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301352222.516314, "message": "Es deseable?", "group_id": 965, "id": 462865}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301352286.03462, "message": "Esto viene a colación a partir del problema del comercio electrónico está en los métodos de envío", "group_id": 965, "id": 462871}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301352935.0882101, "message": "Hablo de hacerlo a escala nacional. Un verdadero competidor del servicio postal.", "group_id": 965, "id": 462925}, {"user_id": 26088, "stars": [], "topic_id": 15885, "date_created": 1301354045.5923281, "message": "Empezaría por ser un tipo pakmail mm y después ofrecer el servicio directamente tal vez", "group_id": 965, "id": 463040}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301354141.438951, "message": "Creo que mas bien @cesarsalazar esta buscando saber si alguno de nosotros conoce las implicaciones legales y financieras de lanzar un servicio así a nivel nacional. Esto con el afán, quiero suponer, de competir con las grandes y caras cadenas de mensajería que existen aquí en México.", "group_id": 965, "id": 463054}, {"user_id": 20521, "stars": [], "topic_id": 15885, "date_created": 1301352697.1655321, "message": "Supongo que si es legal y rentable local mente hay varias pequeñas empresas que se dedican a eso. Por lo general le trabajan a bancos o gobierno cubriendo los repartos que sepomex no puede cumplir a tiempo.", "group_id": 965, "id": 462907}, {"user_id": 26088, "stars": [], "topic_id": 15885, "date_created": 1301353859.747792, "message": "Si lo haces con API yo lo desearia XD", "group_id": 965, "id": 463005}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301354214.0055461, "message": "He de decir que no tengo conocimiento amplio de esa causa en particular, pero estoy sumamente interesado en saber lo que los demás tienen que decir ya que mi Startup se vería sumamente beneficiado de un servicio así.", "group_id": 965, "id": 463067}, {"user_id": 19938, "stars": [], "topic_id": 15885, "date_created": 1301354431.3367889, "message": "Creo que esta pregunta cae en el terreno del alucine puro y duro.", "group_id": 965, "id": 463086}, {"user_id": 2946, "stars": [], "topic_id": 15885, "date_created": 1301356736.3236139, "message": "Creo que quizá hacer lobbying y presión para que el gobierno modernice el servicio postal es un poquitito más factible. No se como sean el resto de las oficinas, pero la que está en mi colonia está en la época de las cavernas. Un buen uso y aplicación de la tecnología la haría sin duda 1,000% mas eficiente.", "group_id": 965, "id": 463388}, {"user_id": 22259, "stars": [], "topic_id": 15885, "date_created": 1301357332.2449679, "message": "Ademas es un tema de logistica bastante interesante, sobre todo problemas relacionados con grafos y rutas optimas. ¿Cómo encontrar la ruta mas eficiente de un camion de delivery entre los puntos A, B, C...?", "group_id": 965, "id": 463459}, {"user_id": 22259, "stars": [], "topic_id": 15885, "date_created": 1301357518.544178, "message": "Con el uso de tecnología se pueden optimizar los costos y el customer satisfaction", "group_id": 965, "id": 463495}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301356781.1657121, "message": "pues no caeria en ups , estafeta o algo por el estilo?", "group_id": 965, "id": 463390}, {"user_id": 6541, "stars": [], "topic_id": 15885, "date_created": 1301356873.832247, "message": "@cesarsalazar Primero se tendria que definir \"envios modernos\", seguiendo la ola de \"2.0\" seria interesante poder hacer uso de APIs como foursquare (para indicarle al usuario donde se encuentra el envio), google maps (el recorrido que lleva y el que le falta), tal vez twiteame para notificaciones por sms al usuario y un buen cliente movil.", "group_id": 965, "id": 463403}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301356394.022362, "message": "han visto el comercial de chicharito?", "group_id": 965, "id": 463334}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301356502.6900511, "message": "eso responde la pregunta", "group_id": 965, "id": 463349}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301356619.173141, "message": "@lucks Gotcha. Pero creo que no es cuestion de si se puede hacer o no hacer. Mas bien es cuestión de si es económicamente y legalmente inteligente de ejecutar. O tal vez estoy mal?", "group_id": 965, "id": 463370}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301357081.2090459, "message": "Tiene un buen punto @lucks, pero las ideas de @jvr me gustaron bastante. Como sabemos la burocracia no permitiría el cambiar el sistema postal tan radicalmente en minimo uno 5 años, así que aprovechar la infraestructura de alguna empresa del sector privado, o incluso publico, seria un buen paso a seguir.", "group_id": 965, "id": 463419}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301356453.975142, "message": "@lucks Claro que si, es el de \"Pues porque no?\" correcto? Pero que tiene que ver con el topico?", "group_id": 965, "id": 463340}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301356484.8968999, "message": "Pues por que no?...se puede se puede.", "group_id": 965, "id": 463343}, {"user_id": 19921, "stars": [], "topic_id": 15885, "date_created": 1301357219.042516, "message": "@jyr La idea de aprovechar la API de foursquare para hacer check in en las diferentes etapas del envio se me hizo especialmente brillante. Kudos.", "group_id": 965, "id": 463435}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301356944.0402789, "message": "en dado caso seria hacer un convenio con el correo postal, que tiene mayor cobertura, y ayudar a mejorar su servicio", "group_id": 965, "id": 463408}, {"user_id": 24427, "stars": [], "topic_id": 15885, "date_created": 1301357586.888643, "message": "Puede ser una iniciativa Mexico, \"mejorar el servicio de correspondencia\" a una era digitalizada , revivir lo que por años fue el medio de comunicación que mas se frecuentaba", "group_id": 965, "id": 463506}, {"user_id": 22259, "stars": [], "topic_id": 15885, "date_created": 1301357412.894002, "message": "Si se quiere soñar un poco, les recomiendo que chequen este video: http://www.kivasystems.com/", "group_id": 965, "id": 463479}, {"user_id": 26088, "stars": [], "topic_id": 15885, "date_created": 1301358537.936775, "message": "yo diria solo con el api de google o bing para las rutas, aunque tener un dispositivo q informara de la posicion exacta del paquete costaria mas dinero mmm", "group_id": 965, "id": 463661}, {"user_id": 10406, "stars": [], "topic_id": 15885, "date_created": 1301358667.682565, "message": "Creo que es completamente factible, pero debido a la demanda actual (real) no es rentable... sin embargo se genera un dilema de oferta: Si se crea, es muy probable que la aparición de startups que utilicen el servicio se incremente de inmediato generando demanda, pero no hay datos duros para sustentar esta hipótesis, aunque todos nosotros estemos babeando por un servicio asi. Sin duda, el futuro del E-commerce en Mexico y latinoamerica es la existencia de una infraestructura de correo eficiente y solida a precios competitivos.", "group_id": 965, "id": 463671}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301362122.7360449, "message": "Wow, muchas respuestas y muchas de ellas muy interesantes. Pensando...", "group_id": 965, "id": 464034}, {"user_id": 26085, "stars": [], "topic_id": 15885, "date_created": 1301361481.003927, "message": "Creo que lo @cesarsalazar esta preguntando por qué no existe FEDEX (para envíos interciudad) en México. No tengo la respuesta pero tengo algunos datos. Fedex arranco con 4 millones de usd y una ronda de VC de 91 millones en los 70's... mucha lana para el dia de hoy.  Me parece que debe haber un tema de indole legal por ahi y por eso FEDEX, DHL ni UPS se han metido fuerte al mercado local. Temas de seguridad tambien.", "group_id": 965, "id": 463956}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301362263.970737, "message": "@edmz No es alucine. Creo que las personas que creemos en los startups sabemos que en realidad lo que buscamos es cambiar la realidad. Vemos un problema que muchos tienen y empezamos a pensar en cómo resolverlo. Los problemas más interesantes a resolver típicamente requieren más esfuerzo y/o recursos, pero también son los que traen más beneficio a los involucrados.", "group_id": 965, "id": 464051}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301364992.23722, "message": "OK, con moderno me refiero a que:\n\na) Utilize las técnicas y tecnologías más avanzadas para trazar y administrar cargas y rutas\nb) Permita al usuario final tener tanto control cómo sea posible desde una interfaz web\nc) Utilice las tecnologías más eficientes para rastrear paquetes y con ello aumentar la confiabilidad y el tiempo de entrega.\nd) Tenga un API que permita extender, agregar e integrar la funcionalidad del sistema\n\nAhora, asumiendo que es legítimo y que no existiera regulación que impida la competencia en el sector (a diferencia, por ejemplo, de las telecomunicaciones). Creo que lo siguiente es ver si es rentable.\n\nSupongo que si UPS y Fedex son rentables, este nuevo servicio también podría serlo (no tiene costos mayores que ellos). Sin embargo, el nivel de apalancamiento necesario para arrancar un negocio cómo este es tan alto, que posiblemente desaliente a muchos inversionistas (ya que hay un alto riesgo de no poder competir contra el gigante).\n\nEntonces ahí está el primer problema, que apunta bien @Jorge_Madrigal. La inversión requerida es muy alta. Tan sólo una flotilla de 1 camioneta por cada 50,000 habitantes en un país de 120 millones, requiere 39 millones de dólares (a ojo de buen cubero).\n\nEn fin.  \n\nSuponiendo que tenemos 10 veces ese dinero y que nos compramos aviones y toda la onda.\n\nAún así, la pregunta clave es. Cómo generas adopción del nuevo servicio? Supongo que puedes iniciar haciendo envíos intraciudad prometiendo tiempos de entrega de menos de 24 horas. Luego creces a varias ciudades. Luego conectas envíos entre dichas ciudades y luego te expandes a todo el territorio de un país. \n\nHace sentido? Ven una razón fundamental por la cual esto sería imposible?\n\nSuponiendo que el habitante urbano promedio recibe 1 documento/paquete a la semana y habiendo una población urbana de 60 millones (en las 50 ciudades más grandes del país), estamos hablando de 3,120 millones de envíos (mercado potencial). No tengo cifras del sector pero asumiré que el precio de cada envío tiene un promedio de $10 pesos. Si 30% de los envíos se hicieran a través de este nuevo servicio, estaríamos hablando de ventas anuales por ~750 millones de dólares. Asumiendo que el márgen de utilidad es de 5%, las utilidades brutas serían de ~37 millones de dólares anuales.\n\nHasta aquí, esto les hace sentido?\nSuena cómo algo que se le pudiera presentar a inversionistas? Creen ustedes que este tipo de retornos son interesantes?\nCuales creen que sean los elementos clave para que el servicio pudiera tomar el 30% del mercado actual?\nCreen que el mercado crecería a partir de este servicio cómo plantea fservin?\n\nNota: Estoy calculando mientras escribo así que mis comentarios son propensos a todo tipo de errores.", "group_id": 965, "id": 464276}, {"user_id": 6541, "stars": [], "topic_id": 15885, "date_created": 1301369690.153898, "message": "El gran inconveniente aqui seria la infraestructura de traslado. Para la infraestructura logica seria todo un reto en el que me gustaria participar. Imaginese todo el trabajo a implementar usado APIs y generando la propia.", "group_id": 965, "id": 465184}, {"user_id": 10406, "stars": [], "topic_id": 15885, "date_created": 1301368536.3083091, "message": "@nekrox creo que se puede considerar uno de los secretos de grandes empresas europeas pero el punto aplica en relación a la complejidad del problema. Una simple sugerencia que por acá funciona. Ademas de ganar tiempo ganas un equipo maduro con procesos y tecnología probada, no crees?", "group_id": 965, "id": 465009}, {"user_id": 20521, "stars": [], "topic_id": 15885, "date_created": 1301368703.9931891, "message": "Yo igual entendí lo mismo @albrtk. @fservin seria lo mas practico creo yo.", "group_id": 965, "id": 465040}, {"user_id": 10406, "stars": [], "topic_id": 15885, "date_created": 1301368144.7494171, "message": "Ok ahora ya me \"clave\" en el tema. Mi flatmate esta haciendo PhD en logística y me comenta que uno de los secretos para que el servicio postal real alcanzara el nivel de sofisticación que tiene hoy fue la adquisición de pequeñas empresas con este tipo de iniciativas y por pequeñas me refiero a empresas enfocadas a ofrecer el servicio en una región de UK y después conectaron los puntos. Así que tu propuesta no va tan errada. Los del modelo de negocio es otro cosa que en verdad me apasiona hablar pero son las 4 am así que veremos mañana. Mientras comento que lo mas importante en el modelo no es esta vez el mercado ni el capital sino los canales de distribución y los key partners", "group_id": 965, "id": 464868}, {"user_id": 10406, "stars": [], "topic_id": 15885, "date_created": 1301368203.891103, "message": "Key partners!", "group_id": 965, "id": 464892}, {"user_id": 20521, "stars": [], "topic_id": 15885, "date_created": 1301368290.738904, "message": "Entonces es mejor ir comprando empresas regionales :P y dotarlas de mas tecnología que fundar una desde cero?", "group_id": 965, "id": 464921}, {"user_id": 19921, "stars": [{"date_created": 1301368735.4714389, "user_id": 10406}], "topic_id": 15885, "date_created": 1301368563.0805509, "message": "Creo que mas bien @fservin quizo decir que este tipo de empresas son muy propensas a ser adquiridas por el gobierno, lo que permite una alza en la eficiencia y productividad de la empresa que esta haciendo la adquisición. Eso entendí al menos.", "group_id": 965, "id": 465017}, {"user_id": 26085, "stars": [], "topic_id": 15885, "date_created": 1301378079.975878, "message": "@cesarsalazar, no uses copy paste, no se puede leer! Saludos", "group_id": 965, "id": 466615}, {"user_id": 6541, "stars": [{"date_created": 1301380055.1628821, "user_id": 20146}], "topic_id": 15885, "date_created": 1301379629.1781991, "message": "@Jorge_Madrigal me paso igual, despues me di cuenta que existe wrap text arregla todo.", "group_id": 965, "id": 466788}, {"user_id": 24160, "stars": [], "topic_id": 15885, "date_created": 1301414435.0818441, "message": "@Jorge_Madrigal No sabía lo que iba a pasar. El problema es que cuando encuentra saltos de línea lo convierte en un bloque de texto <pre>. Pero como dice @jyr, si le das en el botón de \"wrap text\" mejora un poco la situación", "group_id": 965, "id": 470338}, {"user_id": 3084, "stars": [], "topic_id": 15885, "date_created": 1301426736.7905099, "message": "Una idea interesante sería explorar mecanismos innovadores para el delivering. Por ejemplo que tal usar drones (UAV's) controlados por GPS?", "group_id": 965, "id": 471791}, {"user_id": 20521, "stars": [], "topic_id": 15885, "date_created": 1301428596.405864, "message": "Me sono como a \"mini misiles\" tele dirigidos :P", "group_id": 965, "id": 471944}, {"user_id": 25716, "stars": [], "topic_id": 15885, "date_created": 1301428527.065733, "message": "@willygru drones para delivery? Como?", "group_id": 965, "id": 471934}, {"user_id": 3084, "stars": [], "topic_id": 15885, "date_created": 1301429348.5835879, "message": "@nekrox @dsch Son vehículos voladores no tripulados. Aunque lo de \"mini misiles\" no está muy alejado de la realidad :P", "group_id": 965, "id": 472019}, {"user_id": 26105, "stars": [], "topic_id": 15885, "date_created": 1301432514.236836, "message": "Creo que todo el mundio ha soñado con esto alguna ocasión. Alguna vez un amigo y yo queriamos hacer amazon MX, y una de las cosas/issues era precisamente que como parte del esfuerzo o como spinoff, iba a surgir una compañia de envios.", "group_id": 965, "id": 472417}, {"user_id": 25716, "stars": [{"date_created": 1301465892.4799149, "user_id": 2946}], "topic_id": 15885, "date_created": 1301463475.895119, "message": "Yo tengo un poco ideas (inspirada de europa);\n1) Oficinas de correos centrales donde la oficina notificara solo con carta / e-mails / sms / teléfono que un paquete está listo para recogerlo.\n2) Estaciones de correos automáticas, donde se escribe una identificación y un password y obtener el paquete (existe en Europa, los usuarios pagan por el servicio, pero se garantiza la entrega rápida)\n\nTrack n' Trace es muy normal en Europa, el cartero acaba de registrar todas las paradas e.g., País A -> País B -> Oficina de Correos Nacional -> Oficina de Correos Comunal -> Oficina de Correos local -> Tu Casa\n\nHe visto y trabajó en empresas de correo que no han podido sobrevivir. Creo que se necesita apoyo muy fuerte del gobierno o de comenzar con mercado pequeño, por ejemplo, solo correo de comercial en una ciudad y comprar / expandir al mismo tiempo ser capaz de tener mucho de la gestión de riesgos.\n\nSolo ideas :D", "group_id": 965, "id": 478219}, {"user_id": 26089, "stars": [], "topic_id": 15885, "date_created": 1301497106.666368, "message": "Creo que un punto importante es tener como socio a alguién que ya tenga experiencia en el negocio de paquetería y envíos, para poder tener el dominio de \"como se hace ahora\" y los \"puntos dolorosos\" donde puede ayudar la tecnología. Además pensando en sólo ser el emprendimiento que va a hacer que las empresas actuales se modernicen vs. ser una nueva empresa nueva de paquetería, creo que puede ser algo más facil de vender a inversionistas ya que presenta menos riesgo (y por lo tanto requiere menos capital)", "group_id": 965, "id": 482121}, {"user_id": 26089, "stars": [], "topic_id": 15885, "date_created": 1301496384.4037869, "message": "Y si en vez de tratar de hacer una empresa de paquetería desde cero, mejor pensar en crear una proveedora de servicios que precisamente ofrezca todo lo necesario desde el punto de vista tecnológico para que empresas de paquetería existentes lleguen a ese nivel de calidad en costos bajos. Si le funciona a una empresa se debe ver reflejado en sus márgenes de utilidad y la competitividad. Eso validaría la idea de negocio y creo que sería razonable que las demás empresas de paquetería querrían también entrarle.", "group_id": 965, "id": 481999}, {"user_id": 26089, "stars": [], "topic_id": 15885, "date_created": 1301496586.854712, "message": "Problemas que veo con el approach que describo son estos: Seguramente si vas con la paquetería \"A\" ofreciéndole la capacidad de modernizarse, \"A\" estaría interesado en que su competencia NO tuviera acceso a esta modernización, por lo que tal vez trataría de imponer un contrato de exclusividad o con derecho a veto.", "group_id": 965, "id": 482038}, {"user_id": 26089, "stars": [], "topic_id": 15885, "date_created": 1301496726.73348, "message": "El valor de la idea es que sería un habilitador para crear nuevas líneas de negocios y mercados, en especial para fortalecer negocios de eCommerce en México. Con ese argumento podrías buscar apoyos de la SE o del Conacyt (estoy pensando en ProInnova y Prosoft)", "group_id": 965, "id": 482062}, {"user_id": 26200, "stars": [], "topic_id": 15885, "date_created": 1302069966.4367781, "message": "Respondiendo a la pregunta original yo pienso que sí es factible siempre y cuando no trates de competir directamente con las empresas que ya están establecidas y peor aun tratar de estructurar la idea alrededor de una logística que todas estas entidades han empleado y refinado desde hace ya mucho tiempo. En el espíritu del Startup hay que pensar cual es el problema que los sistemas tradicionales de correo no me están resolviendo y generar la idea desde ahí, en particular ‘mi problema’ es este: digamos que vivo en Coyoacán y tengo un DVD que me urge darle a mi cuate que vive en Satélite, finalmente acordamos vernos en Metro Hidalgo porque ahí cruzamos caminos en los destinos de cada quién, pero como es clásico en el DF, resulta que el metro se para a cada rato y después de 4 rolas de Justin Bieber sin poder avanzar de Centro Médico... @#$%&! Pero también mi cuate no puede llegar a Cuatro Caminos porque el tráfico esta literalmente parado; me salgo del metro y tomo un taxi porque me urge llegar a mi destino pero no sin antes contactar al 'servicio de mensajería' para que le entregue el DVD en donde pueda entregárselo y tan tán, fin de la historia para el usuario.\n\nPorque no crear un sistema de paquetería en donde el origen y el destino están en movimiento, o si queremos un ejemplo mas corporativo, recibir y enviar paquetería en una terminal de autobuses o aeropuerto cuando el usuario está en espera de su siguiente conexión (¿existe ya eso en otro lugar?); Ahora ¿esta idea tendría la suficiente demanda para ser factible? ¿O el hecho de existir crearía la demanda? y lo mas importante a mi parecer, ¿este sistema se podría escalar hacia otros servicios (surtir al comercio electrónico) y eventualmente darle buena competencia a las empresas supuestamente mas que establecidas?", "group_id": 965, "id": 555256}, {"user_id": 2946, "stars": [], "topic_id": 15885, "date_created": 1302114622.718503, "message": "@tidbitsum Por qué -- gracias a Dios-- no todo el mundo es el Distrito Federal? :P", "group_id": 965, "id": 562670}, {"user_id": 26200, "stars": [], "topic_id": 15885, "date_created": 1302145765.8370211, "message": "@soska bueno no me se los pormenores del caos vial en otras ciudades, debí poner <inserte su caos de transporte aquí>  =P", "group_id": 965, "id": 569794}, {"user_id": 26200, "stars": [], "topic_id": 15885, "date_created": 1303781276.5009191, "message": "http://m.wired.com/rawfile/2011/04/bike-messengers/all/1", "group_id": 965, "id": 808869}]