[{"user_id": 11626, "stars": [], "topic_id": 40896, "date_created": 1309483987.819804, "message": "AntiSec hackers pwn Arizona \"police state\" yet again\r\nTG Daily\r\nJun 29th 2011\r\n\r\nHackers associated with Anonymous and the rapidly evolving AntiSec movement have pwned and owned Arizona law enforcement officials for the second time.  \u2028\u2028\r\n\r\nReleased under the banner of \"Chinga La Migra Bulletin #1,\" the first digital raid - executed by the now defunct Lulz Security - yielded a virtual treasure trove of data, such as hundreds of private intelligence bulletins, training manuals, personal email correspondence, names, phone numbers, addresses and passwords.\r\n\r\n[img]http://www.tgdaily.com/sites/default/files/stock/article_images/misc/antisecarizonaraid.jpg[/img]\r\n\r\nThe second cyber operation against Arizona law enforcement officials was apparently far more personal and embarrassing, with a wide range of digital \"booty\" collected, including: names, addresses, phone, numbers, passwords, social security numbers, online dating account info, voicemails, chat logs, and \"seductive girlfriend pictures\" belonging to a dozen Arizona police officers.\r\n\r\n\"We found more internal police reports, cops forwarding racist chain emails, k9 drug unit cops who use percocets, and a convicted sex offender who was part of FOP Maricopa Lodge Five. We also hit the AZDPS spokesperson Stephen Harrison who [has] been bragging to the news about how they are upgrading their security and how they will catch the evil hackers who exposed them,\" the hackers confirmed in an official communiqué.\r\n\r\n\"Clearly not secure enough, because we owned his personal Hotmail, Facebook and Match.com accounts and dumped all his personal details for the world to see. The same fate will meet anyone else who tries to paint us as terrorists in an Orwellian attempt to pass more pro-censorship or racial-profiling police state laws.\"\r\n\r\nInterestingly enough, the AntiSec hackers acknowledged the latest data dump could potentially put law enforcement officials at risk.\r\n\r\nHowever, they expressed little sympathy for a police force who they claimed \"lock people up for decades, get away with brutality and torture, discriminate against people of color, [and] make and break\" their own laws.\r\n\r\n[img]http://www.tgdaily.com/sites/default/files/stock/article_images/misc/lulzantisecurity.jpg[/img]\r\n\r\n\"We are making sure they experience just a taste of the same kind of violence and terror they dish out on an every day basis. Our advice to you is to quit while you still can and turn on your commanding officers before you end up in our cross hairs next, because we're not stopping until every prisoner is freed and every prison is burned to the ground.\r\n\r\n\"To other hackers: it's time to set aside our differences and join the antisec popular front against the corrupt governments, corporations, militaries, and law enforcement of the world. Unite and fight, for the flames of revolution burn bright.\"\r\n\r\nArizona state police are currently reviewing the pilfered data and have confirmed the personal email accounts of some officers were targeted by digital infiltrators. \r\n\r\nhttp://www.tgdaily.com/security-features/56945-antisec-hackers-pwn-arizona-police-state-yet-again", "group_id": 3920, "id": 1536394}]