[{"user_id": 541, "stars": [], "topic_id": 47089, "date_created": 1319654319.9152839, "message": "I'm the founder and team lead at &yet and I'm excited about krtconf because our team has been building realtime web + mobile apps for the last couple years—both for clients and for our own products. We've used a variety of different methods building them and made friends in several realtime communities. The idea for the conference came out of discussions that @henrikjoretg, @fritzy, and I had in Brussels in February early this year. We couldn't be more excited with how things have shaped up for krtconf so far after 8 months of hard work! :)", "group_id": 12014, "id": 2439993}, {"user_id": 541, "stars": [], "topic_id": 47089, "date_created": 1319654337.6785929, "message": "Whoops, typo there — @henrikjoreteg", "group_id": 12014, "id": 2439997}, {"user_id": 541, "stars": [], "topic_id": 47089, "date_created": 1319653879.6241059, "message": "Give us an introduction and let us know what you're working on and why you're excited about krtconf!", "group_id": 12014, "id": 2439965}, {"user_id": 540, "stars": [], "topic_id": 47089, "date_created": 1319655080.055099, "message": "Hello, I'm a partner and JS guy at &yet. We're only two weeks out! This conference is going to be amazing, I'm super excited to see KRTConf become a reality. I've been cranking away at our upcoming product: \"&!\" http://andbang.com. It's a realtime \"same-pagification\" tool. I'm also going to be speaking at the conference on the various ways and tools I've used to build a bunch of different realtime singlepage apps. See ya at the conference.", "group_id": 12014, "id": 2440062}, {"user_id": 542, "stars": [], "topic_id": 47089, "date_created": 1319654792.6571281, "message": "O HAI. I'm the architect at &yet, and I'm looking forward to you guys showing me new toys to play with! The toy I'm bringing is Thoonk -- high level objects that you can subscribe to changes on that is cross language and powered by Redis.", "group_id": 12014, "id": 2440045}, {"user_id": 33563, "stars": [], "topic_id": 47089, "date_created": 1319658729.4770441, "message": "I'm working on distributed implementations for Socket.io: RedisStore, socket.io-announce and socket.io-zero. I'm also working on a secret project which takes some of what I've learned from RedisStore Pub/Sub and extends that to a larger network of Node processes. - @dshaw", "group_id": 12014, "id": 2440456}, {"user_id": 42802, "stars": [], "topic_id": 47089, "date_created": 1319666840.250459, "message": "Hello. I'm the founder of http://cerrio.com. We're working on ways to make it simple to slice, dice and mix data streams without losing your mind. This gets harder when those streams have millions of messages per second. At the other end of the spectrum, we built http://x-stream.ly to make it just as simple as we possibly could for people to add some real-time interactivity to their web apps. This conf looks like it's going to be awesome. Really impressive speaker list.", "group_id": 12014, "id": 2441510}, {"user_id": 42839, "stars": [], "topic_id": 47089, "date_created": 1319727545.755959, "message": "Hi, I'm Jacob (@jac_). I'm not working on anything realtime. Yet. But I think most apps can benefit from a realtime component at the very least. I work at Jive Software doing social media monitoring and I'm working on http://twig.io on the side. I'm really excited for krtconf.", "group_id": 12014, "id": 2446547}, {"user_id": 28122, "stars": [], "topic_id": 47089, "date_created": 1319729849.444001, "message": "Also looking forward to drinking excellent craft beer, and celebrating my birthday on Sunday :)  Any, uh, connection between those two things would be purely coincidental, I'm sure.", "group_id": 12014, "id": 2446746}, {"user_id": 28122, "stars": [], "topic_id": 47089, "date_created": 1319729737.6577749, "message": "Howdy folks!  I'm a Ruby & JS programmer, wrapping up 3½ years at http://thoughtbot to strike out and travel the world.  Doing a lot of Backbone lately.  Did some Faye and liked it.Looking to meet awesome folks, talk about what awesome stuff you are doing, from the flashy flashy, to product development, to CAP theorem and distributed computing patterns & algorithms.", "group_id": 12014, "id": 2446738}, {"user_id": 42944, "stars": [], "topic_id": 47089, "date_created": 1320002376.3069971, "message": "I work at Splunk, specifically at the team that's in charge of helping out developers build on top of Splunk. Right now I'm finishing up our JavaScript SDK. I have many interests in \"realtime\", but I think it's especially important for something like Splunk where getting data in and out as fast as possible can provide enormous value.", "group_id": 12014, "id": 2470242}, {"user_id": 42944, "stars": [], "topic_id": 47089, "date_created": 1320002424.2593651, "message": "Also, beer and parties are good too. Sounds like Jay is fishing for a free pint or two. :)", "group_id": 12014, "id": 2470249}, {"user_id": 28122, "stars": [], "topic_id": 47089, "date_created": 1320333066.703033, "message": "Has anyone procrastinated as much as me and hasn't booked a room yet?  Interested in splitting a 2-queen at the conf hotel?  Looking for a room Sunday and Monday nights.", "group_id": 12014, "id": 2499176}]