[{"user_id": 26258, "stars": [], "topic_id": 42746, "date_created": 1311706560.0971429, "message": "Check it out: http://www.wil.lt", "group_id": 95, "id": 1725388}, {"user_id": 34806, "stars": [], "topic_id": 42746, "date_created": 1311712351.4334171, "message": "I'm not your target audience (yet), but this looks pretty cool", "group_id": 95, "id": 1726091}, {"user_id": 4149, "stars": [{"date_created": 1311782341.254283, "user_id": 13735}], "topic_id": 42746, "date_created": 1311724606.0908289, "message": "there is ONE HUGE issue with your software, there is no way to add in dynamic page urls, or any api, plus iframes are so no the right way to go, try a javascript solution that would be better and probably save you bandwidth cost", "group_id": 95, "id": 1727315}, {"user_id": 26258, "stars": [{"date_created": 1311782343.3506539, "user_id": 13735}], "topic_id": 42746, "date_created": 1311781817.828335, "message": "Great idea @italiano40!  Dynamic page urls we can add pretty quickly.  You can also use your own button and call our tweeter which will generate the unique tracking url.\n\nWhy the hate for iframes?  We have a good (non-blocking, asynchoronous) javascript solution, but CSS is a real pain.  iframe's are the only way to guarantee no CSS name collisions.", "group_id": 95, "id": 1732065}, {"user_id": 15929, "stars": [{"date_created": 1311783630.059314, "user_id": 13735}], "topic_id": 42746, "date_created": 1311782973.548326, "message": "yep, nothing's wrong with iframe. although you should use a JS file that generate the iframe (like google ads). that way you'll be able to do more functional embeds... like calling window.location from parent frame, api key, etc...", "group_id": 95, "id": 1732205}, {"user_id": 4149, "stars": [], "topic_id": 42746, "date_created": 1311783982.128793, "message": "@fraserharris iframe are ruining the web there are no good things that come from it, the true real world solution is a javascript that renders a button with CSS that has long unique name, that is how google renders there +1 button, that is how twitter renders there button, plus you it would just make the experience that much better, remember you have a lot of steps plus your site name isn't really known so i think to get people to click the button would take a lot, then when they hit the API wall gate to hit connect also takes a lot of trust, and you guys have to build it, and half assing it isn't the way you need to go", "group_id": 95, "id": 1732347}, {"user_id": 33669, "stars": [{"date_created": 1311858213.9019821, "user_id": 15929}, {"date_created": 1311893162.6076031, "user_id": 1363}], "topic_id": 42746, "date_created": 1311845748.0156131, "message": "@italiano40 pretty sure the Twitter, Google and Facebook buttons are iframes generated by JS", "group_id": 95, "id": 1737717}, {"user_id": 4149, "stars": [], "topic_id": 42746, "date_created": 1311872934.723953, "message": "@boo_ly first off never said Facebook because that is an iframe but twitter and the google +1 isn't an iframe so yea install an iframe blocker it will not block those but Facebook it will js", "group_id": 95, "id": 1740850}, {"user_id": 4149, "stars": [], "topic_id": 42746, "date_created": 1311873471.2061889, "message": "@boo_ly i think you were getting confused with the option of having an iframe but the js version is not the same https://dev.twitter.com/docs/tweet-button#using-an-iframe", "group_id": 95, "id": 1740926}, {"user_id": 15929, "stars": [], "topic_id": 42746, "date_created": 1311874189.750541, "message": "@italiano40 I think @boo_ly got it right... even the js version will generate iframe.", "group_id": 95, "id": 1741029}, {"user_id": 4149, "stars": [], "topic_id": 42746, "date_created": 1311875786.2311161, "message": "@unwrangle @boo_ly can either one of you find a site that says, because there is nothing that says it is an iframe, plus if you have iframe blocking extension it will not block either twitter or google+ button, i almost 99% sure they use JS to render it, not an iframe", "group_id": 95, "id": 1741258}, {"user_id": 15929, "stars": [], "topic_id": 42746, "date_created": 1311876070.768898, "message": "http://jsbin.com/eroyox", "group_id": 95, "id": 1741313}, {"user_id": 15929, "stars": [], "topic_id": 42746, "date_created": 1311876097.0726321, "message": "and I can't use any iframe blocker. I use gmail...", "group_id": 95, "id": 1741324}, {"user_id": 3444, "stars": [], "topic_id": 42746, "date_created": 1311880439.3308461, "message": "...the JavaScript for Google +1 and Twitter's button CLEARLY insert an iFrame. Like others have said, this is the only way to guarantee that there are no CSS name collisions. Even if you use HIGHLY unique names for your CSS classes (stupid to do that anyways) there is still a chance (albeit  a minimal one) that there will be a naming collision.", "group_id": 95, "id": 1741887}, {"user_id": 4149, "stars": [], "topic_id": 42746, "date_created": 1311881357.6017821, "message": "@CrowderSoup http://i.imgur.com/jBOIB.png actually google DOESN\"T use an iframe, and twitter does have an all javascript solution but it contains an api key and i don't feel like sharing that, so yea google uses a button and they use an ID that is unique so your wrong", "group_id": 95, "id": 1741989}, {"user_id": 15929, "stars": [], "topic_id": 42746, "date_created": 1311927381.4892199, "message": "I'm not sure how you ended up with that button. but based on http://www.google.com/webmasters/+1/button/ I got http://jsbin.com/utejuc/ (iframe).", "group_id": 95, "id": 1746022}, {"user_id": 15929, "stars": [], "topic_id": 42746, "date_created": 1311927536.6762979, "message": "twitter button with API key, isn't that defeats the purpose of having these buttons to be technically-challenged friendly?", "group_id": 95, "id": 1746032}, {"user_id": 33669, "stars": [], "topic_id": 42746, "date_created": 1311928090.58149, "message": "@italiano40 - looks like you have pasted a code snippet for a G+ button from a google search. All of the twitter and G+ share buttons I have seen use Iframes, either generated by JS or raw html that you copy and paste (you can see an example of them all here  - view the generated source or inspect element to see the iframes) http://jsbin.com/ogalim/edit . There are a number of reasons they use iframes but my guess would be 1. cross domain ajax is a pain in older browsers,  2. you can collect more user data using an iframe . ", "group_id": 95, "id": 1746063}, {"user_id": 26258, "stars": [{"date_created": 1311950315.8389909, "user_id": 3444}], "topic_id": 42746, "date_created": 1311941110.5256181, "message": "@boo_ly That is why we use an iframe.  @italiano40 You have no made a very compelling case why \"iframes are ruining the web\".  They are embedded content, pure and simple.", "group_id": 95, "id": 1746676}]