[{"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312280071.3619809, "message": "Spoiler thread for those who've finished Dance with Dragons. If you haven't finished the book, GTFO NOW.", "group_id": 9493, "id": 1773658}, {"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312280483.521606, "message": "So who do we believe Azor Ahai is? Dany or Jon? That quote from Mel's chapter \"I pray for a glimpse of Azor Ahai, and R'hllor shows me only Snow\" kinda seals the deal for me.", "group_id": 9493, "id": 1773696}, {"user_id": 35617, "stars": [], "topic_id": 43142, "date_created": 1312281673.2218139, "message": "Ooh, I completely missed that line.\n\nYeah, I'm thinking Jon as well. Especially since Azor Ahai's flaming sword is mentioned so frequently along with how often it's mentioned that Valyrian steel would most likely be effective against the Others. So Longclaw might be very important there.\n\nI kinda felt that Quentyn's arc was rather pointless until I read the speculation that he may have been the sun that sets in the east. \n\nAegon. Think he's the real Aegon or not? At least now we know what Varys' end goal is. Seeing Aegon on the throne.", "group_id": 9493, "id": 1773763}, {"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312284657.4690061, "message": "I think he's the real Aegon, yes. The dragon has three heads, after all. And with him in the picture there are now exactly three Targaryens in existence.", "group_id": 9493, "id": 1773991}, {"user_id": 35617, "stars": [], "topic_id": 43142, "date_created": 1312284900.431797, "message": "Aegon, Dany and (presumably) Jon?", "group_id": 9493, "id": 1773998}, {"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312285223.4671891, "message": "Yup.", "group_id": 9493, "id": 1774007}, {"user_id": 35617, "stars": [], "topic_id": 43142, "date_created": 1312285984.8030729, "message": "And of course we can also speculate as to the fate of Stannis. I pretty much think that Ramsay's letter is a lie.\n\nPresumably the banker would have delivered Jon's message about Arnolf Karstark's planned betrayal. And if Ramsay had defeated Stannis, then presumably he would have found Theon and Jeyne there.\n\nAdd to that Wyman Manderly's unknown status and the trouble he would have caused inside Winterfell after the one person holding the alliance together had been kidnapped...", "group_id": 9493, "id": 1774055}, {"user_id": 35617, "stars": [], "topic_id": 43142, "date_created": 1312289511.7049589, "message": "This page also amuses me:\n\nhttp://tvtropes.org/pmwiki/pmwiki.php/WMG/ASongOfIceAndFire", "group_id": 9493, "id": 1774392}, {"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312287969.8479109, "message": "Agree with everything there, yes.\n\nWhat do you think of that Jaime/Brienne scene? I honestly don't know what to make of it. Was that really her (presumably, Thoros can cast glamours like Mel can)? Has she been resurrected by Thoros? And where is she taking Jaime? My first thought was that she'd bargained with Catelyn, that she was luring Jaime back to Cat so she could unleash bloody vengeance upon him. But that seems completely out of character for Brienne.", "group_id": 9493, "id": 1774208}, {"user_id": 31852, "stars": [], "topic_id": 43142, "date_created": 1312288946.5913529, "message": "Yes. For some reason, I just never found those to be \"epic\" enough to be something that had been prophetically foretold.", "group_id": 9493, "id": 1774314}, {"user_id": 35617, "stars": [], "topic_id": 43142, "date_created": 1312288770.524838, "message": "Either that or she told Cat that was what she was going to do, but tried to save Jaime instead. I do think it's really Brienne, though.\n\nI also wonder about Dany's three betrayals. I'm not entirely convinced that Jorah was the betrayal for love and Brown Ben Plumm the betrayal for gold. I think there might be more betrayals in store.", "group_id": 9493, "id": 1774294}]