[{"user_id": 7664, "stars": [], "topic_id": 8457, "date_created": 1298496760.50986, "message": "I'm trying to parse out the four throughlines of movie based on a long prose description. The central focus of the movie is sports, and *almost* everyone involved in involved in that. Enough so, that it seems like it is clearly the OS Throughline. But, it's not the thing that affects absolutely everybody. The personal life of the MC involves an ailing mother and her nurse, who is confined to the hospital. Does the OS really have to cast an umbrella over everything and everybody? Or can someone be specifically confined to a throughline?", "group_id": 2515, "id": 191392}, {"user_id": 10814, "stars": [], "topic_id": 8457, "date_created": 1298498678.270581, "message": "Other characters can be exclusive to throughlines other than the OS.  It is not uncommon.", "group_id": 2515, "id": 191769}, {"user_id": 7712, "stars": [], "topic_id": 8457, "date_created": 1298499388.1725199, "message": "Option 2:\nMC - emphasis human compassion\nIC - emphasis sports\nSS - same as above", "group_id": 2515, "id": 191989}, {"user_id": 7712, "stars": [], "topic_id": 8457, "date_created": 1298499673.17786, "message": "Even though the focus may be sports, I would find it a difficult story to believe if sports were the overall throughline because an immediate relative confined to the hospital creates a tremendous amount of grief in the average family (as far as hospice-training-statistics are concerned).", "group_id": 2515, "id": 192078}, {"user_id": 7712, "stars": [], "topic_id": 8457, "date_created": 1298499359.150311, "message": "My initial feelings on the matter, based on my experience as a former hospice volunteer and very superficial understanding of your prose description, is that very deep, emotional drama can be explored in a few ways:\n\n(remember I don't know anything about what you are really working with)\n\nOption 1: \nMC  - emphasis sports\nIC - emphasis human compassion (the need for the MC to be there for his mother)\nSS - the internal conflict of the MC\n\nOption 2:", "group_id": 2515, "id": 191982}, {"user_id": 7664, "stars": [], "topic_id": 8457, "date_created": 1298500697.4753571, "message": "The reason the sports are the OS is exactly because of what you said -- the grief *in the family* doesn't spread to all the characters. It's the MC's thing.", "group_id": 2515, "id": 192294}, {"user_id": 7664, "stars": [], "topic_id": 8457, "date_created": 1298572216.491643, "message": "@Chris_Huntley, the characters that are exclusive to other throughlines... I'm assuming that they do not have the OS Problem as their Problem, the way everyone in the OS does.", "group_id": 2515, "id": 200057}, {"user_id": 10814, "stars": [], "topic_id": 8457, "date_created": 1298572424.595752, "message": "Each throughline has its own problem, and therefore characters working exclusively in that throughline are bound to the story points of that throughline.", "group_id": 2515, "id": 200081}]