[{"user_id": 1752, "stars": [], "topic_id": 12019, "date_created": 1299769810.21541, "message": "What's the sandwich that you dream of having again? In the best interests of honesty, don't worry about the calories/fat/sodium/artery clogging properties at all...just the deliciousness that you would sell your kidney to have again.", "group_id": 1105, "id": 314016}, {"user_id": 4038, "stars": [], "topic_id": 12019, "date_created": 1299770380.19643, "message": "Having again? Well I actually have to say my fav sandwich is just downstairs from work at the Spicy Pickle. It is called the Gobbler and it is everything good in this world.", "group_id": 1105, "id": 314143}, {"user_id": 6511, "stars": [], "topic_id": 12019, "date_created": 1299770447.443079, "message": "Do burgers count as sandwiches? Last summer I had the best burger of my life at the Jamesport Brewery in Ludington, Michigan. Ironically enough, the beer at the brewery wasn't all that great... but good god, that burger was exquisite.", "group_id": 1105, "id": 314145}, {"user_id": 1752, "stars": [], "topic_id": 12019, "date_created": 1299771114.804199, "message": "@theaaronc Yes.", "group_id": 1105, "id": 314217}, {"user_id": 6511, "stars": [], "topic_id": 12019, "date_created": 1299771931.916455, "message": "@cym0n @blogkitten I'd love to have a true philly cheesesteak... although, I've been informed that in Philly it's just called a \"cheesesteak\"; and you'd be ridiculed (or worse) for calling it otherwise O_o", "group_id": 1105, "id": 314345}, {"user_id": 1752, "stars": [], "topic_id": 12019, "date_created": 1299769877.5777941, "message": "Mine would be the mushroom pepper cheesesteak (with provolone!) from Pat's Steaks in Philly. DEAR GOD. I don't want to think about what the calories/fat/sodium/artery clogging properties are in that sandwich...but jeebus is that a tasty sandwich.", "group_id": 1105, "id": 314031}, {"user_id": 4038, "stars": [], "topic_id": 12019, "date_created": 1299770604.343308, "message": "Having for the first time....reading your (@blogkitten) post reminds me that I have always wanted to get a legit philly cheese steak from philly. Never been to philly and never had a philly cheesesteak from philly so I can't say if I have had a good philly cheese steak or not.", "group_id": 1105, "id": 314156}, {"user_id": 1752, "stars": [], "topic_id": 12019, "date_created": 1299771197.929033, "message": "@cym0n A true Philly cheesesteak is light years above and beyond anything else called a \"cheese steak\" anywhere else. I don't know what's in the water in Philly, but the taste can't be duplicated, IMO.", "group_id": 1105, "id": 314223}, {"user_id": 7402, "stars": [], "topic_id": 12019, "date_created": 1299773808.7727051, "message": "Oh, God, I can't choose. There were two restaurants in my little town (that have since closed). One had amazing burgers; the other had incredible pork tenderloins that were bigger than your head. And even though I don't eat red meat any more, a huuuuuge part of me misses the Triple XXX diner at Purdue, where I would always get the Boilermaker Pete. Okay, now I miss home.", "group_id": 1105, "id": 314606}, {"user_id": 581, "stars": [], "topic_id": 12019, "date_created": 1299774293.1689329, "message": "I just love the grilled cheese I make!", "group_id": 1105, "id": 314649}, {"user_id": 581, "stars": [], "topic_id": 12019, "date_created": 1299776464.2961531, "message": "Jalepeno Jack on sourdough Aw yeah !!", "group_id": 1105, "id": 314806}, {"user_id": 5796, "stars": [], "topic_id": 12019, "date_created": 1299775724.488296, "message": "Now I'm craving a cheesesteak. Gotta admit though, they're pretty darn good wit wiz.\n\nWith that said, I would have like a bmt style sandwich on sourdough would suit me just fine.", "group_id": 1105, "id": 314741}, {"user_id": 4095, "stars": [], "topic_id": 12019, "date_created": 1299778706.0201809, "message": "While Pat's and Geno's are Philly landmarks, it's more about the atmosphere there.  Hanging out in South Philly, eatin' a cheesesteak and just enjoying the scene..usually at 2AM when the bars close.  They're cheesesteaks are good, but there's plenty of much better cheesesteaks to be had.  I'm a fan of Jim's Steaks for a standard cheesesteak wit wiz (that's w/ fried onions and cheese wiz).  I like the mushroom and provolone variety as well.  Tony Luke's is good too but they've become too commercial.  Ishkabible's is known for their excellent chicken cheesesteaks and vegetarian cheesteaks.  One of the best (some consider them the benchmark) is Dalessandro's Steaks in the Roxborough section of Philly.  Their cheesesteaks are a truly amazing experience.\n\nEveryone in town has their preferred vendor.  But it all comes down to the bread, there are others but Amoroso's is the best.  That's one of the big reasons it's hard to get a really good cheesesteak outside of the Philly area...they don't have access to Amoroso's.  That and they don't seem to get the concept of thinly sliced beef. \n\nIf you want a really amazing sandwich (besides a cheesesteak), you have to try a Dinic's roast pork sandwich.  They're in the Reading Terminal Market.  Definitely a sandwich of your dreams.  The smell alone will drive you insane!  So friggin good!!!", "group_id": 1105, "id": 315131}, {"user_id": 4859, "stars": [], "topic_id": 12019, "date_created": 1299785188.00879, "message": "There is a sort of BBQ sandwich that you can only get in North Carolina. Haven't had one in a long time... there are some really great Ruben's in NYC where they are typically 24oz for some reason... also the menu at http://www.habitburger.com/ is pretty excellent. I like the char swiss which is under 3 bucks and style of In-and-out but quality is way better. no shops near me now though :-\\", "group_id": 1105, "id": 315674}, {"user_id": 1752, "stars": [], "topic_id": 12019, "date_created": 1299792406.843605, "message": "@georgalis That reminds me....we have a Five Guys near us now! SHOOT. Now I want a burger....", "group_id": 1105, "id": 316549}, {"user_id": 581, "stars": [], "topic_id": 12019, "date_created": 1299802911.47982, "message": "We just had croissants with banana, peanut butter and Nutella in them. Kind of amazing. I don't have a crazy sweet tooth, though, so not the sandwich of my dreams :-p", "group_id": 1105, "id": 317864}, {"user_id": 3465, "stars": [], "topic_id": 12019, "date_created": 1299802856.476012, "message": "Peanut butter", "group_id": 1105, "id": 317854}, {"user_id": 6076, "stars": [{"date_created": 1300045431.018892, "user_id": 11647}], "topic_id": 12019, "date_created": 1299847730.960314, "message": "A good Cuban any day!", "group_id": 1105, "id": 321697}, {"user_id": 313, "stars": [], "topic_id": 12019, "date_created": 1299933525.1283481, "message": "Best sandwich? - Well, aside from those that come out of my own kitchen, I would say a \"Po-boy\" sandwich from Mothers Restaurant in New Orleans.  By the way, the secret to a tastier sandwich - lightly salt and pepper the tomato slices. Yummmmm.", "group_id": 1105, "id": 331440}, {"user_id": 6511, "stars": [], "topic_id": 12019, "date_created": 1299944088.768692, "message": "@james Now that I think about it, I don't think I've ever put salt and pepper on tomatoes I've put in sandwiches; Which is odd because that's how I love to eat them plain.", "group_id": 1105, "id": 332762}, {"user_id": 11647, "stars": [], "topic_id": 12019, "date_created": 1300045664.3399501, "message": "Probably the best chicken sandwich ever: green pesto with pine nuts, goat cheese, lettuce, onions, and jalapeño peppers.", "group_id": 1105, "id": 343042}]