[{"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301363844.081413, "message": "http://bit.ly/hICfSo supongo que por esas definiciones \"Reunir los textos e ilustraciones para formar las páginas completas\"", "group_id": 8002, "id": 464153}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301364990.577343, "message": "Pues para maquetar no hace falta saber diseñar por lo general maquetas, un diseño ya hecho un PSD o algo así.", "group_id": 8002, "id": 464275}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301364859.9374499, "message": "con esa definición pareciera que no hay trabajo de diseño involucrado, es \"pura talacha\"", "group_id": 8002, "id": 464247}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301363236.5122299, "message": "¿cual sería la traducción a ingles de este término?", "group_id": 8002, "id": 464114}, {"user_id": 20522, "stars": [], "topic_id": 15911, "date_created": 1301364981.335988, "message": "En mi experiencia maquetar es pura talacha, ya diseñar una UI acá bien acá, es algo diferente que va mas por parte del diseño y la planeación de la app o la cosa que andes maquetando", "group_id": 8002, "id": 464270}, {"user_id": 20522, "stars": [], "topic_id": 15911, "date_created": 1301365054.495456, "message": "Yo lo veo como dos cosas diferentes, casí siempre el que maqueta es un wey todo X, y el que diseña la UI es diseñador o alguien que sabe de usabilidad y así.", "group_id": 8002, "id": 464290}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301365445.566149, "message": "y aun que no sepa html, con que sepa diseñar bajo \"algún standar\" y sepa diseñar bien la UI en PS creo que va bien, la \"maquetada\" la puede hacer otra persona. Snif a algo mas o menos en enfrento ahora ando buscando material para poder darme a entender :P y tener ya una metodología para hacer los diseños.", "group_id": 8002, "id": 464368}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301364990.186028, "message": "me da la impresión que el trabajo de diseño y UI está bastante menospreciada en la cultura webdev de estos lares hasta en el lenguaje, como si fuera algo sencillo y aburrido, cuando creo es la parte más compleja de la mayoría de los sites (si estuvieran bien hechos)", "group_id": 8002, "id": 464274}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301365054.2986791, "message": "De acuerdo, esta muy menos preciado y hay poca gente que realmente le haga bien a eso. La mayoría de los diseñadores tienen pocos conocimientos de diseño e UI's.", "group_id": 8002, "id": 464289}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301366174.482492, "message": "Cuando me refiero a que diseñe la UI no solo por lo bonito, creo que el diseñador web DEBE saber diseñar UI's con todo lo que esto implica, creo que les enseñan mas cosas que hacer cosas bonitas a los diseñadores.", "group_id": 8002, "id": 464484}, {"user_id": 20521, "stars": [{"date_created": 1301382497.2676251, "user_id": 6227}], "topic_id": 15911, "date_created": 1301367286.65728, "message": "Ohh ya te entendí y tienes razón, de hecho es lo que estoy tratando de cambiar por lo general me dan un diseño y yo me las ingenio, ahora trato de poner un standar para que hagan los diseños en base a lo que yo necesito.", "group_id": 8002, "id": 464629}, {"user_id": 6227, "stars": [{"date_created": 1301365337.6574459, "user_id": 20522}], "topic_id": 15911, "date_created": 1301365309.3106489, "message": "@nekrox cierto, se me olvida es práctica común poner a un diseñador sin puta idea de html a hacer \"el diseño\", terrible en mi opinión, si no lo puedes hacer directamente en html/css no tienes porque estar diseñándolo. Debieran solo afinar detalles de colores y logos del prototipo hecho por el programador de UI.", "group_id": 8002, "id": 464337}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301365869.817323, "message": "@nekrox pero creo que ese proceso esta equivocado en lo más elemental. Poner al diseñador a hacer un PSD es asignarle más importancia a \"lo bonito\" sobre \"lo funcional\". El programador es el que tiene que a fuerzas tiene que endender como y para que va a usar la gente el site o app, el diseño del UI no puede estar separado del resto de la programación, hacerlo bonito viene después.", "group_id": 8002, "id": 464434}, {"user_id": 24690, "stars": [], "topic_id": 15911, "date_created": 1301365924.765245, "message": "Es que muchas veces ponen a un diseñador grafico a diseñar para web, entons el pobre ni puta idea tiene de lo que debe hacer", "group_id": 8002, "id": 464446}, {"user_id": 24690, "stars": [], "topic_id": 15911, "date_created": 1301365943.5121281, "message": "O sea, se va por lo estético más que porque sea funcional o interfaz usable", "group_id": 8002, "id": 464448}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301367093.0664721, "message": "@nekrox pero para poder diseñar el UI debería conocer lo que puede hacer así como los límites del medio (html,js,css), luego entonces si los conoce ¿para que usar ps? ni en el mejor de los casos es ps una herramienta para diseñar un UI, lo que ocurre en realidad es que el que hace la parte interactiva (me refiero a detalles como el focus en forms) es \"el maquetador\", queda entonces separado el diseño de UI en dos partes, el diseñador, que se tiene que enfocar en lo estético ya que la herramienta no está hecha para específicar los detalles de como el usuario va a interactuar con el software, y \"el maquetador\" que es quien en realidad decide gran parte de los detalles de implementación del UI pero sin embargo está muy limitado ya que solo puede trabajar dentro de los parametros del diseño que le pasaron. el proceso está invertido.", "group_id": 8002, "id": 464613}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301368676.4712169, "message": "En mi mundo le dicen Front-End Engineering y es muy respetado; casi más que el Back-End en algunas empresas.", "group_id": 8002, "id": 465035}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301368818.7698269, "message": "@mariorz discrepo contigo. Yo considero que muchas veces un diseñador que no esta ligado a los límites del html puede hacer cosas mucho más útiles y asombrosas que uno que se preocupa por el tiempo que se tardará en programarlo. Yo por ejemplo cuando Diseño intento no ponerme a pensar sobre \"cómo lo voy a hacer\" o \"cuánto tiempo me tardará\" porque las cosas se pueden hacer; solo tomarán más tiempo hacerlas.", "group_id": 8002, "id": 465067}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1301370150.3340759, "message": "Es diferente conocer los límites de las tecnologías a conocer los límites del medio. Y en este caso es preferible un diseñador que conozca los límites del medio.", "group_id": 8002, "id": 465228}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301371098.805635, "message": "Tienen que tener conocimiento sobre lo que es UI web; pero siempre es bueno inovar sin perjudicar la usabilidad de la interfaz", "group_id": 8002, "id": 465402}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1301370938.264765, "message": "Si, diseñar una página web no es lo mismo que diseñar para una revista o para un periódico o playeras si te vas más lejos...", "group_id": 8002, "id": 465383}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301370499.9645469, "message": "@ciduarte desarrolla límites del medio, porfavor.", "group_id": 8002, "id": 465298}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1301370975.0220449, "message": "Cada medio es diferente y es necesario un diseñador entrenado para tener mejores resultados.", "group_id": 8002, "id": 465391}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1301371226.4128261, "message": "Claro, eso no lo discuto.", "group_id": 8002, "id": 465430}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301371051.4675951, "message": "En parte tienes razón; pero igual hay diseños que han llamado la atención y \"changed the game\" que son similares a lo que se encuentra en una revista o en un videojuego.", "group_id": 8002, "id": 465399}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301382643.828999, "message": "¿cual sería una ejemplo de UI que llama la atención y es similar a una revista o juego? me estoy imaginando algo en flash que un diseñador cree está muy bonito, seguramente le agradó al cliente cuando lo vio por única vez en una sala de juntas, para los usuarios es atroz", "group_id": 8002, "id": 467364}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301382937.963918, "message": "@Kuroir estas desbaratando un hombre de paja, conocer los limites del medio es parte fundamental del diseño, no se trata de que 'no se puede' sino que 'no conviene' hacer, como por ejemplo poner un diseño que pese 5 Megabytes, porque entiendes que es demasiado pesado y tu bounce rate se va para el cielo o en contraparte que SI se puede hacer, como usar ajax en lugares adecuados. No estoy menospreciando el oficio de diseño solo digo que es un gran error pensar que los conocimientos de un diseñador gráfico de medios impresos son muy transferibles a la web y peor aún si se limita a usar photoshop o illustrator para diseñar sus interfases.", "group_id": 8002, "id": 467417}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301394456.142138, "message": "@marioz para comenzar, me ofende que creas que me refiero a flash cuando hablo de una UI que sea de ese estilo. Nunca en la vida se me ocurriría cargar un elemento que contenga tanto peso y que proporcione tan poco valor para una aplicación. De igual forma cuando es necesario hacer algún tipo de animación es muy viable hacerlo con JavaScript / Canvas.", "group_id": 8002, "id": 468482}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301394621.9768851, "message": "@marioz conocer los límites no solo es parte fundamental del diseño; sino de la vida. No obstante, muchas veces es bueno intentar pasar esos límites para llegar a cosas realmente inovadoras que pueden hacer la diferencia a la hora de vender una idea a un usuario.", "group_id": 8002, "id": 468491}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301394547.4175389, "message": "@marioz respecto al sitio que es similar a un juego; aquí tienes: http://benthebodyguard.com/index.php fue reconocido internacionalmente no por lo que proponía sino por cómo estaba propuesto. Y de igual forma aprovecho para pasarte uno un poco más conocido que igual recibió mérito por parecer todo menos una página web http://www.nikebetterworld.com/", "group_id": 8002, "id": 468485}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301394750.3858061, "message": "@marioz no soy diseñador. Soy un developer, y por lo general me peleo mucho con los diseñadores ( en más de una empresa he tenido debetas fuertes respecto algunas funcionalidades, @nekrox sabe ), sobre todo cuando requiere que existan más http requests o bien una cantidad anormal de archivos, que terminan perjudicando el tiempo de carga de una aplicación.", "group_id": 8002, "id": 468496}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301394786.315845, "message": "Y ah my bad es @mariorz", "group_id": 8002, "id": 468500}, {"user_id": 25897, "stars": [], "topic_id": 15911, "date_created": 1301413217.255718, "message": "Alguna vez yo lo encontré como \"HTMLify\" pero por lo general siempre lo veo como \"PSD to HTML\"", "group_id": 8002, "id": 470128}, {"user_id": 24427, "stars": [], "topic_id": 15911, "date_created": 1301423159.691361, "message": "Recientemente me ha gustado el UI de este site :http://www.stellamccartney.com/en/index.html , en la seccion de collections , para ser html,js,css my bueno", "group_id": 8002, "id": 471296}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301422308.4607329, "message": "@Kuroir esas dos páginas es bastante obvio que las diseño alguien con conocimientos de html, js, css. No fue idea de uno de estos diseñadores gráficos que \"no conocen los límites\". Segundo estarán \"cute\" pero dificilmente las pondría como ejemplo de buen diseño de UI. No te ofendas ni seas dramático.", "group_id": 8002, "id": 471185}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301422320.4160509, "message": "Esto me parece un buen UI http://wufoo.com/", "group_id": 8002, "id": 471186}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301426542.3987131, "message": "@mariorz concuerdo, wufoo es funcional para lo que esta hecho y mantiene cierto impacto con su combinación de colores :)", "group_id": 8002, "id": 471768}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301425216.5348091, "message": "@mariorz creo que el primero que lo hizo fue más diseñador que programador; muchas veces primero se ocurre algo y luego se aplica por medio de coding. Hablas de una buena UI, cuando en realidad lo que deberías de entender no es que \"sea más funcional\", sino que sea más impactante y genere conversiones más rápido.  Y no me pongo dramático, simplemente estoy defendiendo un punto al igual que tu defiendes el tuyo.  A ver si un día en persona debatimos al respecto :)", "group_id": 8002, "id": 471636}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301426600.088398, "message": "@lucks de hecho, esta bastante bien. Compite directamente con sitios que dependen exclusivamente de flash; que abundan en el campo de la Moda", "group_id": 8002, "id": 471774}, {"user_id": 6227, "stars": [{"date_created": 1301454603.2900929, "user_id": 20522}], "topic_id": 15911, "date_created": 1301426772.5451031, "message": "@Kuroir no me creería ni un poquito que ninguno de esos dos sitios esten optimizados para conversión. Es poco probable que los datos indiquen que la conversión esté perfectamente correlacionada con lo que vemos como \"bonito\". Ahí está el caso de Doug Bowman que se salió de google pues lo que le decían sus instintos de diseñador no coincidía con los datos a los que le dan más importancia en google. Es obvio que primero \"se te ocurre algo y luego lo codeas\", lo que estoy diciendo es que las ideas que se le ocurren a un diseñador con pocos conocimientos sobre el medio no serán tan buenos como los que se le pueden ocurrir a alguien que lo conoce. If you want to think outside the box you start by knowing where the box is. me late, que se arme una tomadera de cheva!", "group_id": 8002, "id": 471796}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301453177.3743629, "message": "@mariorz va que va, a ver cuándo nos reunimos de nuez el @nekrox y el @Borre", "group_id": 8002, "id": 475636}, {"user_id": 6227, "stars": [], "topic_id": 15911, "date_created": 1301471052.3764429, "message": "@Kuroir que dicen se está armando algo macabro para el sabadaba cc @nekrox @Borre", "group_id": 8002, "id": 479380}, {"user_id": 20522, "stars": [], "topic_id": 15911, "date_created": 1301499995.2823019, "message": "@mariorz ha chinga... pos yo no sabia, pero si se arma, estaría chido :)", "group_id": 8002, "id": 482449}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301507329.871865, "message": "Pos el sabado en la choperia ya quedo.", "group_id": 8002, "id": 483468}, {"user_id": 24427, "stars": [], "topic_id": 15911, "date_created": 1301508752.9096041, "message": "hora?", "group_id": 8002, "id": 483610}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301513726.6052239, "message": "uh yo me voy de viaje al Sabadaba, vacaciones D:", "group_id": 8002, "id": 484375}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301514003.9735961, "message": "Como a las 9", "group_id": 8002, "id": 484445}, {"user_id": 20521, "stars": [], "topic_id": 15911, "date_created": 1301517207.313623, "message": "Yo creo que para otro día mejor hacemos una tarde de chelas entre puro pica teclas no? La prox semana que dicen?", "group_id": 8002, "id": 484950}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301527497.085248, "message": "cualquier cosa que no involucre llevar computadoras; eso me caga.", "group_id": 8002, "id": 485784}, {"user_id": 24427, "stars": [], "topic_id": 15911, "date_created": 1301527305.5429289, "message": "carnes asadas mejor no?", "group_id": 8002, "id": 485769}, {"user_id": 24405, "stars": [], "topic_id": 15911, "date_created": 1301588725.8666921, "message": "Las carnes en casa de Lucks! :P", "group_id": 8002, "id": 493325}, {"user_id": 2984, "stars": [{"date_created": 1302553931.964936, "user_id": 24663}], "topic_id": 15911, "date_created": 1301701519.713933, "message": "Un excelente diseño web (y sobre todo uno que rompe el status quo) no es resultado de un diseñador que no conoce las limitaciones del medio, sino de uno que las conoce tan bien, que puede estirarlas.", "group_id": 8002, "id": 506815}, {"user_id": 4653, "stars": [], "topic_id": 15911, "date_created": 1301930106.92889, "message": "¿Qué les parece si mejor hacemos un tema aparte en Dev Sureste para lo de la reunión? Para no seguir ensuciando este tema ?", "group_id": 8002, "id": 523936}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1301994729.0794179, "message": "@axel Estamos de acuerdo que lo que escribiste no tiene lógica.", "group_id": 8002, "id": 539346}, {"user_id": 2984, "stars": [], "topic_id": 15911, "date_created": 1302051118.992105, "message": "@ciduarte Si conoces a la perfección las limitaciones del medio, puedes llevar tus trabajos al límite. Si no entiendes eso, lo siento.", "group_id": 8002, "id": 551404}, {"user_id": 12727, "stars": [], "topic_id": 15911, "date_created": 1303049860.4076619, "message": "@axel Te leí mal. Entendí lo contrario.  u_u", "group_id": 8002, "id": 716852}]