[{"user_id": 18347, "stars": [], "topic_id": 34045, "date_created": 1304703971.9605491, "message": "The company I work for went through a hiring process for Django devs... Apparently many part time freelance and contract, is this the usual? Also many seem to be on £350+/day :)", "group_id": 81, "id": 944372}, {"user_id": 1127, "stars": [], "topic_id": 34045, "date_created": 1304704787.5981269, "message": "I feel like there's a good mix (from the people I know in the area). It's all about what you want to do, and there's plenty of people looking for Python/Django help :)", "group_id": 81, "id": 944493}, {"user_id": 18347, "stars": [], "topic_id": 34045, "date_created": 1304705279.2492819, "message": "@zeeg my theory is that the Django community is very entrepreneurial, so there is a bigger proportion of good developers starting their own startups/companies. Therefore I guess demand for good devs is higher compares to other skillsets? Would that make sense? :)", "group_id": 81, "id": 944587}, {"user_id": 1127, "stars": [], "topic_id": 34045, "date_created": 1304705369.0516839, "message": "@jamespaxi I wouldn't necessarily say it's higher, but there's definitely a large amount of newer Django users. Not just new to Django, but new to Python, and even some new to development. That kind of messes w/ the scales a little bit", "group_id": 81, "id": 944600}, {"user_id": 18347, "stars": [], "topic_id": 34045, "date_created": 1304706050.4170949, "message": "@zeeg seems pretty easy to hire java, c# and php developers compared to python/Django devs", "group_id": 81, "id": 944699}, {"user_id": 3580, "stars": [], "topic_id": 34045, "date_created": 1304709862.9446731, "message": "The age of the stack matters.. There are lots of Java or C# guys with over a decade of experience.. Becomes a bit of a numbers game.", "group_id": 81, "id": 945182}, {"user_id": 1806, "stars": [], "topic_id": 34045, "date_created": 1304712696.7045701, "message": "My company is making a wholesale change from PHP to Django.  We've hired a few guys with Django experience but a lot of devs are converting.", "group_id": 81, "id": 945628}, {"user_id": 24018, "stars": [], "topic_id": 34045, "date_created": 1304712503.0171881, "message": "Part time freelancing currently. Looking for something more permanent, though.", "group_id": 81, "id": 945616}, {"user_id": 1806, "stars": [], "topic_id": 34045, "date_created": 1304712749.0740809, "message": "Our experience with hiring is that the average django application (looking for a fulltime position) is generally a stronger dev but looking for considerably more money than an equivalently skilled PHP dev.", "group_id": 81, "id": 945638}, {"user_id": 13325, "stars": [], "topic_id": 34045, "date_created": 1304714521.5323529, "message": "I think may places make the mistake of requiring x years of experience in Django. If someone is a good developer, then can move over to Python/Django easily.", "group_id": 81, "id": 946104}, {"user_id": 18347, "stars": [{"date_created": 1304746320.8019691, "user_id": 1127}, {"date_created": 1306428781.810364, "user_id": 2588}], "topic_id": 34045, "date_created": 1304744992.9841869, "message": "@BenBelchak depends what kind of contribution we are talking about, because even the experts in PYthon/Django world ask others for advice :)", "group_id": 81, "id": 948969}, {"user_id": 11971, "stars": [], "topic_id": 34045, "date_created": 1304744009.4663711, "message": "@emperorcezar Agreed. I am employee #1 at a small startup and that is what we are finding. We would rather hire people we like and would enjoy working with than hire a kickass django developer. If you are a good developer, you can definitely pick Python/Django up very quickly.", "group_id": 81, "id": 948890}, {"user_id": 18347, "stars": [], "topic_id": 34045, "date_created": 1304744498.459902, "message": "@BenBelchak I guess it's one thing to pick it up and another to know it inside out :) I would say the first is good for regular agency work and the latter for serious application development", "group_id": 81, "id": 948935}, {"user_id": 11971, "stars": [], "topic_id": 34045, "date_created": 1304744661.0455911, "message": "@jamespaxi Yes, but it is not far to go from \"just picking it up\" to being able to contribute effectively to a team", "group_id": 81, "id": 948950}, {"user_id": 1127, "stars": [{"date_created": 1304746662.4101551, "user_id": 18347}], "topic_id": 34045, "date_created": 1304746342.4737589, "message": "@jamepaxi is totally right -- I know the ins and outs of Python but I'm still harassing anyone and everyone all day long :)", "group_id": 81, "id": 949043}, {"user_id": 11971, "stars": [], "topic_id": 34045, "date_created": 1304746608.060972, "message": "@jamespaxi for sure! That is what I love about twitter and convore. They give unprecedented access to industry \"luminaries\" that you can't get anywhere else!", "group_id": 81, "id": 949053}, {"user_id": 15284, "stars": [], "topic_id": 34045, "date_created": 1304747383.519717, "message": "Doing fulltime since this year, I was part time to be able to go to my university. Want to hire a 3 years exp django dev? ping me ;-)", "group_id": 81, "id": 949067}, {"user_id": 25337, "stars": [], "topic_id": 34045, "date_created": 1304751173.741329, "message": "I do freelancing and consulting in the UK. Often got more work than I can handle, so thinking about taking on freelancers myself.", "group_id": 81, "id": 949221}, {"user_id": 30618, "stars": [], "topic_id": 34045, "date_created": 1304782214.748044, "message": "I'm currently fulltime and this is my first major django gig coming from PHP/Zend-Framework.  Prior to learning Django I had used python before as part of an enterprise geo-locational product/service that only had .NET and Python client libraries.  There are tons of django/python jobs in the NYC area.  And the NYC-Django meetup group usually opens with job announcements and there are always people looking for django devs for pretty much full-time or contract is needed.  People just want talented developers.", "group_id": 81, "id": 951242}, {"user_id": 30884, "stars": [], "topic_id": 34045, "date_created": 1304790271.1896739, "message": "@danfairs what's the average daily rate for a django developer in UK?", "group_id": 81, "id": 951810}, {"user_id": 25337, "stars": [], "topic_id": 34045, "date_created": 1306399262.4211831, "message": "@meitham Difficult to give a meaningful answer, it depends so much on your experience and the client's requirements and background. Ranges from £200 - £500/day, maybe. Like I said - such a wide range as to be almost worthless :)", "group_id": 81, "id": 1190206}]