[{"user_id": 19938, "stars": [{"date_created": 1302976230.32147, "user_id": 26085}], "topic_id": 19642, "date_created": 1302881244.0295041, "message": "Un app que te permita darle seguimiento a los diputados/senadores.", "group_id": 965, "id": 701543}, {"user_id": 12133, "stars": [], "topic_id": 19642, "date_created": 1302880782.5077269, "message": "poner hashtag #IDEA para diferenciarla con la discusión", "group_id": 965, "id": 701466}, {"user_id": 26084, "stars": [], "topic_id": 19642, "date_created": 1302882111.2521219, "message": "API's en cada dependencia de Gobierno, por que tengo que llevar mi acta de nacimiento a todas las escuelas/dependencias/transito/hospitales publicas que voy?", "group_id": 965, "id": 701675}, {"user_id": 6541, "stars": [], "topic_id": 19642, "date_created": 1302884233.8216729, "message": "Cambiar la cultura mexicana", "group_id": 965, "id": 702029}, {"user_id": 3084, "stars": [{"date_created": 1302884955.2105441, "user_id": 12739}], "topic_id": 19642, "date_created": 1302884923.591681, "message": "Pues un tema en el que estoy muy clavado es llevar internet de banda ancha a las comunidades indígenas. Cuentan con equipos de cómputo pero muchas veces no hay buenas conexiones a la red y esto es una gran limitante para los estudiantes.", "group_id": 965, "id": 702177}, {"user_id": 12739, "stars": [], "topic_id": 19642, "date_created": 1302884934.23699, "message": "@jyr creo que deberíamos ser mas específicos.", "group_id": 965, "id": 702181}, {"user_id": 12133, "stars": [{"date_created": 1302895098.283447, "user_id": 2946}], "topic_id": 19642, "date_created": 1302886558.3757701, "message": "#IDEA una tarjeta/codigo qr que contenga tu datos para facturar ... asi a donde vayas no tienen que estar capturando.", "group_id": 965, "id": 702537}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302888253.731734, "message": "Han visto las tarjetas de puntos de Soriana?, algo parecido", "group_id": 965, "id": 702956}, {"user_id": 12133, "stars": [], "topic_id": 19642, "date_created": 1302886729.51228, "message": "eso si @krator aunque es una idea para resolver un problema.", "group_id": 965, "id": 702618}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302886693.4148719, "message": "@zodman Ta' buena, pero el detalles que es que todos tienes que tener un lector, además de la estandarización. La idea es ver como resolver todo el ciclo", "group_id": 965, "id": 702603}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302889409.6859529, "message": "Si me referia a eso, resolver varios problemas, si te das cuenta la mayoria de los negocios (Tiendas comerciales, tienditas, farmacias) facturan desde su computadora, no le veo problema a implementar un API o un sistema completo para venderlo/rentarlo", "group_id": 965, "id": 703084}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302888520.720181, "message": "@Krator para eso esta el API, para q hagan una pequeña modificacion a sus sistemas, para las empresas es mas barato incluso rentar el uso de la API q desarrollarla ellos mismos", "group_id": 965, "id": 702977}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302886935.4562271, "message": "@zodman Si! me quedé pensando en la solución... una es que tu misma tarjeta de débito/crédito traiga tus datos de facturación...otra una app de bb, iphone etc...", "group_id": 965, "id": 702687}, {"user_id": 12133, "stars": [], "topic_id": 19642, "date_created": 1302887488.1941969, "message": "si es buena idea pero imaginate cambiar todos los sistemas de facturacion ... como ?", "group_id": 965, "id": 702815}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302887712.955106, "message": "@zodman  Pues, una tarjeta estilo débito específicamente con tus datos de facturación, y que use la misma terminal que las de banco para capturar tus datos. La mayoría de comercios que emiten factura tienen una terminal...", "group_id": 965, "id": 702880}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302887816.1742959, "message": "@zodman El problema es que involucra a los bancos para cambiar o readaptar sus terminales y al SAT para emitir las tarjetas", "group_id": 965, "id": 702904}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302888737.5072131, "message": "@mishudark ¿cómo logras que todos los comercios usen esta API?", "group_id": 965, "id": 703017}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302888232.5329249, "message": "podria ser de manera independiente, mediante alguna api proporcionada por un tercero, y solo q los establecimientos haga uso de esa API para obtener los datos", "group_id": 965, "id": 702954}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302888446.6210251, "message": "@mishudark pero como lo pasas al sistema que \"manda a imprimir\" las facturas? todos los comercios tendrían que tener el mismo sistema de facturas...", "group_id": 965, "id": 702973}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302888706.073544, "message": "y q pasa si ofrecemos un punto de venta a $10 USD al mes, mucho mas barato q el famoso Mybussines Pos, con algunas features extras.... quien le entra al proyecto?", "group_id": 965, "id": 703012}, {"user_id": 10227, "stars": [], "topic_id": 19642, "date_created": 1302888816.163259, "message": "alli es donde entra el marketing, como en cualquier producto q plaenas q sea usado masivamente", "group_id": 965, "id": 703022}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302889057.7596869, "message": "El problema que planteaba @zodman era facilitar la forma en que un comercio recibe tus datos de facturación. Se tendría que crear un sistema que resuelva varios problemos(que creo que es a lo que te referías con \"con algunas features extras\") ejmplo: con esta API/tarjeta puedes facturar electrónicamente SIN necesidad de sentarte en la computadora", "group_id": 965, "id": 703043}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302889118.7343049, "message": "Porque el sistema tiene que resolver varios y no uno? porque la gente no va apagar por una plataforma que solo resuelva un problema \"bobo\" aunque muy enfadoso, lo harán a mano...", "group_id": 965, "id": 703046}, {"user_id": 26089, "stars": [], "topic_id": 19642, "date_created": 1302889775.1271639, "message": "Hace algunos meses se me ocurrió hacer un esquema de facturación electrónica  a través de SMS, a lo mejor ese es el vector para atacar el problema.", "group_id": 965, "id": 703167}, {"user_id": 26088, "stars": [], "topic_id": 19642, "date_created": 1302889607.0164981, "message": "Yo tengo una idea que meti a iMx el año pasado tal vez la meta de nuevo es sobre darle seguimiento a las propuestas y planes de trabajo de cada candidato a un cargo de elección popular antes de elecciones y hasta el fin de su periodo, y que tengan como badges si han cumplido o no, tipo te lo firmo y te lo cumplo XD", "group_id": 965, "id": 703113}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302890227.8008289, "message": "@geeksterhipster suena bien", "group_id": 965, "id": 703391}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302894159.7457571, "message": "@geeksterhipster me gustaría saber como es esa solución de faceturación con SMS", "group_id": 965, "id": 704174}, {"user_id": 3665, "stars": [], "topic_id": 19642, "date_created": 1302894928.2229099, "message": "JA, ví que puse faceturación...y se me ocurrió un sistema de facturación en facebook :P", "group_id": 965, "id": 704355}, {"user_id": 2946, "stars": [], "topic_id": 19642, "date_created": 1302895227.2196, "message": "@zodman Debería ser un qrcode. Así con cualquier webcam o smartphone lo puede leer.", "group_id": 965, "id": 704434}, {"user_id": 26089, "stars": [], "topic_id": 19642, "date_created": 1302895232.2789011, "message": "En algunos lugares, cuando pides una factura, ya solo te dan un ticket con una url y un código para recuperar la factura digital. La ídea era básicamente sustituir el ticket por un SMS. Luego la fumadera seguía en que los emisores sólo tenían que mandar un sms al sistema con el numero del receptor y el monto (muy al estilo pasatiempo de telcel). y del otro lado recibía un token para recuperarla.", "group_id": 965, "id": 704436}, {"user_id": 26089, "stars": [], "topic_id": 19642, "date_created": 1302895429.029222, "message": "La idea sería que hasta los changarritos mas sencillos pudieran facturar, para que en ultima instancia la evasión bajara y los que sí pagamos impuestos nos dejen de atorar con tantos impuestos (ya se que es un sueño muuuuuuuuuuuy guajiro, peor así salió la idea)", "group_id": 965, "id": 704475}, {"user_id": 18131, "stars": [], "topic_id": 19642, "date_created": 1302929686.506434, "message": "Me late la idea de la facturación por SMS, lo mas complicado seria tener la info de la venta y los datos actualizados del cliente, tal ves si se hiciera un repositorio de clientes a partir de los rfc que el sat ya tiene públicos", "group_id": 965, "id": 708976}, {"user_id": 18131, "stars": [], "topic_id": 19642, "date_created": 1302929826.5869391, "message": "Digamos un api con la cual los mismos comercios publiquen anónimamente los datos del rfc al que le hicieron una fctura, como para que no se sepa quien le vendió a quien", "group_id": 965, "id": 708983}, {"user_id": 26089, "stars": [], "topic_id": 19642, "date_created": 1302975528.9418459, "message": "Mi idea tenia una interface de administración o inclusive un helpdesk para hacer la captura", "group_id": 965, "id": 712533}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302976400.4333069, "message": "@reymundolopez como funcionaria esa API ?", "group_id": 965, "id": 712627}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302976491.7180901, "message": "@jyr no estoy de acuerdo en cambiar la cultura mexicana.. ¿por que cultura o que?  amo mi pais y mi cultura. Por ahi, creo que lo que quieres decir es cambiar las cosas negativas, pero cambiar nuestra cultura creo que seria perder nuestra identidad como mexicanos.", "group_id": 965, "id": 712642}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302977910.3968971, "message": "Es que en mi mente es momento de pensar en grande, resolver problemas de mercados enormes es mas arriesgado, cuesta mas trabajo, requiere mayores recursos de todo tipo... ¿pero no se les hace que vale la pena?", "group_id": 965, "id": 712839}, {"user_id": 2946, "stars": [], "topic_id": 19642, "date_created": 1302978077.58213, "message": "@Jorge_Madrigal De hecho no. No creo que sea EL momento. Creo que es el momento de pensar en global y resolver problemas de mercados globales. Luego con algunos éxitos bajo el brazo y la lana necesaria, será EL MOMENTO de voltear a México. Es mi opinión.", "group_id": 965, "id": 712861}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302978497.520858, "message": "@soska Global es mas arriesgado que pensar en México. Necesitas mas recursos para atacar un problema GLOBAL. Ademas, puedes generar soluciones locales que se puedan después convertir en soluciones globales. La lana siempre existirá para proyectos que valgan de verdad la pena, si no en México de otro lugar. No podemos limitarnos a pensar que si grandes recursos económicos no nos podemos atrever a pensar en grande.", "group_id": 965, "id": 712889}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302977162.3570371, "message": "@geeksterhipster La idea sería que hasta los changarritos mas sencillos pudieran facturar // en México los changarritos son la mayor parte del comercio... es un mercado ENORME, no te lo terminas nunca, por ahí van las ideas. Mercados masivos con problemas, y con muchos a los que les gustaría que se resolvieran. A gobierno le encantaría tener algun tipo de control para los changarritos, para poder saber cuanto venden o compran etc, y que pagasen impuestos. ¿Cual seria el gancho para el dueño del changarrito? Como lo metesa tu sistema sin que piense en ... ahh osea me van a cobrar impuestos ahora.", "group_id": 965, "id": 712715}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302977776.085819, "message": "@Jorge_Madrigal Claro Square está en fuego, tengo entendido que sus changarritos en total ya están facturando arriba del millón USD. Creo que esta estrategia de darle una herramienta a una masa crítica de micronegocios es altamente viable, de nuevo: Long Tail o como decimos por acá \"muchos poquitos\"", "group_id": 965, "id": 712818}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302976953.71946, "message": "@jyr @Jorge_Madrigal El tema sobre la cultura mexicana da para mucho debate, pero creo que ese sería otro topic ;-)", "group_id": 965, "id": 712687}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302976344.6719601, "message": "@edmz lo del App suena increíble jaja si es algo que te gustaría construir avisame.", "group_id": 965, "id": 712616}, {"user_id": 26200, "stars": [], "topic_id": 19642, "date_created": 1302978233.097158, "message": "Yo vería esto en favor para el cliente; un sistema de inventario compartido que me diga en cual de los 7 changarritos de la colonia, o la papelería o la tlapalería tiene el producto que quiero; crear un app que me de un estimado entre distancia y precio para ver a cual ir. El sistema de facturación / contabilidad sería un 'bonus' del sistema para el proveedor.", "group_id": 965, "id": 712866}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302977125.6710501, "message": "@Jorge_Madrigal Así es la última milla no es económicamente viable para por ejemplo compañías como Telmex, pero que tal si existieran micronegocios como \"ISP de última milla\"? La lógica Long Tail sugiere que puede funcionar.", "group_id": 965, "id": 712710}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302976677.3792219, "message": "@willygru tu entendiste la pregunta bastante bien, ese son el tipo de cosas en las que vale la pena invertir tu tiempo, tu vida. Son las cosas que pueden cambiar el mundo no solo para ti pero para otros, hacer el mundo un mejor lugar. mmm lo que dices se llama conexion de \"la ultima milla\". ¿Como lo harias una empresa sustentable económicamente?", "group_id": 965, "id": 712654}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302977713.4520941, "message": "¿ Que otros grandes problemas se les ocurren ? ¿Alguien alguna vez ha visto los sistemas con los que operan las empresas de camiones en México? Venga hay muchisimos problemas en México. Resuelve uno grande.", "group_id": 965, "id": 712806}, {"user_id": 2946, "stars": [], "topic_id": 19642, "date_created": 1302978784.730041, "message": "@Jorge_Madrigal  depende del mercado y del modelo de negocio. Un SAAS requiere la misma inversión independientemente del mercado meta, pero un mercado global es por definición mucho más grande que cualquier mercado local.", "group_id": 965, "id": 712911}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302977372.8786471, "message": "A toda esta platica... si conocen Square no ? la otra empresa de Jack Dorsey ? Si alguien logra competir con ellos en ese mercado con alguna solucion \"a la medida\" para SOLO los changarros en México... se vuelve inmensamente rico. PIENSEN EN GRANDE. SI , GRANDE.", "group_id": 965, "id": 712746}, {"user_id": 2946, "stars": [], "topic_id": 19642, "date_created": 1302979164.1898019, "message": "@willygru Esa es la cosa. Que si hicieras Uber para ciudad de México seguro que es un fracaso por la inseguridad, y sería estúpido querer hacer Uber para Madrid, Londres y Paris desde México. Pero puedes hacer algo como Basecamp o Github desde cualquier lugar en el mundo para quien sea que tenga una conexión a internet y una tarjeta de crédito.", "group_id": 965, "id": 712946}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302978578.9194219, "message": "@tidbitsum y para el del changarro, los changarros ni computadoras tienen, vamos ni inventarios tienen hoy en dia. Pero ojo, tiene teléfonos celulares y pronto, 2-3 años smartphones.", "group_id": 965, "id": 712893}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302978671.9565239, "message": "@Jorge_Madrigal  @soska Wow interesante esta \"tensión\" entre los comentarios, me dejan reflexionando. Y de hecho creo que no son posturas mutuamente excluyentes, después de todo el CEO de Uber (antes UberCab) lo decía hace poco con respecto a su servicio para, me parece, NY: \"Es un problema de NY que se repite en todas las grandes del mundo\".", "group_id": 965, "id": 712900}, {"user_id": 26085, "stars": [], "topic_id": 19642, "date_created": 1302978886.7802119, "message": "@soska @willygru Lo resuelves en México, donde conoces el mercado o al menos tienes acceso mas rápido a el y después vez donde mas tu servicio, aplicación, solucion puede utilizarse. Si es un problema bien grande el que resuelves, casi seguro que existe en algún otro lugar que no sea México.", "group_id": 965, "id": 712921}, {"user_id": 29866, "stars": [], "topic_id": 19642, "date_created": 1302978782.872839, "message": "@keoz me gusta tu idea, en España hay una iniciativa llamada \"Abre Datos\" http://www.abredatos.es/ donde se desarrollan aplicaciones en 48 horas con la idea de resolver problemas para la ciudadanía, el año pasado me gusto mucho esta: http://www.3126euros.com/ << Incentiva la competitividad y el rendimiento de nuestros obreros (Diputados) y este http://lospresus.de/madrid/2008 nos da idea del gasto publico.", "group_id": 965, "id": 712910}, {"user_id": 19938, "stars": [], "topic_id": 19642, "date_created": 1302979438.4069541, "message": "@josuegio Una vez traté de parsear el presupuesto federal para visualizarlo, pero no pude. No supe dónde encontrar toda la info.", "group_id": 965, "id": 712965}, {"user_id": 26085, "stars": [{"date_created": 1302980951.236975, "user_id": 19921}], "topic_id": 19642, "date_created": 1302979676.3291609, "message": "@josuegio... exportar y pymes. Suena bonito pero honestamente hay que ver los numeros. Es como pensar en importar a China cuando China no quiere tu producto. El mercado interno mexicano es muy valioso... tan valioso que es el que atacan los chinos y donde compiten cada vez mas ferozmente porque no lo atacamos nosotros. Es genial mirar hacia afuera, pero adentro tenemos grandes oportunidades.", "group_id": 965, "id": 712972}, {"user_id": 25716, "stars": [], "topic_id": 19642, "date_created": 1302978681.5537269, "message": "@jyr jeje :) Pienso que un mayor intercambio de ideas y pensamientos es importante para Mexico. El internet es bien para esto, y estoy a favor que @willygru dice", "group_id": 965, "id": 712902}, {"user_id": 29866, "stars": [], "topic_id": 19642, "date_created": 1302979375.7803581, "message": "@Jorge_Madrigal difiero de tu comentario, hay herramientas y soluciones actualmente que usamos en México que han sido creadas por pequeñas iniciativas de todo el mundo, software y aplicaciones  las puedes crear en tu idioma, hacer una traducción en ingles y con eso entras a otros mercados, de igual forma lo puedes hacer en español y pensar en Latinoamerica y España y no sólo en México.", "group_id": 965, "id": 712961}, {"user_id": 26200, "stars": [], "topic_id": 19642, "date_created": 1302979147.1580091, "message": "@Jorge_Madrigal Ahí está el problema del hardware, parte de la solución es ver que hay en el mercado que pueda cubrir esa parte y que el dueño del changarro esté dispuesto a adquirir en su beneficio, y claro que la curva de aprendizaje sea muy baja.", "group_id": 965, "id": 712942}, {"user_id": 29866, "stars": [], "topic_id": 19642, "date_created": 1302979179.3425851, "message": "@soska estoy de acuerdo contigo, es hora de ver globalmente, una de las herramientas para todos aquellos que tiene propuestas para ayudar a México, creo que sean herramientas que le permitan a las PYMES competir globalmente y mover un poco más el ecommerce que cada año crece más en México... El mundo esta buscando productos pero nuestros empresarios, muy pocos son los que tienen el conocimiento para exportarlos, lo mismo sucede con nuestro campo.", "group_id": 965, "id": 712948}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302979422.708488, "message": "@soska Coincido contigo pero solamente en parte, creo que si pudieras hacer funcionar un Uber en la Ciudad de México desde luego que lo puedes hacer funcionar en cualquier ciudad del mundo!", "group_id": 965, "id": 712964}, {"user_id": 29866, "stars": [], "topic_id": 19642, "date_created": 1302979533.5077181, "message": "@edmz Dejame en realidad habría que buscar el presupuesto por cada estado, los estados publican esta información, solo que de forma muy \"arcaica\" en un PDF y habría que sacar los datos de la mano, las iniciativas de los diputados, esas si están en forma digital, te doy un link en un segundo.", "group_id": 965, "id": 712967}, {"user_id": 29866, "stars": [], "topic_id": 19642, "date_created": 1302980862.1334131, "message": "@Jorge_Madrigal En realidad hay que hablar de lo que se sabe y escuchar lo que se desconoce: China y todo el mundo importa lo que el mundo exporta, sean servicios o bienes de consumo, china tiene necesidades de materia premia, no puede abastecer a su mercado interno y como ellos prácticamente todo el BRIC, aquí puedes ver algunas cosas que demanda el mundo: http://madeinmexico.promexico.gob.mx/wb/madeinmexico/busqueda_por_pais?seccion=comprador  las limitaciones de los empresarios y campesinos es que no saben nada de esto, falta de conocimiento, falta de emprendedores y sobra gente que esta limitada, siempre pensando no tengo dinero para hacerlo, el dinero es necesario pero las ganas de hacerlo, eso es indispensable.", "group_id": 965, "id": 713035}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1302981332.4130809, "message": "@soska @willygru Caballeros, la solución es clara: hacer un Uber para bicitaxis. \nhttp://i52.tinypic.com/xbbpra.jpg", "group_id": 965, "id": 713057}, {"user_id": 26084, "stars": [], "topic_id": 19642, "date_created": 1302981274.3995919, "message": "@Jorge_Madrigal hipoteticamente hablando, no es una API, es un conjunto de APIs que cada dependencia principal de Gobierno debe tener, el mayor problema que tienen ellos es la diversidad de fuentes de datos dispersas, cada una de estas APIs podrían ser una simplificación de BI, algo como pentaho.", "group_id": 965, "id": 713055}, {"user_id": 26088, "stars": [], "topic_id": 19642, "date_created": 1302981870.704679, "message": "@josuegio esa iniciativa esta muy buena ojala se hiciera también en México, el problema aquí es que el acceso a datos publicos es practicamente inexistente o inaccesible, no se ha invertido en eso, en mi idea el punto central era validar que los que participaran fueran ciudadanos con credencial de elector valida para lo cual no existe ninguna especie de API para validarlo, etc.", "group_id": 965, "id": 713141}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1302983133.578805, "message": "@willygru Haha gracias! Pero la seria realidad es que estoy de acuerdo contigo. Como sabes, ya existen varios sitios de Taxi y servicios de Taxis a domicilio en la metropolis. El unificarlos y/o crear una app para ordenar los Taxis y descontar de su tdc usando Paypal o incluso usar efectivo.", "group_id": 965, "id": 713240}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302982365.2350061, "message": "@albrtk Jajaja me gusta el tono que le imprimes a la discusión :D", "group_id": 965, "id": 713202}, {"user_id": 18131, "stars": [], "topic_id": 19642, "date_created": 1302983293.3466771, "message": "@edmz creo que http://www.tusdiputados.com/ hace algo de eso", "group_id": 965, "id": 713248}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302999615.4566829, "message": "Cuando hay disrupción en un mercado todos \"vuelven a cero\" y normalmente los líderes o principales beneficiados de la antigua industria se tienden a comportar defensivamente.", "group_id": 965, "id": 714143}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302999114.3469069, "message": "@albrtk :-) OK Solo una aclaración Uber NO es un servicio de taxis, crearon un nicho nuevo que denominaron algo así como \"transportación premium\" de hecho los gremios de taxistas los odian.", "group_id": 965, "id": 714113}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1302999282.505012, "message": "@undefined Si claro, ya recuerdo que andan con lo de las limos por lo de los Taxistas, verdad? Pero aun asi, crees que encontrariamos el mismo tipo de trabas de llevar la idea a la realidad?", "group_id": 965, "id": 714119}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1302999342.667376, "message": "No se que tipo de regulaciones haya, si es que las hay, para este tipo de casos en México.", "group_id": 965, "id": 714122}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1303000567.7781601, "message": "Excelente lo que acabas de decir. Y si, lo mismo que paso cuando los dueños de hoteles vieron el potencial de AirBnB y presionaron al gobierno para prohibir estadias asi. Tuvieron la vision de que tanto puede lastimar a sus bolsillos y se asustaron, verdad?", "group_id": 965, "id": 714174}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1302999438.717447, "message": "Claro! Lo cual sería muy bueno por que sería la validación de que se generó disrupción en esa \"industria\"", "group_id": 965, "id": 714131}, {"user_id": 3084, "stars": [], "topic_id": 19642, "date_created": 1303001218.221705, "message": "No conozco el caso a detalle pero por lo que mencionas parece ser un caso similar. Al gobierno de qué país presionaron los hoteleros?", "group_id": 965, "id": 714229}, {"user_id": 19921, "stars": [], "topic_id": 19642, "date_created": 1303001749.807749, "message": "A ver, encontre el articulo que vi en HN hace tiempo: http://adammetz.com/metzmash/hotel-lobbyists-strike-back-against-sites-like-airbnb-with-a-senate-billl/\n\nPero dudo que los Taxistas se puedan unir y presionar asi al gobierno aqui, o si? Despues de todo no tienen precisamente una industria monolitica con millones para gastas y respaldar su caso. ¿Que piensan?", "group_id": 965, "id": 714300}, {"user_id": 2946, "stars": [], "topic_id": 19642, "date_created": 1303017313.6182699, "message": "@albrtk Segun yo tienen sindicatos. Y creeme, no quieres meterte con un sindicato en México.", "group_id": 965, "id": 715580}, {"user_id": 6541, "stars": [], "topic_id": 19642, "date_created": 1303017662.6211181, "message": "@Jorge_Madrigal El punto no es lo que pensemos de nosotros, sino de como nos ven a fuera, de huevones, corruptos y demas no nos bajan en el exterior. Creo que reinventandonos como mexicanos podemos llegar lejos, pero muchos estan pensando como ganar dinero facil aunque tengan que pasar por encima de otros", "group_id": 965, "id": 715609}]