[{"user_id": 11626, "stars": [], "topic_id": 6563, "date_created": 1297893321.5714879, "message": "It’s official, China’s stealth fighter, the J-20, took its first flight today. The jet flew for about 15 minutes over the same airfield in Chengdu where it conducted high-speed taxi runs last week, according to the AP.\r\n\r\nSure enough, the plane’s first flight coincided with U.S. Defense Secretary Robert Gates’ visit to China aimed at fostering closer defense ties between the two nations.\r\n\r\nApparently, Chinese officials revealed the jet in an effort to “to send the message that Beijing is responding to calls from the U.S. and others to be more transparent about its defense modernization and future intentions.”\r\n\r\nOr, as former Air Force Lt. Gen. Tomas McInerney wrote on Fox News’ website recently:\r\n\r\n    This is another move by the Chinese to subtly send the current American administration — and our Asian allies signals — that they are investing heavily in military capabilities that will dominate Asia in the future.\r\n\r\nHere’s an interesting excerpt from a New York Times article on the flight:\r\n\r\n    Mr. Gates said he directly asked Mr. Hu why [the flight] was conducted during a three-day trip that is meant to smooth over rocky relations between the United States military and China’s increasingly assertive armed forces.\r\n\r\n    Mr. Hu replied, Mr. Gates said, that it “had absolutely nothing to do with my visit.” Asked if Mr. Gates truly believed that, Mr. Gates said yes, but acknowledged he had questions about whether the Chinese military was acting independently of the political leadership. “I’ve had concerns about this over time,” Mr. Gates said.\r\n\r\nMaybe China is being more open about its defense equipment modernization, but who knows what it intends to do with all those high-tech weapons? At a minimum, China’s new arsenal is being developed to keep 21st Century threats far from its shores. Still, how many times have we seen reports that it plans on using new-found military might to expand its influence throughout the region? What this means remains to be seen.\r\n\r\nHere are some more great images of the jet in the air.\r\n\r\nhttp://china-defense.blogspot.com/2011/01/j-20.html\r\n\r\nHere’s video of the flight.\r\n\r\nhttp://www.flightglobal.com/blogs/the-dewline/2011/01/video-first-chengdu-j-20-flies.html\r\n\r\nhttp://defensetech.org/2011/01/11/chinas-stealth-jet-makes-its-first-flight", "group_id": 3920, "id": 125163}]