[{"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889130.9056489, "message": "Scream has an OS Problem of Self-Aware. Great analysis here: http://www.dramatica.com/story/film_reviews/reviews/Scream.html", "group_id": 2515, "id": 960704}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304888918.7217791, "message": "The software has put me into the \"Circumstances\" quad:  \"Aware/Self Aware\" and \"Equity/Inequity\".  We covered Equity in another thread.  But can somebody help me out with Aware/Self Aware.  Some examples, maybe?", "group_id": 2515, "id": 960652}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889353.7866621, "message": "I vaguely remember that Dom Cobb's Problem in *Inception* was Self-Aware, though I think the actual story is incomplete. Impact Character/Subjective Story weak and/or broken. But for an example of Self-Awareness driven problems that are resolved by greater Awareness, I think it makes sense.", "group_id": 2515, "id": 960756}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889581.057204, "message": "Yes to Scream.", "group_id": 2515, "id": 960847}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304888859.8793581, "message": "Alright, I need to beg for help once again.", "group_id": 2515, "id": 960644}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304889566.5113831, "message": "So it looks like in Scream, self-awareness was synonymous with self-absorption, yes?  Being so focused on oneself as to be blind to the larger environment.", "group_id": 2515, "id": 960839}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304889619.9708691, "message": "I haven't seen A Doll's House, but Lajos Egri went on about it so much that I feel like I have.  :)", "group_id": 2515, "id": 960860}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889663.4628921, "message": "Yes, something like that.", "group_id": 2515, "id": 960876}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889746.0296581, "message": "Sweet, good luck!", "group_id": 2515, "id": 960899}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889569.9206481, "message": "A better example would probably be \"A Doll's House\" - story of someone who is so outwardly focused that they need to look in to solve their problems.", "group_id": 2515, "id": 960841}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304889642.011445, "message": "In that case, the wife is so focused on saving her husband that she ignores her own needs, correct?", "group_id": 2515, "id": 960867}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889638.0391009, "message": "lol", "group_id": 2515, "id": 960863}, {"user_id": 7645, "stars": [], "topic_id": 34285, "date_created": 1304889471.8710821, "message": "Wait, you know what, I think I have that backwards now that I think about it - Awareness is the Problem, Self-Aware is the Solution.", "group_id": 2515, "id": 960793}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304889731.3567159, "message": "Thanks as always, Jim!", "group_id": 2515, "id": 960897}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304889692.0923431, "message": "Okay, I gotcha.  I think I can see where this is going.", "group_id": 2515, "id": 960886}, {"user_id": 13650, "stars": [], "topic_id": 34285, "date_created": 1304903798.3701429, "message": "While \"examples\" serve a purpose I feel like we are giving \"short shrift\" to the underlying theory. I can give you an example of an artist using the color red but how does that help you paint better?", "group_id": 2515, "id": 963542}, {"user_id": 30287, "stars": [], "topic_id": 34285, "date_created": 1304906899.8051939, "message": "The examples are helping me sort out the underlying theory, I think.  But I'd certainly be interested in hearing any other thoughts about it!", "group_id": 2515, "id": 964350}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1304908437.6145129, "message": "\"A Doll's House\" is widely considered one of the best examples of character arc. You shouldn't rely on Egri to give you the full experience. You should read it.", "group_id": 2515, "id": 964642}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1304908549.930661, "message": "@mp131 I don't see how the theory adds up to a more meaningful story as of yet, either. It's frustrating. But, I can also barely understand the building blocks.\n\nThe examples help me, because (I'm hoping) once I can herd them into a pasture, I will be able to see a fuller picture and then start to focus on the theory.", "group_id": 2515, "id": 964693}, {"user_id": 13650, "stars": [], "topic_id": 34285, "date_created": 1304959549.69243, "message": "Since \"aware/self aware\" are elements they are supposedly critical to solving the story problem AND are integral to the character development. The \"kick\" for me is that according to \"theory\" an element can't be used  more than once AND all 64 elements HAVE TO BE USED. And then the elements are DIFFERENT when in looked at from the class perspective. I don't \"think/see\" that the software does a good job of clarifying this part of \"theory\" other than not making it easy to miss an element or to use it twice.", "group_id": 2515, "id": 974049}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1304964980.5266759, "message": "From what I remember, yes, the book says that it should be used once, and then says it should be used once an act... \n\nMy interpretation of this is that only the MC can have this trait. (But, since whatever trait is also going to be in the SS and OS and MC throughline, I really think that each expression of it has to be confined. If it were tossed about willy-nilly, anyone could solve the problem, or the problem wouldn't actually exist.)\n\nTo make a tangible example, if the solution to a problem requires a gun, and everyone had guns, there would be nothing special about the MC and his gun.", "group_id": 2515, "id": 975169}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1305005392.35868, "message": "Yes, good point. Still, you've now upset the apple cart again, since the book says it can only be used once. (Which is not my concern, but mp131's.)", "group_id": 2515, "id": 985256}, {"user_id": 7669, "stars": [], "topic_id": 34285, "date_created": 1305005288.0917161, "message": "Mike, that statement makes the assumption that the MC is also the Protagonist, which is not universally true.  And even if they are the same person, the \"gun\" that solves the OS problem may be one thing, but the \"gun\" that solves the MC problem would also be a gun but a different kind of gun... at which point the metaphor starts to break down...  But do you see what I mean?", "group_id": 2515, "id": 985226}, {"user_id": 7669, "stars": [], "topic_id": 34285, "date_created": 1305005681.662895, "message": "Can you reference where in the Theory Book it says that an element can only be used once?  That leaves me confused, because an element in a storyform, such as a MC Problem, is something that is true throughout the story, and can take on expression in any number of ways at any number of times.  (Or have I confused the issue in question?)", "group_id": 2515, "id": 985306}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1305006832.9165039, "message": "I think the key point here is that it can (and should!) be used multiple times.", "group_id": 2515, "id": 985517}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1305006346.48206, "message": "Here's the thing. I remember reading it, but I couldn't find it again without re-reading the book. (Although if I had to guess, it is in the section where Rear Window's characters are broken up into their motivations.) Anyway, I'm just trying to help @mp131 see why you have to confine how you use things -- he brought it up -- by demonstrating that overuse leads to weaker storytelling.", "group_id": 2515, "id": 985434}, {"user_id": 7669, "stars": [], "topic_id": 34285, "date_created": 1305006763.212081, "message": "Absolutely, you don't want to pound on the same element again and again -- that doesn't make for an effective or entertaining argument.  But there's a great deal of flexibility in how you can use and illustrate all the elements -- keeping in mind that an element such as \"Aware\" may manifest in one way in the MC throughline, in another way in the SS or IC throughline, and in another way among the OS characters.  So just because you touch on the same element multiple times doesn't mean it has to be illustrated in a monotonous or repetitive way.", "group_id": 2515, "id": 985505}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1305007544.0037439, "message": "I find it nearly impossible to get all 64 points in.", "group_id": 2515, "id": 985623}, {"user_id": 7669, "stars": [], "topic_id": 34285, "date_created": 1305007215.180716, "message": "And not all 64 elements HAVE to be used -- it's entirely the author's discretion what points he wants to argue and what emphasis he wants to place where.  (Or she.)", "group_id": 2515, "id": 985577}, {"user_id": 13650, "stars": [], "topic_id": 34285, "date_created": 1305031347.637784, "message": "I have my \"book\" divided into three ring binders- one is just vocabulary. Also I have it accessible as searchable PDF on my PC", "group_id": 2515, "id": 988649}, {"user_id": 13650, "stars": [], "topic_id": 34285, "date_created": 1305031213.6633241, "message": "Reference: Vocabulary- (Element) p. 292 (using elements (more than once and not using)", "group_id": 2515, "id": 988626}, {"user_id": 7664, "stars": [], "topic_id": 34285, "date_created": 1305047109.4777601, "message": "@mp131 I think this is saying something along the lines of this: \"The concept of 'equity' (or whatever element) should be explored once in the domain of Situation, once in Activity, etc.\"\n\nI think that leaves it open to have a character have a Problem/Unique Ability/Whatever of Equity (or other element) as well. But as a structural, story element, it should only be addressed once per domain.\n\nMy own take on this is that this level of granularity, while useful, is rarely useful to tackle directly. If you focus on the bigger picture, this kind of thing will take care of itself on its own.\n\nIn addition, I don't think the program tells you where you would have to use the elements -- the PSR doesn't go into that kind of detail -- and it's unlikely that the elements are still with their \"parent\" variation after all the rearranging.", "group_id": 2515, "id": 992965}, {"user_id": 10814, "stars": [], "topic_id": 34285, "date_created": 1305139893.6742821, "message": "I believe the intent of the \"use only once\" concept would be better expresses as, \"You need use/show and element only once within a given context.\"  That said, the contexts are constantly changing.  For example, comparing it to it's dynamic pair is different from comparing it to its companion pair or dependent pair.  It is also different in the context of the character, plot, theme, and genre, as well as throughline, Signpost, etc.\n\nSo, try not to make the SAME usage more than once because it is redundant.", "group_id": 2515, "id": 1012127}, {"user_id": 13650, "stars": [], "topic_id": 34285, "date_created": 1305161935.2021229, "message": "Thanks for that clarification.", "group_id": 2515, "id": 1016727}]