[{"user_id": 11626, "stars": [], "topic_id": 21524, "date_created": 1303863572.7310469, "message": "http://www.guardian.co.uk/world/2011/apr/25/guantanamo-files-al-qaida-assassin-worked-for-mi6\r\n\r\n\r\nGuantánamo Bay files: Al-Qaida assassin 'worked for MI6'\r\n\r\nDeclan Walsh in Islamabad, David Leigh, Jason Burke, Ian Cobain\r\nThe Guardian\r\n\r\nApril 26, 2011\r\n\r\n\r\n• Leaked Guantánamo papers link UK to Algerian militant\r\n• At least 123 prisoners incriminated by one informer\r\n \r\nCIA believed Adil Hadi al Jazairi Bin Hamlili ‘withheld important information’ from British intelligence, the files reveal.\r\n\r\nAn al-Qaida operative accused of bombing two Christian churches and a luxury hotel in Pakistan in 2002 was at the same time working for British intelligence, according to secret files on detainees who were shipped to the US military's Guantánamo Bay prison camp.\r\n\r\nAdil Hadi al Jazairi Bin Hamlili, an Algerian citizen described as a \"facilitator, courier, kidnapper, and assassin for al-Qaida\", was detained in Pakistan in 2003 and later sent to Guantánamo Bay.\r\n\r\nBut according to Hamlili's Guantánamo \"assessment\" file, one of 759 individual dossiers obtained by the Guardian, US interrogators were convinced that he was simultaneously acting as an informer for British and Canadian intelligence.\r\n\r\nAfter his capture in June 2003 Hamlili was transferred to Bagram detention centre, north of Kabul, where he underwent numerous \"custodial interviews\" with CIA personnel.\r\n\r\nThey found him \"to have withheld important information from the Canadian Secret Intelligence Service and British Secret Intelligence Service … and to be a threat to US and allied personnel in Afghanistan and Pakistan\".\r\n\r\nThe Guardian and the New York Times published a series of reports based on the leaked cache of documents which exposed the flimsy grounds on which many detainees were transferred to the camp and portrayed a system focused overwhelmingly on extracting intelligence from prisoners.\r\n\r\nA further series of reports based on the files reveal:\r\n\r\n• A single star informer at the base won his freedom by incriminating at least 123 other prisoners there. The US military source described Mohammed Basardah as an \"invaluable\" source who had shown \"exceptional co-operation\", but lawyers for other inmates claim his evidence is unreliable.\r\n\r\n• US interrogators frequently clashed over the handling of detainees, with members of the Joint Task Force Guantánamo (JTF GTMO) in several cases overruling recommendations by the Criminal Investigative Task Force (CITF) that prisoners should be released. CITF investigators also disapproved of methods adopted by the JTF's military interrogators.\r\n\r\n• New light on how Osama bin Laden escaped from Tora Bora as American and British special forces closed in on his mountain refuge in December 2001, including intelligence claiming that a local Pakistani warlord provided fighters to guide him to safety in the north-east of Afghanistan.\r\n\r\nThe Obama administration on Monday condemned the release of documents which it claimed had been \"obtained illegally by WikiLeaks\".\r\n\r\nThe Pentagon's press secretary, Geoff Morrell, said in many cases the documents, so-called Detainee Assessment Briefs, had been superseded by the decisions of a taskforce established by President Barack Obama in 2009.\r\n\r\n\"Any given DAB illegally obtained and released by WikiLeaks may or may not represent the current view of a given detainee,\" he said.\r\n\r\nAccording to the files, Hamlili told his American interrogators at Bagram that he had been running a carpet business from Peshawar, exporting as far afield as Dubai following the 9/11 attacks.\r\n\r\nBut his CIA captors knew the Algerian had been an informant for MI6 and Canada's Secret Intelligence Service for over three years – and suspected he had been double-crossing handlers. According to US intelligence the two spy agencies recruited Hamlili as a \"humint\" – human intelligence – source in December 2000 \"because of his connections to members of various al-Qaida linked terrorist groups that operated in Afghanistan and Pakistan\".\r\n\r\nThe files do not specify what information Hamlili withheld. But they do contain intelligence reports, albeit flawed ones, that link the Algerian to three major terrorist attacks in Pakistan during this time.\r\n\r\nKhalid Sheikh Mohammed, the self-confessed architect of the 9/11 attacks, told interrogators an \"Abu Adil\" – an alias allegedly used by Hamlili – had orchestrated the March 2002 grenade attack on a Protestant church in Islamabad's diplomatic enclave that killed five people, including a US diplomat and his daughter.\r\n\r\nHe said Abu Adil was also responsible for an attack that killed three girls in a rural Punjabi church the following December, and that he had given him 300,000 rupees (about $3,540) to fund the attacks.\r\n\r\nThe church attacks have previously been blamed on Lashkar I Jhangvi, a Pakistani sectarian outfit that has developed ties with al-Qaida in recent years.\r\n\r\nSeparately, US intelligence reports said that Hamlili was \"possibly involved\" in a bombing outside Karachi's Sheraton hotel in May 2002 that killed 11 French submarine engineers and two Pakistanis.\r\n\r\nBut the intelligence against the 35-year-old Algerian, who was sent home last January, appears deeply flawed, like many of the accusations in the Guantánamo files.\r\n\r\nSome of the information may have been obtained through torture. US officials waterboarded Khalid Sheikh Mohammed 183 times at a CIA \"black site\" in Thailand during his first month of captivity.\r\n\r\nAnd little evidence is presented to link Hamlili to the Karachi hotel bombing, other than that he ran a carpet business – the same cover that was used by the alleged assassins to escape.\r\n\r\nWhat is clear, however, is that Hamlili was a decades-long veteran of the violent jihadi underground that extends from northern Pakistan and Afghanistan into north Africa. From the Algerian town of Oran, he left with his father in 1986, at the age of 11, to join the fight against Soviet forces in Afghanistan. Later he fell into extremist \"takfir\" groups, recruited militants to fight in the Algerian civil war, and gained a reputation for violence.\r\n\r\nUnder the Taliban the Algerian worked as a translator for the foreign ministry and later for the Taliban intelligence services, shuttling between Pakistan and Afghanistan in the runup to 9/11.\r\n\r\nLast January Hamlili and another inmate, Hasan Zemiri, were transferred to Algerian government custody. It was not clear whether they would be freed or made to stand trial.\r\n\r\nClive Stafford Smith, whose legal charity, Reprieve, represents many current and former inmates, said the files revealed the \"sheer bureaucratic incompetence\" of the US military's intelligence gathering.\r\n\r\n\"When you gather intelligence in such an unintelligent way; if for example you sweep people up who you know are innocent, and it is in these documents; and then mistreat them horribly, you are not going to get reliable intelligence. You are going to make yourself a lot of enemies.\"\r\n\r\nThe Guantánamo files are one of a series of secret US government databases allegedly leaked by US intelligence analyst Bradley Manning to WikiLeaks. The New York Times, which shared the files with the Guardian and US National Public Radio, said it did not obtain them from WikiLeaks.\r\n\r\nA number of other news organisations yesterday published reports based on files they had received from WikiLeaks.", "group_id": 3920, "id": 820138}]