[{"user_id": 11626, "stars": [], "topic_id": 6305, "date_created": 1297843250.4283509, "message": "Which explains why we've seen vintage military planes flying around lately...", "group_id": 3920, "id": 118223}, {"user_id": 11626, "stars": [], "topic_id": 6305, "date_created": 1297843086.2514911, "message": "It looks like the trend toward taking vintage aircraft designs and installing a few modern gadgets and guns on them is starting to grow. While roaming the halls of the Association of the U.S. Army’s massive conference in D.C. yesterday, a colleague took me over to ATK’s booth where among the  guns and rockets on display was a model of the Army’s old OV-1 Mohawk armed with the 30 mm chain gun straight off the AH-64 Apache attack helo.\r\n\r\nIt turns out, ATK has teamed with two outfits called the Broadbay Group and Mohawk Technologies who specialize in building and sometimes operating small fleets of special missions aircraft for a variety of customers and the revamped OV-1D is the latest niche aircraft the team is pitching, according to Clay Bringhurst the company’s business development manager for ground combat systems.\r\n\r\nWhile the Mohawk design dates to the late 1950s, ATK and company are looking at using  the dozens of 1980s-vintage OV-1Ds that were retired in the 1990s after service in Desert Storm, according to Broadbay’s COO, JT Young. \r\n\r\nThe plan is to keep the planes — which have been basking in a boneyard in the Arizona sun since retirement — in pretty much their original state save for the installation of digital cockpit displays, a new electro-optical/infrared sensor ball on the nose and the chain gun that’s tied to the sensor ball, according to Young. The team has already pulled several aircraft from the boneyward and is testing the gun and camera on one of them.\r\n\r\nWhile the team isn’t planning on marketing the plane to the U.S. Air Force for its highly publicized push to buy a light attack plane, they are looking to sell or lease the Mohawks to foreign nations with low-budgets and aging attack fleets or even domestic clients such as the special ops community and “other” government customers in the States. It could even be used to train U.S. ground soldiers to call in air strikes, according to Young and Bringhurst.\r\n\r\nSo, the OV-1D probably won’t be the Air Force’s new COIN plane, but it does have a long history of performing battlefield surveillance and strike for the Army with cameras, infrared sensors, side looking radar — sort of an early version of today’s 707-based E-8 JSTARS – and a variety of rockets and dumb bombs. The planes served all over the world during the Cold War and immediatly after, from Vietnam and Korea to Germany and Iraq. In fact, they performed so well that it’s rumored the Air Force was not at all comfortable with this fixed wing-capability being in the Army’s hands. \r\n\r\nThis whole trend of reviving old designs for COIN-style missions has been rolling for a while now.  Just a couple of years ago Boeing announced that it was looking at dusting off the blueprints for the venerable OV-10 Bronco light observation and attack plane that was flown by the Air Force and Marines in Vietnam and Desert Storm. That plan might have stalled out now that the Air Force is signalling that it will only buy a handful of light attack planes, and it probably wants something that’s a slightly newer design.\r\n\r\nhttp://defensetech.org/2010/10/28/old-school-coin-planes-keep-coming-back", "group_id": 3920, "id": 118216}]