[{"user_id": 11626, "stars": [], "topic_id": 21577, "date_created": 1303886139.1140521, "message": "http://cryptogon.com/?p=21994\r\n\r\n\r\nHigh Level Member of Sinaloa Cartel Claims Multi-Ton Cocaine Trafficking Activities Were Sanctioned by DOJ, DEA and DHS/ICE\r\nApril 26th, 2011\r\n\r\nVia: Narco Sphere:\r\n\r\nA high-level player with one of the most notorious narco-trafficking organizations in Mexico, the Sinaloa “cartel,” claims that he has been working with the U.S. government for years, according to pleadings filed recently in federal court in Chicago.\r\n\r\nThat player, Jesus Vicente Zambada Niebla, is the son of Ismael “El Mayo” Zambada Garcia — one of the purported top leaders of the Sinaloa drug-trafficking organization. Zambada Niebla was arrested in Mexico in March 2009 and last February extradited to the United States to stand trial on narco-trafficking-related charges.\r\n\r\nThe indictment pending against Zambada Niebla claims he served as the “logistical coordinator” for the “cartel,” helping to oversee an operation that imported into the U.S. “multi-ton quantities of cocaine … using various means, including but not limited to, Boeing 747 cargo aircraft, private aircraft … buses, rail cars, tractor trailers, and automobiles.”\r\n\r\nThe revelation that Zambada Niebla claims to have been a U.S. government asset, working with its sanction, is a shocking development in the so-called drug war and has gone largely un-reported by the U.S. media. The claim, if true, adds credence to theories long in play that the Mexican and U.S. governments are essentially showing favor toward the Sinaloa drug organization and its leadership, including El Mayo and Joaquin “El Chapo” Guzman Lorea, as part of a broader strategy to weaken and ultimately eliminate rival narco organizations. U.S. and Mexican government officials, of course, have consistently denied that any such arrangement is in place.\r\n\r\nZambada Niebla’s allegation of U.S. government complicity in his narco-trafficking activities is laid out in a two-page court pleading filed in late March with the U.S. District Court for the Northern District of Illinois in Chicago. The pleading asserts that Zambada Niebla was working with “public authority” “on behalf of the U.S. Department of Justice, Drug Enforcement Administration (“DEA”); and the Federal Bureau of Investigation (“FBI”); and the Department of Homeland Security, Immigration and Customs Enforcement (“ICE”).\r\n\r\n“Public authority for the defendant’s [Zambada Niebla’s] acts began from at least on or about January 1, 2004 and continued to and included on or about March 19, 2009,” the court pleading alleges.", "group_id": 3920, "id": 822617}]