[{"user_id": 1, "stars": [], "topic_id": 12221, "date_created": 1299807286.241961, "message": "I have no idea how Leo does it, he's a machine!", "group_id": 5074, "id": 318391}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1299807214.4457581, "message": "The Giz Whiz should do Net@Night w Amber", "group_id": 5074, "id": 318362}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1299826307.3929141, "message": "just my 2¢", "group_id": 5074, "id": 320128}, {"user_id": 16903, "stars": [], "topic_id": 12221, "date_created": 1299823797.933547, "message": "keep Leo w/ Amber. The replacement that might work is  Tom for Security Now, but I doubt that would ever happen.", "group_id": 5074, "id": 319778}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1299826283.5303431, "message": "with more shows there will be overlaps in content. and it's likely that the shows that don't perform get canned", "group_id": 5074, "id": 320127}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1299826116.598634, "message": "I don't think there will be any replacement.", "group_id": 5074, "id": 320102}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1299826183.1959491, "message": "although with twit expanding, new hosts and all, there might be more shows", "group_id": 5074, "id": 320114}, {"user_id": 17097, "stars": [], "topic_id": 12221, "date_created": 1299849626.7958529, "message": "As grueling as Leo's schedule is, he will still need to maintain a substantial on-air presence. I can only speak for me, but, as good as his crew is, TWiT Live isn't the same with Leo missing and the shows suffered in his absence.", "group_id": 5074, "id": 321997}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1299856383.3036289, "message": "Leo should excuse himself from MacBreak weekly for a few month and go on All About Android instead - a dad has to love all his children equally ;)", "group_id": 5074, "id": 322938}, {"user_id": 16903, "stars": [], "topic_id": 12221, "date_created": 1299859841.7957079, "message": "If leo left MBW, who would do the commercials that keep TWIT going.  The inserts they put in while he was on vacation probably wouldn't work for the long term.", "group_id": 5074, "id": 323799}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1299944690.1112189, "message": "@ljsworld If it only works with Leo then the network has a problem", "group_id": 5074, "id": 332812}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1299950199.462559, "message": "@HateBadDesign Leo knows this problem. 90% of twit income is from Leo's shows. I bet mbw or twit ratings will plummet without Leo.", "group_id": 5074, "id": 333861}, {"user_id": 21113, "stars": [{"date_created": 1300113722.694823, "user_id": 17097}], "topic_id": 12221, "date_created": 1299975679.9446981, "message": "He has to be careful he does not spread himself too thin", "group_id": 5074, "id": 337799}, {"user_id": 19160, "stars": [], "topic_id": 12221, "date_created": 1299976335.5863221, "message": "I think this is much to do about a non-issue. My guess is Leo loves what he's doing and is making more $$ than ever. He has lots of great help and can take off time when needed. What's not to like?", "group_id": 5074, "id": 337854}, {"user_id": 20471, "stars": [], "topic_id": 12221, "date_created": 1299979517.314235, "message": "I enjoy him in all of his shows. If he had to free up his schedule, I could see Sarah hosting net@night with Amber, and Tom hosting Windows Weekly.", "group_id": 5074, "id": 338121}, {"user_id": 17555, "stars": [], "topic_id": 12221, "date_created": 1300008112.100472, "message": "After the new studio is finished and there is room for demos Leo needs to do a beginner program. Only Leo can help the newbs. There a several shows that can hold there own.", "group_id": 5074, "id": 339737}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300035459.5220611, "message": "@unwrangle 90% you got a source for that?", "group_id": 5074, "id": 341623}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300035546.605268, "message": "Leo should just hire some more nuts people - nuts like him, not C. Sheen ;) Sarah is nuts (in a good way), Tom is professional and a bit nuts, Brushwood (not fully hired yet) is nuts and entertaining etc :)  Not sure if iayz fits into this - plus i can't spell his name *g*", "group_id": 5074, "id": 341637}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300050674.6432059, "message": "I like when they mix the hosts up. It was cool seeing Andy with Sarah at ipad2 announcement. And Brian and Lisa were great on Sunday covering the Launch. Brian is wacko but growing on me. I pretty much like them all.", "group_id": 5074, "id": 343566}, {"user_id": 19160, "stars": [], "topic_id": 12221, "date_created": 1300056598.752609, "message": "@HateBadDesign yep, Brian has a sharp mind.", "group_id": 5074, "id": 343928}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300056126.9790249, "message": "Brian grows on everybody (like fungus! ;)  did you see him talk to that couple in the Ipad2, they were perhaps in their fifties, and looked very dubious when he approached, especially the guy seemed to be think \"who IS this weirdo\" - but by the time Brian left them they were ready to partying with him *g*", "group_id": 5074, "id": 343898}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300056860.870111, "message": "Glad you understood my message. I see I forgot to enter several words :)", "group_id": 5074, "id": 343945}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300077415.5658929, "message": "Lisa is still pretty green and she seemed pretty natural with him", "group_id": 5074, "id": 344968}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300089923.986361, "message": "@HateBadDesign I remember the discussion about that in (maybe) pre/post show with Prager (maybe kevin was there too, just browse through the wiki, apparently they don't have transcript there). If memory serves, the only non-Leo show that does well is TNT, 1 week worth of TNT almost equals to TWIT, but that 5 shows vs 1 show a week.", "group_id": 5074, "id": 345583}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300110653.307009, "message": "@unwrangle 1 week TNT vs 1 show of TWiT in terms of money? \n\nI think TWiT's numbers are going to climb quickly as more internet TV comes around. As soon as his shows move off of iPods and radios into living rooms.", "group_id": 5074, "id": 347397}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300112001.6960299, "message": "@unwrangle The other shows miss the fun. I wonder how well Triangulation does, it is generally \"boring\" in tone.", "group_id": 5074, "id": 347504}, {"user_id": 17097, "stars": [], "topic_id": 12221, "date_created": 1300114348.187171, "message": "@jimbednarz- Dead-pan Paul works well with Leo's style. Tom is more serious, especially when trying to keep the show moving. Serious and deadpan make boring, for me. Mercifully quick and concise, but I like to be amused too. Fast, accurate news I get by reading - I watch for the performance too, not just the for latest phone or product report. Not to say that Tom isn't funny. I appreciate his humor too, leo and paul have chemistry.", "group_id": 5074, "id": 347845}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300114267.9249351, "message": "@richardya in terms of unique download... assuming they're using the same CPM, probably meant the same for revenue as well...", "group_id": 5074, "id": 347830}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300114516.180706, "message": "and twit is actually losing money with shows like this week in science and floss. however the best part about twit (or Leo) the decision is not based on sheer number... *cough*rev3*cough*", "group_id": 5074, "id": 347868}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300114676.9897859, "message": "@HateBadDesign personally, triangulation really depends on the guests... the one with Jay Adelson and Jeri Elsworth are brilliant... some a bit more political, others I just don't get since I don't live in the US of A.", "group_id": 5074, "id": 347928}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300115871.7839849, "message": "Yeah, I don't really buy the 'lose money' bit. Twit is what 95% reruns? (Didn't count) - so more new stuff can't hurt - and if the people are in the cottage anyway (assuming regular working hours, and that they aren't getting hired on a piece by piece basis)", "group_id": 5074, "id": 348147}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300117259.0029449, "message": "as for reruns, i actually believe that twit will save money if they killed the reruns.. the numbers on rerun are very very low... usually 100ish / stream (so 400ish? then again, it might just from the computers who kept it running on mute), unless there's like CES or something... then the reruns could 500-600.. however i could get behind for more shows, but they need more host with personality - like Baratunde (please?)", "group_id": 5074, "id": 348457}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300117309.675472, "message": "@unwrangle Oh sure, its just a certain usage of the word \"lose\" that I'm not comfortable with, to me losing means having something and then not have it - not less that what I would like to have. I agree with floss, but then I don't care about Football and apparently that is quite popular, so everybody might not agree with my taste ;)", "group_id": 5074, "id": 348469}, {"user_id": 15929, "stars": [], "topic_id": 12221, "date_created": 1300116758.544193, "message": "not really in the position to know what is the real truth. but i can see if shows like floss is a tough sell, let's be honest, with the exception of TNT, twit audience watch the show for the entertainment value, or the personality of the host, or both (like windows weekly). the news itself are stale.", "group_id": 5074, "id": 348350}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300121598.98862, "message": "Leo's a pretty smart businessman. I think as he takes in more shows, he can lower their costs and increase the quality of their podcasts with his studio/equipment. More shows, more reruns, more cross promotion, better panels etc Shows like \"engadget\" with their own audience are the coup.\nI always look at iPad today as an interesting barometer. That show would actually appeal to the millions of moms and grandmas (non-tech) people with iPads out there. That's why I like Sarah for that show. She is has the most mainstream taste when it comes to producing a show out of all of the hosts and that's probably what that audience wants. But - how does he get that audience to know about the (podcast) show. It is intentionally, not technical.", "group_id": 5074, "id": 349042}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300132609.7913711, "message": "All the hosts are weird in that way. Tom seems like as straight and preofessioanl as Ted Koppel & could read the news with the best of them, he keeps the show at a perfect pace and has intelligent insights. At the same time, he is completely comfortable interviewing a girl stoned out of her mind & wouldn't care if people were walking around the studio naked. \nLeo is one of the most intelligent & knowledgeable people I have ever seen, at the same time, he has the personality of a 13Y/O. This is why he is probably not a very good stock investor, he is easily swayed. (I love him but he loves everything he reviews)", "group_id": 5074, "id": 350330}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300130396.989033, "message": "Heh, Sarah normal? She wears a weird hat and howls at the moon *g*\n", "group_id": 5074, "id": 349978}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300135849.1792231, "message": "Tom can be a bit nuts as well, he just usually reins it in - I guess he reminds himself he can't go too nuts and still be taken serious as a journalist :)", "group_id": 5074, "id": 350956}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300161224.5518999, "message": "One last thing about Tom. I'm pretty sure he is a cylon. If you add up the books he reads, shows he watches, audible books, comics, gaming and WoW it doesn't add up. There are copies, I'm sure of it.", "group_id": 5074, "id": 353346}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300161089.9382019, "message": "Brian can chat up anyone.", "group_id": 5074, "id": 353340}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300161037.2599821, "message": "I'm not saying he is a stif at all. He is like the band on the Titanic, nothing phases him.", "group_id": 5074, "id": 353339}, {"user_id": 17124, "stars": [], "topic_id": 12221, "date_created": 1300386162.5005479, "message": "Well, I don't know Tom, so I wouldn't know it, but he did come from Cnet. Aren't they all cylons @Cnet?", "group_id": 5074, "id": 376313}, {"user_id": 9975, "stars": [{"date_created": 1300645353.7278931, "user_id": 21754}], "topic_id": 12221, "date_created": 1300464073.422543, "message": "I am not a cylon.", "group_id": 5074, "id": 383078}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300487622.2316599, "message": "That's what all the cylons say.", "group_id": 5074, "id": 385688}, {"user_id": 17937, "stars": [], "topic_id": 12221, "date_created": 1300504678.1451211, "message": "All cylons think they're human. Listen for the rolling stones.", "group_id": 5074, "id": 386917}, {"user_id": 17584, "stars": [], "topic_id": 12221, "date_created": 1300516464.4803071, "message": "What really matters is what sponsors like. Leo IS Twit. When he takes prolonged time off, so do the sponsors. Leo could help himself out if he could shave some hours from his tough week end schedule. Once the new studio opens, hopefully the no-sponsor  programs will be dumped. In the beginning, filler shows were needed. Not so now. Good, core programs can be repeated on the same day. Good doubles are better than bad singles next to a good single. Remember, the bigger Twit gets, and costs rise, the more that sponsored shows will remain. The rest will fade into netcast history.", "group_id": 5074, "id": 387143}, {"user_id": 22835, "stars": [], "topic_id": 12221, "date_created": 1300533269.105798, "message": "@richardya I agree with you. Tom can be funny and silly, but knows when enough is enough, and always gets things back on track. I really enjoy listening to Molly Wood but BOL is a disaster without Tom. They are constantly getting things wrong.", "group_id": 5074, "id": 387871}, {"user_id": 20220, "stars": [], "topic_id": 12221, "date_created": 1300547510.6265979, "message": "@justinluey I agree - with Brian Tong's constant 'singing' BOL is unlistenable now Tom has gone. TNT is by far superior.", "group_id": 5074, "id": 388570}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300568271.2162681, "message": "Actually, I think one area where BOL as TNT beat are better vocals. Either that or Tom and Sarah hasn't tried hard enough yet.", "group_id": 5074, "id": 389500}, {"user_id": 17991, "stars": [], "topic_id": 12221, "date_created": 1300630494.1084509, "message": "@johnwin agreed BT makes BOL unlistenable.  I get my fill of Molly during her Buzz Report.  @HateBadDesign bad vocals?  Must be a misprint.", "group_id": 5074, "id": 392054}, {"user_id": 16859, "stars": [], "topic_id": 12221, "date_created": 1300731159.0901079, "message": "@Jude No actually I think its ok :) Might be out of place, but that's a different discussion. ( I also don't have a problem with Sarah howling at the moon *g*)", "group_id": 5074, "id": 400824}]