[{"user_id": 11626, "stars": [], "topic_id": 42389, "date_created": 1311209212.7215741, "message": "Welcome to SCMLA's Cyber-Warfare Wednesday!\r\n\r\n\r\nHow Two LulzSec Hackers Slipped Up\r\nAtlantic Wire\r\nJuly 20, 2011\r\n\r\nIt was pretty astounding to hear that the feds had arrested 16 people yesterday in connection with Anonymous and LulzSec hacking attacks. Of them, 14 were indicted for participating in distributed denial of service attacks as part of Anonymous's Operation Payback, which took down the Mastercard and Paypal sites because they stopped processing donations to Wikileaks. But two of the hackers arrested yesterday had very different charges, well beyond linking their computers to a botnet in a mass DDoS attack. Both allegedly infiltrated secure organizations and leaked data in ways that now seem like they almost wanted to get caught. One man, 21-year-old AT&T customer support contractor named Lance Moore, allegedly used his company-issued VPN login and password to go into the AT&T system and gather data that he then leaked as part of LulzSec's June 25 \"50 Days of Lulz\" release. The other, 21-year-old University of Central Florida computer student Scott Matthew Arciszewski, allegedly hacked into the FBI contractor Infragard in Tampa and uploaded files from there, which he then tweeted directly to the FBI's own Twitter account. Court documents outline how both suspects used arguably poor judgment when allegedly breaching their respective targets. Moore started working for a company called Convergys in its Las Cruces, New Mexico office on Aug. 23, 2010, according to the complaint prepared by FBI Special Agent Jeffrey D. Calandra. In order to do his job as a customer service representative for AT&T Mobile, he was issued a login for the company's virtual private network. According to the complaint, the AT&T security team discovered a large cache of company data -- including \"thousands of spreadsheets, Microsoft Word documents, Microsoft PowerPoint presentations, image files, PDF files, applications and other files, largely concerning AT&T's plans related to its 4G data network and LTE (Long Term Evolution) mobile broadband network, among other topics -- posted publicly on the file sharing site Fileape.com on April 16, 2011. The company valued the information at more than $5,000. The complaint goes on to describe how AT&T's own investigators caught, and fired, Moore. \r\nhttp://old.news.yahoo.com/s/atlantic/20110720/tc_atlantic/howtwolulzsechackersslipped40215\r\n\r\nState Prosecutes Sports Fan For Saying Mean Things On Facebook\r\nInfowars.com\r\nJuly 20, 2011\r\n\r\nThe BBC is lending a hand in the propaganda blitz now in full swing to demonize the internet ahead of the government regulating speech and controlling who is allowed to use the electronic medium. In Scotland, the police apparently have nothing better to do than monitor Facebook and other social networks in an effort to ferret out mean people making nasty and snide comments. Michael Baily, an intemperate 20 year old Celtic fan, posted a racist comment about El Hadji Diouf, a Senegalese footballer, on Facebook. “He was caught after a police task force began reviewing internet sites after March’s so-called Old Firm shame game,” reports the BBC. “At Glasgow Sheriff Court, sentence on Bailey was deferred for reports.” Sentence? That’s right. The Scottish kid will be punished by the state for making admittedly insensitive and stupid comments. It is now a crime in Scotland to say mean things. Scots can go to prison or be sentenced to do “community service” – slave labor for the state – for making comments that are uttered every single hour of every single day in pubs and on the streets of Scotland and everywhere else. In addition to scouring the internet for bigots, the Scottish police are jailing football fans for singing God Save The Queen or crossing themselves. The worst “offenders” could face five years in prison, according to the Daily Record. A community safety minister told the newspaper it is criminal to sing God Save The Queen or Rule Britannia in or near sports grounds or in pubs. The effort specifically targets “keyboard warriors” who use the internet to “spread hate,” in other words post racist or insensitive comments.\r\nhttp://www.infowars.com/state-prosecutes-sports-fan-for-saying-mean-things-on-facebook\r\n\r\nFeds Indict Hacktivist For “Stealing” Public Domain Data\r\nInfowars.com\r\nJuly 20, 2011\r\n\r\nThe government is going out of its way to create show trials in order to make the case that hackers are out of control and threaten our national security. The latest propaganda effort coincides with so-called cyber security legislation floating around the district of criminals. Coinciding with the ludicrous assertion by the government that hackers will take down the power grid and pitch the country into the Stone Age, the DOJ and FBI have arrested more than a dozen people in the PayPal Ddos case. Now they are going after a hacker who “stole” non-profit public domain documents. They want to throw him in prison for 35 years. A number of companies claim they are victims of hackers, including the death merchant Lockheed Martin. The corporate media has highlighted a number of hacking cases in the most lurid and exaggerated fashion. All of this coincides with an effort by the Pentagon to integrate the private sector into a massive surveillance network in the name of protecting the country from elusive hackers in China and Russia. Meanwhile, the Pentagon has teamed up with Israeli intelligence to take down Iran’s nuclear energy computer network with a sophisticated virus called Stuxnet. It’s okay when we do it. It should be noted that the Pentagon now says it will put a missile down the smokestack of anybody who messes with its networks and those of its corporate partners. Aaron Swartz is being set-up in an ongoing effort to demonize hacktivists – hackers with political beliefs – and send the message that political activism over the internet might land you in prison.\r\nhttp://www.infowars.com/feds-indict-hacktivist-for-stealing-public-domain-data\r\n\r\nDOJ and FBI Make Arrests in PayPal Hacking Case\r\nInfowars.com\r\nJuly 20, 2011\r\n\r\nFollowing LulzSec’s defacement of The Sun on Monday, the FBI swooped down on Anonymous and arrested 16 people in several states for allegedly attacking PayPal. A federal indictment against 14 of the arrested accuses them of launching a Ddos (denial of service) against PayPal after it closed down a Wikileaks donation account.... The indictment claims members of Anonymous conspired to “intentionally damage protected computers at PayPal” between December 6-10, 2010, as part the group’s “Operation Avenge Assange.” Suspects connected to the case were separately arrested in Florida and New Jersey while British police arrested one suspect and Dutch authorities four. The FBI claims it traced internet protocol addresses of the hackers to Canada and then to California where one of the IP addresses used a virtual server for the attack. A separate investigation revealed Ddos attacks came from a server based in Texas. In June, accusations surfaced claiming a member LulzSec is a Marine who works for military intelligence. Arrests in the PayPal case arrive a few days after the Pentagon asked the private sector to join in a pilot program dubbed “Strategy for Operating in Cyberspace.” The plan envisions a unified plan incorporating DoD’s military, intelligence and business operations. It calls on AT&T, Verizon, and other telecoms and defense contractors to play a role. The plan includes an effort for private companies to share information with the Defense Department and the Department of Homeland Security. The Pentagon’s pilot program came after a March 24 cyber attack against an unnamed defense company. Around 24,000 of that company’s files containing military secrets were allegedly hacked into. Two months later, defense contractor Lockheed Martin claimed it was the victim of a cyber attack of undisclosed magnitude.\r\nhttp://www.infowars.com/doj-and-fbi-make-arrests-in-paypal-hacking-case\r\n\r\nGovernment Increases Hysteria Over Cyber Attacks in Push to Crack Down on Internet\r\nInfowars.com\r\nJuly 18, 2011\r\n\r\nLast week Republican senator John McCain called for the government to establish a special panel to come up with legislation to address supposed cybersecurity threats facing the United States. “The only way to move comprehensive cyber security legislation forward swiftly is to have committee chairmen and ranking members step away from preserving their own committees’ jurisdiction … (and) develop a bill that serves the national security needs of all Americans,” McCain said. As if on cue, the Pentagon announced two previously unpublicized attacks following McCain’s call for a bipartisan action. On Thursday, out-going deputy secretary of defense Bill Lynn said a foreign intelligence service had stolen 24,000 files on a sensitive weapons system from a defense contractor’s network. Lynn said the Defense Industrial Base Cyber Pilot was established to work with the private sector in the battle against cyber foes. “Our success in cyberspace depends on a robust public-private partnership,” said Lynn. “The defense of the military will matter little unless our civilian critical infrastructure is also able to withstand attacks.” Lynn cranked up the paranoia in February when he speculated that al-Qaeda might get its hands on the Stuxnet virus. He said “it is possible for a terrorist group to develop cyberattack tools on their own or to buy them on the black market.”\r\nhttp://www.infowars.com/government-increases-hysteria-over-cyber-attacks-in-push-to-crack-down-on-internet\r\n\r\nSocial Media Targeted by Pentagon for “Strategic Communication”\r\nOld-Thinker News\r\nJuly 17, 2011\r\n\r\nEarlier this week Old-Thinker News reported on statements made by Pentagon contractor and “perception manager” John Rendon regarding the manipulation of internet content algorithms with the intent to “shape belief sets.” In further revelations, the Pentagon has unveiled on Thursday a project developed by DARPA that will utilize social media as an information warfare tool. As Wired Magazine reports, “The Pentagon is looking to build a tool to sniff out social media propaganda campaigns and spit some counter-spin right back at it.” The report issued by DARPA titled “Social Media in Strategic Communication (SMISC)” is available online here. Among other things, the project will “Detect, classify, measure and track the (a) formation, development and spread of ideas and concepts (memes), and (b) purposeful or deceptive messaging and misinformation.” In response, the Pentagon will engage in “Counter messaging of detected adversary influence operations.” What will the Pentagon consider “…deceptive messaging and misinformation”? The military-industrial-complex can initiate any meme of its liking. The Arab Spring revolution that began in Egypt was largely supported by social media and Twitter. Iran is currently being targeted by an “internet in a suitcase” campaign launched by the United States in an attempt to spark revolution. In his newly released book The Filter Bubble: What the internet is hiding from you, Eli Pariser of Moveon.org interviews Pentagon contractor John Rendon, where he candidly spoke of perception management in the digital world. Specifically, Rendon hints that he knows how to game the system of search engine algorithms – the system by which pages are ranked and internet searches are displayed – and in turn shift the mindset of the masses. The Pentagon, which developed the internet to begin with, is engaging in full scale memetic enginnering in the digital world. The Department of Defense’s Sentient World Simulation (SWS) has undoubtedly been integrated with the social media networks. The SWS is a model of the real world translated to a virtual model that can be used to test propaganda and its anticipated effect on a target populace in real time.\r\nhttp://www.oldthinkernews.com/?p=1712\r\n\r\nMan Pleads Not Guilty In Facebook Threat Against Governor\r\nThe Hartford Courant\r\nJuly 14, 2011\r\n\r\nNEW BRITAIN —— A former New Britain police officer pleaded not guilty Thursday to charges stemming from his allegedly threatening comments about Gov. Dannel P. Malloy on Facebook. Michael P. Adams, of Bristol, is charged with second-degree harassment, inciting injury and second-degree breach of peace. A pretrial hearing has been scheduled for Sept. 9 at Superior Court in New Britain. Outside the courtroom on Thursday, defense attorney Margaret P. Levy of West Hartford declined to discuss the case. Adams, 36, of 307 Perkins St., Bristol, was arrested after a business complained that he had posted a comment on its Facebook page saying he \"hoped that Governor Malloy [would] be shot by an angry New Yorker during his visit to New York,\" according to the state police. Detectives said they tracked the post to Adams, and said he admitted making the comment but denied actually wanting anyone to shoot Malloy, investigators said. He is free on $30,000 bond. Prosecutors said in court Thursday that they wouldn't release the names of the person or people who complained about the posting. Adams had left the police department before the Facebook incident, amid controversy about a prisoner who complained of mistreatment during his arrest.\r\nhttp://www.courant.com/community/new-britain/hc-new-britain-facebook-threat-0715-20110714,0,2648625.story\r\n\r\n24,000 Pentagon files stolen in major cyber breach, official says\r\nWashington Post\r\nJuly 14, 2011\r\n\r\nThe Defense Department lost 24,000 files to “foreign intruders” in the spring in what appears to be one of the most damaging cyberattacks to date on the U.S. military, a top Pentagon official acknowledged Thursday. Deputy Defense Secretary William J. Lynn III, who disclosed the March breach during a speech to roll out the Pentagon’s new cyber strategy, said the files were taken from a defense contractor. He did not say who was believed to be behind the attack or describe the nature of the files that were stolen. But Lynn said that, over the past few years, all manner of data has been stolen, some of it mundane, some of it concerning “our most sensitive systems, including aircraft avionics, surveillance technologies, satellite communications systems, and network security protocols.” “It is a significant concern that over the past decade, terabytes of data have been extracted by foreign intruders from corporate networks of defense companies,” Lynn said.\r\nhttp://www.washingtonpost.com/blogs/checkpoint-washington/post/24000-pentagon-files-stolen-in-major-cyber-breach-official-says/2011/07/14/gIQAsaaVEI_blog.html\r\n\r\nPentagon to treat cyberspace as \"operational domain\"\r\nReuters\r\nJuly 14, 2011\r\n\r\n(Reuters) - The Defense Department unveiled a new strategy for protecting military computer networks from hackers on Thursday, designating cyberspace as an \"operational domain\" U.S. forces will be trained to defend. Deputy Defense Secretary William Lynn said the Pentagon wanted to avoid militarizing cyberspace, but aimed to secure strategic networks with the threat of retaliation, as well as by mounting a more robust defense. \"Our strategy's overriding emphasis is on denying the benefit of an attack,\" Lynn said in a speech at the National Defense University. \"If an attack will not have its intended effect, those who wish us harm will have less reason to target us through cyberspace in the first place.\" Identifying intruders and responding to serious cyber attacks are part of the strategy, he said. But the military now focuses its strongest deterrent on other nation states, not transnational groups. \"Terrorist groups and rogue states must be considered separately,\" Lynn said. \"They have few or no assets to hold at risk and a greater willingness to provoke. They are thus harder to deter. If a terrorist group gains disruptive or destructive cyber tools, we have to assume they will strike with little hesitation.\" Lynn said currently the most sophisticated attacks come from other nations. Nation states are the most sophisticated intruders at this point but can be deterred by the threat of military power, he said, whereas transnationational groups have less fear of military retaliation. \"There will eventually be a marriage of capability and intent, where those who mean us harm will gain the ability to launch damaging cyber attacks,\" Lynn said. \"We need to develop stronger defenses before this occurs.\" Protecting its systems has become increasingly critical and complicated for the Pentagon. Defense Department employees operate more than 15,000 computer networks and 7 million computers at hundreds of installations around the world. Defense Department networks are probed millions of times a day and penetrations have caused the loss of thousands of files.\r\nhttp://www.reuters.com/article/2011/07/14/us-usa-defense-cybersecurity-idUSTRE76D5FA20110714\r\n\r\nPhone Hacking: The Sun's website 'hacked by LulzSec' with fake story about Rupert Murdoch's death\r\nThe Telegraph\r\n9 Jul 2011\r\n\r\nThe hacking group LulzSec took credit for the attack on Twitter, saying: \"We have owned Sun/News of the World\". Viewers of the tabloid website were redirected to a mocked up news story with the headline \"Media moguls body discoverd [sic]\". The story continued: \"Murdoch, aged 80, has said to have ingested a large quantity of palladium before stumbling into his famous topiary garden late last night, passing out in the early hours of the morning.\" The website later redirected to the Lulzsec Twitter feed, where the anonymous group crowed: \"We have joy we have fun, we have messed up Murdoch's Sun\". The group is believed to have been responsible for bringing down the websites of the CIA, the US Senate and Britain's Serious and Organised Crime Agency. \r\nhttp://www.telegraph.co.uk/news/uknews/phone-hacking/8646558/Phone-Hacking-The-Suns-website-hacked-by-LulzSec-with-fake-story-about-Rupert-Murdochs-death.html", "group_id": 3920, "id": 1686143}]