[{"user_id": 11626, "stars": [], "topic_id": 6772, "date_created": 1297922967.8857939, "message": "Analysts are expressing alarm over the possibility that the Stuxnet computer virus, unleashed apparently in an attempt by Israel to halt Iran's quest for nuclear weapons, could go too far and trigger a catastrophic meltdown similar to the Chernobyl disaster in the old Soviet Union, according to a report in Joseph Farah's 2 Bulletin.\r\n\r\nThe computer virus apparently has infected the units that control many of the operations at Iran's Bushehr nuclear power plant. While it appears to have thrown a hurdle in front of Iran's campaign to obtain nuclear power, concerns are being raised about complications that could arise from the effort.\r\n\r\nA confidential report by a nation closely monitoring Iran's nuclear work warned that if the reactor would be started prematurely, the virus could result in a catastrophe.\r\n\r\nThe report said that \"with control systems disabled by the virus, the reactor could explode with the force of a 'small nuclear bomb.'\"\r\n\r\n\"The minimum possible damage would be a meltdown of the reactor,\" the report said. \"However, external damage and massive environmental destruction could also occur … similar to the Chernobyl disaster.\"\r\n\r\nThe virus, attributed to Israel, was written to infect the factory automation systems at the Bushehr plant. Programmable Logic Controllers are used to control the flow of water and steam in the plant as well as the power generation functions, the reports explain.\r\n\r\nThe PLCs also control the alarm management systems in the plant.\r\n\r\nBut the Stuxnet virus was designed to allow the power generation functions in the plant to go out of control while the alarm management system continues to report back a \"normal\" operating condition. It also changes passwords on the computers so an operator cannot access the system to take manual control of the process if it does go out of control.\r\n\r\nhttp://www.wnd.com/index.php?fa=PAGE.view&pageId=264253", "group_id": 3920, "id": 129573}]