[{"user_id": 16652, "stars": [], "topic_id": 9696, "date_created": 1298986995.8800671, "message": "¿Crees que desde la política Colombiana se ha buscado realmente establecer un enfoque de innovación desde la Ciencia y la Tecnología? ¿Será que nos hemos quedado en la preocupación por la Alfabetización?", "group_id": 2696, "id": 234553}, {"user_id": 16500, "stars": [], "topic_id": 9696, "date_created": 1298987568.8364241, "message": "Creo que se ha malinterpretado el significado de lo que es realmente \"Ciencia y Tecnología\", en ves de ver el ejercicio científico como un ejercicio de investigación que requiere recursos humanos, físicos y técnicos de primer nivel, se percibe como un ejercicio de indagación de producción científica externa, que después se intenta acomodar para plantear una solución, generalmente comercial, con respecto a esa tecnología. Generar Ciencia y Tecnología implica tener verdaderos científicos trabajando constantemente en proyectos de producción tecnológica. Generalmente esos científicos están en Universidades o en Compañías, he ahí la importancia de convocar a estas dos partes para que las producciones científicas de Colombía desarrollen proyectos pertinentes y en conjunto, donde ganemos todos, Universidades, Organizaciones, Compañías, y sobretodo, el Páis.", "group_id": 2696, "id": 234639}, {"user_id": 16645, "stars": [], "topic_id": 9696, "date_created": 1298992016.2346649, "message": "Es muy dificil innovar cuando toods lso paises cercanos van a delant4e..muy adelante en los temas de tecnologia..sin embargo desde propuestas dialogicas se peude definir lineas validas e identificar y apoayr a quienes verdaderamente trabajan..las mas de las veces el proceso se dana pro la burocracia. comparto las apreciaciones de KAMIAN.", "group_id": 2696, "id": 235388}, {"user_id": 15483, "stars": [], "topic_id": 9696, "date_created": 1298992600.373667, "message": "Podemos encontrar un concepto fundamental para promover la innovación en el siguiente vínculo: http://knowledgefactory.tv/2011/02/23/el-poder-de-las-ideas-cuando-se-conectan/ invito a ver esta charla TED para entender el poder de espacios como este, donde la gente empieza a intercambiar ideas, experiencias, conceptos.  Este es uno de los verdaderos pilares de la innovación", "group_id": 2696, "id": 235502}, {"user_id": 16652, "stars": [], "topic_id": 9696, "date_created": 1299074526.616257, "message": "Muy aceptables sus opiniones, pero no estoy del todo de acuerdo. Seguir creyendo que el desarrollo de la CyT depende exclusivamente de las universidades, centros de investigación y organizaciones, AISLADOS de la escuela, es como seguir encerrando el desarrollo científico en el LABORATORIO con tubos de ensayo. No quisiera exponer todos mis argumentos sin seguir debatiendo con ustedes, entonces les pregunto: ¿Es posible enfocar la CyT y su desarrollo desde la escuela?¿Cómo?", "group_id": 2696, "id": 247021}, {"user_id": 15483, "stars": [], "topic_id": 9696, "date_created": 1299078211.044529, "message": "@CaMartinez de alguna manera compartimos la postura de que le desarrollo de la ciencia y la tecnología, en especial en temas tandinámicos como las TICs, debe gravitar en estructuras diferentes a las tradicionales.  Como estamos acostumbrados a demostrar nuestras afirmaciones, desde el año 2008 hemos consolidado una Unidad Estratégica de Negocio, llamada Knowledge Factory (http://knowledgefactory.tv) que nos ha permitido desarrollar el acervo de conocimientos necesarios para abordar temas de investigación (por ejemplo sobre el impacto de las tecnologías en el salvamento de vidas) como puntas de lanza.  El reto que tenemos ahora, y que a partir de este trabajo \"disidente\" de la academia y los centros de investigación tradicionales, es precisamente articularnos con ellos.  Tenemos un proceso en marcha, que nos va permitir ser parte de un centro de investigación de una universidad, punto que en este momento es fundamental para la consecución de recursos para la investigación.  Nuestro camino ha demostrado que para investigar no se necesita estar adscrito a ninguna Universidad o Centro, solo se necesitan ganas e interés por el conocimiento.", "group_id": 2696, "id": 247502}, {"user_id": 16500, "stars": [], "topic_id": 9696, "date_created": 1299083226.777046, "message": "Un buen ejemplo de que sí se puede generar proyectos trascendentales desde la academia contando con el apoyo de compañías privadas es este: http://web.mit.edu/", "group_id": 2696, "id": 248391}, {"user_id": 16500, "stars": [], "topic_id": 9696, "date_created": 1299083475.516654, "message": "La importancia de ligar a las universidades a los procesos de investigación y desarrollo es darle legitimidad a las mismas, para hacer investigaciones científicas se deben cumplir ciertos estándares políticos y científicos que obligan a las mismas a ejecutar protocolos que las hacen aprovechables para cualquier instituto mundial, no es solo \"institucionalidad\", es tambien un sello de calidad y aprovechamiento. Lo que sí debemos hacer es que desde las universidades salgan mas investigaciones y proyectos en conjunto, no más investigaciones que alimenten el ego de los académicos! necesitamos que las universidades y organismos públicos y privados trabajen en conjunto y no por separado en los mismos temas.", "group_id": 2696, "id": 248424}, {"user_id": 17771, "stars": [], "topic_id": 9696, "date_created": 1299084843.824183, "message": "@KAMIAN Estoy absolutamente de acuerdo contigo!! Cuando los estudios desarrollados en las universidades se integran con las problemáticas de las empresas o la sociedad, el potencial de mejoramiento es enorme. Son proyectos de mutuo beneficio porque las universidades requieren información para desarrollar casos de estudio y las solcuiones a los problemas de la sociedad o las empresas pueden ser mejorados por medio de las técnicas y herramientas que conocen en la academia. Mi tesis de maestría, con la Secretaría de Educación de Bogotá, fue un ejemplo de mejoramiento de una problemática social con un modelo matemático. :)", "group_id": 2696, "id": 248686}, {"user_id": 16652, "stars": [], "topic_id": 9696, "date_created": 1299192609.025162, "message": "Interesantes y por supuesto respetables aportes. Desde esta mirada podríamos empezar a atar los cabos sueltos; que las universidades articuladamente deben liderar procesos de investigación alrededor de la CyT, Innovación y Conocimiento. Pensemos además que esta articulación se debe desprender de una Política Nacional clara y precisa, que articule no solo a las universidades, sino a Ministerios como el de Educación, MinTic, MinHacienda, MinMinas, el SENA, el sector privado y lo mas importante, las federaciones nacionales de Educadores. Es posible que esta articulación sea el primer paso para romper con ese enfoque tradicional de preocupación por la herramienta o el consumismo. Finalizo preguntámdome: ¿Quien se está preocupando porque el niño desde la escuela se apropie de conceptos como la CyT y de su papel? ¿Seguimos esperando a que llegue a la universidad para que lo comprenda? Hasta luegos colegas digitales !!", "group_id": 2696, "id": 264764}, {"user_id": 16500, "stars": [], "topic_id": 9696, "date_created": 1299207591.387713, "message": "Amén! me gusta todo lo que estoy leyendo en este espacio :)", "group_id": 2696, "id": 266155}]