[{"user_id": 2460, "stars": [], "topic_id": 36374, "date_created": 1306118008.5480559, "message": "There is no 'match' to the iPad/iPad 2. iPad 2 with the new display is amazing for everything you need. The closest android tablet that can be considered in the same breath as ipad is the Motorola Xoom. I'm a huge android 'fan' as well. Just have to be a realist.. i'm sure there will be good android tablets soon such as HTC but it will take time.", "group_id": 97, "id": 1147456}, {"user_id": 14243, "stars": [], "topic_id": 36374, "date_created": 1306117038.4592271, "message": "Hey, I want to buy a tablet PC. I need it to surf the web, watch some movies and probably read som PDFs. What would you recomend?", "group_id": 97, "id": 1147362}, {"user_id": 14243, "stars": [], "topic_id": 36374, "date_created": 1306117062.2385271, "message": "Ipad2 is great, I know, but I'm trying to get maybe some android based tablet to the match", "group_id": 97, "id": 1147364}, {"user_id": 30354, "stars": [], "topic_id": 36374, "date_created": 1306119635.1855929, "message": "Be realistic: get an iPad. Loads of apps, great user interface, simple. It's not about the hardware, it's about the stuff you can do with it. Apples app store has the most apps, made by the most creative people. Not to mention it's a 4:3 screen which is great for browsing the web.", "group_id": 97, "id": 1147654}, {"user_id": 12900, "stars": [], "topic_id": 36374, "date_created": 1306121793.2478261, "message": "@neiljain83 The iPad 2 has the same display as the iPad 1", "group_id": 97, "id": 1147962}, {"user_id": 9233, "stars": [], "topic_id": 36374, "date_created": 1306131856.2120259, "message": "Now, more seriously: I tend to think of geeks and tech folks as pragmatic. I switched from PCs and many years of experience with Windows and a big love for Linux to Apple and OSX because it gave me the best of a *nix-powered system (I live on my terminal/iTerm) while having the best indie development ecosystem EVER.  I bought more AMAZING indie software since moving to the Mac than I pirated Windows crappy apps in 10 years… Same thing with the iPad! Be pragmatic: It's the best device out there! If there are other good ones that come out, I'll pragmatically say: \"Pick whichever you like best!\". As to mobile platforms, iOS is second to none… and by a long shot! </long>", "group_id": 97, "id": 1149173}, {"user_id": 9233, "stars": [], "topic_id": 36374, "date_created": 1306131596.0707021, "message": "But hey: you can also play Angry Birds on your Xoom! :)", "group_id": 97, "id": 1149128}, {"user_id": 9233, "stars": [], "topic_id": 36374, "date_created": 1306131581.446166, "message": "… and, while at it, deal with feeling absolutely ripped off because you got a subpar product for the same (or more) money just because you wanted to feel warm and fuzzy inside that you didn't drink the Kool-Aid.", "group_id": 97, "id": 1149126}, {"user_id": 9233, "stars": [{"date_created": 1306131543.056896, "user_id": 13817}], "topic_id": 36374, "date_created": 1306131492.105829, "message": "Get a Motorola Xoom…", "group_id": 97, "id": 1149112}, {"user_id": 9233, "stars": [{"date_created": 1306131542.228442, "user_id": 13817}], "topic_id": 36374, "date_created": 1306131522.0862131, "message": "… then go play with an iPad and feel great that you're not a fanboy…", "group_id": 97, "id": 1149118}, {"user_id": 19649, "stars": [], "topic_id": 36374, "date_created": 1306133691.9824851, "message": "wow, way off topic... but like the others say, if money isn't an issue and you just need to surf, movies, and PDFs then you know what to do", "group_id": 97, "id": 1149384}, {"user_id": 15929, "stars": [], "topic_id": 36374, "date_created": 1306149823.382869, "message": "IMO:\n- playbook has the best browser atm. I just wished it remember the tabs (but literally no familiar apps in BB app world)\n- 7\" is better for reading. too small for movies (maybe youtubes but not movies)\n- AppStore is the most mature, chances are there's an app for everything and everything else.\n- I know games aren't on your list, but iPad has plenty of casual games. something to do when you're just too lazy to skip the ads on DVR, or in the bathroom.", "group_id": 97, "id": 1151164}, {"user_id": 33951, "stars": [], "topic_id": 36374, "date_created": 1306150206.2212379, "message": "ofcourse iPad 2", "group_id": 97, "id": 1151175}, {"user_id": 10453, "stars": [], "topic_id": 36374, "date_created": 1306201687.21085, "message": "well, I just want to say Apple App's store.. is the daddy in the app's market.. in my case, for medical use, they have a lot of app's for us.. I hope Android will make medicine app's someday..at the moment, Apple dominate the medicine app's market", "group_id": 97, "id": 1159976}, {"user_id": 31563, "stars": [], "topic_id": 36374, "date_created": 1306238088.5912049, "message": "iPad has everything you're looking for. Even built in support for PDFs.", "group_id": 97, "id": 1165122}, {"user_id": 7064, "stars": [], "topic_id": 36374, "date_created": 1306247365.4113951, "message": "Vote for the Galaxy Tab 7\" - great size, speedy, works well. Downside - still waiting for android 2.3", "group_id": 97, "id": 1166460}, {"user_id": 7376, "stars": [], "topic_id": 36374, "date_created": 1306250723.7581561, "message": "Does anyone have the Asus Transformer. I'm eager to find out if I there a CTRL and META keys on that keyboard.", "group_id": 97, "id": 1167018}, {"user_id": 30354, "stars": [], "topic_id": 36374, "date_created": 1306520588.1494739, "message": "http://www.businessinsider.com/heres-what-happens-in-households-with-both-an-ipad-and-an-android-tablet-2011-5 might be of interest", "group_id": 97, "id": 1207668}, {"user_id": 30354, "stars": [], "topic_id": 36374, "date_created": 1306524831.5739989, "message": "You should check out AirVideo, it's great. Lets you convert etc too", "group_id": 97, "id": 1208214}, {"user_id": 14243, "stars": [], "topic_id": 36374, "date_created": 1306524723.851398, "message": "I must say, it's great. More confortable than I thought. The only thing I hated the very moment I opened it, it didn't play the videos I had on my mac. I had to do esoteric weird stuff to get them to work", "group_id": 97, "id": 1208198}, {"user_id": 14243, "stars": [], "topic_id": 36374, "date_created": 1306524668.566484, "message": "So, i bought an iPad :P", "group_id": 97, "id": 1208185}, {"user_id": 15929, "stars": [], "topic_id": 36374, "date_created": 1306563776.863946, "message": "so vlc is really out of the app store?", "group_id": 97, "id": 1211506}, {"user_id": 20138, "stars": [], "topic_id": 36374, "date_created": 1306565404.5232911, "message": "The iPad is not portable. Looks strange from the side. The BlackBerry Playbook is the most powerful, portable tablet on market. Try it out!", "group_id": 97, "id": 1211541}, {"user_id": 18745, "stars": [{"date_created": 1310436021.257262, "user_id": 20138}], "topic_id": 36374, "date_created": 1306596497.569416, "message": "I have a PlayBook and it is nice.  The only problem is that it does not play DRM protected videos.  I'm typing this on my BlackBerry PlayBook.", "group_id": 97, "id": 1212839}, {"user_id": 34772, "stars": [], "topic_id": 36374, "date_created": 1306887466.6366749, "message": "I would have said iPad 2 no question, until I got hold of a Samsung Galaxy Tab 10.1 at Google I/O. I still think the iPad 2 is a stronger product (mainly because there are far more apps available), but the SGT 10.1 is the first really credible iPad competitor in the tablet space. If you prefer Android to iOS, then get the SGT 10.1 and you will not be giving up too much. See my review on this subject here: http://www.xconomy.com/national/2011/05/13/the-ipad-finally-has-a-worthy-rival-samsungs-galaxy-tab-10-1/", "group_id": 97, "id": 1245133}, {"user_id": 34499, "stars": [], "topic_id": 36374, "date_created": 1306951884.5085671, "message": "I'm spending some quality time with my wife's iPad2 these days and I have to say that on the positive side I never thought I would enjoy reading magazines as much as I'm enjoying it from the couch - Wired and Brazilian's VEJA and INFO being the main ones. On the downside is that because of its weight and its sleek and slippery back it's kinda tricky to hold it for a long time without having to reposition it in your hands.", "group_id": 97, "id": 1256118}, {"user_id": 34196, "stars": [], "topic_id": 36374, "date_created": 1306952037.547662, "message": "iPad is the best, if only because of the app store. :\\", "group_id": 97, "id": 1256142}]