[{"user_id": 31852, "stars": [], "topic_id": 38035, "date_created": 1307137342.77548, "message": "Set to be featured at E3, here's a very short teaser in the meantime: http://www.youtube.com/watch?v=TsTkWYPf0LM\n\nI quite enjoyed FF13, so I'm looking forward to this, but whatever happened to Versus XIII? :/ It was announced at the same time as FF13 -- five years ago! -- and seemed to me to be the better- and more exciting looking of the two games, but they're still not showing it. Has it become vapourware?", "group_id": 9493, "id": 1281446}, {"user_id": 25703, "stars": [], "topic_id": 38035, "date_created": 1307138578.3306501, "message": "\"Nomura has said the game is unlikely to be released in 2011 and that the earliest possible reveal of information about the game would be at E3 2011.\" - Wikipedia citing a story dating back to January.", "group_id": 9493, "id": 1281644}, {"user_id": 25703, "stars": [], "topic_id": 38035, "date_created": 1307138489.846034, "message": "Oh interesting! I need to get around to XIII then.", "group_id": 9493, "id": 1281626}, {"user_id": 31852, "stars": [], "topic_id": 38035, "date_created": 1307459543.8099251, "message": "E3 trailer. Looks pretty: http://www.gametrailers.com/video/e3-2011-final-fantasy/715029", "group_id": 9493, "id": 1322412}, {"user_id": 31852, "stars": [], "topic_id": 38035, "date_created": 1307792725.4733541, "message": "Man, after E3 my excitement levels for this are through the roof. I really liked XIII, but this looks to be so much better. It seems like they're also trying to address the many complaints longtime series fans had about XIII.\n\nThe only negative I can see (and this might be a biggie) is that Serah seems to be the main character :/\n\nHere's an 18-minute gameplay demo: http://e3.gamespot.com/video/6318720/\n\nAnd some details from the SE Members site: https://member.eu.square-enix.com/en/blogs/hands-final-fantasy-xiii-2-exclusive-details-revealed\n\n[QUOTE]:\n    While still a deeply story-driven game, FINAL FANTASY XIII-2 has a higher emphasis on giving the player choices to make throughout the game. More branching paths, more hidden secrets, more exploration.\n    Level design sees you returning to unlocked environments to access hidden areas as the game progresses.\n    A self-contained story set after the events of FINAL FANTASY XIII. XIII-2’s story will be darker and more mysterious.\n    All-new playable characters (Serah and Noel), plus the return of fan favourites from FINAL FANTASY XIII.\n    The return of the much loved Moogle. A treasure hunter at heart, he will seek out hidden chests.\n    Recruit monsters who will aid you in battle, each with unique abilities.", "group_id": 9493, "id": 1369652}]