[{"user_id": 11626, "stars": [], "topic_id": 9008, "date_created": 1298621860.3498311, "message": "(SteveWatson) – The Southern Poverty Law Center has a history of declaring any protest group it sees as “anti-government” as an “extremist” hate group, without justification. Today it continues that trend with the publication of yet another report that throws in We Are Change members nationwide with racist Neo Nazi groups and Ku Klux Klan factions.\r\n\r\nThe SPLC’s annual report, entitled “The Year in Hate & Extremism, 2010″, is being touted as material for mainstream media headlines such as “Anti-government extremist groups on rise in US: study”, and “Survey: more US hate groups than ever before”.\r\n\r\nOf course, if you contend that everything, including peaceful protest and citizen journalism is “extremist”, then you are assured to find that “extremism” is most definitely on the rise.\r\n\r\nThe SPLC has once again included many state chapters of We Are Change in it’s report, despite protests last year designed to counter the “Defamatory Propaganda” put out by the SPLC.\r\n\r\nThe report separates its targets into “Hate Groups”, “Nativist Extremist Groups”, and “Patriot Groups”. Though We Are Change are listed under the latter, the implication in the overall report and the articles it has spawned are that they are all one and the same.\r\n\r\n“…by far the most dramatic growth came in the antigovernment “Patriot” movement — conspiracy-minded organizations that see the federal government as their primary enemy — which gained more than 300 new groups, a jump of over 60%.” the report states.\r\n\r\nWithout presenting any empirical evidence whatsoever, the report states that the rise of groups such as We Are Change can be attributed “at least partly on the basis of furious rhetoric from the right aimed at the nation’s first black president — a man who has come to represent to at least some Americans ongoing changes in the racial makeup of the country.”\r\n\r\nAlongside such libelous and offensive statements, the SPLC presents its annual “hate map”, complete with icons in the form of swastikas and white robes, to indicate the locations of Neo Nazis and virulently racist Klan groups.\r\n\r\nThe report also lists The Oath Keepers, a group it has regularly targeted, as well as other peaceful pro-Constitution groups.\r\n\r\nThe report even lists Austin’s Brave New Books store, which sells books and dvds on a wide range of subjects. Brave New Books stocks most of Alex Jones’ films as well as books such as ‘End The Fed’ by libertarian Congressman Ron Paul.\r\n\r\nThe SPLC contends that a “mainstreaming of conspiracy theories,” has contributed to a rise in “hate”.\r\n\r\nTranslation: the increased exposure of rampant government corruption and its blatant disregard for the American people has resulted in more social dissatisfaction and the growth of more political protest groups.\r\n\r\nThough it is entirely possible that real extremist groups are growing in numbers, it is clearly grossly misleading to suggest that We Are Change, a peaceful citizen journalism activist group, is on a par with cross burning racists.\r\n\r\nWe Are Change is a true grass roots group that is populated by people of all races and nationalities, it is ludicrous and downright offensive to throw those people in with Neo-Nazi skinheads who worship Hitler.\r\n\r\nAll of this gets filtered down into the suggestions that extreme hate and racism is responsible for new illegal immigration laws, legislation challenging the authority of the privately owned Federal Reserve and a general unrest amongst the wider population.\r\n\r\n“It’s hard to predict where this volatile situation will lead,” the report suggests.\r\n\r\n“What seems certain is that President Obama will continue to serve as a lightning rod for many on the political right, a man who represents both the federal government and the fact that the racial make-up of the United States is changing, something that upsets a significant number of white Americans.”\r\n\r\n“And that suggests that the polarized politics of this country could get worse before they get better.”\r\n\r\nIt is precisely this kind of fearmongering propaganda, if anything, that is causing greater anxiety and divisions in America today, not the work of groups like We Are Change, who take their very name from the philosophy of Mahatma Gandhi.\r\n\r\nIn response to criticism that the SPLC is broadly tarring every group it disagrees with with the same brush, the editor of the report, Mark Potok, told the Christian Science Monitor:\r\n\r\n \r\n\r\n“We’re not in any way suggesting that these groups should be outlawed or free speech should be suppressed … but it’s a kind of calling out the liars, the demonizers, the propagandists,” says Mr. Potok. While the groups themselves may not advocate violence, he says, such speech has “driven people and will continue to drive people to murder.”\r\n\r\nOf course, we should not expect anything different from the SPLC, which has always been heavy on smear and thin on actual facts.\r\n\r\nLast year the group, published a “Patriot Hitlist”, linking mainline political activists and even members of Congress, such as Ron Paul, with violent extremist minority groups.\r\n\r\nThe piece labels Paul, along with Andrew Napolitano, Michele Bachmann and Glen Beck as anti-government patriot movement “enablers”. If anyone is an enabler of extremism it is the SPLC, as it continues to propagandize for the miniscule and completely irrelevant white supremacist movement in order to magnify the ludicrous threat it claims these fringe groups pose.\r\n\r\nOther notables to make the hitlist were Luke Rudkowski of We Are Change, Stewart Rhodes of the Oath Keepers, Larry Pratt of Gun Owners For America, former Phoenix police officer Jack McLamb and former IRS special agent Joe Banister – a who’s who of regular guests on the Alex Jones show, who was also included on the list.\r\n\r\nAlex is quoted in the piece as saying “The entire planet is being enslaved by global, dominant corporations.” If that’s the classification of what an radical extremist believes then the SPLC better prepare to compile a much larger list.\r\n\r\nThe SPLC are always desperate to throw in their mainstream political opponents with killers and mass murderers, no matter how ludicrous the notion. In 2009, the group attempted to link Infowars and Alex Jones with Pittsburgh cop killer Richard Poplawski because Poplawski had left comments on Jones’ websites. Cursory inspection of the comments revealed that Poplawski was attacking Jones, however that did not stop the SPLC ‘s ridiculous smear attempt extending to elements of the media that later had to issue retractions. What made the entire issue even more ludicrous was the fact that comments left on the SPLC’s own website four months previously had called for Alex Jones to be executed for his political views.\r\n\r\nThe SLPC makes millions every year off the back of attacking libertarians and conservatives and anyone else who doesn’t share their own myopic political outlook.\r\n\r\nIt has a nasty habit of labeling “extremist” and “radical” any group or person that it merely disagrees with, lumping them in with white supremacists and right wing militias, all the while preaching that it is committed to “Fighting Hate, Teaching Tolerance, Seeking Justice”.\r\n\r\nPerusing their website and published materials for just a short time will lead any rational and discerning person to identify the SPLC for what it is – an über leftist outfit of control freaks with an axe to grind. However, the U.S. government, under both Republican and Democratic administrations – and by proxy the corporate mainstream media – has chosen to elevate the SPLC to the level of revered research group.\r\n\r\nMost infamously, the SPLC was cited as a primary research source in the highly inflammatory Missouri Information Analysis Center report, a federally funded “fusion center” document that equated Ron Paul supporters, people who display bumper stickers, people who own gold, or even people who fly a U.S. flag with radical race hate groups and terrorists.\r\n\r\nAlong with the ADL, another group that just loves to compile lists of political enemies, the SPLC was also a prominent source for the leaked Department of Homeland Security “Rightwing Extremism” report. The sources for the document, which equated veterans and gun owners with violent terrorists, were revealed following a freedom of information act request from the group Americans for Limited Government. Along with the SPLC and the ADL, other sources included a number of news articles, some of which also cited the SPLC, and a scattering of web posts from highly dubious sources. No statistical analysis was found to have been undertaken by the DHS – they just took the opinions of the SPLC and threw in a few internet posts as an afterthought.\r\n\r\nThe disgusting irony of the whole sorry affair came with the fact that the SPLC immediately jumped on the DHS report when it was leaked, using it to justify their own materials and agendas, in a twisted ‘you scratch my back and I’ll scratch yours’ scenario.\r\n\r\nIn the months that followed, the SPLC returned to the report again and again to tie it in with incidents such as the tragic shooting at the Holocaust museum in Washington DC.\r\n\r\nThe SPLC has continued its sustained effort, with the establishment media in tow, to float the talking point that worried gun owners are growing in the United States and that this could portend a violent act of domestic terror.\r\n\r\nWhile the SPLC claims to rail against hate, it continues to mirror the actions of the most hateful regimes in the history of the human race by compiling endless lists of “enemies of the state”.\r\n\r\nPerhaps the most famous illustration can be derived from an evening dubbed “The Night Of The Long Knives” when in June 1934 Hitler took out his political enemies, based on a prepared list drawn up by Goering and Himmler, later known as the Reich List of Unwanted Persons.\r\n\r\nHitler’s list of enemies then extended beyond political grievances. Suffice to say, political enemies lists have somewhat of a bad rap. But I guess what’s good for Hitler is good for the SPLC.\r\n\r\nhttp://dprogram.net/2011/02/24/splc-report-lumps-in-we-are-change-with-neo-nazis-kkk", "group_id": 3920, "id": 206577}]