[{"user_id": 41657, "stars": [], "topic_id": 45937, "date_created": 1317323911.109313, "message": "Any suggestions on best practices for creating a multi language website using Middleman?\n\nMy needs are simple - a few hundred strings at most would complete the entire site, and having it as www.example.com/fr/about.html (i.e. with the language code at the head of the url) would be plenty good enough.\n\nThe tricky part is pulling all the text into a single or few files so that it can be handed to someone to translate (or put somewhere like http://mygengo.com/translation-services/string/).\n\nPerhaps some combination of dynamic pages and local YAML data might work?\n\nThanks for creating such a great tool!", "group_id": 10410, "id": 2243297}, {"user_id": 7586, "stars": [], "topic_id": 45937, "date_created": 1317324310.9592879, "message": "A couple other users have been investigating i18n support, but I'm not sure of their progress. You should be able to accomplish this with page proxies, variables and YAML. We also include the padrino i18n library, which may be of help.", "group_id": 10410, "id": 2243364}, {"user_id": 41657, "stars": [], "topic_id": 45937, "date_created": 1317325049.0039661, "message": "Thanks!  (Now if I could only work out why some of my posts here are formatted as plain text :-) ).", "group_id": 10410, "id": 2243456}, {"user_id": 41657, "stars": [], "topic_id": 45937, "date_created": 1318088915.733588, "message": "We managed to set something up that generates two versions of a website at /en and /de from corresponding en.yml and de.yml files.  However, we haven't yet got into the tricky areas of changing the actual pathnames to be localized. Nor are we using the padrino i18n helpers so we may be duplicating  some functionality there (and we're not yet doing clever things with plurals etc). Fwiw, this is evolving at https://github.com/gentisaliu/FindBigMail/ in case someone else wants to look. And comments (or pull requests :) ) welcomed of course!", "group_id": 10410, "id": 2305612}, {"user_id": 42383, "stars": [], "topic_id": 45937, "date_created": 1318937568.2513239, "message": "@mm2001 Is this a private repository. At least I don't have access to it. I am having the same problem with i18n as you.", "group_id": 10410, "id": 2375276}, {"user_id": 7586, "stars": [], "topic_id": 45937, "date_created": 1318974033.3723049, "message": "He moved it here: https://github.com/agamz/FindBigMail", "group_id": 10410, "id": 2380004}, {"user_id": 7586, "stars": [], "topic_id": 45937, "date_created": 1318974058.372437, "message": "API planning for an official v2.1 extension is here: https://github.com/tdreyno/middleman-i18n/blob/master/README", "group_id": 10410, "id": 2380009}, {"user_id": 42383, "stars": [], "topic_id": 45937, "date_created": 1319009161.5663531, "message": "@tdreyno If you need help at some point I have been programming in Rails for a long time (well... programming in a long time). :) We are developing Intoloop (intoloop.com) and our plans are big. So, we are willing to push all changes to Middleman we may need to implement. We are also planning to implement a prototyping tool based on Middleman and some other frameworks. This will be implemented for our internal UX team. Keep up the good work!", "group_id": 10410, "id": 2383372}, {"user_id": 7586, "stars": [], "topic_id": 45937, "date_created": 1319126755.3042581, "message": "@pekkaj Awesome. Contact me any time. Send pull requests, ask questions. Everything is welcome.", "group_id": 10410, "id": 2392709}, {"user_id": 42383, "stars": [], "topic_id": 45937, "date_created": 1319444611.8114469, "message": "@tdreyno I surely will do that! Let's see. :)", "group_id": 10410, "id": 2419497}, {"user_id": 41657, "stars": [], "topic_id": 45937, "date_created": 1319696472.6978109, "message": "Based on @tdreyno's outline at https://github.com/tdreyno/middleman-i18n, I've significantly refactored our effort at https://github.com/agamz/FindBigMail. The config.rb is /much/ shorter and seems to fit better with the MM way of doing things. Of course i had the advantage of seeing both our original code (authored by a different first time MM user) and then Thomas' input. It now also uses the I18n library, yay!  Comments welcomed!", "group_id": 10410, "id": 2444774}, {"user_id": 7586, "stars": [], "topic_id": 45937, "date_created": 1319779221.1702671, "message": "I'm hoping to get some time over the weekend to build the first version of the i18n plugin. Thanks for everyone's input.", "group_id": 10410, "id": 2452085}, {"user_id": 41657, "stars": [], "topic_id": 45937, "date_created": 1320773344.146596, "message": "Just finished reading http://middlemanapp.com/guides/localization and can't wait to try it. It looks awesome. Thanks!", "group_id": 10410, "id": 2533970}]