[{"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302633602.2922921, "message": "Your convore gem looks cool! I like how it lets you use the listen API.", "group_id": 4606, "id": 647410}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302633553.152591, "message": "Hmmm, dunno why I can't seem to copy a picture in here....", "group_id": 4606, "id": 647399}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302633449.483819, "message": "If this doesn't exist maybe this could be something that we create. Here's an example of a sharepoint web service description for sharepoint Lists.a", "group_id": 4606, "id": 647389}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302634611.0081041, "message": "Ahhh, I was hoping that it could just magically paste into the chat (like camp fire, I think it does that). That's the only part I didn't create, lol. He built that part and more or less didn't finish the rest. I've been in conversation with him a bunch.", "group_id": 4606, "id": 647591}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302633575.557601, "message": "Hey Ryan, if you link to an image url it will embed it in your message.", "group_id": 4606, "id": 647406}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302633261.5429821, "message": "I've been working on the convore gem (located here: https://github.com/RyanonRails/convore) and I'm pretty much done (other than making it more \"rubyish\", making some better tests, and standardizing the code (like method names)), then I'll push . To be honest, creating this was a pain in the ass. Copy paste api, format, build test, etc.", "group_id": 4606, "id": 647367}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302633404.684871, "message": "Does something exist out there that builds a webservice gem or object from the \"web service list\" or a master list of web services? I know with .NET you can connect to a web service description which lists all of the web methods, does this exist for web services built with ruby?", "group_id": 4606, "id": 647384}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302634816.9329059, "message": "http://i.imgur.com/Q7uJG.png", "group_id": 4606, "id": 647598}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302635051.787878, "message": "Essentially it would be a gem that creates a gem with all of the web service calls. Might save some dev's some time if they're creating web services for their site, or reading web services from somewhere. Thoughts?", "group_id": 4606, "id": 647642}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302634936.113287, "message": "This is basically a list of the web services that it supports. You could even parse the XML for the web service description (XML) and build that. I've never built web services for a ruby app before, does it give something similar?", "group_id": 4606, "id": 647616}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302638131.3859439, "message": "It looks like you're using a WSDL to describe this web service. Since it's written to describe SOAP services, I'm not sure if it would also work with RESTful API's that just use HTTP.  Articles refering to Ruby + SOAP4R + WSDL = Hell don't make me hopefull that something like this would work easily but I haven't used it myself. http://www.brendonwilson.com/blog/2006/04/02/ruby-soap4r-wsdl-hell/ Does anyone know of a gem for writing RESTful client API's?", "group_id": 4606, "id": 648788}, {"user_id": 21834, "stars": [], "topic_id": 18970, "date_created": 1302642269.6980901, "message": "Ryan: from what I've seen people just do it by hand since most of the time you don't want to force your API on your users.  It's nice to make the ruby side feel like ruby, even when talking to a .net service, etc.", "group_id": 4606, "id": 650733}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302646658.9235661, "message": "I guess I'm basically just wanting something similar to a WSDL for RESTFUL. But I guess it'd have to be defined in somewhere... Hmmmm", "group_id": 4606, "id": 651801}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302645165.6210999, "message": "@RyanOnRails do you mean finding out what you can access with them, and seeing how to work with them? I haven't seen a standard documentation format for RESTful services. I usually look for lots of example HTTP requests in the documentation since I find that helpful personally. Are you talking more of a machine discoverable description like WSDL?", "group_id": 4606, "id": 651462}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302644911.4560101, "message": "@RyanOnRails  I've started to see api's that expose the URL's of related resources when you get their JSON representation to make the API more discoverable. For example, say you're app has Article's which each have one Author. Then in the JSON representation of the Article you may see the author's slug (such as it's ActiveRecord ID or a unique GUID) along with the actual base URL where the Author resource is available. This makes it easy for you to explore the API just by retrieving JSON objects from the command-line with a tool like curl or even in your web browser.", "group_id": 4606, "id": 651388}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302645209.1995809, "message": "Yes! Exactly.", "group_id": 4606, "id": 651480}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302644422.8853741, "message": "What do you mean by force on to the users? I see what you're saying mark. Do people normally create at least 1 page in a \"programatic\" fashion (similar to the WSDL) that could be read? We COULD parse the convore page, but it's not to standard or anything. With WSDL we have a consistent format. A gem to create RESTful client API's could be cool also (if it doesn't exist). Then at least we could make some type of standard.", "group_id": 4606, "id": 651281}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302644746.5673771, "message": "@RyanOnRails RESTful API's generally follow the semantic meaning from the HTTP spec with only the resources and query parameters being app specific. As long as the API responds meaningfully with things like GET, PUT, POST, DELETE, etc. then a simple description of the URL's is all you need.", "group_id": 4606, "id": 651337}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302645355.29899, "message": "So I could access a standardized \"list\" just like a WSDL. That would be sweet.", "group_id": 4606, "id": 651516}, {"user_id": 21842, "stars": [], "topic_id": 18970, "date_created": 1302647554.4747109, "message": "almost sounds like something close to \"rake routes\"", "group_id": 4606, "id": 652069}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302644975.0977731, "message": "Yea, I know about the RESTful API's (like convores). The issue i have is with \"discovering\" them or finding out if they exist.", "group_id": 4606, "id": 651406}, {"user_id": 13919, "stars": [], "topic_id": 18970, "date_created": 1302645469.2099199, "message": "@RyanOnRails I'm trying to imagine exactly what that would look like. It almost sounds like something you would generate from a config/routes.rb since that describes available resources and the extra actions on the collections and members. I'm still not sure how valuable something like would be though since you'd still have to understand what the actual resources represented in the context of the service.", "group_id": 4606, "id": 651565}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302646169.6344769, "message": "I'm thinking more from the client side. Just like I can access a WSDL, which lists every service, the type, and the parms to send to it. Then you could easily run some type of parser that builds an object for that, yaknow what I mean? Like, .NET uses WSDL's mostly. IT woudl be nice if Ruby had some \"thing\" to list/expose the REST api's.", "group_id": 4606, "id": 651722}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302646266.8060839, "message": "Like right now I have to go to convore.com/api to get a list of stuff. With this sharepoint thing I can go to the discovery service page and get a nice formatted list (and there's actually some errors in the convore api documentation with post/get, which wouldn't happen if it was being created like a WSDL).", "group_id": 4606, "id": 651739}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302647731.6942761, "message": "Kind of. I'd like to be able to access it as a client, consuming the web service (externally).", "group_id": 4606, "id": 652088}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302647244.496912, "message": "Skimming through this http://www.ibm.com/developerworks/opensource/library/os-ws-rubyrails/index.html actually wasn't half bad. So I could potentially do a wsdl in ruby it seems. Who uses 2 search bars! Look at those screenshots! Ahhh.", "group_id": 4606, "id": 652013}, {"user_id": 21842, "stars": [], "topic_id": 18970, "date_created": 1302647593.0792961, "message": "I guess that doesn't really give you any meta data about what to give to the url's or what you'll get back though", "group_id": 4606, "id": 652074}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302746474.561394, "message": "While on the topic of web services. Could you use the dal as the backend of an app? How would you go about doing that if so? Like, could you essentially re-write convore using it's own web services :D!?!? I wouldn't want to rip off a site, but we have a product at work that has WSDL and ODATA web services but doesn't have a web front end. I'd like to build one in RoR, but I'm not sure it could be done (or done effectively).", "group_id": 4606, "id": 675968}, {"user_id": 21842, "stars": [], "topic_id": 18970, "date_created": 1302835020.641758, "message": "My concern with that kind of approach has been performance, but I've never actually put it into practice to see if it's a real issue.  It seems like the fact that each request would have to go client >> front-end app >> back-end host >> front-end app >> client would inherently be slow.", "group_id": 4606, "id": 694167}, {"user_id": 2633, "stars": [], "topic_id": 18970, "date_created": 1302845886.3898671, "message": "Ugh. WSDL is the apocalypse. I see what you're getting at, but I think solid docs and a sane API are better than a machine readable format from which you can generate an API. You end up in a trap where devs just generate code and have no clue WTF it actually does, and then the code and API get too intense to deal with by hand and you're stuck using the generated stuff. I'm stuck in the middle of this right now where the devs consuming the API need to just start programming, motherfucker, and not rely on a tool to generate everything for them. My 2 cents. http://programming-motherfucker.com/", "group_id": 4606, "id": 696224}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302878790.230464, "message": "Yea, I thought about the whole performance thing, but I wouldn't say it's much more than hitting the database directly (on the assumption that you're hosting the web services, not using someone elses).", "group_id": 4606, "id": 700835}, {"user_id": 22052, "stars": [], "topic_id": 18970, "date_created": 1302880527.900774, "message": "@darkhelmetlive So basically you're saying that as long as my WSDL generates another WSDL which then converts it to COBOL comp-3 fields we're cool? http://i.imgur.com/0cEtV.jpg", "group_id": 4606, "id": 701434}]