[{"user_id": 21845, "stars": [], "topic_id": 33682, "date_created": 1304534601.948751, "message": "IANAL, but if you rewrote the code from scratch, you'd probably be okay?", "group_id": 4606, "id": 917450}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304534432.571023, "message": "It's kind of a double edged sword. People could say that I'm less valuable with the code on my blog due to other people being able to do it. But on the flip side you could say I'm more valuable because it shows I know how to do those things.", "group_id": 4606, "id": 917419}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304534110.0326991, "message": "I've been doing quite a bit of C# for a MS product called \"MS CRM 2011\" and I find that the example code + blogs are garbage. I'd like to blog about certain things (with code included). The problem is that some of this stuff I've learned on the job (and code snippets would be similar to what I've created in \"job code\") and I'd be worried that they could yell at you for that.", "group_id": 4606, "id": 917360}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304534014.6548591, "message": "If I write code at work, then turn around and put that code on my blog (with anything related to the company edited out) is that considered theft or something weird like that?", "group_id": 4606, "id": 917331}, {"user_id": 2633, "stars": [{"date_created": 1304535743.3987961, "user_id": 13919}], "topic_id": 33682, "date_created": 1304535608.078625, "message": "This is from when I worked at CodeBaby. Nothing really fancy or revolutionary going on there... http://blog.darkhax.com/2010/05/14/find-queries-missing-indexes-in-your-rails-application", "group_id": 4606, "id": 917752}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304534562.9863541, "message": "So if I re-wrote that code (from my brain) at another job, or on my blog how would that be dealt with? This isn't a trade secret or anything (like how they get that caramel in caramilk!) since the actual SDK is online and in full view of the world.", "group_id": 4606, "id": 917444}, {"user_id": 13919, "stars": [], "topic_id": 33682, "date_created": 1304534586.7348011, "message": "Hmm, that's tricky. I'm not a lawyer so none of this is actually advice but if it was me I'd check my NDA and the talk to my boss if I was still worried. I'd also avoid doing the blogging on work time or with work resources (like computers or my employers internet) so that I can prove it's not the IP of my employer.", "group_id": 4606, "id": 917447}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304534229.301542, "message": "My defense would be that it's all in the SDK which can be extracted by any individual. I don't think my job would try and shut me down or anything since they seem pretty cool but if you left a job at some point, could they try and come after the example code that you've put on your blog?", "group_id": 4606, "id": 917392}, {"user_id": 21845, "stars": [], "topic_id": 33682, "date_created": 1304534460.2519469, "message": "Generally speaking in Alberta, code that somebody pays you to write belongs to them.", "group_id": 4606, "id": 917429}, {"user_id": 21845, "stars": [], "topic_id": 33682, "date_created": 1304534543.341924, "message": "That said, (as a consultant), I've never had somebody come after me saying \"You stole my code when you put it up on your blog\".  I generally change the code I post like you suggested - editing out sensitive or company specific stuff.", "group_id": 4606, "id": 917439}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304535868.0132699, "message": "Nothing proprietary or anything for sure. Just basic SDK usage (which isn't documented or has poor examples).", "group_id": 4606, "id": 917823}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304535348.2559841, "message": "Rewrite it to fit the post, and have a point. \"How to do X in Y\" and have minimal case code to do it. If it's just something basic that doesn't do anything fancy, whatever. If it's a proprietary algorithm or something, then no dice.", "group_id": 4606, "id": 917668}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304535360.3328049, "message": "And what Mark said.", "group_id": 4606, "id": 917675}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304535535.9071939, "message": "Really, there's not too much code out there that is truly unique. It's all loops and and branching! There's usually a more abstract problem at work that you can blog about.", "group_id": 4606, "id": 917729}, {"user_id": 13919, "stars": [], "topic_id": 33682, "date_created": 1304535741.980675, "message": "@darkhelmetlive that's an awesome post btw! Hadn't seen that before.", "group_id": 4606, "id": 917795}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304536880.6902449, "message": "Then balls to the wall", "group_id": 4606, "id": 918156}, {"user_id": 29331, "stars": [], "topic_id": 33682, "date_created": 1304579879.90868, "message": "What I used to do was actually check if an employer had a blogging policy - if they didn't, I'd come to them with each snippet I wanted approval to blog about as I found one. After doing that for a while it's pretty easy to get a release or something in writing.", "group_id": 4606, "id": 925869}, {"user_id": 21814, "stars": [], "topic_id": 33682, "date_created": 1304611195.0025311, "message": "That's a tough one. I haven't been employed by anyone for eight years - so I automatically go against the grain of an \"employer\" or \"boss\". On the other hand, as a business owner, you want to protect your business techniques and code - your intellectual property. I would discuss it with your employer and get a signed agreement approving your blog and posting content related to your job description provided that you don't disclose or breach any confidential information. With that permission you should be fine. Or, to be safe, talk to an IP lawyer (just make sure they're good).", "group_id": 4606, "id": 930972}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304631530.4793661, "message": "@chrisyour The thing is, hooking up some click events with a GUI toolkit isn't IP, it's just basic \"this is what you do\" code. Who cares!? Post it! Now if you have some natural language parsing algorithm for your company's search engine, that's WAY different.", "group_id": 4606, "id": 934862}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304631444.3365901, "message": "If I remember right, there is some good stuff in here: http://www.hanselman.com/blog/FoundVideoSocialNetworkingForDevelopersAndMakingYourBlogSuckLess.aspx", "group_id": 4606, "id": 934858}, {"user_id": 2633, "stars": [], "topic_id": 33682, "date_created": 1304634117.3842831, "message": "I suppose. My philosophy is I just do it, but be smart about what I'm posting. If my employer gets in a fuss about something stupid and trivial, maybe I don't want to work there... I think it's typically managers that have no idea about the actual value of certain code. They think every line is so special that nobody outside the company must see it because holy shit this is proprietary, when it's really not.", "group_id": 4606, "id": 935089}, {"user_id": 21814, "stars": [], "topic_id": 33682, "date_created": 1304633536.250314, "message": "@darkhelmetlive For sure. But if Ryan has any inkling that it might become a problem, it would be good to talk with his boss about it. Some People in our industry can get really stirred up about posting code, graphics, etc. Even if it's warranted or not. Better safe than sorry.", "group_id": 4606, "id": 935035}, {"user_id": 21814, "stars": [], "topic_id": 33682, "date_created": 1304633742.593204, "message": "By people, I mean employers.", "group_id": 4606, "id": 935054}, {"user_id": 21814, "stars": [], "topic_id": 33682, "date_created": 1304635007.5945139, "message": "But the question is about code being created at work then being edited for the web and put into a blog post considered theft. Being transparent would probably be better than the employer finding out on their own and misunderstanding or translating the content themselves.", "group_id": 4606, "id": 935238}, {"user_id": 21814, "stars": [], "topic_id": 33682, "date_created": 1304707742.279026, "message": "Good stuff.", "group_id": 4606, "id": 944851}, {"user_id": 22052, "stars": [], "topic_id": 33682, "date_created": 1304707493.5867651, "message": "I wasn't really worried about it being a problem, I was kind of just curious if anyone had any insight (or maybe even dealt with someone who asked them to take down code). I spoke with my team lead today and he said it's no problem as long as there's no reference to the project I'm working on, reference to company it's being done for, or any \"proprietary code\" such as algorithms. Basically if I'm building it with the MS SDK it's legit and can go on my blog :D", "group_id": 4606, "id": 944831}]