[{"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300888700.4696119, "message": "Over time I have used a tonne of services across the web, trialling new websites and products as they start to go public. The problem I have is the distribution of my data across these services. I don't know too much about this area, but I had a few thoughts. \n\nI wish for a web with standards for exportability, a web where I can take my data wherever I want and do whatever I want with it, and with ease. This shouldn't involve me downloading files in various formats, converting them, re-uploading them, etc. It should be a one button, clean system between competing services.\n\nJust wondered what people think or know about this and whether or not there are motions in place to move the web in this direction?", "group_id": 97, "id": 417520}, {"user_id": 611, "stars": [{"date_created": 1300899201.742976, "user_id": 141}], "topic_id": 14688, "date_created": 1300899147.8566189, "message": "@markpasc Sure, that's a valid argument - but there are ways around that, stating guidelines about how long data will be stored on servers when the user is inactive...", "group_id": 97, "id": 418803}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899396.7473519, "message": "@br yeah, that's definitely rude when services don't offer that", "group_id": 97, "id": 418842}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898214.4697011, "message": "ultimately that's the only way to own your data, but hosted service providers have hairy disincentives for making that possible", "group_id": 97, "id": 418703}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898482.3286481, "message": "there are less obvious arguments too, such as that because so few people using a mainstream consumer service care, making even simple export work can be deferred for features more people want", "group_id": 97, "id": 418732}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898697.1403849, "message": "Marco Arment described a couple more issues on last week's Build and Analyze in relation to why he didn't build importing for Tumblr. for one, if you have a service that's providing real new value, you're doing something different from what came before, so even if there is a standard protocol, you're not compatible with the data.", "group_id": 97, "id": 418751}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898350.2167399, "message": "the most short-sighted is the obvious one that if you have easy data portability, it's easier for you to switch than a business owner wants it to be", "group_id": 97, "id": 418720}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898812.1602521, "message": "such as people wanting to bring long wordy posts into Tumblr when it isn't really for that. you *could* import a blog into Tumblr, but you won't get the multitype post experience they intend.", "group_id": 97, "id": 418759}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899076.2453201, "message": "@br that could be, though in terms of that mainstream consumer audience seems like Tumblr has been doing fine so far", "group_id": 97, "id": 418785}, {"user_id": 611, "stars": [{"date_created": 1300899404.717484, "user_id": 141}], "topic_id": 14688, "date_created": 1300899334.9686351, "message": "Another data standard I'd be in favor of would be a users right to remove any data they had created. There are old services I used that don't even let you delete your account, nevermind your data.", "group_id": 97, "id": 418830}, {"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300899381.0915589, "message": "You contact admins and the services and they tell you something along the lines of \"we're working on that feature\" - it's just not good enough.", "group_id": 97, "id": 418840}, {"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300898771.0331199, "message": "In the case of Tumblr I don't see that as true, they are simply a blogging platform.", "group_id": 97, "id": 418757}, {"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300898839.296195, "message": "I guess not", "group_id": 97, "id": 418761}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300898869.0149939, "message": "yeah, they at least don't see it that way, I guess.", "group_id": 97, "id": 418764}, {"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300898923.1311369, "message": "Maybe in this case Tumblr are missing out on a wider audience, it may be a reason people choose Posterous over them.", "group_id": 97, "id": 418766}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899012.7561679, "message": "another issue he brought up is if it's easy to import to a hosted service, you get a lot of looky-loos importing stuff then not really using the service, so the service provider is then on the hook for supporting a bunch of imported data that no one's really getting value out of.", "group_id": 97, "id": 418775}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899185.8698931, "message": "Pinboard saw the import issue when people rushed to import all their Deiicious links in December, though since they have a door fee people are likelier to have made the choice already and will stick around", "group_id": 97, "id": 418811}, {"user_id": 611, "stars": [], "topic_id": 14688, "date_created": 1300899934.539119, "message": "@markpasc OK, so you should be able to export your photos, along with the comments left on your photos. But at the same time, the users who commented on your photos should have the right to remove their comments at any point. The fact they made an informed decision to comment and publish their thoughts on your content, ultimately gives you the right to export them too.", "group_id": 97, "id": 418909}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899647.0842371, "message": "that reminds me of another argument though: with so many services being \"social\" nowadays, sometimes the data you want isn't really owned by you. like you may implicitly have license to comments people leave to your photos, but your comment on someone else's private photo isn't useful without the context, and it's not clear what of that context you have a right to keep", "group_id": 97, "id": 418879}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300900492.529608, "message": "@br I think that's true in that case, but one might argue that they weren't \"informed\" that you might port their comments to a new service. they might expect they *can* revoke their comment at any time, without having to sign up for the new service you ported it to (and identifying people from other services is a lot harder to implement than canceling an account)", "group_id": 97, "id": 418983}, {"user_id": 611, "stars": [{"date_created": 1300900857.783917, "user_id": 141}], "topic_id": 14688, "date_created": 1300900755.584276, "message": "Maybe only the raw data you (the user) were involved in creating should be exportable and not the associated content from other users (i.e. the social graph)", "group_id": 97, "id": 419001}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300899844.4227991, "message": "dunno if that new EFF article on social networking has anything to say about this, I haven't read it yet", "group_id": 97, "id": 418904}, {"user_id": 141, "stars": [], "topic_id": 14688, "date_created": 1300900705.036952, "message": "it's the same general issue as when Facebook tried to keep Robert Scoble from exporting his network's contact information (hope I'm remembering those details right). do you have the right to that information because those friends shared it with you, or might they expect it's only there for immediate contact purposes, and revocable in the same way?", "group_id": 97, "id": 418996}, {"user_id": 25326, "stars": [], "topic_id": 14688, "date_created": 1301088804.1973619, "message": "there are a handful of interesting projects out there to help people acquire and own their personal data - i'm working with the team on the Locker Project (http://github.com/quartzjer/Locker) for that very cause.", "group_id": 97, "id": 442730}]