[{"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298506517.6183741, "message": "I can track my MC Concern (The Future) by using the MC Benchmark (The Past), but are there things that specifically work to push him closer and further from his Concern. I would think it's the Critical Flaw and the Unique Ability, except that those are expressly how the MC can affect the Solution in the OS. The seem to be working nicely to create tension in the MC Throughline, too, though...", "group_id": 2515, "id": 193771}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298506727.546448, "message": "I suppose another place to look is the Direction (he's a steadfast MC), but this wouldn't work for the scenes or events in my story.", "group_id": 2515, "id": 193833}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298516342.861419, "message": ". \n\nI'll take a whack.\n\nI'll take a quick whack.Luckily I'm no expert but I'll babble about MC Benchmark.\n\nAt this point my understanding is that the MC Concern is his/her personal/private concern. Yeah, I know I used “concern” in defining “concern.” \n\nIf the “concern” is recognized/dealt with/resolved/”un” concerned in the end of the story that would be in the future as most of us use a time-line that runs from past-to present- to future.\n\nBUT what of the “benchmark”?\n\nSome in the audience applaud a very visible “benchmark” but I personally prefer a less intrusive one. It might be interesting for members of this discussion to identify some of the “obvious” benchmarks in stories/plays/movies. It might be just as instructive to see the less obvious ones. Supposedly every story should have one or the other.\n\nBut if THIS is correct- how does that relate to the comments made by the original post?\n\nAre you displaying “benchmarks” that the audience can recognize?", "group_id": 2515, "id": 194969}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298521292.077039, "message": "Just to clear up a misconception, having the concern un-concerned at the end doesn't make the concern \"The Future.\" If I'm trying to clear up my dad's conviction as a murderer, then my concern would be \"The Past\" (if I'm in a Situation Throughline). But, my question isn't really about Benchmarks -- the benchmark measures how strong something is. My question is about the forces that affect the thing we are measuring.", "group_id": 2515, "id": 195186}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298521789.580658, "message": "That's a bit vague, so I'll make something up we can talk about concretely: My daughter is going to marry a guy in the mob. I don't want that to happen -- my concern is \"The Future\" (because the wedding is in the future). My benchmark is \"The Past\" -- so let's just say that at the movie goes on, I learn that the Fiancé's past is WORSE than I thought it was. The Worse he is -- the worse his Past is -- the more I'm concerned about The Future. \n\nMy question is about what appreciations get played with that affect my benchmark of The Past. \n\nLet's say I have a Unique Ability of Choice, and a Critical Flaw of Attitude. Is it my \"Choice\" to look at old newspapers that uncovers his Past? And my bad attitude that interferes?", "group_id": 2515, "id": 195223}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298559147.567867, "message": "Just to clear up a misconception, having the concern un-concerned at the end doesn't make the concern \"The Future.\" If I'm trying to clear up my dad's conviction as a murderer, then my concern would be \"The Past\" (if I'm in a Situation Throughline). But, my question isn't really about Benchmarks -- the benchmark measures how strong something is. My question is about the forces that affect the thing we are measuring.\nMikeDerk about 10 hours ago\nThat's a bit vague, so I'll make something up we can talk about concretely: My daughter is going to marry a guy in the mob. I don't want that to happen -- my concern is \"The Future\" (because the wedding is in the future). My benchmark is \"The Past\" -- so let's just say that at the movie goes on, I learn that the Fiancé's past is WORSE than I thought it was. The Worse he is -- the worse his Past is -- the more I'm concerned about The Future. \n\nMy question is about what appreciations get played with that affect my benchmark of The Past. \n\nLet's say I have a Unique Ability of Choice, and a Critical Flaw of Attitude. Is it my \"Choice\" to look at old newspapers that uncovers his Past? And my bad attitude that interferes?\n\n\nLet me attempt a reply and touch on all of the points.\n\nIn your first example “the clear up dad's conviction” I'm not sure I erven see that as a “true” MC Concern. I see that as more of a “OS Concern” . My understanding is that the MC concern is more private. Unless I've really misunderstood something. Clarification anyone?\n\nAs for your “comment” about benchmark “measures how strong something is” again that is not my understanding of “benchmark. My understanding of “benchmark” is (I looked it mentions “measuring stick”) . For me the “measuring stick is simply showing the points of  change not the speed at which we (MC) reaches those points or the force of the change. Again, clarification anyone.\n\nIf the interest is about “ the forces that affect the thing we are measuring.” then I think we're in another area. Is this the IC or the OS arena? I suspect it falls more towared the IC.\n\nIn the example of the “daughter marrying into the mob” \n\nI will suggest here that your example doesn't touch on the underlying MC Concern (as you conveyed it) because we don't get a sense of “why” you really don't want her to marry. - bad experience with mob in the past/ her by the mob/connection with the mob/fear of the mob because of something you did etc. Again, my understanding is that the MC Concern must me personal/private.\n\nNow then you mention that your Benchmark is the “past”\n\nI want to digress for a second- \nI'm not sure whether you are looking at a “report” or not in bring up your examples. I quickly went through ALL of the reports and interestingly found only one (I admit I might have missed another) that uses “benchmark and that is “Kitchen Sink”. (I'd always thought that kitchen sink was everything but apparently it is a beast unto itself) \n\nSo in Kitchen sink we get something like “Main Character Concern / Benchmark”\n\nIS THIS what we are looking at??? \nIf so I will posit that (perhaps)  the hint is in something that this report shows such as:\n...the degree of his concern is measured by how fully he accommodates The Past:\n\nthe past made him question his own decisions about what is good and evil [from one of my stories so it might be different from yours]\n\nSo If I'd fleshed out my story more the report might have indeed continued such as:\n \nin the past he was forced to make choices as he deliberated what was good and evil\n             actual scenes or memories of choices that forced him to either get more evil or fight evil\n             and now he/she sees these choices rising again only (in your example) morphed into much more serious choices for the daughter or raising the spectre that his daughters marriage will enliven the consequences of these earlier decsions.\n\nThat being said- I will suggest (because I can't remember ever seeing any detailed discussion on what this actual report verbage means) that this “report” is simply giving the writer the opportunity to “show” the examples of the benchmarks that will illustrate  the MC Concern.", "group_id": 2515, "id": 198121}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298570905.3420739, "message": "Your response is so long that it's going to be super-unwieldy trying to respond. I'll make some new topics.", "group_id": 2515, "id": 199717}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298572145.8330619, "message": "If you're looking for \"Benchmark\" then it's also under Main Character, Impact Character, ... the list under the StoryGuide section.", "group_id": 2515, "id": 200047}, {"user_id": 10814, "stars": [], "topic_id": 8519, "date_created": 1298572336.9377601, "message": "Everything in a throughline can be used to moderate the \"speed\" of the throughline's conflict development.  Domain, Concern, Issue, Problem, and Symptom tend to increase the conflict.  Thematic counterpoint, Solution, and Response tend to decrease or deflect the conflict.  The benchmark acts as a standard of measure against which the throughline's progress toward greater or lesser conflict is seen.", "group_id": 2515, "id": 200071}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298572648.995636, "message": "Sweet, thanks.", "group_id": 2515, "id": 200124}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298578715.285217, "message": "Again one of the “concepts” we need to clarify is the actual word “benchmark.” \nHow do you define benchmark?", "group_id": 2515, "id": 201629}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298578752.6033261, "message": ">This could be highly emotional. Do you want people thinking your dad is a killer? That >you're the son of a killer?\n\nWhat people think would fall into “Mazlo” in the realm of esteem. (As I see it) Are you going to show a “benchmark” beforehand that suggest what people think is important? That having people think something about your father is an issue? Why? Is there an expressed love of father? Etc. And if you intend to indicate the importance as highly emotional then the “benchmark” leading up to it should be just as “charged” as his response. (I think)", "group_id": 2515, "id": 201637}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298578691.0482421, "message": ">I have to guess that you see this as \"not an MC Concern\" because it seems un-emotional. >I'm going to put this into the Situation Domain because I said the Benchmark was \"The > >Past\", which forces this. \nAh the inprecision of language (or my word choice).\nI don't necessarily agree with “un-emotional” To quote the definitions section: \n“the main character's personal objective or purpose” and I see the “personal” as signifying something more “psychological” falling into Mazlo's hierarchy.", "group_id": 2515, "id": 201626}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298578800.618516, "message": "This may have been a poor use of words on my part. Let's look at a football game -- you're 7 points behind. It's the first quarter. Well, you have a long time to score. Pressure is low. Now, it's the fourth quarter, 2 minutes left. You are seven points behind. Pressure is high. The benchmark (time remaining) tells you how much pressure those 7 points can exert. In other words, how \"strong\" those 7 points are.\n\nYour choice of words simply made me look at the “context” which in this case is DP. And we both know that DP is frought with a vocabulary issue. My “benchmark” was the DP benchmark. But let's look at the football analogy you gave...\n\nI see this as “story points” or even scenes rather than benchmarks.", "group_id": 2515, "id": 201651}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1298578843.716682, "message": "So I see “benchmarks” as points marked much as the DP. They are what they are. I don't assign them a value (you used strong) in the same way. \n\nThe example (as I recall) that DP gave was crumpled beer cans that the alcoholic “marks” his progress with. The “can” does nothing more than signify the point reached. In your example the “game points” are nothing more than an indication of the game played.", "group_id": 2515, "id": 201663}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298584553.6090291, "message": "In terms of \"benchmark\", I mostly just use it as a signaling device -- to the audience and/or the character(s). They want X, and until they get X, they look at the benchmark to see how things are going.", "group_id": 2515, "id": 202621}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298584799.471319, "message": "I really like the beer can method to mark something. But, I think that few things in stories are free of a subjective interpretation. Why would a story about an alcoholic have a pile of beer cans in it? Let's say that it's because he wants to \"get his life together.\" The bigger the pile of beer cans, the longer he's gone without cleaning up his kitchen (say). So, subjectively, one hundred beer cans is worse than one beer can.", "group_id": 2515, "id": 202657}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1298584388.265239, "message": "I don't think \"personal\" has anything to do with Mazlo. I think it just means \"unique to the person\" in this case.", "group_id": 2515, "id": 202587}, {"user_id": 10814, "stars": [], "topic_id": 8519, "date_created": 1298648964.1241441, "message": "An MC benchmark is not something the MC is necessarily aware of, but rather a structural part of the story that lets the AUDIENCE know how the throughline is progressing.", "group_id": 2515, "id": 208837}, {"user_id": 10814, "stars": [], "topic_id": 8519, "date_created": 1298649185.1416659, "message": "For example, the OS Benchmark is Doing.  As the story progresses, more and more \"Doing\" is going on, which indicates that the throughline is moving along.  On top of that, the fourth OS Signpost is Doing, so the last act has a whole lot of things being done, such as killing all the competition.", "group_id": 2515, "id": 208867}, {"user_id": 10814, "stars": [], "topic_id": 8519, "date_created": 1298649265.7959399, "message": "To reiterate, a benchmark is a gauge for the audience to see how a throughline progresses.  Very often the characters are not aware of it because it is a bigger view than they see, or they are blind to it for other reasons.", "group_id": 2515, "id": 208879}, {"user_id": 13650, "stars": [], "topic_id": 8519, "date_created": 1299183351.937469, "message": "If I understand that comment then the \"beer cans\" is something that the audience \"understands\" (consciously or unconsciously) and \"needs\" (perhaps appreciates would be a better word choice)?", "group_id": 2515, "id": 263109}, {"user_id": 7664, "stars": [], "topic_id": 8519, "date_created": 1299183975.6152921, "message": "I think that's right. Just like we understand what inning we are in in a baseball game.", "group_id": 2515, "id": 263245}]