[{"user_id": 38447, "stars": [], "topic_id": 42391, "date_created": 1311211233.659122, "message": "I'm in Tempe, AZ and I've been brainstorming with fellow entrepreneurs on this very thing. I've been to S.C.O.R.E meetings, networking events, etc. I always feel I'm being talked AT. Yes its great hearing how you made your company succeed. Now show me how to make MINE. And it's always the same content: Here's how to write a business plan, Here's why you should be an Entrepreneur, Here's some books I'm reading and you should too...Blah Blah Blah. We know how to write the plan, we all read Think and Grow Rich before we were driving, we don't need to know why we should be entrepreneurs, we just are. You don't tell Jesus why he should be a Christian. What I'm looking to create is an environment where viable ACTION is the focus! Need $10,000 in startup funding? Let's get your idea in our network and get you the funding in a week. Looking for a partner? Here's an in-person introduction to another entrepreneur also looking for a partner. Need information on importing a product? Let's have lunch with so-and-so because they are already importing. Need an website? Well here's the name of the guy I use. Oh, you need that few hundred dollars for your tiny operation? Well here's a list of free tools you can use to create one yourself. Take Ted.com, eHarmony, Craigslist, your local coffee shop, and smash them all together with content just for entrepreneurs. THAT\"S what we need. We need a platform where everyday we are thinking, \"Wow that was an amazing conversation/meeting/webconference/daydream. Now let me go do this thing and that thing TODAY because I know WHAT I should do next, I know WHY I should do it next and most importantly I know HOW to do it now.\" We need an environment where a successful Entrepreneur is giving something of VALUE to another Entrepreneur and it's something that actionable NOW. That is what I and my friends are attempting to put together here in Tempe. What do you think of that?", "group_id": 11094, "id": 1686317}]