[{"user_id": 11626, "stars": [], "topic_id": 8683, "date_created": 1298528704.781827, "message": "No, it’s not a deleted scene from Outbreak. The Pentagon agency charged with protecting the United States from weapons of mass destruction is looking to the insecure storage of pathogens at clinics in Africa as the next flashing red light for a potential biological outbreak.\r\n\r\nKenneth Myers, the director of the Defense Threat Reduction Agency, joined his old boss, Sen. Richard Lugar, on a trip to Burundi, Kenya and Uganda last fall to check out the security of disease samples at local clinics. What they found disturbed them: strains of deadly viruses like foot-and-mouth disease and anthrax, available at numerous clinics in areas in or near conflict zones, potentially ripe for the terrorist taking.\r\n\r\n“It’s important to remember that these countries have no intention of being threats to the United States,” Myers tells Danger Room.  Indeed, the clinics have a very good reason for housing the pathogen samples: Their doctors need to be able to match patients with known diseases in the event of an outbreak. But Myers and Lugar left their trip worried about how many clinics possess the pathogens, as 20 years’ worth of lessons from checking the spread of loose nukes raised fears of inadvertent bio-proliferation.\r\n\r\nSo the Defense Threat Reduction Agency is looking to expand a program that’s grown out of Lugar’s eponymous anti-nuclear proliferation effort into Africa to see if the U.S. can help partner with these countries to minimize the threat. The first goal of the Chemical Biological Engagement Program is to build those relationships, Myers told a group of reporters Wednesday morning, so they can “consolidate the number of facilities with dangerous pathogens.”\r\n\r\nThat’s not all. Myers wants to collaborate with government officials, all the way down to the clinic level, to make sure the pathogens in residual facilities are stored safely, and offer help on “disease surveillance [and] epidemiological training.”\r\n\r\nIt’s an early effort — “about to be able to get started,” Myers put it — that’s part of the $1.5 billion worth of “layered” defenses against chemical and biological threats that the Pentagon is asking Congress to fund in the next fiscal year. Myers conceded that developing defenses against those threats is “very, very difficult.” Expensive efforts to create vaccines for consequence management have stalled. But that’s why he believes in “interdicting” WMD threats at their source to stop proliferation, having better surveillance of known and suspected sites, and responding capably if an attack should occur.\r\n\r\nDespite years of fears, it’s an open question whether terrorists are actually planning chemical or biological attacks. Last month, the public threat assessment from U.S. intelligence officials warned of “smaller-scale” terrorism, involving homemade bombs like SUVs rigged to detonate or explosives packed in printer cartridges. Those cheap, low-yield terror attempts have been on display for the last several years. U.S. intelligence generally sees chemical, biological or even nuclear attacks as being mostly aspirational for terror groups — something they’d like to pull off, sure, but aren’t so realistic.\r\n\r\nMyers declined Danger Room’s efforts to press him on whether the terrorist chem-bio threat was in fact receding. From his perspective, the ounce of prevention afforded by trying to lock down facilities where pathogens reside is more than worth the effort. “Is it not in the U.S. national security interest to create more barriers between the threat and [U.S. citizens]? The answer obviously is yes,” Myers says.\r\n\r\nhttp://www.wired.com/images_blogs/dangerroom/2011/02/DTRAswab.jpg\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/pentagon-looks-to-africa-for-next-bio-threat/", "group_id": 3920, "id": 195762}]