[{"user_id": 13650, "stars": [], "topic_id": 35308, "date_created": 1305402096.5391719, "message": "Also is there a way to show TWO characters as impact character in the software? I can make one the \"antagonist\" and the other the \"contagonist\" but I'm curious.", "group_id": 2515, "id": 1054334}, {"user_id": 13650, "stars": [], "topic_id": 35308, "date_created": 1305402018.9099281, "message": "I'm looking at the Build Character screen- in the Purpose Quad it identifies AWARE as IC Crucial and SELF AWARE as MC Crucial. When I identify my main character as PROTAGONIST I expected him to \"appear\" in the MC crucial. He did not. (Yes Story Engine is complete.)  Furthermore if I identify my IC as Antagonist I expected he might show up in the IC Crucial. Again, not the case. The other \"elements\" in Purpose are \"actuality\" and \"perception\" - the IC and MC ARE in THESE elements. Needless to say I'm missing something or have a big misunderstanding (probably the latter). Anyone shed light on this?", "group_id": 2515, "id": 1054314}, {"user_id": 7664, "stars": [], "topic_id": 35308, "date_created": 1305412423.5487881, "message": "Do you mean you expected his icons to show up in the box?", "group_id": 2515, "id": 1055760}, {"user_id": 7645, "stars": [], "topic_id": 35308, "date_created": 1305429299.2492449, "message": "As far as I know you can't make two characters the IC in the software.", "group_id": 2515, "id": 1057444}, {"user_id": 7645, "stars": [], "topic_id": 35308, "date_created": 1305429543.073061, "message": "The Archetypal Characters are based on a theoretically perfect alignment of characteristics. Aware and Self-Aware are not a part of that perfect alignment for Protagonist and Antagonist. You can either break out of the mold and use Complex Characters (highly suggested), or just ignore the crucial elements for now. That's what I've always done, and speaking from experience, it tends to work itself out on its own.", "group_id": 2515, "id": 1057461}, {"user_id": 7645, "stars": [], "topic_id": 35308, "date_created": 1305429564.314568, "message": "It's not crucial to know and use the crucial elements.", "group_id": 2515, "id": 1057463}, {"user_id": 10814, "stars": [], "topic_id": 35308, "date_created": 1305433762.4933629, "message": "The easiest way to show two IC's in Dramatica is to put both names, such as Mike/Shiela, or The Ghosts.", "group_id": 2515, "id": 1057761}, {"user_id": 7664, "stars": [], "topic_id": 35308, "date_created": 1305434062.3051579, "message": "But multiple ICs don't share all traits, do they? I thought they would just share the crucial element, or the relevant quad.", "group_id": 2515, "id": 1057785}, {"user_id": 30951, "stars": [], "topic_id": 35308, "date_created": 1305447814.3858609, "message": "For the multiple ICs, could you not also add more characters to over the various character traits? I thought about this a while back. For example, have the IC defined as Chris suggested, and then 2 other characters with the same names, focusing on their OS / archetypal character traits. \n\nI didn't actually end up putting this into practice, but seemed a possibility at the time.", "group_id": 2515, "id": 1058547}, {"user_id": 10814, "stars": [], "topic_id": 35308, "date_created": 1305469969.0652881, "message": "Yes, that would work.  It is not ideal, but functional.  EVENTUALLY we'll have a way to deal with character hand-offs, but that is a workaround until that time.", "group_id": 2515, "id": 1059962}]