[{"user_id": 10406, "stars": [], "topic_id": 47506, "date_created": 1320465653.5623031, "message": "Como arquitectos del futuro digital de México, que servicios consideran que son necesarios en el país? Nos falta mucho en proyectos consolidados en Mx pero creo que estamos en buen camino. Viendo el problema como usuarios, que proyectos son necesarios? En mi punto de vista hace falta una mejora en el comercio electrónico, el tramite digital de muchos procesos gubernamentales y desarrollo de plataformas para el transporte publico. Ustedes que opinan?", "group_id": 965, "id": 2510006}, {"user_id": 26088, "stars": [{"date_created": 1320475635.5786099, "user_id": 10406}], "topic_id": 47506, "date_created": 1320468277.5742021, "message": "Hace falta que el gobierno se \"APIfise\", ya se estan intentando hacer cambios con eventos como Ciudad Movil aunque falta mucho para que tenga un impacto realmente profundo, ojala se organicen cosas mejores en las que podamos participar pero con un plan bien trazado y con union de más esfuerzos para que se logre algo importante, pienso que la mejor forma de hacer presión es creando ecosistema", "group_id": 965, "id": 2510111}, {"user_id": 2946, "stars": [], "topic_id": 47506, "date_created": 1320473371.7764139, "message": "Una buena plataforma de pagos con tarjeta de crédito podría de una sola vez fomentar a) el comercio electrónico, b) el desarrollo de software as a service y c) una economía digital basada en la venta de bienes virtuales. Creo que es eso lo que más hace falta hoy en día en México.", "group_id": 965, "id": 2510347}, {"user_id": 43022, "stars": [{"date_created": 1320531741.9652851, "user_id": 26088}], "topic_id": 47506, "date_created": 1320493045.0148311, "message": "El gobierno ha estado yendo en buena dirección, automatizando o facilitando muchos trámites tanto gubernamentales como los relacionados con la educación. Estoy de acuerdo en que se necesita \"APIficar\", pero no creo que sea una responsabilidad directa del gobierno sino de las instituciones en general ya que se tiene que empezar mejorando la organización, disminuyendo la burocracia y agilizando los procesos.", "group_id": 965, "id": 2511246}, {"user_id": 26084, "stars": [], "topic_id": 47506, "date_created": 1320613650.8000691, "message": "SaaS, cambiar el paradigma dejado por los TI de vfp y vb6, mostrarle a las personas (por medio de servicios digitales) que es facil, seguro y más conveniente usar esos servicios a hacerlo de la manera tradicional.\n\nEl groso de las personas en México prefieren algo tangible como el papel, a solo ver algo en una pantalla.", "group_id": 965, "id": 2521131}]