[{"user_id": 43806, "stars": [], "topic_id": 48081, "date_created": 1322098817.061162, "message": "Quisiera saber las opiniones de los todos los miembros del foro acerca de las opciones de Data Centers, Hosting y Colocation para Start-Ups en Mexico...Por lo ultimo que se, existe KIO y no mucho mas, y la estrategia de KIO parece estar orientada a grandes o medianas empresas, con justa razon dada la infraestructura y modelo de negocios que tienen.", "group_id": 965, "id": 2627992}, {"user_id": 43806, "stars": [], "topic_id": 48081, "date_created": 1322099182.1452069, "message": "Full Disclosure: Tengo bastante experiencia en Data Centers, de el lado de los fierros, y se de las ultimas tecnologias modulares, tipo \"contenedor' y quiero ver las posibilidades de hacer \"Mini-DCs\" en Mexico para Start-Ups y pequenas empresas; tambien tengo algunas ideas de \"mirroring\" y cloud sevices para respaldar a los \"Mini DCs\" con DCs fuera de Mexico para reducir costos y aumentar el nivel de seguridad...Gracias!", "group_id": 965, "id": 2628021}, {"user_id": 40054, "stars": [], "topic_id": 48081, "date_created": 1322123093.0662169, "message": "Como Mini DC,  una buen modelo de negocio seria usar  maquinas Mac mini Server, en co-locacion como hoy en dia ya lo ofrece esta compania http://www.macminivault.com/  ya que son bastante faciles de configurar y con suficiente poder para el tipo servicios que requieren la  micro y medianas empresas o otras Startups", "group_id": 965, "id": 2629579}, {"user_id": 43806, "stars": [], "topic_id": 48081, "date_created": 1322204553.0034189, "message": "Gracias @bajaloreto  el modelo es interesante, comparando los modelos de Mac Minis ilustrados aqui, cual seria el mas atractivo para Mexico? http://macminicolocomparison.com/", "group_id": 965, "id": 2635807}, {"user_id": 43806, "stars": [], "topic_id": 48081, "date_created": 1322204701.1797371, "message": "Creo que entonces la tirada seria rentar espacio de colocacion en un DC cercano a Mexico y poner los racks de Mac Minis para ofrecerlos a clientes en Mexico...es el modelo mas apropiado para empezar....Opiniones?", "group_id": 965, "id": 2635813}]