[{"user_id": 25885, "stars": [], "topic_id": 32361, "date_created": 1308442381.4019351, "message": "Justin and Gary, Hail from Albuquerque New Mexico. I discovered your iPhone Podcast show in early February and haven't missed an episode since then.  Please keep up your tremendous work. I am a trainer for Windows applications for the military for the past 7 years, and have been involved with sales of windows computer training material to corporations for over 10 years. I recently converted my folks to iMacs two years ago and I plan to do a complete conversion to MacBook Pro and iMac sometime this year myself.  I have been involved with Windows since 3.1... Even though its my livelihood, I am done with the Microsoft empire.  The iPhone has delivered the dream of the Palm PDA.  And Apple has managed to industrialize that dream across all of it's devices with the introduction of Lion and iCloud.  I am there and I am on board... But I digress.  The purpose of this message was to let you all know that I find your podcast the most valuable use of my time compared to all the other technology information I ingest... and I am info junkie.  There is something purposeful, authentic and non-self serving about your show that I have not found anywhere else.  I graduated with a major in communications and have worked in commercial  radio as on-air talent and as a sales rep in a major market city in the USA. So I understand the production challenges of delivering a quality product on a consistent basis...it's amazing what you guys have done and are doing.  I feel it's only a matter of time before someone \"picks you guys up.\"  So I cherish each episode and engulf within moments of each download.  I have been meaning to write this for a long time... finally got a Saturday of interrupted time.  Best wishes from Albuquerque, New Mexico.", "group_id": 7146, "id": 1429102}, {"user_id": 25885, "stars": [], "topic_id": 32361, "date_created": 1308456494.341996, "message": "BTW, I entered all the previous message via the website... the iPhone is phenomenal for reading... but blogging breakthroughs are still in it's future. ;-))", "group_id": 7146, "id": 1430161}]