[{"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298580579.5689361, "message": "Anyone worked on some ActionScript/Flash?  I'm thinking of diving into that area once the data layer changes and Fixer tool are done.  If someone else is moving to specialize, then I could move somewhere else", "group_id": 4266, "id": 201968}, {"user_id": 13135, "stars": [], "topic_id": 6790, "date_created": 1298606892.577271, "message": "I did just a few tests with some open source flash creation program, as I didn't have access to it.. just enough to get a movie imported and to display on screen but not do anything interactive. Feel free to tackle that. There's only one outstanding issue with Flash to be aware of, that you can't set the mouse position. This comes into play when you start mouselooking then come out of it, your cursor will be somewhere other than where you left it. I have heard the workaround might be to set it in Windows via dll bind, but not tested that. It would be cool to have the UI start to catch up to the rules, so good luck!", "group_id": 4266, "id": 205726}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298607505.8569379, "message": "DllBind likes me, maybe I can extend the relationship", "group_id": 4266, "id": 205758}, {"user_id": 13238, "stars": [], "topic_id": 6790, "date_created": 1298659226.6103439, "message": "We are using AS/Flash/Scaleform for our current project so i know the code side, but i'm not really into AS", "group_id": 4266, "id": 210271}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298673299.1582229, "message": "Just something simple like receiving an event when the UnrealScript has acquired a lock-on on a target so I know when the turn on the targetting reticle", "group_id": 4266, "id": 211838}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298673320.6922071, "message": "Or something even more complex like syncing a floating indicator over an enemy", "group_id": 4266, "id": 211841}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298673150.3346231, "message": "I read a UDK doc on getting the screens in the engine and displaying, but I am unclear about what kind of relationship UnrealScript and ActionScript can have", "group_id": 4266, "id": 211830}, {"user_id": 13238, "stars": [], "topic_id": 6790, "date_created": 1298681176.2110031, "message": "actually, you dont really need actionscript, most of the stuff can be achieved by simply sticking to unreal script, of course you can use AS but i think UC is faster. There are different ways of communicating between action and unreal, e.g. registering unreal functions in as or calling as functions from unreal, both have their pitfalls ^^", "group_id": 4266, "id": 212291}, {"user_id": 13238, "stars": [], "topic_id": 6790, "date_created": 1298681619.3051729, "message": "there are way more complex scenarios, e.g. when you need to add several different layers of flash movies to create a complex menu with a lot of submenus, i think the udk has an example with a manager. We are using a similar approach for our main menu but that has a loooot of pitfalls and personally i would really try to avoid this ;)", "group_id": 4266, "id": 212302}, {"user_id": 13238, "stars": [], "topic_id": 6790, "date_created": 1298681454.5802081, "message": "the approach I prefer is, to use the widget initialized method to cache the objects that i need and when i need to change the value, e.g. from player::tick i am simply calling SetText() or GotoAndPlayI()  from UC to update the flash stuff", "group_id": 4266, "id": 212294}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298914418.3506629, "message": "Okay, so minimize UScript as a best practice.  I would characterize myself as very open to that", "group_id": 4266, "id": 227531}, {"user_id": 11689, "stars": [], "topic_id": 6790, "date_created": 1298914438.0952821, "message": "*Minimize AScript, excuse me", "group_id": 4266, "id": 227535}, {"user_id": 44073, "stars": [], "topic_id": 6790, "date_created": 1323027309.010802, "message": "Unreal Script Coder wanted: plz visit: www.tactical-assault.com", "group_id": 4266, "id": 2698823}]