[{"user_id": 11626, "stars": [], "topic_id": 6623, "date_created": 1297898317.4112461, "message": "Schools in Beijing are giving GPS-equipped mobile phones to students, as China seeks to tackle the twin problems of missing children and campus violence, state press said Monday.\r\n\r\nThe Beijing Red Cross Foundation distributed the first batch of 20,000 GPS phones, which can be worn as a watch, to primary and middle school students over the weekend, the Global Times reported.\r\n\r\n\"This programme aims to improve the safety of children in Beijing as campus violence is on the rise,\" the paper cited Liu Quan, an official heading the programme, as saying.\r\n\r\nAt least five major attacks took place at Chinese schools from March to May last year, killing 17 people -- including 15 children -- and injuring more than 80.\r\n\r\nAnd according to the Beijing Red Cross, 200,000 children are reported missing in China annually, while some 600,000 remain missing, the paper said.\r\n\r\nAlthough the phones were offered to the students free of charge, parents have to pay an 800-yuan ($120) service fee over two years, it said.\r\n\r\nMore than 100,000 phones are expected to be distributed in Beijing this year.\r\n\r\nChina has long suffered from abductions of children, with boys frequently wanted to fulfil the traditional need for a male heir.\r\n\r\nThe kidnapping phenomenon is also attributed to the nation's \"one-child\" family planning policy, whereby people who live in urban areas are generally allowed one child, while rural families can have two if the first is a girl.\r\n\r\nDuring a crackdown on human trafficking from April 2009 to September last year, Chinese police located and freed nearly 5,900 abducted children, state media reported at the time.\r\n\r\nIn the crackdown, police broke up nearly 2,400 criminal gangs and detained nearly 16,000 suspects, the reports said.\r\n\r\nhttp://www.gpsdaily.com/reports/China_schools_issue_GPS_phones_to_boost_safety_999.html", "group_id": 3920, "id": 126168}, {"user_id": 11626, "stars": [], "topic_id": 6623, "date_created": 1297898364.1618209, "message": "Haven't we been saying all along that CELL PHONES ARE TRACKING DEVICES? & now they're admitting it openly! Muahahahahahaha...", "group_id": 3920, "id": 126179}]