[{"user_id": 2597, "stars": [], "topic_id": 41419, "date_created": 1310080512.1392391, "message": "and how long and what path did/should you take to get there?", "group_id": 427, "id": 1588671}, {"user_id": 4253, "stars": [], "topic_id": 41419, "date_created": 1310086789.1479859, "message": "I'm doing a podcast on this tonight :) Well, not specifically becoming a Sr iOS dev, but on building expertise. I think the best path you can take to get there is to consistently produce great work by challenging yourself a little bit more every day. This practice is reciprocal and as you do more challenging work, the better your stuff will become. If you produce great stuff (which takes time) people will notice and the position will be made for you.", "group_id": 427, "id": 1589114}, {"user_id": 2597, "stars": [], "topic_id": 41419, "date_created": 1310091370.6760769, "message": "what is the link to the podcast? would be interesting to hear", "group_id": 427, "id": 1589665}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310145903.3830049, "message": "I was originally planning on spending my spare time working on my own projects, and taking the occasional freelance gig if it came up, but I'd totally underestimated the demand and I got loads of freelance work in, some of it for world-famous brands.  My initial projects with the second company were successful, and they managed to get a lot more iOS projects in once they had established themselves as a mobile development specialist.  So my contract was extended again and again, along with bumps in salary.", "group_id": 427, "id": 1594532}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310145630.807811, "message": "I ended up spending about 50% of my time there on iOS projects, and 50% on web projects.  I was working on some big brands, but I was unsatisfied with their processes, which to me felt like they were harming the quality of the work, profitability of the projects, and developer stress levels.  After about 18 months, the recruiters were going crazy, and I took a contract to work three months at another digital agency.  Again, they mainly dealt in websites, but were looking to expand into iOS development.  They were wary about jumping into an entirely new field and paying a high salary, and I wanted some time free to work on my own projects, so I suggested that I work there three days a week, which would pay the bills and leave me lots of spare time.", "group_id": 427, "id": 1594493}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310145271.6123121, "message": "I was a web developer who had been doing freelance work for a nearby digital agency that were being asked about iPhone apps by their clients.  They were looking to get a grant that would cover a full-time iOS developer's salary, and asked me to drop by to talk about it.  I didn't realise it was an interview, and I'd just got off a plane the night before, so I turned up jetlagged and unprepared.  While I was waiting for the MD to be free for the interview, I sat with one of the developers who was struggling with getting an iOS test project off the ground, and fixed a sync/async networking bug that had been troubling him all day in about ten minutes.  That was the first time I touched an iPhone, the first time I used a Mac and the first time I wrote any Objective C, although I was comfortable with C and C++.  So I was coming at this from the ground floor.", "group_id": 427, "id": 1594438}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310146372.522686, "message": "I think one of the things that really helped me get where I was is the fact that I worked on projects for brands everybody had heard of, and knew some great people who move in the right circles.  When I do a good job for these people, they recommend me to others.  When they change jobs, I get on the books with another organisation.", "group_id": 427, "id": 1594619}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310146188.9208009, "message": "That's basically where I am at the minute.  I'm swamped with work both inside and outside my main job, so they have hired two additional iOS developers who will be starting soon, along with a third who works on a freelance basis.  It's been almost three years since I got that first iPhone developer job.", "group_id": 427, "id": 1594592}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310146573.153409, "message": "The other thing is to really push yourself to do things better for every project.  I don't mind admitting that my early projects weren't great internally.  Some of it was innovative stuff, but I am a much more capable developer now because I've tried to out-do myself on every project.  If you are satisfied with the code you are putting out, then you're never going to get any better.  If I hadn't have pushed myself, those three years of experience would be worthless, I'd still be producing poor code and scraping by.", "group_id": 427, "id": 1594639}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310146584.7826359, "message": "(Apologies for the wall of text :) )", "group_id": 427, "id": 1594641}, {"user_id": 2597, "stars": [], "topic_id": 41419, "date_created": 1310154390.5072551, "message": "@Jim very nice post Jim, mind sharing how you got into the point you freelance for well known named brands?", "group_id": 427, "id": 1595577}, {"user_id": 12791, "stars": [], "topic_id": 41419, "date_created": 1310157539.7505701, "message": "Don't want to star all your posts, but thanks for sharing @Jim. I daresay that's inspirational, at least to someone new to the iOS game like myself.", "group_id": 427, "id": 1595871}, {"user_id": 1379, "stars": [], "topic_id": 41419, "date_created": 1310160537.5258269, "message": "Thanks guys.  @equinox, when I got back into freelancing, some of the people I had worked with previously were at big agencies with demand for iOS apps but no ability to produce them.  They recommended me, and I got the lion's share of their iOS projects.  One thing to remember is that the demand for iOS apps is *huge*, but there really aren't that many iOS developers out there still.  Even the largest brands have difficulty finding people to build their apps.  I know other developers in the same situation I am in that have also taken on big projects on their own.  It's still a very young market.", "group_id": 427, "id": 1596208}, {"user_id": 2597, "stars": [], "topic_id": 41419, "date_created": 1310163541.289906, "message": "@Jim I realized you're in the UK, but do you know where I can search for iOS jobs at a company in the US. Thought that you might know some site", "group_id": 427, "id": 1596448}, {"user_id": 1379, "stars": [{"date_created": 1310191706.9438131, "user_id": 12791}], "topic_id": 41419, "date_created": 1310164627.3987041, "message": "@equinox, I'm not really clued up on US hiring, but I've seen some back and forth over Twitter.  I was a bit skeptical of Twitter before I started following fellow devs, but I've realised it's essential to maintain a connection to the wider iOS community.  Cocoanetics has been doing some organising wrt. jobs - http://www.cocoanetics.com/jobs/ - and the idevblogaday guys are worth following.  In general, making connections informally works better no matter hat kind of job you go for.  I've looked on job boards out of curiosity to see what's out there, and don't see much - the demand doesn't seem to be making it to the job boards.  Recruitment firms are horrible to deal with on both ends of the equation, but they seem to place a lot of people.  Remember that they get paid by the employer when they place somebody, so if you contact a few recruiters and tell them what you are looking for, they'll do the legwork for you.  But given two equal candidates, I'd rather hire the direct contact, as it's cheaper and I don't have to deal with a recruiter.", "group_id": 427, "id": 1596519}]