[{"user_id": 10087, "stars": [], "topic_id": 6067, "date_created": 1297781865.8916399, "message": "Minkälaisia tapahtumia toivotaan? Mikä tapahtuma oli hieno, mikä huono ja missä olisi voinut parantaa? Kysymyksiä toimintaan mukaan tulosta tai toiminnasta yleensä?", "group_id": 3409, "id": 111922}, {"user_id": 10141, "stars": [], "topic_id": 6067, "date_created": 1297783313.19842, "message": "Hytkyn 2010 toimintakertomuksesta: \"Bileet ja erilaiset isommat projektit eli julkisesti avoimet jäsentapahtumat ovat Hytkyn ydintoimintaa, eli kunnianhimoisten kulttuurihankkeiden ja -tapahtumien toteuttamista. Tapahtumat ovat pääasiassa Hytkyn jäsenille, mutta niistä tiedotetaan avoimesti, sillä tapahtumat ovat julkisia ja avoimia muillekin kuin yliopisto-opiskelijoille. Menneenä vuonna Hytky kokeili ennakkiluulottomasti uusia konsepeteja, joista ei ollut ennalta kokemusta. Tapahtumien määrä oli myös poikkeuksellisen suuri ja niiden järjestämiseen osallistui paljon uusia ja innokkaita jäseniä.\"", "group_id": 3409, "id": 112166}, {"user_id": 10186, "stars": [], "topic_id": 6067, "date_created": 1297795958.1434031, "message": "Lisää teknoa!", "group_id": 3409, "id": 113650}, {"user_id": 10543, "stars": [], "topic_id": 6067, "date_created": 1297879320.0546851, "message": "@bruchteil Kannatan!", "group_id": 3409, "id": 121948}, {"user_id": 10186, "stars": [], "topic_id": 6067, "date_created": 1303906102.493566, "message": "Miten Hytkyn toimintaan pääsee mukaan? Onko toiminta kaikille avointa, vaikka ei olisikaan opiskelija yliopistolla? Miten saan tietoa bileistä? Vanhemmat aktiivit vastaavat. Toivottavasti :D", "group_id": 3409, "id": 824837}, {"user_id": 10141, "stars": [], "topic_id": 6067, "date_created": 1303966001.929229, "message": "heh", "group_id": 3409, "id": 836555}, {"user_id": 15946, "stars": [], "topic_id": 6067, "date_created": 1304881355.1363361, "message": "nyt ollut varsin hyvä tilaisuus tutustua ihmisiin kupolissa ja muualla", "group_id": 3409, "id": 959447}, {"user_id": 15946, "stars": [], "topic_id": 6067, "date_created": 1304881326.2960269, "message": "toiminta on varsin avointa ja historiallisesti epäopiskelijoita on riveissä ollut, mukaan vaan kokouksien tai muiden rymytilanteiden kautta", "group_id": 3409, "id": 959445}]