[{"user_id": 21928, "stars": [], "topic_id": 41972, "date_created": 1310663502.6884489, "message": "No segundo dia, com o tema “Grow”, teremos uma série de workshops focada em todos os aspectos necessário a crescer um projecto/empresa. Isto inclui workshops em angariação de capital, liderança e construção de uma organização escalável.", "group_id": 11022, "id": 1638618}, {"user_id": 21928, "stars": [], "topic_id": 41972, "date_created": 1310663490.200182, "message": "No primeiro dia, com o tema “Create”, o foco será dado à criação de inovação. Neste dia uma serie de Workshops com foco em Open Innovation, geração de ideias e teste da viabilidade das mesmas.", "group_id": 11022, "id": 1638615}, {"user_id": 21928, "stars": [], "topic_id": 41972, "date_created": 1310663513.461947, "message": "No terceiro e ultimo dia, com o tema “Inspire”, teremos uma série de lideres Europeus e Americanos a comunicarem ao lideres de amanhã todas as lições que aprenderam no seu caminho.", "group_id": 11022, "id": 1638621}, {"user_id": 21928, "stars": [], "topic_id": 41972, "date_created": 1310663526.0227449, "message": "No ultimo dia e para encerrar a conferencia, teremos também a atribuição do prémio da Competição Global do Startup Weekend. O Startup Weekend é uma organização Americana com visibilidade mundial e que nos escolheu para sermos o primeiro país a ser o anfitrião o seu primeiro prémio global.", "group_id": 11022, "id": 1638626}, {"user_id": 21925, "stars": [], "topic_id": 41972, "date_created": 1311286179.6237741, "message": "Ol+a", "group_id": 11022, "id": 1693010}, {"user_id": 21925, "stars": [], "topic_id": 41972, "date_created": 1311332373.7724431, "message": "É com muita pena minha que tenho que anunciar que o Bill Liao já não vai poder vir à conferencia (filha muito doente pelos vistos)", "group_id": 11022, "id": 1697254}, {"user_id": 21925, "stars": [], "topic_id": 41972, "date_created": 1311332375.3904581, "message": ":(", "group_id": 11022, "id": 1697255}]