[{"user_id": 37168, "stars": [], "topic_id": 42266, "date_created": 1311053032.3984361, "message": "Just curious: when building OS characters (their purposes, motivations, methodologies, and means of evaluations), is there a rule of thumb when it comes to how many elements a main character should occupy of the 16 possibilities for each characteristic? What about the impact character? And is there a minimum or maximum as to the number of additional characters in the OS throughline that should be included/considered when assigning these characteristics?", "group_id": 2515, "id": 1669229}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311053935.081311, "message": "Have you read the section in the theory book on Rear Window?", "group_id": 2515, "id": 1669293}, {"user_id": 37168, "stars": [], "topic_id": 42266, "date_created": 1311114717.136045, "message": "I have. Maybe I should reread it a few more times.", "group_id": 2515, "id": 1676180}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311140230.0873849, "message": "No, no rules.  However, understand that as MC he gets entire set of sixty-four elements.  Those are exclusive to his throughline.  Limit his player's elements in the OS to be appropriate for his role.", "group_id": 2515, "id": 1678876}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311143291.7759969, "message": "I would love to see those 64 mapped out in some story,  @Chris_Huntley", "group_id": 2515, "id": 1679073}, {"user_id": 37168, "stars": [], "topic_id": 42266, "date_created": 1311170034.344547, "message": "@Chris_Huntley: The MC \"gets entire set of sixty-four elements,\" meaning that when I'm plotting out the MC throughline, I should make sure that the MC moves through each of those elements as dramatica has structurally assigned them? But this doesn't necessarily hold up for the other three throughlines? That is, the IC, for example, shouldn't be given the same thematic breadth? ", "group_id": 2515, "id": 1680860}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311187300.6933091, "message": "I think he's saying that an element assigned to someone in the OS will also be assigned to the MC in their own throughline. Just because it's in one, doesn't exclude it from the other.", "group_id": 2515, "id": 1683414}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311187313.993485, "message": "Goes for the IC and the SS, too.", "group_id": 2515, "id": 1683416}, {"user_id": 30287, "stars": [], "topic_id": 42266, "date_created": 1311210440.065418, "message": "I consider myself reasonably familiar with Dramatica now... and yet I have no idea what you guys are talking about.  :)\n\nAn element assigned to someone in the OS is also assigned to the MC in his own throughline?  Wha?  (Scratches head like a mountain gorilla trying to do long division.)", "group_id": 2515, "id": 1686240}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311213622.1330831, "message": "@MikeDerk  Not quite what I meant.  The assignments of the elements in the OS are independent of those in the other throughlines (as far as OS characters are concerned).\n\n@travelingleonards  All four throughlines have the same 64 elements, though their arrangements differ.  Other than the OS, the software does not let you do more than see the 64 elements in a domain in the Theme Browser.  The only elements you can play with in the MC, IC, and MC/IC throughlines are the Problem/Solution/Symptom/Response elements.", "group_id": 2515, "id": 1686551}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311224602.7019041, "message": "I hope that's clearer, and easier to fix,  @Chris_Huntley , if I'm still wrong.", "group_id": 2515, "id": 1687297}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311224318.4868181, "message": "@Chris_Huntley I guess I'm looking past the obvious, but where does the software allow us to see the 64 elements in the OS?", "group_id": 2515, "id": 1687281}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311224549.464438, "message": "@ScreenwritingScreenwriter I'm going to state my understanding again in a different way.\n\nDramatica is all about looking at things from every possible angle. That means looking at the inequity from the They, Me, We and Us perspectives. \n\nIn the OS -- They --  we look at things from the perspective of each element. (These elements, maybe, are assigned to the characters in the Build Character window, and how they act is how we see these elements in action.)\n\nWe have to do the same thing in the other three throughlines. But, since the MC is alone in their throughline, they get all 64 elements. etc.", "group_id": 2515, "id": 1687294}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311260436.075783, "message": "My guess is the way it works in the other throughlines (at least the MC and IC) is a temporal exploration.  For example, in First Blood (Rambo I), the MC explores Inaction in signpost 1, Protection in signpost 2, Reaction in signpost 3, and Proaction in signpost 4.\n\nThat said, I know there is both temporal AND spatial explorations everywhere in the model.  We do not show it in the software because it is too much data to use as a writer.  Besides, the audience will except a surprising amount of temporal inaccuracy (seeing it as storyweaving) before finding it too problematic.", "group_id": 2515, "id": 1690057}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311260805.9495809, "message": "I wish that made any sense to me. Serious question. Does anyone besides you and Melanie understand what \"temporal exploration\" means?", "group_id": 2515, "id": 1690100}, {"user_id": 7645, "stars": [], "topic_id": 42266, "date_created": 1311272487.5100319, "message": "The order of signposts is a temporal exploration though I assume at that level the audience needs it to be accurate. I think chris is saying at the element level the exact order in which all the pieces are flipped or rotated doesn't matter as much.", "group_id": 2515, "id": 1691384}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311309964.840975, "message": "I feel like \"time\" and \"space\" occupy a deep part of the theory that are beyond the scope of the theory book, but I'd love to know more. (Despite the answer to this question being so straightforward.)\n\nI'm sorry for making such a snarky comment before, because even though I only need the practical application of the theory, I really want to understand it thoroughly.", "group_id": 2515, "id": 1695339}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311352278.8999839, "message": "Sorry about being so theoretical.  By temporal exploration, I mean exploring the four items in a quad one at a time in a progression.  In my example for Rambo in 'First Blood,\" the story shows him first using a methodology of Inaction, then Protection, then Reaction, then Proaction.  This is different than most interactions in the Overall Story throughline elements, as organized in the Build Characters window, because those character elements are explored by comparing the characteristics as they are laid out in a quad.  That is what the three types of pairs show:  dynamic (diagonal), companion (horizontal), and dependent (vertical).  The Build Characters window lays out the elements 'spatially' by showing them as they are placed in the quad.\n\nI hope this makes a little more sense.", "group_id": 2515, "id": 1699665}, {"user_id": 7664, "stars": [], "topic_id": 42266, "date_created": 1311613343.67307, "message": "@Chris_Huntley, If I had my druthers, I'd actually like to hear you get *more* theoretical, not less. (Although the above post was helpful.)\n\nTo me, knowing that something can be explored temporally or spacially is just scratching the surface. The program gives us the practical way to do that -- laying out the signposts, etc. -- but I'd love to know how you think it affects meaning.\n\nI've done enough storyweaving and editing to know that a slap followed by a scream is not the same as a scream followed by a slap. But, to know how Fate followed by Destiny is different from Destiny followed by Fate... that's beyond me right now.", "group_id": 2515, "id": 1716601}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311622322.152184, "message": "That is a spatial example.  A temporal example might be to explore the MC's fate, and then explore the MC's destiny.", "group_id": 2515, "id": 1717957}, {"user_id": 10814, "stars": [], "topic_id": 42266, "date_created": 1311622265.4689109, "message": "Actually, it is not spatial OR temporal, but spatial AND temporal that gives you the complete sense of what goes on.  Naturally, taking a small part (Fate & Destiny in only one of the throughlines) and trying to extrapolate how it fits into everything and what it means is difficult to gauge.  With theme, you spin it however you want.\n\nFor example, in the MC throughline, you might say, \"Fate put me in the right place at the right time, but ultimately it may be my destiny to be lost in the detritus of the past.\"", "group_id": 2515, "id": 1717947}, {"user_id": 13109, "stars": [], "topic_id": 42266, "date_created": 1311901124.462198, "message": "I gotta make sure that I read these threads when I am not tired.      \"Naturally, taking a small part (Fate & Destiny...\" Turned into  Naturally, taking a small fart (Pate & Destiny...\" I gotta go to sleep.", "group_id": 2515, "id": 1743590}, {"user_id": 38500, "stars": [], "topic_id": 42266, "date_created": 1312056279.7606051, "message": "perhaps you meant that pâté makes you fart a little?", "group_id": 2515, "id": 1755722}]