[{"user_id": 26010, "stars": [], "topic_id": 42381, "date_created": 1311202678.9332111, "message": "Please review our website at http://www.igobubble.com  Is the website and video effective? igobubble lets you use your phone to leave photos, videos and messages inside living bubbles wherever you go. After you leave, your bubbles stay behind. Bubbles with an Attitude! The grow with interaction and shrink with negligence. Popular bubbles grow, divide, multiply and spread. Unpopular bubbles shrink, wither and pop. Feedback highly appreciated. Applying for TC Disrupt in Sept. Available for free on iPhone App Store.", "group_id": 250, "id": 1685517}, {"user_id": 13735, "stars": [], "topic_id": 42381, "date_created": 1311204006.9285409, "message": "@osama19 Sounds awesome I'll check it out a little later.", "group_id": 250, "id": 1685594}, {"user_id": 26010, "stars": [], "topic_id": 42381, "date_created": 1311214046.7350049, "message": "@Ade_Lack Thanx for taking out the time :)", "group_id": 250, "id": 1686593}, {"user_id": 33127, "stars": [{"date_created": 1311239807.2338531, "user_id": 13735}], "topic_id": 42381, "date_created": 1311233725.06305, "message": "Kudos to whomever is the igobubble team, you've layers lots of ideas into a single app.\nNow, for the critical feedback.\nIt may be too much. You a long way to go on a comfortable image/bubble remix UI.  Your use cases (long term usage patterns) are unclear, or just unconvincing. I guess you'l be scaling your zone sizes 'silently' to match usage - but the unclarity leaves something for predicting what happens.  and, obviously... what do you sell here?", "group_id": 250, "id": 1687741}, {"user_id": 13735, "stars": [], "topic_id": 42381, "date_created": 1311239771.2815681, "message": "To answer your feedback question... the site did enough to get my interest but I thought the video was ace! The video's only problem is it has a whole load of use cases to try to explain as @newalexandria suggested, thats down to the product rather than the video though. How long have you guys been working on this? Who is on the team?", "group_id": 250, "id": 1687947}, {"user_id": 32259, "stars": [], "topic_id": 42381, "date_created": 1311273082.0318611, "message": "Interesting concept, def sounds like something that might get a lot of people interested. I downloaded the app, problem is there are no bubbles yet but i'll be sure to check back. How close do you have to be to see a bubble in a given location? couple miles?", "group_id": 250, "id": 1691445}, {"user_id": 26010, "stars": [], "topic_id": 42381, "date_created": 1311303075.449007, "message": "First off, thanx a bunch for taking out the time to review igobubble. @newalexandria you make some very valid points and we're looking into them. Ideally, we'd like to see how our users will end up using igobubble and build on that. But we agree with you in that focus is key and your feedback was taken to heart. @Ade_Lack we've been working on this in a focused manner for the last 6 months. We have a great team. Jade Burton, our co-founder from Australia is a Senior developer and Kieran Galvin, our Irish co-founder has years of experience in business development, fund-raising, and management. We are currently in full-time search for a UX/GUI designer with experience in mobile space for a complete re-skin of the app., as you know, they're in high demand and not very easy to come by. @avillabon, for now you can see bubbles up to 800 feet around you, which State/City are you in?", "group_id": 250, "id": 1694529}]