[{"user_id": 13453, "stars": [], "topic_id": 9686, "date_created": 1298981022.1678181, "message": "Pendiente elaboración de ficha", "group_id": 2696, "id": 233985}, {"user_id": 8142, "stars": [], "topic_id": 9686, "date_created": 1298984449.509609, "message": "Buenos dias! Cuenten conmigo para lo que necesiten, estoy iniciando mi empresa de desarrollo de videojuegos para dispositivos moviles, ya debo tener demo en un par de meses. Ademas inicie el Unity3D User Group Colombia, http://u3dug.co/ para crear comunidad de gamedevs alrededor de esta herramienta y enseñar a gamers y desarrolladores.", "group_id": 2696, "id": 234207}, {"user_id": 16581, "stars": [], "topic_id": 9686, "date_created": 1298988902.961653, "message": "Buenos días a todos. Bueno, veo que el tema gusta y se empieza a mover. @rosacris quedo pendiente de la ficha. Igual te buscaré por MSN para charlar unas cosas. Un agrazo a todos y muchas gracias por la postulación.", "group_id": 2696, "id": 234812}, {"user_id": 16500, "stars": [], "topic_id": 9686, "date_created": 1298988424.69348, "message": "Desde @Labcom_PUJ vamos a desarrollar una seríe de proyectos este año especialmente para la comunidad Gamer de Colombía, sería muy chevere poder articularlos con lo que haga este escuadrón!", "group_id": 2696, "id": 234772}, {"user_id": 16654, "stars": [], "topic_id": 9686, "date_created": 1298991272.0691581, "message": "Uds. saben que estoy muy pendiente de este tema :)", "group_id": 2696, "id": 235233}, {"user_id": 16723, "stars": [], "topic_id": 9686, "date_created": 1299002731.1934021, "message": "Hola!!! Igualmente, cuenten conmigo en este escuadrón y por supuesto con @Cuazart ... Desarrollamos videdeojuegos enfocados a la web... con muchas ganas de aprender y aportar al mejoramiento de nuestras condiciones en Colombia. Un abrazo!!!", "group_id": 2696, "id": 236493}, {"user_id": 13453, "stars": [], "topic_id": 9686, "date_created": 1299865451.994267, "message": "De interés a propósito del terremoto en Japón http://www.stopdisastersgame.org/es/home.html", "group_id": 2696, "id": 325086}, {"user_id": 16581, "stars": [], "topic_id": 9686, "date_created": 1299942594.1567459, "message": "Interesante juego Rosa. En Estados Unidos, cuando ocurrió la tragedia de Katrina, también salieron algunos videojuegos sociales, que enseñaban a las personas cómo enfrentar este tipo de emergencias. Incluso la medicina tambiñen ha incursionado en estas áreas, vi un videojuego que enseña a los enfermos de cáncer a hacer más llevadera su situación. Los juegos de video van mucho más allá de los tiros, patadas y grandes velocidades en automóviles.", "group_id": 2696, "id": 332536}, {"user_id": 16581, "stars": [], "topic_id": 9686, "date_created": 1300155356.540427, "message": "Kinect \"podría cambiar la medicina\" http://www.1up.com/news/kinect-medical-research Una muestra más del avance que los videojuegos pueden dar a la sociedad.", "group_id": 2696, "id": 352886}, {"user_id": 16723, "stars": [], "topic_id": 9686, "date_created": 1301152590.9110341, "message": "Y este es el Top 10 de los juegos para iPad: Top iPad Game Apps: Sword & Sworcery, Angry Birds Rio Lead Paid Charts -> http://bit.ly/dUSqqs", "group_id": 2696, "id": 446272}, {"user_id": 16581, "stars": [], "topic_id": 9686, "date_created": 1301369995.3004169, "message": "Bueno, una reunión muy fructífera. Empezamos a darle orden las cosas con la gente. Ya saben, todos los que quieran hacer parte de esta brigada, son bienvenidos. También si conocen gente que pueda interesarle coméntele.", "group_id": 2696, "id": 465219}, {"user_id": 16581, "stars": [], "topic_id": 9686, "date_created": 1301372698.5456409, "message": "Pronto estaremos comunicándoles una @ exclusiva que será portavoz de todos nuestros avances, al igual que con ella comunicaremos contenidos de interés social, para todos. Así es que por favor esté pendientes.", "group_id": 2696, "id": 465654}]