[{"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308343621.3277171, "message": "That's an interesting idea...But if these two characters' stories are highly involved with each other, will it still work? Or does the two stories idea you're talking about imply that that the characters have significantly different stories? Because these two are working together closely throughout the novel, and may even be each other's impact characters...", "group_id": 2515, "id": 1422426}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308342601.5083711, "message": "I have a somewhat developed novel that I really want to refine with Dramatica, but the only way I can make it work is to have to main characters. The narration would alternate from each of their point of views fluidly from scene to scene after a while. They are both important to the story and the story is from both of their point of views. But I haven't been able to figure out how to make this work in the Dramatica program. Is there some way for me to have two main characters?", "group_id": 2515, "id": 1422306}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343843.0398719, "message": "To answer your last, Dramatica sees stories in a completely different way than the commonly accepted definition. It would still \"feel\" like one piece as with Lord of the Rings, but there can be different stories going on within.", "group_id": 2515, "id": 1422455}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343135.1738541, "message": "Sure, just make two stories. It will get amazingly complicated as you go along, but it is perfectly do-able.", "group_id": 2515, "id": 1422356}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343408.4251671, "message": "You'll have eight throughlines to contend with, but if you are able to do it you'll have a very full very involving piece.", "group_id": 2515, "id": 1422385}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343682.500567, "message": "If you know what the Overall Story is (OS) and you want to keep it the same between both stories, make sure you make those selections FIRST before you start choosing your MC. This includes making sure the Plot Progression is the same for the OS in both. I've never tried doing this before (cuz i think 4 is hard enough!) but it would be an interesting experiment.", "group_id": 2515, "id": 1422434}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308343984.7007689, "message": "Yea, I think I understand that perspective. That's one of the things I like about the program. I just wasn't sure about whether they were too involved to have two separate mini stories even. But I think it could work.", "group_id": 2515, "id": 1422469}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308344021.8545511, "message": "And I thought about that and wasn't sure, but I feel like too many slightly separate events will occur for each of them that would make it difficult to only give one of them a personal story.", "group_id": 2515, "id": 1422474}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343381.516911, "message": "Jerry Maguire does this - one story has Jerry as the MC with Rod (Cuba) as the Impact Character, the other has Dorothy (Zellweger) as the MC with Jerry the Impact Character. Both stories have Steadfast MCs and Change ICs. It's interesting that Jerry is Steadfast in one, yet Change in the other.", "group_id": 2515, "id": 1422381}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308343734.4977729, "message": "Hmm. Well I'll try this and see how it goes. It does sound interesting and it could work. Thanks for the idea!", "group_id": 2515, "id": 1422435}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308343903.8742681, "message": "Another way to do it would be to make one of them your \"Main\" Main Character and the other the Impact Character. I don't know of any examples, but I think the idea would be that, when you tell from the perspective of the IC try and make it as dispassionate as you can. Leave the gooey personal stuff to the real MC.", "group_id": 2515, "id": 1422462}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308345075.32285, "message": "This sounds a lot like what my situation is, and how my story would turn out. Would it matter if both characters have an emotional storyline? These are similar to each other so that basically the characters' emotional stories build off of one another.", "group_id": 2515, "id": 1422579}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308346343.9249749, "message": "I think something like LA Confidential would be either a movie (or book) you may want to take a look at.  Bud White and Ed Exley are certainly two characters that influence one another (I can't recall quite how Bud White is influenced by Exley, though), but either way, they have their own separate stories going on that intersect and forces them to work together to solve the larger crime.", "group_id": 2515, "id": 1422669}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308344807.6474371, "message": "I read a book that, at first, was convinced was two main characters. However, each pov of that character was contained within one chapter, and one pov was definitely the 'heart' of the story (these two characters also embodied the Protagonist / Antagonist). \n\nTherefore, after some thought I decided the other pov character was the Impact Character rather than 2nd MC, because it was clear the OS story was the same, and each characters successes drove the other to be braver or meaner, etc. \n\nThe only aspect I wasn't quite sure about what the fact that both characters appeared to influence each other, as far as I can remember, an equal amount. With that in mind, there would be an argument for the 2 main characters / 2 stories idea, but it didn't feel that way to me.\n\nThere was a love interest that I initially assumed was the IC. But in fact had little effect on the MC's growth, or problem solving.", "group_id": 2515, "id": 1422550}, {"user_id": 36439, "stars": [], "topic_id": 39673, "date_created": 1308347955.344949, "message": "Thanks so much for these examples and opinions guys, they've given me more to think about.", "group_id": 2515, "id": 1422841}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308346074.983542, "message": "Both characters in the story above definitely had a strong emotional aspect to their storylines. Both personal emotions in dealing with a difficult situation, and a love interest. \n\nHowever, my Dramatica conclusions about the story may not be correct. I'm not an expert.", "group_id": 2515, "id": 1422646}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308346574.1535959, "message": "That's a great example. The main story has Ed as the MC and Bud as the IC, but then there are other substories - one with Bud/Lynn and the other with Jack as MC. The substories aren't as complete as the first, but they are in there.", "group_id": 2515, "id": 1422700}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308347364.9085701, "message": "LA popped in my head because it's an easy one to identify where there's multiple stories going on that weave together.  I think while learning this (Dramatica), the one aspect that tends to be the most confusing is not realizing there are multiple stories going on and that an IC on one story thread can be a MC in another - causing a lot of people starting out to be confused as we're sort of used to looking for one MC in one overall story, becoming more confusing when trying to find the inciting incident without realizing this.  That's what lead to my post on Ordinary People, because I was looking at it with there being only one MC in mind.", "group_id": 2515, "id": 1422779}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308349797.6624639, "message": "When I watch the 6th Sense, I don't feel dispassionate about Cole, although he is the IC.", "group_id": 2515, "id": 1423042}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308352780.705184, "message": "We see his terrible relationship with his mom (more of an emotional burden for her) and how he gets bullied.\n\nGranted, these are not internal issues, but I think \"dispassionate\" can be applied too thick and become clinical. That's really what I'm warning against.", "group_id": 2515, "id": 1423540}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308351485.1621921, "message": "But what personal issues, outside of his role as haunted boy in the OS, are we privy to?", "group_id": 2515, "id": 1423303}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308355242.8435991, "message": "Wait... Is everything @jbarker and I are mentioning part of the OS?", "group_id": 2515, "id": 1423764}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308354003.3800509, "message": "We get a whole grocery list of Cole's problems the first scene after Malcolm is shot and he's about to meet him.  Acute anxiety... socially isolated... possible mood disorder... along with what Mike said.  I think it's somewhat hindered because in its set-up because we know Malcolm has a need and, at first glance, Cole looks to be the opportunity because of his issues.  The problem is (at least in my opinion), is we know ahead of time that it's a ghost story because it's marketed as such, which makes that whole set up one long red herring of sorts.  When Cole finally reveals \"I see dead people\", I'm like, it's about time.", "group_id": 2515, "id": 1423681}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308354231.5726171, "message": "Anyway, just my opinion because when I watched this opening day and saw that grocery list... within a few minutes I knew Malcolm was a ghost.", "group_id": 2515, "id": 1423701}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308356196.995744, "message": "@MikeDerk I would think so, the OS is finding out what's the matter with Cole, is it not?  That's why I felt it was somewhat of a letdown in that sense since we knew going in he sees ghosts via the marketing of the film.  I have love/luke-warm feelings for the movie itself, all sorts of little problems I see with it here and there, though I think ultimately it's satisfying/entertaining.", "group_id": 2515, "id": 1423824}, {"user_id": 7712, "stars": [], "topic_id": 39673, "date_created": 1308355648.1957109, "message": "Just an FYI:\n\nhttp://www.dramatica.com/theory/tip_of_month/tips/tip0701.html\n\nMultiple Main Characters & Writer's Voice\n\nQuestion: We are preparing to use Dramatica to help us write a book. My question to you is: what if there is more than one main character? Is there a way to use the software to include multiple characters in the same role?\n\nAnswer: The Dramatica software only allows you to develop a story with one main character per document. Some complex novels and films have more than one story going on at the same time. To accommodate this, I suggest creating a document for each of the stories. Develop each independently while keeping in mind how they will eventually be woven together.\n\nOne thing to keep in mind is that Main Character throughline in a story is different than the \"writer's voice,\" the choice an author makes in determining how she will relate the story to the audience. In other words, you can choose to describe any event from any throughline from any character in that throughline's perspective in the first (I), second (you/we), or third (he/she/they/it) person's voice.\n\nThe reason I mention this is because several novelists use the technique of adopting the first person for many characters in their story (Stephen King comes to mind), even though most of them are merely characters in the Overall Story throughline. Sure, we get into their head a bit more and they may even be the main character of their own little substory, but the fact that the author has chosen to describe a bit of the story from their first person's perspective does not make them the main character of the story.", "group_id": 2515, "id": 1423778}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308363368.9337201, "message": "What I'm thinking about is this -- if it's in the OS, then it's not his personal story. Which gets to Jim's point.\n\nI haven't seen the movie for a while, so I don't want to make too strong a statement either way, though.", "group_id": 2515, "id": 1424407}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308363594.0213349, "message": "@Buck Thanks for digging that out. Interesting.", "group_id": 2515, "id": 1424417}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308381677.7750161, "message": "@MikeDerk  I had the same thought as soon as I read the posts..... 'isn't that OS?'.\n\nAlso been a while since I saw film, but we know what Cole is saying is true (we see dead people through his eyes). Does that count as internal issues? Or is seeing what he physically sees still OS?\n\nFrom an authors perspective, or audience member who knows the complete story, we also know that he knows Malcolm is dead, and knows Malcolm doesn't know. He obviously feels compassionately towards Malcolm because he doesn't blurt out 'you're dead you know!'.\n\nI would say that is as internal as we get with Cole's issues.", "group_id": 2515, "id": 1425418}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308396759.4418731, "message": "In the second story, Cole is the MC who's struggling with the perception of being being seen as a freak.  Here, Malcolm is more of the Guardian since Cole is steadfast in his beliefs.  I'm not sure if the mother would qualify as the IC, but she, in the end, ultimately adopts Cole's view of the world.", "group_id": 2515, "id": 1426000}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308396998.2124519, "message": "This would allow for/explain why we get both subjective viewpoints from both characters (Malcolm and Cole), because we do see ghosts through Cole's eyes.  As with some other examples lately, the two stories are so closely intertwined/woven together, that it's not apparent.  But really, any time we're dealing with Cole when Malcolm's not present, we're essentially thrust into his shoes, into the \"ghost world\" and less clinical approach Malcolm takes.  Thoughts?", "group_id": 2515, "id": 1426036}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308396511.461602, "message": "Should 6th Sense perhaps be considered as having two stories?  I've always felt there are two distinct endings which give it more emotional resonance.  The first story, Malcolm is the MC and Cole the IC.  Malcolm is obviously trying to overcome his perception of having failed and seeks redemption through Cole.", "group_id": 2515, "id": 1425966}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308397230.390538, "message": "And I haven't thought it all the way through (since I'm still learning), so I don't know if one story is more complete than the other (i.e., defining antagonists, etc.).  But It's interesting that both characters are dealing with negative perceptions of themselves that ultimately affect their relationships with other people (wife/mother), with trust being a main issue.", "group_id": 2515, "id": 1426072}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308403544.52371, "message": "Working out in the morning helps clear the head.  Additional thoughts:  In Cole's story where he is the MC, the ghosts themselves would be the antagonists.  In Malcolm's story, Cole is actually the antagonist/IC.  He is diametrically opposed to Malcolm's goal of making a diagnoses/redemption.  Why?  Because in doing so, it would validate Cole has a problem, rather than a special gift.  It's a cultural bias to have some sort of mental issue, hence it's labeled \"mental illness\", and the other children are used objectively in the story to demonstrate it.", "group_id": 2515, "id": 1426459}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308411426.2660351, "message": "If Cole is the MC in a substory what is his personal point-of-view, how is that problematic, and who comes along to challenge that approach to solving problems?", "group_id": 2515, "id": 1427170}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308411535.7406521, "message": "We are however just as blind as Malcom. That's because it was the Author's Intent for us to be him.", "group_id": 2515, "id": 1427175}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308411456.0842681, "message": "Also, don't confuse the amount of screen time spent with someone as proof of a Main Character throughline. The Main Character represents the audience's eyes into a story. We the audience know everything the Main Character knows because we are him (or her). It's the \"I\" perspective. Without spoiling the film for those who haven't seen it yet, there are things Cole knows that we explicitly do not know until the end of the story. We never fully assume his position.", "group_id": 2515, "id": 1427173}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308416263.640779, "message": "Back to the Cole as MC and who comes along - that's why I think Malcolm would be better served as a Guardian, because he ultimately helps Cole find a purpose, think it through as to what the ghosts might be wanting.  It's that whole process with Malcolm that takes place that helps Cole take a different approach with the little girl when she shows up.  This, to me, would signify that Cole is ready to try... We can't yet say he's found \"success\", it's not until the end that Malcolm realizes he's one of those very ghosts and what his real reason for tracking Cole down was for.", "group_id": 2515, "id": 1427437}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308415102.4237421, "message": "I would say Cole's personal point-of-view is he believes in ghosts.  It's problematic because he doesn't know how to communicate his belief to his mother, therefore he hides what's happening, lies about it, etc.  Who comes along to challenge that approach (communicate) to solving problem is actually Malcolm.  This is where I think the logic of the movie falls apart, however.", "group_id": 2515, "id": 1427353}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308415234.9833131, "message": "He also doesn't communicate it for fear of worsening their relationship - he ultimately does not want to be seen as a freak.  Telling someone you've seen ghosts when THEY are not ready to accept the possibility, is only going to further lead them to believe there's something wrong with you.", "group_id": 2515, "id": 1427360}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308415550.2931359, "message": "Logically, we have say Cole is afraid of ghosts.  He doesn't know their purpose, what they're doing there, etc.  However, since it's established he sees dead people who don't know they're dead, then I think it's plausible to discern he knows Malcolm is a ghost the entire time.  He's hesitant of him, not trustful, etc. - but I'm thinking here in terms of not overlooking the means to get to the endpoint, not just the endpoint itself.  Through his interactions, Cole finally learns to \"communicate\" via trust.", "group_id": 2515, "id": 1427380}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308417487.1352129, "message": "Going back to this point... the fact that we see ghosts (not to mention Malcolm) through Cole's eyes, and Cole's eyes only is kind of counter to that... tells me that we HAVE to being seeing part of the story unfold subjectively through Cole's eyes because nobody else acknowledges Malcolm's existence (this looking at the story from its entirety).  I don't think it could be simply part of the objective view of the story because nobody else sees them - that make sense?  Meaning, to use the approach in the book, if I were the general overlooking the battle taking place on the field objectively, I would not see any ghosts.  I would simply side with Malcolm and hope for a diagnosis.  Cole is the only one to see the ghosts, so that's why I feel there's a separate storyline where he is the MC as well (we're seeing part of the movie through his unique pov).", "group_id": 2515, "id": 1427513}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308415876.85342, "message": "Do we ever see through Cole's eyes, knowing what he knows with regard to Malcolm?  No - that's a good point, but at the same time - the fact that we see ghosts (not to mention Malcolm) through Cole's eyes, and Cole's eyes only is kind of counter to that point.   I don't think we can actually analyze the movie as it's unfolding, especially ones such as these with twists and turns, because there's the apparent story and then what's really going on.  The only way, I would think, we can analyze it is in its entirety.", "group_id": 2515, "id": 1427412}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308416811.034657, "message": "And I understand the whole bit with screen time and what not - what sort of drove me to look at it in this light was the response from Chris I with regard to who's the MC in Ordinary People.  Realizing there's two different stories taking place, tightly intertwined with one another, came to mind when The Sixth Sense came up in this thread.", "group_id": 2515, "id": 1427464}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308417761.8633599, "message": "I see where you're coming from. However, thinking more about this, for me Cole can't be (an) MC. As Jim pointed out, when we see through his eyes, it just confirms what he is saying (so we as audience know it's true). But there's no sense of following his struggle. We follow that from Malcolm's perspective.\n\nI think Cole knows Malcolm is a ghost from the start, but we would have to know this too if he was main character, otherwise we aren't close enough to his internal struggle.\n\nAlso, I would say the MC / IC is too inter-connected to be separate storylines. But they do influence each. Much of what Cole does is because of Malcolm's encouragement. However, this encouragement and Cole's success is also what completes Malcolm's story. So. to me that is the same storyline.", "group_id": 2515, "id": 1427535}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308419564.15975, "message": "Here's how I'm looking at it from the endpoint, so maybe someone can help clarify:  I see at least three different story throughline endpoints.  a) one endpoint is when Malcolm and Cole are together at the end of Cole's play.  b) We have an endpoint when Cole finally communicates to his mother and she changes the way she sees things c) we have the final endpoint when Malcolm realizes he's a ghost.  I don't see these piggybacking onto one another - much like in Ordinary People we have two distinct endpoints with Conrad's (positive) ending along with Calvin's (negative) ending.  Both story lines have Beth (the mother) playing different roles and there's scenes where all three characters interact at the same time, their stories overlapping/colliding.", "group_id": 2515, "id": 1427636}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308420872.3351309, "message": "And when I mean piggyback, b) Cole's mother changing isn't the goal of the a) story line.  It's dependent of its fulfillment - just like Calvin's endpoint is dependent of Conrad's story endpoint happening first.  That's why I see her as an IC - her reactions to Cole's behavior influences his behavior in return, trying to appear \"normal\" when he's not.  She's obviously not the antagonist - the ghost's presence serves to cause Cole to think he's a freak when nobody else sees them/believes him.  It's very closely related to Malcolm's MC story because it's the root of it - just as in Ordinary People Conrad's story is the root of Calvin's problem as well.", "group_id": 2515, "id": 1427756}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308425655.802911, "message": "Most films (at least those told well) only have one complete story. This is because 2 hours is basically the shortest amount of time you can spend covering all the bases. Some TV episodes can do it, but it is a barebones look at a storyform. Novels can explore multiple stories because of the luxury of time they are given due to their format. Those films with more than one story going on are the exception to the rule. They are few and far between.", "group_id": 2515, "id": 1428130}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308425689.8177919, "message": "Regarding your three endpoints a) is the conclusion of the Subjective Story relationship between Main and Impact, b) is the conclusion of the Overall Story (what is wrong with Cole) and c) is the conclusion of the Main Character throughline.", "group_id": 2515, "id": 1428137}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308427783.4316969, "message": "Here's something contributing to my confusion: if you read the thread on IC (multiple characters), Star Wars is used as an example.  Chris mentions that Han Solo plays one function, but is the MC in his story thread with Greedo/Jabba.  Obviously that's not a complete story within the movie itself, but it demonstrates more than one MC/Story going on.  So, reading that and taking the Ordinary People answer into consideration... I'm ???.  ;)  By the way, thanks everybody for your patience on my ramblings... just seeking clarification/answers and certainly don't want to become the guy who makes eyes roll.", "group_id": 2515, "id": 1428343}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308430098.465879, "message": "And I agree with what you're saying with a) and c), but b) concluding what is wrong with Cole as it pertains to the OS by having him be able to finally communicate with his mother... I don't see that (not communicating) as being the answer to what's wrong with Cole.  The source, the root cause, leading to his problems is what Malcolm is investigating.  Cole's lack of communication, his method of preventing himself from being viewed as a freak, is merely an obvious symptom to which Malcolm helps to formulate a (wrong) opinion/diagnosis.  The root cause for these symptoms is what Malcolm is seeking and the basis for the OS - not the symptoms themselves.", "group_id": 2515, "id": 1428470}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308431801.2733431, "message": "Something you can do with this movie or others is look for relationships that change consistently throughout the movie -- basically, because if there is no SS relationship, then two people interacting don't need their own storyform.\n\nIn Bridesmaids, I saw two relationships: Annie & Cop, Annie & other Maid-of-Honor. So I looked for two possible storyforms. (And found none, btw.)\n\nIn The 6th Sense, the only relationship that changes consistently is Malcolm and Cole. Cole and his mother start and end in different places, but that consists of a single change at the end, in the car.", "group_id": 2515, "id": 1428591}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308431424.0428431, "message": "When I was just getting comfortable with Dramatica, I would see multiple stories in many movies when they weren't there. Only with time have I been able to appreciate how much story can go into one story!", "group_id": 2515, "id": 1428557}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308434598.9749651, "message": "I thought the Star Wars example was showing the details of the sub plot with Han, rather than being a separate storyline.", "group_id": 2515, "id": 1428715}, {"user_id": 30951, "stars": [], "topic_id": 39673, "date_created": 1308434799.6340959, "message": "@JBarker  I thought the Star Wars example was showing the details of the sub plot with Han, rather than being a separate storyline?", "group_id": 2515, "id": 1428725}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308436010.061065, "message": "@Mikeaja Chris referred to it as substory, but in the greater context, I think trying to separate one story from the other (that's where I try to simply say story thread, because in my mind, there's only one story - that which encompasses everything else, that's how I try to keep my head straight, lol.  Not sure if works half the time...)  In the Ordinary People example, he said two separate stories, but used substory to distinguish one thread from the other, or at least that was my interpretation.", "group_id": 2515, "id": 1428776}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308436732.186609, "message": "@MikeDerk Right, with regard to SS relationship. I'm going to watch the movie again tonight, paying particular interest to the interaction between Cole and his Mother as that's where I would see a SS if he were the MC in his own thread.  They do very much have a heart to heart battle, hers being she's tired of the way he's behaving, tired in her mind and soul... and it stems from communicating.  The problem is, his answer, to withdraw, isn't the right answer and only makes her more concerned.  Communication is a two way street, so when he says he's ready - she has to be ready to be receptive and I think that, at that point, she's ruled out other possible causes (his friends, for instance) so that when he provides that one bit of info about his grandmother that pertains to her, she's left with only one possible answer: to accept what he's saying as the truth - something she couldn't do earlier when he insisted Grandma took the pendent.  When I watch it again, I'll keep an eye out for these things.", "group_id": 2515, "id": 1428830}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308443728.2580559, "message": "This is why you'll find the OS Concern of the story to be Understanding. No one understands Cole. Once they do, the OS portion of the story is over.", "group_id": 2515, "id": 1429204}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308443656.406647, "message": "There is no Subjective Story Throughline between Cole and his mom, no argument beyond we simply can't communicate. That is not an argument in the Dramatica Subjective Story sense of the word.", "group_id": 2515, "id": 1429199}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308443625.7169449, "message": "When I asked earlier who comes along and challenges Cole's approach to solving problems you mentioned Malcom. If this is true then the relationship throughline would exist between Cole and Malcom, not Cole and his mom. Now you're suggesting a relationship throughline between Cole and his mom, but still haven't established her unique approach to solving problems that impacts Cole.", "group_id": 2515, "id": 1429198}, {"user_id": 7645, "stars": [], "topic_id": 39673, "date_created": 1308443699.3183229, "message": "It is however an excellent example of the Overall Story Throughline -- the throughline that affects everyone. Mom and haunted son don't understand each other, this is why she \"hired\" the therapist. The other kids and the teacher also don't understand Cole. That lack of communication is a problem for everyone, it is the motivation for the story's events.", "group_id": 2515, "id": 1429202}, {"user_id": 33839, "stars": [], "topic_id": 39673, "date_created": 1308452077.6163011, "message": "Ok, watched it again and see more of what you're saying.  No, there wasn't some alternative way of dealing with the problem from the Mother's end.  The closest I could come up with is she \"pretends\" with him at first as a way to communicate.  Then  she demands he confess later to something he didn't do, her approach being based on logic.  That's about as close as I can up with anything - her approach, logic, doesn't fit with otherwise supernatural events and makes him question whether he's a freak.  I was looking at it as he was the one who changed her by remaining steadfast, but yeah, she doesn't really present another approach that formulates an argument of how this is how we should resolve the problem.  She's more or less just frustrated because the events don't make sense to her (she's like, stuck on the 5th Sense).", "group_id": 2515, "id": 1429834}, {"user_id": 7664, "stars": [], "topic_id": 39673, "date_created": 1308780419.4603751, "message": "@Zhere I was curious if you've built up anything new with your story. I'm very curious about how this will play out.\n\nI read \"Acacia\" last year, and for a while thought that it had four main characters. (Four kids are sent to the four winds to avoid being killed after a revolution.) In the end, I think it only had one, but as I was reading it, I was intrigued.", "group_id": 2515, "id": 1460703}]