[{"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306657325.0805409, "message": "A Danish film (with English subtitles) brought to my attention by MikeDerk, created under Dogme 95 rules (which I'd never heard of before this) - http://en.wikipedia.org/wiki/Dogme_95. Seems to have won a number of awards around the world.\n\nA very interesting film, all based in one location, although for me it lacked on character insight. At least I think that's what it was. Something was missing, although I still enjoyed it. The plot and how it unfolds is great. Hopefully the analysis will identify what that might be.\n\nIn Dramatica terms, I think it was almost completely OS. I'm really looking forward to what MikeDerk thinks on this. I felt we didn't really get inside any character, therefore I believe that means we are missing, or partially missing the MC, MC/IC and IC throughlines.", "group_id": 2515, "id": 1216466}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306657462.31828, "message": "I would confidently say the character, the eldest son (Christian), is the Protagonist. If I had to choose an MC, I would choose Christian, because we focus on his side of the story more. But I don't know if we see enough of his motivations to consider him having an MC story.", "group_id": 2515, "id": 1216470}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306662091.230854, "message": "To cover some storyforming elements......... I'll leave MC stuff for now for reason above.\n\nOS:  All OS characters have their opinions, ideas and / or knowledge about the family and its past. This differs between each character, and only proof of that actual truth causes them to re-evaluate. There is also the (slightly forced, in my opinion) racist element that I think highlights the throughline.\n\nOS Throughline: Mind (each character has a fixed belief or knowledge about the family, and no-one is keen to change their attitude)\n\nOS Concern:  Memory (the main reason for the troubles is the family's past.\n\nOS Issue:  Truth  (I think this is one of the easier choices - the main thing the eldest son knows that the others do not is the truth, and that truth resolves the story).\n\nOS Problem: Knowledge (eldest son knows something his brother does not. His sister is starting to understand, his father knows but does not want anyone else to know).", "group_id": 2515, "id": 1216601}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306688682.9392049, "message": "Could you clarify this bit:\n\n\"I'd put Christian or the SS (M/I) into Manipulation because it's all about changing how people think about the dad.\"\n\nI would have thought 'changing how people think about the dad' is an OS thing.", "group_id": 2515, "id": 1218525}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1306688356.309428, "message": "I'm curious how my understanding of this movie will change when we analyze it.\n\nMy first stab at the OS Domain would put it in one of the external domains.\n\nSituation because they are all stuck at the mansion. (Although, as Christian proves in the opening shot, it's possible to walk there, and hence, walk out.)\n\nActivity because it's a celebration (hence the title)... gone wrong. \n\nI'd put Christian or the SS (M/I) into Manipulation because it's all about changing how people think about the dad.", "group_id": 2515, "id": 1218487}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1306688407.4759669, "message": "There are clear elements of the past in this movie. I'm curious if they are going to be Memory or Past, because it's a revelation of something that happened, as opposed to a subjective take on those events.", "group_id": 2515, "id": 1218496}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306688709.9711609, "message": "Is that also the story goal...... to bring the truth out?", "group_id": 2515, "id": 1218530}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306689800.535718, "message": "One other thing, do 'Situation' or 'Activity' work when it is not being in the house or at the party that causes the problem? I mean, it adds to the drama that they can all hear the truth (while having dinner), but it is not the reason things change - that is because the brother and sister realise the truth.", "group_id": 2515, "id": 1218664}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1306731241.955425, "message": "I was coming from the idea that the sustained problem comes from the fact that nobody can leave. They all want to, but their keys are missing.\n\nBut, this gets back to \"is the house the setting for the problem\" or \"the source of the problem\" ... I'll think on it.", "group_id": 2515, "id": 1224256}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1306740178.5908511, "message": "Yes, I see what you mean. That is a key question. I guess one difference with this film is the way some elements didn't get much focus, like for example the people not being able to find the keys. we know they were stolen by the girls. But the film didn't spend much time at all on the problem this caused for the guests. Then, soon after, we seem to be back to everyone having a fun party.\n\nAn initial thought on source vs setting. I felt that all the characters who had been invited to the party were mostly background, or setting. They don't get in the way of Christian saying what he wants to say, and they also don't round up on the father. The only involvement in the story is when they help Michael take Christian outside.", "group_id": 2515, "id": 1225004}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1307121867.1750679, "message": "Oh, weird. So I finally got around to watching the movie again, and it was a totally different experience this time. I think I'm going to take it off my top ten list. \n\nWhen I first saw it, it must have been astonishing for so many things: a stunning, calm, devastating toast (inciting incident, sort of) at the dinner, the possibility to make a movie with a camera so small, a brand-new look, a slew of good writing techniques that I have since stolen and incorporated into my own work.\n\nBut... now it just seems like a voyeuristic couple of hours at the worst family reunion ever, and on top of that, the story wanders. \n\nI really doubt this has any semblance of a storyform. But, for a movie that I *think* is success/good or possibly success/bad... it was a real downer at the end.", "group_id": 2515, "id": 1279077}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307150115.20769, "message": "Well, as I said before, I think the OS is there. I'd go with Success and Good. If the goal is 'get the truth out' then it is successful and ultimately the decisions taken were good.\n\nI would suggest just going for an OS storyform, ignore the other throughlines.  I think we are in the Mind or Manipulation areas though, unless I am understanding them wrong.", "group_id": 2515, "id": 1283576}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1307156626.482388, "message": "Whenever I talk to Jim about storyforming a story, and I talk just about the OS, he says, \"It's really hard unless you know what's going on in the other throughlines, too.\" But, we can give it a shot.", "group_id": 2515, "id": 1284288}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1307156934.5863869, "message": "As for, \"The decisions taken were good.\"... I'm not sure this is enough. The only thing that matters is \"does Christian think the outcome is good?\" We get very little sense of that. I almost sense a tinge of regret -- although, I can't figure out if he is thinking \"well, that's the price you pay\" which would make it \"good\"...", "group_id": 2515, "id": 1284308}, {"user_id": 7664, "stars": [], "topic_id": 37246, "date_created": 1307156812.565239, "message": "The whole movie is a \"celebration gone wrong\" -- that seems like Activity/Physics.\nChristian... could be situation? Or, could be Mind (although he doesn't seem driven to make his point. The chef has to step in, and ultimately, the letter from his sister is what does the trick).\nThe overall effect certainly seems like \"manipulation\" -- the dad acknowledges that he knows nobody is going to see him ever again. (Now that I think about it, I would put the dad in Mind: \"convinced he's innocent.\")", "group_id": 2515, "id": 1284298}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307177970.7949131, "message": "I'd also opt for Activity/Physics, since the movie is about activities utterly gone wrong. In the past a father abused two of his children; and then a birthday celebration develops to something very different. I've chosen Steadfast as MC Resolve and Situation as MC Throughline (Christian finds himself in the situation of having been abused by his father when he was a kid – a situation that will never change). Dramatica has chosen Do-er as his approach. I decided for Action as the Driver. Chosing the OS Problem was an easy one: Non-Accurate. Dramatica then gave me Doing as a Goal and Hunch as Christian's Problem. Since Christian really did what he wanted to do (telling the rest of the world what kind of a creature his father is), this looks like a Success story. Limit is an Optionlock. Now we are left with 4 remaining Storyforms.", "group_id": 2515, "id": 1285183}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307179329.899569, "message": "I think a problem here is that we are confusing Christian / eldest son (Protagonist) and MC.\n\nHe is the primary part of the OS, and I would say most of what's described so far is OS. The reason I think this is because we learn these things along with everyone else. We see nothing of his internal motivations, why he chose the party,  what he really feels about it.", "group_id": 2515, "id": 1285241}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307179467.989886, "message": "Other than the a few minutes at the beginning, a short scene in the woods and in his room with Pia, and the dream, we only see the same view of Christian and his motives as everybody else.", "group_id": 2515, "id": 1285252}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307179748.3074551, "message": "I would say Helene or Michael could equally be MC. We actually learn of the significance of the sister's death through Helene, and we learn of the unstable nature of the family through Michael. I think internally we see as much of those two characters as Christian.", "group_id": 2515, "id": 1285274}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307190146.4504039, "message": "Since I haven't seen the movie, but have to rely on the (very long) German Wikipedia entry, the English Wikipedia entry, and other sources, could anyone tell me through whose eyes we are experiencing the story? From what I've read it should be Christian – but of course these sources don't know Dramatica. Probably they are confusing Main Character and Protagonist.", "group_id": 2515, "id": 1285997}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307193020.11516, "message": "I would say through no-ones eyes. But this film is different, is filmed very differently, and I'd say is very difficult to get a feel for it from Wiki. I've never seen a film in this style before.", "group_id": 2515, "id": 1286221}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307209137.769453, "message": "Ooooops .... funny software ... really!", "group_id": 2515, "id": 1287552}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307209123.5033431, "message": "Yes, this was a \"Dogma 95\" film. Another infamous director of this group is Lars von Trier, who has recently been kicked out of the Cannes Festival.\n\nVinterberg wrote a follow-up stage play which was produced by the Burgtheater in Vienna. It is called \"The Funeral\". Guess, who died? Right, this nice daddy.\n\nThis inspired me to speculate that maybe Helge has been the Protagonist in the first movie. It was his birthday and his celebration after all. Of course I changed the outcome to Failure now. Doing remains the Story Goal. Again there are 4 Storyforms remaining. Christian's Unique Ability could be Security or Fantasy and his Critical Flaw Wisdom or Experience. Judgment remains \"Either\", as does his problem solving style.\n\nDon't know what to decide here since I haven't seen the movie.", "group_id": 2515, "id": 1287543}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307210601.682883, "message": "I think the question is, if there are 4 storyforms, who do they relate to?? When we talk about Christian, we have to remember he is also a main character in the OS throughline.\n\nMy suggestion is lets concentrate just on the OS storyform, and see where that leads us.", "group_id": 2515, "id": 1287674}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307256527.451056, "message": "In the OS Throughline there isn't a Main Character. This fellow can only be found in their own throughline (aka MC Throughline) and in the Subjective Throughline (aka \"Main vs. Impact Story\").", "group_id": 2515, "id": 1291984}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307258170.219023, "message": "There are 4 Storyforms remaining, because I don't know about Christian's Unique Ability and his Critical Flaw. People who have seen the movie might know the answer and then we'll arrive at 1 Storyform including all of the 4 Throughlines within seconds.", "group_id": 2515, "id": 1292115}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307265203.1393831, "message": "I think you are confusing how characters are connected to the throughlines. Christian (as eldest son) is probably the Protagonist. Therefore, part of the OS throughline. If he is also the MC, then he is part of the MC throughline. However, personally I do not think there is an MC throughline in this film.\n\nI recommend doing some research on the 4 throughlines using the various Dramatica resources online, because I think it is important to see the difference between the Protagonist (OS throughline) and the MC. I often go back and re-read things to make sure I am on the right track.\n\nI think it would also be worth watching the movie. It don't think it will be productive discussing a movie you haven't seen. I would say this is especially true for Festen.", "group_id": 2515, "id": 1292372}, {"user_id": 30951, "stars": [], "topic_id": 37246, "date_created": 1307268893.3266931, "message": "I might have misunderstood what you meant. Clearly I was referring to the Protagonist (as I stated in various posts before). Familiar with the theory basics (as most here are), and I would suggest Festen in not a complete story in the Dramatica sense.", "group_id": 2515, "id": 1292465}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307267867.2741301, "message": "Thanks for your kind advise, Mike. Since I've been using Dramatica day and night for over a decade now and have begun teaching it some time ago, I disagree that I might confuse how characters are connected to the throughlines. You said about Christian that \"he is also a main character in the OS throughline\". I replied that there is no Main Character in the OS throughline. The character you are most probably referring to is called the Protagonist, not the main character. I agree that the Protagonist of any story is part of the OS throughline. Complete stories, i.e. Grand Argument Stories, do have four througlines including a MC throughline. Maybe you are right with your assumption that in Festen there isn't a MC, meaning that there isn't anybody we could possibly identify with. This would make Festen an incomplete story.", "group_id": 2515, "id": 1292443}, {"user_id": 35158, "stars": [], "topic_id": 37246, "date_created": 1307269389.55685, "message": "Sorry, it should read \"advice\" of course ...", "group_id": 2515, "id": 1292476}]