[{"user_id": 28331, "stars": [], "topic_id": 18229, "date_created": 1302350779.2196369, "message": "Any COmments?", "group_id": 292, "id": 601844}, {"user_id": 1284, "stars": [], "topic_id": 18229, "date_created": 1302350830.6871099, "message": "what are your skills going into learning python?", "group_id": 292, "id": 601845}, {"user_id": 11592, "stars": [{"date_created": 1302359025.338948, "user_id": 13912}, {"date_created": 1302389745.347578, "user_id": 5778}, {"date_created": 1302574206.505228, "user_id": 141}], "topic_id": 18229, "date_created": 1302357072.1844521, "message": "start a project and work it out. how else?", "group_id": 292, "id": 602304}, {"user_id": 22938, "stars": [], "topic_id": 18229, "date_created": 1302358751.737504, "message": ".", "group_id": 292, "id": 602415}, {"user_id": 22938, "stars": [{"date_created": 1302535225.5668559, "user_id": 22878}], "topic_id": 18229, "date_created": 1302359144.0949681, "message": "Install ipython: From ipython, try munging some text file:  lines=open(\"yourFile.txt\").readlines(),  then try 'print lines[0]', look up how to do for loops, loop through all your lines, try doing x=lines[7];  Now try ?x.strip or ?x.split. Try dir(x).  You now know how to get help (?) or how to list all methods available in a class.  Next you'll want to learn about dict().  Google 'diveintopython' for a free book that's not bad.  And then scratch an itch: write some scripts that you need for something else that you are doing. Do that every day, and you'll learn python.", "group_id": 292, "id": 602436}, {"user_id": 20326, "stars": [{"date_created": 1302363203.9019091, "user_id": 25337}, {"date_created": 1302366252.885885, "user_id": 13912}, {"date_created": 1302389769.7153189, "user_id": 5778}, {"date_created": 1302456144.9479239, "user_id": 4375}, {"date_created": 1302535260.9142499, "user_id": 22878}, {"date_created": 1302782058.4625239, "user_id": 26601}], "topic_id": 18229, "date_created": 1302362414.2622199, "message": "This depends on who you are. Python is a relatively easy-to-learn language and if you're already an experienced software developer it's probably best to start with the official tutorial http://docs.python.org/tut/ and then get right to writing programs that interest you, using the documentation and internet to answer questions you run into on the way.\n\nIf you are new to programming or have only programmed a little before, you'll want a more serious resource. There are two pretty good books on Python out there I know of: http://greenteapress.com/thinkpython/thinkpython.html and http://learnpythonthehardway.org -- the latter takes a somewhat novel, hands-on approach. Both are available free online or in dead-trees format if you prefer.\n\nI recommend you stay away from Dive Into Python. It targets relatively obscure versions of Python, contains many unnecessarily incorrect statements, seems oddly organized to me, and has lots of ugly examples.  The books I've recommended suffer less from these problems.", "group_id": 292, "id": 602599}, {"user_id": 28470, "stars": [], "topic_id": 18229, "date_created": 1302391275.807482, "message": "Lol", "group_id": 292, "id": 606284}, {"user_id": 5939, "stars": [], "topic_id": 18229, "date_created": 1302394926.374157, "message": "I would have to disagree with @mikegraham. While it is true that Dive into Python is somewhat dated, it has a lot of great examples dealing with more advanced uses of the language.", "group_id": 292, "id": 606766}, {"user_id": 19403, "stars": [{"date_created": 1302471355.2336431, "user_id": 15343}, {"date_created": 1302477742.421447, "user_id": 22774}, {"date_created": 1302489057.982729, "user_id": 20170}, {"date_created": 1302535306.7673309, "user_id": 22878}], "topic_id": 18229, "date_created": 1302463670.2405789, "message": "Think Python is excellent for learning Python as a language.  I'm a bit skeptical that, as the sub title states, it teaches you to think like a computer scientist.  For that, http://mitpress.mit.edu/sicp/ is still the best and there are YouTube videos of the courses from both MIT and Berkley.  The tutorial http://docs.python.org/tutorial/ is the best introduction to the language; read that first.  The MIT Intro to CS http://www.youtube.com/watch?v=k6U-i4gXkLM uses Python.  After that, read good code.  Look at the Python standard lib and Django.", "group_id": 292, "id": 612944}, {"user_id": 22692, "stars": [{"date_created": 1302470922.748584, "user_id": 20326}, {"date_created": 1302471347.49769, "user_id": 15343}, {"date_created": 1302535346.2503619, "user_id": 22878}], "topic_id": 18229, "date_created": 1302465458.4136889, "message": "I agree that Learn Python the Hard Way is the best FIRST step.  Zed teaches good programming practices in addition to learning Python.  One major note is that you should type all of the code for ANY tutorial and not just cut and paste.  (Cut and paste comes later down the road)", "group_id": 292, "id": 613058}, {"user_id": 25106, "stars": [], "topic_id": 18229, "date_created": 1302467545.1181431, "message": "Cut and paste should require a license with a yearly test for renewal", "group_id": 292, "id": 613408}, {"user_id": 22692, "stars": [{"date_created": 1302574247.8385119, "user_id": 141}], "topic_id": 18229, "date_created": 1302471495.595499, "message": "Yes, there is a certain \"just do it\" needed but with direction.  At some point though the tutorials get old and the hardest thing is finding something to create or work on that requires thinking outside of the tutorials.", "group_id": 292, "id": 614196}, {"user_id": 15343, "stars": [], "topic_id": 18229, "date_created": 1302471171.578552, "message": "@dpwiz your answer's a little vague and discouraging right? I mean, \"just do it\" works for taking a jog, but not really so inspirational when it comes to nailing down a learning path :(", "group_id": 292, "id": 614120}, {"user_id": 15343, "stars": [], "topic_id": 18229, "date_created": 1302471340.7491851, "message": "@broberts_az yeah, great advice. Pointing someone to a real resource trumps the \"figure it out for yourself\" snottiness and stuck-up BS.", "group_id": 292, "id": 614155}, {"user_id": 20326, "stars": [], "topic_id": 18229, "date_created": 1302472021.735564, "message": "@tekromancr I just can't agree that DIP is a good resource. Even if targetting Python 2.3 was reasonable, so many things about DIP seem less than ideal to me. When I open up to Chapter 2 (1 was just about installation and such), Pilgrim lives up to his promise and dives in with a promise to explain. I look at the example and am baffled by several little things. The docstrings language is impresise and indicative of bad practice. There's several PEP8 violations—spaces omitted where they should be and heinous, unnecessary use of backslash continuations, others... It strikes me as odd that list comprehensions are to be introduced before for loops. \nWhat of Pilgrim's promise to explain? The next section is 2.2 Declaring Functions, despite the fact Python doesn't have such a thing. I learn all sorts of things that aren't actually true—\"Python figures out what type a variable is\" which isn't true and helps enforce ideas of what a variable is that prove problematic to many beginners. \nThen I turn the page to apply my knowledge and look for the exercises only to find there are none. It is difficult enough to get learners to do exercises when present and when absent it seems like very few learners will be proactive enough to come up with some.\nAs I go through the rest of the chapter and the rest of the book, I find time after time where I'm dissatisfied. New terminology is unnecessarily introduced unnecessarily, ideas are explained incorrectly with no pedagogical benefit, code examples are unpolished, etc. I don't mean to overstate this all, but these flaws are big enough to drop DIP considering we have a wealth of other books, some of them great.", "group_id": 292, "id": 614299}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487760.5616751, "message": "@mkelley33 I think you're right, but I do agree with @dpwiz's suggestion so long as it's followed with a \"and come to us with questions as you encounter problems, then we can point you to proper resources and/or hold your hand\" sort of idea", "group_id": 292, "id": 617000}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487764.763629, "message": "I'm one of those sort of people who needs to have a goal before I can start learning things", "group_id": 292, "id": 617002}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487831.882334, "message": "then ask about specific areas of your project goals", "group_id": 292, "id": 617023}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487833.854239, "message": "imo :)", "group_id": 292, "id": 617024}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487846.4970491, "message": "tutorials get old very quickly for me", "group_id": 292, "id": 617026}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487963.515929, "message": "if I have no experience with whatever topic, I might be able to do a more precise google search for useful resources", "group_id": 292, "id": 617052}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487804.9839511, "message": "I think that helps, too... do a little bit of research into how other people have accomplished what you want to do (because, face it, your project is likely not going to be unique)", "group_id": 292, "id": 617010}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487907.474951, "message": "for the record, I'm generally not the RTFM sort of person--ask any of my peers", "group_id": 292, "id": 617039}, {"user_id": 5778, "stars": [], "topic_id": 18229, "date_created": 1302487929.043952, "message": "once they ask about something specific, I will gladly help them do what they want to do so far as I am capable", "group_id": 292, "id": 617043}, {"user_id": 22692, "stars": [], "topic_id": 18229, "date_created": 1302489352.891063, "message": "it sure is hard to figure it all out at first.  hell, just understanding WHICH version of everything is a bitch.  I think that there is a lot of information out there but maybe too much.  I would recommend finding a user group or a co-working place with Python programmers.  Find somebody knowledgeable and ask for help.  The sad thing is that the Python community (Hell programmers in general) is full of know-it-alls and arrogant S.O.B's.  Don't believe me, go to an IRC channel and ask a simple question.  You will not get an answer but you will get a bunch of asshole responses.", "group_id": 292, "id": 617469}, {"user_id": 15343, "stars": [], "topic_id": 18229, "date_created": 1302498619.467818, "message": "@brobertz_az agreed. sad but true :(", "group_id": 292, "id": 619800}, {"user_id": 15343, "stars": [], "topic_id": 18229, "date_created": 1302498244.6230209, "message": "@codekoala yeah, I'm a big believer in determination, drive, and direction. to be clear, my responses were largely meant to point out that we're a community of evangelists and not elitists", "group_id": 292, "id": 619731}, {"user_id": 11592, "stars": [{"date_created": 1302534689.473866, "user_id": 15343}, {"date_created": 1302535457.790606, "user_id": 22878}], "topic_id": 18229, "date_created": 1302507063.044214, "message": "@mkelley33 sorry for being rude, i just wanted to point out that as python is a very practical language, one does need a specific task in front of him and dig out docs and help as they're needed, focused just on that task. Because python is a deep language too, without focus you'll be pulverizing your attention over entire field and making little progress in actual stuff, eventually succumbing to boredom. Anyway, python is almost a pseudocode and that really matters is general problem-solving skill.", "group_id": 292, "id": 621056}, {"user_id": 20598, "stars": [{"date_created": 1302533414.5200109, "user_id": 15343}], "topic_id": 18229, "date_created": 1302531426.250479, "message": "Find your local Python meetup, if there's one where you live. Nothing like having a group of fellow programmers.", "group_id": 292, "id": 624355}, {"user_id": 20598, "stars": [{"date_created": 1302535470.8832459, "user_id": 22878}, {"date_created": 1302538485.7117059, "user_id": 1284}, {"date_created": 1302552904.53107, "user_id": 20326}], "topic_id": 18229, "date_created": 1302531328.785816, "message": "I have recently started to learn programming and the best book to really get into writing code was definitely http://learnpythonthehardway.org/. Also, Google has a nice online (and free) course http://code.google.com/edu/languages/google-python-class/. Plus all the PyCon videos are online and there's several entry level talks.", "group_id": 292, "id": 624320}, {"user_id": 15343, "stars": [{"date_created": 1302534456.4009099, "user_id": 11592}], "topic_id": 18229, "date_created": 1302534114.5256419, "message": "@dpwiz no worries! I don't think your answer is rude, rather it lacks sufficient context so as to be helpful. I think your reply to me just now has better illustrated your point--not that I agree with your last statement ;) Then again, I think its good that we disagree. Perhaps, I'm wrong, maybe even overcomplicating the issue, or being too defensive. I just do what I can to look out for the noobs. It wasn't too long ago that I was a noob myself :)", "group_id": 292, "id": 624904}, {"user_id": 15343, "stars": [{"date_created": 1302534964.011673, "user_id": 11592}, {"date_created": 1302548125.7931011, "user_id": 13912}], "topic_id": 18229, "date_created": 1302534682.738838, "message": "Another key piece of learning advice: watch out for programmer dogma, \"never\", \"always\", and other teaching that seem etched in stone. The best way to learn Python will differ for each individual. If you're already experienced in other languages and know some version control system like git or mercurial, then taking a look at an existing project will be easy and very helpful. And yes, read as many blog posts as possible, and try different things out--this will help you decide what the **best** way to learn python is! Oh, and don't forget to type: import this", "group_id": 292, "id": 624979}, {"user_id": 20326, "stars": [], "topic_id": 18229, "date_created": 1302552973.875766, "message": "@broberts_az The Python community has it's fair share of faults and we should recognize and try to improve them. Your comment seems to me not to have much constructive content regarding the state of our technology and community, so I have a hard time understanding your desire to share it.", "group_id": 292, "id": 629120}, {"user_id": 22692, "stars": [], "topic_id": 18229, "date_created": 1302555440.6107211, "message": "@mikegraham Sorry, that was my frustration talking.  I just remember what is was like trying to learn Python on my own.  There wasn't a Python group here in town until I started one 3 months ago.  I also expressed my frustration on my blog http://bit.ly/gbOTkU.  I totally agree with @kamzilla about user groups but I will say that they are a lot tighter and stronger in the Ruby community.  I think that Rubyists are more of a herd mentality whereas Pythonistas are generally independent.  Hopefully I explained it better this time.  It was by no means to be a slight on Python.", "group_id": 292, "id": 629880}, {"user_id": 24495, "stars": [], "topic_id": 18229, "date_created": 1302568590.5412619, "message": "@holdenweb How do you like using Convore to talk about Python?", "group_id": 292, "id": 633205}, {"user_id": 1284, "stars": [], "topic_id": 18229, "date_created": 1302568497.6709521, "message": "@holdenweb there's also python-tutor. I used to hang out on both, but I hate the UI of mailing lists so much that I don't read any anymore", "group_id": 292, "id": 633188}, {"user_id": 3354, "stars": [], "topic_id": 18229, "date_created": 1302568424.1933429, "message": "Anyone use comp.lang.python (python-list at python dot org)? I learned a lot of good habits and interesting questions from those people, and still dip in and out as a part of my community outreach efforts (which always seem somewhat feeble).", "group_id": 292, "id": 633174}, {"user_id": 3354, "stars": [{"date_created": 1302568838.3218429, "user_id": 1284}], "topic_id": 18229, "date_created": 1302568745.9387231, "message": "It's OK. I just freak out at the \"300+\" in the stripe, and want to leave it alone. Need to be able to filter feeds and the like - could probably do that with an API if I had an intern.", "group_id": 292, "id": 633240}, {"user_id": 22692, "stars": [], "topic_id": 18229, "date_created": 1302568752.4812591, "message": "@holdenweb I think that is also a good place and you also bring up the subject of good habits in which I agree with @mkelley33 that watching/learning how DIFFERENT Python programmers work is a good practice to determine what works best for the new programmer.", "group_id": 292, "id": 633243}, {"user_id": 19403, "stars": [{"date_created": 1302605306.9910131, "user_id": 28961}], "topic_id": 18229, "date_created": 1302592267.9062819, "message": "An interesting topic related to this discussion.  http://goo.gl/FgrUc", "group_id": 292, "id": 638796}]