[{"user_id": 11626, "stars": [], "topic_id": 8975, "date_created": 1298608168.88185, "message": "WASHINGTON – The top U.S. commander in Afghanistan is ordering an investigation into charges that an army unit trained in psychological operations was improperly told to manipulate American senators to get more money and troops for the war.\r\n\r\nA senator allegedly targeted said Thursday that he's confident there will be a review of the facts, but played down the idea that he was manipulated.\r\n\r\nThe staff of Lt. Gen. William Caldwell, head of the effort to train Afghan security forces, ordered the information operations unit to compile profiles, voting records and other information on visiting lawmakers to leverage in a campaign to get more assistance, said a story Thursday on Rolling Stone's website. It says the campaign also improperly targeted the chairman of the Joint Chiefs of Staff, Adm. Mike Mullen, and others.\r\n\r\nCaldwell's office denied that the command used information operations cell to influence distinguished visitors. But a press statement from Kabul said that the commander of forces in Afghanistan, Gen. David Petraeus would order a probe \"based on the information\" in the article.\r\n\r\nBut the episode underscores how murky the dividing line can be between information operations and public affairs officers — one the Pentagon has wrestled with in recent years as it struggled to win the hearts and minds of populations in Iraq and Afghanistan.\r\n\r\nPentagon spokesman Col. Dave Lapan said Thursday that the probe will look at the actions taken by Caldwell and his staff and determine whether they were inappropriate or illegal.That distinction, he said, depends on the circumstances.\r\n\r\n\"It just depends on what it is they are doing. It's the actions not just the assignment,\" said Lapan. \"It all depends on how the information is used. There is no blanket prohibition against having that information provided.\"\r\n\r\nAs an example, he said an information operations officer could be asked to look up someone's biography online. He added that Petraeus will announce who the investigating officer will be, but said it does not necessarily have to be someone of the same or higher rank than Caldwell.\r\n\r\nThe military cell devoted to what is known as \"information operations\" believed their mission on arriving in Afghanistan in November 2009 was to assess the effects of U.S. propaganda on the Taliban and local Afghan population, Rolling Stone said, quoting Lt. Col. Michael Holmes, whom it identified as the leader of the five-man team.\r\n\r\nHolmes said they resisted the order to compile information on congressional delegations that were visiting there and think of what information \"to plant inside their heads.\" He said they were subjected to retaliation for resisting.\r\n\r\n\"My job in psy-ops is to play with people's heads, to get the enemy to behave the way we want them to behave,\" Holmes is quoted as saying. \"When you ask me to try to use these skills on senators and congressman, you're crossing a line.\"\r\n\r\nThose singled out in the campaign included Sens. John McCain, R-Ariz., Joe Lieberman, I-Conn., Jack Reed, D-R.I., Al Franken, D-Minn., and Carl Levin, D-Mich. Rep. Steve Israel, D-N.Y., of the House Appropriations Committee; the Czech ambassador to Afghanistan; the German interior minister, and a host of influential think-tank analysts, the story said, without identifying the international figures by name.\r\n\r\nLevin pointed out Thursday that he has long been in favor of building up Afghan forces.\r\n\r\n\"For years, I have strongly and repeatedly advocated for building up Afghan military capability because I believe only the Afghans can truly secure their nation's future,\" Levin said in a statement. \"I have never needed any convincing on this point. Quite the opposite, my efforts have been aimed at convincing others of the need for larger, more capable Afghan security forces, and that we and NATO should send more trainers to Afghanistan, rather than more combat troops.\"\r\n\r\nhttp://d.yimg.com/a/p/afp/20110223/capt.photo_1298488578045-1-0.jpg?x=213&y=142&xc=2&yc=1&wc=408&hc=272&q=85&sig=VUhaS9R2k4Hpjiw6p.Dc8Q--\r\n\r\nhttp://news.yahoo.com/s/ap/20110224/ap_on_re_us/us_pentagon_general_investigated", "group_id": 3920, "id": 205827}]