[{"user_id": 28990, "stars": [], "topic_id": 19649, "date_created": 1302883870.3809171, "message": "Starting this topic for general brainstorming.  Anyone have a \"crazy idea\" brewing? I'm sure there are at least a few.", "group_id": 8728, "id": 701943}, {"user_id": 28990, "stars": [], "topic_id": 19649, "date_created": 1305121036.876704, "message": "If anyone wishes to attempt, I volunteer to hold the camera. ;) http://youtu.be/efdDsba-gjk", "group_id": 8728, "id": 1007225}, {"user_id": 1924, "stars": [], "topic_id": 19649, "date_created": 1305123774.0973639, "message": "I've been enjoying the thought of pumpkins being launched out of the roof of my orange VW bus. :-D    And way lower on my priority list: There's a non-camper bus for sale in town that's just daying to be converted to electric.", "group_id": 8728, "id": 1007898}, {"user_id": 28990, "stars": [], "topic_id": 19649, "date_created": 1305129635.0755961, "message": "Thinking about the best method for launching pumpkins out of VW bus led me to dig online for inspiration. It's apparent that the pumpkin launching community is obsessed with cannon/catapult size (not sure if this is some sort of Freudian issue) and nothing I've found so far comes close to fitting the bill for said bus shenanigans. Do you have a vision for this? I assume you'd be interested in a non-permanent design thats easily installed and removed to keep your bus available for other uses...if not then then I'll go ahead and start rubbing my hands together and laughing maniacally...", "group_id": 8728, "id": 1009439}, {"user_id": 28990, "stars": [], "topic_id": 19649, "date_created": 1305906564.555593, "message": "Please loan some grey matter processing time: I have several OLD ipods. Not one of them is fully functional but could be \"frankensteined\" into at least one fully operational unit. I also have at least one \"itop\" that allows you to relocate the basic controls along with the old firewire cords.  Any inspiration on a project for these parts?", "group_id": 8728, "id": 1127164}]