[{"user_id": 11626, "stars": [], "topic_id": 6592, "date_created": 1297895891.0254459, "message": "The U.S. Department of Homeland Security and the National Basketball Association are promoting a security-awareness campaign at this weekend’s NBA All-Star Game in Los Angeles.\r\n\r\nThe campaign, titled “If You See Something, Say Something,” was originally implemented by New York City’s Metropolitan Transportation Authority and was later licensed to the federal agency for its own national program. In the past six months, the campaign has been promoted in 9,000 federal buildings nationwide.\r\n\r\n“The idea is simple,” Homeland Security Secretary Janet Napolitano said at a press conference in Washington. “It’s asking the American people to be vigilant and to aide local law enforcement.”\r\n\r\nNapolitano wouldn’t say whether there had been a credible security threat at an NBA or National Hockey League arena in the past two years.\r\n\r\nHomeland Security has a $2.9 million budget to promote the national campaign. Private businesses including the NBA and the National Football League, which promoted the event at this month’s Super Bowl in Arlington, Texas, are spending additional amounts promoting awareness.\r\n\r\n“Security is a shared responsibility, underscoring the importance of identifying and reporting suspicious activity,” said NBA Commissioner David Stern, who joined Napolitano at the press conference. “We think sports is a terrific way to send messages and to get people when they go to events to focus on this very important message.”\r\n\r\nAt the All-Star Game at Staples Center on Feb. 20, fans will see messages on posters, television monitors and ribbon boards around the arena.\r\n\r\nThe game will start at 8 p.m. New York time and will be televised on Time Warner Inc.’s TNT network.\r\n\r\nhttp://www.bloomberg.com/news/2011-02-15/nba-homeland-security-department-push-public-awareness-at-all-star-game.html", "group_id": 3920, "id": 125686}]