[{"user_id": 21148, "stars": [], "topic_id": 12740, "date_created": 1299986740.3502181, "message": "Absolute best show!!! I watched it through Netflix and watched all 6 seasons back to back! The writers were def the definition of suspense! So sad to see it end and about the ending... I'll wait for other opinions???", "group_id": 11, "id": 338780}, {"user_id": 4831, "stars": [], "topic_id": 12740, "date_created": 1299996795.5734921, "message": "I enjoyed the last season.. the final episode was good, they could have went into a better direction or maybe explained it better.. but I took it as Hurley is now basicly a demigod (jacob seemed to be one) and created and alternate world for everyone that had their lives affected by the island (i believe this world was created for them to go to at their death). Through Desmond he was able to have them remember their true former lives and bring them together into the new island or whatever creation he made.", "group_id": 11, "id": 339276}, {"user_id": 7647, "stars": [], "topic_id": 12740, "date_created": 1300384435.5228119, "message": "I thought it was a great show but it lost some of its allure when they stopped focusing on character development.  Favorite episode was probably The Constant.", "group_id": 11, "id": 375949}, {"user_id": 22433, "stars": [], "topic_id": 12740, "date_created": 1300391645.832859, "message": "Best show ever! about the end was not perfect, but for me LOST is a long trip and I really enjoyed the last 6 years travelling :)", "group_id": 11, "id": 377156}, {"user_id": 22817, "stars": [{"date_created": 1300508962.306236, "user_id": 1}], "topic_id": 12740, "date_created": 1300508926.1187711, "message": "Loved it. Miss it. Thought the ending worked.", "group_id": 11, "id": 387026}, {"user_id": 1, "stars": [], "topic_id": 12740, "date_created": 1300508972.914968, "message": "@manima Couldn't have said it better myself!", "group_id": 11, "id": 387028}, {"user_id": 25414, "stars": [], "topic_id": 12740, "date_created": 1301096926.624927, "message": "Great show. Ending disappointed me", "group_id": 11, "id": 443372}]