[{"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304529160.661453, "message": "Boas, quem quer montar um negócio na web tem de pensar em \"conversion funnels\" mais cedo ou mais tarde. Nessa perspectiva, fico um pouco desapontado por não conseguir encontrar, pela Web fora, quantificações de \"conversion funnels\" que permitam comparar valores e ver se os meus números são normais ou não. Posto isto, alguém arrisca a fazer a análise dos meus números e a partilhar também os seus?", "group_id": 6883, "id": 915873}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304529365.582289, "message": "Estas a ver o problema do lado errado, não olhes para conversões assumindo web, conversões são business.", "group_id": 6883, "id": 915971}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304529605.3639629, "message": "Ainda não sei se concordo contigo, no entanto, porque raio não testas ? A/B ? Em X% dos casos substituis o butão simular por um \"Simular\" com indicação de acção não gratuita.", "group_id": 6883, "id": 916046}, {"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304529329.105202, "message": "Para o Modelo3 tenho um 'conversion funnel' que vai da homepage até à simulação e um 2o conversion funnel que vai da homepage até à obtenção da declaração de IRS. Estes são os valores:\nHomepage > Página de preenchimento:  42% | Página de preenchimento > efectuou uma simulação: 65% | Efectuou uma simulação > obteve declaração: 11%. \n\nNo túnel mais longo, o conversion rate total é de 3.80%.\n\nIsto é normal e/ou desejável?!", "group_id": 6883, "id": 915952}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304529460.843981, "message": "Do meu, já longo, percurso a lidar com conversões, o valor de referência que me tem sempre caído é, mais de 2% é um número aceitável, acima de 5% é um bom resultado, e pessoalmente é o número que me deixa satisfeito, 5%. No entanto, depende de muitos factores, qual o serviço, o preço, entre outros.", "group_id": 6883, "id": 916007}, {"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304529714.1727619, "message": "Isso são outros tantos :-)", "group_id": 6883, "id": 916091}, {"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304530055.5131569, "message": "BTW, o objectivo não é descobrir se o serviço deve ser tornado pago e de que forma, isso são outros tantos, mas sim ter uma base de comparação para medir a saúde do serviço gratuito (que não é o único certamente ;-) ) e talvez tirar algumas conclusões - pull the plug, por exemplo.", "group_id": 6883, "id": 916231}, {"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304529461.464869, "message": "Exacto, como tal têm de ajudar à tomada de decisões de negócio :-) Por exemplo, posso ver que a simulação é uma operação popular se calhar devia cobrar por isto e não por gerar a declaração. Ou então, se os valores forem \"normais\" pensar em cobrar pela geração e \"oferecer\" a simulação.", "group_id": 6883, "id": 916009}, {"user_id": 31505, "stars": [], "topic_id": 33667, "date_created": 1304529931.1851051, "message": "Por incrivel que pareça, nope. nada.", "group_id": 6883, "id": 916187}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304529807.3693669, "message": "Não há melhor forma de medires onde deves transformar o serviço em pago sem A/B teste. Sendo um serviço tão específico, penso que olhares para a web como generalista é um erro. Com certeza que encontrarás números de lojas online, etc, que não tem mesmo nada a ver.", "group_id": 6883, "id": 916133}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304530276.662008, "message": "Bom, ja te estou a complicar a vida. Simplificando para mim -2% mau , +2% aceitavel, +5% bom", "group_id": 6883, "id": 916323}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304529989.6023419, "message": "Eu pessoalmete , do que tenho sentido na pele, 5% é a minha métrica de sucesso. Mas a minha sensibilidade diz que acima de 2% não é tão mau assim. Leia-se conversão como \"venda\"!", "group_id": 6883, "id": 916199}, {"user_id": 31504, "stars": [], "topic_id": 33667, "date_created": 1304530149.576021, "message": "Depois tens de validar que as diferentes conversões que tiraste são reais, e que quando um utilizador abandona \"seja em que passo for\", é por não querer seguir, ou se é por outro problema qualquer, por exemplo, não encontrar a acção, etc", "group_id": 6883, "id": 916272}, {"user_id": 22703, "stars": [], "topic_id": 33667, "date_created": 1304594552.3701799, "message": "Conselhos realmente úteis. Se chegar a um patamar como este já temos uma ideia onde nos situamos.", "group_id": 6883, "id": 927615}, {"user_id": 11987, "stars": [], "topic_id": 33667, "date_created": 1304603418.7192919, "message": "Conversões de 1-5% são normais. Mais, para os interessados, o ratio de contas free para contas pagas em apps com o modelo freemium é na grande maioria dos casos na roda dos 100:1 (é certamente o caso com as nossas coisas, e com muitos dos projectos dos quais sei números).", "group_id": 6883, "id": 929121}, {"user_id": 11987, "stars": [], "topic_id": 33667, "date_created": 1304603469.6817069, "message": "Posto isto, o que é normal para um negócio pode ser estupidamente anormal para outro, pelo que comparar números que não sejam de áreas semelhantes (ex: venda de carros fiat vs venda de carros renault), é uma estratégia para perder tempo.", "group_id": 6883, "id": 929136}, {"user_id": 2473, "stars": [], "topic_id": 33667, "date_created": 1304616192.521651, "message": "Pela experiência que tenho tido as conversões de visitas para sign up andam nos 10% e depois de signup para pagamento andam no 1%.", "group_id": 6883, "id": 932012}]