[{"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1306446530.3730249, "message": "What are your preferences?  Basically we're looking for something to run some CI in cucumber and rspec on our commits and let us know if we crash something.  So far I'm eyeballing either cruisecontrol or teamcity.  I'm also curious if the headache of maintaining an environment on our git server just to run this would be worth it.", "group_id": 4606, "id": 1196538}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1306453334.0734861, "message": "I'll definitely be curious to hear what you find", "group_id": 4606, "id": 1197664}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1306453310.713119, "message": "@benzittlau We'll hopefully be playing with some of these next week so might be able to give some better feedback then.", "group_id": 4606, "id": 1197657}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1306453258.526655, "message": "@benzittlau We're looking at doing some CI at AMA right now.  Leading candidate is Jenkins (using Jenkins.rb gem - https://github.com/cowboyd/jenkins.rb).  Also looking into Big Tuna, Goldberg, Cerebus, Integrity and CI Joe.", "group_id": 4606, "id": 1197647}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1306453294.021533, "message": "@benzittlau Used TeamCity and CC back in .Net days but just seems like overkill now.", "group_id": 4606, "id": 1197653}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1306454173.3303821, "message": "Pretty impressed by the setup here:", "group_id": 4606, "id": 1197778}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1306453329.1062291, "message": "I'll take a look at jenkins, I remember running across it but don't remember why it's not on my short list right now", "group_id": 4606, "id": 1197661}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1306454175.842845, "message": "http://alblue.bandlem.com/2011/02/gerrit-git-review-with-jenkins-ci.html", "group_id": 4606, "id": 1197779}, {"user_id": 21845, "stars": [], "topic_id": 36952, "date_created": 1306459032.9892919, "message": "if I was choosing between Team city or Cruise Control, I'c probably go with TeamCity these days.  CC doesnt seem to be keeping pace.  Both strike me as kind of heavy though, for Ruby. I've heard good about Jenkins and Hudson from some guys who've crossed the chasm from .NET and into Ruby.", "group_id": 4606, "id": 1198546}, {"user_id": 21834, "stars": [], "topic_id": 36952, "date_created": 1306474882.727087, "message": "I've got http://cruisecontrolrb.thoughtworks.com/ setup, It basically e-mails me when I mess up, that's about all I use it for.", "group_id": 4606, "id": 1201015}, {"user_id": 29331, "stars": [], "topic_id": 36952, "date_created": 1306475616.642787, "message": "I really love cijoe in terms of getting CI going without having to spend hours on it - it's easy to get distracted and spend more time fiddling with your CI than gaining value from it. We use Jenkins at work - it's great, if a bit fiddly.", "group_id": 4606, "id": 1201125}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1306883380.0460711, "message": "@girasquid We're running metrical on our codebase and want some notifications if, for example, a commit drops the overall test coverage.  I'm guessing that Jenkins will have better support for that.  Any clue if cijoe has any kind of threshold notifications?", "group_id": 4606, "id": 1244276}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1306883431.0584669, "message": "@benzittlau Should be getting the VM on Thursday so looking to try out Jenkins then.  I'll let you know what I hear.", "group_id": 4606, "id": 1244288}, {"user_id": 29331, "stars": [], "topic_id": 36952, "date_created": 1306907032.2555211, "message": "If you want any sort of tweaking past \"this is how to run your tests\" and \"this is the campfire room to notify\", cijoe probably isn't the solution you're looking for", "group_id": 4606, "id": 1249916}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1307032731.7277329, "message": "Amir said yesterday he prefers Teamcity; I'm going to try some out today, and I'm probably going to start with that one.  In particular he was a big fan of the web GUI for teamcity, the api, and the ease of configurability.", "group_id": 4606, "id": 1268615}, {"user_id": 21842, "stars": [], "topic_id": 36952, "date_created": 1307126924.366287, "message": "Ended up spending most of a day trying to get Teamcity up and running and not quite getting there.  There's a major bug in their Ruby Environment Configurator which hung me up for a long time, but apparently it will be patched in their next release in a few weeks.  Aside from that I still went through a huge headache trying to get the environment properly configured to run the test, and then started running into java performance issues.", "group_id": 4606, "id": 1279748}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1307391100.9757969, "message": "@benzittlau I'll see if I can get one of the devs to pass on some info on Jenkins.", "group_id": 4606, "id": 1310718}, {"user_id": 14826, "stars": [], "topic_id": 36952, "date_created": 1307390981.385504, "message": "@benzittlau OK - the guys finally got some time and played with both TeamCity & Jenkins.  TeamCity was a bit of a resource pig (kept crashing a 512MB Linode) but Jenkins was great.", "group_id": 4606, "id": 1310691}, {"user_id": 30729, "stars": [], "topic_id": 36952, "date_created": 1307401530.0955989, "message": "Rephrasing: When executors are in use additional builds are put in a nice queue. The diagnostics let you know how often there's open airspace in this system or if you've ever had need for more than the number of executors configured.", "group_id": 4606, "id": 1313989}, {"user_id": 30729, "stars": [], "topic_id": 36952, "date_created": 1307401036.5552509, "message": "Hi gang.\n\nTeamCIty was definitely a hog in our setup (leaving a 512 Linode with ~26Mb of free RAM), but we were also running it well below its requirements (3.2GB RAM, 3.2Ghz CPU, etc.)\n\nJenkins! It's still early in our use, and I wasn't the one who set it up, but it provides an easy-to-manage interface for repos and testing multiple branches. With zero experience in it, I was able to find and configure what I needed without much guesswork (UI was logical to my first guessings).\n\nBuild testing pipeline: With two executors (configuration/build clients) we're able to run through seven app builds/tests in under three minutes (tests added when executors are put in a nice queue system).\n\nJenkins provides graphs and diagnostics on itself as well to let you know whether adding more executors or will be a good use of resources.\n\nWeather trending: Out of the box it seems to also be keeping track of a build test's recent history, and rates its reliability on a weather scale ranging from sunny (100% of recent runs past) to various degrees of cloudy and storm weather.\n\nThe plugin library seems massive, and it feels better as an overall ecosystem than TeamCity. Another dev has added notifications through Notifio (http://notifo.com/) via a plugin and that's going to save a lot of time toward only caring about unusual behaviors.\n\nWe're looking to get Metrical in and running tomorrow.\n\nIf anyone has some specific questions I'll see what I can do or dig up, but I'm far from a pro at this point.", "group_id": 4606, "id": 1313857}, {"user_id": 21844, "stars": [], "topic_id": 36952, "date_created": 1307480933.277827, "message": "To play with it, just download the war file (http://mirrors.jenkins-ci.org/war/latest/jenkins.war) and run it right off your desktop: \"java -jar jenkins.war\". Then visit http://localhost:8080/ in your browser. Blamo!", "group_id": 4606, "id": 1327933}, {"user_id": 21844, "stars": [], "topic_id": 36952, "date_created": 1307480825.960592, "message": "+1 for Jenkins. I started using Hudon back in the day and it's usually a quick win. I was initially using it for check builds and testing with Java apps but now mostly for ruby/rails projects. I've also used it to gatekeep production deployments (tomcat/war uploads and capistrano deploy tasks) so you can give the deploy \"keys\" to a manager if they want.", "group_id": 4606, "id": 1327917}]