[{"user_id": 11626, "stars": [], "topic_id": 7396, "date_created": 1298080304.1483929, "message": "http://bloximages.chicago2.vip.townnews.com/host.madison.com/content/tncms/assets/editorial/7/1c/87d/71c87d20-3b6f-11e0-92e0-001cc4c002e0-revisions/4d5e88f328fb2.preview-300.jpg\r\n\r\nMadison police closed downtown streets Thursday as thousands of protesters massed once again at the Capitol.\r\n\r\nHundreds of young students from many school districts reached the Square after marching from Madison West High School and joined in the protests against Gov. Scott Walker's budget repair bill, being taken up in the state Senate.\r\n\r\nMotorists, pedestrians and protesters should be aware that traffic closing and detours are in a very fluid situation Thursday, so streets both away from and on the Square could open or close depending on what's happening.\r\n\r\nMadison Metro buses have been running on the Capitol loop route instead of the Square since Tuesday and will continue to do so through Sunday, according to a news release from Metro. The loop is one street out from the square, using Doty, Webster, Dayton and Fairchild Streets.\r\n\r\nMadison Police spokesman Joel DeSpain told madison.com on Thursday morning that police protocol will likely stay the same as it's been the past two days downtown.\r\n\r\n\"We need to make sure the protesters will be able to move safely,\" DeSpain said.\r\n\r\nMadison Police Chief Noble Wray said, \"Our job is to create an environment for democracy to take place.\"\r\n\r\nThrough two days of protests, the throngs have been peaceful.\r\n\r\n\"We want to thank the protesters for their decorum and would urge everyone to continue to remain peaceful,\" DeSpain said.\r\n\r\nCapitol Police are allowing protest signs inside the Capitol, but the signs can't have sticks attached.\r\n\r\nAnd protests may continue on Friday: The state Senate is scheduled to take up the budget repair bill on Thursday, and it then heads to the GOP-controlled Assembly.\r\n\r\nhttp://host.madison.com/ct/news/local/govt-and-politics/article_988db128-3aac-11e0-b785-001cc4c03286.html", "group_id": 3920, "id": 148257}]