[{"user_id": 4375, "stars": [], "topic_id": 9446, "date_created": 1298858495.1613309, "message": "HN thread: http://news.ycombinator.com/item?id=2269659", "group_id": 95, "id": 223282}, {"user_id": 4375, "stars": [], "topic_id": 9446, "date_created": 1298858377.6812291, "message": "Who's a dropout, who isn't and what do you think matters?  I have a BSEE and 1/2 an MSEE.  Dropping out of a master's program is a much easier choice than a bachelor's...  Right? I dropped out because I finally realized I wanted to write software, not design circuits. Haven't regretted that choice once.  Kind of regret not getting the MS sometimes.", "group_id": 95, "id": 223275}, {"user_id": 4375, "stars": [], "topic_id": 9446, "date_created": 1298858241.4501469, "message": "Some thoughts from Justin, of justin.tv fame: http://areallybadidea.com/drop-out-or-dont", "group_id": 95, "id": 223274}, {"user_id": 396, "stars": [], "topic_id": 9446, "date_created": 1298873608.730886, "message": "BS in CECS and MS in CS, no regrets on either. On top of learning quite a bit, I met my co-founders and mentors in school, which is invaluable. But who knows, maybe I would have learned even more on my own or met even more awesome co-founders and mentors elsewhere.", "group_id": 95, "id": 223806}, {"user_id": 12172, "stars": [{"date_created": 1298877696.0872021, "user_id": 16271}], "topic_id": 9446, "date_created": 1298876534.871727, "message": "I will say that there are not a lot of reasons to drop out of college. There are many reasons to finish though. I think the question you should really worry about, and I hope you never have to ask it is, \"now that I've dropped out of college, how am I going to get back in and finish?\"", "group_id": 95, "id": 223985}, {"user_id": 12172, "stars": [{"date_created": 1298877694.248893, "user_id": 16271}, {"date_created": 1299120592.1183281, "user_id": 17469}], "topic_id": 9446, "date_created": 1298876623.8666201, "message": "I say this because I ask myself that question all the time, the fact that I even think about it means that I should have stayed in college and finished. It gets much harder to finish the longer you wait.", "group_id": 95, "id": 223990}, {"user_id": 1128, "stars": [], "topic_id": 9446, "date_created": 1298887023.203661, "message": "I dropped out, but have zero regrets. I was homeschooled during grades 7-9, and learned how to teach myself, using the resources available. When I got to college, I realized that, that was what I was primarily paying for, it wasn't worth it. All I would have seen for that debt, was a piece of paper, that only suggests knowledge, but doesn't verify it. I spent my second semester dropping in wherever I wanted, and meeting people. I say try it, but don't be afraid to drop out.", "group_id": 95, "id": 224643}, {"user_id": 9108, "stars": [], "topic_id": 9446, "date_created": 1298892838.937844, "message": "@jimminy I completely agree that college just gives you 1.) a massive amount of debt and 2.) a piece of paper that *claims* you know something. The unfortunate fact, though, is that a lot of our society places far more weight than it should on that piece of paper.", "group_id": 95, "id": 225008}, {"user_id": 9326, "stars": [], "topic_id": 9446, "date_created": 1298907467.4445889, "message": "While I agree that it's just a piece of paper it does represent the discipline required to pass certain requirements and a level of knowledge needed to pass the course work. I don't always require a college degree when hiring programmers, but if they have passed a college/university that has a good CS program I know what they went through to get that piece of paper.", "group_id": 95, "id": 226239}, {"user_id": 8029, "stars": [], "topic_id": 9446, "date_created": 1298907819.0873661, "message": "I'm studying some interesting courses at university, like functional programming, operating systems, compilers etc.", "group_id": 95, "id": 226299}, {"user_id": 2529, "stars": [{"date_created": 1299120616.07283, "user_id": 17469}, {"date_created": 1299273395.0881679, "user_id": 12084}], "topic_id": 9446, "date_created": 1298906869.9860401, "message": "Don't drop out, but *do* expect just a piece of paper and some debt.  College is useful to gain some life experiences and maturity before you go all out.  Enjoy yourself thoroughly, then expect to *start* making your professional or entrepreneurial way.  If you are going for a professional career path, traditional companies still value that mostly irrelevant piece of paper.  If you are going to be an entrepreneur, think of it as getting life's crazy experiences out of the way before you buckle down and change the world.  In the end, it is your ultimate actions that matter to your success, not having or not having that piece of paper.", "group_id": 95, "id": 226177}, {"user_id": 8029, "stars": [], "topic_id": 9446, "date_created": 1298907549.0656021, "message": "what about work knowledge?", "group_id": 95, "id": 226250}, {"user_id": 8029, "stars": [], "topic_id": 9446, "date_created": 1298907579.8669569, "message": "I've been programming for money about... five years now. I still don't have the paper but I know a lot how to build programs.", "group_id": 95, "id": 226256}, {"user_id": 8029, "stars": [], "topic_id": 9446, "date_created": 1298907603.2322991, "message": "when I have time and money, I go back to university to get some courses", "group_id": 95, "id": 226260}, {"user_id": 8029, "stars": [], "topic_id": 9446, "date_created": 1298907841.389133, "message": "When making money from Rails websites, it's nice to study something more academic...", "group_id": 95, "id": 226304}, {"user_id": 9326, "stars": [], "topic_id": 9446, "date_created": 1298907779.6348801, "message": "For me experience always out ways a degree. I'd rather have a highly motivated employee with the skills needed for the position than someone who has the piece of paper and doesn't get the job done. All that said if I have two candidates applying for a position and they are both experienced but only one has a degree I will lean more towards the one with the degree.", "group_id": 95, "id": 226290}, {"user_id": 14970, "stars": [{"date_created": 1299120653.2679319, "user_id": 17469}, {"date_created": 1299174678.5112951, "user_id": 4559}], "topic_id": 9446, "date_created": 1298924802.0801229, "message": "From everything above, there are two posts that sum it up nicely. 1) If you plan on following a professional career path then go get that degree. The degree is a base standard now, like high school was a long time ago. If you know, without a single ounce of doubt that you'll only ever start/run your own businesses, than you're better than the rest of us, you know what you want and there is no need to waste your time. 2) You allow yourself more time to meet people and enjoy your life in a very safe learning environment.", "group_id": 95, "id": 229141}, {"user_id": 2597, "stars": [], "topic_id": 9446, "date_created": 1298929654.20222, "message": "If I think about it, I actually learn more stuff outside of college...", "group_id": 95, "id": 229765}, {"user_id": 9108, "stars": [{"date_created": 1299120675.3141861, "user_id": 17469}], "topic_id": 9446, "date_created": 1298941167.1622939, "message": "One of the benefits to college is that landing an internship while you're still in school can at least provide you with some work experience in your industry of choice, which can definitely make it easier to find a job later on.", "group_id": 95, "id": 230635}, {"user_id": 9108, "stars": [], "topic_id": 9446, "date_created": 1298943811.6005981, "message": "@mridley Yeah, even the place where I interned they refused to even look at a resume to hire someone on full-time if you didn't have a Bachelor's degree. It's completely ridiculous, but that's the way a frightening number of businesses are.", "group_id": 95, "id": 230826}, {"user_id": 16271, "stars": [], "topic_id": 9446, "date_created": 1298942878.5569661, "message": "@JohnFail Yup, also if you are trying to work in the defense or intel business it's a great way to get a clearance through an internship so you can graduated cleared which is super handy.", "group_id": 95, "id": 230731}, {"user_id": 12416, "stars": [], "topic_id": 9446, "date_created": 1298946451.3650539, "message": "I quit studying Cognitive Science at Northwestern University to do web development, decided to go back to school at University of Illinois Urbana Champaign for Computer Science. And honestly going back to school was a bad decision. I guess I'm in the category of people that learn material significantly faster on my own since A) I'll have fine-grained controlled over the rate at which material is presented and B) the flexibility to invent my own problems to target the exact things I'm fuzzy on. A modern university is an even worse investment of time if you define material learned as that which is remembered over 6 months later. It in no way incentivizes long term retention.", "group_id": 95, "id": 231143}, {"user_id": 12416, "stars": [{"date_created": 1298952648.3572321, "user_id": 2597}, {"date_created": 1298999592.839709, "user_id": 14970}], "topic_id": 9446, "date_created": 1298946944.3073821, "message": "It's unfortunate some businesses may have policies barring non degree employees, but tech seems to be increasingly meritocratic. If one invested all the time they spent building the 10000th copy of a maze solver on problem sets in school into working on open source solutions to practical problems that also push one's knowledge, the bonus in skills learned would probably more than offset the lack of a degree.", "group_id": 95, "id": 231179}, {"user_id": 7357, "stars": [], "topic_id": 9446, "date_created": 1298953841.8446, "message": "i'd say drop out and apply to the peter thiel scholarship foundation", "group_id": 95, "id": 231789}, {"user_id": 16260, "stars": [], "topic_id": 9446, "date_created": 1298957835.3647621, "message": "Yeah, I got my exam. No, it doesn't matter at all. Execution is everything when it comes to startups.", "group_id": 95, "id": 232093}, {"user_id": 14819, "stars": [], "topic_id": 9446, "date_created": 1298965398.076122, "message": "It's rather strange that the dropouts in this conversation also have the worst grammar.", "group_id": 95, "id": 232883}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299037335.531285, "message": "How do you test if you really learned something? Can you publish in a peer-reviewed anything scientific that has a modicum of impact rating?", "group_id": 95, "id": 243075}, {"user_id": 17828, "stars": [], "topic_id": 9446, "date_created": 1299098999.6822751, "message": "I've been in college for almost 7 years now. I've jumped around to 4 different colleges. I'm finally settling to get a degree in web development - all for the sake of a degree in something I can use. Is it worth it? I hope so and think so. Like @owais said, \"Only time will tell.\" However, I wish that I were one of those people who picked up programming when I was younger. It's taken me a while to get around to programming, but I love it and hopefully I can get up to speed soon.", "group_id": 95, "id": 252715}, {"user_id": 14309, "stars": [], "topic_id": 9446, "date_created": 1299098774.9548049, "message": "I'm from Kashmir (India) and I dropped out this year. Now I' working at iKraft Software building web stuff. It's like 100 times more dangerous to drop out in India than in the US and most of the other countries but I did it anyway. Just couldn't stand college anymore. Regret? Only time will tell but I think I won't. Let's work hard and hope for the best.", "group_id": 95, "id": 252696}, {"user_id": 45, "stars": [], "topic_id": 9446, "date_created": 1299118981.006386, "message": "though its definitely true that there are some people out there who will always consider a lack of a degree a negative regardless of anything else, though its also probably true those aren't the people you want to work for", "group_id": 95, "id": 256151}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299119086.280735, "message": "@zac take it from an old gym rat ^H^H^H^HMEGATRON too many HR departments of even the hottest tech companies will toss your resume if there's not a degree on it. only a great internal recommendation will make you float. it's self-handicapping to the extreme. you might not be in the mood to work for startups all the time.", "group_id": 95, "id": 256178}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299118621.6516249, "message": "think about it this way. you'll work for the next 30-40 years of your life. 4 years of really applying yourself to learn something shouldn't be a big deal. unless money is a problem, then i understand, but in the long run better to have the piece of paper imho", "group_id": 95, "id": 256101}, {"user_id": 17469, "stars": [{"date_created": 1299119606.9594121, "user_id": 45}], "topic_id": 9446, "date_created": 1299119584.706291, "message": "yeah yeah i know, carmack, gates, zuckerberg. not as insurmountable, but you need lots of good networking. and in retrospect unless you have a very hot product youre working on right this very second those few years dont matter. plus you get to date more.", "group_id": 95, "id": 256310}, {"user_id": 45, "stars": [], "topic_id": 9446, "date_created": 1299119317.792702, "message": "counter anecdote: Good friend of mine who dropped out of high school was working at Apple three years later", "group_id": 95, "id": 256247}, {"user_id": 17469, "stars": [{"date_created": 1299118799.35074, "user_id": 45}, {"date_created": 1299435023.9770319, "user_id": 10694}], "topic_id": 9446, "date_created": 1299118779.0908141, "message": "@jblaha one of the reasons you might have not picked up programming when younger is that maybe you give up too soon when things become too tedious, hard or boring. less bullshit and more self discipline = happier in the long run. yes, i know everything and i have a big penis.", "group_id": 95, "id": 256125}, {"user_id": 45, "stars": [{"date_created": 1299134805.4187231, "user_id": 14309}], "topic_id": 9446, "date_created": 1299118936.3758521, "message": "@megatron i disagree on the long term thing, really when the piece of paper is important is at the beginning when you don't have a large amount of experience in your field to point to to prove your ability, once a person has a history of being good at their chosen field whether its in other jobs or open source software the degree becomes a lot less important", "group_id": 95, "id": 256148}, {"user_id": 45, "stars": [], "topic_id": 9446, "date_created": 1299119402.8708169, "message": "I definitely agree though, it is a handicap in a lot of ways, I just don't think its an insurmountable one in the programming/software field", "group_id": 95, "id": 256266}, {"user_id": 18129, "stars": [{"date_created": 1299120531.2883339, "user_id": 17469}, {"date_created": 1299121346.99053, "user_id": 17488}, {"date_created": 1299160922.1598899, "user_id": 9108}], "topic_id": 9446, "date_created": 1299120418.230418, "message": "Don't drop out.  Instead, take a semester (or two) off to gain experience that could very well be worth a whole lot more than a degree.  If by the end of your leave of absence its clear that you won't need a degree to achieve success and happiness, then by all means don't go back to school.  However, I would recommend committing to at least one semester of college before jumping ship so you can learn how to communicate in writing.  If you can swing it, try to drop out of Harvard.  I hear that's what all the cool kids are doing.", "group_id": 95, "id": 256507}, {"user_id": 6165, "stars": [], "topic_id": 9446, "date_created": 1299156605.469645, "message": "I have a BS in Business. Majored in Management Information Systems.  Completely useless degree.  Didn't teach me enough of computer science or business.  So I feel like I never got a degree in the field I work in.  Considering going back for Masters after being out for 20 years. Its a decision only you can make.  If you drop out, do you think you'll go back?", "group_id": 95, "id": 259909}, {"user_id": 14970, "stars": [], "topic_id": 9446, "date_created": 1299165759.9982941, "message": "Agree with @megatron that piece of paper will usually help to put you on a path with your entry-level gig, given lack of experience. Most big software companies look for more than just undergraduate degrees in engineering now (advanced degrees in physics, mathematics, etc)", "group_id": 95, "id": 260707}, {"user_id": 17488, "stars": [], "topic_id": 9446, "date_created": 1299179935.8113761, "message": "@JeffSelf I'm an IS major right now at Nevada (30 units away from graduating). I feel like all lower-level core was useless. The upper level programming/business classes do seem useful, though I have had some classes where I feel everything is outdated and obsolete (aka the one I'm in right now- learning about PDAs...). Fortunately it seems like most of my classes are keeping up to date as much as possible, so I feel confident it all will pay off...we'll see.", "group_id": 95, "id": 262632}, {"user_id": 18408, "stars": [], "topic_id": 9446, "date_created": 1299180804.5956211, "message": "I have an Associates Degree in Network Systems Administration that I finished in 2008.  And I still haven't worked in the field.  All I have is my 7 years of Help desk experience. And at the moment can't get a job in either one.  Go figure..", "group_id": 95, "id": 262768}, {"user_id": 18456, "stars": [], "topic_id": 9446, "date_created": 1299182772.107873, "message": "I got my current job through connections I obtained in college, but I learned all of my day-to-day skills through experimentation. I'm Canadian, so I don't pay nearly as much as those down south; I was able to use my time to try my hand a starting a company, and while it didn't go anywhere it reafirmed that I want to be in the startup industry. I'd say college benefited me greatly, but I could have also probably done quite well without it.", "group_id": 95, "id": 263024}, {"user_id": 18456, "stars": [], "topic_id": 9446, "date_created": 1299186531.744657, "message": "@AroonUp currently working at a startup in Waterloo, but I was among the first batch of students at the UOIT (http://uoit.ca). I totally agree that tuition costs will skew this discussion. \n\nIf I had to pay $40-50k a year, I would have likely chosen to drop out after my second year; nothing against the UOIT, but unless you're looking for tech work in a larger company it doesn't seem as valuable as hacking around for 4 years.", "group_id": 95, "id": 263675}, {"user_id": 14970, "stars": [], "topic_id": 9446, "date_created": 1299185677.068938, "message": "@jskopek where are you located in Canada? Similar story on my end - I think the tuition costs would strongly skew the opinions for this thread. I think individuals are more inclined to take advantage pursuing education in places where a university education is cheaper.", "group_id": 95, "id": 263542}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299189190.591341, "message": "@dasmin5, @JeffSelf, everyone else that wants to go back to school.\n If you want to go back into it, AUDIT on MIT OpenCourseware. I am serious. Allow yourself 2 hours a day (minimum) and finish the following courses.\n\nhttp://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-00-introduction-to-computer-science-and-programming-fall-2008/\n\nhttp://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-001-structure-and-interpretation-of-computer-programs-spring-2005/\n\nhttp://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-046j-introduction-to-algorithms-sma-5503-fall-2005/\n\nAll 3 are introductory courses at MIT.\nThere are video lectures. WATCH THEM. It's really really important, no matter how well you think you know the material.\n\n If you find that you are actually having FUN doing this, even if you are bad at it, then keep at it. When you feel you really understand the material and when you can get 80% or more on the exams online, it's grad school time (if you are still up for it).\n\nProtip: Watch the lectures in Quicktime at 1.5x or 2x speed if you find the lecturer too slow. Make good use of jog shuttle in the player.", "group_id": 95, "id": 264233}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299190063.9005821, "message": "@jskopek Be aware of how much you subconsciously want to slack and be extremely aware of your passive resistance to cognitively tedious, difficult or frustrating problems. Then think about how all of us might get dementia one day and how this will postpone it.", "group_id": 95, "id": 264472}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299189433.7538149, "message": "@AroonUp. Yes. The amount of full ride scholarships in the u ess of izzay is tiny and anything but a full ride and the bill is hefty. However, if you're nuts enough to do a PhD, your tuition is waived in most cases, scholarships or not. They respect your insanity..\n\nIf I were to do this, I'd pick a school that looks like at has the most interesting courses online regardless of how hard they are. Then I'd try to learn as much about it before enrolling, so I don't bomb.", "group_id": 95, "id": 264312}, {"user_id": 18456, "stars": [], "topic_id": 9446, "date_created": 1299189943.47225, "message": "@megatron Any tips on how you paced yourself through those courses? I've tried to take a few OpenCourseware courses, but I find I always fizzle out after three or four lectures. I guess that's one thing that real college gives you - a reason to go to class every day.", "group_id": 95, "id": 264420}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299190357.882694, "message": "@jskopek OK, now more practical stuff. Understand that you simply must acquire a few THOUSAND hours of experience in anything to really learn it. Even college will not provide for enough hours.\n\n- Hit the pause button often and copy down all the problems to your notebook\n- Spend 5 minutes, even half an hour if it takes to try and solve the problem yourself before the professor solves it.\n- If you get stuck, watch the professor solve it only to the point where you are unstuck again.\n- Then try again.\n- If you do this a few times your brain will be in OVERDRIVE trying to understand the fucking problem and why is it that you are fizzling out or not fucking getting it. \n- Do the assigned homework right after watching the lecture. Do not wait to forget terms, concepts or lose mental reflexes associated with the lecture.\n\nTreat yourself like a Pavlov's dog. Give yourself a treat after a successfully finished lecture using the above method (+ homework, don't cheat). Grade your own homework and redo everything that you did wrong.\n\nThe first 5-6 lectures you will be making 9999999 stupid mistakes and cognitive errors, but then suddenly you will begin to \"get it\" it might take 10-12 lectures, but you will get faster and faster.", "group_id": 95, "id": 264543}, {"user_id": 17469, "stars": [], "topic_id": 9446, "date_created": 1299190400.080601, "message": "@jskopek and consume chocolate or other carb rich processed sugar crap while thinking hard, your brain will need it. especially if you haven't been doing it for a while.", "group_id": 95, "id": 264552}, {"user_id": 18456, "stars": [], "topic_id": 9446, "date_created": 1299190431.0811269, "message": "@megatron Wow. Thanks a ton! I'll definitely try to follow this advice.", "group_id": 95, "id": 264557}, {"user_id": 18408, "stars": [], "topic_id": 9446, "date_created": 1299239899.0841899, "message": "@megatron will give it a try.", "group_id": 95, "id": 269031}, {"user_id": 6165, "stars": [], "topic_id": 9446, "date_created": 1299242616.5521369, "message": "@biird Granted I got my degree in 1990 and the only programming courses I took then were COBOL and dBase.  Its probably changed a lot since then.  Which is why I'm thinking about getting my Master's in C.I.S.", "group_id": 95, "id": 269128}, {"user_id": 17469, "stars": [{"date_created": 1299268903.6242249, "user_id": 4375}], "topic_id": 9446, "date_created": 1299267336.6068251, "message": "@jskopek, @dasmin5 I really hope it works out for you... there's not enough hackers who understand the more theoretical side of CS", "group_id": 95, "id": 272120}, {"user_id": 18817, "stars": [], "topic_id": 9446, "date_created": 1299273928.580127, "message": "do it", "group_id": 95, "id": 272951}, {"user_id": 18889, "stars": [], "topic_id": 9446, "date_created": 1299301554.464747, "message": "I went to college for four years and have a B.S. degree, and I mean that in more ways than one. I spent a lot of money to learn very little. Most of the things they taught I had already self-taught. In fact, some web design classes there were still teaching people to use tables for web layouts... /facepalm.", "group_id": 95, "id": 275159}, {"user_id": 18889, "stars": [], "topic_id": 9446, "date_created": 1299301645.4549019, "message": "It *really* depends on the major though. College isn't for everyone, despite them trying to argue otherwise. However, for most professions, it's still needed.", "group_id": 95, "id": 275161}, {"user_id": 9108, "stars": [], "topic_id": 9446, "date_created": 1299425520.4432051, "message": "@biird I went through the same thing when I was in school. Even with the classes which seemed worthwhile, I didn't feel like they ever got in-depth enough to be really helpful. In my case, college basically provided a baseline for me to 1.) have some understanding of basic IS concepts and 2.) do some extra reading/research in areas that interested me for a much better understanding. At that point it was all about getting jobs, because you'll easily learn more working than you will in class.", "group_id": 95, "id": 280360}, {"user_id": 17488, "stars": [], "topic_id": 9446, "date_created": 1299464518.309299, "message": "@JohnFail Yep. I'm basically at the point now where I'm so close to finishing that I just want to get it over with. There is still some good basic coding knowledge I am getting out of some classes and will be out of the few classes I have yet to take, but not to the extent of the hours I put into all of this. Frustrating, but unless Google will take me now without the degree, I'll have to grind this last year out hoping the degree earns me something in the long run. Blehhh. College! Bad Economy! Fun!", "group_id": 95, "id": 283499}, {"user_id": 6716, "stars": [], "topic_id": 9446, "date_created": 1299501768.65149, "message": "Since when did college become a synonym for trade school? Explore deep thoughts, debate current events, date morally ambiguous women -- learn how to learn, think, discuss & write (hopefully in that order). The technical stuff will be dated within 18 months. In two years, you'll read about it in a \"for Dummies\" book.  Before you decide to drop out or not, figure out why you're going.", "group_id": 95, "id": 287197}, {"user_id": 15929, "stars": [], "topic_id": 9446, "date_created": 1299502993.8065381, "message": "@ae aah, sex drugs & rock `n roll... good times ;) seriously, i completely agree with you, sir. before you quit, you should ask those who finished and those who didn't. and more importantly, don't ask whether college is useful or not, ask them whether they'll trade their college experience with anything else...", "group_id": 95, "id": 287300}, {"user_id": 9108, "stars": [], "topic_id": 9446, "date_created": 1299549564.506289, "message": "@ae Good points, but I think students have to force themselves to take advantage of those opportunities, so it's definitely something to plan when attending. For instance, when I was in college I became a much better writer simply because I was interested in it. I took a lot of extra classes that pushed me to think critically and reflect that in my writing. On the other hand, it would have been easy for me to take cookie-cutter classes which did nothing but waste time and get me an easy 3 credits.", "group_id": 95, "id": 293036}, {"user_id": 25968, "stars": [], "topic_id": 9446, "date_created": 1301292284.6340599, "message": "If you like working for other people then college can be good. If you want to do your own thing you don't need anyone's approval, you just need the skills and know how. Get them any way you can, there are no rules when it comes to acquiring knowledge.", "group_id": 95, "id": 455598}, {"user_id": 9233, "stars": [], "topic_id": 9446, "date_created": 1301292979.034735, "message": "Go to college if you're not doing any else. Heck: go to college. Drop out if something is really that important that your time would be better spent somewhere else, even if just as a learning experience.", "group_id": 95, "id": 455622}, {"user_id": 11927, "stars": [], "topic_id": 9446, "date_created": 1301323333.4618261, "message": "College is the best 4 years ever. If you hate the classes the amount of people you will meet that will further your career is ridiculous", "group_id": 95, "id": 458218}]