[{"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313613079.028265, "message": "The PSR tells me, for example, that Act 1 of the IC throughline explores memory in terms of permission, need, expediency, and deficiency. Do the variations need to be dealt with in that order?", "group_id": 2515, "id": 1895295}, {"user_id": 7669, "stars": [], "topic_id": 43969, "date_created": 1313614965.761389, "message": "That's a good question -- my impression has always been that they're not listed in any particular order, it's just the \"group\" that needs to be dealt with in that act.", "group_id": 2515, "id": 1895533}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313614387.524051, "message": "Their order isn't arbitrary, if that's what you're asking.", "group_id": 2515, "id": 1895468}, {"user_id": 7669, "stars": [], "topic_id": 43969, "date_created": 1313615009.401495, "message": "After all, when you're dealing with variations, you're usually dealing with a comparison of values, not just one value at a time.", "group_id": 2515, "id": 1895537}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313617040.7629001, "message": "But, small changes in the storyform will change the order in which they are listed. @sandystone", "group_id": 2515, "id": 1895802}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313617887.9158871, "message": "The question I always have is that the book talks about comparing all the values -- which is six comparisons. I've always wondered how the list in the PSR was put together.", "group_id": 2515, "id": 1895882}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313620636.243067, "message": "i've noticed too that the order changes depending on the storyform. I believe the order has value. But I also believe that report should be removed :)", "group_id": 2515, "id": 1896225}, {"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313640140.929816, "message": "@Jim Hull: Why removed?", "group_id": 2515, "id": 1898674}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313647724.2624259, "message": "Because it needlessly confuses people. Theoretically it's mind-blowing, but practically I think it stalls the writing process.", "group_id": 2515, "id": 1899827}, {"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313648825.192837, "message": "I've been using it at the recommendation of Dramatica for Screenwriters. It's definitely slower, and I'm not sure how effective it is (still in the thick of it). I'm pretty green with Dramatica in terms of applying it. Thar said, would you mind sharing your dramatic process, i.e. how you go from software to first draft? If it's something you don't want to reveal, no sweat. But if you're open to it, I'd love to hear how someone else implements the theory in a practical sense.", "group_id": 2515, "id": 1899916}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313663814.3559389, "message": "The section in Dramatica for Screenwriters on the PSR offers the best explanation I've seen of how to apply it (he generates a script idea for a story about computers gaining a conscience). And yes, the order matters (according to the theory).", "group_id": 2515, "id": 1900745}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313693729.836426, "message": "From the book: Z Pattern -- [Dynamic Term] -- There is a relationship between the function of dramatic items and the order in which they interact. Changing the order can drastically affect how an audience interprets the meaning of events and information. For example, if a person makes a rude comment and is slapped, an audience will react differently than if a person is slapped then makes a rude comment. One of the ways in which drama is built is to control the order in which events happen....", "group_id": 2515, "id": 1903785}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698529.726495, "message": "I think more important is the Main Character's Problem, their Resolve, the Objective Story Outcome and whether or not there is a Story Limit. Miss these things, or leave them out entirely and the story will suffer.", "group_id": 2515, "id": 1904317}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698526.915509, "message": "Now the same could be said for Dramatica as a whole, but I think when one brings up the PSR, they're getting to a level of detail that really doesn't have an effect on the story's meaning. In other words if you do show the Main Character's Signpost of Understanding as it relates to Prediction before how it relates to Fate, is it really going to affect what the story means in the end?", "group_id": 2515, "id": 1904316}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698710.4679029, "message": "Things got better when I actually started writing. Partly because I had this base of knowledge in how stories should be constructed (based on my experience with the Query System) but also because I was actually writing. The end product is the story, so actually making one increased my understanding of the theory which improved the writing and so on.", "group_id": 2515, "id": 1904351}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698889.7011859, "message": "The only thing I forced was the MC into a Be-er position. Mostly because I always write Do-ers and wanted the challenge of writing something different.", "group_id": 2515, "id": 1904365}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698182.234751, "message": "So I think Dramatica for Screenwriters is great - Armando is brilliant and the technique he has for working with the PSR is really compelling...BUT I have noticed that often times people new to Dramatica get so wrapped up in trying to follow the PSR -- an extremely detailed report -- that they completely skip over bigger more essential parts of the theory and how it applies to their story. I think what he presents in the book is detrimental to some because it is so \"how-to\", and comes off as _the_ way to work with Dramatica.", "group_id": 2515, "id": 1904280}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698329.6302531, "message": "I have used the PSR to plan out a couple of scripts. I have noticed how intuitive it is - scary intuitive. But I have _always_ ended up with way too much material and an almost mechanical feel to the final product because there is so much ground to cover. It's not like encoding the Main Character's Problem once per Act, or throwing in an Objective Story Inhibitor when you want to slow things down, it's 48 some-odd scenes that kind of take over for an Author's intention.", "group_id": 2515, "id": 1904302}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698848.9980431, "message": "Now I rarely use the Query System at all. When I'm approached with an idea for a story or an adaptation I go through and try to decide what the key moments are, what story points need to be told and what appreciations those points fulfill. For instance in my latest project it was REALLY clear that the original source material's Story Goal was Understanding. Blatantly clear. I made that the first choice and then worked backwards from there. I knew it had to be a happy ending (Success/Good), Linear Problem-Solver (always) and that the MC was a Change character.", "group_id": 2515, "id": 1904363}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313698628.8894269, "message": "As far as answering your question about my own process of working with Dramatica, it has evolved over the years. When I first started I would go through all 350 questions of the 3rd Level of the Query System. Partly because I'm obsessive but mostly because I found each question fascinating and insightful. I would write a bunch of synposes and outlines, but I never actually wrote.", "group_id": 2515, "id": 1904333}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313699088.5460899, "message": "So I use a combination of the Theory Browser and Story Engine Settings to nail down the story, I print out the Story Engine Settings report, save it to my Dropbox so I can always access it on my iPhone and then I close Dramatica. No real reason to use it anymore. Instead I open up Screenwriter and start writing. If I get stuck or feel like a scene is heading south, I check the Story Engine Settings report and quickly I'm back on track. It's almost like that report is keeping me from chasing down rabbits, keeping me on the straight and narrow. Some writers like that, and I suppose if I was writing strictly for fun or a hobby I would do that, but I prefer knowing what it is I'm trying to say.", "group_id": 2515, "id": 1904398}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313705068.6654639, "message": "I want to reinforce one thing you said: Armando's suggestion, while very good, is not the only way to use the PSR, nor what it was designed to do.", "group_id": 2515, "id": 1905100}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313709101.183099, "message": "I'm coming back to reinforce something else  @jimhull said: the most important thing is knowing what you are trying to say. A lot can be forgiven if that is clear.", "group_id": 2515, "id": 1905395}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313709810.2234609, "message": "Just to be clear, the book I quoted above was Dramatica, not Dramatica for Screenwriters. And I agree that the PSR can have a diminishing return effect if you get too wrapped up in it.", "group_id": 2515, "id": 1905457}, {"user_id": 36437, "stars": [], "topic_id": 43969, "date_created": 1313710560.6576929, "message": "I think @jimhull meant theme browser, not theory browser, for future reference.", "group_id": 2515, "id": 1905504}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313710558.937624, "message": "The thing that I have wished for since reading that text (last year) was an example that wasn't confined to such a tight sequence -- a comment and a slap are instantly on top of each other, and we can imagine it easily.\n\nWhat is an example of Fate preceding Prediction vs. Prediction preceding Fate over the course of a chapter, or two, or four?", "group_id": 2515, "id": 1905503}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313710684.757674, "message": "I have a theory browser that lets me flip between saving cats, taking heros on journeys, or exploring a problem from various perspectives. Pretty cool.", "group_id": 2515, "id": 1905512}, {"user_id": 36437, "stars": [], "topic_id": 43969, "date_created": 1313713651.4128759, "message": "lol Mike. What, no building blocks?", "group_id": 2515, "id": 1905773}, {"user_id": 7645, "stars": [], "topic_id": 43969, "date_created": 1313712451.0500829, "message": "Lol yes THEME browser", "group_id": 2515, "id": 1905655}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313713992.1241939, "message": "baffelled? That would be \"baffled\" to all y'alls.", "group_id": 2515, "id": 1905813}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313713952.9133329, "message": "Totally have building blocks. And vector charts. There's a Vladimir Propp section. I'm baffelled by the semeiotics -- it only wants metaphors and syntactics. And one function just opens and expects you to write a movie is 21 days. After that, it closes, locks and mails the script to CAA.", "group_id": 2515, "id": 1905805}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313714825.0224569, "message": "Aaargh!\n\nWhat's the snowflake?", "group_id": 2515, "id": 1905885}, {"user_id": 36437, "stars": [], "topic_id": 43969, "date_created": 1313714657.586452, "message": "Pretty sure you forgot the snowflake.", "group_id": 2515, "id": 1905866}, {"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313730038.7576849, "message": "Thanks, everyone. This is very helpful.", "group_id": 2515, "id": 1907760}, {"user_id": 36437, "stars": [], "topic_id": 43969, "date_created": 1313730981.643595, "message": "@travelingleonards, apologies for the thread-jack.", "group_id": 2515, "id": 1907853}, {"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313732472.257678, "message": "@Bee Not at all. The occasional tangent is often necessary.", "group_id": 2515, "id": 1908013}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313751904.2255621, "message": "And wouldn't ya know it, there's even a software program to go with it: Snowflake Pro.", "group_id": 2515, "id": 1909059}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313751769.047147, "message": "@MikeDerk: http://www.advancedfictionwriting.com/art/snowflake.php", "group_id": 2515, "id": 1909049}, {"user_id": 37168, "stars": [], "topic_id": 43969, "date_created": 1313900899.8221121, "message": "@MikeDerk What else can the PSR be used for?", "group_id": 2515, "id": 1920770}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313949885.3660669, "message": "At its best, it can add real depth to the dialog and characters.", "group_id": 2515, "id": 1923566}, {"user_id": 38500, "stars": [], "topic_id": 43969, "date_created": 1313949824.7526319, "message": "Once I've sketched out a signpost chapter or scene, I use the \"in terms of\" items to color the dialog, keeping in mind that even in the case of the SS throughline, any character (other than the MC and IC, based on their dimensions, and as long as it is relevant to the SS relationship) can take up one of the \"in terms of\" items. I think it's very effective.", "group_id": 2515, "id": 1923553}, {"user_id": 7664, "stars": [], "topic_id": 43969, "date_created": 1313981565.1740971, "message": "@travelingleonards I have no idea. Something, I'm sure.", "group_id": 2515, "id": 1926782}]