[{"user_id": 17621, "stars": [], "topic_id": 19563, "date_created": 1302841502.8678401, "message": "Oh and why.. Blacking it Up because it's funny, political and well black. NPR Pop Culture because it's NPR voices saying things I find amusing, Nerdist for the awesomesauce interviews and Comic Racks because I love hearing talk about comic books and English accents.", "group_id": 7889, "id": 695702}, {"user_id": 17610, "stars": [], "topic_id": 19563, "date_created": 1302842223.858439, "message": "I like listening to tech news so some of my favorite podcasts are Buzz Out Loud, This Is My Next Podcast and All About Android.  I also like fan podcasts about my favorite TV shows like Being Human Cast, Doctor Who: The Eleventh Hour Podcast and Sci-Fi Party Line.", "group_id": 7889, "id": 695765}, {"user_id": 17621, "stars": [], "topic_id": 19563, "date_created": 1302841431.6653171, "message": "Blacking it Up, NPR Pop Culture Happy Hour, Nerdist, Comic Racks are my tops", "group_id": 7889, "id": 695690}, {"user_id": 25705, "stars": [], "topic_id": 19563, "date_created": 1302881235.884516, "message": "Depending on the guests I listen to Nerdist and TWiT most often.", "group_id": 7889, "id": 701542}, {"user_id": 17610, "stars": [], "topic_id": 19563, "date_created": 1302889363.3320839, "message": "@geekwhisperer I was so excited about the Nerdist interview with Matt Smith from Doctor Who.  But then Chris and his friend talked more than Matt did!  It turned me off in a big way.  I like a lot of podcasts on the TWIT network, too.", "group_id": 7889, "id": 703065}, {"user_id": 25705, "stars": [], "topic_id": 19563, "date_created": 1302891324.3532491, "message": "@dustdaughter Chris is a little overpowering. He needs a strong personality to create a good episode. The recent interview he did with Xeni Jardin from BoingBoing was really good.", "group_id": 7889, "id": 703700}, {"user_id": 17610, "stars": [], "topic_id": 19563, "date_created": 1302892251.9410629, "message": "@geekwhisperer Maybe I'll check that one out. But really, when you have a guest like Matt Smith, you really need to let him do the talking.", "group_id": 7889, "id": 703897}, {"user_id": 25705, "stars": [], "topic_id": 19563, "date_created": 1302907882.534359, "message": "@dustdaughter Agreed.", "group_id": 7889, "id": 706448}, {"user_id": 17610, "stars": [{"date_created": 1302930268.9390571, "user_id": 25705}], "topic_id": 19563, "date_created": 1302922582.3163221, "message": "This makes me think of my biggest podcast pet peeves: 1) when all the hosts talk over each other; 2) when the host talks more than the guests; 3) when hosts talk about segues instead of *making* one.   @geekwhisperer", "group_id": 7889, "id": 708362}, {"user_id": 25705, "stars": [], "topic_id": 19563, "date_created": 1302930318.089119, "message": "@dustdaughter Agreed again. Just because someone is in the position to do an interview, doesn't mean they are good at it.", "group_id": 7889, "id": 709002}]