[{"user_id": 11626, "stars": [], "topic_id": 6739, "date_created": 1297915915.2425251, "message": "Two future soldier combat uniform concepts were demonstrated to members of the US congress recently - a vision of what the American soldier will be wearing in 2010 and ten years hence in 2020. Both systems look straight out of a science fiction movie, with the 2020 concept bearing more than a passing resemblance to Star War's Darth Vader.\r\n\r\n    * A mannequin displays the 2010 suit\r\n    * Future Warrior Suit 2020\r\n    * A screendump of the heads up screen showing the physiological status of the soldier\r\n\r\nThe two new uniform systems are being developed under the Future Combat System Program and include a weapon, head-to-toe individual protection, onboard computer network, soldier-worn power sources, and enhanced human performance.\r\n\r\nThe 2010 Future Force Warrior system will meet the more immediate, short-term demands of the battle space and leverage all the technologies and lessons learned from Afghanistan and Iraq. Soldiers deployed to Afghanistan and Iraq carry large amounts of external weight, often 55 kilograms or more, to be battle-ready while the new uniform system weighs just 22 kilograms.\r\n\r\nThe body armor of the new uniforms will absorb the shock of a bullet much better than current bulletproof vests. The shell-like body armour has been stood off of the body by 5cm, so if the soldier is shot, the force is more evenly distributed to decrease injuries such as broken ribs.\r\n\r\nSoldiers will be able to chat online with each other while they are walking down a jungle trail. The new system has the ability for each soldier to be tied into tactical local and wide-area networks with an onboard computer that sits at the base of the soldier's back. \"We essentially call the 2010 soldier an 'F- 16 on legs' because it gives the soldier the same capabilities as they would normally have on aircraft and other platforms,\" explained Jean-Louis DeGay of the Soldier Systems Centre.\r\n\r\nSoldiers will also be able to share data with vehicles, aircraft and other individual soldiers. \"If an Apache helicopter was deployed forward and recorded real-time video of the enemy, the helicopter can send the video back to an individual soldier to observe,\" DeGay said.\r\n\r\nA heads-up dosplay drops down from the helmet giving the soldier the equivalent of a see-through 17-inch computer monitor displaying anything relayed to the soldier. This allows soldiers to take in all supporting data while keeping both hands on their weapons.\r\n\r\nSoldiers wearing the new system will have no need for an external microphone to communicate. \"The helmet has sensors that register vibrations of the cranial cavity so I don't have to have a microphone in my mouth. That allows the soldier to control the entire computer via voice-activation,\" DeGay explained. Soldiers will be able to cycle through onboard menus via their eyewear device.\r\n\r\nThe onboard computer will monitor soldiers' overall physiological picture of how they are performing in the battle zone. \"Warrior Physiological Status Monitoring System gives the soldier's body core temperature, skin temperature, heart rate, whether the soldier is standing or prone, and how much water the soldier has drunk,\" DeGay said.\r\n\r\nA medic, who can be miles away, will now be able to diagnose and treat a soldier who is about to have sunstroke, without even physically seeing the soldier. \"So a medic can see how the soldier's core body temperature is rising (and) heart rate is falling, and the soldier then knows to go directly to the medic for treatment,\" DeGay said. \"The computer will drop down a map to direct the soldier where to find the medic for help.\"\r\n\r\nHe pointed out that with the new system commanders will be able to consider each soldier, aircraft and vehicle as part of a node of a tactical network that shares data with each other, sending and receiving data inside the battle space.\r\n\r\nThe second uniform system, the Vision 2020 Future Warrior concept, will follow the 2010 Future Force Warrior with more advanced nanotechnology.\r\n\r\nNanotechnology deals with the creation of incredibly small materials, devices or systems with a scaled-down size of 100 nanometers or less. A nanometer is a metric measurement equivalent to one billionth of a meter.\r\n\r\n\"If we were in Detroit, the 2020 Future Warrior system would be the concept car. It leverages a lot of the nano-work being done by the Massachusetts Institute for Technology,\" DeGay said, noting the Army just awarded MIT a five- year, US$50 million program to establish the Institute for Soldier Nanotechnologies.\r\n\r\nThink about a good action movie that shows an average person walking down a street with a nice designer suit. All of a sudden, gunshots are heard and just before a bullet hits this person, his soft fabric suit transforms into an incredible display of alien armor that deflects bullets. If Natick engineers are successful, this movie will become a reality in the future U.S. Army.\r\n\r\n\"What we hope to gain from this program is body armor that wears like a traditional textile impregnated with nanomachines connected to an onboard computer, DeGay explained. \"So when you shoot a round into the uniform system, it's normally pliable until it senses the strike of a round -- it becomes rigid, defeats the strike of the round and becomes soft again.\"\r\n\r\nA shortcoming of traditional body armor is that it can only absorb so many strikes from machine-gun rounds. \"When you have a uniform with this new nanotechnology, it can absorb unlimited numbers of machine-gun rounds,\" DeGay pointed out.\r\n\r\nAnother potential development is inserting \"nanomuscle fibers\" that can actually simulate muscles, giving soldiers more strength. Fabric is impregnated with nanomachines that create the same weight, lift and feel as a muscle. \"So I coat the outside of the armor with a nanomuscle fiber that gives me 25 to 35 percent better lifting capability,\" DeGay explained.\r\n\r\nThe uniform from the waist down will have a robotic-powered system that is connected directly to the soldier. This system could use pistons to actually replicate the lower body, giving the soldier \"upwards of about 300 percent greater lifting and load-carriage capability,\" DeGay said. \"We are looking at potentially mounting a weapon directly to the uniform system and now the soldier becomes a walking gun platform.\"\r\n\r\nThe Future Force Warrior is the Army's short-term change, with a complete rebuild of the soldier from skin out being planned through the Future Warrior system. \"We are already starting to look at the 2020 Future Warrior concept, which is integrating stuff that is just starting to show promise in the lab,\" DeGay concluded.\r\n\r\nHe said researchers hope to see this developing technology mature in the next 15 to 20 years. \"Future Warrior is a visionary concept of how the individual warrior may be equipped in the 2015-2020 timeframe,\" he said.\r\n\r\nhttp://www.gizmag.com/go/3062", "group_id": 3920, "id": 129335}]