[{"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306751140.50964, "message": "Doing some storyforming. Main story point is that the OS characters have seen something, or were seen seeing something. Because of that, the action everyone has to take changes.\n\nInitially, I was thinking of an OS throughline of Activity, but Situation feels better to me because they are all thrown into this change of action by what they saw, or what they know others saw. They can't get out of this - it's too important.\n\nI chose a OS Concern: Past. Again, this feels right because most of what happens, and the story outcome, is because of what they all saw.\n\nThe end result is that the Protagonist and friends win, by making people aware of what they saw, thereby stopping something happening.\n\nI would saw I'm 90% confident of the OS Concern: Past for my story. However, I can't work out how Story Goal: Past fits in with this. \n\nWhat am I missing here?", "group_id": 2515, "id": 1225966}, {"user_id": 7645, "stars": [], "topic_id": 37371, "date_created": 1306766361.5481081, "message": "By making everyone Aware they are Honoring the Past, perhaps finishing what others started. Or maybe by making everyone Aware they are Avenging the Past. Or maybe by seeing this they release ghosts from the Past, and by making everyone Aware they are returning things to the way they were (The Past). Something like that?", "group_id": 2515, "id": 1227844}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306767597.036752, "message": "When you put it like that, now I am questioning my choice of concern. Your examples are clear, but in my story the past has no future importance. What I mean is, the story hinges on what they all saw, but once the story comes to a conclusion, that point in time is not important.", "group_id": 2515, "id": 1228078}, {"user_id": 10814, "stars": [], "topic_id": 37371, "date_created": 1306772517.7019849, "message": "It could also be about sharing a bit of history, or confirming a bit of history, or if it is something like a courtroom drama, revealing what happened during that past event.", "group_id": 2515, "id": 1228745}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306782617.2425261, "message": "Hmmmm..... This could be me going down the wrong path. The relevance of this event is not necessarily referred to at the end, other than it is what gets them all to the end in the first place.\n\nI suppose a good comparison to the story idea is a typical Columbo film. Everything occurs because of what a witness saw, no-one else believes there was a murder except Columbo, who sees clues others don't and eventually solves the crime. \n\nSo the past event drove everything, it was that that made the story. But at the end, Columbo solves the crime because of some present element, the witness is not important now.", "group_id": 2515, "id": 1230046}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306786381.3623371, "message": "I wouldn't say anything different is going on, but the storyform of the POV's in each I've not pinned down yet. Reason for the topic was very much because I started with the OS throughline and concern, was very confident abotu my selections, until I took into account this was also the Story Goal..", "group_id": 2515, "id": 1230751}, {"user_id": 7664, "stars": [], "topic_id": 37371, "date_created": 1306785594.3349481, "message": "What is going on in the other storylines?", "group_id": 2515, "id": 1230545}, {"user_id": 10814, "stars": [], "topic_id": 37371, "date_created": 1306853930.6276231, "message": "Columbo stories are about \"Who dunnit?\"  They are about what happened.  Remember, all four TYPES will appear in the plot, one per act, so EVERYTHING isn't about the past, but the goal is to figure out what happened and why.  That is not to say that all of them are about the past.  Some might have a past event start things off (inciting event), but go on to explore entirely different areas.", "group_id": 2515, "id": 1238087}, {"user_id": 7645, "stars": [], "topic_id": 37371, "date_created": 1306858745.0247281, "message": "Before Sandy says it, the Past may be your Benchmark ;)", "group_id": 2515, "id": 1238604}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306856404.5754399, "message": "Right, yes. That makes sense. In fact, that sounds like a key difference between my story and Columbo. From what the characters see in my story, it's clear what happened (why not so important), but also what it will mean for everyone unless they do something about what that tells them.\n\nI think I've made a mistake in how I view OS Concern, perhaps taking it too literally. Initially, I thought Past because they would all be thinking about what they saw. But actually, what matters is how what they know affects the future, and also what it forces them to do in the present.", "group_id": 2515, "id": 1238309}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306862049.023108, "message": "Funnily enough, looking at the Benchmark and Consequences may have made this simpler. The Benchmark probably has to be either Present or Progress, because the Protagonist needs to survive to achieve the goal. This pretty much makes Future the Concern.", "group_id": 2515, "id": 1239051}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1306913011.7182879, "message": "THE PAST MAY BE YOUR BENCHMARK!!!!!  There, someone had to say it.", "group_id": 2515, "id": 1250871}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306919804.6017821, "message": "I think this forum has an echo....... (and a very loud one!)", "group_id": 2515, "id": 1251538}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306931263.1627929, "message": "Just been looking at some Dramatica examples with Past as Benchmark. As much as I understand the reason why Past is important in each case, I find it hard to visualize how something that can and won't change is a Benchmark. An example:\n\nFrom The Verdict:  \" Frank must find out what REALLY happened to Deborah Ann Kay;  \"\n\nClearly what happened in the past is significant, but anything we discover about that moment is present knowledge. So as a benchmark, would it not be 'what I know now about what happened in the past?'.\n\nOr is that what Past means in Dramatica terms - 'a present appreciation of the past' ?", "group_id": 2515, "id": 1252466}, {"user_id": 10814, "stars": [], "topic_id": 37371, "date_created": 1306949399.8759069, "message": "Always go with the Dramatica definitions to understand the Dramatica use of the terminology.", "group_id": 2515, "id": 1255751}, {"user_id": 33839, "stars": [], "topic_id": 37371, "date_created": 1306947054.5311899, "message": "I think you need to come to a conclusion as to how you want to deal with the dilemma before going any further.  Did the OS characters see something (obviously yes);  Are the OS characters aware of the potential implications of what they saw (it doesn't sound like it);  Do OS characters know they were seen by others as the event occurred? (seems unlikely, since the protagonist needs to make them aware).   I'm not sure how everyones actions change unless you can specify what the actual dilemma is because it's not clear what the problem is?  That make sense?", "group_id": 2515, "id": 1255483}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1306950220.0037031, "message": "Yes, appreciate that. I still sometimes find it hard to 'forget' the meaning I might normally place on a word (and having taught English, Past, Present, Future have a whole other meaning to me!). I've re-read the Dramatica description (a number of times) and think I've  got it clear now.", "group_id": 2515, "id": 1255842}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307000754.3414929, "message": "Re. the symbology, yes, what they see forces them to act because they know it means something may happen in the future.", "group_id": 2515, "id": 1264177}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307000765.0858021, "message": "Even before that ending, \"The Past\" creeps in more and more -- the human doll in the cave, the recitation of the scrolls, etc.  The Statue of Liberty is just the climax of that dynamic.", "group_id": 2515, "id": 1264180}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307001129.8501911, "message": "This will be the first storyform where I've actually considered the Benchmark....... I've always just let it fall in to place before.", "group_id": 2515, "id": 1264195}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1306999110.3125429, "message": "Often when Past is the Benchmark, there is a very clear symbol of \"The Past\" that either emerges near the end of the story, or it's been around the whole time but the perception of it changes significantly near the end of story.", "group_id": 2515, "id": 1264033}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1306998887.739892, "message": "@Mikeaja: \"As much as I understand the reason why Past is important in each case, I find it hard to visualize how something that can and won't change is a Benchmark.\"  The facts of what happened in the Past may not change, but its importance may, or the understanding of it may.", "group_id": 2515, "id": 1264020}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307000620.649945, "message": "Thanks Sandy. I like that Planet of the Apes example. So, as benchmark, I guess this is because this element from the past tells him he is on Earth. That makes sense.", "group_id": 2515, "id": 1264172}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307000899.8727789, "message": "Re. Apes, right, so these past elements all leading clues from the past to tell him / us it is Earth in the future.", "group_id": 2515, "id": 1264187}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307000904.6137929, "message": "Correction: OS Benchmark", "group_id": 2515, "id": 1264188}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1306999371.759197, "message": "So Mike, if you have a character or an object that clearly symbolizes \"The Past\" in your story that takes on greater and greater importance as the story progresses, then that may be your Benchmark.", "group_id": 2515, "id": 1264069}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001258.0445931, "message": "Sometimes picking the Benchmark directly will help you pick other appreciations, such as Action/Decision, or even Change/Steadfast.  Mental Sex and Outcome & Judgment are also connected to Benchmark.", "group_id": 2515, "id": 1264209}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1306999142.566792, "message": "One of my favorite examples is the Statue of Liberty in Planet of the Apes.  (Oops, did I just give away the ending?)", "group_id": 2515, "id": 1264036}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001181.582972, "message": "Well, you have to be sure it's consistent with the rest of your storyform!", "group_id": 2515, "id": 1264200}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307000555.576376, "message": "Of course, the same could be said for other Benchmarks -- e.g., a wilting flower or an aging character that takes on increasing significance in the story could symbolize a Benchmark of \"Progress\", etc.  You mention this:  \"what matters is how what they know affects the future, and also what it forces them to do in the present\" -- I'm curious what the latter part of that means exactly.  If there's some strong symbology associated with \"what it forces them to do in the present\", then it's probably a good candidate for Benchmark.", "group_id": 2515, "id": 1264169}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307000804.182662, "message": "So, learning to live more in the moment is often an indicator of \"The Present\".", "group_id": 2515, "id": 1264182}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307000883.7906289, "message": "Whether it's an individual (i.e., as a MC Benchmark) or as a community (as an OC Benchmark).", "group_id": 2515, "id": 1264186}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307001515.122102, "message": "I'll have to try from this point. I do like re-doing storyforms, starting from a different point to see if I end up at the same one.", "group_id": 2515, "id": 1264234}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001881.9159369, "message": "It's coming!  :-D", "group_id": 2515, "id": 1264253}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001639.471267, "message": "Me too ... because that really helps to validate that you're on the right track (assuming that you are)!", "group_id": 2515, "id": 1264243}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307001826.947248, "message": "I haven't found the 'Write my perfect story' report yet though (with option 'Ready for Hollywood' selected). Hopefully in the next release!", "group_id": 2515, "id": 1264250}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001906.3061521, "message": "By the way, Mike, you might want to try selecting \"The Past\" as your OS Signpost 1, and see what happens.", "group_id": 2515, "id": 1264254}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307001923.0944641, "message": "Because as Chris mentioned earlier, that may be your inciting incident.", "group_id": 2515, "id": 1264257}, {"user_id": 30951, "stars": [], "topic_id": 37371, "date_created": 1307002178.806855, "message": "Right, yes, will try that. I've did the first version of my last storyform by starting with the plot progression choices. It actually makes a lot of sense to select the area of the inciting incident, given it's importance in this story.\n\nDoes it make sense that it is Past, even though at the point of the incident it is in the present (it not a past object like Apes)? Or can it be past because after seeing it, it drives and continues to drive all the characters?", "group_id": 2515, "id": 1264276}, {"user_id": 7669, "stars": [], "topic_id": 37371, "date_created": 1307002531.2632179, "message": "You know, I can't really answer that without knowing your story a little better.  But for instance, if we see the crucial incident take place in a flashback-style prologue, and then we jump to \"the present\" where that incident then affects the principal characters, then yes, you can count \"The Past\" as the first Signpost.", "group_id": 2515, "id": 1264318}]