[{"user_id": 11626, "stars": [], "topic_id": 7689, "date_created": 1298231955.703321, "message": "http://www.rawstory.com/rs//wp-content/uploads/2011/02/kochbrothers1.jpg\r\n\r\nWho were among the financiers behind Wisconsin's Republican Governor, now embroiled in a controversial attempt to destroy public sector unions?\r\n\r\nNone other than reviled tea party financiers Charles and David Koch, is who.\r\n\r\nTurns out, the billionaire oil tycoons' political action committee gave Gov. Scott Walker (R) roughly $100,000 in campaign contributions during the 2010 election, according to campaign finance records highlighted by Mother Jones.\r\n\r\nThe contributions came from the same source -- Koch Industries PAC -- and though through two channels which were both legal under current campaign finance law.\r\n\r\nAbout $43,000 worth of PAC monies went directly to Walker's campaign, while the Republican Governors Association (RGA) sent $65,000 from the PAC to Walker.\r\n\r\nWisconsin's governor also received help from the RGA by way of a $3.4 million ad buy on television and direct mail attacks against his political opponent, Milwaukee Mayor Tom Barrett.\r\n\r\nWhat's more, it's not just the Koch presence behind the governor that's got some worried: it's that the bill causing so much strife is virtually pulled from the tycoon brothers' own playbook.\r\n\r\n\"Koch-backed groups like Americans for Prosperity, the Cato Institute, the Competitive Enterprise Institute, and the Reason Foundation have long taken a very antagonistic view toward public-sector unions,\" Mother Jones noted. \"Several of these groups have urged the eradication of these unions. The Kochs also invited Mark Mix, president of the National Right to Work Legal Defense Foundation, an anti-union outfit, to a June 2010 confab in Aspen, Colorado;\" .\r\n\r\nA similar bill was being considered in Ohio, where it drew a similar reaction from workers.\r\n\r\nBy pulling collective bargaining rights away from the unions, that's exactly what they'd be doing: effectively eradicating them. All leverage the workers have over management would be ended.\r\n\r\nAs if the connection weren't clear enough, the Koch brothers front group Americans for Prosperity produced a website called standwithwalker.com, encouraging people to support elimination of labor union rights.\r\n\r\nJust over 24,000 had signed the Koch brothers' petition at time of this story's publication.\r\n\r\nhttp://www.rawstory.com/rs/2011/02/19/billionaire-oil-tycoons-financed-wisconsins-anti-union-governor-election-campaign", "group_id": 3920, "id": 154616}]