[{"user_id": 32891, "stars": [], "topic_id": 34921, "date_created": 1305189458.2747071, "message": "Testing..", "group_id": 9787, "id": 1022390}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305189677.363663, "message": "I get my opinion on that from Ephesians 4:11... hope I'm not ripping things out of context :)", "group_id": 9787, "id": 1022414}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305189747.995611, "message": "From experience I would say they definitely continue. I've have experienced prophecy, interpretation healings and even have to testimonies from two people directly involved in praying over people who where dead and were resurrected. The missionary world offers a whole new view :) My understanding of scripture is that it does not suggest cessation, but I haven't heard the contrary proofs yet. As you say @penkin 1 Cor 1 suggests continuation and at various points Paul talks about different gifts for different people", "group_id": 9787, "id": 1022423}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305190170.7983689, "message": "If I get some time I'll look at some scriptures too....Some of the people here attend cessationist churches....so come on guys let's hear the evidence for cessation. I really want to hear the scriptural backing. (note: I'm NOT being facetious!)", "group_id": 9787, "id": 1022497}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305189174.1238029, "message": "This topic can get heated but I am wondering where you stand on this. Have the spiritual gifts ceased or are they still active in the church?", "group_id": 9787, "id": 1022324}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305189334.441823, "message": "I'm not 100% sure where I stand on this yet. If I look at experience I'm inclined to think they have ceased. When I read scripture I can see the case made for them being continued. I have still yet to be in a group of Christians where someone has spoken in tongues and someone has interpreted.", "group_id": 9787, "id": 1022377}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305190647.801429, "message": "What I gather is that 1 Corinthians 13 talks about the gifts ceasing when \"the perfect\" comes which cessationists rate is the Bible. Continuists say the perfect is the return of Christ.", "group_id": 9787, "id": 1022551}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305189508.905359, "message": "@EdwinGarden Roger Roger, coming through loud and clear :)", "group_id": 9787, "id": 1022399}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305189487.9188471, "message": "1 Corinthians 1:3-8 seems to me to say that we should not lack any of the gifts while we are waiting for the return of Christ? I don't think however that we should expect all Christians to all operate in all the gifts?", "group_id": 9787, "id": 1022396}, {"user_id": 32891, "stars": [], "topic_id": 34921, "date_created": 1305189841.8230009, "message": "Ah there it is! I think that the gifts are still about, but the Spirit gives as is needed. I struggle to think that the gifts of faith, wisdom & discernment have ceased.. my 2 cents..", "group_id": 9787, "id": 1022436}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305190049.4833851, "message": "Let us then also consider the testimony of the church forefathers through the centuries who have witnessed and documented the miraculous signs that God brought about in their ministries. Just read about Smitth Wigglesworth! Amazing stuff", "group_id": 9787, "id": 1022480}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305189873.3111081, "message": "Speaking of healings: Just last week we prayed for a member of our Zambia team who was in a car accident. Doctors said his spine was severed and he would never walk. The day following the prayers the doctors changed their diagnosis saying the discovered the spine was actually NOT severed, but just damaged and he may see a full recovery...", "group_id": 9787, "id": 1022442}, {"user_id": 33028, "stars": [], "topic_id": 34921, "date_created": 1305189904.6052811, "message": "WOW! Thats awesome!", "group_id": 9787, "id": 1022454}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305190316.515151, "message": "Our elders at Antioch are cessationists and I have spoken to Tim (our paster) but I need another meeting with him to fully get what he was saying.", "group_id": 9787, "id": 1022507}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305190503.4534039, "message": "Most times it does not seem to be what it is. People say their is tongues at their church but it's more like everyone babbling with no interpretation, nothing like the order Paul says it should be. Healing (like the one you spoke about above) don't seem miraculous. Not like a man not walking getting up and having full mobility like God had touched him to make him whole. Prophesy I have heard in church seem very un-prophetic. Simply saying things that I can see in the bible.", "group_id": 9787, "id": 1022532}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305190714.612463, "message": "What was the role of prophesy and what would it's role be now?", "group_id": 9787, "id": 1022561}, {"user_id": 14795, "stars": [], "topic_id": 34921, "date_created": 1305193759.1918731, "message": "Cessationists don't say the spirit doesn't still work miracles. What they say is that there is no case for gifts like powerful healing like Peter, people even expected the touch of his shadow to heal. You might pray and someone is healed, or not as God wills, but I have yet to see someone heal all and sundry that come to them. Cessationists still believe the spirit empowers and guides and grants faith and grace.", "group_id": 9787, "id": 1022919}, {"user_id": 14795, "stars": [{"date_created": 1305224851.840713, "user_id": 13817}], "topic_id": 34921, "date_created": 1305194705.1363039, "message": "I think generally, cessationists believe scripture, the canon of the bible to be God's greatest and most perfect revelation. No further revelation is to be given other than Christ and him revealed in the bible. therefore no further need for prophecy. Indeed, if that was still active why not add to the bible? Like the mormons and basically the Catholics... When another new prophet comes along like Mohamed or Joe smithy... Add to scripture. Or take away cause the prophet said so. Why don't we? Because the bible is final authority, and if it holds all we need to test against, why do we require a prophet? Just read the bible.", "group_id": 9787, "id": 1023102}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305194889.550818, "message": "@linton How would that tie up do you think with 1 Corinthians 1:7?", "group_id": 9787, "id": 1023133}, {"user_id": 14795, "stars": [], "topic_id": 34921, "date_created": 1305196689.3046761, "message": "adding to prophecy from the earlier post, Acts 11(?) talks of God bringing revelation only through his son, not the prophets any longer, and there is no greater record of that for us now than the bible... As for 1 cor 1:7 The word there doesn't necessarily imply miraculous endowments. But includes what the chapter speaks towards earlier, the kindnesses of God in producing peace of mind constancy humility, etc. This position is strengthened by the chapter talking about keeping firm to the end... Miraculous gifts like tongues and healing wont do that, Jesus is even  disparaging about signs and wonders as means of keeping people firm.", "group_id": 9787, "id": 1023470}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305197938.594902, "message": "@pevans_om I suppose that's where the argument comes in.", "group_id": 9787, "id": 1023676}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305198635.7332389, "message": "@pevans_om argument = debate", "group_id": 9787, "id": 1023733}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305213012.663496, "message": "Got this from @linton a while back if you want to have a read http://unboundedwords.com/blog/archives/109 :)", "group_id": 9787, "id": 1025363}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305213073.458369, "message": "Not sure if he read it yet since back then he told me he hadn't yet :)", "group_id": 9787, "id": 1025371}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305293988.3231061, "message": "So... are we all Cessationists then? :D", "group_id": 9787, "id": 1041249}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305297638.988023, "message": "I am a limited cessationist!", "group_id": 9787, "id": 1042196}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305358274.5498099, "message": "Let me reiterate my personal experience. Personal experience of healings, prophecies and even 2nd hand knowledge of resurrections (from sources I respect and trust, i.e. not wikipedia!) and more. If these are not from God then what are they? I believe the gifts continue and will continue until Christ returns again. But I am also FULLY in agreement with Paul. Our focus should never be on showy gifts and gifts that edify ourselves. Our focus must always be on Love. The gifts are given when God needs to give them and only to bring Him Glory. Let's not limit God!", "group_id": 9787, "id": 1050751}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305358433.0354309, "message": "@pevans_om I would not say you're the only one since you're not the one that believes the gifts are in operation :)", "group_id": 9787, "id": 1050760}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305357769.5331831, "message": "Having read through 1Cor 12-14 as well as that Blog post I must say that I am less a cessationist than ever! The writer of that Blog places the entire focus of the passage on the 1 Cor 13:8-10. That somehow the focus of what Paul is trying to say is that the gifts will cease (Yes he does say that in those verses). But if you read the 3 chapters together as a whole it's pretty clear that Paul is trying to deal with UNITY. This has nothing to do with gifts being available or not. It's clear to me that the church in Corinth were struggling (as some of our evangelicals have recently) with that fact that some were claiming superiority because of certain gifts - i.e speaking in tongues. Paul wants to remind them that LOVE is the most important gifts. In this context the comment about when 'completeness' comes can only mean to me the completeness of the ultimate plan of Love. Where does Paul ever mention ANYTHING about this being ANYTHING to do with scripture. It's about LOVE! And the ultimate culmination of God's Love is when we are united with him. One verse of scripture does not make a doctrine and more especially when it is used so badly out of context. Am I the only one that sees this?", "group_id": 9787, "id": 1050745}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305358777.5417221, "message": "@pevans_om I don't think anyone is saying miracles don't happen. My understanding is that a gift is something that a person almost possesses. Like if I had the gift of healing I could and would be going around healing people. That was my gift. At least that's how I understand the continuist side.\n\nThe way I understand the cessationist side is that I can pray and God could work a miracle and heal someone or not. It is not something I possess? Like  @LintonCaldecott has said above \"Cessationists don't say the spirit doesn't still work miracles.\"", "group_id": 9787, "id": 1050761}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305359406.7952471, "message": "Ok, yes I can see that. I can understand that. But if the Spirit can still move does he not still move through individuals. That's all the gifts are. The Holy Spirit at work through individuals. \n\n\"Now to each one the manifestation of the Spirit is given for the common good. 8 To one there is given through the Spirit a message of wisdom, to another a message of knowledge by means of the same Spirit, 9 to another faith by the same Spirit, to another gifts of healing by that one Spirit, 10 to another miraculous powers, to another prophecy, to another distinguishing between spirits, to another speaking in different kinds of tongues,[a] and to still another the interpretation of tongues.[b] 11 All these are the work of one and the same Spirit, and he distributes them to each one, just as he determines.\" 1 Cor 12:7-11\n\nInteresting that Paul lists Faith as a gift of the Spirit and in Romans he lists Mercy. These gifts are all just manifestations of the Spirit in the lives of individuals.", "group_id": 9787, "id": 1050809}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305392043.4308541, "message": "although, this implies, if the gifts have truly ceased, that teaching is no longer a gifting, and something that just anyone can pick up", "group_id": 9787, "id": 1053444}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305392313.8872161, "message": "the point is that this passage describes not a popcorn style miracle working through individuals, rather a specific gift to a specific individual. I have never seen a person that can be called a prophet, not if we go by the rules to determine whether a prophet is truly one or not. Nor have I really encountered a person with the GIFT of healing...", "group_id": 9787, "id": 1053470}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305391861.960979, "message": "The gifts are more than that, it is suggested that they are given to individuals specifically, and not all individuals would receive every gift. It's not the same as a miraculous working as your experience describes, rather a person would be identified as a healer, prophet... etc.", "group_id": 9787, "id": 1053435}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305392012.4369979, "message": "Romans 12 6Since we have gifts that (A)differ according to the grace given to us, each of us is to exercise them accordingly: if (B)prophecy, according to the proportion of his faith;\n\n 7if (C)service, in his serving; or he who (D)teaches, in his teaching;\n\n 8or he who (E)exhorts, in his exhortation; he who gives, with [a](F)liberality; (G)he who leads, with diligence; he who shows mercy, with (H)cheerfulness.", "group_id": 9787, "id": 1053443}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305444034.1475999, "message": "But then aren't we totally misunderstanding the nature of the 'gifts' perhaps? Jesus instructs his disciples that they would be able to do even more than He did. The Pentecost comes and suddenly they're all performing miracles and speaking different languages. Then Paul comes along, finds a church in Corinth that's bickering over which is the most important gift and he tries to get them to stop focusing on the showy miracles and rather focus on love. And then WE come along and read his words and start saying, ja well now the gifts have ceased. Meh. Healing, prophecies etc were ALWAYS the work of God's Spirit. If He chooses to do it through individuals or through corporate prayer is his choice. Again I say, let's not limit God to our own understanding. The offshoot of cessationist belief is then to condemn anyone with a healing or prophetic ministry. And what of teaching? And knowledge. No I think the idea is silly. I think God can work when He wants, how He wants and through whomever He wants and He's not going to limit Himself by what Paul said (But of course cessationists believe those are God's words...)", "group_id": 9787, "id": 1058259}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305444945.2057509, "message": "A further thought. I really think we all have access to all the gifts because God's Spirit dwells within us and it is His Spirit that acts through us. Perhaps Paul never intended to suggest that people had a single gift for life. The passage can be just as easily understood if you think of the gifts as momentary. I lay hands and pray and the man is healed...Next time it may be you...Don't desire the showy gifts because they're not important. They fade. Focus on that which doesn't fade. Faith, Hope and Love. Funny that here we are 2000 years later focussed on the things that fade again", "group_id": 9787, "id": 1058323}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305463438.86588, "message": "@pevans_om interesting last point. Cause I used to attend a church that was very focused on spiritual gifts. It was even normal for a lot of them to run from experience to experience. That is the danger I see with a teaching that the gifts are out there. You just need to learn how. Hang with the pros. For me that was do confusing. Seemed like the \"experience of God\" was what was important. Like watching God's magic show.\n\nNot sure why you keep saying you don't want to limit God. As though some of us are? Maybe if you could explain how my position is limiting God I could explain it better maybe?", "group_id": 9787, "id": 1059570}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305538709.7290449, "message": "I still haven't seen any real adequate scriptural backing for a cessationist view", "group_id": 9787, "id": 1069241}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305538687.674886, "message": "The general cessationist view is a limitation of God. It says that God cannot gift someone with the ability to heal (for example) because some obscure reference to the 'perfection' is associated with scripture.", "group_id": 9787, "id": 1069238}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305544063.8724201, "message": "that's because you read the bible differently to the cessationists.", "group_id": 9787, "id": 1069575}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305552511.7954531, "message": "@pevans_om Ok. Maybe you could introduce me to a prophet or healer or <insert gift here> so I can speak to them and maybe ask them? I'd appreciate that. Maybe that would change my view?", "group_id": 9787, "id": 1070623}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305554427.6041291, "message": "@pevans_om I also know those. And they're not Christian. But I'm serious. I would love to chat to one so I can open this closed little mind. More on the crazy gift side like prophesy and healing. That would be awesome. No jokes.", "group_id": 9787, "id": 1071037}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305554521.437757, "message": "i met a prophetess... she turned out to be wrong... the back pain returned", "group_id": 9787, "id": 1071052}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305554531.96766, "message": "pitty she wasn't also a healer", "group_id": 9787, "id": 1071053}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305554933.0321889, "message": "@pevans_om how do you reconcile the idea that miraculous gifts are temporal per person, and the teaching is a gifting given to one person as a permanent thing?", "group_id": 9787, "id": 1071117}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305555808.6926539, "message": "So we have lots of examples of teachers and administrators... not so many of the healing prophet kind. None that I have seen... in fact. Not in the sense that they are healers like the teachers... permanently gifted. Few can deny that there are just some men that seem totally empowered to teach. Though, many of those would say that Joel Osteen is such a person...", "group_id": 9787, "id": 1071294}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305554665.1524019, "message": "@penkin I was serious too. Read 1 Cor 12 and you'll see Paul mixes those in with healers and prophets. I could introduce you to our Mozambican field leader if ever he's back in SA. He prayed for a dead woman (struck by lightening) and she was raised to life again!", "group_id": 9787, "id": 1071074}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305554340.3297751, "message": "@penkin What about a teacher? a Helper? An Administrator? I know a few of those too...", "group_id": 9787, "id": 1071016}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305554763.0849969, "message": "@LintonCaldecott And you didn't read what I said about my Mozambican friend...", "group_id": 9787, "id": 1071094}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305554721.1996369, "message": "@pevans_om, you're not reading what chris is saying... i think he wants to meet the miraculously gifted individuals...", "group_id": 9787, "id": 1071085}, {"user_id": 33006, "stars": [], "topic_id": 34921, "date_created": 1305556822.6122179, "message": "prophet...", "group_id": 9787, "id": 1071510}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556979.7454979, "message": "@pevans_om some would say that is a word of knowledge, not so much prophecy", "group_id": 9787, "id": 1071562}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556553.3593271, "message": "Elijah predicted the future.. Keep sinning and God's level of being cross will make you REALLY sorry.", "group_id": 9787, "id": 1071451}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556897.454834, "message": "God can use a person to heal once, and not again...", "group_id": 9787, "id": 1071536}, {"user_id": 32900, "stars": [{"date_created": 1305556913.292825, "user_id": 33006}], "topic_id": 34921, "date_created": 1305556902.8967161, "message": "@jonobarton Bono :)", "group_id": 9787, "id": 1071539}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305557292.767796, "message": "I was told that faith and the \"gift of faith\" were two separate things. Can someone explain that to me? If it's true?", "group_id": 9787, "id": 1071644}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305555677.180078, "message": "@LintonCaldecott I can't. I also can't reconcile the seeming lack of Healers with the abundance of so called teachers... My current reconciliation is to be happy that Paul was also confused about these things :)", "group_id": 9787, "id": 1071254}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557072.361393, "message": "BOOYA!", "group_id": 9787, "id": 1071595}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305556952.776747, "message": "@penkin Sometimes a person or a church needs to hear about something specific that they must deal with. Sometimes they can't see it for themselves", "group_id": 9787, "id": 1071552}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305556162.1831429, "message": "There are many who claim to be healers and prophets. The differentiation is in whether you believe them or not. Us cynics tend to dismiss them as fake somehow. But maybe they aren't... Who's to say (Oh, and please, prophets are not people who predict the future!)", "group_id": 9787, "id": 1071363}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305556540.7433109, "message": "@EdwinGarden A person regarded as an inspired teacher or proclaimer of the will of God.", "group_id": 9787, "id": 1071447}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305556553.8988121, "message": "@EdwinGarden Prophets were men who heard from God and brought the message to the people. Usually the message spoke of their situation. almost always the call was to turn from their ways and return to God. The role of the prophet was to turn Israel back to God. That's one of the main reasons people believe the gift of prophecy isn't needed anymore. because we have everything we need to know from God wrapped up neatly in 66 books. I for one still think sometimes God needs to send a special message in a special circumstance and therefore would still use a prophet", "group_id": 9787, "id": 1071452}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557049.929723, "message": "someone prophecied over me and told me i would be an apostle!", "group_id": 9787, "id": 1071585}, {"user_id": 32891, "stars": [], "topic_id": 34921, "date_created": 1305556271.5088799, "message": "@pevans_om What are prophets then?", "group_id": 9787, "id": 1071388}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557068.8126299, "message": "you better all get ready for when THAT office is besowed on me!", "group_id": 9787, "id": 1071592}, {"user_id": 33006, "stars": [], "topic_id": 34921, "date_created": 1305556924.617533, "message": "LOL", "group_id": 9787, "id": 1071547}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556555.1075461, "message": ":D", "group_id": 9787, "id": 1071453}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305556590.212127, "message": "@LintonCaldecott Ja.....it was generally pretty simple future predictions. If you don't turn things will go badly...duh!", "group_id": 9787, "id": 1071462}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556910.3916609, "message": "so, someone can have a prophetic message, but not be a prophet", "group_id": 9787, "id": 1071542}, {"user_id": 33006, "stars": [], "topic_id": 34921, "date_created": 1305556813.974283, "message": "@pevans_om soooo...who would you regard as a modern day prophrt?", "group_id": 9787, "id": 1071509}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556826.7107639, "message": "@pevans_om if the message is \"stop sinning, turn to God\" that's not exactly a unique message, it's just recounting scriptural emphasis", "group_id": 9787, "id": 1071511}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557054.9165261, "message": "apostle linton!", "group_id": 9787, "id": 1071589}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305557069.42377, "message": "@LintonCaldecott Right...word of knowledge is the modern day equivalent of OT prophecy. We've got a messed up modern definition of the word prophecy (fortune telling really)", "group_id": 9787, "id": 1071593}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305556791.953547, "message": "@pevans_om The same token when someone stands in church and says they are a prophet and tells everyone that God wants them to turn from their sin and seek Him. Ummm... yeah, got that from my little black book here. Maybe I sin so much God thinks I didn't understand so he sent a prophet to tell me audibly?", "group_id": 9787, "id": 1071504}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305556886.2408459, "message": "AAAAAAANy way, a prophet and prophecy are not really inseparably linked...", "group_id": 9787, "id": 1071534}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305557554.442529, "message": "@pevans_om Ok, so there's definitely two separate faiths? One that is our normal faith that we \"naturally\" operate in, and the other is a \"supernatural\" faith that God grants? Correct?", "group_id": 9787, "id": 1071699}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305557012.64241, "message": "@LintonCaldecott Well there you go along that understanding the gifts line again. Can someone be a momentary prophet? Not a lifelong thing? A momentary healer? Perhaps even a momentary teacher?", "group_id": 9787, "id": 1071574}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557036.26701, "message": "It's a giant mess! i believe in miracles! i've never seen a HEALER or a PROPHET... but i have heard of some healings... and received some prophetic words... although those were junk.", "group_id": 9787, "id": 1071580}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305557228.4101689, "message": "@pevans_om knowledge and prophecy mentioned seperately 1 Corinthians 12:8-11 (New International Version)\n\n8 To one there is given through the Spirit a message of wisdom, to another a message of knowledge by means of the same Spirit, 9 to another faith by the same Spirit, to another gifts of healing by that one Spirit, 10 to another miraculous powers, to another prophecy, to another distinguishing between spirits, to another speaking in different kinds of tongues,[a] and to still another the interpretation of tongues.[b] 11 All these are the work of one and the same Spirit, and he distributes them to each one, just as he determines.", "group_id": 9787, "id": 1071628}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305557097.964139, "message": "@LintonCaldecott Who says it's not becoming true already?", "group_id": 9787, "id": 1071605}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305557374.673677, "message": "@LintonCaldecott He also separates wisdom and knowledge....um....as I said....I think Paul is confused :) Or perhaps we've lost something in translation (more likely)", "group_id": 9787, "id": 1071665}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305557447.3230169, "message": "@penkin I would suggest it's faith above and beyond normal for a specific purpose. Like the reference in Romans to the gift of mercy. An example would be Shaq, Mesh and Abe at the furnace perhaps?", "group_id": 9787, "id": 1071678}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305565923.9240041, "message": "@penkin That's my guess... I've heard so many stories of unbelievable faith in times of tribulation where we can't imagine how we would ever have that kind of faith. Kinda weird to think God could give you faith though...:/", "group_id": 9787, "id": 1072718}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305646028.999696, "message": "The longer I've walked this road with Jesus the less certain I have become of anything except His love for me and my need to love Him back and to love others. Many of these theological debates seem for me to end with a lot of unknown. And that's great. I'm enjoying the fat that my God is too big to ever really properly know. I'm also happy that He's the type of God that never does what we expect. Not for Israel. Not with the Messiah. And not in our lives. I love the surprise!", "group_id": 9787, "id": 1084277}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305804779.023458, "message": "Just got an email from Andrea to go to her church for a conference. They have a BSSM (Breakthru School of Supernatrual Ministry) http://www.breakthrulife.co.za/index.php?option=com_content&view=article&id=48&Itemid=96\n\nThey have some conference coming up. Maybe I will see a healer there? Only think is it's R500.00 per/couple :( Wanna sponsor me?\n\nhttp://i.imgur.com/T3lYJ.jpg\nhttp://i.imgur.com/sOwpo.jpg", "group_id": 9787, "id": 1110447}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305805009.2428119, "message": "I think being a cessationist is easier. It's easier to claim that these gifts have cease than to answer the question: \"If they haven't ceased then why don't we seem them daily in action?\"", "group_id": 9787, "id": 1110477}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305804911.0384719, "message": "Andrea told me about this church in America; Bethel Church; and they have this lady that when she is present that deaf people can hear. Apparently her gift is only for the deaf people. Also a lady with a silicon eye started seeing through it. Now... Sponsor Me!", "group_id": 9787, "id": 1110469}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305805300.8130081, "message": "@pevans_om Don't agree. Unless we can expect God to perform fewer miracles. Remember cessationist believe miracles happen, just not that they are tied to individuals. Don't you think the same question applies. Sure a cessationist could just say God does not feel like doing it? Or possibly say he/she does not have enough faith? That is what every continuist has said to me so far. Mainly that the church has no faith.", "group_id": 9787, "id": 1110495}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305805965.232996, "message": "@penkin Yes well that 'no faith' argument should be added to the Religious Interference thread! We'll agree to disagree on this because from my perspective it's easier to say the gifts have ended than to admit that maybe we're so spiritually inept that the gifts are not manifesting in the way they once were", "group_id": 9787, "id": 1110553}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305829498.963804, "message": "@pevans_om Maybe we should go to this conference at Andre's church? We can ask the pro's? Somebody pay to send Paul and I to see the people from Bethel... please :) Ok, I'll ask my wife if I can take it out of my child's nappie fund.", "group_id": 9787, "id": 1114542}, {"user_id": 32891, "stars": [], "topic_id": 34921, "date_created": 1305875992.87409, "message": "Explosion Evenings! I'd pay good money for that! Just not maybe in the front couple of rows..", "group_id": 9787, "id": 1121837}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305878135.2935891, "message": "@EdwinGarden I believe it's very similar to what you get at terrorist training camps...........alalalalalalalalaaaaaaaa.......boom!", "group_id": 9787, "id": 1122288}, {"user_id": 32891, "stars": [], "topic_id": 34921, "date_created": 1305878363.1723771, "message": "*audience applauds, everyone goes home*", "group_id": 9787, "id": 1122314}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305897968.6211331, "message": "Spiritual gifts manifested themselves at conversion, didn't they? Faith is a gift given to us, even the day to day faith we live in, so a failure to exercise gifts through lack of faith, would really mean that God is not gracing us with enough faith to be active in the gifts.", "group_id": 9787, "id": 1125471}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305898292.183651, "message": "@LintonCaldecott I brought that up and was told there is a difference in faith and faith the gift?", "group_id": 9787, "id": 1125514}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305901771.5243509, "message": "@LintonCaldecott Ja...um...that whole God given faith is a bit weird for me still.", "group_id": 9787, "id": 1126206}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305925647.9363689, "message": "@LintonCaldecott That does tie up with what I said here https://convore.com/christian-thinking/cessationists-vs-continuist/1022396/ (right in the beginning). I just wonder what Paul thought he was writing? Did he think he was writing what would become the bible or did he think he was just talking about what we should do while we wait for Jesus?", "group_id": 9787, "id": 1130347}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926858.4353909, "message": "@LintonCaldecott Now you're getting ridiculous. Are you saying that all text in the Bible should completely be read at face value in English. And whatever it seems to say is what it says. No digging.", "group_id": 9787, "id": 1130531}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305925182.7044721, "message": "So, talking to Chris on skype now, i re-read 1 cor 13, it says \n\n8Love never ends. As for prophecies, they will pass away; as for tongues, they will cease; as for knowledge, it will pass away. 9For(O) we know in part and we prophesy in part, 10but(P) when the perfect comes, the partial will pass away. 11When I was a child, I spoke like a child, I thought like a child, I reasoned like a child. When I became a man, I gave up childish ways. 12For(Q) now we see in a mirror dimly, but(R) then face to face. Now I know in part; then I shall know fully, even as(S) I have been fully known.\n\nHow can Paul (Tarsus, not pretoria) be talking about the completion of the canon if he says now we see dimly but when the perfection comes we see face to face. Now in part, in perfection I know fully. Face to face with the perfect canon of scripture? I don't think so. Paul is difficult sometimes, he doesn't deliberately write rubbish puzzles, surely.", "group_id": 9787, "id": 1130296}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926009.395988, "message": "^- Seems a little hoop jumpy. Checking out some more.", "group_id": 9787, "id": 1130387}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926407.7244191, "message": "@LintonCaldecott Wayne Grudem said in those lectures you showed me that it does not mean it does not take time, work and prayer to understand. BOOM!", "group_id": 9787, "id": 1130453}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926785.0785539, "message": "@LintonCaldecott Yes it has. I think though it is a consideration. Some texts are tougher and a little more digging is possibly required.", "group_id": 9787, "id": 1130521}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305927015.801965, "message": "no, I think the only perfection we have, is God, even scripture would attest to that.", "group_id": 9787, "id": 1130570}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305925649.4782801, "message": "If strong's numbers are to be believed, then the perfect here is\n\nG5046\nτέλειος\nteleios\ntel'-i-os\nFrom G5056; complete (in various applications of labor, growth, mental and moral character, etc.); neuter (as noun, with G3588) completeness: - of full age, man, perfect.\n\nIf we were made perfect by the completed canon it might work...\n\nThough, many more wise scholars than me have looked at this issue, so maybe I am missing something", "group_id": 9787, "id": 1130348}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926486.7573121, "message": "@penkin Time work and prayer, doesn't include strongs number lookups and finagling to get the definition of perfect to fit.", "group_id": 9787, "id": 1130469}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926710.33583, "message": "anyway, now it's a discussion on scripture.", "group_id": 9787, "id": 1130507}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926604.4912429, "message": "@LintonCaldecott Really? Cause you automatically in this time and space understand the culture, readers, writers and language? You don't think we bring baggage to the text with how we understand the world today and that possibly need to be traversed with better understanding of the original language and culture?", "group_id": 9787, "id": 1130492}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926811.2576959, "message": "sure. this seems to be a heck of a lot of digging.", "group_id": 9787, "id": 1130526}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926079.560183, "message": "\"Face\" is Strong's #4383 again. The idea here is being face to face with our own reflection, not face to face with the Saviour. I believe the first passage I covered is referring to the same thing. And James said that as we look into the Scriptures we \"observe fully\" ourselves. The word for \"looketh\" in verse 25 means \"to bend beside, i.e. lean over (so as to peer within); look (into).\" http://www.earnestlycontending.com/ewministries/jerry/1cor13.html", "group_id": 9787, "id": 1130393}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305925746.576983, "message": "@penkin the main thrust of the cessation argument, at least in that article you linked that I linked you to... is on 1 corinthians 13, isn't it?", "group_id": 9787, "id": 1130368}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305925799.5528491, "message": "@LintonCaldecott yes.", "group_id": 9787, "id": 1130373}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926684.167963, "message": "No, that's the point of sufficiency and clarity. It's supposed to be guided by the spirit. If Paul is explaining about the gifts cause a church was getting it wrong, then surely that clarity should translate through to now... clearly for us as well.", "group_id": 9787, "id": 1130502}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305925961.7850449, "message": "\"Face to face\" doesn't necessarily mean that we see someone's face, but that we see the front of an object, i.e. that it is towards our view. (#4383)  http://www.earnestlycontending.com/ewministries/jerry/1cor13.html", "group_id": 9787, "id": 1130382}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926126.3030469, "message": "But what still bugs me is 1 Corinthians 1:7 seems to suggest we should seek the gifts eagerly till the return of Christ?", "group_id": 9787, "id": 1130398}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926933.5600381, "message": "also", "group_id": 9787, "id": 1130550}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926274.5190561, "message": "Yes. That is completely hoop jumpy. I will use a weapon from the reformed arsenal to blow that out of the water, or at least splash it a little (reformers are the ones that spawned this cessation stuff). Scripture is  Inspired, Infallible, Inerrant, Sufficient, Authoritative and it has clarity. It is written by God's spirit for our consumption, as in everyone, not the greek lexicon student... so, to jump through hoops means it is not sufficient really, nor is it clear, not really. Anyway, i know it's not the strongest argument, but neither does cessation seem to be, which is the main thrust of my argument... :D", "group_id": 9787, "id": 1130432}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926783.639251, "message": "ok, so scripture is not clear unless we can read the Greek? How can we trust anything unless we read the Greek?", "group_id": 9787, "id": 1130519}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926891.618283, "message": "@LintonCaldecott And i mean ridiculous in a loving way :D", "group_id": 9787, "id": 1130537}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305927549.17312, "message": "also, you are arguing face to face, i am talking about the perfect used, which is\n\nFrom G5056; complete (in various applications of labor, growth, mental and moral character, etc.); neuter (as noun, with G3588) completeness: - of full age, man, perfect.\n\nvarious applications of labor, growth, mental and moral character... completeness. How is that possible before death and resurrection.", "group_id": 9787, "id": 1130762}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926445.588917, "message": "@penkin scripture is the mirror by which we see ourselves dimly? What exactly is in part that shall be done away with after the perfect comes? the imperfect gifts go away because the perfect text comes... so that we can see ourselves perfectly? Was that ever the point of the Gifts? To use as a mirror for self reflection?", "group_id": 9787, "id": 1130459}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305926725.3335531, "message": "@LintonCaldecott My limited knowledge of greek (super limited) is that everything has a masculine and femanine, even rocks which is not in English.", "group_id": 9787, "id": 1130512}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926931.619113, "message": "I am saying that the argument for digging is fine and well, but when it's THIS kind of digging with so much pre-supposition, it seems to be a poor argument", "group_id": 9787, "id": 1130549}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305926990.073386, "message": "if scripture is perfect in the sense that this argument requires, it's not exactly a perfect mirror, cause we have to REALLY try hard. End up with 55 different denominations and doctrines... which mirror is the perfect one?", "group_id": 9787, "id": 1130567}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305927136.1819301, "message": "@LintonCaldecott I think the reformed \"perfect scripture\" argument is for the original if I remember correctly? Which I thought was daft since we have never seen it.", "group_id": 9787, "id": 1130598}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305927170.3844841, "message": "the clarity of scripture is also important.", "group_id": 9787, "id": 1130611}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305927275.8512039, "message": "@LintonCaldecott Sure. That is where I was saying clear does not mean easy. It means it can be understood with time, work and prayer?", "group_id": 9787, "id": 1130648}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305927304.4842, "message": "Maybe this needs to move to a new thread?", "group_id": 9787, "id": 1130663}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305927363.6602399, "message": "ok, we just created a circle.", "group_id": 9787, "id": 1130684}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1305928068.378648, "message": "Love never ends. As for prophecies, they will pass away; as for tongues, they will cease; as for knowledge, it will pass away. For we know in part and we prophesy in part, but when the perfect bible comes, the partial gifts will pass away. When I was a child, I spoke like a child, I thought like a child, I reasoned like a child. When I became a man, I gave up childish ways. For now we see in a mirror dimly without the bible, but then, when the perfect canon comes we will see ourselves face to face. Now I know myself in part; then when the perfect canon comes I shall know myself fully, even as I have been fully known.", "group_id": 9787, "id": 1130896}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305928038.1325519, "message": "@LintonCaldecott Could it not be the complete canon? I can see how it could be Jesus. All I am asking is, can it not be the canon? Like I said earlier 1 Corinthians 1:7 seems to support that the gifts are to be sought out till Jesus comes?", "group_id": 9787, "id": 1130894}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305965149.3341889, "message": "@LintonCaldecott lol, I just read that to Nicole. Read the original then this. Told her you wrote it and asked if it made sense. She said yes. :)", "group_id": 9787, "id": 1133251}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305970783.1143179, "message": "OK, I'm going to add my 2 cents to all the last 38 messages now - let confusion commence", "group_id": 9787, "id": 1133357}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305970836.671191, "message": "First, my understanding of the 'perfect' when you consider other usages of the word is that it was used to refer to Jesus who was considered the only perfect man and the perfect Word of God", "group_id": 9787, "id": 1133359}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305970980.978616, "message": "Second, arguing that the canon is perfect and then requiring in depth research to understand the perfect canon resolves the canon to be not perfect. (Why do we feel the need to follow the ways of Islam anyway?) Adding to that, if you take the argument that we refer to a non-existent original canon as being the perfect one and what we have therefore not being perfect....well......how can we claim to have the perfect then? It makes no sense!", "group_id": 9787, "id": 1133361}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305971279.2379761, "message": "continuing that thought: Why, if we have this 'perfect' (being the canon) is there still so much confusion amongst believers. It certainly doesn't look to me like we are seeing things clearly and we've had this 'perfect' (the canon) for almost 2000 years already! Why if we have this perfect do will still not reflect God's Love properly? Why if we have this 'perfect' do we still not Love others like we should? No, no matter how I look at it I cannot see the 'perfect' as anything other than Jesus", "group_id": 9787, "id": 1133369}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305971331.7563119, "message": "And if I'm right then according to some people we'll know within the next few hours and all will become clear  :)", "group_id": 9787, "id": 1133371}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305971751.416924, "message": "@pevans_om Ok. So the gifts are still in operation. Cool :)", "group_id": 9787, "id": 1133378}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305972182.559211, "message": "@penkin I don't think it's a reason to move churches. Every church doctrine has its flaws. That's one of the reasons I still attend Methodist churches. I know they're not perfect, but I know their doctrine and I know what I agree with and what I disagree with, but on the whole I agree with more than I disagree with. \"Better the devil you know\" :)", "group_id": 9787, "id": 1133392}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305971946.1242919, "message": "@pevans_om @LintonCaldecott I wonder, should I change my church now to a more like minded one? One that acknowledges and operates in the gifts? I have already spoken to my paster and all the elders are cessatonists and they seem pretty stuck there. I'm never going to be edified by the gifts there. All though there seems to be a good batch of love and community. I'd stay for that. And Tim seems to have the gift of teaching even if he will not acknowledge it?", "group_id": 9787, "id": 1133384}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305972435.594667, "message": "@pevans_om heh. Was kidding. I think the community, love, involvement and teaching in Antioch outweighs me wanting to see healing, tongues or prophesies. It's the first church I have been to that after church there is an \"Adult Sunday School\" to teach members and grow their understanding.", "group_id": 9787, "id": 1133393}, {"user_id": 32900, "stars": [], "topic_id": 34921, "date_created": 1305972697.807121, "message": "@penkin I'm often surprised at reasons for people leaving churches...", "group_id": 9787, "id": 1133397}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1305973156.797502, "message": "@pevans_om Nicole was telling me the other day that when she was in Discovery that someone stopped coming. When she saw the person in the shops and asked the response was, \"The pews are uncomfortable.\" o_O", "group_id": 9787, "id": 1133407}, {"user_id": 32935, "stars": [], "topic_id": 34921, "date_created": 1306145561.3304861, "message": "HAHAHAHA", "group_id": 9787, "id": 1150933}, {"user_id": 32888, "stars": [], "topic_id": 34921, "date_created": 1306215951.9031351, "message": "at Antioch, the elders might be cessationists, but there are many members who are not.", "group_id": 9787, "id": 1162129}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1308045157.448719, "message": "I'm going to that conference at @andreatrue church on Thursday. Trying to ensure that I don't go with any preconceived ideas but I find that difficult. Looking forward to hear what they have to say about the \"Supernatural Lifestyle.\"\n\nhttp://i.imgur.com/T3lYJ.jpg\nhttp://i.imgur.com/sOwpo.jpg", "group_id": 9787, "id": 1389437}, {"user_id": 33689, "stars": [], "topic_id": 34921, "date_created": 1308054691.093008, "message": "hello world", "group_id": 9787, "id": 1390419}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1308323400.9465179, "message": "The sermon starts after about 8 minutes.", "group_id": 9787, "id": 1419807}, {"user_id": 13817, "stars": [], "topic_id": 34921, "date_created": 1308323378.250526, "message": "Got this from @LintonCaldecott the other day. Worth a watch http://theaterchurch.com/media/video/the-stuff-of-miracles/", "group_id": 9787, "id": 1419800}]