[{"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310842457.7769771, "message": "Story Goal is to return to the way things were. It's impossible for things to be exactly the same, and though in some ways they end up better, this is still a failure, correct?", "group_id": 2515, "id": 1653305}, {"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310842588.6802461, "message": "Or is it just a matter of degrees (and ultimately author choice), if OS characters come to understand that said goal was not the correct goal in the first place?", "group_id": 2515, "id": 1653315}, {"user_id": 33839, "stars": [], "topic_id": 42138, "date_created": 1310845379.5249879, "message": "From the book, it's a failure.  But the last paragraph is key:  not to pass judgment on the value worth of their success or failure, but rather to determine if the OS characters succeeded or failed in their attempts to achieve what they originally set out to do.  \n\nThey can grow and learn and event stop going for what they originally intended, but it's still a failure.  If they actually succeed and find out it's not what they really wanted, it's still considered  a success.", "group_id": 2515, "id": 1653537}, {"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310847314.2712309, "message": "@JBarker Thanks.", "group_id": 2515, "id": 1653677}, {"user_id": 7664, "stars": [], "topic_id": 42138, "date_created": 1310849584.224149, "message": "One person should have the story goal -- it's not a group thing.\n\nAnd, I think making it as specific as possible helps. Otherwise, in any given dramatic situation, the Protagonist has a vague path in front of them.\n\nTo return my family to the way it was... does that mean \"I want everyone to enjoy Christmas like we once did\" or \"I need to talk to that guy about resurrecting my dad. Having Dad at Christmas again would be nice.\"?", "group_id": 2515, "id": 1653836}, {"user_id": 7645, "stars": [], "topic_id": 42138, "date_created": 1310851102.9249461, "message": "One person may be pursuing the goal, but there could be many who \"have\" it. In Star Wars, Luke, Leia, other Rebels are all interested in finding some way to fight the Empire.", "group_id": 2515, "id": 1653945}, {"user_id": 7645, "stars": [], "topic_id": 42138, "date_created": 1310851392.5771451, "message": "@Bee, sounds like you're talking about a Failure/Good story. I think @MikeDerk was alluding to the fact that your Goal as described is a bit vague - there are so many ways to interpret things returning to the way they were...is Inertia the OS Problem? Is there a girl lost in the woods?(OS Goal - Present). Does a family on the skids try to find a new home to live (OS Goal - Obtaining). There are so many different ways to interpret \"things returning back to normal\" that before you decide on Failure/Success you should figure out the Goal more concretely...though it sounds like a Failure/Good story.", "group_id": 2515, "id": 1653988}, {"user_id": 7664, "stars": [], "topic_id": 42138, "date_created": 1310849600.751852, "message": "Arguably, at the end of How To Train Your Dragon, things are better, but it's a failure.", "group_id": 2515, "id": 1653837}, {"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310852300.4211731, "message": "It's not my story goal, though it was a thought way back when I first found DP (and then realized was way too vague). It's definitely not concrete, and for that reason alone I should have found something else to throw out there while considering the success/failure thing.", "group_id": 2515, "id": 1654075}, {"user_id": 7645, "stars": [], "topic_id": 42138, "date_created": 1310851485.422646, "message": "Every story is about an inequity, so if that inequity is resolved (Success) \"things have returned back to the way they were\" from the context of an inequity propelling a story. This might be where your question is coming from...", "group_id": 2515, "id": 1654006}, {"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310853376.5713229, "message": "Moving on to my actual story goal... (and a new question)...\n\nThe goal is to get the band back together after an accident. So I have the protag, who has this goal (who is neither my MC or IC), and the other 4 members of his band who are in varying positions regarding achieving the goal. They're back together at the end, so it's a Success story.\n\nTo achieve the goal, the protag has to find their 5th member (in seclusion), and convince him to return. Now is this an OS Concern of Obtaining, or could it also be something else? Obtaining seems obvious, but as I said to Mike, this could be an issue of gravitating toward the definitions I understand.", "group_id": 2515, "id": 1654115}, {"user_id": 7645, "stars": [], "topic_id": 42138, "date_created": 1310853234.6496971, "message": "yeah, dramatica is so heavily dependent on context that you really have to know what it is youre looking at before you can answer some of those questions", "group_id": 2515, "id": 1654106}, {"user_id": 7645, "stars": [{"date_created": 1310859014.0136881, "user_id": 36437}], "topic_id": 42138, "date_created": 1310853536.7838161, "message": "from personal experience I would say definitely go with it for now. when i first started i thought every goal was obtaining. But in your case, since you're learning all this stuff, i would stick with it. A lot of the terms you'll run into with a Goal like that are more familiar. Learning Goals and Conceptualizing Goals can seem almost too esoteric...at least when you start.", "group_id": 2515, "id": 1654140}, {"user_id": 36437, "stars": [], "topic_id": 42138, "date_created": 1310859239.4924021, "message": "True. Onto storyform attempt 6... This time using the theme browser.", "group_id": 2515, "id": 1654498}, {"user_id": 10814, "stars": [{"date_created": 1310926357.618665, "user_id": 7645}, {"date_created": 1310967724.703521, "user_id": 7664}, {"date_created": 1310969685.735091, "user_id": 36437}], "topic_id": 42138, "date_created": 1310922336.904892, "message": "@Bee \"Story Goal is to return to the way things were.\"\n\nNo, that is rarely the case.  Sometimes it is about trying to recapture the past, but that is only one of many types of story goal.  A goal is best defined as trying to remove the source of conflict at a high level about which objective characters conflict over the need to achieve the goal or not.", "group_id": 2515, "id": 1657379}]