[{"user_id": 11626, "stars": [], "topic_id": 6695, "date_created": 1297908763.1802011, "message": "The Atlanta police force will no longer tangle with citizens who videotape their actions in public, according to a recent settlement between citizen activists and the city.\r\n\r\n\"We commend the city for resolving a long-standing problem of police interfering with citizens who monitor police activity,\" Gerry Weber and Dan Grossman, the lawyers for the activists, told The Atlanta Journal-Constitution Thursday.\r\n\r\nThe settlement involved Marlon Kautz, a 27-year-old volunteer with a group that films police activities called Copwatch. Two officers, upon taking his camera phone, told Kautz last year he was not allowed to record them making arrests after a raid of a local business. The police later returned his device without the pictures.\r\n\r\n\"The APD has shown time and time again that they do not want the public to see what they're doing,\" Vincent Castillenti, Copwatch organizer, said in an advisory.\r\n\r\nHe continued, \"It's alarming to see police trying to create a veil of secrecy around their activities, and I think we should all be asking what it is they're trying to hide.\"\r\n\r\nThe agreement, pending city council approval, would award Kautz and Copwatch $40,000 in damages. Also the Atlanta Police Department would agree to allow citizens to record their officers on duty, as long as the recording is done without physically obstructing officers.\r\n\r\nThe APD reported that disciplinary actions were taken on the three officers involved in the Kautz incident. A citizens advisory board recommended suspension without pay for four days for Officer Anthony Kirkman who stripped the phone from Kautz.\r\n\r\nKautz began filming police in East Atlanta two years ago after he formed a local Copwatch chapter. He told the Journal that a police raid on a local gay bar drove him to activism.\r\n\r\n\"We saw Copwatch as direct action we could take to increase police accountability in the city,\" he said.\r\n\r\nIn 1990, the original Copwatch group formed in California to film police for citizens' protection. Recording police activity has been upheld as constitutionally protected in some cases, but in many cases officers have treated it as an offense worthy of arrest.\r\n\r\nA video of the raid can be viewed on the Copwatch East Atlanta's website [link].\r\n\r\nhttp://www.rawstory.com/rs/2011/02/14/atlanta-police-agreed-to-back-off-citizens-who-videotape", "group_id": 3920, "id": 128547}]