[{"user_id": 9108, "stars": [], "topic_id": 21538, "date_created": 1303869841.6271009, "message": "Are there any VMware fans out there? I've never used it for work, but I just installed player for the first time in years on my personal machine. My dedicated Linux laptop died, so I figured I would try running a VM on top of Windows 7. When I last tried Player years ago, the resolution was locked at something ridiculous that made web browsing impossible so I was skeptical, but after a couple of hours configuring things and setting up my VM I'm pretty impressed with it.", "group_id": 97, "id": 820800}, {"user_id": 4149, "stars": [{"date_created": 1303992951.2649679, "user_id": 13339}, {"date_created": 1304193806.7644689, "user_id": 28560}], "topic_id": 21538, "date_created": 1303871374.139483, "message": "VMware is a good quick option, but if you were going to keep it like that i would take a look into virtualbox http://www.virtualbox.org/ it is really good", "group_id": 97, "id": 820937}, {"user_id": 5436, "stars": [], "topic_id": 21538, "date_created": 1303887967.8807149, "message": "I'm really impressed with vmware fusion. Especially the Unity feature.", "group_id": 97, "id": 822812}, {"user_id": 9108, "stars": [], "topic_id": 21538, "date_created": 1303899984.347451, "message": "@italiano40 Thanks for the heads up. I'll have to check it out. What do you prefer about VirtualBox?", "group_id": 97, "id": 824152}, {"user_id": 4149, "stars": [], "topic_id": 21538, "date_created": 1303937631.3473401, "message": "@JohnFail it is just open source and i feel the user has more control and i have an older computer so i like be able to control memory and things like that", "group_id": 97, "id": 832435}, {"user_id": 9108, "stars": [], "topic_id": 21538, "date_created": 1303948920.0576739, "message": "@italiano40 Open source is always good. VMware Player lets you set the amount of RAM you want the VM to be able to access; does Virtual Box offer more granular control?", "group_id": 97, "id": 834313}, {"user_id": 4149, "stars": [], "topic_id": 21538, "date_created": 1303949149.7883401, "message": "virtual box has more control i know VMware player has those controls, plus i am on mac so I really don't know about virtual box on windows, but virtual box is my goto VM creator and player", "group_id": 97, "id": 834352}, {"user_id": 31293, "stars": [], "topic_id": 21538, "date_created": 1303952169.647691, "message": "VirtualBox is great IMHO, I use it for a lot of stuff. Its the only virtualization tool that has an integrated iSCSI initiator.", "group_id": 97, "id": 834650}, {"user_id": 22183, "stars": [], "topic_id": 21538, "date_created": 1304014472.1859181, "message": "I use VMWare Workstation and it runs faster than Virtualbox under the similar VM configuration.  Obviously, only vmware player and virtualbox are free; workstation is not.", "group_id": 97, "id": 844774}, {"user_id": 22183, "stars": [], "topic_id": 21538, "date_created": 1304014761.3778801, "message": "Also that there are lots of free virtual appliances for VMPlayer / VMworkstation - http://www.vmware.com/appliances/ - it was one of the main decision factors for me to pay for the vmworkstation for local testing and prototyping.  \n\nI'm unsure if there is a similar marketplace for virtualbox today.  At least, it didn't 3-4 years ago.", "group_id": 97, "id": 844825}, {"user_id": 31293, "stars": [], "topic_id": 21538, "date_created": 1304017059.32582, "message": "Most VM images will run on a variety of platforms assuming they were made properly. Virtualbox will run with VDI/VMDK images.", "group_id": 97, "id": 845409}, {"user_id": 4149, "stars": [], "topic_id": 21538, "date_created": 1304019997.360985, "message": "Yea I use the appliances all the time with my virtualbox and virtualbox is just as good as workstation", "group_id": 97, "id": 846353}, {"user_id": 2382, "stars": [], "topic_id": 21538, "date_created": 1304024459.9611299, "message": "I tend to use VirtualBox for more routine tasks, such as a sandpit environment, but a properly setup ESX cluster with or without vsphere is a thing of beauty", "group_id": 97, "id": 847249}, {"user_id": 25811, "stars": [], "topic_id": 21538, "date_created": 1304054598.11484, "message": "Vmware workstation 7 is my first choice for virtualization! I tried all the others and vmware seems to be the most stable one without any hiccups.", "group_id": 97, "id": 852102}, {"user_id": 18408, "stars": [], "topic_id": 21538, "date_created": 1304084577.145927, "message": "I use VMware/VSphere at home and for work. And now that I have a iMac I use Vmware Fusion.", "group_id": 97, "id": 856297}, {"user_id": 4149, "stars": [], "topic_id": 21538, "date_created": 1304085471.141856, "message": "@dasmin5 actually I feel parallel is better than fusion, they have the same features but parallel just faster", "group_id": 97, "id": 856538}, {"user_id": 26433, "stars": [], "topic_id": 21538, "date_created": 1304122524.7999909, "message": "@italiano40 I’d agree but the speed wasn’t worth the instability I had with Parallels. I’m hoping VM’s next upgrade for Fusion will be worth it. It seems to be that they alternate in speed every time they upgrade. Parallels 5 was fastest, when Fusion 3 was released, it was the fastest, and now Parallels 6 is the fastest. Hopefully, Fusion 4 will be much faster but with better stability than Parallels 6. I’m hoping Fusion 4 and the iOS app they have will work better together. ", "group_id": 97, "id": 865288}, {"user_id": 4149, "stars": [], "topic_id": 21538, "date_created": 1304139748.877429, "message": "@MikeT parallels is really stable that has never been an issue i think i have 5 or 6 i don't remember, and what does the iOS app and fusion do together? that maybe a point for me to switch", "group_id": 97, "id": 866465}, {"user_id": 26433, "stars": [], "topic_id": 21538, "date_created": 1304339800.4494359, "message": "@italiano40 The VMWare View for iPad only runs from VMWare View machines, requiring PCoIP protocol. If Fusion 4 supports that, the iPad app should be able to view it or they might have a separate VMWare Fusion App for iPad in the future.", "group_id": 97, "id": 882558}, {"user_id": 26159, "stars": [], "topic_id": 21538, "date_created": 1304375907.1897321, "message": "IMHO VMware wins.  Better networking options and overall support. I've used Fusion, ESX, Virtualbox and xen and out of all of those, Vmware just seemed the most polished.", "group_id": 97, "id": 890456}, {"user_id": 2597, "stars": [], "topic_id": 21538, "date_created": 1304379599.287286, "message": "Test", "group_id": 97, "id": 890839}, {"user_id": 4156, "stars": [{"date_created": 1304501655.3441851, "user_id": 592}, {"date_created": 1304528573.734786, "user_id": 5993}], "topic_id": 21538, "date_created": 1304480176.7481949, "message": "VMWare/Parallels are likely superior for desktop application use; for development, VirtualBox wins hands down thanks to Vagrant: http://vagrantup.com -- super useful tool for spinning up/codifying developer VMs.", "group_id": 97, "id": 907132}, {"user_id": 592, "stars": [], "topic_id": 21538, "date_created": 1304501709.272162, "message": "@bitprophet +1 Vagrant has totally changed how I work. It's fantastic.", "group_id": 97, "id": 911339}, {"user_id": 31293, "stars": [], "topic_id": 21538, "date_created": 1304538089.155952, "message": "Vagrant looks pretty cool, I'm gonna have to try it out.", "group_id": 97, "id": 918669}]