[{"user_id": 19729, "stars": [], "topic_id": 42862, "date_created": 1311848831.9240069, "message": "Primera reunión: Internet desde las Ciencias Sociales\n6 de julio 2011\nSistema de Universidad Virtual de la Universidad de Guadalajara. Sala B, Casa de la Paz.\nAsistieron: \nRicardo  (@richacosta)\nRuy  (@ruycer)\nAlma  (aleticia2003@hotmail.com)\nJosé (jantonio.delgado@gmail.com)\nLizette  (@lizcampe)\n__\nSe hizo una presentación y bienvenida conforme iban llegando los asistentes. Después cada uno habló sobre cuál era el proyecto que estaba trabajando y/o los intereses que tenían en torno a la investigación sobre internet. \nLa primera fue Alma, quien es maestra de la U de G en el CUCSH y está en un proyecto en el CIESAS, su interés es la migración y extender y entender desde la antropología  o la etnografía virtual estos procesos en donde las TIC´s están presentes para reconfigurar las relaciones entre los que se quedaron y los que se fueron. Ruy le comentó sobre Víctor González, y otros proyectos de la ACM que podrían ayudarle a su proyecto.\nA continuación Ricardo Acosta Torres, se presentó y explicó que se especializa en antropología filosófica y comunicación, lo cual concreta en su proyecto de maestría. También es profesor. El Proyecto es sobre la relación de las redes sociales y la educación desde el marco de las relaciones económicas internacionales. Parte de su proyecto es establecer una especie de comparación entre el sistema educativo finés y el mexicano, analizar el porqué del desarrollo tan diferente que se logró en ambos países aunque en algún momento del siglo pasado estuvieron al mismo nivel. Alma le comenta que sí es posible que se haga la comparación de Finlandia y México. Antonio comenta sobre el proyecto de Ricardo. “El síndrome de la casa del árbol”. El capital social de Finlandia es más profundo, también sobre que la realidad social no es la misma en ningún lado pero a fin de cuentas es importante hacer un análisis de la red y de la tecnología. \nRicardo recomendó seguir en twitter a @carloslz\nA raíz de la discusión en torno a la propuesta que está manejando Ricardo para su proyecto, Antonio subrayó que se puede articular un grupo estable y articulado,  que puede dar más para fomentar este tipo de discusiones entre pares, ya que a veces es difícil encontrar interlocutores asociados a las TIC´s y la dinámica que se generó se espera que se dé en las reuniones siguientes para enriquecer los trabajos de los demás. Sin embargo se recalcó que esto supone una actitud abierta a la crítica, pero también cuando se está del otro lado, contribuir con lo que se pueda desde el conocimiento que pueda aportar. \nRuy estudia en la Universidad de Irvine en California el Doctorado en el departamento de Informática. Menciona que metodológicamente está haciendo una etnografía “chistosa” con entrevistas, observaciones, pero a raíz de involucrarse con la comunidad de creadores se involucró mucho con hacker garaje y trata de hacer una “licuadora social”. Su trabajo de campo termina en octubre.  Cómo se ha vuelto una industria el Internet, en donde se produce a nivel local, para lanzar programas globales. Está cambiando de ser una industria de servicios a crear productos globales\nDe ahí surgieron varios comentarios sobre lo importante de las Ciencias Sociales estudiando Internet, no sólo para la función académica sino también para la industria y modelos de empredurismo que podrían desarrollar productos a partir del trabajo que emane de algo como nuestro seminario. Del saber qué hace la gente con internet, y cuáles son las necesidades de internet para la gente de México. Antonio mencionó que las relaciones económico– mercantiles están haciendo un cambio cultural en el campo de trabajo. Ruy comparte sobre las necesidades de mercado, y como se desarrollará la necesidad de ver cómo se utiliza internet, y enfocar las necesidades de la gente para hacer un producto. Interacción social empresa. \nRicardo comenta sobre otros ejemplos de grupos que a nivel local han desarrollado pequeñas empresas desde la industria de Internet. Recomendó seguir a @Karlapre. \nAntonio, trabaja en el SUV de la U de G y estudia la Maestría de la Sociedad de la Información en la UOC. Él fue el siguiente para explicar que estaba trabajando con videoblogs, como nuevas formas de producción audiovisual, y entender internet como un medio de comunicación interactivo, la experiencia del sujeto cuanto un medio de comunicación, desde las experiencias cotidianas de creadores de contenido. Su metodología es la observación participante y entrevistas.  Comenta que en función de la comunidad hay ciertas representaciones y nuevas formas de expresión. Alma preguntó sobre los aspectos políticos, y se habló un poco sobre el tema y el que llamaron algunos “Mito de participación y activismo en redes sociales”. Se pregunta si las redes sociales más que armar músculo del activismo lo enflacan. Mencionan que la experiencia es lo que le da la novedad a internet…¿Se sobredimensionan el papel de las redes sociales en las revoluciones?\nPara terminar con los presentes Lizette, quien estudia la maestría en Comunicación en la U de G comentó brevemente sobre su proyecto que tiene que ver con movimientos religiosos en Internet, en específico con la divulgación de la profecía maya del 2012. Ya que el proyecto se encuentra en re-estructuración se hicieron varios comentarios sobre por dónde podría tratarse, desde metodologías como la etnografía virtual, o el análisis del discurso, hasta posibles énfasis en la investigación, como por ejemplo el momento histórico y las experiencias que viene dando la experiencia del sujeto y que se reflejan en los mitos en Internet.\nComenzó la parte concluyente de la reunión enfocándose a qué se va a hacer, a qué se le va a apostar. Se acordó que de momento la Coordinación del grupo-seminario caería sobre Lizette Campechano y Antonio Delgado fungiría como la “cara institucional”, en relación a la U de G Virtual que estará apoyando al seminario.\nSe debatió que la idea de seminario a qué compromete. O si se limitaría a ser un grupo de apoyo pero con eso de qué se estaría hablando. \nLos asistentes se inclinaron al formato de seminario: la multidisciplinariedad que implican los estudios sociales podrían enriquecer los proyectos para conocer bibliografía, criticar y complementar metodologías, y cómo se aplica la lectura al proyecto. Se pensó en hacer una presentación de nuestros proyectos más elaborada conforme transcurran las sesiones. Buscar aprender y enseñar habilidades (en el uso de las TIC´s). También entrar a la otra dimensión fuera de lo académico, por ejemplo la cuestión económica de cambios en las estructuras del desarrollo de Internet. Se pensó por ejemplo que Ruy podía invitar a los de Intel a hablar desde su experiencia\nA fin de cuentas se pensaron 5 puntos importantes para continuar con el trabajo de este grupo:\n1 proyectos lograr que los proyectos circulen, para ello enviar el resumen, donde se muestre un panorama general: objetivos, supuestos, que quiere lograr, metodología. \n2 desarrollo habilidades como ya se había dicho, enseñar y aprender entre los integrantes del grupo habilidades (uso de software, plataformas, y otras herramientas) para la investigación o un mejor desarrollo de cada proyecto. Pero también en un siguiente paso incorporar a las posibles actividades u objetivos el fomentar el desarrollo de habilidades básicas a otros, en el uso de TIC´s (por ejemplo con los familiares de migrantes)\n3 invitar gente para constituir un grupo más rico y fomentar la asistencia de los que parecían interesados “on-line”\n4 ampliación de bibliografía al presentar el proyecto o en las ocasiones que lo ameriten recomendar bibliografía sobre el tema de investigación u otra cuestión para ampliar los recursos bibliográficos (que incluye libros, revistas, páginas web, informes de instituciones, etc.) y quizá ir formando una biblioteca virtual con los libros en formato digital que ya tienen algunos.\n5 aprovechar el foro de discusión, sería contrario a la esencia el no utilizarlo. Generar discusión en él. Para esto se propuso que en cada sesión se acuerde una lectura o video y entablar la discusión en torno a él en la plataforma de convore (o facebook). O algún tema emergente que se quiera exponer en el foro durante el mes.\nMetas a largo plazo: elaborar una publicación conjunta, ¿algún proyecto con recursos institucionales (conacyt, fondos varios) ?, vinculación: llevar lo que se generaría en el seminario hacia la sociedad en acciones o aplicaciones concretas, con alumnos maestros, colonias, empresas. \nProponer fechas: Se propuso para la siguiente reunión el 17 de agosto, a las 5 p.m. a menos de que se proponga otra hora. Se pide plantear la agenda de la siguiente reunión en el foro. Y poner en consideración la participación vía web, y el horario. Se creará un grupo de Facebook http://www.facebook.com/groups/172927109439321/. Internet y Ciencias sociales.  ICS.  También se acordó que habrá constancia de participación y presentación: Cada  trimestre habrá constancia de participación si se asistió a las sesiones completas que serían (de acuerdo a lo que se dijo ese día y sujeto de cambio) 1 vez al mes (en total 3 asistencias) y discusiones continúas en línea. Y otra constancia cuando se presente el proyecto en el seminario. Estas estarán avaladas por la U de G Sistema Virtual (a menos de que otras organizaciones se quieran unir para el respaldo académico). Se espera crear una red más amplia a futuro sin embargo comenzar con algo local. \nEntonces la siguiente junta sería el 17 de agosto a las 5 p.m.  se discutirá en convore si seguir en esa plataforma o en facebook. Se espera que Antonio suba el video sobre Castells en la acampada de Barcelona para la discusión. Y no se olviden de invitar a más personas.\n", "group_id": 10646, "id": 1737925}]