[{"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308533777.9179029, "message": "Now why is the word wrapping screwed up?  Or is it just failing to word wrap for me? @_@", "group_id": 2515, "id": 1434714}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308534966.7202921, "message": "This really isn't designed for extended one-sided conversations. If you could somehow reduce it down to the bare minimum, a couple lines or so, it'll be easier to read and easier to answer your question.", "group_id": 2515, "id": 1434801}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308533776.7561331, "message": "(Eurgh I hate this enter=submit behavior x_X)\n\nOne of the things which I've always found challenging about Dramatica is that I'm naturally a character-focused writer, and Dramatica puts a lot of focus on the OS, which is defined in a way that makes it almost independent of the characters. Beyond that, Dramatica is set up to focus on on a pair of major characters, which is difficult to adapt to a story that has three or more major characters. A few people may recall that I've previously talked about assigning each of the four domains to a character (having effectively two pairs of MC and IC throughlines instead of one pair being OS and SS). I've also mentioned a possibility where the Situation (world, OS throughline) is the villain, or the villain is a personification of the Situation. And a third possibility where each type of the OS domain was represented by a character (specifically for a Situation OS, one character focused on Future, one on Past, one on Present, and one on Change).\n\nMy Big Four stuff is also somewhat related, since part of the goal of that was to remove the consideration of throughline assignment from the beginning of the storyform selection process.\n\nRecently, I've gone beyond that, down to the variation level. And I think I've come up with a workable way to view every variation as being assigned to one character or another, and thus every scene within the story as taking place either within a character's thoughts or between two characters, for up to 6 major characters. This seems much more natural to me than assigning 1/4 of the story's theme to each of two characters, 1/4 of it to the relationship between those two characters, and 1/4 of it to this abstract area outside all characters.\n\nHere's how it works. The variations consist of 16 groups of four (quads). In CDD (Character Driven Dramatica) the quads are distributed in three patterns, each pattern expressed in a corresponding way in the scene-level structure of the story. (The variations are treated as scene-level structure in the PSR and Dramatica for Screenwriters, so that part at least is pretty much canon Dramatica theory. The three patterns are:\n\n1. Internal - Each major character gets one complete quad assigned to them.  (default number is 4 major characters)  This quad is the core of that character's worldview: how they see themselves, the world, and especially their place within the world.  All four variations of this quad are assigned to this character, and the contrast between the four variations is expressed within this characters thoughts and internal conflict.  (Thus why it is termed the 'internal' pattern.)  If a character has a double thematic role they may have two quads, one per theme (both present throughout the length of the story).  In a more episodic story a character may switch quads between episodes.\n\n2. External - Of the remaining quads, some (default number 4, 1 from each domain) are completely split: each variation is assigned to a different major character.  This quad is the differences between characters, and is expressed as dialogue and conflict-related actions between two or more characters.  (Thus why it is termed the 'external' pattern.)\n\n3. Relationship - All remaining quads (default number 8) are split between two characters.  This means two of the variations are assigned to each character.  The two assigned to the same character will usually be in a horizontal or vertical 'cooperative' alignment, not dynamic pairs.  The two dynamic pairs will usually be between the two characters.  The pair belonging to each character will be expressed internally, within that character's thoughts, while the dynamic pairs' conflict will be expressed externally in dialogue and action specifically between those two characters (or you can think of this as internally to their relationship).  Each quad is basically a different relationship, although if two or more quads belong to the same pair of characters they may blend together into a larger picture of their relationship.\n\n\nSooo... thoughts? ", "group_id": 2515, "id": 1434713}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308537671.001971, "message": "Anything cut and pasted fails to wrap. It's annoying, but that's what it is.\n\nShift + Return will give you what you want.", "group_id": 2515, "id": 1435129}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308542395.045295, "message": "I'm not sure what the point of non-extended conversations is, lol.  Usually takes at least three paragraphs to explain any new and interesting idea.  Looks like I can't even edit the post, otherwise I'd try to fix the word-wrap.", "group_id": 2515, "id": 1435564}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308546024.6623371, "message": "In other words this isn't a forum or a maillist. It's more like chat. If you could somehow boil down your thoughts into short, terse messages it will be easier for everyone to follow along and comment.", "group_id": 2515, "id": 1435928}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308546022.192317, "message": "Mare, for me to have any relevant comments on this, I'm going to need some examples.\n\nSo, you have a character who resides in the Physics/Doing Quad... so their dynamics are split between Wisdom, Skill, Enlightenment and Experience.\n\nCould you expand on what that means?", "group_id": 2515, "id": 1435927}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308559299.1877489, "message": "Mike - Assuming you mean that's their Internal quad, sure I can talk about that example.  This character's worldview is based on the ideas of wisdom, skill, enlightenment, and experience.  They measure themselves in terms of these qualities, as well as everyone else they meet.  They might think of themselves as too old or jaded - bogged down by an overabundance of Experience.  They might then be internally conflicted - is the blissfully ignorant Enlightenment of idealistic youth superior to their current state?  Are they able to go back to that state, and what should they do if they are unable?  Or, why haven't they attained the calm Wisdom which is supposed to come with maturity and experience?  Should they be striving toward this, or have they made a mistake somewhere that ruined their ability to progress to that point?  Should they be proud of their great skill or it it worthless in the absence of wisdom or enlightenment?  Is their young companion more skilled because they are inexperienced, or less skilled because they are inexperienced?\n\nSo, the 4 elements of the Internal quad are how the character tries to evaluate their place in life and what they ought to be trying to change toward.", "group_id": 2515, "id": 1436977}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308559737.5718529, "message": "Jim - *wince*  I always hated the concept of chatting and twitter and enforced brevity that doesn't have room for complex thought.  Why on Earth are we here instead of a real forum when there's plenty of places one can get a free forum?  But, I noticed a \"wrap text\" button, that makes my post sufficiently readable in my opinion, even if it still sucks that I can't edit it.", "group_id": 2515, "id": 1437013}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308560714.035125, "message": "There is a solution to the cut + paste problem....................\n\nI start and end the new empty post with 'A ' and ' A' then paste in-between those As. Then delete the As. Sounds bizarre, but works. I know why it works if any one is that interested!", "group_id": 2515, "id": 1437115}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308561478.4372661, "message": "I don't mind the long posts. I'm the same, I have difficulty putting complex ideas in short posts. This place is not so bad, and is very very easy to see when there are new posts (and I love the 'muted' function).\n\nAnother way of dealing with very complex issues might be to create a blog post (elsewhere) and refer to that from here. Just a thought. Don't have a blog myself.\n\nMy first thought was, so how does this relate to the character actions and story..... Start with Characters, if we assign the four variations to 1 character, aren't we giving that character 2 sets of opposing characteristics? (for example Fact / Fantasy and Security / Threat). I'm not sure how I would write from that.\n\nRegarding the story, how would be determine structure from it? Or am I missing the point here? Are you saying that the normal Dramatica use still applies, but this is a way of adding the character specific details on top?\n\nOverall, I can see how this might give an interesting perspective on characters, but I'm not sure how this would relate to writing from Dramatica, when the 4 variations cover opposing elements. To me maybe it would make more sense that a character had two of them. Again, maybe I am missing something here.", "group_id": 2515, "id": 1437178}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308576498.1021681, "message": "And I agree, the mute function is fantastic.", "group_id": 2515, "id": 1438350}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308575707.9720781, "message": "@sunandshadow if you don't like the format here you are more than welcome to post in the official Dramatica forums. Extremely long blocks of text are much easier to read over there.", "group_id": 2515, "id": 1438264}, {"user_id": 7712, "stars": [], "topic_id": 39827, "date_created": 1308581736.053195, "message": "And the \"real\" or official forum would be here http://forums.screenplay.com/ (select Practical Dramatica or Dramatica Theory).", "group_id": 2515, "id": 1439011}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308582980.2672429, "message": "So, Mare, just going off your latest post, I'm also just a little confused. \n\nI mean, I see no problem with a character judging themselves and others through the windows of all the variations in a quad. (I'm sure I do that all the time.) But, I have trouble seeing in be relevant dramatically.\n\nIf a character is annoyingly inconsistent, then it would be a wonderful way to express it and make it dramatic. \n\nBut, when it comes to telling a specific story about a specific event, I feel like you're method robs a character of a point of view.", "group_id": 2515, "id": 1439181}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308583288.6523969, "message": "I think some of my reaction is simply coming from my reaction to your thought that Dramatica doesn't have room for complex characters. I just disagree.\n\nThere is nothing inherent in the program that gets in the way of having multiple, complex characters, with fully realized perspectives.\n\nBut, so I don't come off as a blind convert to Dramatica, please let me know why you think it's an impediment.", "group_id": 2515, "id": 1439240}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308591927.181237, "message": "Isn't one of the things Dram talks about, Slicing and Dicing, very compatible with what you are saying?", "group_id": 2515, "id": 1440600}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308589307.191469, "message": "Mikeaja - good questions.  Yes you are assigning one character 2 sets of opposing terms, but no they aren't characteristics of that character.  The quad as a whole represents the character's mental focus, or in other words the aspect of like they think is the most important.  They may be entirely in favor of one variation within the quad and opposed to another.  For your example of Fact, Fantasy, Security and Threat, the character might see his role in life as a 'vigilant defender' but from another point of view he could be seen as paranoid, nosy, xenophobic, and intolerant.  From his own point of view it's his job in life to maintain the usual Security by being on the lookout for unusual Threats.  So Security is what he admires and finds relaxing, Threat is what he hates but finds thrilling to investigate, hunt down, and destroy.  When something that may or may not be a Threat presents itself, the character sees it as his job to figure out whether this is a Fact or a Fantasy.  Fantasy can be a problem in itself because delusional people disrupt the peace, but a person with a delusion of a conspiracy is a much different Threat than a person who has discovered a real conspiracy.", "group_id": 2515, "id": 1440265}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308591722.471741, "message": "Mikeaja continued - Structurally, no it's not quite compatible with the normal Dramatica uses because the quad has a double role.  On the large scale it shows the progression from the character's POV of the story as a whole.  But on the small scale, within every act the character will be evaluating and reevaluating himself and everything else in these four terms.\n\nHere's the large scale example:  For the character described above, in act one he might be focusing on maintaining Security and feeling self-satisfied.  But as act one reaches its climax the character's internal balance would be shifting; he might hear about a problem he assumes to be a mere Fantasy, and this he is contemptuous of and irritated by.  So at the beginning of act two he is focused on insisting to others and proving to himself that the problem is a Fantasy.  As act two reaches its climax the balance is shifting again as evidence piles up that the problem is a real Fact.  At the beginning of act three the character is focused on the Factuality of the problem - gathering all the data and forming a logical plan for destroying the problem.  But as act three progresses the balance shifts again - the problem either has irrational characteristics, or the character can't find any logical acceptable solution to the problem  The problem is revealing itself as the ultimate Threat.  At the beginning of act four the character has been pushed toward irrationality by an irrational Threat; he's now obsessed with it and will throw everything he has at destroying the threat.  Because it's act four, the climax of the story, this shift will be particularly abrupt; either the problem is destroyed, the character is destroyed in trying to deal with the problem, or the Threat's true nature is finally discovered, revealing it to be not a Threat at all.  In the resolution of the story the character settles back into the Security he started at, whether it is now the security of death or insanity, or the security of a victorious warrior, or the security of the man who realizes he has been tilting at windmills all along.\n\nNow the small scale example:  In act four, when the character is being driven to the edge by confronting the Threat, the character will be wondering to himself if it's actually him that's crazy (Fantasy).  The character might also be grudgingly admiring the impenetrability of the problem (its Security).  The character will imagine hypothetical ways he could damage he problem (himself as Threat to it).  The character will wonder if he is having problems if some of the data gathered earlier was wrong or falsified (Fact).  So basically, for every single scene where this character's thoughts are revealed, those thoughts will almost certainly contain at least one of the terms in his internal quad.  So when you are brainstorming what to write for a scene you can contrast the internal quad of any character present with the current situation/current activity/fixed attitudes currently being expressed/manipulations currently being attempted.  You can also have conflict between an internal quad and an external or relationship quad; for example fighting the Threat described above might required doing something counter to Instinct or Conditioning, or destroying the threat might also require destroying something of great Value, and I already was describing some Investigation and Doubt going on...", "group_id": 2515, "id": 1440558}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308592673.8160839, "message": "Scratch the above comment; it's not correct.\n\nBut, now that I think I understand this better, I like it, but still see no incompatibility with Dram as it is.", "group_id": 2515, "id": 1440700}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308591820.9558661, "message": "So, let me try to build on this. \n\nIf this is your MC, you could easily say that their \"problem\" is, say, Probability. Something new pops up and she thinks, \"This is probably a threat, our security probably isn't enough, etc.\"\n\nThe solution could then be Possibility -- she has to learn that it's possibly a threat and that more research is needed before running to the police yelling \"This is a fact!!\"\n\nIn that way, you're just developing a way to build characters, but not actually commenting on what Dram has to say.", "group_id": 2515, "id": 1440576}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308593731.9322031, "message": "*trying the trick of pasting between As and then deleting them* ^_^\n\nMikeDerk - I wasn't trying to say that Dramatica doesn't have room for complex characters.  I don't agree with that either.  My actual (mild) complaint was that it has a ton to say about the main pair of characters but very little to say about any characters beyond two.  Inconsistent characters and characters being robbed of point of view are the exact opposite of what I'm trying to accomplish so I'm really confused if you see that in my bit of theorizing here.\n\nIf you see a story as being about a specific event, that's plot-driven writing, not character driven writing.  Character driven writing is when you see a story as a cascade of character actions, which cause reactions, which cause decisions, which cause more actions, and so on.  In Dramatica this is expressed in the idea that all stories are composed of Action and Decision and the one of the pair which goes first is the Driver.  In non-Dramatica theory the same concept is discussed as \"scene and sequel\" and Motivation-Reaction Units (MRU).  Or in a different non-Dramatica theory it's called the Vector Theory of Plot.  Anyway this cascade of action, reactions, and decisions is why each character's consistency and POV are important; Character consistency is a description of the pattern by which characters think and thus how they react to things happening in the story.  That pattern is what makes a character a character - makes seem like a person and also embody and express part of the story's theme.\n\nThe Internal Quad I'm suggesting assigning to each major character describes how that character thinks.  Yes, in Dramatica there's always some overlap in which terms can be used to describe what in a story.  That's true of all canon uses of Dramatica, it's not unique to what we're discussing here.  But a character who thinks in terms of Security and Threat has a different flavor than a character who thinks in terms of Probability and Possibility.  (Those are element-level terms BTW, so it's not really a direct comparison.  Did you intend to argue that you prefer using the element-level terms to describe characters rather than the variation-level terms I'm using???  There are several places Dramatica uses variation-level terms to describe characters, such as MC Issue, Unique Ability, and Critical Flaw, and the same set for the IC.", "group_id": 2515, "id": 1440890}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308595203.6943419, "message": "Mostly, I'm just trying to see where your thoughts and Dram differ at this point. \n\nIn terms of character consistency... do you find the Build Character stuff weak? Insufficient? I don't use it much, so I'm not going to defend it; I just know it's there.\n\nAlso, I'm not sure that Action leads to Decision leads to Action leads to Decision. (or vice versa.) I think the driver precedes the other one, but the chain can end there, until another driver appears.", "group_id": 2515, "id": 1441149}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308595021.935209, "message": "At its best, I think stories are both character and event.", "group_id": 2515, "id": 1441123}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308594946.08025, "message": "I'm just trying to play catch up to your months of thinking, so I'm going to trip up.", "group_id": 2515, "id": 1441103}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308597396.02121, "message": "While you can have a story that's \"driver-> response -> end\" then a new driver coming out of nowhere over and over again, it makes for a weak and episodic story.  Might feel monotonous too, like reading prose where only one sentence structure is used.", "group_id": 2515, "id": 1441590}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308597235.8781061, "message": "I agree that stories should be character and event working together in harmony.  But, most writers usually start from the one they have a natural affinity for and use that as a base to work on the one they are weaker at.  One of my goals is to create a workflow for people who want to start from character development and use that to partially determine plot.  I find the build character stuff to be an afterthought that isn't integrated into the rest of the program.  You can't, for example, build a complex main character there and expect the program to make any coherent storyform suggestions from that.\n\nThe major area where my thoughts disagree with Dramatica is at the level of throughline.  I also disagree with the way the plot progression and PSR work in the program, but that's\n\nWhat I would really like to do but would probably never get permission to do is a major revision of Dramatica to simplify and demystify it as well as making it more flexible.  The reason I wouldn't get permission to do that is it wouldn't be 100% consistent with the original program and theory, plus they have no interest in completely redoing the program because they don't have the budget for that or the potential customers to justify the expense.", "group_id": 2515, "id": 1441554}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308598856.899853, "message": "Can you give an example of where it is coming from instead?", "group_id": 2515, "id": 1441764}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308597736.2717581, "message": "I'm not saying it comes out of nowhere, I'm saying it doesn't come from the decisions that preceded it.", "group_id": 2515, "id": 1441666}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308606653.0715539, "message": "@sunandshadow I suspect you won't get permission because you're presuming you could actually make it better. If your comments above are any indication, I don't think that would be the case.", "group_id": 2515, "id": 1442719}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308607114.070121, "message": "@sunandshadow I think the approach Armando took with 'instant Dramatica' is a much better way to deal with this - provide instructions for a different way to use it, from beginning to end, so people can easily follow.\n\nIf I was the creator  of the software, I wouldn't give permission for what you suggested.\n\nActually, 'Instant Dramatica' didn't work for me, but I tried it because the instructions were there and I could experiment.", "group_id": 2515, "id": 1442805}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308608965.479809, "message": "@sunandshadow Somehow my example got erased. \n\nA storm is coming into town (Driver:Action). People decide they had better not go to work, and stay home to board up their houses. Except the stormchasers, who hop in their van.\n\nRain starts to fall, and people are shocked to find out that this storm is hydrochloric acid, not water. (Driver: Action) They decide to run, but the wheels of their trucks have melted. The stormchasers learn about this over the radio, and drive away to the local military base.\n\nThey arrive at the base to find out that it was conducting secret experiments, and was taken over by terrorists. (Driver: Action). They decide to be heroes.\n\nNone of the drivers are results of the decisions.", "group_id": 2515, "id": 1443110}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308612530.601491, "message": "@jimhull I wonder how insulted I should be by that.  Is there some reason unrelated to this conversation that you've had nothing positive to say to me at all since I joined the forum?  Obviously I do think I could make Dramatica better.  No one who didn't think there were improvements to be made would be able to make any improvements.  I've been familiar with Dramatica for more than a dozen years now, it would be pretty pathetic if in all that time I hadn't thought of any improvements.  And I said I wouldn't get permission, I have no illusions about that.  Other people have suggested good ideas for revising Dramatica over the years, very few of which have been adopted.  Chris has said that the new version they've been working on will have mainly cosmetic differences from the current version because the software doesn't have the popularity and money-making potential to justify spending more money to make bigger changes.\n\n@Mikeaja Dramatica is confusing.  Writing mods or variants to overlay it just creates more confusion.  You can't make things simpler without removing or rewriting confusing bits, and you can't fix errors without making changes.  But, there would be no reason the current Dramatica materials would go away, they would still be available the same way they are now.  I'm just suggesting it would be possible to create a cleaner, leaner, more modern alternative which would be simpler and more flexible both for new users and for those who have long been frustrated with Dramatica's rigidities and foibles.  I'm not here to badmouth Dramatica; I think it has a lot of good material.  I just think it could be improved.  That's not some kind of heresy or disrespect to the creators or loyal users.", "group_id": 2515, "id": 1443473}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308612817.6975729, "message": "@ Mikederk Doesn't that example feel episodic to you?  Also, don't you expect the existence of the hcl rain to be something people will be reacting to in the next few scenes?  The tying together of causes and effects, actions and decisions across a large piece of fiction is what gives a novel or screenplay structural unity; otherwise it might as well be a collection of short stories or diary entries.", "group_id": 2515, "id": 1443514}, {"user_id": 33839, "stars": [], "topic_id": 39827, "date_created": 1308613328.656888, "message": "@MikeDerk re: \"Also, I'm not sure that Action leads to Decision leads to Action leads to Decision. (or vice versa.) I think the driver precedes the other one, but the chain can end there, until another driver appears\"... in context of what was mentioned earlier (threat vs. fantasy), if a single driver causes one to explore (decision) one possibility (threat) which leads to another problem in and of itself, do we consider the new problem to be stemming from a single (the first) driver, or do we define a new driver?  I'm thinking of the example in the book with the Waitress who has to itch her nose - where each solution presents its own problem, moving the character that much further away from the original problem.  This would be what I think is being referred to character driven writing - something like Before The Devil Knows You're Dead where one bad decision begets another, which begets another.  I'm just not sure if each is preceded by another, unique driver or if all the actions are considered as part of the original source driver?", "group_id": 2515, "id": 1443540}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308615783.745923, "message": "@JBarker The Waitress is operating over a very short stretch of time. Drivers tend to motivate bigger changes. \n\nAs for the other question, I couldn't answer it without more context. \n\nI'm not against an action leading to a decision leading to an action, btw. It's just not mandatory. \n\nIn my rain example, all the drivers come from the same source (the army base), but that's not necessary either.", "group_id": 2515, "id": 1443715}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308615629.0908289, "message": "@sunandshadow I\"m sorry, I thought it was implied that drivers drive acts -- or at least, longer stretches of the story -- not scenes, and that a lot would be happening between the things I wrote down. \n\nOf course people would be reacting to the hcl rain.", "group_id": 2515, "id": 1443706}, {"user_id": 33839, "stars": [], "topic_id": 39827, "date_created": 1308616964.7223639, "message": "@MikeDerk Got it, thanks.  I didn't want to assume as the book, to my recollection, doesn't distinguish (though it uses Inciting Incident as an example) - and I didn't have a time frame/story context to put your example in.", "group_id": 2515, "id": 1443815}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308617364.6147411, "message": "I think the Dramatica theory is flexible enough for all sorts of \"un-Dramatica-like\" use and interpretation.  The software, on the other hand, uses a subset of the theory concepts specifically geared toward grand argument stories, the four throughlines, and an emphasis of the MC over the other characters.\n\nThe software also excels in the storyforming arena, a feat that no other software (or book) can come close to replicating.  In the other areas, i.e. Storyencoding, Storyweaving, and Story Reception, the software is hardly robust.", "group_id": 2515, "id": 1443839}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308617373.869705, "message": "Even the Build Characters window is given short shrift in most of the features of the software.", "group_id": 2515, "id": 1443844}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308617480.652771, "message": "This has less to do with its value to writers as its disconnectedness from the storyform.\n\nDramatica Pro 5 should help improve this a little, but there will still be room for expansion for support of all the characters in a story down the line.", "group_id": 2515, "id": 1443855}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308622340.9329889, "message": "@sunandshadow This is a reply to this: \"are you saying you prefer using the element-level terms to describe characters rather than the variation-level terms I'm using\"\n\nUm, no. I'm saying that what you are proposing uses Dramatica terms and quads to design a character. That's cool and interesting, but I'm saying it has little to nothing to do with the Problem the story explores. \n\nA character explained by a quad, any quad, would still have to fall prey to some sort of problem to convey meaning. They would have too much or too little of [pick an element].\n\nAre you proposing that aspect be removed from a story?", "group_id": 2515, "id": 1444286}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308644234.0285621, "message": "@MikeDerk - Had to think about that one! ;)  Well, a character's personality and that characters problem are complementary.  From either one you can make a pretty good guess at the other.  A person's actions and worldview shape what they problems they have in life.  Take this acid rain example.  The storm chasers who run toward danger have a different personality from the people who hide, and the terrorists have a third type of personality.  In the same story they each encounter a different problem appropriate to their personality.  The terrorists are by nature attackers, so they get a counterattack.  The storm chasers are by nature investigators, so they get a mystery to investigate.  The civilians are by nature defensive, so they get a problem of defending their bodies and homes from acid rain.", "group_id": 2515, "id": 1446508}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308654722.9184411, "message": "With Armando, I didn't mean the instant Dramatica add-on. I meant his description of the process. I've never used the add-on. I think, before anyone would consider the new ideas to be good ideas, I think they would need to be seen in practice.", "group_id": 2515, "id": 1447235}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308672725.484498, "message": "@sunandshadow It just seems like you're dismantling and disregarding the Dramatica theory of story, and I just don't get why.\n\nWhy?", "group_id": 2515, "id": 1449718}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308683440.2132421, "message": "@MikeDerk Haven't you done that as an editor?  Dismantle a story so you can see what the pieces are, discard a few, change a few, then rebuild the story better?  The Dramatica theory does not work for me as-is.  Pieces of it work.  Pieces of it almost work.  Other pieces, I knew they didn't work but it seemed like they should so I had to really get down into the nuts and bolts to figure out what was going wrong - whether I was just misunderstanding it, or the theory was genuinely wrong, or it was about this being the 'western bias' version of Dramatica which is hypothetically different from the other three possible versions.  The software is kind of a black box so I had to pretty much reverse engineer it to figure out why making certain choices in the story engine made other choices for you and ultimately affected what plot progression and reports the program yields for each storyform.", "group_id": 2515, "id": 1451057}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308683794.414716, "message": "@Mikeaja - I find Armando's book to add almost as much confusion as helpfulness, mainly because it brings interesting topics like Z-patterns into the discussion without fully explaining them.  But I quite like the Instant Dramatica applet.  I think it's a handy tool for quickly producing a plot synopsis, and there's only one tiny aspect of it I disagree with (placement of symptom/response in act 3 and problem/solution in act 4).", "group_id": 2515, "id": 1451127}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308686096.1054571, "message": "Armando's book is not confusing. It's a wonderful introduction to the theory and an excellent set of tools for helping one incorporate Dramatica into their workflow.", "group_id": 2515, "id": 1451497}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308686105.9805291, "message": "He explains the Z-pattern quite clearly: \"With two Variations diagonally aligned (such as Morality and Self-Interest), the transition is smoother than with Variations horizontally aligned (like Morality and Attitude) or vertically aligned (like Morality or Approach).\" You can't get much clearer than that. Morality and Self-Interest work on sliding scale when seen in relation to one another, Morality and Attitude or Morality and Approach don't.", "group_id": 2515, "id": 1451502}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308690043.3873861, "message": "This should be merged with the Scenes thread. The level of resolution you're looking for is counter-intuitive to the writing process. If you have issues with some of the more simpler aspects of Dramatica, like the idea that doing what's best for you (Self-Interest) and doing what's best for everyone (Morality) are more similar in scope than doing what's best for you (Self-Interest) and your demeanor while doing so (Attitude), understanding the PSR and how it was engineered isn't going to make things any easier for you.", "group_id": 2515, "id": 1452172}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308688803.0064411, "message": "*confused* But, Armando's book isn't intended as an introduction to the theory, Armando himself would tell you that.  And that's not the part I meant.  I meant there should be a full, more basic explanation of how Variations make scenes and scenes make acts.  The PSR was originally intended to give directions about how to get a scene-level story outline from your chosen storyform, but the PSR is a half-disowned source of much debate, and not actually compatible with the idea of Z, U, and hairpin patterns.  The idea of the patterns is an improvement on the PSR, but there's no clear workflow of how to go from storyform to outline using them.  The Instant Dramatica applet is a nice workflow for going from storyform to higher-level synopsis, but it doesn't go down to the level of scenes and the z/u/hairpin patterns.  Makes me want to bang my head against a wall. -_-", "group_id": 2515, "id": 1451939}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308695745.0344329, "message": "@sunandshadow Okay, so the theory doesn't work for you. But, from what I've seen, you also don't understand the theory. Nor do you seek to understand the theory.\n\nYou seem more interested in repurposing various parts, and some of what you come up with is interesting. I may even use it myself.", "group_id": 2515, "id": 1452892}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308699376.6734991, "message": "@JimHull I don't think I'm quite talking about the same thing as the scenes thread - Ive been reading that although I didn't find anything to post in it.  I don't think what I'm talking about is counter-intuitive to the writing process or even to what Dramatica is intended to do.  As I see it, Dramatica should help a writer go from vague idea to a well balanced scene-level outline, which is what the writer then writers from.  By a scene level outline I mean for each scene there's about 1 sentence saying which two or three Dramatica terms should be explored in that scene, and maybe which character is most closely associated with each of those terms.  The other thread seemed to be more talking about evaluating and tweaking single scenes, which I do think is below the level of granularity Dramatica has anything to say about.", "group_id": 2515, "id": 1453357}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308699685.7070341, "message": "@MikeDerk I do understand the theory.  Disagreeing with parts of it is very different from not understanding it.  I put in quite a lot of time coming to an understanding of the theory, trying to apply it as designed, before I started trying to figure out what changes to the theory would make it work better for me.  I'm no longer interested in seeking to understand it because I'm done with that phase.  I'm definitely interesting in repurposing parts of it because that seems to be the way I can get the most functionality out of it.  I'm really fond of the lists of terms, and I find the idea of quads and dynamic pairs and z/u/hairpin patterns all very interesting and potentially very useful.", "group_id": 2515, "id": 1453377}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308704803.1817219, "message": "The purpose of Dramatica is not to provide a writer with a scene-level outline. The purpose of Dramatica is to help a writer craft a Grand Argument Story, a story that argues that one particular approach to solving a problem is more appropriate than the other. By re-purposing the model in the way you suggest you are effectively breaking that purpose, destroying any meaning in the process.", "group_id": 2515, "id": 1453710}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308704735.848104, "message": "A scene-level outline is exactly what @mp131 was looking for - he wanted to know what Dramatica terms needed to be explored in each scene. He wanted to be told how to write a scene with Dramatica. The same bit of advice given there applies here -- it doesn't matter. At the scene level you can put anything you want in there and the story will still mean the same.", "group_id": 2515, "id": 1453704}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308718438.907953, "message": "@sunandshadow \"Disagreeing with parts of [the theory] is very different from not understanding it.\"\n\nSure, but when I point out that one of your characters with an internal matrix comprising \"doing\" could have a Problem of possibility, your reaction is to ask whether or not I dislike using Variations to describe a character, versus an Element. \n\nProblems in Dramatica are elements. It has nothing to do with what I prefer or you prefer. I was trying to expand on your character design, which is interesting and doesn't necessarily contrast with anything in Dramatica. But you don't notice. To me, that is a lack of understanding, especially given that this is a place for Dramatica discussion.\n\nWhen I ask if you are willing or proposing to give Problems the boot, you say that a character's personality is a complement to their problem. Interesting as a character discussion, but that is not what a Problem is in the context of Dramatica.\n\n If you think Dramatica doesn't work, that stories should go through Five signposts, that all characters need to embody dynamic opposites... I just can't believe you unless I get some sense that you understand Dramatica and have a reason for charting your own course.", "group_id": 2515, "id": 1454830}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308721091.885221, "message": "@jimhull I think you're simply wrong.  The original implementation of Dramatica intended to guide the writer through producing a scene-level outline, and the PSR was it's attempt at doing this.  The Instant Dramatica application intends (and succeeds) at guiding the writer through creating a story synopsis which uses the appropriate Dramatica terms in the appropriate acts, but it's goal was speed and brevity so it didn't aim to go down to the level of scenes.  Chapter 8 of Dramatica For Screenwriters is titled \"The Perfected Method of Creating a Complete Synopsis and Evaluating Your Storyform\".  Chris, Melanie, and Armando all intend people to be able to use Dramatica to create a synopsis/outline from which a novel or screenplay is then written.", "group_id": 2515, "id": 1454922}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308722056.8077919, "message": "@MikeDerk Ah, I see one of the issues here.  You haven't been exposed yet to the idea that the Variation level set of terms and the Element level set of terms are two versions of the same set of ideas.  The element level is just more abstract while the variation level is more concrete.  You also haven't seen my previous explanation about circular stories where a frame is created by echoing one of the signposts.  There are still four signposts, but the story created the impression of unity by smearing or echoing one signpost between the beginning and end of a story.\n\nThe MC and IC do embody dynamic pairs in canon Dramatica, If you look at the Main vs. Impact Story Character Report, You will see a paragraph like, \"The MC evaluates Changing One's Nature in terms of Commitment and Responsibility.  In contrast the IC measures his concern with Obtaining by how it relates to Self Interest and Morality.  Definitely apples and Oranges.\"", "group_id": 2515, "id": 1454972}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308722117.41922, "message": "@MikeDerk Ah, I see one of the issues here.  You haven't been exposed yet to the idea that the Variation level set of terms and the Element level set of terms are two versions of the same set of ideas.  The element level is just more abstract while the variation level is more concrete.  You also haven't seen my previous explanation about circular stories where a frame is created by echoing one of the signposts.  There are still four signposts, but the story created the impression of unity by smearing or echoing one signpost between the beginning and end of a story.\n\nThe MC and IC do embody dynamic pairs in canon Dramatica, If you look at the Main vs. Impact Story Character Report, You will see a paragraph like, \"The MC evaluates Changing One's Nature in terms of Commitment and Responsibility.  In contrast the IC measures his concern with Obtaining by how it relates to Self Interest and Morality.  Definitely apples and Oranges.\"", "group_id": 2515, "id": 1454973}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308723654.569113, "message": "@sunandshadow Lovely how you never address any challenges to your statements  You speak as though you are an authority on the theory of Dramatica, yet everything you bring up is some half-truth you convinced yourself was correct in your years polluting the mail list. Believe it or not, we were fine here on our own without your nonsense about character-driven Dramatica.", "group_id": 2515, "id": 1455053}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308724023.807826, "message": "Your ideas conflict with the purpose of a Grand Argument Story. You are using terms and concepts in a way that they were not designed for. Taking the Varitations and using them to describe a character's worldview is like using a hammer to make a sandwich. You can do it, but you're gonna make a mess, just like you've done here.", "group_id": 2515, "id": 1455067}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308723915.6185939, "message": "The Dramatica theory helps you write a story that actually means something. If your work has more than three or more main characters in it, then you have more than one story going on. Simple as that. Figure out the individual storyforms and weave them together. No one needs you to reinvent anything.", "group_id": 2515, "id": 1455065}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308736608.9087989, "message": "@sunandshadow  I think fundamentally, if I understand correctly, you have a different view on using Dramatica than I do (and it seems others as well).\n\nDramatica for me is not primarily about scenes and definitely not about creating a synopsis. Perhaps it can be used that way. I would create a synopsis before going to Dramatica, otherwise I wouldn't know what choices to make.\n\nI think your post above also is referring to the software, not the theory, which perhaps is adding confusion.\n\nI would also say, I think you are wrong in the way yo describe Variations and Elements being two versions of the same ideas. I think you need to use theory definitions, rather than your view on things, if you want people to be able to debate (just my opinion). I don't think anything MikeDerk has said here suggests he doesn't understand them.", "group_id": 2515, "id": 1455825}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308753902.6251831, "message": "@sunandshadow  One slight correction.  The Plot Sequence report was never intended to be used as a guide for creating scenes.  I think Armando first proposed this idea and it seems to have stuck.  He expanded on his idea in his book, which I reiterate is ONE way to build a scene structure.", "group_id": 2515, "id": 1457570}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308754612.686307, "message": "If you want to know what we PLANNED on putting in Dramatica (way back when) to address the whole storyweaving process, you should check out our under-noticed Outline 4D (formerly StoryView).  THAT was what we wanted in Dramatica, but it was too big and complex for us to incorporate -- plus we had already spent many years developing the software and needed to get it out.\n\nI hope that somewhere down the line the two will join up as originally planned.", "group_id": 2515, "id": 1457713}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308754355.0742371, "message": "You will notice that each of the methods of building scenes identified in Dramatica (book and software) uses a single set of items as the basis for scenes, e.g. signposts and journeys, thematic conflicts, etc.  The upside to these is that they provide an initial container that is structure based on which to hang the contents of a scene.  The downside is that they are single-sourced, and scenes are rarely (never) built that way.  They have aspects of character, plot, theme, and genre, which each of the structural approaches presented neglect to expand on.\n\nLet's face it, Dramatica Pro's tools for building scenes and chapters (storyweaving) are minimal.  The software provides a platform for putting together a step outline or treatment, but does not provide much more guidance than the structure templates contain.", "group_id": 2515, "id": 1457656}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308771284.531194, "message": "@Chris_Huntley That makes me quite curious what the PSR was originally intended to be used for.  As far as I know, a \"plot sequence\" can only be made out of scenes (grouped into acts), because scenes are the building block of story, and it's the relationship between scenes which determines whether the story has a nice tight plot or is an unplotted episodic mess.  I agree that each set of methods of building scenes is single-sourced, which would create a rather 2d result.  But if we have two methods based on different sources, it would seem like the logical next step is to combine the two to get a more 3d result.\n\nI've looked at Outline 4D, it seems like a good tool but not one aimed at a goal I'd like to accomplish.  What I like best about Dramatica is the way it provides lists of pieces, with the general principle that each piece must go into the story somewhere.  Granted I haven't tried importing a dsf file (containing a chosen storyform and built cast of characters only) into outline 4d, but I assume it doesn't provide a list of all the scenes in the story, each one neatly labeled with a few terms and the character names associated with them?", "group_id": 2515, "id": 1459554}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308771688.9476559, "message": "@jimhull \"polluting the mailing list\"?  Horseshit.  If you think there's not room in the world to talk about different interpretations and possible evolutions of theories, you have nothing to say worth responding to.", "group_id": 2515, "id": 1459580}, {"user_id": 7645, "stars": [{"date_created": 1308783272.962424, "user_id": 29788}], "topic_id": 39827, "date_created": 1308772543.7953069, "message": "Wonderful, now you've resorted to swearing. The nice thing about the mail list is that I could automatically filter your posts into the trash. Unfortunately I can't do that here. This isn't a replacement for the maillist. This is a conversation board explicitly designed for those who want to use Dramatica to help them write a story. It is my opinion that your ideas do a great disservice to those interested in improving their understanding of the theory. If you are interested in taking the concepts of Dramatica and ripping the meaning out of them, I would appreciate it if you took it elsewhere.", "group_id": 2515, "id": 1459672}, {"user_id": 7712, "stars": [], "topic_id": 39827, "date_created": 1308774069.872977, "message": "@sunandshadow I'm in complete agreement with @jimhull... take it elsewhere. This isn't a forum to troll in like AbsoluteWrite. @mikeaja hit the nail right on the head because it looks to me as if you are just here to preach your theory of story.\n\nRegarding Jim's \"inability\" to understand Dramatica theory or story, note that your name does not appear here: http://www.dramatica.com/community/consutlants.html. Between Jim's name appearing on that page, the skills he actively demonstrates through his articles on his website StoryFanatic.com, and the way he contributes to conversations, he's earned my respect.\n\nIf you want your contributions here to be interpreted as anything other than trolling, then stop being so confrontational and insulting in your posts and demonstrate your skills rather than proclaim their superiority by insulting others and preaching.", "group_id": 2515, "id": 1459884}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308773780.971776, "message": "@Mikeaja A storyform isn't a story.  Only a story can really have structure.  A storyform describes a hypothetical structure the way a blueprint describes a house, but to get a house (story) you have to actually build each wall (act) out of bricks (scenes).  You can have a great plan for a theme/premise you want to express to your audience through your choice of characters and events.  But if you don't manage to express that theme clearly in actual scenes of actual story then the actual story doesn't have a good structure, it might not have much structure at all.", "group_id": 2515, "id": 1459844}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308773170.964613, "message": "@sunandshadow perhaps one reason for the different thinking is your overall view of what matters. In your reply to Chris, you said:\n\n\"because scenes are the building block of story, and it's the relationship between scenes which determines whether the story has a nice tight plot or is an unplotted episodic mess.\"\n\nI'm honestly not trying to be confrontational with what I say next. You said in a previous post that you are experienced with Dramatica. Fair enough. However, from your extract above, I would not have assumed that at all. It seems to miss the central principal of Dramatica, that the structure is defined in the storyform from the author's perspective. It's nothing to do with scenes. That's a storytelling for the audience aspect, nothing to do with Dramatica structure.\n\nI think you would be better clarifying whether you are talking about Dramatica, or trying to sell us your theory of story.", "group_id": 2515, "id": 1459752}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308774238.711251, "message": "@Buck  @jimhull Thank you.\n\nMare, you have contributed almost nothing to my understanding of Dramatica over the past year and a half.", "group_id": 2515, "id": 1459902}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308775442.36288, "message": "@sunandshadow   In fairness, you've replied to something I didn't say. Structure and the story are two different things. Dramatica gives you one (with input from writer), the writer gives you the other. You are talking from the point of view of a writer that does both. That's fine, but I thought we were talking about the use of Dramatica.\n\nYou can see your avoidance of answering the actual question or point (whether intentional or not) is likely not to be popular.", "group_id": 2515, "id": 1460140}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308785939.9077871, "message": "@Mikeaja I did reply to what you said.  You said structure is what Dramatica provides and is unrelated to scenes.  I disagreed, saying that Dramatica provides a description of a hypothetical structure which can only be realized through writing scenes.  That's certainly talking about the use of Dramatica - using Dramatica to make the blueprint for what needs to go into various scenes so that the story as a whole expresses the structure the writer designed using Dramatica.", "group_id": 2515, "id": 1461250}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308788465.6894319, "message": "Again, I think we are in territory that suggests a bit of a gap in understanding of what Dramatica actually does, which is focus on the author's view of the overall, complete story. The actual writing of scenes is for the audience. They are two different things.\n\nDramatica, once the storyform is done, presents a real structure to be used, not something hypothetical. We can see it in its Dramatica form, it is there. I don't need to write a single scene to see the structure provided by Dramatica, after creating a storyform. \n\nThe point here is, lets not try to change what Dramatica is, at least not in a Dramatica forum. As was mentioned earlier, if you are going to present an alternative use, I think you need to show that you understand the regular use of Dramatica before people may accept any alternative.", "group_id": 2515, "id": 1461610}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308894668.661684, "message": "@Mikeaja I don't think it would actually do any good for me to try to \"earn credit\" here by reciting Dramatica chapter and verse. Even if the people here don't want to believe it, the fact remains that I've been using Dramatica in one form or another for more than a decade. It's just boring to retread the same ground again, and would be especially frustrating when I've already observed that the \"four throughlines\" is not the most accurate model for novels similar to what I write. What I am passionately interested in are creative experiments in reinventing Dramatica. You say you don't think talking about making changes to Dramatica is an appropriate topic for a Dramatica forum, but consider: a Dramatica forum is the only place it could possibly be appropriate because only a group of people already comfortable with Dramatica have the background to discuss modding it and the potential to use such mods to progress their own use of Dramatica if they are already hitting the limits of what canon Dramatica can do.\n\nI came here and made this thread because I had had this Dramatica-related idea which struck me as interesting and possibly insightful.  What I was hoping for was a friendly discussion of the implications and possible functionality of this idea.  And I do want to thank you for staying civil.  But it seems like the majority of people in this little group feel somehow threatened or disgusted by the idea of playing around, trying to do something different, with some of Dramatica's component ideas.  I don't really have any idea why that would be offensive, unless someone had the unhealthy state of mind that Dramatica had some sort of divine perfection and modifying it was thus a crime of heresy.  Or maybe someone who already felt overwhelmed by trying to understand Dramatica might be irritated by something they see as adding confusion.  I really don't know.  But the point is, this topic right here is the product of my last two months of thought, and if it's something this community doesn't want to discuss now, they still wouldn't want to discuss it even if I made a huge effort to show that I understand cannon Dramatica.", "group_id": 2515, "id": 1474727}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308895352.657295, "message": "Can you at least point to something that Dramatica cannot explain, but your ideas can? A novel, a play, a ring cycle? Or even some other element of drama: character development, scene development, tension and release?\n\nBecause otherwise, while you are remolding Dramatica into something else, I can't see it as something progressive. I can't understand why you would dismantle something that works (as far as I can see).", "group_id": 2515, "id": 1474757}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308896450.016957, "message": "Thank you for keeping it short.", "group_id": 2515, "id": 1474837}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308896525.0544701, "message": "Please, if you want to talk about modifying Dramatica, go somewhere else.", "group_id": 2515, "id": 1474842}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308927049.277705, "message": "@sunandshadow The PSR was created to give authors a view of what it looks like from the INSIDE of the story, as opposed to the objectified view most all the reports use.  We added it in version 3, along with another report that was similar.  I removed both reports from version 4 but got so many complaints from beta users to put the PSR back that we did it.\n\nWhat I mean by viewing the story", "group_id": 2515, "id": 1476843}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308933279.8238111, "message": "Of course Convore would go and fail right when Chris was about to reveal the secrets of story!", "group_id": 2515, "id": 1477711}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308936149.769547, "message": "Argh!", "group_id": 2515, "id": 1478099}, {"user_id": 7712, "stars": [], "topic_id": 39827, "date_created": 1308936819.603677, "message": "@sunandshadow I agree with @jimhull that modifying Dramatica is a discussion that belongs someplace else. The topic of this area is Dramatica Theory of Story, and a discussion of Dramatica modifications is inappropriate and off topic.\n\nAs an alternative to trolling and creating disharmony in a focused discussion group like this one, take action and do something constructive and positive with your energy and create your own competitive product (respecting trademarks and copyrights). If you are not willing to make that effort, contributing off-topic ideas to this discussion group and insulting others sends a powerful message about your ability to interact with others and your ability to think rationally to the other readers (I'm one of them).\n\nThere are still other options for you to explore.\n\nYou may wish to consider creating your own discussion forum to discuss your ideas. I don't see any reason why you can't create a Yahoo or Google Groups or other free discussion resource to discuss your ideas. As a reminder (and apologies in advance to Write Bros.), there is an officially sponsored Dramatica discussion group at http://forums.screenplay.com (actually there are two forum categories, one to discuss the practical use of Dramatica and the other to discuss its theory). It may be more worth your while to post your ideas in the official group forum, but if you are not willing to take your ideas directly to the creators, it contributes to the image you create about yourself to the readers in this forum.\n\nMy personal opinion is that since you feel so strongly about this discussion that it the simplest way to continue it in the way you need it continued is to create your own discussion group.", "group_id": 2515, "id": 1478182}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308940381.1040461, "message": "@sunandshadow  and I would just like to add that, my previous posts were not implying you should have to demonstrate complete understanding of Dramatica. But, if you want to discuss changing things in a complex theory, then when you are challenged you need to respond in a Dramatica way, to show that you are starting from and basing your ideas on a Dramatica point of view, not from your own approach. Otherwise, it is not relevant here. \n\nThis is also highlighted in some of your answers to questions being put forward as Dramatica points, but are actually your own summaries. I think this can wind people up a bit. \n\nIf I wanted to question Einstein's theories, I'd have to be sure that when I discussed this, that I am describing the existing theories his way, in the accepted way, not in my way. My way comes next.", "group_id": 2515, "id": 1478690}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308944320.6489401, "message": "What I mean by viewing the story(form) from the inside is this. The Dramatica structural model that you see in the Theme Browser, or on the printed charts, is the \"world at rest\" view. It is the structure in balance. Story dynamics and story point choices \"mess up\" that view -- twice. The first time is to set the base world view -- that of the world at the end of the story. It is then twisted up again based on the MC or OS perspective \"justifications\" that set up the world out of balance. The PSR gives you a view of THAT world, the one that where things do not line up.", "group_id": 2515, "id": 1479359}, {"user_id": 10814, "stars": [], "topic_id": 39827, "date_created": 1308944305.5062139, "message": "I was expecting it to fail, so I saved the rest of my response.  Here it is:", "group_id": 2515, "id": 1479354}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308946378.4653759, "message": "@MikeDerk - I said in my first paragraph of this thread the weakness of Dramatica that I thought this alternative would remedy: \"Dramatica is set up to focus on on a pair of major characters, which is difficult to adapt to a story that has three or more major characters.\" And no, I'm not talking about stories that have two storyforms (which is an extremely awkward workaround anyway). But it's been thoroughly established - no one here is interested in talking about problems with Dramatica or remedies for them, so nobody actually wanted to hear the answer to your question, probably including you. And I'm not interested in being part of a Dramatica community where people aren't interested in talking about that.\n\n@Buck I have no interest in business, selling, or trying to promote my ideas or a new discussion group. If I did I would have done something along those lines years ago when I had more energy and motivation. *sigh* I don't consider anything I've done here to be trolling. I don't enjoy arguing, and I didn't come here for that. I didn't intend to insult anyone except Jim Hull who deserves it for being a jackass (and by his own statement has had a negative opinion of me for years, leaving me no obligation to be polite to him.)\n\n@All So, fine, the consensus being that modding Dramatica is off-topic for this group, I can see there's no opportunity here for me to participate constructively.", "group_id": 2515, "id": 1479784}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308947391.881844, "message": "@sunandshadow I'm going to come right back at you.\n\nThe story I'm currently working on has two things built into it that do not necessarily have to be approached by sticking closely to one storyform: a subplot that branches off, and a (metaphorical) father-son relationship that has enough time dedicated to it to make it a developing relationship (and not just a set of characters that interact in the OS). It's another major character, as you would say.\n\nTalking about the best way to exploit those two things would be an interesting \"mod\" to Dramatica.\n\nDo I give them both incomplete storyforms? Do I use them to just explore the themes of the OS? Or, even, do I take your idea of having them explore one quadrant (something like your internal quadrant)? What would make the best story?\n\nBut, I fear -- were I actually to be asking this question (I might later) -- that your approach wouldn't build on the foundation of my story, which is a storyform. \n\nTo me, you wouldn't be modding Dramatica, but reassembling the language of Dramatica into something different.\n\nSo, yes, some proof that you understand and can wield cannon Dramatica is necessary, or you'd be speaking a foreign language to me. \n\nEven the way you quote the opening paragraph worries me. I don't necessarily agree with it, first. But it's also not providing a story that Dramatica can't crack (like say, the movie Crash) and providing evidence that your method can crack it. \n\nEverything is up in the clouds. Nothing is concrete.", "group_id": 2515, "id": 1479953}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308955252.596935, "message": "@MikeDerk But, do you not read theory books unrelated to Dramatica or incorporate them into your current project because they are speaking a foreign language to you?  Why would anything I say be different?  Part of each individual's job as a writer is to weigh all theory and criticism they are exposed to, attempt to translate anything confusing into something more clear, decide whether you agree, disagree, or consider it incoherent, and then take all the parts you agree with and incorporate them into your own theory of how you personally should write to produce books you personally are happy with.\n\nI won't be here later to answer that question (unless you emailed it to me).  I'm just waiting until I have no more replies to my comments to terminate my membership here.  My personal opinion is this: the concept of a Grand Argument Story is powerful and has a lot of potential to be useful.  But within Dramatica theory Grand Argument Story is defined multiple ways.  The definition I like best is the one which says that a Grand Argument Story presents a complete and balanced picture of the world, and the way it does this is basically including every Dramatica term somewhere at least once.  I'm sure someone will find that definition objectionable, so lemme say as clearly as possible, this is my _personal_interpretation_ of the best and most useful aspect of Dramatica's core concept.\n\nOn the other hand, you want to talk about a particular storyform.  The problem with that is a storyform is a product of the program, and the program is built around the definition of a Grand Argument Story as a story which is divided into four throughlines in two dynamic pairs: the OS and SS, and the MC and IC.  Of those, each dynamic pair of throughlines must be assigned to a dynamic pair of Domains: Situation and Fixed Attitude, or Activity and Manipulation.  What that means is, a storyform can either talk about a story where one character is focused on their world and the other on their opinions, or a story where one character is focused on taking action and the other is focused on manipulations.  That's it.  It's physically impossible to have a storyform that describes anything other than these two possibilities.  So if you want to talk about a story which isn't one of these two things, you can't talk about it within a storyform.  It's like a car.  Cars are great at driving on roads if you have gasoline to put in them.  If you don't have gasoline you might still be able to make the car go somewhere by taking apart the engine and rebuilding it to burn a different fuel.  If you want to move the car to the top of a cliff where a car is not designed to go at all it might be impossible to move it in one piece, but if you take it all apart maybe you can use a rope to haul enough important bits up the cliff that you can reassemble them into something usable for transportation.  Maybe you break the windshield on the way up, but a car with no windshield can still go places and is way better than no car.\n\nThe point I'm trying to make with this analogy is, if you're not willing to see a storyform as a collection of pieces which can be disassembled and used differently in a different context, there is no way to mod it to deal with a third major character and second major relationship.  So, what does your storyform mean to you?  Is it indivisible and all the parts essential?  If so, you can't make use of any of the ideas I've been developing for my own use.", "group_id": 2515, "id": 1481195}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308957179.531528, "message": "I'm glad you've decided to move on. Those of us who are intrigued and fascinated by what Dramatica already has to say aren't doing so out of religious conviction, but rather out of the recognition that it could actually make things better. With you and @mp131 gone we can work towards that day without further interruption.", "group_id": 2515, "id": 1481403}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308956872.9909539, "message": "@sunandshadow   but this is the essence of the whole problem in this discussion. Your middle paragraph says 'Dramatica doesn't work'.\n\nIn fact, I am guessing most here believe Dramatica does work BECAUSE of the limitations.  It is this that forces you to re-evaluate based on other choices made. If you take away the limitations, the point is lost.\n\nSo, again, as much as I feel like I'm repeating myself, to even begin to persuade any Dramatica user that your alternative may be worth spending time looking at, first you need to show that you see what makes Dramatica work in the first place.\n\nOtherwise, you are basing a system on something you don't think works, which doesn't make sense either.", "group_id": 2515, "id": 1481370}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308957160.4655571, "message": "Imagine a writer who became intrigued with Dramatica. They went to the main website and signed up for the MailList thinking to themselves, \"Well this would be a good way to learn about the theory.\" Then imagine them reading through your posts and becoming so disenchanted with the aimless nature of what was being discussed that they shut the program off, finding shelter instead within other less comprehensive paradigms of story. That person could have been a high-powered executive or an amateur writer who was on the verge of creating the next American classic. That person could have made things better. The only reason I haven't said anything over the past decade was out of respect to Chris and to Bill who ran the list. ", "group_id": 2515, "id": 1481398}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308957165.880034, "message": "Unfortunately for you, this is my gig.", "group_id": 2515, "id": 1481399}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308957154.522028, "message": "@sunandshadow The issue at stake here is that I don't consider this a game. This isn't my hobby. There are a lot of people whose livelihoods depend on telling a good story. Not only those who make a living off their words, but more importantly the countless hundreds below the line who rely on those words having some kind of meaning. It is my strong conviction that Dramatica can address most, if not all, of the bad and meaningless storytelling in Hollywood -- possibly improving the lives of those who work in the industry and the families they support. Your work diminishes that value by maintaining the perception of Dramatica as being too difficult or too confusing or worse, tragically meaningless. ", "group_id": 2515, "id": 1481396}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308957171.8512731, "message": "I'm not against improvements to Dramatica as much as I'm against *your* improvements to Dramatica. Time and time again you've demonstrated that you don't understand the theory. The reason you don't get Dramatica is because you have difficulty maintaining an argument, clearly obvious in the conversation above. We challenge your statements and you don't back them up. The Dramatica theory of story is focused on the concept of a Grand Argument Story -- it's all about defending your position. The argument part of that definition is essential, it's not something you can simply choose to ignore. This inability to argue is why you feel the need to change it, and why the rest of us don't.", "group_id": 2515, "id": 1481400}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308966511.2898669, "message": "@Mikeaja I though I had already expressed pretty clearly that my opinion is there are parts of Dramatica which don't work if you want to do certain things, specifically including the case where one wants to have three or more main characters.  How could I possibly answer your question about how to do something canon Dramatica doesn't support without explaining why having three major characters is incompatible with storyforms as they exist in the Dramatica program?  Yes limitations are what create structure, but if you don't want the default structure you have to change the default limitations.", "group_id": 2515, "id": 1482153}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1308968554.556061, "message": "@jimhull Fiction is a form of recreation, and people who choose to earn a living producing fiction are entertainers.  Yes it can be meaningful, but on the other hand people have been successfully producing meaningful fiction for thousands of years.  You're _seriously_ trying to sell the argument \"ZOMG Dramatica will make the world a better place!!1!\" *cloud of hearts and butterflies*  I don't even know where to start pointing out the nonsense of that.  I do think it's pure paranoia to think Dramatica newbies would give up on it just by reading posts of mine.  There's so much prejudice out there against writers' aid programs, anyone who picks it up in spite of that AND doesn't balk at the fact that it has its own dictionary is seriously unlikely to be discouraged by encountering an irrelevant or incomprehensible post on a mailing list.  At least I think Dramatica is interesting and potentially useful, and I say so regularly.  It's not necessary for someone to think Dramatica is flawless in order to benefit from using it.\n\nI don't suppose it ever occurred to you that if there was any kind of 'advanced dramatica' or 'experimental dramatica' group I'd be perfectly happy to post my thoughts there instead where nooblets wouldn't be exposed to them?  No, you have this strange impression that you are a rooster and it's your job to crow and peck at anything weird in the barnyard until it leaves and all is orderly again.  Even when what you're puffing your chest out at is actually a flamingo lawn ornament completely incapable of stealing your hens or bothering their eggs.\n\nThe point about the relationship between Grand Argument Stories and real arguments is almost interesting.  But don't forget this is the internet.  It's a rare day indeed when an argument on the internet accomplishes anything but wasting the time of all involved.  The fact that I deem it not worth the effort to argue strenuously here doesn't mean I don't know how to set up a thematic argument in a story.  Ironically, whenever I find myself discussing theme at any non-Dramatica writing community half of those writers are opposed to consciously putting theme into stories.  Tthe fact that I believe that stories are supposed to express a Judgment puts me on the extreme pro-theme side of the debate right alongside Dramatica theory and the Vector Theory of Plot.  My disagreement with Dramatica are all with the details, not with the spirit of it.", "group_id": 2515, "id": 1482317}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308973047.1105151, "message": "@sunandshadow, Just to clarify, I think Dramatica has the potential to make things better for people who make their living from great storytelling. And it's not paranoia in regards to your modifications to Dramatica, I've seen it repeated several times where people have engaged your ideas only to be left more confused than when they started.", "group_id": 2515, "id": 1482663}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1308973082.6580529, "message": "Any member of Convore can start a group. Maybe start a \"Hacking Dramatica\" or \"Experimental Story Theory\" group. You can post about it here and those who are interested will follow.", "group_id": 2515, "id": 1482667}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1308977081.061888, "message": "Anyone who is reading this and fears that voicing questions or misconceptions about Dramatica will result in some sort of retribution, please don't. \n\nWhen someone (@JBarker) brings up the idea that maybe the 6th Sense should have two storyforms, I think it's great. It gives me the opportunity to rethink what I think I know, figure out how to say it clearly and cleanly, and if I can't, step back and listen to the people who do.\n\nWhat's going on with @sunandshadow is very different (I'm sure you've noticed). I hope it hasn't affected anyone's enthusiasm for Dramatica or your desire to tell great stories.", "group_id": 2515, "id": 1482816}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1308988641.2591989, "message": "@sunandshadow   I was not referring to the 3 main characters thing, but what you said before, starting at \"What this means is\" and ending with \"two possibilities.\"\n\nThis is not the correct way to see Dramatica, in my opinion. It seems clearer to me now, that you are seeing the core feature of Dramatica in a very limited way. More than most here. My personal opinion is that you are possibly misunderstanding how the various Domains work in a Dramatica view of story.\n\nSo, the answer is definitely not to expect others who believe in Dramatica to accept this limited view, and see it as one reason to change it. \n\nIf I were you, what I would do is find a film that can be analysed (mostly) using Dramatica, then show analysis using your method. Whether this forum is the place for that is not for me to say. The absolutely key thing is, the Dramatica analysis of it needs to be presented in a Dramatica way, not just a summary from you.", "group_id": 2515, "id": 1483276}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309022247.1831651, "message": "@mikeaja that actually does refer to the three major characters thing.  The really basic, simple point is that Dramatica divides its material (the Grand Argument Material, 1 of every Dram term adding up to a complete picture of \"life the universe and everything\") into four quarters: the MC gets 1/4, the IC gets 1/4, the relationship between them gets 1/4, and the overall external action of the story gets the remaining 1/4.  That's the whole pie, there is nothing left to assign to a third major character or their relationships with either of the first two characters.  What my idea above does is a direct answer to this - it redistributes the material into a flexible number of pieces so it can handle a varying number of major characters.\n\nDoing an analysis, or for my personal preference a walkthrough, to demonstrate the idea would be pointless without an audience that thought the idea was interesting and wanted to examine it in more depth.  And when you say \"not the correct way to see Dramatica\", it seems like you don't mean I've said anything inaccurate, you just think I'm taking the wrong attitude about it?  That attitude it how I see Dramatica when Dramatica encounters my personality and experience, my self.  I can't change who I am to make Dramatica seem different to me, and I won't pretend to have a different fake attitude about it.  So anything I wrote would have that same attitude, with the presumed result that you would dismiss it for the same reasons you are dismissing my post above.", "group_id": 2515, "id": 1484867}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309024969.0544989, "message": "I believe wholeheartedly that you have said something inaccurate.", "group_id": 2515, "id": 1484993}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1309026334.2641239, "message": "@sunandshadow  not sure I've been dismissing any post. Quite the opposite. I'd actually say you are not addressing the key issue here which has been adhered to a few times, which I think may have prevented the discussion going further. \n\nThe issue is, I don't think Dramatica is anywhere near as limited as you are suggesting. A third major character can be integrated into the OS, or if this has to be an alternative PoV character, then this can be dealt with as a subplot (with its own storyform). \n\nThe key factor here is PoV. If you add another PoV character, you are moving the audiences position in the story, seeing the story from a different point of view. Not having that in one storyform seems to make complete sense. I don't really see any evidence that you are correctly dealing with the difference between a major character and a PoV character.", "group_id": 2515, "id": 1485102}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309051810.9910409, "message": "@sunandshadow hey, so maybe we got off on the wrong foot ;) but I'm curious, assuming you're following the Story Mind concept -- where stories are an analogy to the mind's problem solving process -- how do you evaluate the actions and decisions of your character, i.e. where do you find Theme? If you've moved character up from the Elemental level to the Variation level level, have you moved Theme up to the Type level? For that matter, where do you find Plot or Genre? I'm seriously curious because I have a feeling this is the problem I have with some of your ideas.", "group_id": 2515, "id": 1486711}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309077097.4441669, "message": "@MikeDerk Please do explain what specifically you think was inaccurate.", "group_id": 2515, "id": 1487865}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309078228.3943861, "message": "@Mikeaja I think using a second storyform is not generally a good solution.  It really shouldn't be necessary for a movie or novel which isn't excessively long.  (The excessive length would imply that it might legitimately have duplicates of many Dramatica terms, which would be the clearest evidence of having two storyforms.)  But for a standard length movie or novel 70k words or less, there really isn't room for much duplication unless a lot of things are also being left out to make room.  And that would be a rather uneven and un-unified manuscript, which is a problem Dramatica is intended to correct (the reference for this intention is the comic book).\n\nIncorporating the a third major character in with the OS isn't greatly different from my idea here, but it's in my opinion more of a kludge.  It might work really well if the third major character just happens to be the antagonist (often this character personifies the bad elements of the setting) or if the third major character happens to be someone who personifies one or more good elements of the setting.  But it would work a lot less well if the third major character was a love interest, best friend, or someone who had a real relationship with the MC separate from the plot.  I think my solution is more elegant because it allows the writer to clearly specify which elements should be internal to the third character and which elements should be in the relationships between that character and each other character.\n\nAs far as POV goes, this is just my opinion but I would say audience POV comes from the way the story mind communicates the premise and the \"moral\" (the Judgment and author's bias/emotional argument).  So, I would say that it doesn't matter how many characters you use to communicate your argument to the audience, it doesn't change the audience point of view.", "group_id": 2515, "id": 1487896}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309079666.3611269, "message": "@jimhull I'm skeptical but I have nothing better to do and it's an interesting question.  I'm going to address genre first because I think that issue is a bit separate from the others, which are rather entangled with each other.  Firstly, I believe there are two different types of genres, and it's important to distinguish between them because they don't behave the same.  The two types I call trope genres and plot genres.  Trope genres include science fiction, fantasy, and various historical periods including modern.\n\nTrope genres pretty much do not appear in Dramatica because any storyform can be done in any trope genre, and stories can be translated from one to the other without loss of meaning.  Functionally there isn't any difference between a spaceship and a sailing ship, a laser pistol and a sword, magic and \"sufficiently advanced technology indistinguishable from\".\n\nPlot genres, on the other hand, can be observed in Plot Progression (so that would be at the Type level) and devoting more or less page count to one throughline or another.  Romances for example tend to have a very well-represented SS (or in my version above, relationship quads) while action and suspense movies tend to focus the lion's share of their time of the OS and MC, minimizing the rest.  And Plot Progression is just a large-scale version of PRCO; the difference between plot genres is like the difference between the slap followed by the scream and the scream followed by the slap.  Actually, the Big 4 could be considered a third kind of genre having to do with the mood or theme of the story, but this is not a kind of genre anyone ever talks about, so there's not much to say about it, besides the fact that it's still at the Type level, but Type as Concern instead of Type as Plot Progression.", "group_id": 2515, "id": 1487942}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1309080242.8010449, "message": "@sunandshadow   I genuinely don't want to sound patronising but it might come across that way. I don't believe that I know it all as a writer or Dramatica user. \n\nI think you are making a fundamental error with characers both from a Dramatica and a writing perspective, with regard to major and PoV characters.I think your alternative way of using Dramatica goes against good writing principals of structure. Your description of PoV characters is not the generally accepted way, you appear to have a gap in your writing knowledge here. And that's nothing to do with Dramatica. I think other readers here will be very surprised at your view of characters.\n\nThe point of view you are describing is the effect of theme, the arguments presented and the audiences take on that. That is something different. Look at Dramatica (or other analysis) of popular stories. It is clear who the PoV character is. This is separate to theme, arguments presented.\n\nI think you need to go and research PoV characters in writing, and Main Characters in Dramatica compared to OS characters. Maybe your writing doesn't need it, but to discuss this and 'sell it' you need to know it. You don't want numerous Main Characters / PoV characters unless you are suggesting a different type of writing. The audience would be confused. I'm convinced the reason Dramatica is not doing what you think it should, and the reason you want to change it, is because you have a different view of character (than the generally accepted one). I don't think your approach will work. \n\nIn fact, I would go so far as to say you may need Dramatica, as-is, more than some here to move you towards a more coherent character setup.", "group_id": 2515, "id": 1487976}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309080898.985342, "message": "@jimhull Okay, now theme and plot.  I personally am the kind of writer who sees plot as naturally arising from characters.  Plot is just what characters do, internally and towards each other.  Theme too is related to character.  The Issue, Unique Ability, and Critical Flaw of each character are what I see as the most direct expressions of theme.  And the setting can be considered a character - certainly it should have a personality, or perhaps I should say it unavoidably has a personality and the writer should consider this as part of the story design process instead of subconsciously.  And the setting should also behave consistently, one of the most essential properties of a character.  So,  characters can be seen as incorporating everything below the Type/Act level of the plot.\n\nAs far as Variations vs. Elements goes, I think I mentioned somewhere above that I see the two sets of terms as parallel and to some extant interchangeable.  I see the Elements set as the left-brained or unbiased version, and the Variation as the right-brained or biased version.  Because the Elements set is rather sterile, I think it's more difficult for a writer to mentally connect it to actual story details.  But I think the Elements set is specifically useful for talking about _how_ characters think (their mental mechanics) and checking to make sure they are consistent in this way (akin to Approach and Problem Solving Style), while the Variations set is more useful for addressing what characters think is important (i.e. each character's portions (or \"vectors\" in the Vector Theory of Plot) of the thematic argument.", "group_id": 2515, "id": 1487993}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309081854.1868179, "message": "@Mikeaja You keep saying \"the POV character\" as if there were only one.  There is a large percentage of modern fiction where the POV, whether we're talking about first person or close third, follows different characters for different chapters or scenes.  But the simplest functional definition a POV character is any character whose mind the reader gets to look through, even if it's only for one scene.  A slightly more elaborate definition might say that a POV character is any character whose internal thoughts and emotions are developed and shown to the reader.  In Dramatica, this is both the MC and IC, so that's a default of two POV characters.  This type of two-viewpoint structure is extremely common in romance novels, stories about two rivals, and buddy stories.  An ensemble structure, often seen in sitcoms, war stories, political epics, or any story with a team of \"good guys\" can use as many as six or eight viewpoints while still having excellent structure and not confusing the audience at all.", "group_id": 2515, "id": 1488032}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1309089501.6226349, "message": "@sunandshadow    Well, this is agree to disagree territory I guess. A PoV character is only one we spend time with and grow. A writer can temporarily put us in the mind of anyone for a scene or two. \n\nWith regards to Dramatica structure, the MC and IC are not both PoV characters (although a writer can change that of course). The MC is. However, I'd say it's likely we get in the IC's mind more than other characters due to the role of influence to MC.\n\nI still say you are adding limits to Dramatica that are not there. As was discussed in another thread, with ensemble casts is different, and likely you would have different stories when the PoV changes. Trying to define that in one structure seems like a lost cause to me.", "group_id": 2515, "id": 1488536}, {"user_id": 30951, "stars": [], "topic_id": 39827, "date_created": 1309090011.846844, "message": "An example would be, the MC our audience position who is also Sidekick, the Protagonist (perhaps a friend of Sidekick), an Antagonist and a Guardian (who also happens to be the IC). That's 4 major characters, handled by one storyform. We can be put in the minds of any of them for a short period of time. But to have a story that makes sense as a single story, we need a single PoV (or limits here) otherwise the story changes. If the MC changed to the Protag half way through, our view of the story is different, therefore it is a different story.\n\nTherefore we can have 2 storyforms. the fact that it is one TV episode or one film doesn't matter. This works fine in Dramatica. Your explanation of this suggests you are trying to fix something that isn't broken.\n\nPerhaps the way to approach this is not 'Dramatica is broken, lets fix it' but an alternative way at looking at certain types of stories. However, this still needs a clear example.", "group_id": 2515, "id": 1488569}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309099272.779259, "message": "@sunandshadow I was being sincere. I was driving through the desert for 8 hours yesterday and I had nothing better to think about. It'll take me awhile to read the above...", "group_id": 2515, "id": 1489095}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309112722.6392081, "message": "@sunandshadow  I think you have said a multitude of incorrect thing, but they all seem to stem from what you call the generalized definition of a GAS -- that  it uses all dramatica terms at least once.", "group_id": 2515, "id": 1490053}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309112902.920249, "message": "I believe what you are referring to is this: \"As long as we illustrate each appreciation somewhere, we have fulfilled our obligation to our structure.\" (p231)\n\nI don't believe this says \"use everything once and you've got a full, balanced and structured story.\" \n\nI think this says, \"You have a structure -- the storyform -- and you're obligated to use everything at least once to get the most out of it.\"", "group_id": 2515, "id": 1490062}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309122533.19367, "message": "@MikeDerk - Well, have you read the Dramatica comic book? The problem the screenwriter in the comic book has is that his script has \"no heart, no depth\" - in other words it's all OS throughline of Situation and MC throughline of activity but it's unbalanced because it's lacking a thorough exploration of the other throughlines and domains. Dramatica is suggested as a solution to this problem. It's pretty much implied that going through all the steps of developing a story concept in Dramatica, which includes doing something with every Dramatica term, is what will fix the problem by making sure all thematic areas are explored, resulting in a balanced story.\n\nAlso, in Chapter 4 of the Dramatica theory book there is a section titled \"Archetypes - A Balanced Part of the Complete Argument\" In this section it says \"As a group, the Archetypal Characters represent all the essential functions of a complete Story Mind, grouped in simple patterns.\" Then in chapter 8 it says, \"First, Dramatica tells us there are only 16 Motivations to spread among our players. If we use the same characteristic twice, it clutters our story. If we neglect to employ one, there will be a hole in our story's argument.\"  The same applies to the other three quarters of the Elements, and is shown in the program in the Build Characters screen.", "group_id": 2515, "id": 1490863}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309124641.771661, "message": "@jimhull Ok then.  Take your time.  My own thoughts have been wandering in a whimsical direction.  I was thinking, if a character in a story were in an argument like I unexpectedly found myself in in this thread, which Elements and Variations would that character be representing.  Disclaimer: all of the following is just me mentally goofing around.\n\nI thought I was presenting an Evaluation of Theory which was Unproven yet, but the reaction I got was a mix of Hunch and (Dis)proven.  I wanted to show a Method of Reevaluation, but got a response of Non-acceptance.  I see my Purpose as Change to fix Inertia, but it seemed to be interpreted as Chaos harming Order.  The Motivation of misplaced Faith seems to have been an accusation in both directions.\n\nOn a higher level, I would see my \"Internal Quad\" as being Openness, Delay, Choice, and Preconception, and I was expecting our \"Relationship Quad\" in this thread to be Investigation, Appraisal, Reappraisal, and Doubt, with a side of Value, Confidence, Worry, and Worth.  I was puzzled to get a reaction in the realm of Wisdom, Skill, Experience, and Enlightenment, and I interpreted (perhaps wrongly) this group's \"Internal Quad\" as Fact, Security, Threat, and Fantasy.  I didn't really have any expectations that would correspond to an \"External Quad\". but my current guess would be that one is Work, Attract, Repel, and Attempt, and another might be Closure, Hope, Dream, and Denial.", "group_id": 2515, "id": 1491125}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309142314.56181, "message": "Your method changes the focus of an argument in such a way that the audience won't be able to gather what it is you're saying. They won't be able to quadriangulate the inequity at hand. Judgment and Outcome won't mean anything because they're not tied to a specific problem.", "group_id": 2515, "id": 1492308}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309142254.2750471, "message": "The reason picking one Concern forces the other three into the same quadrant (Doing requires Being, Progress and Preconscious) is because each throughline is taking a different look at the same problem. The idea being that in real life we can only see a problem from three different \"angles.\" This is why people return to stories, because complete stories (complete arguments) are giving them all four at once. With out all four, the events in the story become meaningless.", "group_id": 2515, "id": 1492303}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309142195.574522, "message": "@sunandshadow ok now I know why I get so worked up :) That completeness you're talking about is not about using every term in the model, but rather using every term in the model to make a *complete argument*. This is what the comic book meant by a balanced story -- a balanced ARGUMENT. When you pick a quad of Issues from under Future and then another from under Conscious the argument loses all of its potential for meaning.", "group_id": 2515, "id": 1492296}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309144752.3117759, "message": "@sunandshadow I think the comic is meant to be a basic introduction that the theory book expands upon.\n\nI'm not that well versed in Build Character, but my understanding of it is that it cannot be predicted from the storyform, in so far as the traits the characters have are not necessarily related to the problem the story is exploring.", "group_id": 2515, "id": 1492564}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309144902.5903721, "message": "For instance, a character like Han Solo could be in any story. He would have certain traits. (To pick one at random: re-evaluate).\n\nThe storyform could also say that the symptom of the MC was re-evaluate. But, I don't think this would mean that Han was the MC.", "group_id": 2515, "id": 1492568}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309202878.615381, "message": "I'm going to bow out of this conversation. I'm not getting any work done.", "group_id": 2515, "id": 1498660}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309203197.4051111, "message": "I'm guessing we have a lot of common ground when it comes to linking character traits to the story itself. But I'm going to have to leave it at that.", "group_id": 2515, "id": 1498708}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309202584.216316, "message": "@jimhull You wrote, \"That completeness you're talking about is not about using every term in the model, but rather using every term in the model to make a *complete argument*.\"  I don't see how that disagrees with me; of course you want to make a complete argument; that's why having missing thematic elements is a problem, because an argument with missing elements is incomplete.  I can see that you're saying where the elements go in the structure is important to making a coherent argument - I agree with that too.  I've personally observed that in terms of the relationships between the MC's Unique Ability and the IC's critical Flaw and vice versa.\n\nBut I think that to restructure Dramatica to be compatible with ensemble stories it's necessary to take apart the current way that Dramatica guides a writer about where to place each element, which especially includes Judgement.  Seeing a story from four angles is memorable, but it doesn't preclude the possibility of seeing it from 5 or 6 angles.  In a set-up with multiple major characters each needs to have their own Judgment; having only one for the whole story is overgeneralizing.\n\nWhen re-inventing a system for determining which variations and elements should go where in an ensemble story it seems like a logical and solid first move to start with the assumption that all of them should go in at least once.  I was intending to develop the principles of placement of terms further after getting some feedback on the basic idea (the first post in this thread).  But the conversation didn't go that direction and I got no encouragement at all to begin the complicated project of reinventing those guidelines.  Since a properly reworked set of guidelines don't exist yet, it's a bit premature for you to conclude the result will confuse the audience.I don't think the story structures produced by the current Dramatica software are the only ones an audience would consider valid, not by a long shot.  Besides ensemble stories, the current system of assigning throughlines in dramatic pairs is intended to create high-conflict stories.  High conflict stories might sell better than lower-conflict stories, but there's nothing technically wrong with wanting to create a lower-conflict story.  I think there's a lot of ignored territory outside the programs capabilities and writers who are naturally drawn to those areas would benefit from an alternative tool to help them describe the stories they want to tell.", "group_id": 2515, "id": 1498601}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309202919.901418, "message": "I guess I'm not going to bow out, LOL.", "group_id": 2515, "id": 1498671}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309202876.71333, "message": "@MikeDerk You wrote \"...the traits the characters have are not necessarily related to the problem the story is exploring.\"  I personally would consider that a problem.  The traits the characters have ought to be related to the problem the story is exploring.  I've seen some very clever exercises outside Dramatica which take the premise of the story and the setting and use the two to generate an array of suggested characters to explore the premise completely.  Dramatica could be doing that too, and would benefit from growing that ability.", "group_id": 2515, "id": 1498658}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309325067.392365, "message": "I'm just giving you grief.", "group_id": 2515, "id": 1515013}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309325185.577935, "message": "Like I need more in this thread!!", "group_id": 2515, "id": 1515026}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309324181.526022, "message": "There aren't 5 or 6 angles. There are only 4 -- They, I, You, and We. Our current understanding of the universe doesn't allow for anymore!!", "group_id": 2515, "id": 1514964}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309324482.2948921, "message": "@jimhull This is why Dramatica has never been translated into Spanish. \n\nYo - I\nTu - You\nNosotros - We\nVosotros - You, but plural you\nUds. - They\n\nAnd don't even get into Korean, with it's Formal You and Informal You ...", "group_id": 2515, "id": 1514983}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309324719.5474629, "message": "Yeah, but you know what I'm talking about. Dramatica is about seeing a problem from the 4 perspectives simultaneously. Adding more just confuses the view, besides the fact that there aren't any more!!!", "group_id": 2515, "id": 1514997}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309324246.2869079, "message": "I think I've figured out where @sunandshadow is coming from. She personally believes (this is all assumption) that nothing is black-and-white. So, she doesn't want a story to say \"this works\" and \"this doesn't.\" \n\nShe wants all the grey fully represented as well, at the end of the story, because the problem will have a different impact on everyone involved.\n\nAm I on track?", "group_id": 2515, "id": 1514970}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309325192.228864, "message": "This is such a basic understanding of how we perceive our universe, that I'm not really even sure where to go from here.", "group_id": 2515, "id": 1515030}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309325286.6967001, "message": "I really think it has to do with not wanting to have a polarized take on a problem. The same way @sunandshadow prefers less-dramatic stories", "group_id": 2515, "id": 1515040}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309325416.0248599, "message": "Yeah but, nothing makes sense if you take away the whole way the mind works!! Dramatica was built on the mind's problem solving process. Those terms mean nothing without that context.", "group_id": 2515, "id": 1515061}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309335683.6088469, "message": "Well, my personal belief is that each different type of person has a different view. And rarely is the main character of a story particularly similar to me. And on top of that, even when people are in a relationship or a team they never really have a group mind or evaluate things from a perspective other than their individual one. So the whole I, you, we thing just seems alien to me. I might call it a Logical PS Style Idea that doesn't work for my Intuitive (I think the term holistic is better actually) mind.\n\nIt's a lot more natural to me to see it as (for example from the alien archeology story I put through the Dramatica program) person focused on the past, person focused on the present, person focused on change, and person focused on the future. That one happens to have 4 perspectives but there are 4 characters, not 2. Or, (from the Dragon Story I've worked on forever) person focused on cleverly manipulating others (for their own good against society's good) vs. person focused on forcing/annoying others vs. person focused on pleasing/serving others vs. person focused on imposing order/discipline on others (for society's good against their own good).\n\nIt's also fairly true to say that I don't see things as black and white. One example of what I think would be a good overall moral for a novel would be to show that in X circumstance it is not ethical that a character has taken a violent action, but in Y circumstance it is ethical for a character to take a violent action. In the Alien Archeology story I mentioned the solution to the problem is not for one of the four time-views to win, it's for the past and the future to compromise because together they are stronger and healthier than either separately. *cough* By your powers combined, I am Captain Planet! *cough*", "group_id": 2515, "id": 1515661}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309342237.784354, "message": "Oops, I realized I forgot to explain the dragon story example in Dramatica terms.  I think it's reasonable to see those four characters as Manipulation (manipulating others), Activity (forcing others), Situation (pleasing others), and Fixed Attitude (disciplining others)..", "group_id": 2515, "id": 1516074}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309367011.7946501, "message": "The four perspectives of context have nothing to do with logical vs. holistic. They have nothing to do with high-conflict or low-conflict. They are how the human mind appreciates meaning. The fact that they seem alien to you addresses the many difficulties experienced in this thread and elsewhere in regards to your work. It is so bizarre that you can see the completeness of past, present, progress and future yet can so easily dismiss the completeness of the four perspectives.", "group_id": 2515, "id": 1518432}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309368343.1739359, "message": "But I'm officially bowing out of this thread.", "group_id": 2515, "id": 1518695}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309368330.3358769, "message": "OMG!!! SO MANY RESPONSES!!!", "group_id": 2515, "id": 1518690}, {"user_id": 7645, "stars": [], "topic_id": 39827, "date_created": 1309368678.954664, "message": "Please take me with you.", "group_id": 2515, "id": 1518799}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309382092.469285, "message": "I definitely don't think the four perspectives are complete.  For some situations, namely simple binary thematic arguments between only two points of view, the 4 throughlines model works pretty well.  But It's my belief that in reality many arguments have 3 or 4 valid sides, not just two.  If that's a concept that just doesn't make sense to you, I'm not sure there's really anything else I can say, or how I could possibly convey why I feel it's really important to create a system which has room for more characters, each with their own thematic point of view.", "group_id": 2515, "id": 1522183}, {"user_id": 36525, "stars": [], "topic_id": 39827, "date_created": 1309557970.074934, "message": "@MikeDerk - not to drag you back into this thread, because I think it's pretty much over.  But I was reading back through this thread, copying the bits from my own posts into a file for archiving purposes.  I re-read one of your earlier posts and realized I hadn't understood what you were asking.\n\nThis post, where we were talking about a character with an internal quad of Fact, Threat, Security, and Fantasy: \"So, let me try to build on this.\n\nIf this is your MC, you could easily say that their \"problem\" is, say, Probability. Something new pops up and she thinks, \"This is probably a threat, our security probably isn't enough, etc.\"\n\nThe solution could then be Possibility -- she has to learn that it's possibly a threat and that more research is needed before running to the police yelling \"This is a fact!!\"\"\n\nWhat I actually should have responded to this is that Internal quad most directly corresponds to MC Issue (or IC Issue).  If you go into the theme browser and enter Fact, Threat, Security, and Fantasy under MC Issue there will be 16 choices remaining for MC Problem.  So basically, just knowing a character's Issue doesn't tell you what their Problem is in canon Dramatica.  Actually if you do it the other way around, choosing Probability as MC Problem in the story engine, it turns out that in canon Dramatica MC Issue can't possibly be anything in the Threat, Fantasy, Security, Fact quad if MC Problem is Probability.", "group_id": 2515, "id": 1545616}, {"user_id": 7664, "stars": [], "topic_id": 39827, "date_created": 1309571651.2464449, "message": "I was really pointing out that giving a character an internal quad seemed like a way to define their personality, in which case you could give them any problem you wanted, since it didn't define their domain.\n\nBut I guess you're saying it does. So... okay.", "group_id": 2515, "id": 1546590}]