[{"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304539593.56043, "message": "interested in hearing experiences of anyone working on a start up part-time while keeping a full time day job", "group_id": 250, "id": 919147}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304539615.4245329, "message": "legal/tax implications in UK", "group_id": 250, "id": 919152}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304539630.0675211, "message": "do you have to set up a company?", "group_id": 250, "id": 919155}, {"user_id": 30602, "stars": [], "topic_id": 33710, "date_created": 1304542194.377383, "message": "I am doing that. Not sure if everyone would be able to have the setup that I have.. I'm a contract Project Manager, I'm not busy, I use the office facilities to work on my startup like conference rooms, printers, software on the work computer.. I would say I do 2 hours of contract related work, and 6 hours of start-up work. But I continue billing 8 hours.", "group_id": 250, "id": 919639}, {"user_id": 30602, "stars": [], "topic_id": 33710, "date_created": 1304542508.452646, "message": "However, it's a compromise and a risk to your career. To maintain this slow paced workload here, I purposely do mediocre work - keep the ideas, contributions, and 'smart'ness to a low level. Just enough for them to want to keep you around, but not consider you for promotion.", "group_id": 250, "id": 919686}, {"user_id": 31410, "stars": [{"date_created": 1304547962.5046959, "user_id": 22183}, {"date_created": 1304572501.3779881, "user_id": 26065}], "topic_id": 33710, "date_created": 1304543912.9723921, "message": "I'll never fund a company founded by a \"johnny5\"... or work with one. Professional Ethics (and, frankly, old-fashioned integrity) are cornerstones to a successful start-up.  I currently work full-time at a $16B/yr company... which I don't enjoy all that much, but it pays the bills for me and the our start-ups my team and manage.  It's really about having a great team you can delegate to and TRUST! stamina and perseverance are also key... Don't expect to loaf around an watch tv nights an weekends.  Have plenty of passion and keep extra passion in reserves.  Our 4 start-ups are in various stages from mature to vapor-plans. Also across 4 distinctly diverse industries ensuring none of us get too burned out from one particular venture.  Taxes and legal is easy here in the states... I expense everything and file 1040 regular. Our immature start-ups are part of a blanket holding LLC while the mature ones graduate to their own legal entity (right now a C-Corp and another LLC).  Not sure if any of that was helpful, but that's how we do it here.... And most of us have day jobs.", "group_id": 250, "id": 920047}, {"user_id": 18478, "stars": [], "topic_id": 33710, "date_created": 1304545042.672277, "message": "I am doing just that. I work full-time for UPS Canada in their Brokerage Dept. from 4am to 1230pm Mon-Fri then after work for am usually on my laptop running http://www.HogWildHost.com with my business partner.  Its a lot of hard work and keeps your time management skills in check.", "group_id": 250, "id": 920343}, {"user_id": 18478, "stars": [], "topic_id": 33710, "date_created": 1304545112.439044, "message": "@Luke_Ubiquitous At the same time not all of us can simply afford to quit our full-time jobs as they pay the bills and help fund our startups.  We all have to start somewhere and somehow.", "group_id": 250, "id": 920358}, {"user_id": 22183, "stars": [], "topic_id": 33710, "date_created": 1304548132.8895061, "message": "@futurespective to the 2nd part of your question, look up sole proprietorship under UK tax laws.  If you don't plan on partnering with anyone and it won't cost you much to run a website or webapp, you probably don't need to incorporate a company for your side business.", "group_id": 250, "id": 920854}, {"user_id": 22183, "stars": [], "topic_id": 33710, "date_created": 1304548421.8509309, "message": "And obviously, get professional help or advice when you launch.  i.e. when you are ready to apply for incubation or partnership.  Hope this helps.", "group_id": 250, "id": 920891}, {"user_id": 31293, "stars": [], "topic_id": 33710, "date_created": 1304550574.5512111, "message": "Typically not a great idea, but it does happen. Better off to quit and/or just consult.", "group_id": 250, "id": 921192}, {"user_id": 15929, "stars": [{"date_created": 1304572517.767869, "user_id": 26065}], "topic_id": 33710, "date_created": 1304569192.042927, "message": "not cool johnny5! you're scamming your employer...", "group_id": 250, "id": 924278}, {"user_id": 15929, "stars": [], "topic_id": 33710, "date_created": 1304569820.413059, "message": "2. consult with friends / family, accountant and lawyer, in that order. I'll doubt you'll need to see a lawyer until you're ready to take the plunge.\n3. yes (but i'm in Aus)", "group_id": 250, "id": 924396}, {"user_id": 15929, "stars": [], "topic_id": 33710, "date_created": 1304569555.3726959, "message": "1. imho moonlighting is only possible on early stage, when you're just testing the water (at this point, it's arguable whether you're a startup or not),.. or you're not the person with ceo role, in this case the co-founder with ceo role should be full time, again IMHO", "group_id": 250, "id": 924354}, {"user_id": 25716, "stars": [], "topic_id": 33710, "date_created": 1304588180.9665649, "message": "I really do not understand your sentiments at @johnny5alive and I would be more than happy to fund a company with him. A person who can do risk management, can adjust/manage time, and do the sufficient work to keep everyone happy is a big plus in my book. Who cares that he doesn't try excel at his work, but do enough to keep his employer happy? Everyone is good, everybody is happy. I would be much more aware funding companies with you other guys who suggest that you need spend a lot of energy in things that really doesn't require that energy or have your passion. Waste of talent, energy and mind.", "group_id": 250, "id": 927062}, {"user_id": 31410, "stars": [], "topic_id": 33710, "date_created": 1304604455.4029191, "message": "@MarkLaViolette I'm", "group_id": 250, "id": 929377}, {"user_id": 31410, "stars": [], "topic_id": 33710, "date_created": 1304605033.5177641, "message": "@MarkLaViolette our team and I have full-time jobs too. You're right, most folks do not have enough boot-strapped capital to quit their day jobs.", "group_id": 250, "id": 929585}, {"user_id": 30602, "stars": [], "topic_id": 33710, "date_created": 1304615116.8908181, "message": "@dsch thanks. Really, the goal is to create enough time to maximize my attention on my startup. I think you guys @unwrangle and @Luke_Ubiquitous are picturing me as slacking at my desk, skipping meetings, and missing deadlines. If that were the case, I'd for sure be fired, and I'd probably dread coming to work would hate that peers think negatively of me. Anyhow, I think to everyone out there that can commit 100% to their full-time job plus work their startup, I bow to you. The impression and relationships you're building at your job might actually come back to help your startup in the form of clients, awesome cofounder, advisor, etc.", "group_id": 250, "id": 931745}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304618789.613312, "message": "one of the advantages i see of setting up a company is potential anonymity", "group_id": 250, "id": 932423}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304618403.961, "message": "thanks everyone", "group_id": 250, "id": 932352}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304618730.441834, "message": "@gorithm i looked up sole proprietership and UK law requires that \"In the United Kingdom the proprietor's name must be displayed on business stationery, in business emails and at business premises, and there are other requirements\"", "group_id": 250, "id": 932416}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304618904.9499791, "message": "however not sure about additional costs for setting up and maintaining a company.", "group_id": 250, "id": 932436}, {"user_id": 14277, "stars": [], "topic_id": 33710, "date_created": 1304661970.014708, "message": "I'm working on my new startup - http://constructiv.co around a 9-5 that pays the bills. Would love to have all day, everyday to work on it. That's why I'm seriously considering raising money to fund development over the next 12-18 months.", "group_id": 250, "id": 938853}, {"user_id": 13920, "stars": [], "topic_id": 33710, "date_created": 1304663622.8999419, "message": "thanks for sharing your experiences on your blog", "group_id": 250, "id": 939067}, {"user_id": 30602, "stars": [], "topic_id": 33710, "date_created": 1304679678.2757859, "message": "@techAU wow, you're really doing a great job executing the idea. The part in the video where you enter a URL, and a thumbnail of the site immediately appears is totally impressive.", "group_id": 250, "id": 940481}]