[{"user_id": 21608, "stars": [], "topic_id": 13390, "date_created": 1300300224.5384679, "message": "http://ie6countdown.com/\n\nNow that we’re in 2011, in an era of modern web standards, it’s time to say goodbye.", "group_id": 142, "id": 368407}, {"user_id": 9108, "stars": [], "topic_id": 13390, "date_created": 1300325955.9717219, "message": "@robschaap It's good to see that even Microsoft wants to see IE6 die. It's just disappointing that Windows XP users are still stuck with IE8 if they can't/don't want to move to a third-party browser.", "group_id": 142, "id": 370737}, {"user_id": 22099, "stars": [], "topic_id": 13390, "date_created": 1300328636.1816871, "message": "@JohnFail Honestly, here's one place I agree with Microsoft. Windows XP must die.", "group_id": 142, "id": 370945}, {"user_id": 22321, "stars": [], "topic_id": 13390, "date_created": 1300355094.241416, "message": "unfortunately for those who develop business applications, IE6 is going to stick around until Windows 7 becomes the operating system of choice. I'd give it at least another couple years", "group_id": 142, "id": 372616}, {"user_id": 9108, "stars": [], "topic_id": 13390, "date_created": 1300357775.4559391, "message": "@duck You and me both. To be honest, I didn't like Windows XP even when it was in its prime. I credit it for my using Linux. My opinions on the OS aside, though, there are still a lot of people using it, and that's not likely to change for awhile.", "group_id": 142, "id": 372851}, {"user_id": 22099, "stars": [], "topic_id": 13390, "date_created": 1300517203.429529, "message": "@JohnFail but as long as xp lives on, Internet Explorer will not die. Now, only if there was a way to get them to ship win7 with no browser installed world wide...", "group_id": 142, "id": 387156}, {"user_id": 45, "stars": [{"date_created": 1300562067.815315, "user_id": 9108}], "topic_id": 13390, "date_created": 1300521807.6963091, "message": "And I refuse to accept the argument \"you need a modern OS to run a modern browser\". Firefox 4 has a ton more support for advanced HTML5 features compared to IE9 and it'll run on Windows 2000.", "group_id": 142, "id": 387246}, {"user_id": 45, "stars": [], "topic_id": 13390, "date_created": 1300521726.036556, "message": "I'd be ok with them simply forcing an upgrade to IE9 on XP users. The problem with no IE9 on XP is the OS still has something like 60% of the PC market. IE9 isn't perfect as far as support for html5 and web standards in general goes, but its a hell of a lot better than IE8, and Microsoft's refusal to put the effort into releasing it on XP is just going to guarantee a continuation of the cross browser problems web developers have been dealing with for the last decade.", "group_id": 142, "id": 387243}, {"user_id": 9108, "stars": [], "topic_id": 13390, "date_created": 1300562134.9454191, "message": "@zac I couldn't agree more with this point about the modern OS/browser combination. If Microsoft doesn't want to completely kill support for XP as far as patches are concerned (and continues to extend the EOL timetable), then they should at keep developing their browser for it, too.", "group_id": 142, "id": 389191}, {"user_id": 17765, "stars": [{"date_created": 1300611289.0297599, "user_id": 22944}], "topic_id": 13390, "date_created": 1300604988.5067699, "message": "IE6 is the biggest pain in the neck for many web developers (as far as browser compatibility). I will be happy to see it go!", "group_id": 142, "id": 390971}, {"user_id": 22944, "stars": [], "topic_id": 13390, "date_created": 1300611305.040103, "message": "Guys from http://saveie6.com/ do not approve this post.", "group_id": 142, "id": 391410}, {"user_id": 22835, "stars": [], "topic_id": 13390, "date_created": 1300615081.927886, "message": "I can't wait for IE6 to die, I'm constantly having to tweak or hack my code to get things to work. I actually wish IE would die altogether, 7 and 8 have a lot of problems and even 9 is breaking some of my perfectly valid code.", "group_id": 142, "id": 391659}, {"user_id": 22988, "stars": [], "topic_id": 13390, "date_created": 1300633111.8449359, "message": "http://www.ie6death.com/ - seems that death of this browser makes new urls sexy.", "group_id": 142, "id": 392182}, {"user_id": 19708, "stars": [], "topic_id": 13390, "date_created": 1300719681.4136281, "message": "I can't wait for IE* to die", "group_id": 142, "id": 398718}, {"user_id": 22988, "stars": [], "topic_id": 13390, "date_created": 1300727274.5367179, "message": "well IE9 is relatively good I think, good catch-up I mean.", "group_id": 142, "id": 400174}]