[{"user_id": 3611, "stars": [], "topic_id": 46424, "date_created": 1318335530.0110979, "message": "The question of whether the complexity class P is equal to the complexity class NP has been a seemingly intractable problem for over 4 decades. It has been clear that if an algorithm existed that would solve the problems in the NP class in polynomial time then P would equal NP. However, no  one has yet been able to create that algorithm or to successfully prove that such an algorithm cannot exist. The algorithm that will be presented in this paper runs in polynomial time and solves the 3-satisfiability or 3-SAT problem, which has been proven to be NP-complete, thus indicating that P = NP. \n\nhttp://arxiv.org/pdf/1110.1658v1", "group_id": 12, "id": 2324532}, {"user_id": 29, "stars": [], "topic_id": 46424, "date_created": 1318358585.639662, "message": "i think you have two problems.", "group_id": 12, "id": 2326651}, {"user_id": 12145, "stars": [], "topic_id": 46424, "date_created": 1318405249.3087931, "message": "As I understand it, he is able to determine, in polynomial time, whether or not a give 3-SAT is solvable, but is not able to find the solutions of a solvable 3-SAT in polynomial time.", "group_id": 12, "id": 2331018}, {"user_id": 3611, "stars": [], "topic_id": 46424, "date_created": 1318507255.404506, "message": "Yes, it seemed too simple a solution that perhaps the author didn't fully understand the problem. Nevertheless, interesting.", "group_id": 12, "id": 2339008}, {"user_id": 1516, "stars": [], "topic_id": 46424, "date_created": 1318537136.0684071, "message": "@chrisvest last paragraph at page 4: \"In addition, although it is not required to solve the present problem, it is clear that if a formula is satisfiable then the bit field in the algorithm (the @Result variable) could be used to determine which sets of values could be assigned to the variables to satisfy the formula.\" Doesn't this mean he can actually solve it? :S", "group_id": 12, "id": 2341582}, {"user_id": 1516, "stars": [], "topic_id": 46424, "date_created": 1318537292.75541, "message": "the biggest problem with his approach is that it requires operations on 2^n-sized ints (which are not constant)", "group_id": 12, "id": 2341591}, {"user_id": 29, "stars": [], "topic_id": 46424, "date_created": 1318897303.5672221, "message": "oh thats weird. did my second message not post?", "group_id": 12, "id": 2372117}, {"user_id": 1516, "stars": [], "topic_id": 46424, "date_created": 1319018902.3245039, "message": "I only see \"i think you have two problems.\"", "group_id": 12, "id": 2383826}]