[{"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381020.3481009, "message": "Por unos posts, me causa ruido ver como algunos  del grupo tienen una concepción muy romántica de lo que es un startup.", "group_id": 965, "id": 467021}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381030.5695369, "message": "Ven a un startup como una serie de pasos que hay que cumplir para lograr el éxito. Como si fuera el script de Facebook. Esos pasos incluyen palabras como \"inversionista ángel, \"levantar capital\", \"VC\" y \"primera ronda\".", "group_id": 965, "id": 467024}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381047.5781951, "message": "La gran diferencia es que tú le sabes mucho más a las compus y quieres capitalizar tu conocimiento. ", "group_id": 965, "id": 467030}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381056.658458, "message": "Si en verdad tu idea es buena, sólida y bien trabajada, el dinero de los clientes no debe ser difícil de encontrar.", "group_id": 965, "id": 467032}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381038.8349459, "message": "La realidad es que el startup es más similar de lo que crees a la peluquería de la esquina, al negocio de contabilidad del Lic. Godinez o un despacho de arquitectos. Es un nuevo negocio que aspira a crecer.", "group_id": 965, "id": 467025}, {"user_id": 2946, "stars": [], "topic_id": 15967, "date_created": 1301383000.0942869, "message": "+1, Deberías seguir escribiendo en tu blog. Tu experiencia es útil.", "group_id": 965, "id": 467429}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301381068.0158429, "message": "Más sudor y menos alucine.", "group_id": 965, "id": 467037}, {"user_id": 12133, "stars": [], "topic_id": 15967, "date_created": 1301412749.8898721, "message": "Venture capital o capital de riesgo.", "group_id": 965, "id": 470063}, {"user_id": 19920, "stars": [], "topic_id": 15967, "date_created": 1301412707.910507, "message": "que es VC?", "group_id": 965, "id": 470054}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301415018.378968, "message": "@edmz Reconozco que tienes mucha razón en que la mayoría de los startups crecen de manera orgánica y simplemente se deben definir como \"nuevos negocios con aspiraciones a crecer\" (La peluquería no es el mejor ejemplo, pero entiendo a lo que te refieres). También creo que todo se genera con mucho sudor y poco alunice. Si tienes claro eso, tienes el potencial de llegar muy lejos.", "group_id": 965, "id": 470416}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301415655.8477471, "message": "@edmz Concluiría diciendo que la inversión no es un sueño guajiro, simplemente era algo que no era común ver en México antes, pero ahora que empieza a existir, la puedes aprovechar si es que quieres crecer a un ritmo al que tus ventas actuales no te lo permiten. Sin embargo, la inversión, no es algo para todos y coincido con todos los comentarios en el grupo que hablan sobre la otra opción, el bootstrapping o \"rascarte con tus propias uñas. Ambos tienen sus pros y sus contras.", "group_id": 965, "id": 470549}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301416279.9124191, "message": "@albrtk Lean startup es genial, y aunque seguirlo no es tan fácil, justo te permite ir aprendiendo en el proceso. En Mexican.VC sólo invertimos en lean startups.", "group_id": 965, "id": 470620}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301415360.388258, "message": "@edmz En lo que no estoy de acuerdo es en tu generalización de \"alucine\". Lo que para uno puede ser irreal, para otro puede ser el día a día. La realidad es que el abanico de empresas que acceden a capital es tan amplio que no porque alguien mencione VC, significa que piensa que un día va a tener 500 millones de usuarios y una valuación de 70 billones de dólares. Cuando hablamos de inversió, hablamos de startups desde el tamaño de onSwipe (la empresa que @soska ayudó a construir). Es una empresa que levantó 1 millón de dólares hace algunos meses y ese dinero le está permitiendo hacer los movimientos necesarios para crecer su negocio. No es el dinero per se, el el dinero alineando la visión y el sudor de sus fundadores y empleados. Y así hay muchos casos. Una gran cantidad de los productos que usas hoy en día recibieron inversión y eso les permitió llegar a tí. Inclusive una buena parte de los proyectos open source grandes reciben algún tipo de financiamiento que les permite poder cubrir los fuertes costos de mantener y mejorar bases de código tan grandes.", "group_id": 965, "id": 470493}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301415794.9178209, "message": "Disclaimer (o #yoconfieso): Mi trabajo es encontrar startups que tengan el potencial y deseen recibir capital semilla de inversionistas de Silicon Valley. Es por ello, que para mí, hablar de inversión es *justamente* poner los pies en la tierra. Es mi día a día.", "group_id": 965, "id": 470566}, {"user_id": 19921, "stars": [], "topic_id": 15967, "date_created": 1301415968.452271, "message": "No hay un camino pactado hacia la meta de todo Startup que se respete, es decir, adquisición de usuarios y market-fit. En eso estoy de acuerdo. Pero, lo bonito de la metodología del Lean Startup es que permite probar constantemente nuestras teorías contra la realidad e integrar lo mejor de lo que salga a nuestras empresas.", "group_id": 965, "id": 470586}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301419743.918026, "message": "@cesarsalazar Y como apunte ñoño y trivial, hace años, durante la burbuja anterior, había en México compañías de VC mexicanas que estaban prestas a apostar su dinero en el puntos com del país. Creo que se perdió mucho dinero en aquellos tiempos.", "group_id": 965, "id": 470910}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301417744.8273151, "message": "@cesarsalazar mi generalización de alucine claramente va para el que está confundiendo poner una empresa con simular que es parte del próximo twitter. En tu caso, si trabajas para una firma de VC, pues entendible (y esperable) que manejes esos términos en tu dia a dia.", "group_id": 965, "id": 470745}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301418624.3248401, "message": "Cierto. Creo que lo que intentas hacer es muy valioso: recordarle a las personas que el camino no es fácil, que se empieza en pequeño, y que luego se empieza a crecer. A mí lo que me gustaría agregar es que me encantaría ver más personas pensando en grande (y trabajando durísimo por ello). Tal vez no va a salir de aquí el próximo Twitter. Pero las personas correctas con trabajo y dedicación pueden lograr cosas enormes :)", "group_id": 965, "id": 470798}, {"user_id": 26117, "stars": [], "topic_id": 15967, "date_created": 1301420669.688334, "message": "Hola, en donde se puede obtener informacion sobre la metodologia Lean startup?..y apuntando a lo que comento @cesarsalazar, como dice Trump, si de todos modos vamos a pensar hay que hacerlo en grande, creo que como Mexicanos tenemos ese potencial..!!", "group_id": 965, "id": 470988}, {"user_id": 26088, "stars": [], "topic_id": 15967, "date_created": 1301419725.9856391, "message": "A nosotros no nos caeria nada mal un seed funding para de una vez dejar la odiosa consultoria! :P y dedicarnos full a nuestro startup", "group_id": 965, "id": 470909}, {"user_id": 20022, "stars": [{"date_created": 1301422683.351105, "user_id": 19921}], "topic_id": 15967, "date_created": 1301421497.1178701, "message": "A veces hay que creersela , por no creersela hay muchos buenos desarrolladores mexicanos  que en lugar de cofounders , se quedaron en maquiladores de los suenos de quienes si pensaron en grande. y ejemplos hay muchos. Soniar, como le llaman unos y trabajar no son excluyentes. (perdonen mi teclado)", "group_id": 965, "id": 471087}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301422885.35744, "message": "@edmz La vida es demasiado corta cómo para lamentarnos de los fracasos de otros. Nos toca aprender del pasado y construir nuestros propios éxitos y fracasos ;)", "group_id": 965, "id": 471244}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301423174.7370541, "message": "@tonymx http://custdev.com y http://leanca.mp son buenos lugares para entrarles", "group_id": 965, "id": 471298}, {"user_id": 19938, "stars": [], "topic_id": 15967, "date_created": 1301423703.1827559, "message": "@cesarsalazar No quería que sonara a mal augurio, no es mi intención. Al contrario, les deseo éxito. Sólo quería hacer notar que no es la primera vez en México que las empresas emergentes de tecnología con aspiraciones a crecer rápido pueden conseguir dinero con VCs.", "group_id": 965, "id": 471390}, {"user_id": 24160, "stars": [], "topic_id": 15967, "date_created": 1301425136.815414, "message": "@edmz :)", "group_id": 965, "id": 471622}, {"user_id": 3084, "stars": [], "topic_id": 15967, "date_created": 1301428443.3336811, "message": "También les sugiero el blog de Eric Ries (http://www.startuplessonslearned.com) y el de Steve Blank (http://steveblank.com) por medio de los cuales me interesé en las lean startups.", "group_id": 965, "id": 471924}, {"user_id": 2946, "stars": [], "topic_id": 15967, "date_created": 1301430374.44309, "message": "@willygru Le predicas al coro brother :)", "group_id": 965, "id": 472166}, {"user_id": 26117, "stars": [], "topic_id": 15967, "date_created": 1301431507.731436, "message": "Gracias por los links @cesarsalazar y @willygru, estan bastante interesantes...!!", "group_id": 965, "id": 472280}, {"user_id": 3084, "stars": [], "topic_id": 15967, "date_created": 1301431015.6354799, "message": ":) Claro claro @soska. Solo me fui a lo básico por que vi a que @tonymx está interesado en enterarse de que va esto de las lean startups ;-)", "group_id": 965, "id": 472217}, {"user_id": 26089, "stars": [], "topic_id": 15967, "date_created": 1301500307.8665209, "message": "@tonymx, Este libro esta muy bueno http://www.custdev.com/", "group_id": 965, "id": 482481}]