[{"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304143469.9162011, "message": "@jescarter i see webservers and databases and my spidery sense tingles LOL that is good sounds like that video comes along great!!! I mean the backend is just linux running, also i guessing you use apache? you could check the .htacess files and make sure they are correct i mean the beauty of the cloud is not having to do much, i am a sysadmin for my college which is about 15 racks, and we use oracle as our database and that is a little more involved, but what are you using the postgres database for? i think you should be using mysql or depending on your scaling you could use my favorite database cassandra", "group_id": 95, "id": 866608}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304142690.620306, "message": "I am a self-taught programmer (HTML, CSS, PHP, Objective-C and learning Django) and I would like to get some resources to help me understand more about sysadmin stuff (webserver, databases, etc.). Recommendations?", "group_id": 95, "id": 866567}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304143018.1634209, "message": "@italiano40 Good to \"see\" you on here. I'm still working on my video! I have a managed cloud server, so I can just ask them and get stuff done. But I want to understand more about how things work on the backend. Kind of like an intro to sysadmin or dba or something like that.", "group_id": 95, "id": 866584}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304142817.9425759, "message": "what do you need to know? because of cloud hosting it would eliminate sysadmin know how", "group_id": 95, "id": 866575}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304142739.8307991, "message": "I should mention, the db is postgres", "group_id": 95, "id": 866570}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304142860.281688, "message": "unless you are physically hosting the servers yourself?", "group_id": 95, "id": 866579}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304143668.0661211, "message": "@italiano40 postgres for geospatial data. i don't need any in-depth resources, just something that can help me familiarize myself with the what's going on. online resources would be terrific", "group_id": 95, "id": 866629}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304144682.1629, "message": "also another thing start following blogs/twitter of CTO", "group_id": 95, "id": 866699}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304143902.6185369, "message": "http://www.linuxquestions.org/ this is a site all about linux but i mean they also have a lot of good system admin stuff", "group_id": 95, "id": 866648}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304144363.0504889, "message": "to really get a good idea of system admin stuff, just start following like twitter's dev blog, google's blog, i mean they are always posting about how they run there systems, i am looking thru my bookmarks there isn't one stop shop place for that stuff, you need to look at it piece by piece, start with webservers, which could go from basic to complex very quickly and then look at iptables and routing and how switches and servers work together, firewalls, then look at databases, which is just how to maintain, clean... but then you can also look at backups, like tape back ups or actual harddrive backups, and you just have to jump from topic to topic", "group_id": 95, "id": 866683}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304144389.7731199, "message": "http://static2.businessinsider.com/image/4db923d1ccd1d54f16280000-610-/biz-stone-royal-wedding-twitter.png", "group_id": 95, "id": 866685}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304149359.990171, "message": "Fastest way to learn sysadmin is to do it. Get an old computer from a trash bin, make it work, tweak it until it runs faster than most super computers. Find problems, fix them. Beat on apache until it hosts django just the way you want it to. Wash, Rinse, Repeat.", "group_id": 95, "id": 866842}, {"user_id": 31293, "stars": [], "topic_id": 32909, "date_created": 1304149944.0868371, "message": "How does cloud hosting remove sysadmin requirements? You still need to run a system...", "group_id": 95, "id": 866861}, {"user_id": 31140, "stars": [], "topic_id": 32909, "date_created": 1304150997.470216, "message": "Yeah, I just moved to a dedicated \"cloud\" sever from a managed environment and that has been a big learning curve with apache installation and setup, configurating iptables and the like. I would really appreciate it if some one could point me to a canonical guide. (though I did find some great articles in the slice host kb)", "group_id": 95, "id": 866871}, {"user_id": 15929, "stars": [{"date_created": 1304172926.8236301, "user_id": 4149}], "topic_id": 32909, "date_created": 1304155893.4211249, "message": "@bifrost, depends on your definition of 'cloud host', hosting an app on the likes of appengine, heroku, phpfog, or dotcloud (maybe? not sure, just got the beta invite to dotcloud last night)... you don't really need any sysadmin skillset. if your definition for 'cloud host' is something like rackspace cloud or ec2, then yeah... you're right.", "group_id": 95, "id": 866982}, {"user_id": 26395, "stars": [], "topic_id": 32909, "date_created": 1304159344.8768971, "message": "@italiano40 can u name some of the CTO's ? pretty pls", "group_id": 95, "id": 867301}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304173505.7129869, "message": "and of course https://convore.com/users/ericflo/ is the CTO of convore", "group_id": 95, "id": 868317}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304173338.706917, "message": "@amiamirul here is a few http://twitter.com/#!/btaylor -CTO of facebook, http://twitter.com/#!/kemp former CTO of NASA, http://twitter.com/#!/werner CTO of amazon, http://twitter.com/#!/Padmasree CTO of Cisco<<<she actuall tweets alot of about being CTO,  and that is a good list for now", "group_id": 95, "id": 868300}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304177394.3203161, "message": "@italiano40 Thanks for these recommendations. Will take a look at them.", "group_id": 95, "id": 868655}, {"user_id": 9154, "stars": [], "topic_id": 32909, "date_created": 1304177658.3310881, "message": "@bifrost It's managed cloud hosting; they have sysadmins who manage the backend including server setup, iptables, databases, load balancing, etc.", "group_id": 95, "id": 868677}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304182104.013319, "message": "she is a programer, not a system admin, she justs to know more, so when they talk to her about her servers she understands what is going on", "group_id": 95, "id": 869550}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304180322.4506021, "message": "So, other than being that asshole that tells you to read the manual pages in linux (`man command_goes_here` in console), I can say that this site http://www.howtoforge.com/ has excellent guides for system setup.  They aren't always the most perfect setups, but the guides will get your box up and running, you can tweak it into oblivion later (when you know more).", "group_id": 95, "id": 869035}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304181980.716053, "message": "@italiano40 How can you understand `how it all works` if you're not doing it? That's a contradiction in terms. Theory doesn't get you anywhere in systems administration. Application does.", "group_id": 95, "id": 869472}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304182928.808013, "message": "@italiano40 Fair enough. But, I didn't learn in school. I had 15 computers I dragged from trash bins, and I put different OS's on all of them and made them mesh. I actually sort of wish cloud stuff was around back then, I could have made a pretty massive cloud platform in my bedroom, slow as it would have been.", "group_id": 95, "id": 869823}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304181858.334173, "message": "@Aranjedeath she doesnt want to setup a server, she wants to learn how they do it so she can understand how it all works", "group_id": 95, "id": 869408}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304182593.1404741, "message": "@Aranjedeath well i can say i have never had a problem with the 15 racks at my university and 3 have to have 99.998% uptime so i think self taught people are just as good, and i am not even going into system admin, i am going for software engineer you can say sysadmin is just a hobby so yea self taught people are just as good as you people that learn in school", "group_id": 95, "id": 869698}, {"user_id": 4149, "stars": [], "topic_id": 32909, "date_created": 1304182051.294543, "message": "@Aranjedeath actually not true, since i learned how everything worked and i never had a server to test until last year, so yea and i taught myself", "group_id": 95, "id": 869514}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304182036.9972999, "message": "It's kinda like learning the theory of math without actually /doing/ math. It's just silly.", "group_id": 95, "id": 869504}, {"user_id": 28472, "stars": [], "topic_id": 32909, "date_created": 1304182357.9171131, "message": "@italiano40 I wonder how capable you are, then. I don't mean to insult you personally (please don't take my question as that), but I've honestly never seen a sysadmin who was self taught (without the benefit of an environment to mess about in) that was capable of handling problems. \n\nAnd yes, if she just needs a more informed background and isn't actually going to be doing systems administration then that sounds just fine. I'm just apprehensive about anyone learning by not-doing.", "group_id": 95, "id": 869633}, {"user_id": 9108, "stars": [], "topic_id": 32909, "date_created": 1304182930.18625, "message": "@italiano40 Maybe you're an exception, but I'm inclined to agree with @Aranjedeath on this. The best way to learn something is to actually DO it. Reading books, documentation, etc. can be helpful, but I feel that it will rarely give you the same mastery over an area as doing it first-hand. There is a reason why doctors do a residency rather than just working on their own straight out of medical school. The process here is the same.", "group_id": 95, "id": 869825}]