[{"user_id": 16271, "stars": [], "topic_id": 10388, "date_created": 1299125881.823066, "message": "What does this mean?  Basic auth is obvious but what is a session key?  Per the docs I should be able to access unauthenticated with just a group_id but I have one specified and that's the message I'm getting.", "group_id": 2780, "id": 257431}, {"user_id": 2, "stars": [], "topic_id": 10388, "date_created": 1299126562.449152, "message": "@mridley is the group a public group? only public groups are accessible without auth", "group_id": 2780, "id": 257609}, {"user_id": 16271, "stars": [], "topic_id": 10388, "date_created": 1299126744.6334491, "message": "@leah That may be the problem.  I have a private group that I'm using for testing but I figured that it would be the case that anonymous access wouldn't work for a private group so I thought I tried an arbitrary public group but maybe I didn't.  Right now I have my authentication info hardcoded in and when I get the functionality working I'll make my test group public to test with anonymous access and let you know.", "group_id": 2780, "id": 257642}, {"user_id": 16271, "stars": [], "topic_id": 10388, "date_created": 1299131494.918272, "message": "Oh you know what - I bet I know what the problem is.  I'm passing the parameters as POST variables because I copied the code from another part of my app.  Let me try again as GET", "group_id": 2780, "id": 258371}, {"user_id": 16271, "stars": [{"date_created": 1299136309.7134421, "user_id": 1}], "topic_id": 10388, "date_created": 1299131898.8698361, "message": "And now that I'm using GET my cursor is actually working too - how about that :)", "group_id": 2780, "id": 258420}, {"user_id": 16271, "stars": [], "topic_id": 10388, "date_created": 1299131281.9353819, "message": "@leah OK so I tried making the group public but I get the same error :(", "group_id": 2780, "id": 258332}, {"user_id": 16271, "stars": [], "topic_id": 10388, "date_created": 1299131582.7701001, "message": "Yeah that was the problem.  Oops.", "group_id": 2780, "id": 258385}]