[{"user_id": 13453, "stars": [], "topic_id": 9680, "date_created": 1298980360.4588721, "message": "Líder: @csanabria @mauricioweb\u000bObjetivos: Consolidar comunidades de análisis y apoyo al fortalecimiento de las competencias comunicativas en la era de la convergencia digital.\u000bActividades: Conversatorios y discusiones de ética y tecnología, en comunidades de bloggeros y periodistas (http://periodismodehoy.ning.com/).\u000bBase de datos de bloggeros y periodistas en Colombia (nombre, correo/@, página).\u000bTrabajo entre pares.\nEnlace MinTic - ViveDigital: María Carolina Hoyos Turbay", "group_id": 2696, "id": 233926}, {"user_id": 15483, "stars": [], "topic_id": 9680, "date_created": 1298991718.441021, "message": "Ponemos a disposición de este escuadrón nuestra experiencia educando comunicadores en nuevas tecnologías http://elnuevocomunicador.grou.ps", "group_id": 2696, "id": 235296}, {"user_id": 15483, "stars": [], "topic_id": 9680, "date_created": 1298996192.1621909, "message": "Este es un documento para analizar en este escuadrón: \"Manual de uso para la creatividad sostenible en la era digital\"  http://fcforum.net/files/sustainable-creativity/Fcf_Manual-cast_1-0.pdf", "group_id": 2696, "id": 235987}, {"user_id": 17462, "stars": [], "topic_id": 9680, "date_created": 1299036465.685411, "message": "Saludos, quedo atenta a participar. Como comentario pienso que los conversatorios y discusiones deben abordar más áreas temáticas de interés para la comunidad periodística que pueden aportar a la calidad y pertinencia de la información en los diferentes medios y campos de acción en los que trabajamos. Además pienso que este escuadrón una gran oportunidad para generar una red fuerte de investigación y de contenidos alrededor de las nuevas tecnologías en el país desde nuestra labor.", "group_id": 2696, "id": 242979}, {"user_id": 17517, "stars": [], "topic_id": 9680, "date_created": 1299043747.7494891, "message": "Como comunicador social y periodista me siento muy bien, agradado porque podamos ayudar y apoyar a otros colegas con el propósito de realizar un mejor trabajo. En el departamento de #Boyacá, el uso de las TIC's no es aprovechado por la mayoría de los medios de comunicación y menos de los que trabajan para ellos. La causa, falta inclusión digital y capacitación en el correcto uso de estas herramientas tecnológicas. Ojalá el escuadrón pueda trabajar bien chevere en este sector y esta limd a tierra.", "group_id": 2696, "id": 244488}, {"user_id": 17636, "stars": [], "topic_id": 9680, "date_created": 1299074228.186245, "message": "Hola, soy CB&S Colombia", "group_id": 2696, "id": 247006}, {"user_id": 16500, "stars": [], "topic_id": 9680, "date_created": 1299082511.146467, "message": "Bueno, yo no soy comunicador, soy arquitecto, pero actualmente estoy haciendo una investigación sobre la arquitectura como acto comunicativo, y estoy muy relacionado en proyectos trans-disciplinares que parten desde la comunicación. Principalmente me interesa de este escuadrón, como, no desde los comunicadores, sino usando los medios de comunicación se puede generar una cultura convergente, una cultura que parte de los usos de las herramientas digitales para generar ciudades y ciudadanos 2.0", "group_id": 2696, "id": 248306}, {"user_id": 15483, "stars": [], "topic_id": 9680, "date_created": 1301069489.89994, "message": "Este evento no se lo debería perder el escuadrón http://labsurlab.co/ gran oportunidad de generar su nodo regional en la ciudad de Medellín", "group_id": 2696, "id": 439740}, {"user_id": 16500, "stars": [], "topic_id": 9680, "date_created": 1301246075.264585, "message": "Juanda, pero por lo que veo el evento ya esta a esta altura muy estructurado, es decir, no veo que estén abiertas convocatorias para invitar a otros medias lab o grupos similares a proponer talleres o seminarios, ¿tu sabes algo al respecto?", "group_id": 2696, "id": 452071}, {"user_id": 26253, "stars": [{"date_created": 1301447449.5168581, "user_id": 16500}], "topic_id": 9680, "date_created": 1301369578.199863, "message": "2. En ese entendido, contenido puede ser cualquier pieza audiovisual, textual, hipertextual, multimedial, artística o cualquiera que cumpla con las condiciones antes descritas. El periodismo, lo documental, lo argumental, la arquitectura, las instalaciones, los negocios como parte de su modelo elementos digitales, son suceptibles a entrar en la categoría de Cultura Convergente.", "group_id": 2696, "id": 465174}, {"user_id": 26253, "stars": [{"date_created": 1301447444.717485, "user_id": 16500}], "topic_id": 9680, "date_created": 1301369448.225395, "message": "Disculparán los entusiastas de Cultura Convergente mi ausencia en estos temas, pero recogeremos el rumbo. Varias cosas quiero dejar a consideración:\n\n1. Cultura Convergente es el paradigma para la creación de contenidos en nuestro tiempo. Debemos considerar como contenido todo aquella producción intelectual que puede servirse o no en su creación, producción, presentación y distribución, de herramientas digitales.", "group_id": 2696, "id": 465161}, {"user_id": 26253, "stars": [{"date_created": 1301447436.7370269, "user_id": 16500}], "topic_id": 9680, "date_created": 1301369728.1394341, "message": "3. El equipo debe llamar a la formación en competencias digitales, la reflexión en el uso de herramientas para la creación de contenido, los derechos de autor, la propiedad intelectual, la creatividad, las metodologías, las tecnologías y todos aquellos elementos que fomenten la creación de contenidos. Entender que esta no es una revolución de máquinas, sino de cerebros.", "group_id": 2696, "id": 465187}, {"user_id": 26253, "stars": [], "topic_id": 9680, "date_created": 1301373835.4083271, "message": "5. Lo que acado de escribir no está en piedra. Espero que lo podamos discutir y profundizar y que este sea un motivo para encontrarnos en una pasión y unos saberes por los cuales hemos dedicado ya un par de años y podamos entusiasmar y empoderar a otros para que hagan cosas más grandes.", "group_id": 2696, "id": 465804}, {"user_id": 26253, "stars": [], "topic_id": 9680, "date_created": 1301373751.0172341, "message": "4. Estos puntos deben desplegarse en actividades puntuales donde la creatividad y la innovación sean los principios para su realización. Pueden ser foros virtuales o reales, conversatorios, webinars, twitcams, o cualquier otra metodología para cumplir con las premisas planteadas.", "group_id": 2696, "id": 465793}, {"user_id": 26274, "stars": [], "topic_id": 9680, "date_created": 1301374441.3336661, "message": "Tengo un emprendimiento en cartagena, donde trabajar 7 personas, es medio de comunicación online. Visitenlo en www.elplaneta.co, como puedo apoyar desde este espacio?", "group_id": 2696, "id": 465909}]