[{"user_id": 30494, "stars": [{"date_created": 1309708163.7405491, "user_id": 23918}], "topic_id": 20937, "date_created": 1303530336.1653521, "message": "Check : http://blog.lolo.asia/technology/kynetx/2011/04/11/kynetx-restyler-released/", "group_id": 9196, "id": 787117}, {"user_id": 30494, "stars": [], "topic_id": 20937, "date_created": 1303533474.4329231, "message": "Inspired from the popular Stylish extension, Restyler allows users to change the skin of your favorite websites like Facebook or Google. Restyler is compatible with userstyles.org so that you can install any style you may find there with Restyler.\n\nFeatures:\n\nComes with two preconfigured styles for Facebook and Google\nOne click install on new styles from userstyles.org\nManage multiple styles for every website\nStyles can have slideshows which allows to randomly show a background image every time the page is refreshed or stay on your favorite image\nRestyler can be installed on Firefox and Chrome. IE extension is on the way (for now it only works on IE8 using bookmarklets)\n \n\nRestyler is based on Kynetx technology that allows to distribute kynetx browser apps via extensions or bookmarklets on any major browser. With Kynetx, developpers write their program once and deploy the same code on all browsers.\nThis will dramatically speed up development and maintenance so expect new features in Restyler soon !\n\nWhat is Restyler made off?\n\nwonderful jquery with some plugins : fancybox , easydrag , busy\nKynetx KRL event driven server-side language\nFun !\nFuture plans:\n\nallow modication of styles on the fly to ease and speed up new style creation or customization\nextend slideshow functionnality to support facebook albums , flickr, picasaweb …\nexport / import styles manually\ncrossbrowser settings ( same styles on all browser you use shall it be at office or home)", "group_id": 9196, "id": 787239}, {"user_id": 30494, "stars": [], "topic_id": 20937, "date_created": 1306097866.5242109, "message": "demo : http://www.youtube.com/watch?v=C7ZLyspD8cA", "group_id": 9196, "id": 1144120}]