[{"user_id": 2, "stars": [{"date_created": 1297297712.8066981, "user_id": 799}], "topic_id": 2917, "date_created": 1297297593.0351551, "message": "what do you mean? examples?", "group_id": 95, "id": 61341}, {"user_id": 799, "stars": [{"date_created": 1297297685.580188, "user_id": 1}, {"date_created": 1297297703.4451711, "user_id": 1128}], "topic_id": 2917, "date_created": 1297297630.3593841, "message": "the etsy founder starting parachutes.org, Jack Dorsey starting Twitter, sittercity.com founders starting contactkarma.com", "group_id": 95, "id": 61356}, {"user_id": 2, "stars": [], "topic_id": 2917, "date_created": 1297297700.1837621, "message": "I think each case has separate reasons", "group_id": 95, "id": 61379}, {"user_id": 799, "stars": [], "topic_id": 2917, "date_created": 1297297752.2892029, "message": "Sorry meant to say Jack Dorsey starting Square while at Twitter", "group_id": 95, "id": 61400}, {"user_id": 2, "stars": [{"date_created": 1297297947.9350951, "user_id": 1128}, {"date_created": 1297298974.8235519, "user_id": 1}], "topic_id": 2917, "date_created": 1297297776.472837, "message": "http://www.quora.com/What-s-the-story-of-how-Twitter-got-started-at-Odeo?q=Why+did+odeo+b", "group_id": 95, "id": 61412}, {"user_id": 799, "stars": [{"date_created": 1297298983.556077, "user_id": 1}, {"date_created": 1297304190.325135, "user_id": 1128}], "topic_id": 2917, "date_created": 1297298147.8931611, "message": "Also could tie into entrepreneurs insatiable need to always be creating.", "group_id": 95, "id": 61539}, {"user_id": 3019, "stars": [], "topic_id": 2917, "date_created": 1297297976.3122711, "message": "I think its a throw it against the wall and see what sticks strategy", "group_id": 95, "id": 61481}, {"user_id": 481, "stars": [{"date_created": 1297351389.0537369, "user_id": 2125}], "topic_id": 2917, "date_created": 1297297836.727792, "message": "Startup ADD", "group_id": 95, "id": 61434}, {"user_id": 799, "stars": [], "topic_id": 2917, "date_created": 1297297857.2891309, "message": "Do you guys think it is a bad thing? To split focus/energy?", "group_id": 95, "id": 61444}, {"user_id": 799, "stars": [], "topic_id": 2917, "date_created": 1297298109.284682, "message": "Sorry, I guess my first question was a bit ambiguous.  I guess it also ties largely into the shifting roles of fast growing startups.  With more money raised and thus more outside influence, I guess it's not surprising that founders will find their involvement constantly shifting.", "group_id": 95, "id": 61520}, {"user_id": 481, "stars": [], "topic_id": 2917, "date_created": 1297299120.13606, "message": "Stuff also happens behind closed doors that the public never sees.  There could be a lot of reasons I guess.", "group_id": 95, "id": 61879}, {"user_id": 849, "stars": [], "topic_id": 2917, "date_created": 1297344477.8575089, "message": "I'm guessing it's because they are keen to execute multiple ideas", "group_id": 95, "id": 69158}, {"user_id": 5637, "stars": [], "topic_id": 2917, "date_created": 1297348824.4815879, "message": "If it's all about the people (execution) not the ideas (a sort of commodity) than it makes sense for vc's and the startup to maximize their chances of launching a product that the market will demand by focusing 80% on a primary project and 20% on something which is promising because for it's potential payoff it requires relatively little work.  Mind you this mentality is only valid with web technologies which require little to no capital other than labor (Bloom Energy for instance is not a web technology so it's capital intensive and dividing up the team's efforts even 80/20 might scare the investors which wouldn't have invested as much in the first place if they weren't completely convinced the main project/product wasn't worth while.)", "group_id": 95, "id": 69875}, {"user_id": 4927, "stars": [], "topic_id": 2917, "date_created": 1297361815.1781249, "message": "As a serial startup junkie, I can say that it gets in your blood. You have such control over the company, your destiny, and the excitement, and yes, the insatiable need to create. We are \"idea men and women\". We have ideas, and we want to make them happen, and yes, the brass ring of another hit.", "group_id": 95, "id": 72296}, {"user_id": 6050, "stars": [], "topic_id": 2917, "date_created": 1297361978.5150599, "message": "it would be nice to keep the conversations on this convore to the same level as they are currently. that is the characteristics of business and the people who lead them that make them successful. but as soon as other people begin to enjoy convore, the topics will trend to be less and less useful. probably about justin beiber and all that. oh well", "group_id": 95, "id": 72323}, {"user_id": 5186, "stars": [{"date_created": 1297503529.628819, "user_id": 4903}, {"date_created": 1297535700.4906361, "user_id": 1128}], "topic_id": 2917, "date_created": 1297444950.032398, "message": "I'm not sure I would class my first startup as \"active and successful\", however it was gaining some good traction with thousands of users in a space with an increasing number of competitors to give me good validation of the space. The problem was that the startup was \"social\", in other words the usefulness of the app would improve due to network effect as more people join. Due to this it was tricky to monetize early, since the true value would come later when there were many people using the service. Some of that is certainly arguable, and I made plenty of mistakes and course-corrections along the way, but the underlying outcome was that it was growing at a great pace but without revenue. That is why I chose to \"create a second startup simultaneously\". My second startup is deliberately not social and is structured as a SaaS offering, with the aim to generate revenue immediately and to reach ramen profitability so I could stop doing other work (freelance/contract development), which would in turn give me enough time to work on the first startup and make it work. I'm happy to say that after just over two months since the launch of the second startup it is already doing well and was generating revenue 4 days after launch. This is just my own reasoning and experience, but I thought it might be useful to share with others.", "group_id": 95, "id": 81572}, {"user_id": 6472, "stars": [], "topic_id": 2917, "date_created": 1297463783.359962, "message": "I would imagine that having a successful product would give you the opportunity (as well as funding) to try all of the ideas you have had in your head over the years.", "group_id": 95, "id": 84442}, {"user_id": 7443, "stars": [], "topic_id": 2917, "date_created": 1297502033.0681939, "message": "Agree with @parker and @penguinone. Need to create, explore, curiosity.", "group_id": 95, "id": 86464}, {"user_id": 4903, "stars": [], "topic_id": 2917, "date_created": 1297503523.421514, "message": "@joel", "group_id": 95, "id": 86601}]