[{"user_id": 30352, "stars": [], "topic_id": 35728, "date_created": 1305685651.8181181, "message": "A Blonde Goes On Who Wants To Be A Millionaire \nRegis: \"Barbara, you've done very well so far - $500,000 and one lifeline left -- phone a friend. \n\nThe next question will give you the top prize of One Million dollars if you get it right ... but if you get it wrong you will drop back to $32,000 -- are you ready?\"\n\nBarbara: \"Sure, I'll have a go!\"\n\nRegis: \"Which of the following birds does not build it's own nest? \n\nIs it........\n\nA-Robin \n\nB-Sparrow\n\nC-Cuckoo\n\nD-Thrush\n\nRemember Barbara its worth 1 Million dollars.\"\n\n\"I think I know who it..but I'm not 100%... \n\nNo, I haven't got a clue. I'd like to phone a friend Regis, just to be sure.\n\nRegis: \"Yes, who, Barbara, do you want to phone?\n\nBarbara: \"I'll phone my friend Maggie back home in Birmingham.\"\n\n(ringing)\n\nMaggie (also a blonde): \"Hello...\"\n\nRegis: \"Hello Maggie, its Regis here from Who Wants to be a Millionaire-I have Barbara here and she is doing really well on $500,000, but needs your help to be a Million. \n\nThe next voice you hear will be Barbara's and she'll read you the question. \n\nThere are 4 possible answers and 1 correct answer and you have 30 seconds to answer -- fire away Barbara.\"\n\nBarbara: \"Maggie, which of the following birds does not build it's own nest? Is it:\n\nA-Robin\n\nB-Sparrow\n\nC-Cuckoo\n\nD-Thrush\"\n\nMaggie: \"Oh Gees, Barbara that's simple.....It's a Cuckoo.\"\n\nBarbara: \"You think?\"\n\nMaggie: \"I'm sure.\"\n\nBarbara: \" Thanks Maggie.\" (hangs up)\n\nRegis: \"Well, do you want to stick on $500,000 or play on for the Million, Barbara?\"\n\nBarbara: \"I want to play, I'll go with C-Cuckoo\"\n\nRegis: \"Is that your final answer?\"\n\nBarbara: \"It is.\"\n\nRegis: \"Are you confident?\"\n\nBarbara: \"Yes fairly, Maggie's a sound bet.\"\n\nRegis: \"Barbara.....you had $500,000 and you said C-Cuckoo ...you're right! - You have just won ONE MILLION DOLLARS. \n\nHere is your check. You have been a great contestant and a real gambler. Audience please put your hands together for Barbara.\"\n\n(clapping)\n\nThat night Barbara calls round to Maggie and brings her down to a local bar for a celebration drink and, as they are sipping their Champagne, Barbara turns to Maggie and asks \"Tell me Maggie, How in God's name did you know that it was the Cuckoo that does not build its own nest?\n\nMaggie: \"Listen Barbara, everybody knows that a Cuckoo lives in a clock.\" \n", "group_id": 9873, "id": 1091810}, {"user_id": 24734, "stars": [], "topic_id": 35728, "date_created": 1306318873.6867671, "message": "OMG hahahagagahahaha", "group_id": 9873, "id": 1176333}]