[{"user_id": 14086, "stars": [], "topic_id": 17594, "date_created": 1302097094.13731, "message": "I'm looking for constructive feedback/criticism about design-related elements on talentopoly.com. What is your first impression of the design? What could be improved? etc.", "group_id": 629, "id": 559227}, {"user_id": 12363, "stars": [], "topic_id": 17594, "date_created": 1302099266.902283, "message": "I think it's nice and clean, but my two cents are the words talentopoly is a fun word and makes me think of monopoly which is fun. It seems strange that it is so clean and straight forward, it's not what I expected at all.", "group_id": 629, "id": 559670}, {"user_id": 14086, "stars": [], "topic_id": 17594, "date_created": 1302100230.788408, "message": "@walkdesign Thanks for the feedback. I hadn't heard that feedback before, but it's very interesting.", "group_id": 629, "id": 559838}, {"user_id": 12525, "stars": [], "topic_id": 17594, "date_created": 1302116994.7703421, "message": "I like it, simple and effective... and yes I did request an invite...", "group_id": 629, "id": 563238}, {"user_id": 25779, "stars": [], "topic_id": 17594, "date_created": 1302183161.7657199, "message": "I agree with @walkdesign. Unexpected from the name. As for the layout there seems to be 2 large gaps. Mostly from lack of content. Under the headline and where the avatars of people that like the post. The headline space seem forgotten.", "group_id": 629, "id": 575033}, {"user_id": 25779, "stars": [], "topic_id": 17594, "date_created": 1302183196.7480941, "message": "Your shadows are also inconsistent. http://cl.ly/2Z1v3c3L1Z382V0q432o. Try to get them to resemble 1 light source, not 3.", "group_id": 629, "id": 575040}, {"user_id": 26917, "stars": [], "topic_id": 17594, "date_created": 1302188180.4924669, "message": "Agreed! Too cookie cutter. A -fun- site about design, development, and IT should have a general aura of such awesomeness. But it's definitely clean.", "group_id": 629, "id": 576032}, {"user_id": 11605, "stars": [], "topic_id": 17594, "date_created": 1302551606.4667251, "message": "i agree that it's a bit cookie-cutter, looks like you're using a corporate site design template or something. the logo is also far too conservative for the name of the company, a name like \"talentopoloy\" makes me think of a big, bright, fun logo.", "group_id": 629, "id": 628599}, {"user_id": 218, "stars": [], "topic_id": 17594, "date_created": 1302626028.1892941, "message": "looking at the site, it reminds me of forrst.com + recruiters.", "group_id": 629, "id": 644959}, {"user_id": 218, "stars": [], "topic_id": 17594, "date_created": 1302625992.657299, "message": "just hearing the name, I was expecting \"monopoly for startups\" where you did something like \"Do you have a CXO who is directly responsible for 'social media'? 5 points\" etc", "group_id": 629, "id": 644942}, {"user_id": 218, "stars": [], "topic_id": 17594, "date_created": 1302626348.078258, "message": "for your original question though.. I feel like the plus signs look a little misplaced. The 3 things they're adding don't seem contiguous (visually). I like the lines that fade near the login button, but the login button seems kinda flat compared to how raised the section its on is. Your three subtabs for the \"measure your reach\" thing have graphics which are nice, but the original page doesn't. I also can't see how to get back to that original page. Maybe show me what exactly I could be sharing on that first page? Joining a \"community\" isn't particularly appealing in the abstract. I feel like that advertisement in the footer makes the footer unnecessarily tall. I'd either move that out into the main content, or find more things to visually offset its weight in the footer. Also, more things in the \"What's on talentopoly?\" section. Maybe 3 items. </braindump>", "group_id": 629, "id": 645116}, {"user_id": 29238, "stars": [], "topic_id": 17594, "date_created": 1302688052.705245, "message": "hi", "group_id": 629, "id": 662212}]