[{"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301551735.4408491, "message": "estamos todos aqui hablando de startups y la manga, pero cuantos de ustedes están dispuestos realmente a dejar la comodidad/seguridad de su trabajo actual y lanzarse a cambiar el mundo (o la parte que les toca) o morir en el intento?", "group_id": 965, "id": 489091}, {"user_id": 4653, "stars": [], "topic_id": 16418, "date_created": 1301553196.208674, "message": "Si yo creyera en mi idea, o en la idea de otra persona. Yo estaría dispuesto a dejar lo que este haciendo y darle tiempo, al grado de pasar días enteros durmiendo 2 horas. La idea. Eso es lo necesario.", "group_id": 965, "id": 489337}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301551862.153441, "message": "Lo digo por frustración, porque ultimamente me he encontrado con chavos muy muy talentosos pero horrorosamente conformistas.", "group_id": 965, "id": 489113}, {"user_id": 25716, "stars": [{"date_created": 1301562548.4544549, "user_id": 10406}, {"date_created": 1301712421.8332379, "user_id": 24172}], "topic_id": 16418, "date_created": 1301552771.814111, "message": "jeje, dejé la comodidad/seguridad de mi pais en europea :P Pero es no para todos los gentes, es mucho mas dificile que se piensa y tu necesita mucho disciplina. La mayoría de las gentes solo esperar por un lider. Entonces, en vez de ser frustrado, debes ser un líder y inspirar gentes", "group_id": 965, "id": 489274}, {"user_id": 24160, "stars": [], "topic_id": 16418, "date_created": 1301551902.792011, "message": "No te frustres :)", "group_id": 965, "id": 489119}, {"user_id": 26088, "stars": [], "topic_id": 16418, "date_created": 1301553820.3902781, "message": "#yoconfieso que yo estoy dispuesto, je mi trabajo actual es realmente lo incomodo ya me quiero dedicar full!! pero ahi vamos y solo que juntemos un poco u obtengamos un seed funding seguiremos cambiando el mundo más horas al dia :P", "group_id": 965, "id": 489382}, {"user_id": 15089, "stars": [], "topic_id": 16418, "date_created": 1301555028.8293431, "message": "@soska _o/", "group_id": 965, "id": 489531}, {"user_id": 4653, "stars": [], "topic_id": 16418, "date_created": 1301553891.2051611, "message": "#yoconfieso que si la idea fuera buena, yo estaría dispuesto a invertir mi tiempo de forma gratuita para un proyecto ☺ <- this is love.", "group_id": 965, "id": 489385}, {"user_id": 25517, "stars": [], "topic_id": 16418, "date_created": 1301558164.0748119, "message": "o/ hay que aprender a aprovechar las oportunidades", "group_id": 965, "id": 489983}, {"user_id": 20022, "stars": [], "topic_id": 16418, "date_created": 1301583533.281085, "message": "tristemente lo veo seguido, se le llama aversion al riesgo , y es un skill que se adquiere, se comienza por bajarle a las promociones de meses sin intereses.", "group_id": 965, "id": 492778}, {"user_id": 20022, "stars": [], "topic_id": 16418, "date_created": 1301586479.9760599, "message": "@edmz totalmente de acuerdo.", "group_id": 965, "id": 493089}, {"user_id": 19938, "stars": [], "topic_id": 16418, "date_created": 1301586427.254905, "message": "@Kuroir No se pasen la vida esperando el eureka. Parte del rollo de los \"startups\" de tecnología que no me gusta es que la gente piensa que su boleto de lotería es tener LA idea de los millones de dólares. Mientras tanto, el resto del mundo se la pasa creando negocios que son \"copias\" de otros existentes y teniendo éxito en ello!", "group_id": 965, "id": 493079}, {"user_id": 19938, "stars": [], "topic_id": 16418, "date_created": 1301588905.963495, "message": "(yo pienso que si una persona atrabancada y menos preparada puede lograr cierto nivel de éxito en un negocio cualquiera, la probabilidad de que una persona con más educación y preparación lo haga es mayor)", "group_id": 965, "id": 493337}, {"user_id": 26117, "stars": [], "topic_id": 16418, "date_created": 1301588125.9544821, "message": "Si unieramos esfuerzos para concretar una idea seria mas facil que si cada quien trata de desarrollar su idea en su tiempo libre...y lo mas que puede pasar es que no funcione...pero no importa podemos desarrollar/probar mas ideas...alguna tiene que funcionar...no creen?..no tenemos que invertar la rueda..algunos solo la mejoran..como Apple, cierto?", "group_id": 965, "id": 493268}, {"user_id": 26117, "stars": [], "topic_id": 16418, "date_created": 1301587742.886544, "message": "Hola, creo que lo que pasa muchas veces es que planeamos y no ejecutamos esa idea, para ver si funciona o no, como mencionan por el riesgo de dejar la \"seguridad\" de tu empleo pero creo que  nunca es tarde para intentarlo...si realmente deseamos alcanzar el exito!!", "group_id": 965, "id": 493226}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301590854.5542719, "message": "Pero el compa del puesto de tacos no va a cambiar el mundo. Ni la empresa que hace software a la medida. Ni la agencia que aspira a ser KP y ganar concursitos de flash. Pueden ganar muy buena lana y manejar un Mercedes a 40km/h en el tráfico del DF si eso es lo que quieren.  Pero 37 Signals, GitHub, Google, Twitter, Angry Birds y hasta Microsoft han iniciado revoluciones aunque sea de pequeño tamaño. Lo que veo en México es que los programadores/diseñadores mas talentosos están mas interesados en vender agua azucarada que en cambiar el mundo.", "group_id": 965, "id": 493631}, {"user_id": 2946, "stars": [{"date_created": 1301591273.5176389, "user_id": 26088}], "topic_id": 16418, "date_created": 1301590958.528012, "message": "John Sculley\nPresident, Apple Computer, 1983-93\n\"And then he looked up at me and just stared at me with the stare that only Steve Jobs has and he said do you want to sell sugar water for the rest of your life or do you want to come with me and change the world and I just gulped because I knew I would wonder for the rest of my life what I would have missed.\"\n", "group_id": 965, "id": 493656}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301591457.534076, "message": "@Krator Te entiendo.", "group_id": 965, "id": 493760}, {"user_id": 19921, "stars": [], "topic_id": 16418, "date_created": 1301591213.7622869, "message": "Entonces estas sugiriendo que... nos volvamos CEOs de empresas y despidamos a los fundadores después de un rato? Suena bien!", "group_id": 965, "id": 493707}, {"user_id": 19921, "stars": [], "topic_id": 16418, "date_created": 1301591312.7902019, "message": "Pero en toda seriedad, tienen razón. Lo que podemos hacer es dar lo mejor de nosotros para nuestros Startups y convertirlos en los mayores éxitos posibles, para que la gente vea que si se puede! Solo así se animaran los jóvenes talentosos a tomar mas riesgos.", "group_id": 965, "id": 493730}, {"user_id": 3665, "stars": [], "topic_id": 16418, "date_created": 1301591680.3855319, "message": "@soska Afortunadamente estuve en el Hackathon, salieron 3 startups bastante interesantes y me apunte en los 3 :D seguramente serán días de poco sueño pero mínimo me dejarán una buena experiencia y como máximo los 3 serán existosos :P... no hay nada que perder", "group_id": 965, "id": 493825}, {"user_id": 26089, "stars": [], "topic_id": 16418, "date_created": 1301598117.4165831, "message": "JFDI", "group_id": 965, "id": 494837}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301601324.4733541, "message": "Mi rant va mas del lado de los empleados de una startup. Los fundadores ponen mucho de su parte y arriesgan un montón. Pero los primeros empleados tienen que arriesgarse a ganar un poquito menos (quizá a cambio de equity) lo cual es dificil para alguien casado y con familia pero es un gran deal para un soltero  recien graduadode 20-25 años.", "group_id": 965, "id": 495304}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301601374.063287, "message": "Lo que digo es que si a mi me hubieran dado la oportunidad de trabajar en una startup cuando tenía 19 años hubiera sido MUY estúpido de mi parte no aceptarla.", "group_id": 965, "id": 495314}, {"user_id": 3549, "stars": [], "topic_id": 16418, "date_created": 1301600786.0593319, "message": "Les invito a ver este link http://bit.ly/fQEnOi a los que estén interesados en unirse a un startup con un modelo de negocios y arquitectura definida, prototipo en desarrollo y con validación de mercado en marcha. Actualmente le estoy dedicando el 80% de mi tiempo al proyecto, tengo experiencia en desarrollo de negocios y software.", "group_id": 965, "id": 495195}, {"user_id": 3665, "stars": [], "topic_id": 16418, "date_created": 1301601486.677316, "message": "@soska ¿Cual sería un \"equity\" razonable? Supongo que dependería del tipo de trabajo...", "group_id": 965, "id": 495339}, {"user_id": 3665, "stars": [], "topic_id": 16418, "date_created": 1301601516.3870881, "message": "Cuál*", "group_id": 965, "id": 495350}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301604009.0397201, "message": "@Kuroir Yo tampoco soy ingeniero. Freelancear no es igual a emprender, btw.", "group_id": 965, "id": 496031}, {"user_id": 26088, "stars": [], "topic_id": 16418, "date_created": 1301604660.2921979, "message": "para mi los trabajitos freelancer son lo seguro :S", "group_id": 965, "id": 496194}, {"user_id": 26084, "stars": [{"date_created": 1301592836.757731, "user_id": 10406}], "topic_id": 16418, "date_created": 1301575505.399225, "message": "@soska no te desesperes, tal y como dice @dsch hay que inspirar primero, demostrar que se puede hacer, tu mismo lo dijiste, el efecto borrega inicia después de ver a los primeros.", "group_id": 965, "id": 491246}, {"user_id": 19920, "stars": [], "topic_id": 16418, "date_created": 1301582619.7741921, "message": "Dese hace años vengo padeciendo lo que dice @soska lo que sucede es que me ha faltado valor, mi principal enemigo es mi propio miedo ha sufrir por algunos días la falta de comodidades que me deja mi salario actual.", "group_id": 965, "id": 492566}, {"user_id": 19938, "stars": [], "topic_id": 16418, "date_created": 1301586700.880558, "message": "@Logydes Pues hazlo en tus ratos libres. Tómate vacaciones para dedicarle ese tiempo a tu idea. Separa una parte de tu sueldo y págale a un programador para que te ayude con algunas partes del desarrollo. Si en verdad lo quieres hacer tomar esta decisión debe ser fácil. Si no, ni le intentes. No es lo tuyo.", "group_id": 965, "id": 493115}, {"user_id": 19938, "stars": [{"date_created": 1301590782.8771579, "user_id": 19921}, {"date_created": 1301684317.41381, "user_id": 24160}], "topic_id": 16418, "date_created": 1301588816.038712, "message": "¿Porqué ese pendejo del puesto de tacos trae un carro del año? Pos por eso mismo, por pendejo. Normalmente un pendejo no mide el riesgo, no lo piensa tanto, y se avienta y pone su negocio. Mientras, los que analizan más las cosas, los que buscan más razones encuentran más excusas.", "group_id": 965, "id": 493330}, {"user_id": 3665, "stars": [], "topic_id": 16418, "date_created": 1301591241.666821, "message": "En mi caso, tengo familia y es complicado comprometer su estabilidad, a ellos no les puede decir que pasaremos tiempos difíciles, por eso trato de hacer lo que puedo por las noches", "group_id": 965, "id": 493714}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301591417.336566, "message": "@albrtk El ejemplo ahí es la cita de Steve Jobs, no lo que Sculley terminó haciendo :P", "group_id": 965, "id": 493752}, {"user_id": 19938, "stars": [{"date_created": 1301592753.595998, "user_id": 19921}], "topic_id": 16418, "date_created": 1301592530.893904, "message": "@soska entiendo lo que dices. Pero, algunos de los que han posteado aquí no se avienta a poner ningún negocio, sin importar el tamaño. Crees que se aventarán el paquetote de querer hacer el siguiente google? Un paso a la vez. Casi todas las empresas que mencionas no fueron creadas pensando en que serían lo que son. Fueron creadas pensando en que serían un negocio. Resultó que fueron grandes (en cierta medida cada una) pero eso no fue por diseño.", "group_id": 965, "id": 493976}, {"user_id": 3665, "stars": [], "topic_id": 16418, "date_created": 1301592736.471833, "message": "@edmz Creo que las empresas grandes si vieron el gran futuro que pudieran tener, pero como dices, un paso a la vez. Cada que empiezo un proyecto, por chico que sea, me gusta pensar que tan grande puede ser y como.", "group_id": 965, "id": 494003}, {"user_id": 3084, "stars": [], "topic_id": 16418, "date_created": 1301596972.6775081, "message": "Cuenta el mito que Jack Dorsey *inventor* de Twitter tuvo la visión desde que era empleado en Odeo (compañía de podcast) pero no le dijo a nadie por que le daba penita hasta que tuvo la oportunidad de desarrollar \"casualmente\" la primer versión en un hackaton de Odeo. Moraleja: NO está mal tener miedo, pero éste no debe ser un freno. Una estrategia? Saber aprovechar el momento justo. A veces el timing lo es todo.", "group_id": 965, "id": 494642}, {"user_id": 4653, "stars": [], "topic_id": 16418, "date_created": 1301601899.503336, "message": "Yo no estudié ingeniería :( eso me hace menos (?) - trolling. Concuerdo con la parte de que el tiempo lo hace todo. Igual y creo que dejar un trabajo seguro no significa que no puedas hacer unos cuantos trabajitos de freelancing. Desde México fácil puedes ganar lo suficiente para vivir con 1 proyectito de unas horas al mes.", "group_id": 965, "id": 495433}, {"user_id": 4653, "stars": [], "topic_id": 16418, "date_created": 1301606102.03896, "message": "@soska  creo que entendiste mal... emprendes y freelanceas. Así de simple.", "group_id": 965, "id": 496525}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301608340.434653, "message": "@Kuroir Cierto, había entendido mal y me disculpo. De hecho, soy proponente de bootstrapping by freelancing http://startupinmexico.com/4-bootstrapping-by-freelancing/ ( Obvio eso antes de recibir inversión)", "group_id": 965, "id": 496926}, {"user_id": 26421, "stars": [{"date_created": 1301633098.487781, "user_id": 18131}], "topic_id": 16418, "date_created": 1301608776.8022771, "message": "Dejé la Universidad, renuncié a mi empleo y estoy trabajando en mi propio proyecto, no me da miedo lo que estoy haciendo, lo único que me frustra es la poca ayuda de la gente que se dice emprendedora que está a lado mío, que lo único que sabe hacer es burlarse de las ideas de los demás y hablar maravillas sobre regalar tu trabajo.", "group_id": 965, "id": 497030}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301609660.686548, "message": "@edx Vente a GDL :)", "group_id": 965, "id": 497101}, {"user_id": 25716, "stars": [], "topic_id": 16418, "date_created": 1301612969.12626, "message": "@edx soy listo de te ayudar, si necesites :) (pero yo no tengo mucho tiempo...)", "group_id": 965, "id": 497480}, {"user_id": 20022, "stars": [], "topic_id": 16418, "date_created": 1301613745.4620931, "message": "@edmz anda con todo .... a todos nos gustaria una idea disruptiva pero se quiere cambiar el mundo sin comenzar por nuestra realidad ... tenemos campaign monitor , mail chimp y muchas mas que hacen lo mismo y todas facturan arriba de los 30 al año . el mercado es muy grande.  Cuantos clientes que te paguen 50 o 30 usd mensuales se necesitan para dejar de estar pensando en la seguridad del sueldo que normalmente perciben?.", "group_id": 965, "id": 497586}, {"user_id": 3084, "stars": [], "topic_id": 16418, "date_created": 1301617408.3516901, "message": "@edx Necesitas algún apoyo en particular? Cuenta pa' ver si te podemos echar la mano por acá :)", "group_id": 965, "id": 497921}, {"user_id": 4653, "stars": [], "topic_id": 16418, "date_created": 1301661872.205224, "message": "@soska nice! Yo ando \"prostituyendome\" como freelancer para hacer bootstrap, 85% completed.", "group_id": 965, "id": 500979}, {"user_id": 25609, "stars": [], "topic_id": 16418, "date_created": 1301681006.601177, "message": "llego un poco tarde pero o/", "group_id": 965, "id": 503968}, {"user_id": 24172, "stars": [], "topic_id": 16418, "date_created": 1301713115.8476939, "message": "Entiendo tu frustración @soska , no podemos hacer nada si los límites son ellos mismos. En ese sentido, la mejor forma de ayudar, es invitándolos a que conozcan lo que haces, que sepan tu historia y tratar de \"evangelizar\" la profesion de emprendedor.", "group_id": 965, "id": 507352}, {"user_id": 6541, "stars": [], "topic_id": 16418, "date_created": 1301717145.033982, "message": "claro, debemos cubrir las necesidades basicas y servicios comer/techo/internet al menos eso es lo unico que necesito.", "group_id": 965, "id": 507449}, {"user_id": 15089, "stars": [], "topic_id": 16418, "date_created": 1301716806.4288371, "message": "Bueno en mi caso si pienso en tener algo de respaldo para poder \"vivir\" y aun se que que el proyecto dara para eso, primero tuve que juntar dinero y programar de noche para ahora poder dedicarle al 100% o la mayoria del tiempo, si mucha veces los compromisos o la inseguridad nos detienen y tambien tener la acritud que podemos", "group_id": 965, "id": 507438}, {"user_id": 25609, "stars": [], "topic_id": 16418, "date_created": 1301785677.5993791, "message": "En HackerGarage parte de nuestra misión es precisamente ayudar a que la gente se anime, poder salir de casa a trabajar a un ambiente seguro (y que crea en ti) es esencial para el Emprendedor.\n\nAsí como poder tener acceso a mas emprendedores, inversores, hackers etc. que te ayuden a abrir tus horizontes.", "group_id": 965, "id": 510794}, {"user_id": 19920, "stars": [], "topic_id": 16418, "date_created": 1301807783.1590841, "message": "Bueno, en realidad, yo trabajo para dos empresas particulares a las cuales desarrollo, es decir, en ambas estoy en nómina, aún así tengo proyectos que desarrollo por mi cuenta. Hasta hace poco desarrollaba a clientes a la medida, tengo varios clientes, sin embargo, debo aceptar que des hace apenas pocos meses me empezó a caer el 20 de las startups y ahora varias de las cosas que hice para clientes, veo que tienen cosas en común y que si \"factorizo\" algunos módulos le podrían servir a mucha gente y sobre esa línea me voy, ya estoy en eso. No me importa que tanto tiempo me lleve, sé que lo voy a lograr. Una de las ideas que estoy trabajando está relacionado con la Psiquiatría, si, así como lo oyen, creo que al final, sino lo logro, por lo menos los psiquiatras estarán familiarizado con mi locura jajaja. No pierdo nada y creo que puedo ganar mucho.", "group_id": 965, "id": 512114}, {"user_id": 6541, "stars": [], "topic_id": 16418, "date_created": 1301809247.9076729, "message": "@Logydes deberias mostrar lo que llevas, tal vez varios puedan dar sugerencias", "group_id": 965, "id": 512293}, {"user_id": 19920, "stars": [], "topic_id": 16418, "date_created": 1301811669.965543, "message": "Si, tal vez debería...", "group_id": 965, "id": 512589}, {"user_id": 25716, "stars": [], "topic_id": 16418, "date_created": 1301850073.9534831, "message": "@jyr agree :)", "group_id": 965, "id": 515586}, {"user_id": 26105, "stars": [], "topic_id": 16418, "date_created": 1301891329.5141361, "message": "Lo de mexican.vc se ve muy interesante para lanzarse de tiempo completo, tal cual.", "group_id": 965, "id": 520466}, {"user_id": 26105, "stars": [], "topic_id": 16418, "date_created": 1301891924.7883811, "message": "o peor cuando tienes pareja, hijos, etc.", "group_id": 965, "id": 520561}, {"user_id": 10227, "stars": [], "topic_id": 16418, "date_created": 1301892685.824635, "message": "@soska tmb estoy intentando emprender con mi banda, pero creo q tienes razon, los amplificadores mas grandes y eso los puedo pedir prestados con amigos, dejar la uni, ya no puedo, llegue al limite de las bajas temporales", "group_id": 965, "id": 520618}, {"user_id": 10227, "stars": [], "topic_id": 16418, "date_created": 1301891841.896266, "message": "pues cuando tienes q ganar $ para ir a la Universidad, gastos personales, comprar instrumentos, etc... es muy dificil dejar el trabajo para dedicarte a tu idea :/", "group_id": 965, "id": 520551}, {"user_id": 2946, "stars": [], "topic_id": 16418, "date_created": 1301892246.01173, "message": "@mishudark La universidad puede esperar un par de años, los gastos personales se pueden reducir a lo básico y ¿instrumentos? a menos que seas músico profesional dudo que *necesites* instrumentos. \n\nYo digo que si eres joven, soltero y nadie depende económicamente de tí, no hay pretexto que valga para dedicarte 1 año a tu proyecto (freelanceando un poco de lado) y ver si estas hecho para emprender o no.\n\nSi hoy te parece dificil, en 5 años va a ser simplemente imposible.", "group_id": 965, "id": 520592}, {"user_id": 6541, "stars": [], "topic_id": 16418, "date_created": 1301892294.9681921, "message": "@mishudark  solo veo complicado cuando se tienen hijos, lo demas se puede manejar de alguna manera", "group_id": 965, "id": 520596}, {"user_id": 13316, "stars": [], "topic_id": 16418, "date_created": 1301986428.979532, "message": "@mishudark desde que se inventaron los prestextos se acabaron los... :-p", "group_id": 965, "id": 536942}, {"user_id": 13316, "stars": [], "topic_id": 16418, "date_created": 1301986441.363817, "message": "el que mucho abarca poco aprieta...", "group_id": 965, "id": 536947}, {"user_id": 12739, "stars": [{"date_created": 1302011216.5953131, "user_id": 26084}, {"date_created": 1302024107.7809451, "user_id": 13316}, {"date_created": 1302055734.7758961, "user_id": 20146}, {"date_created": 1302114185.9727509, "user_id": 25716}, {"date_created": 1302114218.419076, "user_id": 3665}], "topic_id": 16418, "date_created": 1302008661.5079229, "message": "¿Porqué la necesidad de dejarlo todo para \"aventarse a emprender\"? No hay necesidad de hacerlo, no lo hicieron los de 37signals, no lo hizo Github, no hay necesidad de sentirse obligado a hacerlo. No todo es 1 o 0, no hay necesidad de arriesgarte a quedarte sin trabajo en 3 meses teniendo familia. Puedes crear algo y llevarlo un poco más lento, hacer bootstrapping y aventarte de lleno cuando ya tenga algo de donde sostenerse.", "group_id": 965, "id": 540368}, {"user_id": 20521, "stars": [{"date_created": 1302022251.2851689, "user_id": 13316}], "topic_id": 16418, "date_created": 1302009799.8589611, "message": "@gnuget hablando de pretextos :P http://www.youtube.com/watch?v=q6pNgSot6tc&playnext=1&list=PLC13373BE4A724887", "group_id": 965, "id": 540566}, {"user_id": 25716, "stars": [], "topic_id": 16418, "date_created": 1302114199.4107771, "message": "@pablasso si :)", "group_id": 965, "id": 562572}]