[{"user_id": 23776, "stars": [], "topic_id": 20530, "date_created": 1303316326.0421121, "message": "Hi guys, we just redesigned our startup on helping people buy and sell second hand stuff with video.  Looking for honest feedback and some early adopters.  http://www.123exchanges.com", "group_id": 250, "id": 756531}, {"user_id": 21360, "stars": [], "topic_id": 20530, "date_created": 1303422091.0139649, "message": "@huuleon I've seen this website a few times and I honestly don't see any real benefit to video.  What would be a real hit?....   Make the video editable to the viewer with question and comment boxes.  The ability to circle an area with the mouse and a pop-up comment section would blow this service out of the water.  If I see a scratch on a car door and circle it, then ask the owner if it has been repaired or buffed out, I could get alot more information in real time.  This would greatly benefit the user experience and add to the video advantage.  GL", "group_id": 250, "id": 775962}, {"user_id": 21360, "stars": [], "topic_id": 20530, "date_created": 1303423197.973664, "message": "@huuleon Sorry, didn't mean to say \"I don't see any real benefit to video\".  I meant that pictures can show much of what video can.  But it would be cool if this is in early stages of being something huge.  The pop up comments could also help sellers get feedback on sections of the video that need to be clarified, or parts that the owner didn't know were valuable.  And numbers and letters could be typed if they are not clear in the video.  GL", "group_id": 250, "id": 776122}, {"user_id": 23776, "stars": [], "topic_id": 20530, "date_created": 1303531736.9292901, "message": "@Energypanacea  I'm still a bit confused regarding to the pop-up comment you're recommending. Can you clarify that because I really like the idea of letting users circle fault areas.", "group_id": 250, "id": 787167}, {"user_id": 23776, "stars": [], "topic_id": 20530, "date_created": 1303531543.086333, "message": "@energypancea I'm still a bit confused regarding to the pop-up comment you're recommending.  Can you clarify that because I really like the idea of letting users circle fault areas.", "group_id": 250, "id": 787159}, {"user_id": 23776, "stars": [], "topic_id": 20530, "date_created": 1303571372.238991, "message": "@Energypanacea ok i get your point.  I'll look into that.  Thanks", "group_id": 250, "id": 789439}, {"user_id": 21360, "stars": [], "topic_id": 20530, "date_created": 1303570281.1348331, "message": "@huuleon It would take a licensing agreement from a video editor like Mac QuickTime, but users could edit the video.  You could charge for the service too.  Give someone three edits to ask the seller for $x.  A pause button and a \"circle button\" (to highlight a certain area on the video by clicking on the area in question) is all you need.  That could trigger a comment box to appear below the video with a \"circle\" at the spot in question..  Then the comment box would come up as the video plays.  The seller would reply to the comment box below the video.  It would add many benefits to your service.  And add $.", "group_id": 250, "id": 789369}]