[{"user_id": 11626, "stars": [], "topic_id": 6749, "date_created": 1297917655.002408, "message": "The Pentagon’s blue-sky research agency will get an infusion of new cash to research new cybertechnologies, according to the just-released fiscal 2012 defense budget request. Sound vague and undefined? That’s because it is.\r\n\r\nOut of the $553 billion base budget, Darpa gets half a billion in research money “to invest in cyber technologies.” There’s absolutely no elaboration in the Pentagon’s 129-page budget document, which you can read here. In total, the request includes $1.3 billion for the “training of cyber analysts” — apparently outside of Darpa — and boosts cash to the Defense Information Security Agency for “cyber identity, monitoring and enforcement.”\r\n\r\nDarpa representatives have yet to return messages requesting clarification. But the unspecified cash for Darpa is as much as the long-term budget plan devotes, over four years, to building a Joint Operations Center at U.S. Cyber Command, the new military command that’s supposed to protect the military’s networks.\r\n\r\nDarpa’s plans in cyberspace don’t hurt for lack of ambition. In August, it released a new program, called CINDER, to sniff out “insider threats” to military computer systems by hunting for anomalous behavior from people authorized to access them. The insider threat question has been a huge one within the military since Pfc. Bradley Manning allegedly passed thousands of confidential documents to WikiLeaks.\r\n\r\nEven beyond insider threat detection, in January, Darpa began a “Cyber Genome” project to create the digital equivalent of DNA or fingerprints, in order to determine irrefutably who might be behind a cyberattack. But some of its other efforts have hit snags. A $17 billion push to create a National Cyber Range to test out cyberattacks and defenses isn’t proceeding fast enough for some in the military; some agencies want to produce their own mini-ranges in the interim.\r\n\r\nAt a Pentagon briefing this afternoon for the release of the budget, neither Defense Secretary Robert Gates nor Robert Hale, the Pentagon comptroller, elaborated on what the new Darpa money will actually finance. But both held out the new money as an example of how the budget takes a far-sighted approach to funding emerging threats, even as it barely increases total funding for the military from its request last year, which Congress has yet to pass. But will Congress really be willing to throw half a billion at Darpa just because the Pentagon puts the buzzword “cyber” next to a vague research requirement?\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/gates-boosts-cash-to-darpa-for-cyber-tech-research", "group_id": 3920, "id": 129410}]