[{"user_id": 227, "stars": [], "topic_id": 1583, "date_created": 1296611706.246712, "message": "It's been cold as hell in Portland lately, but spring is coming, and I just signed up for a couple of races - the Bridge to Brew 10K ( http://www.terrapinevents.com/bridge-to-brews_info.htm ) and the Cinco de Mayo half marathon ( http://www.terrapinevents.com/cinco_info.htm ). I just need to get in shape for them - but running in the winter sucks so much, mainly due to the darkness. I feel like my day is completely over at 5pm. Anyone have any tips?", "group_id": 105, "id": 41644}, {"user_id": 230, "stars": [], "topic_id": 1583, "date_created": 1296713143.5716741, "message": "I've been running at 24. I tend to just listen to some Deadmau5 or watch Anderson Cooper (he so dreamy) and go for an hour or so. Also, I saw a treadmill show up downstairs by the corridor to the BankSimple dudes' office the other day. Or, since it's staying brighter later, I'd be up for running around the waterfront / eastbank esplanade if you like. Heading all the way down to south waterfront / OHSU and back up around the Steel, you can hit about five miles.", "group_id": 105, "id": 43880}, {"user_id": 780, "stars": [], "topic_id": 1583, "date_created": 1297278203.5606239, "message": "I live in Michigan...so I bought an elliptical and I have my gym downstairs. I love my Total Gym. I can work on strength training and keep my heart rate a little elevated.", "group_id": 105, "id": 52320}, {"user_id": 227, "stars": [], "topic_id": 1583, "date_created": 1297279435.21803, "message": "@dmoylan oof, running in Michigan in winter sounds pretty hellish.", "group_id": 105, "id": 52978}, {"user_id": 1214, "stars": [], "topic_id": 1583, "date_created": 1297279494.171912, "message": "Sometimes I drink a cup of coffee before I go on my morning runs. And I wear tights, light gloves and ear covering.", "group_id": 105, "id": 53009}, {"user_id": 780, "stars": [], "topic_id": 1583, "date_created": 1297284177.042217, "message": "@mtrichardson  @selenamarie Yes, lots of layers! If it's sunny and at least 30 degrees it's rather invigorating after the first 10-15 min. I love my coffee in the morning but not before a run...", "group_id": 105, "id": 55402}, {"user_id": 563, "stars": [], "topic_id": 1583, "date_created": 1297286695.5040159, "message": "I'm in NC so it's probably not as cold.  I go for my runs at 5:30am at about 25 degrees.  I've grown to enjoy the crisp air and the darkness.  But It's tough to run on the streets.  The cars that are out at that hour will not move out of the way.  I have to be alert and make sure I am off the pavement.", "group_id": 105, "id": 56964}, {"user_id": 780, "stars": [], "topic_id": 1583, "date_created": 1297288066.5208721, "message": "25 seems colder in the dark! But it does feel great. What is up with people in cars? I think the ones that almost hit you definitely NEVER run or ride a bike. So sad. Makes it dangerous to listen to music", "group_id": 105, "id": 57848}]