[{"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1304992328.662523, "message": "Nuevo frente para la Brigada Digital, sobre la divulgación, posibles usos, capacidades y soluciones de implementar Software libre en instituciones, empresas, organizaciones oficiales, privadas, y desde luego, para todos los ciudadanos Colombianos. ;)", "group_id": 2696, "id": 981900}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1305033084.280808, "message": "@KAMIAN por una distribución libre como política pública en Colombia", "group_id": 2696, "id": 989057}, {"user_id": 15483, "stars": [], "topic_id": 34481, "date_created": 1305035239.5203979, "message": "Utilizo estos marcadores para recopilar información que me parece interesante al respecto http://www.delicious.com/knowledgefactory/software_libre .  En este momento es poca, pero espero que sea de utilidad", "group_id": 2696, "id": 989496}, {"user_id": 15483, "stars": [], "topic_id": 34481, "date_created": 1305035160.350369, "message": "Muy buena iniciativa.  Cuenten con todo mi apoyo", "group_id": 2696, "id": 989483}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1305042737.668618, "message": "(Venezuela) http://canaima.softwarelibre.gob.ve/ - (Univ. Latinoamerica) http://lula.unex.es/ - (Extramadura) http://www.linex.org/ - (Andalucía) http://www.guadalinex.org/ - (Castilla)  http://www.molinux.info/ -  (Cataluña) http://linkat.xtec.net/portal/ - (Valencia) http://lliurex.net/home/ - (Munich) http://goo.gl/7wx0F - (Sao Paulo) http://sacix.org.br   Algunas distribuciones apoyadas por gobiernos Nacionales y Locales.", "group_id": 2696, "id": 991763}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1305044790.5649121, "message": "Bueno, ¿entonces dejamos el nombre del topic así? ¿o lo cambiamos?, a mí me parece importante destacar que vamos a debatir y proponer desde el software libre, ¿porque?, por que el software corporativo ya posee estrategias de difusión, investigación, incursión y mercadeo propias, mientras el software libre se respalda de los usuarios (y de algunas organizaciones) para esas actividades. Por eso nos pareció conveniente que desde la #BrigadaDigital se proyecten este tipo de plataformas. los leo! ;)", "group_id": 2696, "id": 992381}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1305045116.8084581, "message": "Me parece bien @KAMIAN abarca todo, distribuciones, aplicaciones, y procesos", "group_id": 2696, "id": 992518}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1305213911.152992, "message": "@juandacorrea sabes si ya hay algo adelantado sobre este tema con algún grupo o universidad???", "group_id": 2696, "id": 1025492}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1305298762.0735531, "message": "Esta interesante esta presentación del Edubuntu: http://www.movimientolibre.com/presentaciones/edubuntu-en-la-educacion/edubuntu-en-la-educacion.pdf via @avalonzero", "group_id": 2696, "id": 1042498}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306176711.7539041, "message": "Bueno, ayer estuve conversando con un gran amigo y él \"personalmente\" les contará unas muy buenas ideas para hacer acciones de promoción del software libre que podemos hacer nosotros como ciudadanos y brigadistas digitales!! :D", "group_id": 2696, "id": 1155623}, {"user_id": 15483, "stars": [], "topic_id": 34481, "date_created": 1306253038.9183459, "message": "Que pena @WolfMneo solo hasta hoy leo tu pregunta.  Se de un grupo llamado SugarLabs liderado por @mapisaro que trabajó mucho sobre la adopción de software libre en temas educativos", "group_id": 2696, "id": 1167479}, {"user_id": 13447, "stars": [], "topic_id": 34481, "date_created": 1306807679.224822, "message": "Pienso que tiene que haber un escuadrón que trate el tema de software libre y estoy de acuerdo, el detalle es que dicen que se habla de neutralidad por parte de la brigada. Yo propongo que ampliemos el tema a un escuadrón de #IndustriaTIC o #IndustriaSoftware y de esa manera podemos tener cabida.", "group_id": 2696, "id": 1233794}, {"user_id": 13447, "stars": [], "topic_id": 34481, "date_created": 1306807911.6050971, "message": "Lo importante es tratar el tema de forma transversal y podemos meter temas como el Software Libre, Cloud Computing y virtualización. Podemos permear con software libre todo el tema de apps en la brigada.", "group_id": 2696, "id": 1233806}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306807207.3453791, "message": "Bueno puse el tema en la palestra!!! dialoguemos :)", "group_id": 2696, "id": 1233738}, {"user_id": 34037, "stars": [], "topic_id": 34481, "date_created": 1306818034.7226739, "message": "no entiendo muy bien el tema de la neutralidad en la brigada. Pues si el escuadrón es INDUSTRIA del software, entonces nos estamos yendo del lado de los fabricantes y productores de contenidos. No tendríamos este problema con el software libre ya que usuarios y programadores están al mismo nivel, en el sentido de que no hay comercio sino colaboración", "group_id": 2696, "id": 1234614}, {"user_id": 34037, "stars": [], "topic_id": 34481, "date_created": 1306819774.6713271, "message": "La filosofía del software libre establece que la gente pueda usar el software de todas las formas que considere \"socialmente útiles\": el código está disponible para poder descargarlo, modificarlo y usarlo del modo que más le convenga. Por tanto, además del hecho de que el software libre normalmente puede conseguirse sin coste alguno, esta libertad también tiene ventajas técnicas: al desarrollar programas puede utilizarse el trabajo de los demás y construir a partir de éste. Con el software no-libre, esto no es posible, y para desarrollar un programa, se tiene que empezar desde cero. Por esta razón, el desarrollo de software libre es rápido y eficiente.Pueden encontrar más información acerca de la filosofía del software libre aquí: http://www.gnu.org/philosophy/philosophy.es.html", "group_id": 2696, "id": 1234788}, {"user_id": 34037, "stars": [], "topic_id": 34481, "date_created": 1306819625.8233421, "message": "Ubuntu es la distribución más popular de linux a continuación les dejo los principios de Ubuntu, esto nos puede servir para dialogar: \n- Ubuntu siempre será gratuito, y no habrá un coste adicional para la «edición profesional»; queremos que lo mejor de nuestro trabajo esté libremente disponible para todos.\n- Para hacer que Ubuntu pueda ser usado por el mayor número de personas posible, Ubuntu emplea las mejores herramientas de traducción y accesibilidad que la comunidad del Software Libre es capaz de ofrecer.\n- Ubuntu publica de manera regular y predecible, una nueva versión cada seis meses. Puede usar la versión estable o probar y ayudar a mejorar la versión en desarrollo.\n- Ubuntu está totalmente comprometido con los principios de desarrollo del software de código abierto, animamos a la gente a utilizarlo, mejorarlo y compartirlo.", "group_id": 2696, "id": 1234767}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306821233.673003, "message": "Sip, es que creo que son temas diferentes, por un lado @avalonzero habla del desarrollo de software, desde la industria y por el otro @trunimrod habla de impulsar el software libre, desde la comunidad de usuarios. Obviamente los temas son totalmente compatibles, lo que pasa es que tal vez la potencia de un escuadrón en la brigada digital especializado en el tema del software libre se daría en la divulgación, distribución y sensibilización del uso de este tipo de herramientas, no como competencia y remplazo del software comercial, sino como una interesante opción que todos los Colombianos debemos aprender, especialmente si se quiere promover el uso de software legal. Yo no soy \"militante\" del software libre, incluso uso windows, mac y ubuntu, pero sé que hay otras opciones, y eso es lo que debemos y queremos hacer, que los colombianos sepan que tienen opciones mas allá de la piratería, que existen algunos programas o sistemas operativos en los cuales pueden hacer las mismas cosas, mejor o peor, depende del caso, pero principalmente que conozcan esas otras opciones y sean capaces por si mismos de discernir, probar, escoger y ojalá promover y participar ellos mismos en el desarrollo, divulgación y capacitación de las mismas.", "group_id": 2696, "id": 1234907}, {"user_id": 34684, "stars": [], "topic_id": 34481, "date_created": 1306822390.507915, "message": "Segun un conocido, él menciona: \"He tenido la oportunidad de trabajar de cerca con importantes herramientas de software libre, y es \"bonito\" ver el florecimiento de proyectos concretos, con el apoyo de muchos, en cientos de idiomas, y luego encontrarse una comunidad de personas que GRATIS te colaboran, dan soporte, realizan eventos, etc.\" sin mas preambulo, los dejo con este video. http://www.youtube.com/watch?v=eskh1SedgYo&feature=related", "group_id": 2696, "id": 1234986}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306841342.9434431, "message": "Como les decia ayer, los que manejan software libre tendrian una gran cabida en muchos escuadrones de la brigada. Redsalvavidas esta muy metida en el manejo de Ushahidi, Geekgirls si no entendi mal esta usando Moodle, muchos necesitaran Joomla seguramente en algun momento, etc.", "group_id": 2696, "id": 1236879}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306841697.516295, "message": "Y sobre Ubuntu. He visto a muchos evangelizadores del software libre cometer el mismo error, pensar que realmente le pueden cambiar TODO el sistema a una persona a Linux y esperar que funcione. Software libre no es exclusivo de Linux. Si tu le cambias a la gente Office por OpenOffice, aunque esten en WIndows, estas ganando adeptos que en algun momento si podran migrar a Linux. Muchas empresas de multimedia y videojuegos inician con Blender, Gimp, etc. Los callcenters en Colombia estan la mayoria sobre Asterix, etc.", "group_id": 2696, "id": 1236900}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306841769.6763861, "message": "Mejor dicho, creo que es mas eficaz evangelizar sobre las aplicaciones utilitarias libres, que sobre Linux, la gente que las use eventualmente terminara en Linux pero permanentemente.", "group_id": 2696, "id": 1236909}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306841245.4142261, "message": "Creo que la posicion de neutralidad de la brigada es correcta. Se debe fortalecer el desarrollo de aplicaciones y su apropiacion, especialmente lo que va de la mano de VIveDigital y Apps.co, pero no creo que se deba crear un escuadron que incentive un tipo de licenciamiento de software. Es muy sesgado.", "group_id": 2696, "id": 1236874}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1306850578.7693319, "message": "La adopción de una política de software libre aboga mas por incentivar en la población el sentido de crear sus propios espacios basándose en sus necesidades, no esperar a que las soluciones lleguen si no crearlas. Acá dejo un aparte del discurso del presidente de Brasil sobre este tema: \"El Software Libre es un poco de eso, o sea, es darle a las personas la oportunidad de hacer cosas nuevas, de crear cosas nuevas, de valorizar la individualidad de las personas. Porque no hay nada que garantice más la libertad que si uno garantiza la libertad individual, que las personas permitan aflorar su creatividad, su inteligencia, sobre todo en un país nuevo como Brasil, en el que la creatividad del pueblo posiblemente sea, sin ningún menosprecio a otros pueblos, el pueblo con la más grande creatividad en el siglo XXI\"  (http://www.hispalinux.es/node/704).", "group_id": 2696, "id": 1237603}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1306850358.668746, "message": "Muy respetables y entendibles los puntos de vista, a mi parecer como lo dice @trunimrod en el software libre tenemos una comunidad donde el usuario y el programador se encuentran en el mismo nivel, el software privativo tiene su propio espacio de difusión, promoción y comercialización, en este orden de ideas lo que se hace es equilibrar la balanza, es decir, velar por la neutralidad. Estoy de acuerdo con @Enriquesalazar en que no es hablar solo de Linux, si no, de una distribución que pueda ser desarrollada por y para colombianos, con base en esto si alguna distribución linux después de un consenso es la mas ajustable a los requerimientos se puede utilizar. Finalmente el usuario esta en la entera libertad de escoger cual se adecua mas  a sus necesidades. No veo en la actualidad como se garantiza la neutralidad si plataformas del gobierno me limitan y me obligan a utilizar tecnologias privativas par apoder acceder a sus contenidos", "group_id": 2696, "id": 1237568}, {"user_id": 34037, "stars": [], "topic_id": 34481, "date_created": 1306852521.0391431, "message": "Totalmente de acuerdo con @WolfMneo y @Enriquesalazar no se trata de hablar solo de linux, se puede empezar por educar a las personas sobre la importancia del software libre explicándoles cómo no sería posible internet, o servicios como twitter de no ser por el software libre. Podemos hablar también de WordPress, Moodle, LibreOffice, etc. Pero más interesante aún sería que no nos quedemos en el discurso y hagamos algo que beneficie a la sociedad usando el software libre", "group_id": 2696, "id": 1237861}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306904493.1634159, "message": "hablando de esfuerzos eficientes ;)\n\nLos invitamos a participar en RHoK (http://www.rhok.org)  #3 en Bogota, Colombia el 4 y 5 de Junio.  Es un espacio para convocar a desarrolladores (hackers) para ayudar a solucionar problemas humanitarios. \n\nOtras ciudades donde se hace el RHoK son São Paulo, Silicon Valley, Buenos Aires, Berlin, Nairobi, Kampala, Melbourne,  Lusaka, Trento, Hartford, Aarhus, Atlanta, Santiago, Basel,Bangalore, Philadelphia, Toronto y Seattle.  \n\nPueden encontrar la lista de problemas a solucionar en http://www.rhok.org/problems\n\nPueden inscribirse al evento en http://www.rhok.org/event/bogota\n\nAgradecemos mucho su participacion, las problematicas a tratar son aplicables a la emergencia ambiental en Colombia como en el resto del mundo. Software desarrollado en versiones anteriores ha ayudado en las emergencias de Haiti, Libia, entre otros. Sera una emocionante maraton de dos dias. A los inscritos les enviaremos el lugar del evento, los patrocinadores y la mecanica del trabajo.", "group_id": 2696, "id": 1248967}, {"user_id": 8142, "stars": [], "topic_id": 34481, "date_created": 1306904375.1891921, "message": "@WolfMneo ehh yo no dije de una distro colombiana, eso seria un desperdicio inmenso de esfuerzos que se podrian utilizar para muchas otras cosas.", "group_id": 2696, "id": 1248934}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306936008.3840621, "message": "muy bueno Enrique!", "group_id": 2696, "id": 1253208}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306936336.7843111, "message": "Como dije en un post anterior, creo que estamos confundiendo el tema del desarrollo de software, con el tema de difusión, apropiación y culturización acerca del uso adecuado del software. Concretamente, la idea de un escuadrón de Software Libre es trabajar en el segundo punto, tomando en cuenta que, como bien lo decía @WolfMneo y @patricia29m, para garantizar la neutralidad deberíamos apoyar la divulgación del uso del software libre, ya que esta se sustenta en las comunidades, a diferencia del software privativo que tiene muy claras y definidas sus estrategias de mercadeo, estas no necesitan apoyo de las comunidades.", "group_id": 2696, "id": 1253267}, {"user_id": 16500, "stars": [], "topic_id": 34481, "date_created": 1306936631.945817, "message": "Y la idea de @EnriqueSalazar de no ser tan radicales y de una intentar meterle linux a los usuarios es muy buena!, mas que intentar vender un producto determinado, es culturizar acerca del software libre, que posibilidades y límites tiene, para que puede servir, cuales son sus beneficios, como es la interesante filosofía detrás del desarrollo y soporte de estas herramientas, y si es posible desarrollar actividades concretas en RL como la que proponía @trunimrod del \"quematón\" de SL para que no se quede todo en un discurso vacío.", "group_id": 2696, "id": 1253318}, {"user_id": 21732, "stars": [], "topic_id": 34481, "date_created": 1306937432.062022, "message": "@Enriquesalazar lo siento fue error de redacción. Pero aun así, a mi parecer los esfuerzos en desarrollo no son desperdicio, si no inversión en investigación. No se debe pesar que todo esta hecho. Y muy bueno el aporte rhok", "group_id": 2696, "id": 1253466}]