[{"user_id": 11626, "stars": [], "topic_id": 7687, "date_created": 1298230903.0928891, "message": "http://www.rawstory.com/rs//wp-content/uploads/2011/02/ALeqM5hkKagCL5DTI5aQaHQJHgFGQFwVNA.jpg\r\n\r\nWASHINGTON (Reuters) - Senior Senate Democrats slammed Republicans on Sunday for a \"reckless\" threat to shut down the government as political posturing intensified on both sides over federal spending and the budget deficit.\r\n\r\nThe House of Representatives approved legislation on Saturday to cut federal spending by $61 billion through September. But The bill, pushed through by Republicans, was sure to be significantly changed by President Barack Obama and his fellow Democrats in the Senate.\r\n\r\n\"Unfortunately Speaker Boehner seems to be on a course that would inevitably lead to a shutdown ... That's reckless,\" said Democratic Senator Charles Schumer on CNN'S State of the Union program, speaking of House Speaker John Boehner, the top Republican in Congress.\r\n\r\n\"We have said shutdown is off the table ... Boehner, Mitch McConnell, other Republican leaders have not taken it off the table when asked, and there are lots of people on the hard right clamoring for a shutdown.\"\r\n\r\nWith the U.S. government funded only through March 4, some lawmakers from both parties are urging compromise, which was seen as the likeliest outcome, even by one of the House's new breed of small-government, deficit-slashing freshman Republicans.\r\n\r\n\"When it goes to the Senate, they're going to make their changes and then it's got to go to the president. So you know, it will not be in the form that we produced yesterday morning at 5 a.m.,\" Representative Steve Southerland, a first-term Republican from Florida, said on ABC's This Week news program.\r\n\r\nThe House bill is a challenge to Obama to tackle record budget deficits seen at hitting $1.6 trillion this year. If there is no compromise, it sets up the possibility of a government shutdown, something Boehner has not ruled out.\r\n\r\nPROGRAMS SPARED\r\n\r\nBut Southerland said on ABC's This Week: \"We have no desire to have a government shutdown. I think that Speaker Boehner has been very, very clear.\"\r\n\r\nThe bill approved early Saturday morning would slash spending on many domestic programs by 14 percent but leave untouched major programs such as the Medicare and Medicaid healthcare programs for the elderly and poor and the Social Security pension program.\r\n\r\nThe House vote was seen as a victory for Tea Party conservatives elected in November.\r\n\r\nObama has outlined his own plan for less-severe spending cuts in 2012, and has warned that tightening the belt too much too soon could harm the slow economic recovery.\r\n\r\nDemocratic Senator Claire McCaskill said her party knows that cuts must be made. \"The question is, what are the priorities here?\" she said on Fox News Sunday.\r\n\r\n\"Are we going to take a weed whacker to education funding in this country while we let millionaires continue to deduct interest on their second home? That doesn't seem to be the right priority ... I'm a little worried that the Republicans in the House are so anxious to threaten shutting down the government.\"\r\n\r\nhttp://www.rawstory.com/rs/2011/02/20/government-shutdown-threat-looms-over-budget-fight", "group_id": 3920, "id": 154528}]