[{"user_id": 38285, "stars": [], "topic_id": 46398, "date_created": 1318273866.8038621, "message": "I've noticed that many SS Throughlines include some sort of sticky situation between the Main and Impact characters; something  that forces them into confrontation and prevents them from just walking away from the relationship. This kind of entanglement seems to create a very strong SS Throughline. A good example is Woody and Buzz's relationship in Toy Story. Now, I'm wondering, is this the very essence of the SS Throughline - does the SS Throughline entail some sort of sticky situation between the Main and Impact - or is it just a storytelling convenience? Because there are complete stories where the Main and Impact just sort of hang around together without much urgency. Like, in American Beauty, Lester and Ricky just find each others' company intriguing. There is conflict between them but nothing's forcing them them into confrontation. Do stories like this have a weaker structure or is this just a matter of storytelling?", "group_id": 2515, "id": 2319808}, {"user_id": 33839, "stars": [], "topic_id": 46398, "date_created": 1318276196.9373839, "message": "I think the best way of looking at it is that conflict can happen on various different levels.  Teammates who have a common goal for instance may disagree on the approach to achieving it.  There's also the video Jim put together (I believe) that has a number of \"we're alike\", showing how these two functions end up having more in common than not - the ONE thing usually being central to the conflict.  \n\nThe essence of the SS is to demonstrate \"the heart\" of the story, where the emotional battle occurs centering on some \"element\" in conflict.  One character has a certain approach whereas the other has a different way and the idea of exploring this particular through line is for the author to show the audience which way THEY believe is the proper way to act.  This is determined by the story's outcome and judgement.  \n\nI can't really comment on American Beauty as I've only seen it once (when it was released).", "group_id": 2515, "id": 2320001}, {"user_id": 10814, "stars": [], "topic_id": 46398, "date_created": 1318520612.540339, "message": "Confrontation is not essential to the SS throughline, but there will be conflicts and setbacks.  It also depends on the nature of the relationship and whether the relationship is growing or decaying.  Stories with relationships that are falling apart tend to SEEM that they have more conflict and confrontation, but it is not necessarily the case.", "group_id": 2515, "id": 2339995}]