[{"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773048.86501, "message": "So for instance in the Storyforming Analysis room right now we don't really have a film selected. We can all throw in our suggestions and once we pick one, we can double click the topic at the top and change it too \"Currently discussing Tangled (2010)\"", "group_id": 2515, "id": 2009316}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314772613.8020301, "message": "The speed is painful -- which I'm sure you're all aware of. So I spent the day checking out other options to continue the chats that I think have been helpful for others (specifically the storyforming analysis, but some theory discussion as well). It's called HipChat, comes with a smokin' desktop app, web app and of course, mobile phone app (iphone, android, etc.). The difference in speed is crazy and should contribute to better less aggravating conversations.", "group_id": 2515, "id": 2009291}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314772489.378279, "message": "Well, with http://dramaticaquery.com picking up speed as more people get comfortable with the interface there, the time has come to move on from Convore. Did some poking around today and found out that the reason for the slowness is because basically there's ONE person working on it. Two of the original founders jumped ship and the sole survivor is trying desperately to bring it back into shape.", "group_id": 2515, "id": 2009285}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773383.9600351, "message": "The differential between HipChat and DramaticaQuery is that DQ is where you go to get a solid answer. You want to know what the heck a Precondition is, go there and ask. Want to know what a Goal of Understanding means, go there and ask.", "group_id": 2515, "id": 2009350}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314772670.9333639, "message": "You can find it at http://dramatica.hipchat.com. There you should find the \"General Discussion\" room where newbies can introduce themselves, say hi, ask if Dramatica is really that good and grab an invite.", "group_id": 2515, "id": 2009295}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314772764.8245471, "message": "The invites are required for the other rooms - the General Discussion is open to the Public and doesn't require you to be a member. For the other rooms you'll need to PM me your email address so that I can send you the proper link. To do that simply access the Messages tab at the top of this window and send me your info.", "group_id": 2515, "id": 2009297}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314772970.337266, "message": "The two other rooms are \"Dramatica Theory\" and \"Storyform Analysis\". It is unlike Convore in that there will not be separate threads for different topics. Instead think of it as a room where you can step in and join in on the current conversation. At the top of the chat window will be the topic of discussion at the moment. Anyone can set the topic - hopefully people won't abuse it.", "group_id": 2515, "id": 2009309}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773190.6541009, "message": "Likewise with \"Dramatica Theory\" we can change it too \"How did you find Dramatica\" and discuss it for awhile, once it dies down, maybe someone will want to discuss \"How signposts work\" and so on.", "group_id": 2515, "id": 2009333}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773842.7835569, "message": "Thanks for reading and hope to see you over there...can't wait to moderate another storyform. Head on over and vote for what you want to do next!", "group_id": 2515, "id": 2009370}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773478.3083529, "message": "HipChat is more for general discussion, more conversational interactions. It's perfect for the storyforming analysis.", "group_id": 2515, "id": 2009358}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773573.7564609, "message": "As always I would keep the conversation laser focused on the Dramatica theory and its application towards the creation and analysis of story.", "group_id": 2515, "id": 2009361}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314773663.483793, "message": "The speed comes with a price, which I am happy to pay. Somewhere down the road I may setup a donation page, but it shouldn't be an issue until the user base grows to a larger number.", "group_id": 2515, "id": 2009367}, {"user_id": 38500, "stars": [], "topic_id": 44706, "date_created": 1314790296.978905, "message": "Going to http://dramatica.hipchat.com redirects me to the sign up page and wants me to create a new company. There it says that if your \"company\" already has an account, the admin has to set up an account for you.", "group_id": 2515, "id": 2010296}, {"user_id": 7712, "stars": [], "topic_id": 44706, "date_created": 1314793427.619468, "message": "@PhillyJeff @jimhull I get the same. Searched for \"general\" and \"discussion\" and nothing came up.", "group_id": 2515, "id": 2010522}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314797968.330327, "message": "Ahhh - my mistake - here's the link to the public room - http://www.hipchat.com/gqRbNWfpw", "group_id": 2515, "id": 2011081}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314797551.4966469, "message": "Just pm me your email and I'll send you the link", "group_id": 2515, "id": 2011034}, {"user_id": 7712, "stars": [], "topic_id": 44706, "date_created": 1314803211.9811101, "message": "@jimhull  I don't like it. The interface is friendly and intuitive, but if I log out and then log back in, I get no history of the chat so I can't catch-up with what's been discussed so far.", "group_id": 2515, "id": 2011660}, {"user_id": 33839, "stars": [], "topic_id": 44706, "date_created": 1314808064.211221, "message": "Appears to be working fine for me.  I threw this out there on another thread a week or so back, but would it be possible in this new format to have a room for people to analyze each other's scripts/stories via dramatica?  I had one other member send me a message here interested in something like that.  It seems like it would be the perfect forum, especially with being able to send files - but I'm conscientious that this is your dealio and that might ultimately not fit into your intent.", "group_id": 2515, "id": 2012387}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314808147.3312459, "message": "Hmmm...kinda like a Writer's Group type room? Not a bad idea.", "group_id": 2515, "id": 2012391}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314805893.4951701, "message": "thats because you're a guest - once you become a member you have full access to all chat history", "group_id": 2515, "id": 2012103}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314808164.0253379, "message": "But hey - why the heck are we talking about this here!!", "group_id": 2515, "id": 2012392}, {"user_id": 38500, "stars": [], "topic_id": 44706, "date_created": 1314816339.4161489, "message": "I'm afraid I don't understand how hipchat replaces a forum-based board like this... the thing I like about this format is that I can read what's interesting and not read what doesn't interest me. And if I want to introduce a new topic on hipchat, how do I do it without everyone talking over each other?", "group_id": 2515, "id": 2013526}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314831886.419802, "message": "Throw a topic out there if people are interested in talking about it, change the topic and chat. You'll notice that with the advent of DQ the amount of threads here has died down. Just need a couple different rooms to separate it out in a general sense.", "group_id": 2515, "id": 2015352}, {"user_id": 38500, "stars": [], "topic_id": 44706, "date_created": 1314833347.531009, "message": "Well, doesn't that assume I can sit there for hours at a time waiting to see if anyone wants to talk about it? What I like about this is that I can ask my question in the morning and check back in after work and see who answered. Maybe I'm just misunderstanding the intention.", "group_id": 2515, "id": 2015476}, {"user_id": 38500, "stars": [], "topic_id": 44706, "date_created": 1314834433.4756341, "message": "I understand that convore is unacceptably slow, but there plenty of options out there, like I one I suggest last week, that offers forums and chat and a number of other features all under one URL.", "group_id": 2515, "id": 2015623}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314835067.5221541, "message": "It's pretty simple. If you have a question ask it on DQ. If you want to chat go to the HipChat. If these don't satisfy your needs you can make your own. Don't forget there are the official forums as well. I'm just doing what I think is best to grow the community.", "group_id": 2515, "id": 2015720}, {"user_id": 36525, "stars": [], "topic_id": 44706, "date_created": 1314835797.0824969, "message": "I have to agree that a chat-like software doesn't seem suited to much discussion and workshopping, although I like the dramatica queries group.  Anyway I made a forum, it is a phpbb3 forum which is as close as the internet has to standard.  It's here http://fictiontheory.forumotion.com/  If people like it, you all are welcome to start discussing anything you want.  If people don't like it, that's fine too, I just thought it might be helpful.", "group_id": 2515, "id": 2015878}, {"user_id": 38500, "stars": [], "topic_id": 44706, "date_created": 1314844180.1802051, "message": "Well, frankly, you have defined such a strict protocol for how the DQ website is to work that I feel intimidated by it, and have already regretting posting there. We are creative people, and we're grown ups, and I would like a place where I can ask stupid questions or ill-formed without fear of being flamed. \n\nAnyway, I think I'm done with all this. I'll just stick to the old Dramatica forum.", "group_id": 2515, "id": 2016980}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1314847385.670959, "message": "You asked a subjective question that could only be answered by opinion. I gave you the chance to edit it, you decided to delete it. You weren't flamed. A grown-up would understand this. You're right to stick with the official Dramatica forums. This site, the DQ site and the HipChat site were made to augment it, not replace it.", "group_id": 2515, "id": 2017309}, {"user_id": 39675, "stars": [], "topic_id": 44706, "date_created": 1314935976.6313829, "message": "So, is there a different site we are supposed to be going to?  Has it been settled where we are moving on to, yet?  This one was not too slow for me, btw, but I am new to these kinds of sites.", "group_id": 2515, "id": 2026461}, {"user_id": 7664, "stars": [], "topic_id": 44706, "date_created": 1315002030.4043069, "message": "This site was incredibly slow for me and crashed many times. I'm actually amazed you never encountered those bugs.", "group_id": 2515, "id": 2032780}, {"user_id": 39675, "stars": [], "topic_id": 44706, "date_created": 1315023971.5154181, "message": "I'm using a Mac, if that means anything.  It never crashed, once.  It took a little time to move from this page to the experimental, though, maybe 30 seconds.", "group_id": 2515, "id": 2034681}, {"user_id": 36437, "stars": [], "topic_id": 44706, "date_created": 1315033153.896059, "message": "I'm on a mac, too, but yeah... strange. Convore was always eating my posts and timing out or giving me error pages. Maybe that was dependent on traffic or something.", "group_id": 2515, "id": 2035279}, {"user_id": 39675, "stars": [], "topic_id": 44706, "date_created": 1315033970.6063249, "message": "I did get the kitty in the green glasses a few times, and I did lose a few posts.  For some reason, since I've started to select, copy and paste into a Word doc the posts I do not want to rewrite from the soul, I haven't lost any.  After hearing that two of the convore creators jumped ship, I assumed there was a maximum of bandwidth? allowed the site, and sometimes it just overflowed with chats.  I am happy copying my posts to repost if any are lost.  It is not a big deal.", "group_id": 2515, "id": 2035323}, {"user_id": 39675, "stars": [], "topic_id": 44706, "date_created": 1315073016.132369, "message": "@Bee   OK, I bet I know what is going on.  I just started with these forums.  When there are many members logged on, reading and posting, we are all scrambling for a limited amount of allotted usage energy.  I think Jim brought that point up, but I did not relate to it at the time.", "group_id": 2515, "id": 2038094}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1316900884.2519829, "message": "Yeah, with Search opening it up over there I'm finding it a great place to find new and interesting voices.", "group_id": 2515, "id": 2205716}, {"user_id": 37586, "stars": [], "topic_id": 44706, "date_created": 1316888161.219316, "message": "@jimhull Have you checked out Google Groups.  There is a Dramatica Theory group.  Could it be better than Convore?", "group_id": 2515, "id": 2204616}, {"user_id": 7645, "stars": [], "topic_id": 44706, "date_created": 1316891222.5250909, "message": "There are only 2 members and it is restricted. I don't think a walled community is good for the conversation. HipChat is like that. I think we're gonna try the next storyform analysis on Google Plus. I'll post the link if that happens.", "group_id": 2515, "id": 2204855}, {"user_id": 7712, "stars": [], "topic_id": 44706, "date_created": 1316892929.9982779, "message": "I like the idea of Google+. That will help create a greater sense of community, too.", "group_id": 2515, "id": 2205013}]