[{"user_id": 11626, "stars": [], "topic_id": 7418, "date_created": 1298089152.793092, "message": "http://theeconomiccollapseblog.com/wp-content/uploads/2011/02/Wisconsin-Teacher-Protest-by-CindyH-Photography-250x166.jpg\r\n\r\nhttp://www.youtube.com/watch?v=0XlUsoM4ruQ\r\n\r\nhttp://theeconomiccollapseblog.com/wp-content/uploads/2011/02/Chart-Federal-Net-Outlays1.png\r\n\r\nHave you seen video of the teacher protests that are going on in Wisconsin?  We haven't seen anything like this in America in quite some time.  If you haven't seen video of the protests yet, some very good raw footage is posted below.  On the one hand it is good to see Americans coming together and standing up for what they believe in, but on the other hand what these teachers are freaking out about shows just how much America has changed.  These teachers are not protesting for liberty, freedom or to change the government.  Rather, they are protesting because they want things to remain the same.  They simply don't want anyone to mess with their pay.  Well, the truth is that none of us ever wants to experience a pay cut.  It is not a lot of fun.  But sadly, states like Wisconsin are so broke that they have to find cuts somewhere.  Someone is going to have to make a sacrifice.  The teachers in Wisconsin just want to make sure that it is not them.\r\n\r\nIn the United States today, state and local governments are facing unprecedented budget crunches.  Tax revenues are way down and expenses are way up.  State and local government debt has reached at an all-time high of 22 percent of U.S. GDP, and many state and local governments are teetering on the brink of insolvency.\r\n\r\nStates like Wisconsin have to do something or else they will collapse financially.  Wisconsin is facing a $3.6 billion budget deficit (which for that state is huge), and Wisconsin Governor Scott Walker and the Republicans in the legislature are attempting to make some tough cuts.\r\n\r\nIn particular, they want public employees to pay a little more towards their health care premiums and pension programs.  In fact, what the Republicans are proposing would still leave Wisconsin public employees contributing far less to health care and pensions than their private sector counterparts.\r\n\r\nU.S. Representative Paul Ryan recently appeared on MSNBC's \"Morning Joe\" program and described what Governor Scott Walker is asking the teachers to do....\r\n\r\n    Scott and I are very close friends. We e-mail each other quite a bit... He's basically saying that state workers which have extremely generous benefits packages relative to their private sector counterparts, they contribute next to nothing to their pensions, very, very little in their health care packages.\r\n\r\n    He's asking that they contribute about 12 percent for their health care premiums, which is about half of the private sector average, and about 5.6 percent to their pensions. It's not asking a lot. It's still about half of what private sector pensions do and health care packages do.\r\n\r\n    So he's basically saying \"I want you public workers half of what your private sector counterparts do\" and he's getting riots. It's like Cairo has moved to Madison these days.\r\n\r\nThese proposed changes have caused a massive uproar in Wisconsin.  Just check out the following raw video footage from the last few days....\r\n\r\nBut this is what we have come to as a nation.  Almost everyone agrees that reducing government debt is a good thing \"in theory\", but whenever anyone starts to put forward some specific proposals to cut government spending it makes those that will be affected by the cuts extremely upset.\r\n\r\nJust look at what is happening with the federal government.  Republicans and Democrats are both frothing at the mouth over extremely small budget cuts that have been proposed.  Virtually none of our national politicians are even willing to discuss budget cuts that would actually make a serious dent in our budget deficits.\r\n\r\nBut we have got to do something.  Spending by the U.S. government is spinning wildly out of control.  Back in 1970, the U.S. government only spent about 200 billion dollars for the whole year.  Well, this year the federal government is going to spend somewhere around 3.6 trillion dollars, and Barack Obama's newest budget proposal calls for U.S. government spending to increase to 5.6 trillion dollars by the year 2021.  If the government continues to spend money at such a rapid pace it is going to completely wipe out our entire economic system....\r\n\r\nBut it is not just the U.S. government that is spending like a drunken sailor.  Most of our state governments are complete financial disaster zones at this point as well.\r\n\r\nAs I have written about previously, the state of Illinois is such a financial disaster zone that it is hard to even describe.  According to 60 Minutes,  the state of Illinois is six months behind on their bill payments.  60 Minutes correspondent Steve Croft asked Illinois state Comptroller Dan Hynes how many people and organizations are waiting to be paid by the state, and this is how Hynes responded....\r\n\r\n    \"It's fair to say that there are tens of thousands if not hundreds of thousands of people waiting to be paid by the state.\"\r\n\r\nSomething has got to be done about our national addiction to debt.\r\n\r\nGovernment spending has to be dramatically cut.  All of us are going to have to make sacrifices.  We simply cannot continue to spend far, far, far more than we bring in.\r\n\r\nBut we are Americans - we do not like to make sacrifices.\r\n\r\nOur founding fathers warned us about this.  They warned that when the American people figured out that they could vote themselves money out of the U.S. Treasury it would greatly endanger our republic.\r\n\r\nUnfortunately that is exactly what is happening today.  The vast majority of government spending on both the national and state levels consists of direct payments to individuals of one sort or another.\r\n\r\nThe American people have become addicted to the bread crumbs that they receive from the hand of their master.\r\n\r\nThis is not what our republic was supposed to look like.\r\n\r\nAs the U.S. economy continues to decline, we are going to see a lot more riots like we have seen in Wisconsin.  Once the American people realize that the \"good times\" are over, all hell is going to break loose.\r\n\r\nAlready the anger and the frustration of the American people is starting to boil over.  Unfortunately, that anger and frustration is focused in 1000 different directions.  The ruling elite and the establishment media are constantly encouraging us to hate one another.  I recently wrote about this phenomenon in an article on another website....\r\n\r\n    The truth is that the \"establishment\" is constantly trying to divide us and get us fighting with one another. They pit the Republicans against the Democrats (even as though control both sides). They pit one race against another. They pit one gender against another. We are told that the rich are against the poor, the north is against the south, urban is against rural and that there are even \"generational battles\" going on. Frustration and hate are rapidly growing in the United States today, and a lot of that frustration and hate is unfortunately aimed at the targets that the mainstream media has programmed all of us to hate. Meanwhile, those at the top of the pyramid who are controlling the whole game love it when we are divided because we can never become united and challenge their control.\r\n\r\nUnfortunately, America is more divided today than ever.  Our extreme affluence has kept the thin veneer of civilization that we all take for granted from disappearing so far, but once our affluence is gone all of the hate and frustration in society is going to come bubbling to the surface and it is going to be horrifying to behold.\r\n\r\nOnce the economic collapse happens, most Americans are not going to take it sitting down.  Most Americans are going to want someone to blame.  Most Americans are going to want to lash out somehow.\r\n\r\nAmerica today is like a big, fat spoiled baby that is about to have its favorite pacifier permanently taken away.  America is going to whine and cry and complain like there is no tomorrow.\r\n\r\nFor decades the financial \"gloom and doomers\" have been warning about what would happen to this country if we didn't get our house in order, but nobody wanted to listen.  Everyone just kept piling up more debt as if it would never be a problem.\r\n\r\nWell, now our entire country is covered in red ink.  Large numbers of state and local governments across the country are on the verge of defaulting on their debts, and they are hoping that the federal government will bail them out.  The federal government has already accumulated the biggest pile of debt the world has ever seen and continues to behave as if we can just keep borrowing and spending massive amounts of money forever.\r\n\r\nThere is no way out of this nightmare under the current system.  Taxing people more is not going to solve our problems.  Taxing people less is not going to solve our problems.\r\n\r\nWe have gotten to the point where it is inevitable that the debt bubble that we have created is going to burst.  Our politicians can try to delay it for a while, but in the end the whole house of cards is going to come crashing down.\r\n\r\nWhen the U.S. economy does totally collapse, it is going to make the riots that we have seen in Egypt and throughout the Middle East this year seem tame by comparison.\r\n\r\nWhat we are witnessing right now in Wisconsin are just the \"birth pains\".  The American people don't want to \"tighten their belts\".  In fact, most Americans have absolutely no idea what \"hard times\" would even look like.  When things go from bad to worse we are going to see temper tantrums in this country like we have never seen before.\r\n\r\nSo get ready.  Unless there is some kind of dramatic transformation in this country, in the years ahead we are going to see some horrific economic riots.\r\n\r\nIt would be nice if we had a brighter future to look forward to, but we don't do ourselves any favors by living in denial.\r\n\r\nSo what do you all think about what has been going on in Wisconsin?  Do you all believe that we could see huge economic riots inside America in the years ahead?  Feel free to leave a comment with your opinion below....\r\n\r\nhttp://theeconomiccollapseblog.com/archives/do-the-wild-teacher-protests-in-wisconsin-foreshadow-the-economic-riots-that-are-coming-soon-to-america", "group_id": 3920, "id": 148841}]