[{"user_id": 36437, "stars": [], "topic_id": 44677, "date_created": 1314722683.9283619, "message": "bored and curious. title says it all... how did you come across dramatica, and how long ago?", "group_id": 2515, "id": 2004732}, {"user_id": 36437, "stars": [], "topic_id": 44677, "date_created": 1314723533.0607879, "message": "I found Dramatica at least six years ago, tried the demo and was intrigued, but didn't take myself seriously as a writer, so could never justify the price. Finally bought it a year ago and still have a a long way to go, but I'm finally \"getting it\" (or starting to, anyway).", "group_id": 2515, "id": 2004837}, {"user_id": 39675, "stars": [], "topic_id": 44677, "date_created": 1314724779.755285, "message": "I had just bought a Mac Quadra610 and was leafing through a MacMall magazine, when my eyes landed on a colorful design.  It was a square with the most interesting combination.  I must have looked at it for about ten minutes, tracing its intricate patterns and joyful word Dramatica with my eyes, fascinated.  I finally looked at the words of the advertisement and \"writing partner\" jumped out at me.  I had just been dumped by my critique group for giving too negative feedback, and was at an all-time writer's ego low.  I didn't understand what the software program really did, but it sounded like they were helping writers to write alone.  I got the Pro (didn't understand it), got the DreamKit (didn't understand it), got the theory book (couldn't stop reading it), got the free airline tickets (went to the Burbank workshop), and it all came together.  I found out that learning the Dramatica theory is a cumulative experience, like learning an actor's script.  Applying it is like an artist's craft, especially painting.  I went full circle from fascination to application.", "group_id": 2515, "id": 2004963}, {"user_id": 7645, "stars": [], "topic_id": 44677, "date_created": 1314723314.367547, "message": "1995 - AOL Chat Logs - the idea of Main Character Growth Stop and Start. Something about it just _felt_ right. 15 years later that feeling is still there.", "group_id": 2515, "id": 2004809}, {"user_id": 7712, "stars": [], "topic_id": 44677, "date_created": 1314724482.814326, "message": "2005. Started and stopped using it on a predictable basis until about this time last year when I had a breakthrough and everything I was struggling to understand simply clicked into place. Mike & Jim (along with Chris, of course) have been instrumental in helping me gain an even greater understanding of the software and theory.", "group_id": 2515, "id": 2004927}, {"user_id": 36525, "stars": [], "topic_id": 44677, "date_created": 1314726380.5265751, "message": "When I was in college, might have been 2001 or 2002, I got heavily interested in theories of the structure and function of fiction.  This was partly because I've always been awful at plotting and wanted to know what other people thought about what plot is and how it should be structured and why.  I decided I was going to read all the how-to-write theory I could get my hands on, from Aristotle to the present.  Web-searching turned up the existence of Dramatica Pro, so I grabbed the free trial and started reading the online version of the theory book.  After a few months of playing with it I was still not able to make it work for me, so I uninstalled it, but the theory was in my head permanently.\n\nA few years later, after I was out of school, there was a week where I was bored and frustrated with my attempts to write.  So I picked up Dramatica again to see if this time I could have a new perspective and a better understanding of it.  This time I found the listserv, so I could actually ask questions, and ended up buying a copy of the software.  Still never managed to make the software really work for me, but the process of trying to figure out how to make my story ideas and the theory ideas built into the software work together led me to learn a lot about both what I wanted to write and writing theory within the world of Dramatica and outside it.\n\nI think I put Dramatica away for another year or two before I came back to it; that was around when Armando's book came out, so that was quite an interesting read, and it popped up theory topics on the mailing list that I hadn't encountered before, like PRCO.  I decided that I understood the theory as much as possible, had identified one or two areas I disagreed with but overall I liked it.  The problem was the software.  It was such a great idea to have software to help a writer design a book, why could I never get it to work more than about 75% for me?  The only way to find out would be to reverse engineer the troublesome parts of the thing.  So I did.  That's private data, so I haven't released it and won't.  But it crystallized for me what I think is wrong with the software and a few points of the theory.\n\nThat brings us to this year.  I felt I was ready to help the theory and software take the next evolutionary step.  But, no one here seemed to agree with my assessment of the problems with Dramatica or my initial suggestions about what would be the right direction to go to start solving these problems.  That left me in a position of wondering whether to bother trying to follow this path by myself (as a theorist, it's quite difficult to asses your theories if you don't have an audience to comment on their functionality), or whether I should be deciding that regardless of how cool parts of Dramatica have always seemed to me, I should set it aside permanently and delete it off my computer.", "group_id": 2515, "id": 2005141}, {"user_id": 13109, "stars": [], "topic_id": 44677, "date_created": 1314726152.1672511, "message": "2010 - was googling \"meaningful story structure\" which took me to Jim's site -  storyfanatic.com.  Spent multiple weekends, jaw on ground, devouring every article.  Started looking into Dramatica from there.  What a journey....", "group_id": 2515, "id": 2005116}, {"user_id": 7664, "stars": [], "topic_id": 44677, "date_created": 1314735077.5839009, "message": "I  found it in late 2009, when I was grousing about the shortcomings of The Hero's Journey.  (I'd heard about it 1996, when someone was talking about \"how many stories exist?\" -- The answers people were talking about where 1, 12, 20... and then someone threw out 32,768.) I was googling around, trying to find a solution to my gripes, when I found a reference to Dramatica. Within a few days, I'd found read the theory book, found Jim's site. It was exactly what I had been looking for, and more, and it has stumped me ever since.", "group_id": 2515, "id": 2006102}, {"user_id": 33839, "stars": [], "topic_id": 44677, "date_created": 1314748774.6462779, "message": "First came across it maybe 7 or 8 years ago.  I remember downloading the demo and thinking \"wow, this is pretty deep...\".  Perhaps too deep for the moment.  I think it was the notion of playing around with it without exactly knowing the theory - I didn't read the book at the time, but it just seemed like an awful lot to interpret.  \n\nBut, the quest for knowledge finally brought me back after going through just about everything else under the sun (the first book I bought was Lew Hunter's Screenwriting 101 way back in '96 when I wrote a script as an independent study for my film professor who has put together a number of books on the screenplays of Preston Sturges).  \n\nHunter grew into Fields who brought me to Segar to McKee to Truby to Hauge to Vogler... finally coming across Jim's Story Fanatic last year, I think the article re: separating the main character from the protagonist.  That's when I said \"Hallelujah, praise the lord someone else thinks like me!!!\".  \n\nStill haven't gotten the software yet, though.  Being unemployed long-term put a serious dent in my lifestyle, but hey... all this time to read and learn!", "group_id": 2515, "id": 2007526}]