[{"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309934948.025497, "message": "Ok... so how do we resolve this God working and sending out evil spirits? I know there are other versus where God is responsible for evil and good but what was explained to me is that it was natural evil, like tornadoes, storms etc.", "group_id": 9787, "id": 1573714}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309935300.62587, "message": "Writers perception - this is one of my main motivations to always understand scripture in context. As the understanding of God developed through scripture we see less and less evil attributed to God. We see a development of understanding of Satan and the freedom that God has given him to act on earth. But in these early writings, this was their understanding. \n\nWe make a big mistake when we try to pull meaning from individual verses and passages. It's a common tactic by argumentative nay-sayers, but is an incorrect method of understanding God from scripture. You MUST consider the whole.\n\nIt's sad that so few of us (myself included) have actually read the whole bible through in order to get the proper understanding of the bigger picture. I still rely very heavily on people who have done this to present the big picture to me, but I should do it myself!", "group_id": 9787, "id": 1573747}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309934946.294059, "message": "ja...remember that Hebrew understanding of God and how nothing happens without God making/causing/allowing it happen....good example.", "group_id": 9787, "id": 1573713}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309935069.7520671, "message": "@pevans_om Ok. So when someone comes to me to show me how evil God is I my answer is... \"That is how Hebrew people understand God.\" @LintonCaldecott also mentioned to me the issues with Satan and God with Job.\n\nThat though does not seem as much as God sending purposefully to revenge.", "group_id": 9787, "id": 1573721}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309934869.1828511, "message": "Judges 9:\n22  Now Abimelech ruled over Israel three years.23  Then God sent an evil spirit between Abimelech and the men of Shechem; and the men of Shechem dealt treacherously with Abimelech,24  so that the violence done to the seventy sons of Jerubbaal might come, and their blood might be laid on Abimelech their brother, who killed them, and on the men of Shechem, who strengthened his hands to kill his brothers.", "group_id": 9787, "id": 1573700}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309935283.7946129, "message": "@pevans_om The other issue with \"the Hebrew understanding\" is what about the Spirit being involved in writing the Bible?", "group_id": 9787, "id": 1573745}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309935599.3589139, "message": "@penkin Yes, that would be my way to explain it.\n\nProblem is, we have created this aura around scripture that it is perfect, like Muslims do with the Quran. And that means that people struggle to accept this type of explanation.", "group_id": 9787, "id": 1573767}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309935465.6440251, "message": "@pevans_om Ok, not 100% sure how to answer this objection then? Do we say... \"You need to understand the Bible in full. It was understood that God sent out evil spirits but in actual fact He does not. It was a misunderstanding by the writers at the time.\"", "group_id": 9787, "id": 1573757}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309935517.403249, "message": "@penkin On the Spirit involvement: Every theologian I know will point out that the bible displays a growing understanding of God and His plan for salvation. This doesn't negate the work of the Spirit. It just means that the Spirit revealed things gradually over time.\n\nExample: Check the understanding of Jesus as God as presented by the Gospels. You will see that it moved from \"Man and great teacher\" (Mark), to Man with Holy Spirit (matthew), to God (John). This progression shows how the disciples grappled with understanding Jesus over time and progressively came to understand that He was in fact God.", "group_id": 9787, "id": 1573760}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309938829.480279, "message": "@pevans_om Is scripture imperfect? Or what do you mean by that. The way I have heard it is \"The original is perfect which no one has.\" :)\n\nOn that note, when talking to a Muslim who believes the Quran is perfect do we say that ours is not but it can be trusted?", "group_id": 9787, "id": 1573933}, {"user_id": 32888, "stars": [], "topic_id": 41255, "date_created": 1309938884.262161, "message": "The bible might be perfect still... just not in the way we expect it to be. The perfection is there, but a single verse/chapter/book is insufficient to convey the perfection of the whole, and even the book is insufficient in conveying the perfection of the one it speaks about. Which is a stupid way of saying context is important and everything must be understood in conjunction with the whole.\n\n@penkin your summary of what @pevans_om said fits with what i suggested last night... My analogy was you opening the gate to let the dog out, perhaps your intention was not that the dog attack someone in the street, but you are held responsible by the witnesses. Only we need to add to that the omniscience of God. He allows can be seen as similar to he sends... at least in the growing understanding of the authors... \n\nIf we claim spiritual authorship of scripture, and we agree that the bible is a book of the redemptive works of God, then we have to consider that as God built up his redemptive example, he also built up some form of an understanding of his methods. This growing understanding is displayed in the gospels as @pevans_om said, and is shown in the old testament, only the process is slower since it's a much longer period that we have to work with.", "group_id": 9787, "id": 1573937}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309938887.28509, "message": "@pevans_om And back on topic, is God not responsible for evil spirits being sent out to revenge people then. This was a misunderstanding?", "group_id": 9787, "id": 1573939}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309940365.6924469, "message": "@penkin It firmly depends on your view of God's Will\n\nSince He is all powerful and everywhere and created everything and controls everything it therefore can be postulated that everything that happens is caused by God. As summed up in Job \"God gives. God takes away.\"\n\nWhether this is done by God actually calling an evil Spirit and giving orders to do something, or by God merely allowing an evil spirit freedom to do what it would otherwise not be allowed to do (as in Job), how can we know?\n\nI DO know this. That as you read through scripture the nature of God appears to change. But God doesn't change. So it's the perception of the authors that is changing.\n\nJesus clearly delineates evil spirits as being something against God. He also indicates that it would be counterproductive for good and evil to be from the same source:\n\n\"But when the Pharisees heard it, they said,(AC) \"It is only by Beelzebul, the prince of demons, that this man casts out demons.\" 25(AD) Knowing their thoughts,(AE) he said to them, \"Every kingdom divided against itself is laid waste, and no city or house divided against itself will stand. 26And if Satan casts out Satan, he is divided against himself. How then will his kingdom stand? 27And if I cast out demons by Beelzebul,(AF) by whom do(AG) your sons cast them out? Therefore they will be your judges. 28But if it is(AH) by the Spirit of God that I cast out demons, then(AI) the kingdom of God has come upon you. 29Or(AJ) how can someone enter a strong man’s house and plunder his goods, unless he first binds the strong man? Then indeed(AK) he may plunder his house. 30(AL) Whoever is not with me is against me, and whoever does not gather with me scatters.\"\n\nSo...Does God send (command) demons to cause bad things? No, I don't believe so.\nDoes God 'step back' and allow demons and evil spirits to cause mischief to further His plan for salvation and to demonstrate His glory? Absolutely", "group_id": 9787, "id": 1573990}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309955942.386447, "message": "@pevans_om Ok. That is how I thought as well. What struck me in these versus is the language seems to suggest He actively sent and not just stepped back as in Job. I get what you're saying though. Not sure it's settled for me yet though :)", "group_id": 9787, "id": 1575105}, {"user_id": 13817, "stars": [], "topic_id": 41255, "date_created": 1309959250.2864549, "message": "@pevans_om :) mine is non-existent.", "group_id": 9787, "id": 1575422}, {"user_id": 32900, "stars": [], "topic_id": 41255, "date_created": 1309958425.6802959, "message": "@penkin The English does. I'm not sure the Hebrew does, but my Hebrew is shaky.", "group_id": 9787, "id": 1575318}]