[{"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305800372.6931951, "message": "I am an HTML/CSS developer who is diving into professional JavaScript deeper and deeper, and while reading books and various blog posts about JS development I am seeing certain terms such as \"first-class\" functions and \"functional\" programming refering to JS and programming styles that are appropriate for client-side development. Like many others, I haven't studied CS and I probably lack knowledge of many important terms. However, while working with various server-side languages (Ruby, Python) I have gathered quite some understanding on OOP and so JS implementation of OOP (abstraction, inheritance, polymorphism etc.) is clear enough for me. I am also aware of \"procedural\" style of programming which is what (if I understand it right) most of the \"jQuery\" developers do (no offense to people who love jQuery, I'm aware of that you can write professional code with it, I am just giving a broad reference to copy-paste developers) and which is what I've been mostly doing up until I've started to learn JavaScript in a more serious fashion.", "group_id": 160, "id": 1110121}, {"user_id": 1516, "stars": [{"date_created": 1305818820.4214511, "user_id": 26065}, {"date_created": 1306737698.9365461, "user_id": 16058}], "topic_id": 35932, "date_created": 1305801299.843365, "message": "the idea behind functional programming is that you avoid mutable state (modifying variables etc.) but rather emphasize application of functions", "group_id": 160, "id": 1110185}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305801616.0863309, "message": "So you can kind of mix OOP with functional programming?", "group_id": 160, "id": 1110199}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305801791.522655, "message": "thanks a lot, this comparison between imperative and functional makes things more clear for me.", "group_id": 160, "id": 1110213}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305800634.979018, "message": "I've seen \"underscore.js\" and I'd like to ask what this \"t that provides a lot of the functional programming support that you would expect in Prototype.js (or Ruby)\" mean? What is \"functional programming\"?", "group_id": 160, "id": 1110148}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305800564.2352841, "message": "While I've read wikipedia entries on \"functional programming\" and \"first-class functions\", I am not quite sure that I understand what functional programming really is. It is easy for me to refer to procedural programming (just a bunch of functions in a global namespace or within a closure perhaps) as to \"functional\" since you work with many functions and call them when they are needed, but I know that it's wrong.", "group_id": 160, "id": 1110139}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801363.513598, "message": "functional: c.select(function(val) { return val > 5 })", "group_id": 160, "id": 1110187}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801686.9107051, "message": "functional programming is often declarative : \"I only want values that's larger than 5\", while imperative programming describes what you do: \"Loop through the array and save values that's larger than 5 in another array\"", "group_id": 160, "id": 1110207}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305801371.2674949, "message": "but isn't that just \"javascript\" :-) I mean, I've been doing it (passing as attribute and returning functions from and to functions) ever since I've started working with this language. So the definition is just a description of the language’s capability?", "group_id": 160, "id": 1110188}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801477.9042881, "message": "\"description of the language’s capability\"? kinda, but not exactly. it's a style of programming. certain languages makes it easier (or harder) to do functional programming.", "group_id": 160, "id": 1110197}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801738.0782001, "message": "in fact, you can implement OOP with closures :)", "group_id": 160, "id": 1110212}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801191.4466009, "message": "in functional programming you can pass functions as arguments to other functions", "group_id": 160, "id": 1110181}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801342.7870591, "message": "imperative: a = []; for(b in c) { if (c[b] > 5) a.push(c[b]) }", "group_id": 160, "id": 1110186}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305801391.770942, "message": "aha, example helps!", "group_id": 160, "id": 1110190}, {"user_id": 1101, "stars": [], "topic_id": 35932, "date_created": 1305801664.895592, "message": "Like, you have your code \"structured\" with classes and objects, but your logic implemented in functional style, right?", "group_id": 160, "id": 1110205}, {"user_id": 1516, "stars": [], "topic_id": 35932, "date_created": 1305801723.7829781, "message": "yeah, functional programming can be mixed with OOP", "group_id": 160, "id": 1110210}, {"user_id": 8282, "stars": [], "topic_id": 35932, "date_created": 1306463441.880765, "message": "I have a micro library for fp, you may want to take a look; http://functools.kodfabrik.com", "group_id": 160, "id": 1199181}]