[{"user_id": 2458, "stars": [], "topic_id": 7830, "date_created": 1298295437.763159, "message": "I'm a big fan of WebOS and love the original Pre. It looks like new webOS devices probably won't be coming to Sprint, and if they do it won't be for awhile. My contract renews in May and I'll be due for new phones (myself and my girlfriend). I'd prefer to stay with Sprint, because they're about the cheapest for my needs - although TMobile might be slightly cheaper. What would be good phones to upgrade to? If not WebOS, prefer an Android phone.", "group_id": 97, "id": 158634}, {"user_id": 4689, "stars": [{"date_created": 1298297119.5553451, "user_id": 14088}], "topic_id": 7830, "date_created": 1298297088.4892299, "message": "The HD2 from T-Mobile will let you duel boot windows phone 7 and android", "group_id": 97, "id": 158753}, {"user_id": 14088, "stars": [], "topic_id": 7830, "date_created": 1298297017.1974039, "message": "Android Phone.. experia or any phone from HTC", "group_id": 97, "id": 158749}, {"user_id": 8936, "stars": [], "topic_id": 7830, "date_created": 1298303243.8584559, "message": "If you're going to go Android, you should stick with the ur-Google phone, currently the Nexus S. Anything else and you're gambling that the manufacturer and carrier will continue to upgrade for you.", "group_id": 97, "id": 159476}, {"user_id": 13467, "stars": [], "topic_id": 7830, "date_created": 1298305795.559953, "message": "No Nexus S on Sprint, as far as I know.", "group_id": 97, "id": 159603}, {"user_id": 13467, "stars": [], "topic_id": 7830, "date_created": 1298305879.7085011, "message": "Personally, coming from a launch-day Pre, I've been pretty happy with my Samsung Epic 4G, but it's been waiting on a Froyo upgrade since I got it. They also have the HTC Evo, which I kind of wish I'd gotten instead. Not sure what top-end Android phones are next in line for Sprint, though.", "group_id": 97, "id": 159609}, {"user_id": 14423, "stars": [], "topic_id": 7830, "date_created": 1298307207.1188829, "message": "Evo hands down. The Epic has a better screen and hardware keyboard but they've yet to upgrade it to the last version of Android (froyo), while the Evo is about to upgrade to the newest version (gingerbread). If you're at all into modding/hacking your phone the Evo has great hacker community support... check out the XDA forums.", "group_id": 97, "id": 159801}, {"user_id": 14423, "stars": [], "topic_id": 7830, "date_created": 1298307305.5326071, "message": "Honestly if it were me? I'd wait until May-June for either a dual core Android set or the new Palm 3. Neither are confirmed for Sprint but I'm expecting both. If you're a webOS fan the Palm 3 should really please you from what I've seen so far.", "group_id": 97, "id": 159827}, {"user_id": 2458, "stars": [], "topic_id": 7830, "date_created": 1298307961.3361809, "message": "Sprint has pretty much confirmed they don't have any plans for new WebOS devices. Hopefully that will change by May, but I don't want to hold out forever hoping for the Palm 3 (or even Palm 2)", "group_id": 97, "id": 159987}, {"user_id": 2458, "stars": [{"date_created": 1298314266.861634, "user_id": 7081}], "topic_id": 7830, "date_created": 1298308022.601712, "message": "The Evo was what I had in mind, but even it is nearing a year old now (I think). I'm not super uptight about having the latest and greatest technology, but I want something that will be supported and relatively modern until my next upgrade.", "group_id": 97, "id": 160011}, {"user_id": 12346, "stars": [], "topic_id": 7830, "date_created": 1298310823.658694, "message": "Just wait for May-June. Thats the best timeto buy a phone. Maybe, if you lkike WebOS, there will be an iPhone on Sprint(iPhone and WebOS are kinda similar), but the evo and evo shift are also nice.", "group_id": 97, "id": 160266}, {"user_id": 13467, "stars": [], "topic_id": 7830, "date_created": 1298337024.6938021, "message": "Also: Are you in Sprint's \"Premier\" program? I get a discounted phone upgrade every year, rather than every 22 months, so I'll probably be cycling out this Epic sometime late this summer. http://premier.sprint.com/", "group_id": 97, "id": 176123}, {"user_id": 8936, "stars": [], "topic_id": 7830, "date_created": 1298344778.149323, "message": "The Premier program is getting changed to a tiered model. Silver and Gold, with the upgrade every year only available to Gold which equates to a 10-year customer history or be on a plan > $90/month for individual or > $170/month for a family plan. So if you're planning taking advantage of the Premier plan, do so before April 1 this year. http://www.phonescoop.com/news/item.php?n=7364", "group_id": 97, "id": 176763}, {"user_id": 2654, "stars": [], "topic_id": 7830, "date_created": 1298351551.74229, "message": "there is a nice galaxy s phone available on sprint", "group_id": 97, "id": 177197}, {"user_id": 13467, "stars": [], "topic_id": 7830, "date_created": 1298351849.083086, "message": "@zoidberg Other than the Epic 4G? (Which hasn't yet made it to Froyo?)", "group_id": 97, "id": 177209}]