[{"user_id": 11626, "stars": [], "topic_id": 42467, "date_created": 1311313038.184355, "message": "UN may switch blue helmets to green, then launch climate change peacekeeping wars\r\nNatural News\r\nJuly 21, 2011\r\n\r\nThe United Nations may soon announce that merely by changing the color of its soldiers’ helmets from blue to green, it can intervene in the business of sovereign nations under the guise of so-called “climate change peacekeeping.”\r\n\r\nAs you consider this, keep in mind that the current bombing of infrastructure in Libya is also brazenly called “peacekeeping.” In fact, there’s hardly a military campaign that’s been conducted in the last hundreds years that wasn’t sold to the public as a way to create “peace.” Now, the UN is on the verge of “waging peace” wearing green helmets instead of blue helmets. The invocation of all things “green,” it seems, provides justification for just about anything these days… including war.\r\n\r\nThis new “green” UN initiative is due for discussion in a special meeting of the United Nations security council, where the organization will decide whether to expand its “peacekeeping” role to cover everything that happens in a world suffering under climate change. An article in The Guardian explains that this plan involves “…a new environmental peacekeeping force — green helmets — which could step into conflicts caused by shrinking resources.” (http://www.guardian.co.uk/environment/2011/jul/20/un-climate-change-peacekeeping)\r\n\r\nJustification for UN troops on U.S. soil?\r\n\r\nThis would give the UN justification to place a “peacekeeping” force on U.S. soil, of course. Virtually the entire U.S. Southeast — from Texas all the way to D.C. — is currently sweltering under a severe heat wave combined with a hundred-year drought in many areas. Under the UN’s new “climate change peacekeeping” initiatives, if crop failures result in riots, they could drop in a few hundred thousand UN troops — all wearing GREEN helmets — and then explain they’re here to save us from “conflicts caused by shrinking resources.”\r\n\r\nBecause, you know, GREEN means it’s good for us, you see. Perhaps they’ll even paint the tips of their bullets green so that when they start firing into the crowds of innocent protestors, they can claim it’s not an act of war but rather “green kinetic action.” The streets may be red with blood, but the evening news will present it all to you as a new “green initiative” that’s good for the environment!\r\n\r\nThe Guardian goes on to report:\r\n\r\nIn an official “Concept Note” ahead of the meeting, Germany said the security council needed to draw up scenarios for dealing with the affects of extreme temperatures and rising seas. How would the UN deal with climate refugees?\r\n\r\nAs you can see from this quote, the UN feels that it must function as the police force of the world, intervening in the affairs of sovereign nations, and even painting their helmets green to make it all acceptable to the masses. If a foreign military force invades the United States of America and puts non-U.S. boots on the ground, that’s called a military invasion. But I guess if they paint their helmets green, it’s all okay, right?\r\n\r\nHopefully they’ll paint their helmets NEON green so they stand out much like the British Empire’s redcoat soldiers in 1776 who made easy targets.\r\n\r\nComing soon: Food supply disruptions leading to global riots\r\n\r\nOne thing the UN is getting right in all this, by the way, is the implied prediction that massive global crop failures are headed our way. Given the current depletion of food production resources (topsoil, fossil water supplies, etc.) a global food crisis is now inevitable. Food prices are already skyrocketing around the world, and the widespread use of GMOs is setting up our civilization for devastating food failures due to DNA contamination of food crops.\r\n\r\nFood disruptions will, of course, lead to food riots. And food riots could get pretty ugly in high population areas (cities, namely) where the people import nearly 100 percent of their food. Even in places like New York City, we could see extreme food riots that have never been witnessed before in the history of America. But does this give the UN the right to intervene under the guise of green helmets?\r\n\r\nGlobalists think it does. The global elite are not merely setting us up for UN occupation under the excuse of “climate change peacekeeping,” they’re also the ones causing many of the problems in the first place! Who’s behind the global GMO invasion? It’s the global elite, of course. That’s why the U.S. state department was caught on record saying that Spain should be punished for resisting GMOs (http://www.naturalnews.com/030828_GMOs_Wikileaks.html)\r\n\r\nHow about global vaccination campaigns that are actuallysterilizationefforts designed to limit population growth? (http://www.naturalnews.com/029911_vaccines_Bill_Gates.html)\r\n\r\nThen there’s the issue of chemtrails, fluoride and all the other chemicals being dumped into the environment, which actually cause environmental problems that then provide justification for the UN to show up and police the world. Wouldn’t it make more sense to just stop poisoning the planet with all these synthetic chemicals in the first place?\r\n\r\nBut no, the more problems there are in our world, the more power security forces are able to exercise over the populations. Conflict enables control. War is power, not peace. Every crisis in an opportunity. “Never waste a good crisis,” Secretary of State Hillary Clinton famously said in a talk about climate change. And that’s the whole point, you see: The global elite wish to exploit the very same environmental crises they’ve caused in order to gain more power over entire nations.\r\n\r\nAnd now with this UN initiative, we’re seeing yet another example of how “green” is used as a cover story for military imperialism. The term “climate change peacekeeping” is downright Orwellian in its tone and intention. Hitler fought wars to create “law and order.” Stalin’s atrocities were done in the name of “peace.” The Crusades were mass killing campaigns conducted in the name of “God.” Tyrants always have a justification for their wars, it seems. The killing that used to be done in the name of God will soon be conducted in the name of GREEN.\r\n\r\nSo get ready, America. Your neighborhoods are about to be “peacekept” by UN forces wearing green helmets and claiming to be operating under environmental initiatives that somehow give them the right to occupy your land and order you to obey. Remember, it’s all about “Never waste a good crisis,” and a global food crisis is headed your way very, very soon.\r\n\r\nNaturalNews readers may be interested in protecting themselves from the coming food crisis by taking advantage of our Food Security course that teaches food preparedness, how to build your own water filter, how to create a food “go bag” and much more. Get details at: http://premium.naturalnews.tv/Be_Prepared_Food_Security.htm\r\n\r\nhttp://www.naturalnews.com/033076_United_Nations_peacekeeping.html", "group_id": 3920, "id": 1695646}]