[{"user_id": 11626, "stars": [], "topic_id": 8992, "date_created": 1298616679.2537551, "message": "LUBBOCK, Texas – A college student from Saudi Arabia who studied chemical engineering in Texas bought explosive chemicals online as part of a plan to hide bomb materials inside dolls and baby carriages to blow up dams, nuclear plants or the Dallas home of former President George W. Bush, the Justice Department said Thursday.\r\n\r\n\"After mastering the English language, learning how to build explosives and continuous planning to target the infidel Americans, it is time for jihad,\" or holy war, Khalid Ali-M Aldawsari wrote in his private journal, according to court documents.\r\n\r\nThe 20-year-old Aldawsari wrote that he was planning an attack in the United States for years, even before coming to the U.S. on a scholarship. He said he was influenced by Osama bin Laden's speeches and that he bemoaned the plight of Muslims.\r\n\r\nOne of the chemical companies, Carolina Biological Supply of Burlington, N.C., reported $435 in suspicious order by Aldawsari to the FBI on Feb. 1.\r\n\r\nSeparately, Con-way Freight, the shipping company, notified Lubbock police and the FBI the same day with similar suspicions because it appeared the order wasn't intended for commercial use. Within weeks, federal agents had traced his other online purchases, discovered extremist posts he made on the Internet and secretly searched his off-campus apartment, computer and e-mail accounts and read his diary, according to court records.\r\n\r\nTNP, the chemical explosive that Aldawsari was suspected of trying to make, has approximately the same destructive power as TNT. FBI bomb experts said the amounts in the Aldawsari case would have yielded almost 15 pounds of explosive. That's about the same amount used per bomb in the London subway attacks that killed scores of people in July 2005.\r\n\r\nAldawsari, who was legally in the U.S. on a student visa, was expected to appear in federal court on Friday. He was charged Thursday with attempted use of a weapon of mass destruction.\r\n\r\nAldawsari entered the U.S. in October 2008 from Riyadh, Saudi Arabia, to study chemical engineering at Texas Tech University. He transferred this year to nearby South Plains College, where he was studying business. A Saudi industrial company, which was not identified in court documents, was paying his tuition and living expenses in the U.S.\r\n\r\n\"He was quiet. I thought he was a good guy,\" said Ahmid Obaidan, a senior at Tennessee State University who also is from Saudi Arabia and met Aldawsari in Nashville, Tenn., when Aldawsari was studying at an English language center at Vanderbilt University.\r\n\r\nIt was not immediately clear whether Aldawsari had hired a lawyer. Telephone numbers that Aldawsari had provided to others were not working Thursday. No one answered the buzzer or a knock on the door at the address listed as Aldawsari's apartment, just one block from the Texas Tech campus in a recently gentrified area of mixed-use retail and apartment complexes where many students live.\r\n\r\nThe terrorism case outlined in court documents was significant because it suggests that radicalized foreigners can live quietly in the U.S. without raising suspicions from neighbors, classmates, teachers or others. But it also showed how quickly U.S. law enforcement can move when tipped that a terrorist plot may be unfolding.\r\n\r\nThe White House said President Barack Obama was notified about the plot before Aldawsari's arrest Wednesday. \"This arrest once again underscores the necessity of remaining vigilant against terrorism here and abroad,\" White House spokesman Nick Shapiro said in a statement.\r\n\r\nBush spokesman David Sherzer referred questions about the case to law enforcement officials.\r\n\r\nIn e-mails Aldawsari apparently sent to himself, he listed 12 reservoir dams in Colorado and California; the documents did not state their exact locations. He also wrote an e-mail that mentioned \"Tyrant's House\" with the address of Bush's home.\r\n\r\nThe FBI's affidavit said Aldawsari considered using infant dolls to hide explosives and was possibly targeting a nightclub with a backpack filled with explosives.\r\n\r\nAldawsari was using several e-mail accounts. One e-mail message traced to him described instructions to convert a cell phone into a remote detonator. A second listed the names and home addresses of three American citizens who had previously served in the U.S. military and had been stationed at Abu Ghraib prison in Iraq. A different e-mail contained an Internet link for real-time traffic cameras in New York City.\r\n\r\nAldawsari also described a plan in his journal that involved leaving car bombs in different places during rush hour in New York City and remotely detonating them.\r\n\r\n\"Obviously, we're concerned any time New York City is referenced in this way,\" New York Police Commissioner Raymond Kelly said. \"We've known we're at the top of the terrorists' target list, and this confirms it. This particular case has not led to any adjustment. We're always on high alert here.\"\r\n\r\nThe FBI said the North Carolina company reported the attempts to purchase 1.3 gallons of phenol, a chemical that can be used to make the explosive trinitrophenol, also known as TNP, or picric acid. Aldawsari falsely told the supplier he was associated with a university and wanted the phenol for \"off-campus, personal research,\" according to court records. But frustrated by questions, Aldawsari canceled his order and later e-mailed himself instructions for producing phenol.\r\n\r\nProsecutors said that in December, he did buy 30 liters of concentrated nitric acid for about $450 from QualiChem Technologies in Georgia, and three gallons of concentrated sulfuric acid that are combined to make TNP. The FBI later found the chemicals in Aldawsari's apartment as well as beakers, flasks, wiring, a Hazmat suit and clocks.\r\n\r\nProsecutors said Aldawsari, who hoped to create an Islamic group under the al-Qaida banner, had a blog to publish extremist messages expressing his dismay over conditions for Muslims.\r\n\r\n\"You who created mankind ... grant me martyrdom for your sake and make jihad easy for me only in your path,\" he wrote, according to court records.\r\n\r\nNeighbors in Lubbock said they had never seen Aldawsari, but noticed people in the hallway the day of the arrest.\r\n\r\n\"That's so scary,\" said Sally Dierschke, a 21-year-old senior at Texas Tech. \"That's my neighbor ... Of course, I'm scared.\"\r\n\r\nVanderbilt University spokeswoman Beth Fortune said Aldawsari participated in a program at the school's English language center from the fall of 2008 to the summer of 2009 but was not a registered Vanderbilt student.\r\n\r\nThe FBI sent letters to farm supply stores and other businesses across the country this week to remind them to look out for suspicious purchases of fertilizer and other substances that can be used to make explosives. In Denver, FBI spokesman Dave Joly said the warnings had been planned before Aldawsari's arrest. \r\n\r\nhttp://d.yimg.com/a/p/ap/20110224/capt.3bae6df6c91c44ad8fd038ade77d3ce8-3bae6df6c91c44ad8fd038ade77d3ce8-0.jpg?x=213&y=191&xc=1&yc=1&wc=410&hc=368&q=85&sig=1etmus0ljpcslghtXK9_kQ--\r\n\r\nhttp://news.yahoo.com/s/ap/20110225/ap_on_re_us/us_terror_bomb_plot", "group_id": 3920, "id": 206383}]