[{"user_id": 42622, "stars": [], "topic_id": 46955, "date_created": 1319420829.6100399, "message": "My main goal is to have a 6.5 to 6.0 bloodwork reading December 15th for my blood sugar. I've been mostly vegetarian for a month and a week now and I'm amazed how my blood sugars are doing so well and I've had to cut back on the metformin and the fast acting insulin. I'm so jazzed. I have had to not worry about my family so much and just cook my meals seperate. It isn't so bad and maybe they'll give it a try one day.I'm", "group_id": 11977, "id": 2417480}, {"user_id": 42622, "stars": [], "topic_id": 46955, "date_created": 1319420912.618922, "message": "hoping to lose weight too.", "group_id": 11977, "id": 2417491}, {"user_id": 42639, "stars": [], "topic_id": 46955, "date_created": 1319439228.8704529, "message": "I'd like to drop few kilos (maybe 10 lbs ?) before Christmas so my mum doesn't give me the traditionnal 'oh my, you've gain so much weight, how come you're not skinny as I was at your age' present for Xmas ;)", "group_id": 11977, "id": 2419210}, {"user_id": 22946, "stars": [], "topic_id": 46955, "date_created": 1319457764.9635019, "message": "you can do it!", "group_id": 11977, "id": 2420092}, {"user_id": 42624, "stars": [], "topic_id": 46955, "date_created": 1319465055.7021821, "message": "Hoping to lose weight and lower my bodyfat.  Hubby is a newbie to vegetarianism (hasn't totally cut out meat yet though, but doing great for starters) and he's already dropped his total cholesterol from over 200 to 150.", "group_id": 11977, "id": 2420748}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1319482546.7232909, "message": "I am a newbie to Vegetarian food also.  Doctor said 'you want to live, change your diet.  Do not eat over 5 grams of fat per meal and snack every 2 hours'  sigh...I wanted to smack him HARD  I miss chocolate LOL", "group_id": 11977, "id": 2422678}, {"user_id": 22946, "stars": [], "topic_id": 46955, "date_created": 1319487366.170927, "message": "@vm4him thats great to here! wishing your hubby more good health!", "group_id": 11977, "id": 2423245}, {"user_id": 22946, "stars": [], "topic_id": 46955, "date_created": 1319487373.8038671, "message": "@KarenneLyn you can do it! can you have cocoa?", "group_id": 11977, "id": 2423246}, {"user_id": 42624, "stars": [], "topic_id": 46955, "date_created": 1319493685.9237399, "message": "KarenneLyn, hubby and I are laughing over you wanting to smack your doctor.  I love chocolate too.", "group_id": 11977, "id": 2424111}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1319513673.2112999, "message": "@LindsayNixon Nope no cocoa.  That was the part that I wanted to cry about", "group_id": 11977, "id": 2426702}, {"user_id": 42626, "stars": [], "topic_id": 46955, "date_created": 1319522922.328234, "message": "I'm hoping to fit back into my jeans and get in better shape for Spring running season. I fell down the stairs in June and took out my ankle and all the non-activity plus unhealthy eating did not help matters.", "group_id": 11977, "id": 2427530}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1319555456.1372621, "message": "@daphne07 ouch!  I hope you are healed up okay?", "group_id": 11977, "id": 2429667}, {"user_id": 42626, "stars": [], "topic_id": 46955, "date_created": 1319609504.400192, "message": "Yes! My PT just finally cleared me for walking for periods longer than 30 minutes, though he warned me it may be months before I run again. Patience is not my strongest virtue! What's really frustrating is that I took out the ankle one month before I was set to do a Triathlon with a friend of mine. There's always next year, right?", "group_id": 11977, "id": 2436352}, {"user_id": 42635, "stars": [], "topic_id": 46955, "date_created": 1319635947.44681, "message": "my goal is to get my diet back on track so that I have the energy to workout again.  I was doing great at the beginning of the year, but then I started nursing school and my schedule got really crazy.  I started eating out a lot (still vegan but not the healthiest) so I didn't have the energy to workout after a full day of clinicals or classes.  So far, I am feeling great on the meal plan.  I just started Sunday, but I love it.  I think I'm doing so well with it because I'm just thinking of it as a meal plan and not a diet plan so I don't psych myself out...it seems to be working :)", "group_id": 11977, "id": 2437985}, {"user_id": 42791, "stars": [{"date_created": 1319739315.127224, "user_id": 42635}], "topic_id": 46955, "date_created": 1319639170.762342, "message": "I have been eating almost vegan for about three months now since getting an LDL reading of 161.  The doctor wants me to test again after a total of six months of watching my diet.  My goal is to get the LDL to below 100 through diet alone.  My doctor didn't give me much advice beyond \"eat less meat and full fat dairy\".  I decided to be more radical than that after reading \"The China Study\" and \"Forks Over Knives\".  Since then I have been collecting vegan cookbooks and reading all I can, and trying out plant based meal ideas.  In addition to lowering my LDL I want to lose a few pesky pounds to get back to my goal of 155.  I have about five pounds to go now.  I haven't been actually using the meal plans yet, but I am collecting them, and I think it is a great idea.", "group_id": 11977, "id": 2438290}, {"user_id": 42799, "stars": [], "topic_id": 46955, "date_created": 1319651330.094156, "message": "My goal is to loose 50 more pounds to help lower my blood pressure and get off the scrips.", "group_id": 11977, "id": 2439703}, {"user_id": 42625, "stars": [], "topic_id": 46955, "date_created": 1319679224.5977199, "message": "My goal is to \"walk the walk\" as a nurse I give advice about eating all day.  I work with  heart patients.  I deal with young people whom have heart attacks.  I always wonder why and why so young . I watched Forks over Knives , I was hooked. I just see a big rise in obese  patients with what I call the trifecta( diabetes, hypertension and hyperlipidemia)     So I want to try this low fat plant base diet and tell patients about it.  That if I can do it so can you.  The only thing is I love love love cheese , I plan to start Nov 1st.  I also hate to cook so this is going to be hard.  I usually have meal delivery sent to my house it is the zone diet.  I love this blog and forum.  I am hoping this helps my patients and me.  Cheers to no cheese but I still get my wine:)", "group_id": 11977, "id": 2443115}, {"user_id": 22946, "stars": [], "topic_id": 46955, "date_created": 1319716109.8020489, "message": "you are all fabulous! I'm inspired by you all!", "group_id": 11977, "id": 2445601}, {"user_id": 42844, "stars": [], "topic_id": 46955, "date_created": 1319737530.8360529, "message": "I have managed to get up to 275lbs w/out developing any serious health issues, no pre-diabetes, no regular medication, not even regular headaches. My goal is to quit pushing my luck & loose 120lbs (at least) & stay healthy while doing it.", "group_id": 11977, "id": 2447418}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1319773838.844522, "message": "Today's goal....no cheating LOL", "group_id": 11977, "id": 2451574}, {"user_id": 42629, "stars": [], "topic_id": 46955, "date_created": 1319819049.431385, "message": "BHooke .... that sounds like me!  I am at 242 and as with you, no health problems yet but I, too, know that my luck may run out.  Time to take control.", "group_id": 11977, "id": 2455074}, {"user_id": 42623, "stars": [], "topic_id": 46955, "date_created": 1319825554.763732, "message": "My goal is to lose these last 10lbs.  I have been eating Vegan for a long time, but not healthy. A year or so ago, I started following Mcdougal program. It has taken me a while, but I started out at 200 lbs. I now have lost 55 lbs. I am excited to really get into this program. This week has been crazy and I haven't been home a lot to do any cooking. Even though the recipes look so easy. I did make the neopolitan smoothie, which was yummy and the chai oatmeal which was really good. I am cooking up some fresh pumpkin right now and plan on trying the pumpkin oatmeal.", "group_id": 11977, "id": 2455872}, {"user_id": 42895, "stars": [], "topic_id": 46955, "date_created": 1319855981.679894, "message": "My goal is to lose weight the smart healthy way. Which also contributes to the well being of animals and saving our planet. How many \"live\" it programs have those kinds of side benefits?!  ;o). I have never been as heavy as I am now. At 200 and want to get sown to 120.  Thank you Lindsay for so much for all that you do and for setting up the plan and this group!  You are a never ending sea of VERY helpful information!", "group_id": 11977, "id": 2458631}, {"user_id": 43126, "stars": [], "topic_id": 46955, "date_created": 1320490032.9197259, "message": "I recently became a herbie and have a LOT of weight to lose. I am currently 132kg (291lbs) and even at 5'8\" I am still at a very unhealthy weight. I want to lose weight but I also want to learn how to run and lead the healthiest life possible. :)", "group_id": 11977, "id": 2511140}, {"user_id": 42833, "stars": [], "topic_id": 46955, "date_created": 1320494766.189992, "message": "@AnnieOz Go for it Annie!!! You can do it!!! Baby steps, and remember to be easy on yourself!", "group_id": 11977, "id": 2511313}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1320527189.0492079, "message": "@AnnieOz Well at least you know you have a place to chat (says the overweight person)", "group_id": 11977, "id": 2514013}, {"user_id": 43126, "stars": [], "topic_id": 46955, "date_created": 1320560527.1662469, "message": "Thank you @scrappyshel & KarenneLyn ! :)", "group_id": 11977, "id": 2517461}, {"user_id": 43418, "stars": [], "topic_id": 46955, "date_created": 1321077076.938364, "message": "Hi, everybody.  My goal is to make that transition from vegetarian to vegan.  I am okay MOST of the time, but still not quite there 100%.  Thinking joining this group will lhelp my motivation.  ;)", "group_id": 11977, "id": 2557628}, {"user_id": 43602, "stars": [], "topic_id": 46955, "date_created": 1321530865.9727781, "message": "I want to improve the quality of my diet and my eating experience. I've been vegan for more than a year, vegetarian for decades before that, for philosophical reasons. The quality of my diet is less than ideal in several senses--I tend to snack all day, eat on the run, consume (organic) sugar and (fair trade) coffee for energy, etc. Downloaded this week's Happy Herbivore diet plan with shopping instructions, etc. and--wow--this makes shopping and food preparation as easy and accessible as it can be. I'm fairly active and doubt I could keep up with everything I need to do on 1200 calories, so the goal for this week is to have this balanced center to my diet, and to prepare and eat these foods attentively. When this feels natural, I'll further upgrade my diet/eating habits.", "group_id": 11977, "id": 2588702}, {"user_id": 43418, "stars": [], "topic_id": 46955, "date_created": 1321683654.2581961, "message": "I have been vegetarian for 29 years and have given up red eat 2 1/2 years before that.  I keep trying to be 100% vegan, but never quite seem to make it.  I AM trying, though.  It DOES get easier.  ;)", "group_id": 11977, "id": 2599116}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1321730302.1996689, "message": "@funniestmama Glad to hear that it gets easier!", "group_id": 11977, "id": 2601787}, {"user_id": 43766, "stars": [], "topic_id": 46955, "date_created": 1322000367.5905631, "message": "I would like to start  living a healthy lifestyle starting with eating healthy meals and working out on a daily basis. I would also like to shed excess weight!", "group_id": 11977, "id": 2621063}, {"user_id": 43766, "stars": [], "topic_id": 46955, "date_created": 1322073495.2864511, "message": "@KarenneLyn Thank you so much for the support! I really do feel like I have come to the right spot for meeting my goals and getting positive motivation. :) A big wave back at you!", "group_id": 11977, "id": 2625781}, {"user_id": 43766, "stars": [], "topic_id": 46955, "date_created": 1322073847.5551491, "message": "@KarenneLyn Like yourself I am new to Vegan food as well. Right after the holiday is over it's jumping on board to healthy eating. I am so excited to start cooking with Lindsay! hehe Her recipes look so yummy, I own her first cookbook and I am waiting on her second cookbook to arrive.", "group_id": 11977, "id": 2625806}, {"user_id": 43909, "stars": [], "topic_id": 46955, "date_created": 1322491526.226521, "message": "Hi everyone! Nice to join this group which I am sure will grow grow grow~ My goal and outlook is removing all dairy and fish. I stopped eating meats, chicken fish etc and cut back way on dairy and fish in '97. I have eaten Vegan as well through out the years but only recently have I made the decision to cut all animal usage out. It is not a difficult or foreign thing for me but it is a change. My daughter has been a Vegan for years and so I am for once following her instead of vice a versa!", "group_id": 11977, "id": 2658622}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1322580433.5686629, "message": "@CharlyannaFlyFly So glad you are here!", "group_id": 11977, "id": 2665494}, {"user_id": 43766, "stars": [], "topic_id": 46955, "date_created": 1322666813.4890649, "message": "@CharlyannaFlyFly Welcome!", "group_id": 11977, "id": 2671858}, {"user_id": 44185, "stars": [], "topic_id": 46955, "date_created": 1323357974.9433711, "message": "My main goal is to be able eat vegan and not feel pressured by family or friends to eat meat and dairy!", "group_id": 11977, "id": 2723296}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1322029033.9552579, "message": "@PLEASE_DELETE Well you have to come the right spot.  I will be your designated cheerleader LOL  waves", "group_id": 11977, "id": 2623231}, {"user_id": 44539, "stars": [], "topic_id": 46955, "date_created": 1324609536.8253529, "message": "My goal - is to continue my weight loss journey (lost 66 lbs already) but in a healthy way. I followed another plan but it seems to encourage more processed foods, I am a cancer survivor and would like to stay in remission and in the recent months I found Forks over Knives and other resources and feel the way to go is plant-based. I have made the switch to mostly vegetarianism but am working on the going all the way for my health. I am hoping to lose the last 20 lbs and be healthy and happy while enjoying yummy food!!", "group_id": 11977, "id": 2745924}, {"user_id": 42630, "stars": [], "topic_id": 46955, "date_created": 1324620701.7035611, "message": "@erin727 Congratulations!  that is awesome.  I can't wait until I can say I lost that much weight!", "group_id": 11977, "id": 2745947}]