[{"user_id": 11626, "stars": [], "topic_id": 7449, "date_created": 1298105564.081187, "message": "http://www.longislandlawyerblog.com/wp-content/uploads/2011/02/nassau.jpeg\r\n\r\nNassau County raided four Gun Shops in a $80,000 tax-payer funded sting operation on Wednesday. The owners and employees were arrested and charged with selling illegal “assault weapons” to undercover Nassau County investigators.\r\n\r\nAll of the owners insist that they were following the law. Martin Tretola, the owner of T&T Gunnery, was captured on undercover video demonstrating how to hypothetically alter a rifle by removing the pin to make a fixed stock collapsible, but he clearly explains that the weapon is “law enforcement only”, and added “you take that pin out, I’m telling you, you’re in trouble with this gun.” Tretola was charged with criminal sale of a firearm in the second degree, a class B Felony, and a misdemeanor charge of firearms licensing provisions. He faces up to 15 years in prison if convicted.\r\n\r\nBut there’s more to this story than most are reporting. In 2008, Martin Tretola filed a multimillion dollar lawsuit in federal court against Nassau County for violations of his constitutional rights. The County was unable to dismiss the lawsuit, and it is scheduled for trial soon. Right before the jury is selected is an awfully convenient time for another raid and arrest.\r\n\r\nThe History:\r\n\r\nAccording to Tretola, in March 2006, Tretola received a telephone call from a Police Officer Faltings from the NCPD. Officer Faltings ordered Tretola to turn over possession of a particular firearm to a friend of Officer Faltings without the purchase documents for that particular weapon. Tretola denied Officer Falting’s request, at which point Officer Faltings allegedly responded “Do you know who I am? I am the head of the Pistol Licensing Bureau of Nassau County.”. Tretola responded in words or substance that “I do not care who you are or what you are. What you are asking of me is against the law and I will not do it.”\r\n\r\nShortly after the telephone conversation, the two men met in person at police headquarters. During the meeting, Officer Faltings stated “when I ask for something you need to do it”, and further stated that if Tretola didn’t do as he asked, he would strip Tretola of his license to sell firearms. Tretola refused.\r\n\r\nOn May 9, 2007, Officer Faltings and five police officers orchestrated a massive raid involving the Nassau County Fire Marshal, the Federal Bureau of Alcohol, Firearms and Tobacco (ATF), the Town of Hempstead Building Department, and the Nassau County Bomb Squad. The raid was conducted without a warrant, and was completely beyond the purview of the Nassau County Pistol Licensing Bureau. Despite the failure to discover illegal activity, the Nassau County Police seized many weapons, and Martin Tretola was arrested for Reckless Endangerment. All charges were later dismissed. Tretola’s seized inventory has not been returned.\r\n\r\nShortly after the charges were dismissed, Officer Faltings arbitrarily suspended Martin Tretola’s licenses, including his pistol license, dealer’s license,  and gunsmith license. His store was temporarily shut down, causing massive financial harm. Eventually, Tretola was able to restore his licenses, and he filed a multimillion dollar lawsuit against Nassau County.\r\n\r\nNassau County made several attempts to have the lawsuit dismissed, but were unsuccessful. In December 2010, the matter was marked ready for trial, and is currently awaiting a trial date. Jury selection will be scheduled soon.\r\n\r\nMore to come….\r\n\r\nhttp://www.longislandlawyerblog.com/what-was-really-behind-nassau-countys-gun-store-raids", "group_id": 3920, "id": 149093}]