[{"user_id": 11626, "stars": [], "topic_id": 7762, "date_created": 1298257034.26599, "message": "http://www.youtube.com/watch?v=lZK0iDCq3Vk\r\n\r\nWhen a cop murders a civilian it’s a mistake, but when a civilian kills a cop it’s a tragedy.  This is what we’ve allowed the mainstream media to get away with by feeding us such deceptive hocus-pocus that we accept this party line.  In Seattle and Oakland, John T. Williams and Oscar Grant were both murdered in cold blood with witnesses present and with video evidence; their precious lives brutality taken by the hands of police officers.  The outcome?  One officer received an extremely short prison sentence and the latter got away scot-free.   As retired Army Officer and former CIA agent Ray McGovern briefly stated this week as the goon squad brutalized him for silent protest, “So this is America.”  Yes Mr. McGovern, this is now America indeed.\r\n\r\nWhat’s more ridiculous about this recent event surrounding the John T. Williams case is that the FBI is conducting an investigation into the Seattle police department to see if there have been any civil rights violations being practiced in the department.  Yes, you heard right – the same folks who assassinated Fred Hampton and had this to say after the fact:\r\n\r\n    “We expected about twenty Panthers to be in the apartment when the police raided the place. Only two of those black n**** f****** were killed, Fred Hampton and Mark Clark.”  —FBI Special Agent Gregg York  Source\r\n\r\nThe same agency that will knock on your door if you signed the wrong petition or hold “extreme” views?  Is it the same agency that’s been going around the country illegally entrapping credulous Muslim youths for propaganda props?  The same ones who want backdoors installed on popular social-networking sites to keep an eye on you, in clear violation of the 4th Amendment?  A sure waste of taxpayer dollars!\r\n\r\nIrrespective of government actions, it was incredibly inspiring to see the brave souls take to the streets in Seattle.  It’s now more important than ever to have the cameras at the ready on the public servants we call the police — the same “servants” who seem to have no accountability.  The cop who killed Oscar Grant, Johannes Mehserle, received a total of 292 days in prison; less than Michael Vick got for fighting dogs.  A tacit admission that a dog’s life has more value in America’s “justice system.”  While prosecutor Dan Satterberg stated that he was unable to press charges on cop Ian Birk who brutality murdered John T. Williams, because “under the 1986 statute, he can’t file charges when a police officer makes an arguably ‘good faith’ mistake, he insisted.”\r\n\r\nWith that argument, if a civilian kills a cop in “good faith” will prosecutors abstain in making murder charges stick?  Hardly! This kind of thing has been happening to minorities for years and their complaints were incessantly ignored.  This is what happens when you ignore the plight of ethnic and religious minorities.  Sooner or later, the boot on their necks will end up on yours.\r\n\r\nKnow your rights!\r\n\r\nhttp://www.stopfbi.net/sites/default/files/CCR_If_An_Agent_Knocks-1.pdf\r\nhttp://www.copblock.org\r\nhttp://www.copwatch.org \r\n\r\nRick Gedeon is graduate from USAF Air University, amateur historian, and anti-imperial/anti-police brutality activist.   Rick Gedeon has traveled extensively throughout the US and Asia.  A political marketeer, routinely bringing together and forging alliances with different political organizations that share similar goals. He considers himself a Political Atheist and sympathizes with many Libertarian causes.  He can be reached at rick_gedeon@hushmail.com\r\n\r\nhttp://www.infowars.com/activist-forward-march", "group_id": 3920, "id": 155760}]