[{"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305017572.1993799, "message": "Given the utter lack of a Team Ico Collection, this is what my month of May is all about.\n\nJust sayin'.", "group_id": 9493, "id": 986987}, {"user_id": 32692, "stars": [], "topic_id": 34513, "date_created": 1305019647.355021, "message": "Can't wait! Especially if they've promised to shut Dave Mirra up.", "group_id": 9493, "id": 987534}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305024711.3704, "message": "Hah.  “More English” sounds pretty good all round.  Also:  **Group B**!!!\n\nOn the other hand, all his focus on the gymkhana mode (in which I have zero interest) worries me.", "group_id": 9493, "id": 988082}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305111978.453227, "message": "… which is why I'm not too hot and bothered about the gymkhana mode in DiRT 3.  I'm hoping that if I don't like it, I'll not have to play it much.", "group_id": 9493, "id": 1005896}, {"user_id": 31753, "stars": [], "topic_id": 34513, "date_created": 1305111013.6674199, "message": "Dirt 1 is probably my favourite racing game of this generation. I just couldn't get into Dirt 2. Will see how Dirt 3 goes.", "group_id": 9493, "id": 1005662}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305111604.5317171, "message": "I'm always a little puzzled by people who say that, because DiRT 2 improved on the original in almost every way.", "group_id": 9493, "id": 1005816}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305111940.748642, "message": "Hrm.  I'd say that given the extreme non-linearity of what passed for DiRT 2's \"career\", combined the the overwhelming mass of options as to exactly *how* I'd like to play the game, I can't say I could really fault the career mode either.\n\nGranted, there were a couple of game modes in there I found less than exciting (the same could be said of the first game) but the point is, your choice is so wide open that you don't really *have* to do the stuff you're not keen on.  Unless you're an obsessive completist.", "group_id": 9493, "id": 1005885}, {"user_id": 32692, "stars": [], "topic_id": 34513, "date_created": 1305111689.7827981, "message": "I agree with Mr.V to an extent -- the moment-to-moment driving and visuals were a lot better in Dirt 2. However, the career mode wasn't as good as in the first. It was SO padded with repeated tracks, and not a proper hill climb in sight.", "group_id": 9493, "id": 1005833}, {"user_id": 32692, "stars": [], "topic_id": 34513, "date_created": 1305114933.6043429, "message": "How far did you get in the career mode, though, Mr.V? Some of the later events are just grueling -- multiple laps on a track, then again on a mirror.", "group_id": 9493, "id": 1006552}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305117770.4502439, "message": "I'm tempted to say “pretty far”.  I think I still have a couple of those special events on the right-hand side to complete in their entirety, but not because I felt the game got particularly difficult… I just didn't get to that yet.\n\nI do know that on my Live friends list I was well ahead of everyone in the career except for Hennie/SilverSurfer… and I was steadily catching up on him when Dawid (re-)discovered the game a few months back and simply zoomed past the both of us.  You know, like he *does* in driving games.\n\nThe most difficult part of the career (that I recall) was that one entire multi-stage special event that you had to do with the RWD classic Escort.  Oh, and some of the rallycross events in (especially) the L.A. stadia also required multiple attempts.", "group_id": 9493, "id": 1006866}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305131423.675226, "message": "I feel a DiRT 2 session coming on tonight…", "group_id": 9493, "id": 1009790}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305897195.9771049, "message": "Reviews starting to roll in.  Looking good…", "group_id": 9493, "id": 1125324}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305897673.4358211, "message": "http://www.eurogamer.net/articles/2011-05-20-dirt-3-review", "group_id": 9493, "id": 1125425}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305919868.9290719, "message": "Supported controllers:\n\nhttp://community.codemasters.com/forum/dirt-3-general-discussion-1339/464511-dirt-3-supported-controllers-wheels.html\n\nInteresting that the official (and now out of production) Xbox 360 wheel also works with the PC version…", "group_id": 9493, "id": 1129406}, {"user_id": 32692, "stars": [], "topic_id": 34513, "date_created": 1305922646.068603, "message": "Are we all getting this on 360? I'm assuming we'll want to play the multiplayer.", "group_id": 9493, "id": 1129888}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305990464.7017241, "message": "Only in DiRT:  Racing down a snaking Croatian mountain pass in DiRT 2 last night, a whole rear bumper assembly suddenly fall down the cliffside onto the road in front of me…", "group_id": 9493, "id": 1134422}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1305990379.2099209, "message": "Yes and yes, as far as I'm concerned.", "group_id": 9493, "id": 1134419}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1306006340.1206429, "message": "Have not played much of the new game, will wait for you lot to get in on the action then I'll get cracking", "group_id": 9493, "id": 1136126}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306146609.7858801, "message": "Two more of those \"only in DiRT\" moments over the weekend:\n\nThe first is actually not all that uncommon:  You accelerate into a huge jump, and at the last second you note the angle at which the (AI) driver in front of you is descending and you think… oh-oh, that's not going to go too well for him.  And sure enough, as you yourself come down from the jump you see his truck rolling head-over-tail with bits of bodywork and clouds of dust spinning off in all directions.\n\nOne of the best things about DiRT — it truly makes you believe you're racing against actual opponents, even when playing single player.", "group_id": 9493, "id": 1151007}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306146812.024368, "message": "And the second thing was even niftier:\n\nI'm doing a time trial on a Moroccan dustbowl of a circuit, and suddenly in a place where there's no obvious obstacles my truck starts going nose-over-tail.  By sheer luck I land on my wheels and continue on…\n\nAnd I actually had to look at the replay to figure out what happened (using, of course, the incredible tools to spool through the action and view it from all angles):\n\nOn the *previous* lap, I took a turn too wide and swept off the track briefly before recovering.  In doing so, I disturbed some loose boulders at the side of the track, one of the smaller ones of which rolled into the track and continued downhill for a ways before coming to rest.  And it was small enough for me not to see it over the bonnet (I was driving in helmet cam / first person view), and my truck hit the boulder that I myself had put there, on the next lap.", "group_id": 9493, "id": 1151014}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306223538.9626241, "message": "… must go past a game shop today.  Somehow.\n\nYou know, ordering things online and getting them in your pigeonhole at work is MUCH easier than all this meatspace manoeuvring!", "group_id": 9493, "id": 1163181}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306305994.814971, "message": "Right, so I picked up DiRT 3 yesterday, and last night I played almost to the end of the first season (of four) that's initially visible in the career mode.\n\nI find it hard to summarise my feelings about the game.  Yes, it's most definitely DiRT, and that makes it most definitely part of the best racing franchise of this generation (no matter what anyone else says) and very likely to be one of my stand-out games of the year.  At the same time, I can't help but feel that in some ways it doesn't quite live up to… not the hype, not the expectations… but rather to the \"expectation curve\".\n\nOne get pretty used to each entry in a franchise being, essentially, more and moar and MOAR of the same (hello, Gran Turismo) but Codemasters seems more than happy to experiment and throw away a bunch of old stuff in order to add something new.  Which means that, inevitably, some things will be missed.\n\n(Feh… I'm just going to do this over multiple posts.)", "group_id": 9493, "id": 1175197}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306306411.1408911, "message": "So first off, people who really liked DiRT and really hated DiRT 2 (oddly, there seem to be lots of those):  This game is for you.  In a sense, DiRT 3 is DiRT redone with all DiRT 2's technical advances.  Its available gameplay modes, its menu structure, the career progression… everything is much more DiRT than DiRT 2.\n\nWhich, of course, is not a bad thing.  DiRT and DiRT 2 were also two very different games, each of which I loved in its own right.\n\nThat said, I do miss the sheer adrenaline of DiRT 2.  Sitting in a serenely animated DiRT 3 menu, listening to ambient electro or (of all things) smooth J-pop, I really really do miss DiRT 2's clashing guitars, phase-shifting audio, screen shakes and adrenaline-pumping fireworks.  It's almost as if I'm… halfway back to can-I-fall-asleep-now Gran Turismo.\n\nWhich, again, isn't a bad thing in and of itself, but it does make the game feel a little disjointed, *because* it still includes a fair number of X-Games events.  Which now feel rather out of placed with the serene long-pan-over-the-landscape intros that suit the rally events really well.  I guess it's tit for tat:  DiRT 2's rally events probably felt a little out of place, and indeed, they were tarted up a little to make them more Xtreme-ey.", "group_id": 9493, "id": 1175214}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306306743.1225929, "message": "DiRT 2 was a game about extreme motorsports that had a damn good rally game hidden somewhere deep inside it.  DiRT 3 is ALL ABOUT rally.  Even more so than the original DiRT.  Nowhere is this more obvious than in the selection of included vehicles:  DiRT and DiRT 2 each had several classes of trucks and buggies (actually, buggies were already de-emphasised in DiRT 2 as compared to the original), but even though DiRT 3 has the biggest vehicle roster of any DiRT game so far, it has ONE truck and ONE buggy.  Not one class, but ONE of each.  The other dozens upon dozens of vehicles are all basically rally cars.\n\nWhich means that truck or buggy races become one-class events, with all players using the same anonymous token truck or buggy.  As someone who really enjoyed racing these less traditional off-road vehicles, well… I miss 'em.\n\nI guess the point is this:  DiRT 3 is a game about rally and its closely related siblings like hill-climing, rallycross, etc.  That's just what it is.  Live with it.", "group_id": 9493, "id": 1175245}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306306955.027349, "message": "Some random things:\n\nThe weather effects are a great addition, and truly well-implemented.  I especially like the \"inclement weather\", where it's *just about* to rain, with a few scattered drops here and there.  Brilliantly done.\n\nThe graphics… OMG.  Ego was already the best-looking racing engine, and they pushed it over the edge this time.  *Especially* the background graphics.  You realise just how sterile everything but the cars and the track look in most racing games when you see the hugely detailed scenery in DiRT 3, with a draw distance that seems to go to infinity.  Absolutely stunning.", "group_id": 9493, "id": 1175257}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306307198.934572, "message": "BUT.\n\nI can live with this being a more focussed rally game, compared to previous DiRTs.  But there's something else that's truly bugging me about DiRT 3:\n\nIn ways that I can't yet put my finger on, they seem to have tweaked the physics of the game making it a heck of a lot… EASIER.  I can't quite decide if the handling is more docile, or whether the cars are more survivable, or WHAT… but something is different.  I now tend to finish career events (winning them, by and large) with my car looking like a car, not a bent chassis with some body panels hanging off it.  Clipping a barrier at high speed results in your car bouncing off with some scrapes on your paint job, not a head-over-heals tumble with body panels going everywhere.  Even the AI seem to benefit:  In DiRT 3 I see them bundling into a corner all together in a way that (in DiRT 2) would've caused some spectacular crashes, but they all just kind of bounce off each other and carry on.\n\nI'm not sure if I'm doing something wrong, but this seems to impact the realism and believability of it all for me.  There are, I have to admit, more settings to tweak than there ever were in DiRT 2.  I'll go and tweak them as I go on and see if that makes any difference.", "group_id": 9493, "id": 1175278}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306319716.4740591, "message": "This query seems to catch mostly just the videos people have uploaded to YouTube from within the game:\n\nhttp://www.youtube.com/results?search_category=20&search_type=videos&search_query=dirt3&search_duration=short&search_sort=video_date_uploaded", "group_id": 9493, "id": 1176372}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306389620.495034, "message": "OK, my bad.  The difficultly level SERIOUSLY picks up once you start the 2nd season.  It appears that the first season is mostly meant to ease beginners into the game… which is a new angle for DiRT.\n\nAlso:  Gymkhana is AWFUL.  And you HAVE to get 3rd place or higher in a competitive gymkhana event in order to progress to season 2.  Bad form, Codies, bad form.", "group_id": 9493, "id": 1188571}, {"user_id": 31852, "stars": [], "topic_id": 34513, "date_created": 1306392537.960809, "message": "Due to an online pass which can't be redeemed with the Store down, the PS3 version currently does not support online play: http://www.joystiq.com/2011/05/25/dirt-3s-vip-pass-cant-be-disabled-for-ps3-owners/", "group_id": 9493, "id": 1189067}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306392596.6154411, "message": "Yep, yeah… people saw this one coming and have been bitching on the Codies forums for a while now.", "group_id": 9493, "id": 1189084}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1306406061.8525181, "message": "My first uploaded vid here: http://www.youtube.com/watch?v=aUI95-9K14c\n\nIt was literally my first race, more impressive crashing action to follow!", "group_id": 9493, "id": 1190797}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306843353.5863731, "message": "I came to kick ass and play boring games that involve matchboxes, beer bottles and dodgy scripts… and I'm all out of boring games that involve matchboxes, beer bottles and dodgy scripts.\n\nTranslation:  I'll be there.  (Might be a bit late, though.)", "group_id": 9493, "id": 1237004}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1306843146.633229, "message": "Multiplayer tonight at 20:30. Be there or go play some other boring game that involved matchboxes, beer bottles and dodgy scripts.", "group_id": 9493, "id": 1236987}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306855674.3913791, "message": "First DLC is out.  Doesn't add much, but proceeds go to charity:\n\nhttp://marketplace.xbox.com:80/en-GB/Product/Paquete-Benéfico-Colin-McRae-Vision/cc3fba5c-50cf-4c03-8109-a22b1cade6df\n\nI guess the bigger news is that there *is* DLC.  A first for a DiRT game.", "group_id": 9493, "id": 1238265}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306856222.759449, "message": "Some screens of upcoming DLC:\n\nhttp://community.codemasters.com/forum/dirt-3-general-discussion-1339/466432-dlc-montecarlo-captures.html", "group_id": 9493, "id": 1238298}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1306875362.383743, "message": "This game is just all kinds of fun online... especially when the damage is turned to FULL, with no flashbacks :)", "group_id": 9493, "id": 1241674}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1306913949.264926, "message": "Thanks for the games last night, guys.  Boy, I suck.", "group_id": 9493, "id": 1250929}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1306915739.5823691, "message": "We definitely need to arrange another night of gaming once Genuchi returns. The more the merrier.", "group_id": 9493, "id": 1251138}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1308043098.552958, "message": "DLC incoming today on XBL (tomorrow on PSN and GfWL):\n\nhttp://community.codemasters.com/forum/dirt-3-general-discussion-1339/467285-dirt-3-dlc.html#post7117751\n\nI'll get it *just* for the S4.", "group_id": 9493, "id": 1389067}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1308064909.6995499, "message": "http://www.oxm.co.uk/30288/previews/dirt-3-dlc-monte-carlo-exclusively-revealed/", "group_id": 9493, "id": 1391795}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1308064902.8648269, "message": "Details on Monte Carlo DLC (June 28):", "group_id": 9493, "id": 1391793}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1309246912.3458681, "message": "The Crysis 2 DirectX11 vid Darric just posted reminded me:\n\nHas there ever been a (console) racing game with real-time reflections on the cars?  I know that for a while now, the real environment has been reflected in cars' bodywork in many games, but has there been a game where the *other cars* too were reflected dynamically?", "group_id": 9493, "id": 1504000}, {"user_id": 32057, "stars": [], "topic_id": 34513, "date_created": 1309264412.9486129, "message": "Not that I know of? GT5 perhaps? Will have to fire it up and see I can't recall.", "group_id": 9493, "id": 1505276}, {"user_id": 32692, "stars": [], "topic_id": 34513, "date_created": 1309270429.550971, "message": "Wreckless: The Yakuza Missions?", "group_id": 9493, "id": 1506012}, {"user_id": 33318, "stars": [], "topic_id": 34513, "date_created": 1309292983.673665, "message": "Yeah, I've been wondering about that too. Car engine sounds come to mind too. The AI drivers all sound the same, but YOUR car will sound like the real thing.", "group_id": 9493, "id": 1510415}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1309333554.2735119, "message": "I had guests over last night so I couldn't download it, but the Monte Carlo DLC is out now at M$800— yay!!\n\nThere's also a Mini Gymkhana pack out for M$160, which contains a Mini Cooper S gymkhana car.", "group_id": 9493, "id": 1515548}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1309415583.922323, "message": "So I just had a *brief* look at the Monte Carlo pack last night, and… wow.  If anything, it's the prettiest environment in what's already one of the prettiest games of the generation.  Truly stunning!\n\nThat said… I read an interview with Codies a while back where they said that they feel people who buy the DLC have already \"committed\" to the game, and hence they can up the difficulty level a bit.  And they weren't kidding.  For much of the Monte Carlo stretches you're driving on cliffside roads too narrow for two cars abreast, with a sheer cliff wall UP to the one side, and a sheer cliff wall DOWN to the other.  And they expect you to barrel down these at close on 200km/h.  Frankly, no horror game you can mention can be *remotely* as frightening.\n\nOh, and the gymkhana Mini is a traditional old Leyland-era Cooper S with a mid-engine mod!  Win!", "group_id": 9493, "id": 1526125}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1309540325.2315259, "message": "Monte Carlo Trailer:  http://www.youtube.com/watch?v=jVPEjskI7Wk", "group_id": 9493, "id": 1543262}, {"user_id": 31927, "stars": [], "topic_id": 34513, "date_created": 1310557149.2499859, "message": "Another car pack out:  \"Mud and Guts\":\n\nhttp://community.codemasters.com/forum/dirt-3-general-discussion-1339/467285-dirt-3-dlc.html#post7143581\n\nLancia Stratos!  Peugeot 205 Group B!\n\nPrice:  M$480", "group_id": 9493, "id": 1627699}]