[{"user_id": 11626, "stars": [], "topic_id": 7605, "date_created": 1298190168.5533979, "message": "http://i2.cdn.turner.com/money/2011/02/14/news/international/arms_uprisings_egypt.fortune/arms_egypt.top.jpg\r\n\r\nFORTUNE -- Hosni Mubarak and Zine El Abidine Ben-Ali have been forced out of Eygpt and Tunisia, but their arms stockpiles, furnished in large by American defense contractors, are still there. The U.S. government has sold billions of dollars worth of planes, tanks, and missiles to Middle Eastern countries in recent years. As power shifts in the region, so too will control of those weapons.\r\n\r\nAmerican arms exports to the Middle East, fueled by oil money and a shared distrust of Iran, have been quietly booming. Between 2006 and 2009, the Department of Defense sold nearly $50 billion worth of weapons to the region, according to the Congressional Research Service, which tracks exports coordinated by the government on behalf of private contractors. Annual sales agreements with Middle Eastern countries have more than quadrupled since 2000. (See this interactive graphic: Up in arms)\r\n\r\nThe pace of deal-making has only increased under the Obama administration. In 2009 and 2010, the DoD notified Congress of potential military exports to the Middle East worth more than $100 billion, a nearly 40% increase over the previous two years (the final sales tend to be worth about 50-70% of the notified value).\r\n\r\nThough the biggest sales were to moderate, oil rich states like Saudi Arabia and the U.A.E., the U.S. has also armed many of the countries that are currently undergoing political upheaval. The Egyptian government purchased about $2 billion worth of American-made weapons from the Department of Defense in 2009, the last year for which data is available, including two dozen F-16s. It pays for the bulk of its arms with U.S.-supplied credit, called foreign military financing. While economic aid to Egypt has declined over the last decade, military aid has stayed flat at about $1.3 billion, making it the second biggest recipient after Israel. (See America's hottest export: Weapons)\r\n\r\nAnd it hasn't stopped since the unrest began. Though Germany and France have both suspended arms exports to Egypt, America has stayed the course. A State Dept. spokesman confirmed that the U.S. has not frozen arms exports to any countries in the Middle East this year.\r\n\r\nOther, smaller Arab states have also been stocking up on U.S. weapons: the recently overthrown Tunisian regime bought worth $15 million of weapons from the DoD in 2009. Jordan, whose king dissolved his cabinet after protests began in Egypt, purchased $431 million worth of arms that year. Protests are beginning to spring up in Bahrain, which spent about $100 million.\r\n\r\nEven poverty-stricken Yemen, whose leader recently promised not to run for re-election, has acquired American-made weapons. The U.S. gave the Yemeni government about $155 million in military assistance last year in order to fight the growing terrorist threat in the country. Yemen receives most of its funding through a little known DoD program called section 1206.\r\n\r\nThe future for arms Made in the U.S.A.\r\n\r\nNow, as revolution rips through the Middle East, the U.S. must wait to see who gains control over those weapons. Though the State Department says arms transfers come with strict limitations -- Egypt must comply with numerous end-use restrictions and conditions, a spokesperson wrote in an email -- arms proliferation critics say the rules go out the window when power changes hands.\r\n\r\n\"The new regime would just inherit them,\" says Pieter Wezeman of the Stockholm International Peace Research Institute. \"Even if the U.S. doesn't agree with them, they won't get back the weapons.\"\r\n\r\nThe most infamous example of U.S. arms being passed to a hostile regime is Iran: In the 1970's, the U.S. sold billions of dollars worth of arms to the Shah, including dozens of F-14 jets, only to have the Ayatollah Khomeini acquire the weapons after coming to power in 1979. Since then, the U.S. government has spent years tracking down and destroying F-14 parts to keep the Iranians from maintaining the planes.\r\n\r\nCould Egypt, Tunisia, or any of their neighboring countries go down the same path? It's possible, but unlikely, according to most defense experts. In fact, some say America's long history of arming the Egyptian military actually bolstered the U.S.' negotiating position during the protests. \"The Egyptian military, the primary beneficiary of U.S. aid, will play a significant role in shaping the contours of the post-Mubarak system,\" wrote Haim Malka, a senior fellow at the Center for Strategic and International Studies, in a recent note.\r\n\r\nMalka urged against cutting off the flow of arms to Egypt: \"The United States' ability to influence that system is already limited. Freezing military aid now undermines what leverage the U.S. government does have to promote a post-Mubarak system that is more than just a reconfiguration of the status quo.\"\r\n\r\nSo far, the U.S. government seems to agree.\r\n\r\nhttp://money.cnn.com/2011/02/14/news/international/arms_uprisings_egypt.fortune/index.htm", "group_id": 3920, "id": 152496}]