[{"user_id": 15013, "stars": [], "topic_id": 21198, "date_created": 1303721885.6476431, "message": "Email is the huge billion dollar opportunity sitting in the middle of the room. Everyone knows that it's broken. It's become the catch all messaging system for business, personal, social, marketing, task management.\n\nCan anything replace email? Or will it go down piece by piece? Will email always be around? What opportunities surround email and picking apart its weaknesses?\n\nThere are lots of attempts at solutions out there already: Rapportive, Gmail Priority Inbox, Taskforce, Baydin, Facebook Messages,  Gist, Sanebox, Clearmyinbox, the list goes on...\n\nSo let's hear it. Email will die ONE day. How will it die?", "group_id": 250, "id": 801475}, {"user_id": 26065, "stars": [], "topic_id": 21198, "date_created": 1303722997.338964, "message": "\"Everyone knows that it's broken\" is a very bold statement that's imho not true. For most people email works just fine. What we will probably see though are new user interfaces leveraging email and other messaging systems. ccloop.com comes to mind, and also greplin.com (btw, have 5 invites left if someone needs them)", "group_id": 250, "id": 801749}, {"user_id": 9018, "stars": [], "topic_id": 21198, "date_created": 1303734753.127687, "message": "agree with martin \"\"Everyone knows that it's broken\" is a very bold statement that's imho not true\".\n\ninterfaces may change but the whole hoopla around facebok messaging-what a joke.", "group_id": 250, "id": 802848}, {"user_id": 896, "stars": [], "topic_id": 21198, "date_created": 1303756026.745801, "message": "Google wave was try considering exactly this hypothesis but failed miserably because of many reasons, one of them is we hypothesis don't need replacement for email today. But if I have to vote for something, Google wave it would be/", "group_id": 250, "id": 805818}, {"user_id": 6812, "stars": [], "topic_id": 21198, "date_created": 1303757025.0519831, "message": "I think that email won't die, but many of the uses we have for it today will shift for other mediums. Mediums like social networks, push notifications and other solutions that are being worked on today.", "group_id": 250, "id": 805965}, {"user_id": 25716, "stars": [], "topic_id": 21198, "date_created": 1303759437.8721919, "message": "Email works perfectly for me. And then I can use Skype, celular, etc, etc for the other uses I need.", "group_id": 250, "id": 806340}, {"user_id": 31056, "stars": [], "topic_id": 21198, "date_created": 1303761516.297986, "message": "mmm think  e-mail its too formal ...and if  you give some one your  email...  you are  likely to be spammed...have to go deeper", "group_id": 250, "id": 806617}, {"user_id": 30354, "stars": [], "topic_id": 21198, "date_created": 1303761544.8878591, "message": "Email isn't going anywhere for a very long time.", "group_id": 250, "id": 806624}, {"user_id": 22095, "stars": [], "topic_id": 21198, "date_created": 1303770877.820061, "message": "how do you suppose company a can talk to company b? facebook?", "group_id": 250, "id": 807964}, {"user_id": 15929, "stars": [], "topic_id": 21198, "date_created": 1303789386.039506, "message": "yep. email won't die. interface may change but it's still email, and still under the same protocols. that's why I laughed when google came out with wave saying \"we are the new email!\"", "group_id": 250, "id": 809946}, {"user_id": 12892, "stars": [], "topic_id": 21198, "date_created": 1303793680.9158559, "message": "I still prefer wave to email, because dialog is a more natural form of communication than sending letters. That doesn't mean it can't be done better than wave. That said, for most things, SMS and things like whatsapp far outweigh email in my daily use these days.", "group_id": 250, "id": 810423}, {"user_id": 2628, "stars": [], "topic_id": 21198, "date_created": 1303796068.9122591, "message": "I don't have an answer but I do know that Yammer has cut down on email within a project I'm working on now significantly. I imagine Campfire will as well once we start using it.", "group_id": 250, "id": 810702}, {"user_id": 9018, "stars": [], "topic_id": 21198, "date_created": 1303796837.7533121, "message": "@evolutiongenx  it failed because of shitty architecture, too late and too tired to explain but needed app hooks for monetisation of robots to encourage thrid party development. \n\nimagine building the iphone with no way of getting third party developers paid and oyu get a rough idea.", "group_id": 250, "id": 810740}, {"user_id": 22603, "stars": [], "topic_id": 21198, "date_created": 1303797213.565994, "message": "Agree with @deancollins. Wave failed because it had a crappy interface in an overly complex architecture. Yammer is a good concept (even though I didn't like it in the beginning, today I see some value with geographic distributed teams), and Facebook messages is already the de facto standard for p2p communications.", "group_id": 250, "id": 810764}, {"user_id": 22603, "stars": [], "topic_id": 21198, "date_created": 1303797452.7130859, "message": "And who said email email has to be replaced? FTP still being used - despite dropbox, IRC still useful - despite webchat, heck even RSS is more alive than ever and NNTP still around.. Some p2p communication will certainly move to other channels, but email won't go anywhere.", "group_id": 250, "id": 810777}, {"user_id": 719, "stars": [{"date_created": 1303796843.1981931, "user_id": 9018}, {"date_created": 1304004213.6976099, "user_id": 8285}], "topic_id": 21198, "date_created": 1303796177.4498391, "message": "Anyone trying to replace email should remember it's basically a 3 step process: type address, message & hit Send. Anything more adds complexity. \n\nYou'd be basically trying to replace one of the simplest UX experiences on the web without a clue of how exactly it's \"broken\".", "group_id": 250, "id": 810717}, {"user_id": 22183, "stars": [], "topic_id": 21198, "date_created": 1303796348.8723619, "message": "@evolutiongenx ditto, and Wave is snowly incorporated into Google's products, bit by bit.  Hopefully it'll resurface again soon.", "group_id": 250, "id": 810729}]