[{"user_id": 11626, "stars": [], "topic_id": 6794, "date_created": 1297925862.678169, "message": "An unprecedented cyberattack on the Canadian government from China has given foreign hackers access to highly classified federal information, and forced at least two key departments off the internet, CBC News has learned.\r\n\r\nThe attack, first detected in early January, left Canadian counter-espionage agents scrambling to determine how much sensitive government information may have been stolen and by whom.\r\n\r\nHighly placed sources tell CBC News the cyberattacks were traced back to computer servers in China.\r\n\r\nBut they caution there is no way of knowing whether the hackers are Chinese, or some other nationality routing their cybercrimes through China to cover their tracks.\r\n\r\nSo far, officials in Prime Minister Stephen Harper’s government have been all but mum on the breach of security.\r\n\r\nThe government initially issued a terse statement, passing it off as merely an “attempt to access” federal networks, and has refused to release any further information.\r\n\r\nBut sources have confirmed the attackers successfully penetrated the computer systems at the federal government’s two main economic nerve centres, the Finance Department and Treasury Board.\r\n\r\nThe hackers apparently managed to take control of computers in the offices of senior government executives as part of a scheme to steal the key passwords that unlock entire government data systems.\r\n\r\nIt is unclear whether the attackers managed to compromise other departmental computer networks, including those that contain Canadians’ sensitive personal information such as tax and health records.\r\n\r\nOnce the attack was detected, government cybersecurity officials immediately shut down all internet access in both departments in an attempt to stop stolen information from being sent back to the hackers over the net.\r\n\r\nThe move left thousands of public servants without internet access, although officials in both affected departments report service has slowly been returning to normal since the attack.\r\n\r\nFor years, experts including the federal auditor general have been warning that security on the government’s networks is woefully inadequate and open to cyberattack.\r\n\r\nhttp://www.cbc.ca/politics/story/2011/02/16/pol-weston-hacking.html", "group_id": 3920, "id": 129731}]