[{"user_id": 33075, "stars": [], "topic_id": 40984, "date_created": 1309551473.6124179, "message": "There hasn't been much activity recently, as it seems... Just asking, if there is anybody here except me still using Convore and Convorsation? ;-)", "group_id": 5203, "id": 1544787}, {"user_id": 23322, "stars": [], "topic_id": 40984, "date_created": 1309551769.9242699, "message": "I check Convore periodically from my browser, but haven't used Convorsation much because of the constant notifications. Any chance Convorsation could be open sourced? Then the best features could be pulled into the main source and published to the market.", "group_id": 5203, "id": 1544815}, {"user_id": 33075, "stars": [], "topic_id": 40984, "date_created": 1310234329.1964669, "message": "Hm... No response in over a week. Well, the saying goes \"no news are good news\". I just feel this does not apply here that well... :(", "group_id": 5203, "id": 1599845}, {"user_id": 23322, "stars": [], "topic_id": 40984, "date_created": 1310265392.4616301, "message": "@g0ph3r hey, I responded, I think it should be open sourced and any good featured be pulled  for the Android Marketplace version", "group_id": 5203, "id": 1602401}, {"user_id": 33075, "stars": [], "topic_id": 40984, "date_created": 1310279579.0864699, "message": "@jeffl8n Sorry, I should've phrased that better. I intended to say that there was no reaction from the author (@EisFrei) for quite some time now... I couldn't agree more, open sourcing is my preferred solution as well. But I'm just a mere user of Convorsation and don't have any influence in such decisions.", "group_id": 5203, "id": 1603440}, {"user_id": 23322, "stars": [], "topic_id": 40984, "date_created": 1310314031.474864, "message": "@g0ph3r No problem, I wasn't sure if my message posted because I was getting a couple errors when I was trying it. I'd be willing to work on an open source replacement for Convorsation.", "group_id": 5203, "id": 1604994}, {"user_id": 9907, "stars": [], "topic_id": 40984, "date_created": 1313793910.6443579, "message": "Just sleeping ;)", "group_id": 5203, "id": 1913485}, {"user_id": 42361, "stars": [], "topic_id": 40984, "date_created": 1318887159.3213351, "message": "This app is great. Congratulations to the developer :)", "group_id": 5203, "id": 2370754}]