[{"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307699199.9450099, "message": "The recent conversation about The Terminator movie highlighted for me that I'm in some grave misunderstanding about what MC Approach and Domain means and how are they dependent on each other. Taking the textbook case of Luke Skywalker, his Domain is Situation which qualifies him as a Do-er yet as I see he's being pushed around a lot (by his foster parents not letting him leaving the farm, being harrassed in the cantina, getting insults from the princess when trying to save her with no response, etc.) and he adapts to any new environment or situation he gets into. Obi-Van on the other hand, who is a Be-er by definition initiates a lots of action (\"Luke, you should learn the Force\"; \"We should get a ship\"; bargaining with Han, cutting badasses in two in the cantina, etc. ) - doesn't really look like someone who \"works out problems internally\". Their Domain description is okay but Approach doesn't seem to fit. Or is it this way: being a Be-er doesn't necessary means that the character lets others push him around, it can rather be translated as 'introversion' and being a Do-er means 'extraversion' (in the psychological sense of the words)? That would make much more sense and it would also help to clarify those things.", "group_id": 2515, "id": 1359197}, {"user_id": 30951, "stars": [], "topic_id": 38876, "date_created": 1307704611.4474609, "message": "Interesting topic. This link has come up a lot recently.\n\nNot sure I can say much though with the particular example. To me, Luke is an almost perfect example of a Do-er, Obi a good example of a Be-er, based on how I understand them. \n\nLuke defining characteristic is his headstrong approach. Obi's is the way he adapts to make the best of a situation. \n\nLook at Luke's desire to leave the farm and get involved, his inability to deal with Han in Mos Eisley, his keenness to be involved in the final mission, and the fact that he doesn't adapt to his farm boy role at all - he wants to leave.\n\nLook at Obi in Mos Eisley where he tries to bring calm by adapting, only using force because he has to, then working out the deal with Han, giving his own life (or Earth life) to help Luke (which is adapting to the extreme!). Obi instigates action by working with Luke and advising him. He only confronts Vader because he knows he has to.", "group_id": 2515, "id": 1359720}, {"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307709059.7792971, "message": "@Mikeaja: Yes, it makes sense. But I think current description of Be-er and Do-er and how their approach is linked to their Domain would deserve some clarification. The Be-er's description suggests that he is just sitting around when the Environment doesn't change. Actions of the Be-er are pretty much linked to Environmental changes - that's for sure. But if that's the case I can't understand why are Be-ers locked out of the two 'environmental' domain. Is this because they also react to environmental changes primarily mentally?", "group_id": 2515, "id": 1360170}, {"user_id": 30951, "stars": [], "topic_id": 38876, "date_created": 1307712488.1146569, "message": "Right, yes, see what you mean. I'll tell as I see it, although this might not be the Dramatica reason. Most of this comes from things I have assumed or worked out based on comments Chris and Jim have said here recently.\n\nA Be-er's Problem is by nature something that requires them adapting to something, so changing themselves (Sarah Connor), following a dream. The Problem emanates from them. So being in Internal Domains makes sense.\n\nA Do-er is trying the change their environment, so are likely happy with themselves, but see what is around them as the Problem. So ....... External Domains.\n\nWhat about Luke and how he approaches being a Jedi. I'm not sure he's that interested in the religion itself, he just wants the skills to be able to fight and help the rebels. He doesn't see himself needing to change, he wants to change what is around him.", "group_id": 2515, "id": 1360789}, {"user_id": 7645, "stars": [], "topic_id": 38876, "date_created": 1307727595.770411, "message": "For an example of a really strong Be-er who doesn't sit around and wait for the Environment to change, think of Baby Jane Hudson in \"What Ever Happened to Baby Jane\". This nutbag has lost her mind and is convinced that she can somehow mount a comeback. Her interactions with the housekeeper, with the piano player she hires and even with the person she places the personal ad with are all examples of a Main Character trying to *be* something more in order to solve their own problems. By inflating her self-image in order to win over others, she exhibits the qualities of a very proactive Be-er.", "group_id": 2515, "id": 1363577}, {"user_id": 7645, "stars": [], "topic_id": 38876, "date_created": 1307727581.4731071, "message": "When you look at the IC it is always within the context of their influence on the Main Character, their Approach is not an essential part of the storyform. True, most IC's in either Mind or Psychology could be seen as Be-ers and those in Situation or Activity could be seen as Do-ers, but using ICs in order to understand the concept of MC Approach is self-defeating because their role within a story is really about the *impact* they have on the MC.", "group_id": 2515, "id": 1363572}, {"user_id": 10814, "stars": [], "topic_id": 38876, "date_created": 1307728061.3144569, "message": "In Star Wars, Luke wants to DO things, but his uncle prohibits it (think of this as 'Can't Do').  At the first opportunity to do something that doesn't involve asking permission first, he rushes off into dangerous territory to retrieve R2D2.", "group_id": 2515, "id": 1363673}, {"user_id": 10814, "stars": [], "topic_id": 38876, "date_created": 1307727819.0869679, "message": "Keep in mind that the MC Approach describes how the MC would PREFER to solve problems.  The Story Driver determines which is more effective (doing or being) in the Overall Story throughline.", "group_id": 2515, "id": 1363627}, {"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307774138.006041, "message": "I guess I start to understand it now. In the Terminator, only the IC sees the problem as being chased by the machine and only he's working on solving this part of the problem (Situation). The \"unpreparedness\" of the MC has little to no interest for the IC. On the contrary the MC focuses on herself being not prepared for the task and she does almost nothing to solve the external situation. Therefore her domain is Mind. She has to overcome her fixed attitude first to focus her energies on the external problem.", "group_id": 2515, "id": 1368899}, {"user_id": 30951, "stars": [], "topic_id": 38876, "date_created": 1307785031.2015791, "message": "@Novbert  Personally, I think your summary above is making assumptions about the characters that we do not have much evidence for in the film. For example, I'm not sure why:\n\n'In the Terminator, only the IC sees the problem as being chased by the machine and only he's working on solving this part of the problem (Situation)'\n\nor why:\n\n 'The \"unpreparedness\" of the MC has little to no interest for the IC', \n\nor why:\n\n '..................... she does almost nothing to solve the external situation.'\n\nI'm really not trying to be negative (hopefully helpful), but I think you are just adding non-film elements to make the storyform points fit. I don't think that's how we should be doing it (otherwise we could make such assumptions about any film and fit any storyform).\n\nI'll tell you what I took from what Chris and Jim said, which may or may not be helpful.\n\nRegarding IC Situation, the key point was that it isn't about the IC's Problem, but about how the IC influences the MC. So it is Situation because the IC's Situation is what influences Sarah.\n\nWith MC Mind, I don't think it is so literal. As Chris said in the other thread regarding the Concern, \".......... Sarah is concerned with her fear. She's scared of having the weight of the survival of the human race based on her.\" \n\nEverything I've seen about Dramatica storyforming tells me that we should be using real, solid, in-the-film examples that relate to author intent, not our own assumptions about the characters feelings or motivations just to make story points fit.", "group_id": 2515, "id": 1369301}, {"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307790690.8419211, "message": "@Mikeaja : I don't see how the MC not handling the external situation would not be part of the movie. All she does about her external problems in the majority of the story is relying on others (the police, Reese) to solve the external situation. As I see this is one of her qualites that defines her as a Be-er.\nOn the other hand by just accepting that the OS TL is Activity and MC Growth is Start (she has to start doing things to avoid Consequences) already places her in the Mind domain. This is why now I think that our whole approach to come up with a storyform was wrong from the very beginning and - as Chris suggested - we should focus on story points we're sure about in the first place, to narrow our possible choices about story points we're not that sure about. \nSpeaking of which: what you've said before suggests that Pursuit as an OS Problem was dictated for you by the software based on other decisions. Is that right? In that case it would be great to see what initial assumptions you've made to get to that problem", "group_id": 2515, "id": 1369514}, {"user_id": 30951, "stars": [], "topic_id": 38876, "date_created": 1307792766.0237839, "message": "I might have explained that badly. All I meant was, those points you mention are not things that are very evident in the film to me. \n\nFor example, I can't say I thought the MC was not handling the external situation. She reacted as well as anyone would, in fact quite a bit better, especially considering her previous life couldn't have been less suitable.\n\nAnother example is the police. She doesn't rely on them (except for when she thinks the T is a serial killer). In fact, the police almost get her killed by keeping them in the police station. It's her own resourcefulness, and Kyle's, that keep her alive.\n\nYour right about storyforming, but if you look back at the Terminator thread beginnings, we were focusing on the bigger stuff first. The discussion went off at a view tangents (which is fine). MikeDerk's suggestion is, I think, the best way to start - identifying the 4 throughlines before looking at the Dramatica terms and Domain choices. There was also a bit of OS / MC mixup I think in some of the earlier comments.\n\nWhat we all got wrong was how we were anlysing the IC. We were trying to put him in a Situation, whereas we should have been looking at what it is about the IC that most influences Sarah (which is then clearly his Situation - that he is here in the present from the future).", "group_id": 2515, "id": 1369661}, {"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307799796.048454, "message": "@Mikeaja : Focusing on bigger stuff first sounds reasonable, yet I want to emphasize that we could have spared a whole lot of discussion realizing that our consensus on the OS TL (Activity) and accepting that the MC Growth is Start (she's rather passive in the beginning which makes the situation worse and she has to start doing things to avoid the Consequence) already puts the MC in the Mind domain by definition (I mean by the software). My point is that accepting that the MC growth is Start sounds now much easier than arguing a lot about why she is in the Situation  domain or why not. There are so many arguments for each, yet the fact that she's passive in the beginning and active in the end looks obvious and leads to resolution of this problem.", "group_id": 2515, "id": 1369919}, {"user_id": 7645, "stars": [], "topic_id": 38876, "date_created": 1307806142.942723, "message": "Just to add something, when we analyze films in the User Group meetings typically we skip the MC Growth. The rationale is that it usually is the most difficult appreciation to determine with certainty and that the selection of Domains, which usually is easier to determine, selects the Growth anyways. Not saying that is the case here, Sarah's need to start is pretty strong, but in most stories the Growth is so close to either/or that it's good to make a guess about it, figure out the other thematics, then see if Dramatica says your guess was right.", "group_id": 2515, "id": 1370245}, {"user_id": 35323, "stars": [], "topic_id": 38876, "date_created": 1307807911.4672201, "message": "@jimhull : Intersting point, yet I'd like to see some examples to see the mentioned difficulties. As I see the problem is pretty much sorted out in the book. When the character is actively working on solving his problem (because the Consequence has already taken place) but his actions only make the situation worse he has to stop. If the consequence will only happen if he doesn't handle his problem properly he has to start. Of course stories can be much more complex than that but some examples would really help me to understand why you tend to skip this step.", "group_id": 2515, "id": 1370321}, {"user_id": 30951, "stars": [], "topic_id": 38876, "date_created": 1307808811.2928629, "message": "@Novbert    I don't think we would have wanted to come to the MC Mind decision that way. I think we would rather choose it for story reasons. The discussion regarding MC and IC Domains highlighted exactly what we were doing wrong, \n\nRegarding Start and Stop, I don't think it is as simple as that. Some others stories we discussed here were clearly not easy to choose. I'd also go with what the User Groups do, simply because they have the advantage of being able to discuss directly, and probably have developed a much better approach to creating storyforms. And Jim clearly knows what his talking about!", "group_id": 2515, "id": 1370356}]