[{"user_id": 19720, "stars": [], "topic_id": 12084, "date_created": 1299783686.75366, "message": "Hola, soy Ruy. Estoy haciendo un estudio de la industria de Internet en México. Me interesa el la relación entre lo social y las TICs. Me interesa la educación y el aprendizaje desde una perspectiva amplia. Me interesa la Interacción Hombre Máquina. Soy aprendiz de etnógrafo.", "group_id": 6356, "id": 315562}, {"user_id": 20393, "stars": [], "topic_id": 12084, "date_created": 1299787030.1807561, "message": "Hola! Pues yo soy Raquel y platicando con Toño Salgado (@droso) salió al tema que el único grupo que podría formarse en el SMCGdl era el de Educación, que sería hermano del que él coordina allá en el DF. Por eso me comentó que sería bueno entablar conversación con los posibles miembros. Yo pensé en ustedes, Liz y Ruy. Además que @richacosta también está en esto y Magda.", "group_id": 6356, "id": 315840}, {"user_id": 20397, "stars": [], "topic_id": 12084, "date_created": 1299789114.2586739, "message": "Hola a ambos, el grupo de educación no es el único que se puede formar (as far as I know) pero es el que puedo ayudar a formar. Me da gusto que se animen a formarlo, es un tema apasionante, aquí estoy capacitando profes universitarios en la incorporación de las RS en la cátedra y hemos tenido muy buenos resultados especialmente con los que son bien cabezones y dicen que \"esto no sirve\". El lunes tengo un buen reto: en 20 min tengo que presentar herramientas colaborativas y bibliográficas a filósofos de la fac de Filosofía en la UNAM (esos si son duros de roer) y que se interesen en usarlas :P entonces? lo armamos?", "group_id": 6356, "id": 316112}, {"user_id": 20397, "stars": [], "topic_id": 12084, "date_created": 1299791007.6633179, "message": "acabo de grear un grupo en FaceBook, si me pasan sus usuarios o me agregan los pongo en el grupo de GDL y en el de aqui", "group_id": 6356, "id": 316355}, {"user_id": 20397, "stars": [], "topic_id": 12084, "date_created": 1299791043.838954, "message": "facebook.com/antoniosalgadoleiner", "group_id": 6356, "id": 316362}, {"user_id": 19729, "stars": [], "topic_id": 12084, "date_created": 1299796018.2737761, "message": "ok", "group_id": 6356, "id": 317191}, {"user_id": 20393, "stars": [], "topic_id": 12084, "date_created": 1299795674.3969729, "message": "Listo! http://www.facebook.com/raquel.aguilar", "group_id": 6356, "id": 317157}, {"user_id": 19729, "stars": [], "topic_id": 12084, "date_created": 1299824049.059644, "message": "Los que puedan, viernes 11 de marzo 10 pm skype.", "group_id": 6356, "id": 319799}]