[{"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301332625.426434, "message": "http://mexican.vc", "group_id": 965, "id": 460155}, {"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301332642.42311, "message": "@cesarsalazar tiene mas info al respecto", "group_id": 965, "id": 460162}, {"user_id": 26105, "stars": [], "topic_id": 15815, "date_created": 1301333019.3088789, "message": "Creo que un startup podria comenzarse con ahorros propios, de la familia, de los amigos y algún perdido :D No necesitas el gran capital para hacer un demo funcional.", "group_id": 965, "id": 460251}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301333127.9099929, "message": "Para tener una primera versión del producto (sobre todo en software/web) sólo necesitas \"sweat capital\" o \"capital súdor\".", "group_id": 965, "id": 460273}, {"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301333156.1811249, "message": "un poco alejado del topic", "group_id": 965, "id": 460277}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301333265.5490091, "message": "Ambos tienen sus pros y sus contras", "group_id": 965, "id": 460288}, {"user_id": 26105, "stars": [], "topic_id": 15815, "date_created": 1301333383.829339, "message": "AH! Otra cosa cool seria poner una página con la descripción de tu producto y una forma pa que la gente se registre para beta. Si nadie te pide estar en el programa de beta, pues olvidalo. A lo siguiente. Tambien te conviene anunciar esta beta en fb y google. Con algo como 300 USD podrias llenar de anuncios un rato.", "group_id": 965, "id": 460299}, {"user_id": 25716, "stars": [], "topic_id": 15815, "date_created": 1301333123.926352, "message": "agree @mauropm en verdad, gran capital puede ser contraproducente", "group_id": 965, "id": 460272}, {"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301333131.92452, "message": "las efes Fools Friends and Family como diria @msuster", "group_id": 965, "id": 460274}, {"user_id": 26085, "stars": [], "topic_id": 15815, "date_created": 1301332582.7879081, "message": "Una entrada de hace un tiempo. http://bit.ly/hrZmKp", "group_id": 965, "id": 460142}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301333081.9295261, "message": "@mauropm Coincido", "group_id": 965, "id": 460264}, {"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301333166.5783401, "message": "http://www.docstoc.com/docs/69286554/Things-I-Effed-Up-at-my-First-Company un poco alejado del topic", "group_id": 965, "id": 460278}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301333250.223772, "message": "Sin embargo, una vez que llegas al punto de tener algo básico, necesitas probar que el mercado lo requiere y eso te va a tomar más tiempo, enfoque y esfuerzo. Seguramente vaa requerir el 100% de tu tiempo y es ahí donde se separan dos corrientes, el \"bootstrapping\" (o dicho en español, rascarte con tus propias uñas) y los \"venture backed startups\" (involucrar a un tercero que tenga capital en efectivo)", "group_id": 965, "id": 460286}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301333323.674546, "message": "Lo que es un hecho es que construir un startup requiere capital (cold cash), ya sea que este venga de la cuenta de ahorros de los fundadores, de las carteras de los clientes o de la cartera de un inversionista.", "group_id": 965, "id": 460294}, {"user_id": 16337, "stars": [], "topic_id": 15815, "date_created": 1301334414.8714881, "message": "@mauropm i like the idea...", "group_id": 965, "id": 460496}, {"user_id": 19921, "stars": [], "topic_id": 15815, "date_created": 1301334365.4531469, "message": "@mauropm Buena sugerencia :)", "group_id": 965, "id": 460493}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301336873.5251441, "message": "@soska Creo que estás confundiendo \"capital\" con \"capital de riesgo\". Capital siempre se necesita. Captital de riesgo, no. El capital de una empresa \"bootstrappeada\" viene de la inversión personal de los fundadores y/o de los ingresos por ventas.", "group_id": 965, "id": 460677}, {"user_id": 2946, "stars": [], "topic_id": 15815, "date_created": 1301336701.340899, "message": "NO! No es lo mismo. Bootstrap, bootstrap, bootstrap. http://www.google.com/search?client=safari&rls=en&q=bootstrapped+profitable+proud+cataphora&ie=UTF-8&oe=UTF-8#sclient=psy&hl=en&client=safari&rls=en&q=bootstrapped+profitable+%26+proud+site:37signals.com", "group_id": 965, "id": 460655}, {"user_id": 2946, "stars": [], "topic_id": 15815, "date_created": 1301337169.1768391, "message": "No tiene nada de malo (tiene mucho de bueno XD). Pero siendo sinceros y realistas, no todos en este grupo van a poder levantar 1 millón de dólares como Onswipe por lo que es importante poner las expectativas en su lugar. Bootstrapping es el mejor cámino para el 90% hasta que deje de serlo.", "group_id": 965, "id": 460730}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301336909.675477, "message": "Por cierto, onSwipe no es bootstrapped y no tiene nada de malo :P", "group_id": 965, "id": 460683}, {"user_id": 26088, "stars": [], "topic_id": 15815, "date_created": 1301337925.119138, "message": "@cesarsalazar que es un Series A?", "group_id": 965, "id": 460822}, {"user_id": 26088, "stars": [], "topic_id": 15815, "date_created": 1301339119.094877, "message": "@cesarsalazar cool thx :)", "group_id": 965, "id": 461013}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301337470.241442, "message": "Difiero. La mayoría puede levantar 1M, pero deben entender las consideraciones. Hay que recordar que onSwipe no levantó dinero hasta que no tuvo un prototipo sólido e incluso usuarios. Eso es algo que todos deben estar conscientes. Hoy en día, a menos de que te llames Color.com, olvídate de levantar más de 1M sin MVP e usuarios.", "group_id": 965, "id": 460773}, {"user_id": 24160, "stars": [{"date_created": 1301337731.7573271, "user_id": 26089}], "topic_id": 15815, "date_created": 1301337663.652684, "message": "Sin embargo, pueden acceder de manera bastante real a capital como el de http://mexican.vc (comercial descarado). Nosotros evaluamos al equipo y a su prototipo y modelo de negocios como reflejo de la capacidad del equipo. Les podemos ayudar con capital semilla a renunciar a sus trabajo y vivir de manera básica por 4-6 meses para que empiecen a generar tracción y encuentren su product-market fit. Si necesitan capital adicional y han demostrado potencial y eficiencia, podemos invertir más. Una vez que llegan a mostrar un poco de tracción y tienen un product-market fit, están en condiciones plenas de recibir un Series A si así lo desean, o apalancar el negocio con ingresos sobre ventas si eso es lo que consideran más saludable para el negocio.", "group_id": 965, "id": 460796}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301337889.0848539, "message": "@Sinue No podría estar más de acuerdo.", "group_id": 965, "id": 460819}, {"user_id": 20022, "stars": [], "topic_id": 15815, "date_created": 1301337855.719497, "message": "Al levantar capital soy de los que opina que debe de hacerse cuando no se necesita .... es decir levantar capital debe ser para escalar una idea la cual ya sabes que funciona. Levantar 1 Millon de dolares es relativamente facil, el problema es regresarlo al menos duplicado.  Es muy comun ver startups que ven el levantar capital como el fin y no como el medio.", "group_id": 965, "id": 460814}, {"user_id": 2946, "stars": [], "topic_id": 15815, "date_created": 1301337924.3835759, "message": "Yo soy de los que opina que están equivocados :P", "group_id": 965, "id": 460821}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301337975.3342781, "message": "@soska No entiendo. Platícanos por qué?", "group_id": 965, "id": 460829}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301338318.8878429, "message": "Pueden darse una idea del capital requerido por varias startups que conocen si se sumergen un rato en http://crunchbase.com y revisan para cada startup en cuestión, la sección que dice Funding (columna izquierda)", "group_id": 965, "id": 460889}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301338239.586159, "message": "@keoz Series A se le llama a la primera ronda de financiamiento institucional que recibe una empresa. Es cuando se emite la primera serie de acciones, de ahí el nombre. Un Series A en Silicon Valley es una inversión típicamente de entre 3 y 6 millones de USD a cambio de un 20%-40% de la empresa. Aunque las hay más bajas y mucho más altas. Hoy en día, para levantar un Series A es muy común que se requiera que la empresa tenga usuarios reales (y muchos de ellos), que validen la necesidad del producto y un modelo de negocio sólido que pueda demostrar que la empresa puede generar retornos de 10 veces la inversión (o 100 millones de dólares en ventas anuales) en 3 o 5 años.", "group_id": 965, "id": 460875}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301338596.3721311, "message": "Pocas, hasta ahora no había existido la noción de que esto era posible. Las cosas están cambiando. Una que se me ocurre rápido es JackBe", "group_id": 965, "id": 460943}, {"user_id": 26089, "stars": [], "topic_id": 15815, "date_created": 1301338528.409368, "message": "@cesarsalazar, ¿cuántas empresas de mexicanos conoces que hayan caminado exitosamente por ese camino de fondeo ?", "group_id": 965, "id": 460935}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301339824.5298929, "message": "Con respecto a levantar capital cuando no lo necesitas, creo que está mejor estipulada la frase como \"Levantar capital antes de que se te acabe el capital que tienes para operar actualmente\". No hay nada más estresante y que te ponga en una posición más comprometedora que estar levantando capital cuando la cuenta de banco está en ceros. Sin embargo, tampoco es una buena idea levantar capital que no vas a necesitar. Sólo vas tener a los inversionistas encima tratando de que generes retornos que son inalcanzables.", "group_id": 965, "id": 461110}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301339668.5042479, "message": "@Sinue: Nota: La parte de no podría estar más de acuerdo se refiere a: \"Levantar 1 Millon de dolares es relativamente facil, el problema es regresarlo al menos duplicado. Es muy común ver startups que ven el levantar capital como el fin y no como el medio.\"", "group_id": 965, "id": 461090}, {"user_id": 26085, "stars": [{"date_created": 1301368657.2707701, "user_id": 10406}], "topic_id": 15815, "date_created": 1301362815.917882, "message": "Solo por remarcar... tiene que ver con las necesidades del producto y el tamaño y dinamica del mercado que estas atacando.", "group_id": 965, "id": 464084}, {"user_id": 24160, "stars": [], "topic_id": 15815, "date_created": 1301362822.263123, "message": "@Jorge_Madrigal Cierto!", "group_id": 965, "id": 464086}, {"user_id": 26085, "stars": [], "topic_id": 15815, "date_created": 1301362743.027389, "message": "Gente, todo tiene que ver con lo que queremos hacer. Si queremos hacer un FEDEX mexicano vamos a necesitar VC y especularemos que habría un mercado de minimo 50 millones de personas que van a comenzar a comprar como locos en linea y demas. Un FEDEX no se puede bootstraear por el costo de la infraestructura. Por otro lado, si queremos hacerle un app para BB a Sección Amarilla... ni buscar capital. Si quieres hacer un twitter o algo asi con un mercado de billones, entonces bootstrapeas hasta tener el MVP y despues buscas VC para escalar y comerte el super mercado que estas atacando. Saludos.", "group_id": 965, "id": 464077}, {"user_id": 26085, "stars": [], "topic_id": 15815, "date_created": 1301377597.0930059, "message": "@soska al menos en mi opinion el VC no es para todos. Repito, tiene que ver con las necesidades del producto y el tamaño y dinámica del mercado que estas atacando. Es para apuestas a mercados grandes.", "group_id": 965, "id": 466590}, {"user_id": 2946, "stars": [], "topic_id": 15815, "date_created": 1301376742.7379241, "message": "Entonces el consenso es que el VC no es para todos? En el mundo hay Twitters y Facebooks igual que 37Signals y WooThemes.", "group_id": 965, "id": 466541}, {"user_id": 3084, "stars": [], "topic_id": 15815, "date_created": 1301430164.357635, "message": "Existe como limitante para hacer comparaciones válidas entre estos dos modelos de financiamiento el hecho de que las compañías que han hecho bootstrapping como 37signals no informan mucho sobre sus finanzas por lo que no se sabe bien si se están comparando manzanas con manzanas.", "group_id": 965, "id": 472140}]