[{"user_id": 7664, "stars": [], "topic_id": 33903, "date_created": 1304629038.8851459, "message": "Has anyone used the Build Character aspect of DP with any success? \n\nI'm going into draft 3, and am focusing on beefing up my characters.", "group_id": 2515, "id": 934426}, {"user_id": 7645, "stars": [], "topic_id": 33903, "date_created": 1304629955.0231061, "message": "I used to completely fill the whole thing out, but then I came to realize that I usually ended up forgetting most, if not all, of the assignments and just went with what naturally came to me. Now, I try and make sure I know who has what under Motivation, and maybe a bit of Purpose and Methodology.  Not saying this is the best practice, btw, just my own experience", "group_id": 2515, "id": 934650}, {"user_id": 7664, "stars": [], "topic_id": 33903, "date_created": 1304630325.3805699, "message": "I'm not sure there is a \"best practice\" except whatever gets you to the end result of a finished, kick-ass product.", "group_id": 2515, "id": 934715}, {"user_id": 13650, "stars": [], "topic_id": 33903, "date_created": 1304691676.779057, "message": "Definer success<g> I've used it. It brought to light a few \"traits\" that might have taken a few more drafts to discover.", "group_id": 2515, "id": 942397}, {"user_id": 7669, "stars": [], "topic_id": 33903, "date_created": 1304752047.6249981, "message": "I agree with Jim -- for most people, just dealing with the Motivation elements is enough to recognize where you have gaps, or duplications.  And to that extent, Mike, yes, I've used it and helped others use it often, to great success.  Usually we start with Archetypes, and then we start breaking up those Archetypes into more complex arrangements, as appropriate to the story.", "group_id": 2515, "id": 949317}, {"user_id": 7664, "stars": [], "topic_id": 33903, "date_created": 1304776932.2640581, "message": "Ah... starting with archetypes is a very good idea. I've avoided that since my characters are complex... but I see the wisdom in what you're doing...", "group_id": 2515, "id": 950987}]