[{"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308067590.2753451, "message": "La esencia de MNPP es permitir a cualquier persona hacer web con 2 de los lenguajes mas populares, por ahora estoy sobre ec2 para integrarlo sobre MNPP y desde el desktop hacer el deploy.  ¿Cuanto pagarian? ¿Que opinan?", "group_id": 965, "id": 1392058}, {"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308069197.8024299, "message": "@wtrevino por ahora si, estoy enfocado sobre ec2", "group_id": 965, "id": 1392252}, {"user_id": 35932, "stars": [], "topic_id": 39340, "date_created": 1308068960.605624, "message": "Sólo haría deploys en ec2?", "group_id": 965, "id": 1392211}, {"user_id": 35932, "stars": [{"date_created": 1308070439.134469, "user_id": 20146}], "topic_id": 39340, "date_created": 1308070309.17588, "message": "La verdad no sabía acerca de MNPP, recién acabo de googlearlos :) me parece una buena opción. No sería mejor ofrecer un servicio de hosting basado en EC2 donde se pueda fácilmente hacer deployments de aplicaciones hechas con MNPP?", "group_id": 965, "id": 1392366}, {"user_id": 20146, "stars": [], "topic_id": 39340, "date_created": 1308070696.150286, "message": "Si creo que un servicio de Hosting seria bueno opción,creo que seria buena opción para expandir tu mercado potencial, en espacial para captar los que no usamos MAC y tambien desarrollamos web(me imagino no somos pocos).", "group_id": 965, "id": 1392403}, {"user_id": 2946, "stars": [{"date_created": 1308098331.1198421, "user_id": 6541}], "topic_id": 39340, "date_created": 1308075373.5626891, "message": "mmm suena muy interesante. Si fuera solo deployment a mis propios servidores quizá pagaría US$29 a lo mucho (yo soy muy codo, igual no soy un buen sample). Pero si pudieras integrar lo del cloud hosting, entonces sería súper interesante por que además tendrías recurrent revenue, facilmente pagaría $50 al mes por una instancia decente. Hay quienes pagarían mucho más.", "group_id": 965, "id": 1392849}, {"user_id": 12739, "stars": [{"date_created": 1308098417.5954909, "user_id": 6541}], "topic_id": 39340, "date_created": 1308091156.819556, "message": "No me quedo muy claro que propones..\n\n1) ¿Una aplicación de escritorio que hace deployment a MIS instancias de EC2?\n2) O ¿un PaaS que funcione en EC2 y maneje toda la plataforma por mi (como dotcloud)?", "group_id": 965, "id": 1395198}, {"user_id": 2946, "stars": [], "topic_id": 39340, "date_created": 1308092421.986726, "message": "@pablasso creo que el propone el 1, yo le digo que el 2 integrado a MNPP sería una killer idea.", "group_id": 965, "id": 1395384}, {"user_id": 20521, "stars": [], "topic_id": 39340, "date_created": 1308096388.024328, "message": "Lo mismo pienso, un PaaS o un servicio de hosting asociado y con un click ya subir todo. Aun que igual la primera opción es posible pero creo que la segunda es mas vendible.", "group_id": 965, "id": 1395950}, {"user_id": 12739, "stars": [{"date_created": 1308098362.5538089, "user_id": 6541}], "topic_id": 39340, "date_created": 1308098263.734035, "message": "@soska eh, me agrada esa idea. Amo que dotcloud lo hace muy sencillo del lado del server. Ahora si me replicara eso también en local sería aún mejor. Nuevo negocio @jyr!", "group_id": 965, "id": 1396248}, {"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308098184.6639781, "message": "Propongo la primera, crear 2 imagenes con lo mismo que tiene MNPP en el desktop pero una por lenguaje y facilitarle el deploy al usuario desde el GUI", "group_id": 965, "id": 1396239}, {"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308099911.874193, "message": "Se me paso comentar que no quiero que el usuario se case con un solo proveedor de hosting en la nube sino que tenga al menos un par de alternativas desde el GUI, suena muy ambicioso y solo quiero crear el GUI para los servicios tipo dotcloud, epio, etc que ofrecen el deploy por medio de comandos desde la terminal. Para el caso de ec2 que no ofrece lo anterior entonces crear 2 imagenes (php o python) y usando git  el usuario haga el deploy. Ahora para lo del PaaS implica más trabajo y necesitaria minimo otro par de manos para hacerlo, aunque por ese lado es por donde va dirigido MNPP hacer que el usuario solo se dedique a programar. La opcion de trabajar con ec2 es para abarcar con un mercado grande.", "group_id": 965, "id": 1396471}, {"user_id": 12739, "stars": [], "topic_id": 39340, "date_created": 1308111385.1077499, "message": "Hablando de los precios, si suelo comprar software indie, normalmente que no pase de $40 usd. Por esto IMHO unos $25.", "group_id": 965, "id": 1397620}, {"user_id": 9432, "stars": [], "topic_id": 39340, "date_created": 1308114930.1718841, "message": "o sea es cómo el cliente de deployment de appengine pero en cualquier servidor? viene con servidor integrado para pruebas locales?", "group_id": 965, "id": 1397917}, {"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308116231.7839379, "message": "@kakler no conozco el cliente de gae, pero mnpp viene con nginx, percona, php o python segun lo que ocupes para hacer web desde el desktop", "group_id": 965, "id": 1398055}, {"user_id": 20022, "stars": [{"date_created": 1308157804.47243, "user_id": 6541}], "topic_id": 39340, "date_created": 1308152239.6200809, "message": "jair el software lo puedes dar muy barato inclusive gratuito  porque si usas modelos de negocio como el que usa engineyard,  en el que las instancias tunneadas tienen un costo por hora de ahi puede provenir tu ingreso , entre mas gente tenga mnpp en su escritorio es mejor , una vez instalado y de manera persuasiva mas gente le dará click al boton de deploy en la nube y de ahi es donde comienzas a imprimir billetes. el ingreso de vender MNPP es por una sola vez,  de que usen tus AMIS es por hora, y es relativamente facil montar un esquema de negocio como este, por la facilidad de crear las amis, en promedio engyneyard cobra como a 30centavos la hora .. CHA CHING $_$", "group_id": 965, "id": 1401679}, {"user_id": 20022, "stars": [{"date_created": 1308157806.701597, "user_id": 6541}], "topic_id": 39340, "date_created": 1308152946.2054379, "message": "para que te des una idea una instancia micro si comparas lo que cuesta en ec2 vs engineyard te da aprox un ingreso de 50 Centavos de peso por hora  en una micro por instancia es una ganancia de 300 pesos aprox mensuales por instancia. mejor que un solo pago de 400 por tener MNPP en mi escritorio.", "group_id": 965, "id": 1401798}, {"user_id": 13545, "stars": [], "topic_id": 39340, "date_created": 1308157350.8731501, "message": "Yo concuerdo con los que sugieren ofrecer el servicio de hosting. Yo no uso PHP ni Python, pero estoy seguro que Capistrano podría manejar el deployment de ambos, así que en lo personal, no pagaria por una herramienta así, a menos que ofrezca ventajas que no estoy viendo.", "group_id": 965, "id": 1402413}, {"user_id": 6541, "stars": [], "topic_id": 39340, "date_created": 1308158269.7366171, "message": "@sinue lo que no quiero es crear un PaaS ahora mis funciones son más de programador, pero lo del hosting si lo estoy viendo como opcion creando  imagen por lenguaje, si tienes oportunidad de platicar por skype estare conectado.", "group_id": 965, "id": 1402498}]