[{"user_id": 3135, "stars": [], "topic_id": 12946, "date_created": 1300090645.0029271, "message": "(Sincere question, not a troll at all). This was the first year PyCon was on my radar, so apologies if this has been hashed out: Is PyCon US always overlapping/the week before SXSWi?", "group_id": 373, "id": 345609}, {"user_id": 1736, "stars": [], "topic_id": 12946, "date_created": 1300108058.5138271, "message": "@thesethings No (we also overlapped PAX East this year too oddly enough).", "group_id": 373, "id": 347022}, {"user_id": 1736, "stars": [], "topic_id": 12946, "date_created": 1300108102.900346, "message": "The dates for each conference are picked long before they are made public, and unfortunately there isn't much we can do about conflicts once we learn of them.", "group_id": 373, "id": 347034}, {"user_id": 1152, "stars": [{"date_created": 1300115897.4605031, "user_id": 1736}, {"date_created": 1300166947.158519, "user_id": 1886}], "topic_id": 12946, "date_created": 1300111076.2446561, "message": "We announced our dates well ahead of sxsw", "group_id": 373, "id": 347435}, {"user_id": 10411, "stars": [], "topic_id": 12946, "date_created": 1300119247.554595, "message": "@jessenoller It should be noted that SXSW dates are always keyed to UT Austin's spring break.  The academic calendar is out pretty far in advance.\n\nWhat I think was unexpected was for people to actually care about SXSWi...", "group_id": 373, "id": 348777}, {"user_id": 8649, "stars": [{"date_created": 1300159324.5733311, "user_id": 18843}], "topic_id": 12946, "date_created": 1300121865.3795049, "message": "For the record, the SciPy conference is out in Austin again this year, and we hope to make it a \"bigger tent\" than in previous years.  The downside is that there will be fewer hipsters and social media marketing lean startup rock stars in town, but on the bright side, the college kids on 6th street will be wearing relatively less clothing since July is warmer than March.  SEO or daisy dukes - your call.", "group_id": 373, "id": 349096}, {"user_id": 1152, "stars": [], "topic_id": 12946, "date_created": 1300133867.6697609, "message": "As I don't see us as being in direct competition to SXSW, I don't think I am going to be worrying about it, esp. as we have locked in a contract with the next two years venue-wise.", "group_id": 373, "id": 350580}, {"user_id": 3135, "stars": [], "topic_id": 12946, "date_created": 1300137299.0179319, "message": "I fully concede that I am interested in both events, and I know lots of other Python folks that are, too. I think SXSWi has business networking element that applies to many Python folks who are also startup folks. I've never been to either event, but I'd like to go to both next year. This thread is helping me see that  *many* conferences are probably scheduling themselves relative to springbreak, and this is what creates the total conference overlap insanity that started last week (drupalcon/pycon/confoo/sxswi/and then some).", "group_id": 373, "id": 351216}, {"user_id": 1152, "stars": [], "topic_id": 12946, "date_created": 1300139703.0722001, "message": "Actually, spring break never came into my mind when setting the schedule :)", "group_id": 373, "id": 351388}, {"user_id": 8649, "stars": [], "topic_id": 12946, "date_created": 1300155256.818923, "message": "I brought up the \"SXSW conflict\" thing up with VanL when he stopped by the Enthought booth, and he didn't think it was much of an issue either.  However, I have heard from more than one person that they are conflicted between the two, and some of them chose SXSW this year.", "group_id": 373, "id": 352871}, {"user_id": 1152, "stars": [{"date_created": 1300155348.811687, "user_id": 1}, {"date_created": 1300155442.53808, "user_id": 1979}, {"date_created": 1300160166.695914, "user_id": 1930}, {"date_created": 1300166995.2935281, "user_id": 1886}, {"date_created": 1300195308.960938, "user_id": 1760}], "topic_id": 12946, "date_created": 1300155339.3313839, "message": "Yup, it's non zero on conflict, but we still managed record attendance and sponsorship, so I think it works out", "group_id": 373, "id": 352881}, {"user_id": 3354, "stars": [], "topic_id": 12946, "date_created": 1300176197.3578279, "message": "It's unfortunate that people have to choose, but scheduling conflicts are only one relatively small aspect of venue choice.", "group_id": 373, "id": 353905}]