[{"user_id": 12675, "stars": [], "topic_id": 33593, "date_created": 1304497171.076364, "message": "I've always wanted to develop a \"social\" site, and Revview is my first attempt at doing it. Let me know what you guys think!", "group_id": 95, "id": 910423}, {"user_id": 12675, "stars": [], "topic_id": 33593, "date_created": 1304497125.804723, "message": "Revview (http://revview.in) is a social networking service that lets you post movie reviews in a simple way. You can also plan to see movies with your friends and followers. It's a Twitter+Flixster kind of thing. Revview is heavily integrated with Twitter and Rottentomatoes API.", "group_id": 95, "id": 910414}, {"user_id": 12675, "stars": [], "topic_id": 33593, "date_created": 1304498193.2540059, "message": "Here's my profile: http://revview.in/izadcmuda", "group_id": 95, "id": 910627}, {"user_id": 5136, "stars": [], "topic_id": 33593, "date_created": 1304504232.7577989, "message": "I love that product! Is what I'm looking for 2 years! But here what I really want from that produt:\na) share on twitter should be optional (I want to add a lot of films and it can become noisy)\nb) I want the \"Watched\" and the \"Planned\" divided lists (like in Anobii, with my Shelf and my Whislist)\nc) I want to plan to see a lot of film in the future (specially when they'll become available in dvd), but I don't know when and where. So, when and where should be optional\nd) in the future a simple iphone app will be great ;)", "group_id": 95, "id": 911489}, {"user_id": 3444, "stars": [], "topic_id": 33593, "date_created": 1304516593.3532529, "message": "Pretty cool site actually, very simple to use / clean interface. I agree about being about having two lists for movies you plan to watch and reviews.\n\nI would change the way the \"Plan to Watch\" thing works. The date selection is good, but the time isn't super intuitive if you don't know your military time. Also, if I enter an address it should show a map of where I plan to see it or something?", "group_id": 95, "id": 912925}]