[{"user_id": 11626, "stars": [], "topic_id": 7382, "date_created": 1298076575.1589899, "message": "http://www.onntv.com/wwwexportcontent/sites/10tv/onnnews/stories/2011/02/17/image_statehouse_protests_280.jpg\r\n\r\nCOLUMBUS, Ohio — Testimony Thursday over Senate Bill 5, that would end collective bargaining in Ohio, erupted into one of the largest protests in Ohio's history.\r\n\r\nAt stake for Republicans is their effort to overturn 30 years of collective bargaining laws. Union members and Democrats believe this is a bad idea.\r\n\r\nEvery corner inside the statehouse was packed, mainly with union members and supporters wearing \"No On SB5\" shirts, reported ONN's Jim Heath.\r\n\r\nThe overflow crowd spilled outside to the statehouse lawn.\r\n\r\nFormer Gov. Ted Strickland returned to the statehouse for the first time since leaving office.\r\n\r\n\"This is the voice of the people expressing itself; public employees, firefighters, police officers who did not cause this budget crisis,\" said Strickland.\r\n\r\nOhio's Republican Attorney General Mike DeWine said the state does have the right to revisit a law that's 30 years old.\r\n\r\n\"The state has the right to get rid of it. I think the issue has been misunderstood. You do have contracts that are not just about money, they're contracts about how you can move people around, how you can get the job done,\" said Dewine.\r\n\r\nSome Tea Party supporters were on hand to offer support for the bill, but they were quickly consumed by union members who were not interested in debating the issue.\r\n\r\n\"I think the bill is a good thing. It has to be passed because Ohio cannot afford the things being promised to these unfortunate workers,\" said one Tea Party member.\r\n\r\nUnion members said that the 476 page bill will lead to lower wages and less benefits.\r\n\r\n\"We feel it's detremental to us. We make sacrifices. We've taken pay freezes for the last three years. We've taken unpaid holidays. We're sharing a bigger burden with our health care,\" said a pro-union protestor.\r\n\r\nEven though thousands protested against this bill, there is a political reality.\r\n\r\nRepublicans now control the governors office, senate and house, and if they stick together, Senate Bill 5 will become law.\r\n\r\nhttp://www.onntv.com/live/content/onnnews/stories/2011/02/17/story_statehouse_protests.html?sid=102", "group_id": 3920, "id": 147880}]