[{"user_id": 37586, "stars": [], "topic_id": 46446, "date_created": 1318393388.6727431, "message": "The Overall Story is about a mentor who seeks redemption for his family. His favorite group has come back to help him produce the art that he hopes will do it.  The main character seeks redemption for selling out and hurting someone he loved.  Do you have any suggestions as to how this theme interprets into Dramatica?", "group_id": 2515, "id": 2330152}, {"user_id": 37586, "stars": [], "topic_id": 46446, "date_created": 1318400574.697989, "message": "I also posted this question on google + and the format works well there.  I may stop posting here.", "group_id": 2515, "id": 2330789}, {"user_id": 36525, "stars": [], "topic_id": 46446, "date_created": 1318401150.871521, "message": "Sounds like a Big 4 Type #3.  That means Goal, Consequence, Cost, and Dividend are going to be from the set: Understanding, Developing a Plan, Past, Memories.  The art they are trying to produce could be Evidence or Truth.", "group_id": 2515, "id": 2330826}, {"user_id": 37586, "stars": [], "topic_id": 46446, "date_created": 1318419362.8688159, "message": "@sunandshadow wow, can u tell me the process u used to come up with that?", "group_id": 2515, "id": 2331700}, {"user_id": 7664, "stars": [], "topic_id": 46446, "date_created": 1318446992.5858531, "message": "She's looking at the Goal, Consequence, Dividends and Cost. They always come from the same corner of the Type Layer, but can be arranged in different ways.", "group_id": 2515, "id": 2333914}, {"user_id": 36525, "stars": [], "topic_id": 46446, "date_created": 1318453290.8399429, "message": "There's a second page of this chart showing how each of the Big 4 categories has 4 subtypes: http://www.dramatica.com/downloads/BigFour2Large.png", "group_id": 2515, "id": 2334506}, {"user_id": 36525, "stars": [], "topic_id": 46446, "date_created": 1318453138.9437909, "message": "Yeah, the storyforms in Dramatica sort naturally into four categories.  I decided to call these the Big 4 just to have a name for them.  Each of these categories has a set of four terms from which the Goal, Consequence, Dividends, and Cost must be chosen.  Each category has its own set of these four terms, there is no overlap.  Your description emphasized a past crime and memories of the hurt it caused; Past and Memories are in the category I labeled #3, the blue parts of this chart: http://www.dramatica.com/downloads/BigFourLarge.png", "group_id": 2515, "id": 2334483}]