[{"user_id": 13817, "stars": [], "topic_id": 41118, "date_created": 1309793038.402236, "message": "Seems that there is a lot of concern about the fighting caused by faith sharing and we need to somehow mitigate that issue. Make sure we're as nice as possible and let the Holy Spirit do His work.", "group_id": 9787, "id": 1560334}, {"user_id": 13817, "stars": [], "topic_id": 41118, "date_created": 1309792952.619719, "message": "I just read this article http://af.reuters.com/article/sierraLeoneNews/idAFLDE75R1L320110628?sp=true about the World Council of Churches, the Vatican and the World Evangelical Alliance drafting a rule book for Christians and how their faith should be shared. Not sure where to find the actual book to give it a look through.", "group_id": 9787, "id": 1560316}, {"user_id": 32900, "stars": [], "topic_id": 41118, "date_created": 1309802887.870189, "message": "meh", "group_id": 9787, "id": 1561282}, {"user_id": 32900, "stars": [], "topic_id": 41118, "date_created": 1309812385.532903, "message": "Our modern church likes to make rules and formulas", "group_id": 9787, "id": 1561881}, {"user_id": 13817, "stars": [], "topic_id": 41118, "date_created": 1309842140.7367489, "message": "@pevans_om Seems to me Paul made a lot of rules for conducting yourself in church. I don't think rules are bad. It all depends on the rule and what it's trying to accomplish. From just this article, I'd say it's rubbish. Then again I'm not in a country full of violence on these issues.\n\nWhat I understood in reading it was that the rule book writers say, \"it's the Holy Spirits work to convert\" and that we should not get up in people's faces about our worldview. That seems super wrong to me. Maybe because I like to get up in peoples faces or maybe (and I hope this is the truth) I am concerned about where people stand in their worldview.", "group_id": 9787, "id": 1565034}, {"user_id": 32900, "stars": [], "topic_id": 41118, "date_created": 1309860509.247757, "message": "@penkin I don't think Paul made a lot of rules in the same sense. He encouraged people with useful instruction on behaviour. nothing wrong with that. But if you look at his letters He applied 'rules' according to circumstance. I don't believe they're a blanket instruction, except where it comes to showing Love and Grace to one another\n\nAnd in any large organization some degree of rules are important. As for this specific news item. It's the first I've even heard of it and there is no telling what the content of the book actually is, short of getting a copy for ourselves.\n\nWhat I know: Many Christians take a very aggressive stance towards especially Muslims in their evangelism. This often does more to harm the message than it does good. Because they leave Love and Grace behind. I can't comment on the content of a book know one has even heard of before. \n\nI'm impressed that all those people could actually agree on something", "group_id": 9787, "id": 1566066}, {"user_id": 13817, "stars": [], "topic_id": 41118, "date_created": 1309939881.079242, "message": "@LintonCaldecott yes.", "group_id": 9787, "id": 1573976}, {"user_id": 32888, "stars": [], "topic_id": 41118, "date_created": 1309939070.790617, "message": "they have agreed to draft something... wait till the meetings on what the rules should be. collaboration OVER!", "group_id": 9787, "id": 1573946}, {"user_id": 32888, "stars": [], "topic_id": 41118, "date_created": 1309939780.851759, "message": "oh, it's already released.", "group_id": 9787, "id": 1573973}]