[{"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1298223210.2366979, "message": "Les bonnes raisons : il fait un état de ce qui existe actuellement, avec des explications claires. Il explique ce qui pose problème (complexité, regressivité de l'impôt pour les hauts revenus) et apporte des solutions.", "group_id": 4673, "id": 154233}, {"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1298223244.219779, "message": "Même si on est pas d'accord avec les solutions proposées, rien que le panorama de ce qui existe aujourd'hui a un intérêt.", "group_id": 4673, "id": 154235}, {"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1300446853.6132679, "message": "le livre étant destiné au citoyen plus qu'au politique (qui a probablement peu d'intérêts à ce que ça bouge) j'aurais tendance à dire qu'il faut faire connaître ce livre pour essayer de faire bouger les choses (je suis peut-être utopiste...), c'est ce que je n'arrête pas de faire depuis que je l'ai lu :)", "group_id": 4673, "id": 381210}, {"user_id": 14031, "stars": [], "topic_id": 7674, "date_created": 1300445592.854691, "message": "Ce que j'ai trouvé instructif au-delà du livre, c'est la réaction de la classe politique: les auteurs sont proches du PS mais aucun écho chez eux alors que D. de Villepin s'en inspire ouvertement (sans doute plus pour exister médiatiquement que vraiment pour appliquer ces réformes mais bon)", "group_id": 4673, "id": 381099}, {"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1300446756.2070079, "message": "ouais clairement ça n'a pas fait le buzz que je pensais que ça ferait, et le PS n'en parle même pas (tiens je devrais aller voir la permanence pour les cantonales en bas de chez moi)...", "group_id": 4673, "id": 381189}, {"user_id": 14031, "stars": [], "topic_id": 7674, "date_created": 1300447697.5350151, "message": "et ça se voit :) Dans leur interview (sur le Monde ?  je ne sais plus) les auteurs disaient qu'ils avaient écrits le livre après s'être rendu compte que ça ne bougerait pas côté politique. Donc tu as tout bon !", "group_id": 4673, "id": 381304}, {"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1300461076.963403, "message": "par contre, on m'a fait remarquer sur twitter que le site web associé avait une charte graphique radicale et c'est possible que du coup ça décourage/rebute certains lecteurs potentiels, c'est con je trouve le livre n'étant lui pas vraiment radical", "group_id": 4673, "id": 382670}, {"user_id": 14057, "stars": [], "topic_id": 7674, "date_created": 1300460709.989737, "message": "eheh j'ai tout bon, si vraiment tout le monde le lit et mets la pression, sinon on sera tous perdants...", "group_id": 4673, "id": 382638}]