[{"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304531696.3292921, "message": "I just watched District 9 (if you've never seen it, it's great). \n\nIt seems to be loaded up with protagonists and or contagonists, so I'm looking forward to diving into it and sorting it all out. Let me know if you want to join.", "group_id": 2515, "id": 916695}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304532200.9932489, "message": "I'm in. Are you thinking there is more than one protagonist and/or contagonist?", "group_id": 2515, "id": 916834}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304532240.52403, "message": "I haven't \"officially\" started unravelling it, but yes.", "group_id": 2515, "id": 916857}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304532325.3093669, "message": "Interesting, I'd have to think about that.", "group_id": 2515, "id": 916896}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304533296.2481411, "message": "Great, let's see who else is interested then.\n\nFYI, it's currently streaming on Netflix, but that ends TOMORROW.", "group_id": 2515, "id": 917171}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304540844.8535309, "message": "I'm in. Looks like my kind of film. And I need all the Dramatica practice I can get. Will watch it later or tomorrow.", "group_id": 2515, "id": 919408}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304543567.7625771, "message": "Great.", "group_id": 2515, "id": 919937}, {"user_id": 7712, "stars": [], "topic_id": 33674, "date_created": 1304567142.051914, "message": "At last, you've proposed a movie I've seen a few times.", "group_id": 2515, "id": 923967}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304567570.5183749, "message": "I was going to recommend \"Ladrón que roba a Ladrón\" just to be annoying.", "group_id": 2515, "id": 924014}, {"user_id": 7712, "stars": [], "topic_id": 33674, "date_created": 1304568493.478049, "message": "There are two distinct storylines that compose the overall story. 1) Wikus Van De Merwe's journey as he begins to evict the aliens and becomes infected with a virus that transforms into one, and 2) Christopher, an alien Prawn, who, with the assistance of his son, seek to return to the ship so that they may return to their homeworld and save those trapped on Earth. Wikus is the protagonist of the Human storyline, Christopher the protagonist of the Alien Prawn storyline, and I'll initially suggest that Wikus is the Main Character of this story, whose role is passed on to Christopher (once Christopher is on the ship and promises to return in two years).", "group_id": 2515, "id": 924122}, {"user_id": 7712, "stars": [], "topic_id": 33674, "date_created": 1304569568.1970661, "message": "The antagonist role seems to have a similar level of complexity. The human storyline antagonist is probably the agency MNU and Ventor (the soldier who captures Wikus), while the alien storyline antagonist is probably Obesandjo, the Nigerian leader who believes eating alien bodyparts will give him special powers.", "group_id": 2515, "id": 924361}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304569871.3416951, "message": "@Buck If you don't mind, I'm not even going to read your comment until Mikeaja has a chance to watch the movie so we can all proceed together.", "group_id": 2515, "id": 924399}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304619609.2476931, "message": "I would be careful using proper names to identify the Overall Story Throughline. It often brings into play personal issues that don't necessarily affect everyone in the story. Looking at their objective character roles instead (the alien, the soldier, the bureaucrat, the alien child, the warlord, the MNU director, the eviction trainee) tends to make the process of identifying the problem affecting EVERYONE in the story a little easier.", "group_id": 2515, "id": 932551}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304620322.1521521, "message": "That's why I refer to Chris as The Overlord and Melanie as The Overlordess when talking about their objective relationship to Dramatica.", "group_id": 2515, "id": 932701}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304691560.720336, "message": "Just finished watching. What a bizarre film! I would have certainly put Wikus as the MC, from beginning to end. Good tip Jim, never occurred to me before - it is easier when not using names. I'm not sure who the protagonist type character is. What is the story goal? Peaceful co-existence with the aliens? If the alien is the protagonist, the story goal is 'getting to the mother ship' I guess.", "group_id": 2515, "id": 942384}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304691791.775085, "message": "To add, for me it wasn't really 2 distinct storylines, as I saw the aliens goal as being a sub-plot. Although from that is from the audience perspective. From the authors perspective (so Drams) I guess it was from the start. For me the soldier was the antagonist. The warlord didn't appear to stand in the way of achieving the goal.", "group_id": 2515, "id": 942418}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304699318.248076, "message": "So, any thoughts on the overall story goal Jim? It seems to me to be a changing one; initially was to evict the Aliens, then turned into saving himself, then into getting to the mother ship. In the end, the protagonist failed on all of those, except he helped the Alien get to the ship.", "group_id": 2515, "id": 943831}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304699059.7781439, "message": "If anything, the warlord is a down-the-line Contagonist.", "group_id": 2515, "id": 943764}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304703144.273746, "message": "@Mikeaja no it doesn't, but that's a cool idea", "group_id": 2515, "id": 944284}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304700992.943383, "message": "I would think the Overall Story throughline has something to do with alien relocation.", "group_id": 2515, "id": 944063}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304703268.4454789, "message": "@MikeDerk I forgot how the movie ends specifically, don't they end up getting relocated?", "group_id": 2515, "id": 944299}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703373.45084, "message": "@Mikeaja good point. Protagonist is Johannasburg?", "group_id": 2515, "id": 944318}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304703222.3038781, "message": "Can you PM me the other system you have in mind? I think I'll keep the conversation here", "group_id": 2515, "id": 944294}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304704779.7742071, "message": "Wikus as MC doesn't want the weapons. Wikus as MNU employee is following orders and might not know the OS Goal.", "group_id": 2515, "id": 944492}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304702836.236423, "message": "I'm going to join in, but I'm a bit hobbled today... Only have my phone.", "group_id": 2515, "id": 944239}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703114.7800381, "message": "Protag: MNU head, and maybe the alien of his own subplot.", "group_id": 2515, "id": 944278}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304703253.1408689, "message": "I don't see how the protagonist is MNU head. He seems more concerned with experimenting - the relocation for him I would imagine is just political.", "group_id": 2515, "id": 944295}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304702422.8192041, "message": "What would be cool would a shared document facility, like a wiki-style, that we could build / contribute to with a basic storyform. Can convore do that?", "group_id": 2515, "id": 944194}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304703201.3471711, "message": "@Jim,  well..... if you wanted to change system.... you could have it! But I like the messaging here. It's easy to read.", "group_id": 2515, "id": 944292}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703318.8840661, "message": "@jimhull they end up relocated. All off screen.", "group_id": 2515, "id": 944306}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703038.262224, "message": "The OS Goal possibilities for me are: alien relocation, although this is dropped. Gaining mastery over alien weapons, something MNU and Warlord want; even the alien wants that: he just needs the fluid.", "group_id": 2515, "id": 944267}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703161.0905621, "message": "But, who are the antagonists then?", "group_id": 2515, "id": 944286}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304704988.7663479, "message": "I thought all the OS characters shared the goal?", "group_id": 2515, "id": 944536}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703291.393481, "message": "MC: Wikus. Domain: situation. Concern: progress? Also, dividend: progress (on the weapons)?", "group_id": 2515, "id": 944302}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304703394.4842169, "message": "that's what I thought. I would tend to think that the relocation is the real source of the story's problem.", "group_id": 2515, "id": 944321}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703488.667377, "message": "Or... The relocation is the inciting incident, since it is the proximate cause of everything. But, once Wikus is 'imfected', the relocation is never mentioned again.", "group_id": 2515, "id": 944325}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304703527.9163439, "message": "Well, I would also add that there is *a lot* of time spent with the Main Character throughline.", "group_id": 2515, "id": 944331}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304703732.862864, "message": "Yes. Alien is IC? they have the only relationship that matures.", "group_id": 2515, "id": 944351}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304704104.5119691, "message": "For me, MC: Wikus  IC: Christopher. For the OS, I'm not sure if the goal is relocation. As Jim said, it is all MC stuff, and virtually everything that happens in the last 2/3 of the film is about him, not relocation (which is only mentioned again in the credits). I agree it could be the inciting incident, and the OS goal perhaps being to have control over Wikus. Not sure how to describe that.", "group_id": 2515, "id": 944386}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304704290.1866829, "message": "For me, control over Wikus has to do with getting control over the weapons,", "group_id": 2515, "id": 944412}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304704307.6714599, "message": "And THAT is mentioned as thr", "group_id": 2515, "id": 944414}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304704377.7547641, "message": "Arg!! That is mentioned as the real reason MNU has any interest in the aliens at all. One of the talking heads says that.", "group_id": 2515, "id": 944427}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304704341.563504, "message": "I would agree with MC:Wikus, IC:Christopher. There is even a great You and I moment with Christopher's son. Relationship would be something like Unlikely Allies", "group_id": 2515, "id": 944421}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304704631.7643249, "message": "Does the goal have to be the final reason though? If MNU want Wikus because he can use the weapons, does the goal have to be to get control over the weapons? I'm curious because that can't be the OS goal as only MNU care about that. But Wikus wants to control himself (to return to a human), Warlord wants his arm, Not sure what the alien wants with him though.", "group_id": 2515, "id": 944476}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304704694.4587319, "message": "Now I'm arguing with myself..... of course warlord also wants him for the weapons, and I suppose the aliens want the weapons (but it's not exactly there goal). Wikus doesn't want the weapons.", "group_id": 2515, "id": 944484}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304704712.2853, "message": "One person has the goal; others share the concern.", "group_id": 2515, "id": 944485}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304722023.456785, "message": "I want to say that it's an Action story -- the presence of the prawns and their behavior forces the decision to move them out of Joburg. They go to move them... then I kind of lose this thread. \n\nBut: action -- Wikus gets sprayed. He starts changing. He goes to the Hospital. Then (off screen) it's decided to bring him into MNU. They bring him in. Use him. He continues to change, which forces them to decide \"vivisect him or not?\" This forces the action in him to run! \n\nIs it possible that the OS, the background story, is something like \"managing life with the aliens\" and it's a \"doing\" story?", "group_id": 2515, "id": 947411}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304721698.7524991, "message": "I'm curious if we can find one thing to agree on, so we can build from there.\nI see Wikus changing (from hostile indifference towards the prawns, to actively helping Christopher.)\nUm... that's about it that I can pin down.", "group_id": 2515, "id": 947367}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304722805.9615071, "message": "I think the movie is pretty clear that the residents of Joburg get fed up with the aliens (the train wreckage they show, etc.) and that that is the action that starts it off, not their actual arrival.\n\nI think Wikus is hostile/indifferent. He doesn't really care about getting fake X's on the contracts, or lying to them. He tries to force Christopher to sign by threatening to take his kid away. He burns the babies up...", "group_id": 2515, "id": 947505}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304723021.307056, "message": "So, as far as Actions / Decisions, starting from the residents getting fed up, could that mean that the driver is the decision to move them, rather than the action of them arriving?", "group_id": 2515, "id": 947532}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304722586.0129011, "message": "\"managing life with the aliens\" sounds good. And I think we agree who the MC and IC are?  \n\nWith the action / decision thing, I'm not sure because I don't know how Dram views the start of the story. You are right that the aliens arriving forces the decision, but the story for the audience starts after that. We could say the decision to move the aliens sets the action in motion. Does Dram start where the film starts, or from when the aliens arrive?\n\nWas Wikus hostile / indifferent towards the Aliens? I'm not sure. He seemed compassionate early on.", "group_id": 2515, "id": 947478}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304722937.5739551, "message": "Ahhhh...... yes good points about Wikus. Very true. Ok, so hostile / indifferent makes sense there.", "group_id": 2515, "id": 947525}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304723021.7088821, "message": "It's also possible that Wikus's MC adventure is set up against a collection of disconnected tales: moving the aliens & trying to use alien technology. But I don't feel confident enough to declare that.", "group_id": 2515, "id": 947533}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304723597.5566881, "message": "My gut says no. But my gut isn't that smart.", "group_id": 2515, "id": 947565}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304724168.7471199, "message": "This is where it gets tricky. I will need to think more about this, play about with it a bit. But purely from what we've discussed, I would say Christopher is Physics, because the activity is what drives him. Mind is the OS because most people seem pretty prejudiced against the Aliens and that causes OS problems (for example, they are moving them because they don't want them there). \n\nHaving said that, I find it really hard to set domains. I tend to need to go down to Issue or Problem level, choose what I am happy with there, check each Issue works (roughly) for that throughline, and then ignore the domain.", "group_id": 2515, "id": 947612}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304723814.880568, "message": "For instance, my gut also says that the OS is going to be Physics (activity). But that's what I thought about The Wedding Banquet, too, and was way off.\n\nI think IC Domain is \"Mind (Fixed Attitude)\" -- Christopher has been solidly focused on one task for 20 years, and \"get the liquid to the ship\" seems to guide him the whole way through.", "group_id": 2515, "id": 947588}, {"user_id": 30287, "stars": [], "topic_id": 33674, "date_created": 1304724163.3768311, "message": "Wikus's problem/solution feels kind of like \"Temptation/Conscience\".  Maybe.  I find I get that pair a lot.", "group_id": 2515, "id": 947610}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304725526.80515, "message": "You have to give over completely.", "group_id": 2515, "id": 947707}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304724790.4961369, "message": "If Wikus is Situation, then the problem could be 'Process', the issue 'Security', the concern 'Progress'. I would say the future is not his main concern, but survival which is either progress or present (not sure which).", "group_id": 2515, "id": 947646}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304724405.2003839, "message": "If Wikus is Situation, the OS cannot be Mind.", "group_id": 2515, "id": 947622}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304724469.445235, "message": "@ScreenwritingScreenwriter, I don't see his Issue being Choice, though. If his situation is his infection, then what Choice does he have?", "group_id": 2515, "id": 947628}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304725417.3105941, "message": "That's where I incline to, too.\n\nDram is forcing me into a Female Sex. That doesn't quite sit with me. He chops his finger off with a hatchet! Plus, If I get you the liquid, you fix me!", "group_id": 2515, "id": 947695}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304725148.480443, "message": "His problems don't come from how to think about what's going on. MNU wants him because of his hand. The Nigerian wants to eat him because \"I want that arm.\"", "group_id": 2515, "id": 947668}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304725176.3469889, "message": "@MikeDerk   out of those three, I would say 'I'm changing' is where most attention is placed. For example, he doesn't walk around watching aliens saying 'I'm going to be one of those...'. The thing about Progress vs Present is that Present suggests nothing about his wife, whereas Progress does.  He needs to sort out the 'changing into an alien' problem to be able to have a future with his wife.", "group_id": 2515, "id": 947673}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304724955.401716, "message": "I can't decide between his concern being Progress (I'm changing!) or Future (I'm going to end up a prawn?!) or Present (They want to kill me!). \n\nThe conversations with his wife, \"I want to hold you again,\" make me think it might be future. Losing his teeth, etc, make me think \"Progress.\" \n\nI think \"Future\" & \"Progress\" might be Concern/Benchmark. Not sure which order.", "group_id": 2515, "id": 947654}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304724964.256875, "message": "Another angle is how Wikus changes - his growth as far as better looking after himself and fighting. With that in mind, what about the domain 'Psychology', concern 'Conceptualizing' and issue 'Situation'? So he sees the problem as it evolves, and sort-of plans to do something about it.", "group_id": 2515, "id": 947655}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304725594.065676, "message": "haha.  Re. mental sex, that's a setting I generally ignore. I mean, I just agree with Dram. With Wikus, I don't think it is clear that he is a logical thinker, so could easily be female in my opinion.", "group_id": 2515, "id": 947713}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304725484.2353079, "message": "If I change it to Male, I have to have a Benchmark of The Present.", "group_id": 2515, "id": 947703}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304725486.238071, "message": "lol   \"Dram is forcing me into a Female Sex.\"   It NEVER has done that for me! I must be using it wrong!!", "group_id": 2515, "id": 947704}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304725746.8386719, "message": "I don't really get it either, but I try to focus on my weak points. I'm either masochistic, or believe it's the fastest way to get better. \n\nThat used to be one of the settings: Masochistic, Sadist. \n\nNot really.", "group_id": 2515, "id": 947731}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304726464.6421831, "message": "How about his for a summary to work from (by that I mean completely pull apart!)......\n\nMC Domain: Universe (Situation)  MC Concern: Progress   MC Issue:  Security  MC Problem: Process\n\nOS Domain: Physics(Activity)  OS Concern: Doing  OS Issue:  Enlightenment   OS Problem: Process\n\nAs I went through this, it seem to make sense. The OS Issue also covers the prejudice angle to some degree, and they are all involved in an activity, and all want to do something (Wikus be human, alien get to mothership, soldier to catch Wikus, MNU to get weapons). Doing seems to be a better fit than Obtaining to me.", "group_id": 2515, "id": 947808}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304726967.577455, "message": "wow...I missed a lot! @ScreenwritingScreenwriter, when the same terms come up for you, it usually is an indicator of *your* own personal problems (speaking from experience here!)", "group_id": 2515, "id": 947854}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304727029.408078, "message": "you guys are going waaay faster than I'm used to, but I like where you're headed", "group_id": 2515, "id": 947860}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304727080.775866, "message": "how about something to help figure out the whole OS Throughline, Protagonist question - what do you guys think the Outcome/Judgment is?", "group_id": 2515, "id": 947874}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304729228.20696, "message": "Outcome: failure. Indicated by continued population rise of prawns. Judg: good. Bench: the present. Sex:male. Can't explain now", "group_id": 2515, "id": 948011}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304742831.8001671, "message": "Outcome: Failure. \n\nThis is a bit lame, but if it's about \"managing the aliens\", they fail because although the aliens are moved, they continue to breed. (And, an alien is returning in 3 years, and he's angry.) If it's about the weapons, they don't get any more control than they had before... fail.\n\nJudgment: Good.\n\nHe says, \"don't make me go through this, and not get out of here\" to Christopher -- and he gets out. (Added benefit, the muscle gets his head ripped off.) Additionally, he believes Christopher will be back, which is why he is maintaining the relationship with his wife through the metallic flowers.", "group_id": 2515, "id": 948821}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304743378.8199649, "message": "MC Benchmark: The Present.\n\nWhat really gets his emotions up is when his wife calls. That's about the now -- \"I don't want to see you again.\" \"I know my dad was lying.\"\n\nSex: Male.\n\nLike I said before: \"If I get you the liquid, you can fix me?\"", "group_id": 2515, "id": 948855}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304758884.7067969, "message": "Sounded good to me, so I decided to build the storyform, from what I suggested before, in Dram. Now, the limits on options throw up some interesting things. \n\nIn the story engine I've got these available:  Driver, Limit, Outcome and Judgement are all free. \n\nMC Unique Ability can be: Fact, Security, Threat\nMC Critical Flaw can be: Confidence, Worry, Worth\n\nLooking at it backwards (so choosing the MC aspects first), I would say MC Unique Ability is Threat, because it is his vulnerable position that drives him to find a solution.\n\nThat would give MC Critical Flaw: Confidence. This I can also see as he doesn't really know if he can do it, or if what he is doing will solve his problem.\n\nThat makes the Judgement: Bad. Outcome is still free. Can the Judgement be seen as bad?", "group_id": 2515, "id": 949599}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304758999.3691089, "message": "In the above MC Benchmart could be Present or Future.", "group_id": 2515, "id": 949604}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304801037.6206789, "message": "I wouldn't say say being sad is the main thing - I thought the stronger point was that he had survived, that there was still hope for him (with the alien returning).", "group_id": 2515, "id": 952588}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304799883.0571229, "message": "Isn't he all sad at the end? I can't remember.", "group_id": 2515, "id": 952524}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834046.8419991, "message": "Ok, just watched the last 40 minutes or so again. I had forgotten about the whole weapon technology angle.", "group_id": 2515, "id": 956810}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834576.6537371, "message": "As far as Judgment goes, while he is pleased to see Christopher reach the mothership, I wouldn't necessarily categorize him as being in a better place than he was at the beginning. Three years is a long time to spend as a prawn.", "group_id": 2515, "id": 956830}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834176.9068279, "message": "About the ending, it certainly does feel bittersweet. Before watching it again I had assumed Triumph, but perhaps not.", "group_id": 2515, "id": 956813}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834410.006346, "message": "Talking to myself here :), but that would suggest Christopher as the Protagonist and the bald soldier/evil CEO guy as the Antagonist.", "group_id": 2515, "id": 956822}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834465.0090401, "message": "Which would also mean Success in the OS Outcome. It looks like they're going to be able to fight back.", "group_id": 2515, "id": 956828}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304834305.906394, "message": "What if the OS Goal has something to do with \"fighting a rebellion\" like Star Wars. Aren't they scavenging for that black liquid in the beginning? To escape, or to have the means to fight again?", "group_id": 2515, "id": 956820}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304848883.6475711, "message": "Cool.... interesting to have your take on this. I'm not sure when we were aware of the black liquid. It was quite a way in I think. The alien said he had been getting it for twenty years. \n\nHowever, I would have thought the MNU side of things is where the protagonist should be, but then again I keep telling myself I must make a clearer definition between MC and protagonist.\n\nComes back to the goal again I guess. I don't think there was so much a rebellion. I mean, the aliens weren't obviously trying to get home or destroy humans at the start. They were just the cause of trouble because there were so many of them (which I though was a device used to show how racism could be applied to aliens).\n\nSo for me, I would have thought the goal was decided by what happens early on (MNU taking control of operating, Wikus taking head role, the decision to move them, the soldier eager to use force where needed). We also find out later on that MNU were actually interested because they wanted the weapon technology. \n\nI think everything is driven (from the part of the story the film shows) by the decision to move the aliens. Wikus gets promoted, the soldier gets a protection role, the Alien has to protect the black liquid (maybe speed up production?), MNU get more opportunity to learn about the weapons.", "group_id": 2515, "id": 957171}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304869141.175442, "message": "So if the alien relocation is the event that creates the inequity of the story, what does the MNU -- as Protagonist -- work to resolve? What are they pursuing to resolve this problem of relocation?", "group_id": 2515, "id": 958045}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304871048.8196249, "message": "@Jim  Perhaps MNU's actions re. appointing Wikus as head of the relocation team, then sending him in with his team and military could be seen as their pursuit in solving the problem.\n\nHowever, this throws up one big problem. The relocation is not really MNU's main concern. My assumption was that appointing Wikus as head was a sign that they were not taking it seriously. There focus was actually on developing a means to use the weapons, however we are never told this, and only figure that out later when seeing the experiments they'd been doing.", "group_id": 2515, "id": 958221}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304869948.902163, "message": "Christopher was on my short list for potential protagonists, but I can't see it. How are his decisions forcing the story in any way? Nobody even knows about them.\n\nI'm curious now if the OS is Universe: \"The Alien Nuisance.\"", "group_id": 2515, "id": 958121}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304871390.153357, "message": "@MikeDerk  I had the same problem. I can't see Christopher (or should I say the Alien?) as protagonist. He's just not a big enough part of the story until the end.\n\nPerhaps he issue here is that everyone, apart from Wikus has some other objective than the one we are told about. MNU leads the relocation but actually cares about the weapons. The warlord trades cat food but really wants to be able to use the weapons, the aliens appear stupid and disoriented but then one of them is developing high technology to get back to the mother ship, the soldier's task appears to be to defend Wikus and his team but in reality he just wants to kill aliens.\n\nShould we be focusing on what the film led us to believe was true, or what was actually true?", "group_id": 2515, "id": 958267}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304881553.0228469, "message": "Also, re-reading my initial analysis from when I first saw it, the Relationship throughline is *very* lightly sketched, barely even in there if at all. So chasing a storyform that fits might prove to be difficult.", "group_id": 2515, "id": 959460}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304881306.1924601, "message": "The storyform describes what was really going on. If MNU was Protagonist what problem were they trying to resolve and when did it start. I haven't seen the first half of the film in awhile, but wasn't Christopher collecting the liquid to get back to the ship and Wikkus discovery of it interrupted that?", "group_id": 2515, "id": 959440}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304883159.6089711, "message": "Now this is where I get really confused. Audience view vs author view. To me, there should be three views - Audience, author, and world. World is the knowledge of everything that is going on. For example, in most stories I've read the author's view is an all-knowing view of the story, not the world.\n\nIn other words, if we look at what is really going on in a story, we could go deeper and deeper. That to me is a World view, a kind-of God like view on everything involved in the story world. However, to me an author's view would be limited to the actual aspects of the main throughlines of the story, but seeing those events in there entirety. \n\nSo with D9, for me although we learn that MNU are really interested in getting the weapons, and can assume that is the underlying reason why they want to do the relocation, this doesn't actually drive the characters we spend most time with. \n\nI suppose another way to look at this is, why do MNU want to use the weapons? Probably so they can build more and make money. This, to me is a World view, and probably what is REALLY going on. But it surely couldn't be part of the storyform?\n\nSo for the tangent here, but it seems to be the crux of the OS issue with understanding D9 in Dram terms.", "group_id": 2515, "id": 959589}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304882695.370384, "message": "The Protagonist doesn't drive a story forward, the story drivers do. Often they are manufacturers of them, but not always (Laszlo in Casablanca). It could be too that there aren't Archetypal characters here. At the motivation level the Protagonist needs the drive to pursue.", "group_id": 2515, "id": 959540}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304886030.307987, "message": "The Author's view is the worldview. They create the world.", "group_id": 2515, "id": 959955}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304888461.5164371, "message": "With Dramatica you're always trying to establish Author's Intent.  If the intent was 1) as describe above what was the inequity created by the initial driver and what successful outcome would have resolved that?", "group_id": 2515, "id": 960577}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304887955.758852, "message": "Yes, I see what you mean about the protagonist not driving the story. My mistake.\n\nCould it be that with D9, we need to decide whether the author's view of the story was,  1) more likely about Wikus leading the relocation, with the sub-plot of MNU wanting to gain usage of the weapons, or  2) the desire of MNU wanting to gain usage of the weapons driving the re-location?\n\nHere is an issue, because to me 2) is a world view, not the author's view of the story because we make that connection ourselves based on our own experience that greed drives people to do such things. Lets assume the author used Dramatica, I don't see how the author would go from a storyform about 2) and arrive at D9. More likely the author's storyform would be based on 1). Not sure if that makes sense. \n\nI think I will start a separate topic about audience vs author view as I find this distinction confusing when we include background / causative elements that are not giving to the audience.", "group_id": 2515, "id": 960458}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304890440.3415959, "message": "Challenging questions......   well the inequity could be that the inexperienced Wikus was taking on an almost impossible task. So Wikus being a stronger leader, with others helping him rather than having their own interests, might have resolved it. Am I on the right track re. inequity / resolution?", "group_id": 2515, "id": 961024}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304890586.1588931, "message": "Maybe, but the way you described sounds more like a Main Character issue rather than an Overall Story one. I think the MC throughline is given *great* emphasis in this film, which makes it difficult to separate the two.", "group_id": 2515, "id": 961051}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304891134.874263, "message": "Yes, that could explain the OS difficulty. Perhaps I am confusing the two still. So I suppose the OS throughline could something more general like 'obtaining something through the alien habitation' (MNU & Warlord: weapons, Alien: making liquid, Wikus: taking command, Soldier: being able to fight / kill).", "group_id": 2515, "id": 961193}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304908265.947834, "message": "Since we're not getting much closer, I'm going to throw in my initial reaction to the movie. There are 3 tales that add up to what is perceived as the \"plot\"/OS.\n1. Alien relocation. This starts everything, introduced the characters, but then...\n2. We are told through the talking heads that the real interest MNU had in the aliens was their technology. But we get no sense that the relocation directly affected this goal. I inferred that they were overseeing the move to help the local goverment, who would then allow them to \"steal\" weapons -- trading favors, basically. \n\nWeapons becomes tale #2.\n\n3. Christopher is trying to collect enough liquid to get back to the mothership. What he's going to do there, I don't know. If he had a plan, why didn't he do it 20 years ago? Anyway, pursuit of the liquid becomes tale #3.\n\nWikus is an MC because he is emotionally who we attach to. Also, his hand (which I would say is \"fact\" in the storyform we have) allows him to solve the OS problems in Tales #2 and #3: hand = control weapons (sort of) and that allows him to know where the black liquid is being stored, so he can help Christopher get it back. Helping Christopher, in turn, will solve his personal problem, because Christopher can return him to fully human.\n\nInteresting, but no storyform...", "group_id": 2515, "id": 964595}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304977782.2451661, "message": "It looks to me like, from all we've discussed, the alien relocation continually crops up as a suggested main focus / plot / OS goal. Still, I now think it has to be more general to cover all the stories, so I'd lead more towards the last one I suggested, something along the lines of 'benefiting from the alien habitation'. Most characters individually don't actually seem to care about relocation - Wikus is probably the only one that does (but even he seems more concerned with being in charge).\n\nI agree about the weapons not affecting the goal. It was more a sub-plot to me as we didn't even learn about it until some way in. Plus it seems to be too much of an untold part of the story.\n\nChristopher said it took 20 years to get that much liquid, and that his plan was to go to the mother ship and save all the aliens.", "group_id": 2515, "id": 978752}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304977862.39186, "message": "It looks to me like, from all we've discussed, the alien relocation continually crops up as a suggested main focus / plot / OS goal. Still, I now think it has to be more general to cover all the stories, so I'd lead more towards the last one I suggested, something along the lines of 'benefiting from the alien habitation'. Most characters individually don't actually seem to care about relocation - Wikus is probably the only one that does (but even he seems more concerned with being in charge).\n\nI agree about the weapons not affecting the goal. It was more a sub-plot to me as we didn't even learn about it until some way in. Plus it seems to be too much of an untold part of the story.\n\nChristopher said it took 20 years to get that much liquid, and that his plan was to go to the mother ship and save all the aliens.", "group_id": 2515, "id": 978767}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304979048.956567, "message": "I'm beginning to think we are chasing shadows and that no storyform exists.", "group_id": 2515, "id": 979006}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304983501.3405521, "message": "I meant not moved at the start. \n\nStill, perhaps inequities highlight a bunch of different stories, connected only because they all happen in the same place at the same time. At the start, Wikus wants to be a success but lacks confidence / experience and a lot of aliens to move, soldier wants to kill but has not justified opportunity, MNU / Warlord want weapons but can't use them, Christopher wants to get to ship but needs more liquid. These all seem like inequities to me. \n\nA few of these are solved, but not all.", "group_id": 2515, "id": 980249}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304983587.6675651, "message": "We have to think about which inequities are caused by the inciting incident, though. The Warlord can't control the weapons, and that's part of the stasis before the inciting incident, for instance.", "group_id": 2515, "id": 980278}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304981963.622227, "message": "Well, maybe, but also not sure it matters. These kinds of discussion, especially where they get difficult, seem like a good way to learn more about the theory. \n\nI remember reading something on a Dram site about the need for more than one storyform (multiple MCs I think was the focus there) in a particular story (don't remember which one). Perhaps that would be the case here.\n\nOne thing is clear, D9 is a pretty unusual film so not fitting to Dram is not so surprising.", "group_id": 2515, "id": 979954}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304982145.5756831, "message": "When I watched the movie, I thought that we would have two protagonists, and two storyforms.\n\nAnd, I do think it matters, because if we're trying to learn the theory, it can get confusing talking about something that doesn't conform. I mean, we're all trying to figure out the OS Goal and what if there just isn't one? We'll be chasing our tails forever.", "group_id": 2515, "id": 979981}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304982867.5778539, "message": "Which is unsettling, since I liked the film so much.", "group_id": 2515, "id": 980101}, {"user_id": 7645, "stars": [], "topic_id": 33674, "date_created": 1304982344.8265419, "message": "Oh I like that.", "group_id": 2515, "id": 980015}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304982440.486553, "message": "Re. OS goal, I also think it is interesting identifying a film that doesn't have an apparent goal. It suggests the film could have been better had an overall goal been more obvious.", "group_id": 2515, "id": 980031}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304983044.652581, "message": "That's an interesting take on it MikeDerk. The only thing for me with that is how the story revolves very strongly around what MNU set Wikus to do (relocation). Could the inequity also be that MNU / Wikus / Joberg population want the aliens moved (although perhaps for different reasons), but they are not moved?", "group_id": 2515, "id": 980132}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304983143.8707809, "message": "The aliens are successfully moved. Many get moved the first day. And then we are told at the end that they are all moved.", "group_id": 2515, "id": 980166}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304983154.227118, "message": "I thought I would like the film more, but I'm not keen on films that are not definitive (I'm not talking in the Dram sense here, but because the story in effect wasn't finished). I didn't like the way the Italian Job ended either.", "group_id": 2515, "id": 980168}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1304982253.4861951, "message": "That said, the biggest inequity that I can see in the movie (right now...) is that Christopher can no longer operate in private. That makes him the Protagonist, and the goal would be \"getting back to the mother ship.\" Wikus can make that happen because he can help get the liquid and can protect Christopher as he ascends.", "group_id": 2515, "id": 979998}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1304983682.544363, "message": "Hmmmm.... right. Now I'm thinking.......", "group_id": 2515, "id": 980308}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1305010716.2475801, "message": "Overall, each of these people is put in an unexpected position, perhaps without much warning.", "group_id": 2515, "id": 986074}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1305010667.411423, "message": "Well..... if the inciting incident is the decision to relocate or perhaps the decision to allow MNU to run the relocation, then I think 3 of the 4 inequities I mentioned could still apply.... with a little re-wording.\n\nInequity 1) Wikus is put in a position of power without necessary experience / qualities, causing him to need to adjust (he seemed content with his office job before that).\n\nInequity 2) Soldier sees opportunity to kill aliens but is frustrated because he can't justify doing so (before the relocation plan, he perhaps wasn't even tasked with alien work).\n\nInequity 3)  Christopher has been casually collecting liquid (over 20 years) and suddenly needs to finish the project quickly before the relocation happens (because his shuttle is under his house).", "group_id": 2515, "id": 986067}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1305050094.371721, "message": "In looking over your list, I don't see #1 or #2 being real problems, though...", "group_id": 2515, "id": 993618}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1305101891.1661489, "message": "I misunderstood what you meant...... on first read I thought you meant you agreed with 1 and 2. Now I see that's not what you meant.\n\nWell, I think they are closely connected with a real problem. If the problem is the process of moving the aliens, then I think we can see a connection between the problem and inequity.\n\nIn 1) Wikus lack of experience / authority means he is not able to deal with the problem efficiently enough (early in the film we see how much he struggles with this task, and how it causes him to make bad decisions like killing the babies).\n\nIn 2) The solder is thinking more about killing than being supportive, making the process more difficult.\n\nIn 3) is more self-explanatory as it is the need to suddenly develop / hide the liquid because of the process of relocation.", "group_id": 2515, "id": 1003650}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1305131788.605931, "message": "I'm not sure that \"killing the babies\" is a bad idea. They're trying to keep the population down, after all. It does demonstrate Wikus's dismissive attitude towards the aliens, so it pays off after he's affected.\n\nI'm thinking it might be time to dissect a different movie. Any thoughts?", "group_id": 2515, "id": 1009875}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1305135338.864414, "message": "Sure. Fine with me. Maybe an easier to storyform one! :)", "group_id": 2515, "id": 1010867}, {"user_id": 7664, "stars": [], "topic_id": 33674, "date_created": 1305147132.2221031, "message": "How about \"The Conversation\"?", "group_id": 2515, "id": 1014218}, {"user_id": 30951, "stars": [], "topic_id": 33674, "date_created": 1305224882.7197349, "message": "Yes, could be. Never seen it. Will try to get hold of it.", "group_id": 2515, "id": 1027452}]