[{"user_id": 11626, "stars": [], "topic_id": 44336, "date_created": 1314089838.8258851, "message": "TOLD WITH A TOUCH OF SOUTH CAROLINA HUMOR.\r\n\r\n﻿\r\n\r\nWhat Property Rights?\r\nMarlene Motley\r\nJuly 30, 2011\r\n\r\nhttp://marlenemotley.files.wordpress.com/2011/07/004.jpg?w=300&h=225\r\nThe scene of the crime.\r\n\r\n\r\nOn April 20, 2011 I was arrested for breach of peace, or in laymans terms, for calling an officer what he is, a public servant. I have heard the term ‘contempt of cop’ bandied about. I’m guessing my response should have been ‘overlord’ but I really wasn’t in the mood. But on with the story…\r\n\r\nAbout a year earlier we met our neighbor, a one Mr. Michael Armstrong, because he had made up his mind since he had 100+ acres of land that 100+ acres included our 2+. Seems Mr. Armstrong has a dog that believes anything that isn’t human and smaller than a breadbox is free food. This has included several chickens, a rabbit and the usual cats. The dog  also had a propensity for dancing on the hood of cars. And, of course, Mr. Armstrong has the strangest idea that he is not responsible for the damage his doggie does. Restitution is a very, very bad word in his vocabulary.\r\n\r\nWell, after 8-10 visits by Lady, the dog, we finally managed to trap her and off to doggie court we go. And all is well right? Wrong. The nice animal control officer, although he let us show photos of the car, would not hear of us telling the judge that the doggie liked to kill small animals. Mr. Armstrong did have to pay a fine and was ordered by the judge to keep the doggie shut up. Now just prior to trapping Lady we were told by the nice animal control officer that if we knew who the dog belonged to he could write a ticket for the dog. Funny how that option dried up when it was determined who the owner was. Curious thing that. But it gets curiouser and curiouser.\r\n\r\nJump to this year and as my Mom is out in the yard up from the woods comes Lady with her same determination to eat the cats. Mom did manage to subdue Lady and called me out to put her, Lady, on a leash. We then proceded to call animal control to come pick the dog up. With the history of the dog and the court order this was going to put a stop to this “animal at large” problem. Wrong again. As we were waiting for the AC officer to come Mr. Armstrong shows up looking for the dog and I inform him that we have the dog and are waiting for AC to come get it. Well Mr. Armstrong goes ballistic. He pulls into our driveway from a road that runs up beside our house, an easement really, and I just manage to close our gates as he gets there. He jumps out of his truck and starts screaming at us about how we stole his dog and how his dog followed our dog, we don’t have one, into our yard. OK, there is a stray in the neighborhood and he alledged that since it had been in our yard it had to be our dog. Hmm, would this not also now make Lady our dog?  Anyway, he is jumping at the gate and all the while this little child, I can only assume is his, is screaming right along with him.\r\n\r\nAt this point I told him twice to remove himself from the property as the gate comes up into the yard and both times he refused as he stood there in front of the POSTED sign on the gate. Said he did not have to leave. Guessing he thought he also had a right to run free like his dog on any property he wanted. So the wise decision at this point was to call dispatch and have a sheriffs deputy sent out to remove him. Turns out what seems wise isn’t always so.\r\n\r\nIn the meantime, while awaiting for the officers to arrive, I end up on the phone with a friend discusing another case and asked the friend to stay on the line should I need a witness. Well, at least that was wise as the officer made an accusation that the party on the other end of the phone knew to be a lie.\r\n\r\nSo, the officer, the deputy, shows up and I am standing back up in the yard. The officer is talking to Mr. Armstrong and I walk out to the gate and tell the officer I want Mr. Armstrong removed from the property. The officer says for me to go back and he will talk to me later. Fine, I walk away and continue my phone conversation. But what seemed like more than enough time for the officer to ask Mr. Armstrong if he was trespassing and Mr. armstrong to admit he was I decided to walk back out. By this time the AC officer had arrived.  Anyway, I approached and again told the officer I wanted Mr. Armstrong off the property. The officer told me Mr. Armstrong could not leave because he, the officer, had him blocked in. I guess the look I had to have on my face at that time had to say something along the lines of, “Are you really as dumb as you sound?” but I refrained from taking the officers bait as it was apparent to me by this time the officer was attempting to bait me. After another moment or two I again told the officer I wanted Mr. Armstrong off the property and that is when the officer got even uglier, if that were even possible.\r\n\r\nThe officer told me if I did not leave, and please bear in mind that the officer was outside the gate and at the back of Mr. Armstrongs truck and I was inside the yard away from the gate, he was going to put me in jail. I just had to ask, “Are you threatening me?” at which point the officer asked me if I knew who I was talking to. “A public servant” was not the answer he was looking for. That managed to get the officer inside the gate at which point he removed the phone from my hand and put it in my pocket and cuffed me. Funny how that was never mentioned in his report. He told me he just wanted me to calm down. I was the calm one and told him so. He was the one chomping at the bit.\r\n\r\nBy now the AC officer is also in the yard and the deputy removes the cuffs. The AC officer starts asking questions about the dog and I explain how Mr. Armstrong  was ordered to keep the dog shut up by a judge. And that my mother had all the information and she was in the back yard with the dog on a leash. And again I asked the deputy to remove Mr. Armstrong from the property and again he said he could not be moved because the deputy had him blocked in. At this time I am beginning to question the wisdom of putting this guy on the streets with a gun and badge. I am also realizing that neither officer is going to do as they are suppose to do. So I just threw up my hands and started to walk away at which point I hear the deputy moving to come after me so I just stop and put my hands behind my back. And again he cuffs me and rushes me out to the car neither explaining what vicious crime I had perpetrated or reading me my rights. So off to jail I go.\r\n\r\nOn the ride to the jail the deputy asked my name and I exercised my 5th Amendment right not to tell him. Apparently he did not like that either. Now there are those who will say you have to answer that question but I have yet to find the “except when an officer asks your name” clause in the 5th Amendment. Seriously, I must have quite a different constitution than the one they use.\r\n\r\nWe proceded to the detention center with the deputy speeding to get this hardened criminal to jail. He was doing 60 mph in a 45 mph zone. This was through a residential area. Not only was he endangering my life but that of anyone in the area. At least he took the precaution of putting my seatbelt on, you know, so the cuffs could better cut into my wrists.\r\n\r\nNow I have a court date and in an attempt to find out what they are going to use against me in court I file a Bradey Motion for discovery with the sheriffs dept. and the officer sends his statement of record , the ‘Incident Report’. That was all that I received. That was what he was going to court with.  Wait a minute, wasn’t the AC officer present? What about the trespasser? Anyway, the report was bad enough. That alone would have got the case dismissed.\r\n\r\nFirst, he accused me of being somewhere I wasn’t and claimed that was where the arrest took place. Then he accused me of yelling. Oops, remember, I was on the phone with someone who could verify I was not yelling. He proceded to say that the trespasser had nowhere else to move his truck to if he asked him to vacate the property. Wrong. There are actually three access roads the gentleman could have used One directly accross the street, one next to the property and one directly across the street from that. The officer also said the child was frightened by my behavior. Wrong. The childs father, the trespasser, Mr. Armstrong, already had the child upset before the officer got there and all he had to do was remove the trespasser and the child away if he truely thought that was a problem. This was his reason, as he put it, for entering the yard, not the fact that the term ‘Public Servant’ was used. He also said I put my hand in the AC officers face. I was four foot away from him and my arms are not that long. He also had me living in a different town on the report too. But my favorite part, the victim in all this was of course ‘STATE OF SC’ and when asked on the form if the victim was on drugs or using alcohol the officer checked “UNK”. I also liked that the STATE OF SC had the same number as the Kershaw County Sheriffs Dept.\r\n\r\nWhen I finally got to court the officer mumbles something to the judge and the judge says I can go as the witness did not appear. I came so close to saying, “What do you mean? The SOB is standing right here.”. See, I do have self control.\r\n\r\nAnd just in case you are wondering, the officer left the trespasser on the property with my 79 year old mother blocking her exit from the driveway and the AC officer gave him back his dog even though it was on our property when he arrived. I did speak to the judge later and even he could not understand this. Also, the AC officer was in the court room but made tracks before my case came up. The trespasser never showed. But hey, would you swear an oath and then perjure yourself in court?\r\n\r\n\r\nhttp://marlenemotley.wordpress.com/2011/07/30/what-property-rights", "group_id": 3920, "id": 1938839}]