[{"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307472622.9283941, "message": "You usually Cross the border that afternoon.  You end up travelling from bar to bar in a little town called Ojinajua getting drunk of beer that tastes like piss and tequilla that should be illegal.  No one talks to you but under their breath, they call you a \"fucking albino\" and curse the plague of white people that cross the border every day.  Ironic I know.", "group_id": 10465, "id": 1326139}, {"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307475238.3259599, "message": "After hailing a cab, and asking \"what's funn in this shit hole?\" he says that there is this one place...  But I don't think you greengos would like it.  After some convincing ($20 passed through the window) he will take you to this place on the outskirts of town.  It's half trailer home, half shanty and is in the middle of a neighborhood.  You go in, and there are 3 guys there and a small line.  Because you are white, you'll have to pay $20 where as all of the locals are just walking past.  I guess because this is the equivalence for them of watching their white trash cousin blow the family dog, where as for us pale skins, it is a life changing experiance.", "group_id": 10465, "id": 1326718}, {"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307475705.7999301, "message": "So you pay your money and you go into the main room.  There is a small bar, but this is a beer joint, and everything is out of a can.  In the middle of the room there is a plywood stage built and probably rebuilt when holes big enough to fall in form, and it is covered in dirt and grim.  Happy you haven't been led to a rape, you nervously order a beer, and are happy that yo don't have to worry about being rohypnoled as the can is still closed.  Reguardless, it's cheap enough to drink a lot of, and cold enough to keep down.  The lights brighten, and out comes the lady.  She is middle aged, probably has a drug problem, and she dances around like a girl on ether.  Then comes out the donkey!", "group_id": 10465, "id": 1326846}, {"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307476295.665087, "message": "He walks back and forth fully expecting what's coming.  She opens a bottle of beer and puts it in his mouth.  He cocks back his head and drinks the bottle as though he hasn't been given anything to drink all day.  As she rolls him on his back, you start thinking, WTF is happening?  You shock turns to horror as she takes the donkey in her hand and starts working him to full arousal.", "group_id": 10465, "id": 1326972}, {"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307550686.2438641, "message": "I felt bad, so I gave her a 2 dollar bill.", "group_id": 10465, "id": 1339025}, {"user_id": 31355, "stars": [], "topic_id": 38519, "date_created": 1307550660.0578749, "message": "Then she climbs on, and after about 3 mins (which seem like eternity) he's done and she climbs off of him and collects her tips, which are in the form of coins, are collected in the dirt that has been pounded into dust by the trampling of hooves on the particle board.", "group_id": 10465, "id": 1339019}]