[{"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786490.28442, "message": "And of course there's always option c, do something totally different that I haven't thought of yet.", "group_id": 1203, "id": 315771}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786497.190155, "message": "Thoughts?", "group_id": 1203, "id": 315772}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786329.058387, "message": "There has been lots of great ideas running around, but they tend to get lost in the shuffle.", "group_id": 1203, "id": 315758}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786393.5368409, "message": "a) Cut down the main site to 'just' advertising the engine, latest news, contact and a download how-to guide. Move the bulk of the content to mediawiki.", "group_id": 1203, "id": 315764}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786345.6085651, "message": "I've been thinking it'd be a good idea to do one of two things:", "group_id": 1203, "id": 315760}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299786468.408447, "message": "b) Do the exact opposite, drop the wiki altogether and move everything to the main site. This would be easier for some things, but it would require a site admin to watch things a tad more then mediawiki would.", "group_id": 1203, "id": 315769}, {"user_id": 16740, "stars": [], "topic_id": 12095, "date_created": 1299962352.5250051, "message": "what would that \"bulk of the content\" be?", "group_id": 1203, "id": 336084}, {"user_id": 16740, "stars": [], "topic_id": 12095, "date_created": 1299962572.2164249, "message": "it doesn't sound too bad to put stuff like that on the wiki", "group_id": 1203, "id": 336107}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299962494.7218001, "message": "Unofficial docs, tutorials, dev resources, project wiki pwages, game wiki pages, etc.", "group_id": 1203, "id": 336098}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1299962680.575593, "message": "Yeah. Well for official docs, sphinx is the way to go since we can format offline versions easier, but I don't se why we can't have wiki docs as well. ^^", "group_id": 1203, "id": 336118}, {"user_id": 28227, "stars": [], "topic_id": 12095, "date_created": 1302285985.9732959, "message": "My thoughts:\n\nUsing the wiki seems to be a good idea. It seems to fit well with the concept of building community and empowering the players to create and contribute. In that regard, user generated content seems to be central to the success of CubeCreate.\n\nIf people start creating substantial new features, they'll need somewhere to document and explain them. We would probably want to keep that as close to the main project as possible to build a cohesive community.", "group_id": 1203, "id": 593718}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1302288959.161757, "message": "@PopeJamal Here's my thoughts. Use a statically generated site for our 'official' news feed and a bunch of screenshots and engine info on the main cubecreate.com site.\n\nThen on the wiki we can have our community feeds and everything else there.\n\nFurthermore, we can use sphinx to package official documentation with the engine. That'll also allow it to be printed into a manual form or something like that for distribution purposes.", "group_id": 1203, "id": 594447}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1302290746.8536401, "message": "For the static site, we could use something like Blogofile (http://blogofile.com/). Not great for 'tons' of posts, but for official announcements it shouldn't be an issue.", "group_id": 1203, "id": 594961}, {"user_id": 3617, "stars": [], "topic_id": 12095, "date_created": 1302296282.967216, "message": "Downsides to the static site are kinda obvious. It'd mean Disqus for comments which isn't really a big deal, JS for twitter/identi.ca feeds (Which is a good idea anyway) and the same for github feeds.", "group_id": 1203, "id": 595914}]