[{"user_id": 3019, "stars": [], "topic_id": 17727, "date_created": 1302143954.7059169, "message": "The April Synchronous Hackathon [1] will take place over the weekend of\nthe 16th and 17th of April.  All spaces are invited to participate and\nallow there members and visitors to hangout and work on projects over\nthe weekend.\n\nFollowing on with our series of monthly challenges I'm announcing the\nEnergy Efficiency Challenge [2].  The goal of this challenge is to\nimprove the long-term energy efficiency of your space.  Find methods to\nreduce your spaces energy needs; reduce/remove phantom energy devices,\nimprove your insulation, recover waste heat, fit energy efficient\nlighting, replace that old server with something more efficient,\nanything goes.  When you've finished create a blog post about your\nfindings.\n\nRobert\n\n1. http://hackerspaces.org/wiki/Synchronous_Hackathon/2011-04-16\n2. http://hackerspaces.org/wiki/Energy_Efficiency_Challenge", "group_id": 897, "id": 568874}, {"user_id": 3019, "stars": [], "topic_id": 17727, "date_created": 1302680849.203862, "message": "For this challenge - we'd like to have our hot water heater and vending machine to turn on when someone comes into the space and then turn off after everyone has left.  This will save a lot.  We'd also like to get the both phases on some type of charting service.", "group_id": 897, "id": 661103}, {"user_id": 29231, "stars": [], "topic_id": 17727, "date_created": 1302684771.2065439, "message": "is the hotwater heater / hotwater pipes wrapped in insulation?  i think i remember a soda vending machine, could it be effectively insulated?", "group_id": 897, "id": 661630}, {"user_id": 3019, "stars": [], "topic_id": 17727, "date_created": 1302685433.497329, "message": "I can double check, when it turns on, the walls creek, it totally seems like its wasting electricity since it does it every hour or so and we don't need hot water when we're not there... I wonder how fast it heats up.  The vending machine is insulated very well, sodas stay cold for a day almost with it unplugged.", "group_id": 897, "id": 661763}]