[{"user_id": 11626, "stars": [], "topic_id": 7726, "date_created": 1298247454.770093, "message": "CCSD Campus Police Chief Arroyo was caught outright lying to the CCSD Trustees stating (recorded on CCSD Video) ... “We never purchased that stuff.” That “stuff” refers to 14 DPMS AR 15 rifles at a cost of $10,219.30, and one of five ordered Beretta Carbines and Magazines at a cost of $754.95 for just one.\r\n\r\nWhat Arroyo should know, but seems to not know, is that this reporter has the invoices from American Shooters of Las Vegas where the weapons were bought and then delivered to him. We also know that the CCSD police officers are practicing with the guns at the shooting range. These are not the individual officers' guns, about which Arroyo has stated, “...the program requires police officers to purchase and qualify with their own firearms,” but are the 14 Rifles, and the one Beretta CX 40 SW Storm Carbine with PX4 Magazines of the five that were ordered by the CCSD Campus Police with the approval of Chief Arroyo. It has been stated by this reporter's sources that five Storm Carbines are now in the possession of the Clark County School District Police.\r\n\r\nThe Beretta CX 40 SW Carbine and the AR-15 Rifles are not paintball guns; these guns can shoot a real bullet that can go through five students and then through a locker with one shot. Death is imminent. Chief Arroyo is attempting to tell people that the rifles are equivalent to paintball guns and/or can shoot rubber bullets that either stun the victim or causes bruising. Again, the invoices tell us a different story. Our sources state they are firing them at the shooting range and they are using REAL bullets; bullets that do more than just stun someone or cause bruising - bullets that KILL!\r\n\r\nAnd we want to know who is training them in the use of these weapons and the maneuvers that go with them.\r\n\r\nThere are numerous incidents regarding the CCSD Campus Police, under the direction of Chief Arroyo, that have never hit the news or even been reported to the CCSD Board of Education Trustees.\r\n\r\nWhat we have here is a mess of unclear guidelines and policy procedures and regulations of the CCSD Police Department, which is running wild; plus lying, deceit and a conspiracy orchestrated by CCSD Campus Police Chief Arroyo. Are the Trustees not the ones who sign his paycheck? Are the Trustees not the ones who refuse to review the Purchase Orders or Changes Orders at each meeting - trusting the District? Aren't they supposed to know what the CCSD Campus Police are buying and who authorized the buying? And most of all, doesn't anyone want to know WHY they are buying these weapons? How did this get by the prior Trustees and the prior Superintendent?\r\n\r\nAs stated by CCSD Police, “But this department [CCSD Campus Police] isn't run like a normal police departmentÖ the people responsible for overseeing it really don't understand what they're doing.” How true this is; Arroyo knows it and he has been taking advantage of it - until now. Now he has been caught lying to the CCSD Trustees and the CCSD Superintendent by this reporter, and his lie was also caught on the CCSD Video on January 13, 2011, during the Trustees Board Meeting.\r\n\r\nHistorically, who on the Trustee and Superintendent level was running the CCSD Campus Police Department's ship? Arroyo has taken the helm all by himself with no accountably to anyone. The CCSD Police Department has been off doing its own thing without any monitoring or oversight at all. How could the Trustees and Superintendent discipline Arroyo when they have created a system wherein the truth is buried?\r\n\r\nOn August 10, 2010, Trustee Carolyn Edwards was interviewed on The Rose Moore Show where she was asked about the weapons that Arroyo bought. She stated that she got the e-mail that Arroyo wrote and was given to Mr. Ron Taylor and was given to this reporter. She stated that she would check into the rifles issue. Trustee Edwards has known about these weapons for five full months and chose not to do anything about it. Nothing! Nada! Trustee Edwards didn't even report it to the old trustees or the new trustees, or to our new superintendent.\r\n\r\nThis was reported to the Trustees and the Superintendent at the Thursday, January 27, 2011, board meeting by this reporter. Everyone was stunned. This is a very, very grave and serious issue. Being a Category 2 Police Department does not give them any legal rights to develop a SWAT Team or to stockpile weapons; and when a Trustee knew about this and did nothing, then both are guilty.\r\n\r\nStill, to this day, without a thorough investigation and inventory being done, no one knows why these weapons were purchased. Arroyo stated that they were for “practice only.” Question: Practice for what? No one knows what other weapons or how many other weapons they have. Are they creating a SWAT team? Are they stockpiling weapons for some reason? Do they think they are first responders when they are only a Category 2 - the same as a security guard? Las Vegas Metro Police Department is our team of first responders. Chief Arroyo seems to think the CCSD Campus Police are first. They are not trained by the Police Academy as Metro officers are; they are trained by POST. They have no training in being a SWAT Team as Metro does and Metro practices every day. CCSD Chief Arroyo has at times hid the weapons and no one was allowed to use them because some have come too close to the truth.\r\n\r\nChief Arroyo cannot say anything different. Through sources, it has been stated that the weapons are at the CCSD Henderson Police Station; plus, the officers are arriving at the shooting range bringing the weapons with them in their cars. This is important to know when the CCSD Superintendent and Trustees ask for an investigation and an inventory count; not only on the rifles and Storm Carbines, but also on the bullets they are using, and any other weapons they may have that no one knows about yet. Solution to the Problem:\r\n\r\nWhen a Chief of Police deliberately lies about tactical, assault weapons purchases; practicing with them at the shooting range with LIVE bullets; and lies to the School Board Trustees, Superintendent, the Superintendent's cabinet, the Deputy Superintendent, and others at this meeting, than Chief Arroyo needs to be fired and even arrested and never be in a position to get a job of that nature - or anything like it - again. Is what he did a felony? If he cannot account for the guns, even one, he can go to prison. His actions and lies are going to get someone killed and it could be a student or a teacher, or a parent or an advocate.\r\n\r\nSolution to the Problem:\r\n\r\n1) Have a sound, solid and comprehensive investigation done on CCSD Campus Police Chief Arroyo and his whole department and any off-shoots of the department, by the FBI, with a Las Vegas Metro Police assist. This must NOT to be another Internal Investigation. Either replace the Chief and the coverup accomplices with a trustful and honest team, or contract a security division with Las Vegas Metro Police Department, which is allowed by law.\r\n\r\n2) Define by policy and procedures exactly what the police department is supposed to do, who the chief reports to, and who the chain of command is for police on campus.\r\n\r\nFOOD FOR THOUGHT: When there is an emergency, you immediately dial 911 and you get the Las Vegas Metro Police Department, NOT the Clark County School District Campus Police.\r\n\r\nhttp://www.lasvegastribune.com/index.php?option=com_content&view=article&id=1577:ccsd-police-chief-arroyo-lied-about-purchase-of-tactical-assault-weapons&catid=219:local-news", "group_id": 3920, "id": 155200}]