[{"user_id": 39675, "stars": [], "topic_id": 44058, "date_created": 1313707049.8399301, "message": "Or should I ask the questions in the other group, then respond to them in this one, creating a separate topic for each aspect of the question-answer thingamajig?  Improv could be one.  Archtypes could be another, etc.", "group_id": 11394, "id": 1905247}, {"user_id": 7645, "stars": [], "topic_id": 44058, "date_created": 1313707591.559695, "message": "I had been meaning to do this for awhile but kept putting it off. Basically this is like two different sections on a forum - the other group is about discussing the theory and using it to help analyze and write stories. I know there are others who have their own versions of Dramatica or want to see it taken into different avenues, so this would be the place for that.", "group_id": 11394, "id": 1905281}, {"user_id": 39675, "stars": [], "topic_id": 44058, "date_created": 1313706947.90626, "message": "1.  Do I need to sign up?  2.  Can I still respond to the answers that were posted on my regular dram other thingamajig in the other group?  3.  How can I get answers if there are so few viewers, etc.?", "group_id": 11394, "id": 1905242}, {"user_id": 7645, "stars": [], "topic_id": 44058, "date_created": 1313707633.207592, "message": "Basically its to keep the noise level down on the other site and make sure that people new to the theory - people interested in using it to improve their writing - won't be distracted by more esoteric uses and discussions of the theory.", "group_id": 11394, "id": 1905286}, {"user_id": 7645, "stars": [], "topic_id": 44058, "date_created": 1313707721.606138, "message": "I wouldn't post questions in the other group if they belong here. Just post here and if people want to respond they can do so here.", "group_id": 11394, "id": 1905300}, {"user_id": 39675, "stars": [], "topic_id": 44058, "date_created": 1313712446.927562, "message": "I get the point about keeping the other list very basic, so as to not scare away new users.  Maybe we should change experimental dramatica to dramatica for actors, directors, and writers, or some other populist mood title.  We might reel in some fish from search engine inquiries <G>.  Experimental sounds so boring.  If we do the actors, directors, and writers thing, we could just let the experimental mood come as it will.  just thoughts", "group_id": 11394, "id": 1905653}, {"user_id": 7645, "stars": [], "topic_id": 44058, "date_created": 1313723196.0282891, "message": "That said, you can always create your own group and talk about whatever you want. Create a group is up above under Groups.", "group_id": 11394, "id": 1906947}, {"user_id": 7645, "stars": [], "topic_id": 44058, "date_created": 1313723109.54533, "message": "I'm all for changing it though I think Dram for Actors and Directors might be too narrow. There have been other instances where people have found themselves interested in modifying Dramatica or forking the theory. Experimental seems too describe it the best as these are all about experimenting with different ways of using the theory outside of writing. I'd be totally willing to change it though if you have a better name.", "group_id": 11394, "id": 1906938}, {"user_id": 39675, "stars": [], "topic_id": 44058, "date_created": 1313724009.1244371, "message": "I'm for broad and I'm for someone else doing the group <G>.  I don't want people to wander.  I am all for using dram just the way it is, within its non-experimental parameters, but with collaboration.  I trust your instinct with all of this.", "group_id": 11394, "id": 1907093}, {"user_id": 10814, "stars": [], "topic_id": 44058, "date_created": 1313769230.8933771, "message": "How about \"Using Dramatica for more than just Writing!\" \n\n...or...\n\n\"101 Other Uses for Dramatica\"\n\n...or...\n\n\"Alternative Uses for Dramatica\"   ???", "group_id": 11394, "id": 1910753}, {"user_id": 39675, "stars": [], "topic_id": 44058, "date_created": 1313806180.2964411, "message": "How about \n\n\"Using Dramatica for More\"", "group_id": 11394, "id": 1914596}]