[{"user_id": 24848, "stars": [{"date_created": 1301860797.320601, "user_id": 6812}, {"date_created": 1301906850.0445671, "user_id": 22200}], "topic_id": 16574, "date_created": 1301601436.731009, "message": "A lot of people are afraid of development, but should they be? Can you build an app even if you are not a developer? Sure you can! This is a story for how and why I build PresenterMate, and it proves that anyone can do it, just got to want it hard enough! -- http://impulse.kirillzubovsky.com/post/4239095638/presentermate", "group_id": 95, "id": 495329}, {"user_id": 20884, "stars": [], "topic_id": 16574, "date_created": 1301609994.270633, "message": "Nice.", "group_id": 95, "id": 497149}, {"user_id": 24848, "stars": [], "topic_id": 16574, "date_created": 1301611746.191318, "message": "@ahonorstudent Thank you!", "group_id": 95, "id": 497305}, {"user_id": 8501, "stars": [], "topic_id": 16574, "date_created": 1301658896.8982539, "message": "Wow. In 5-7 days, you went from having no idea how to program in Objective-C to finishing an app and submitting it to the App Store. Impressive! Is there a tutorial you really liked, that you could link me to? A few months ago I paid the $99 membership fee to become a Mac developer but as I started to read all the documentation Apple gives you it got surprisingly overwhelming. There didn't seem to be a good roadmap and the documentation all referenced xcode 3 even though the latest version was xcode 4. From your blog post, you appear to have learned more from Googling than you did from the Apple documentation. That gives me hope.", "group_id": 95, "id": 500707}, {"user_id": 19422, "stars": [], "topic_id": 16574, "date_created": 1301852679.7039249, "message": "Yes going on with it is a good solution. I'd recommend to floor and type the examples of a manual- even the Dummies will do dome good. And then google / stackoverflow the questions you have when stuck", "group_id": 95, "id": 515664}, {"user_id": 22200, "stars": [], "topic_id": 16574, "date_created": 1301907107.0879459, "message": "I've just started programming in Objective-C as well, and wrote a small app as a demo for my team. It probably took me about 6 or so hours to learn enough Objective-C and finish it. The art team is designing some pretty skin for it, and we're submitting to the Apple Store as soon as it's finished. :D More complex apps to follow, with more hours of learning to be invested learning ofc.", "group_id": 95, "id": 521755}, {"user_id": 22200, "stars": [], "topic_id": 16574, "date_created": 1301908438.4262481, "message": "The app is for the iPhone, btw, not the Mac :)", "group_id": 95, "id": 521873}]