[{"user_id": 7664, "stars": [], "topic_id": 18184, "date_created": 1302311478.1385911, "message": "Some definitions just don't make any sense to me. Alas. \"Induction\" is one of them.\n\nTo my reading, it means \"you will never be surprised\" because you've put together what is possible.\n\nDoes anybody have a gist or something I could use to boot my brain and make more sense of this?", "group_id": 2515, "id": 598588}, {"user_id": 7669, "stars": [], "topic_id": 18184, "date_created": 1302332779.9860289, "message": "I have to admit, even after all these years, \"Induction\" and \"Deduction\" is one of those places on the chart that still makes my brain lock up...  Chris?  Jim?  Little help?", "group_id": 2515, "id": 600513}, {"user_id": 7645, "stars": [], "topic_id": 18184, "date_created": 1302336403.7937329, "message": "Actually I have a drawing in my notes that I made based on an explanation you gave Sandy! Basically, if you hold your hands out, Induction takes a small gap between them and makes it bigger, Deduction takes a bigger gap and makes it smaller. I'll see if I can find the drawing", "group_id": 2515, "id": 601107}, {"user_id": 7645, "stars": [], "topic_id": 18184, "date_created": 1302336818.5430241, "message": "\"But that sounds like Production and Reduction\". I know, but to me it makes sense. One takes the whole lot of clues and narrows it down till you are certain, the other takes what little you have to go on and begins thinking of all the possibilities.", "group_id": 2515, "id": 601138}, {"user_id": 7645, "stars": [], "topic_id": 18184, "date_created": 1302336862.405241, "message": "A really great post from Armando can be found here. http://www.dramatica.com/theory/tip_of_month/tips/tip1107.html", "group_id": 2515, "id": 601142}, {"user_id": 7664, "stars": [], "topic_id": 18184, "date_created": 1302390677.5228219, "message": "The other way I'm thinking about it now is \"weak theory\" -- if you like ballet dancing, you'll like opera, or tap dancing. Possibly.", "group_id": 2515, "id": 606216}, {"user_id": 10814, "stars": [{"date_created": 1305585662.0210111, "user_id": 7645}], "topic_id": 18184, "date_created": 1302502043.4198351, "message": "Induction is the process of taking a small pattern and finding all the other patterns that include that smaller pattern.  Mike's example starts with dance and expands to everything that has dance as part of it, such as different types of dance, or dance-related items, dancers, etc.  Induction is inclusive.\n\nDeduction is the opposite process.  It would only match things that ONLY are dances.  Deduction is exclusive.", "group_id": 2515, "id": 620416}, {"user_id": 10814, "stars": [], "topic_id": 18184, "date_created": 1302533497.9545009, "message": "After thinking on my example, I believe it works better if you have several items under consideration (think of clues).", "group_id": 2515, "id": 624797}, {"user_id": 10814, "stars": [{"date_created": 1305585637.8961041, "user_id": 7645}], "topic_id": 18184, "date_created": 1302533732.5573089, "message": "For example:\n\nInduction looks for larger patterns that incorporate most of the items.\n\nDeduction looks for smaller patterns that incorporate most of the items.\n\nProduction looks for larger patterns that incorporate ANY of the items.\n\nCertainty looks for the one and only pattern that matches ALL of the items.", "group_id": 2515, "id": 624840}, {"user_id": 7664, "stars": [], "topic_id": 18184, "date_created": 1302545868.4675231, "message": "This was a great response, Chris. Thank you.", "group_id": 2515, "id": 627454}]