[{"user_id": 39842, "stars": [], "topic_id": 44018, "date_created": 1313666979.76157, "message": "Now hows the best way to handle this? I've read that subclassing the User class is bad (I'm not entirely sure why though). Most examples try to extend the User class, with a UserProfile class with a OneToOne relationship to the User class (like this http://pastebin.com/GQVLrVTx). Is it better to extend that to a UserProfileMerchant and UserProfileCustomer, or have a single UserProfile, and have a boolean field to indicate if the account is a Merchant? (both examples in the following - http://pastebin.com/F8ZenCa1)", "group_id": 81, "id": 1900931}, {"user_id": 39842, "stars": [], "topic_id": 44018, "date_created": 1313666583.980206, "message": "I'm wondering what the best approach is too creating different Users. I'm trying to make a online shop, that features two types of Users, \"Customers\" and \"Merchants\". The power of each Users vary greatly, Customers can buy items from Merchants and Merchants can (as you would expect) list new products, edit them. Merchants required additional information compared to Customers (such as Address, Contact Info, Payment details).", "group_id": 81, "id": 1900907}, {"user_id": 13325, "stars": [], "topic_id": 44018, "date_created": 1313675184.780647, "message": "Depends what you want to do with them. Most things could be accomplished using Django permissions system and assigning groups.", "group_id": 81, "id": 1901609}, {"user_id": 39842, "stars": [], "topic_id": 44018, "date_created": 1313676294.7446761, "message": "Ah, I have been neglecting Groups and Permissions. It seems under documented compared to other features of Django?", "group_id": 81, "id": 1901760}, {"user_id": 28981, "stars": [], "topic_id": 44018, "date_created": 1313678062.598182, "message": "@thisiscam I tend to prefer a common UserProfile, because there's likely to be fields common to all types of users. That's the model where they all go. You can go with a user_type field which has a choice option. You can even try inheriting UserProfile to CustomerProfile, MerchantProfile, and have the extra fields in the sub classes", "group_id": 81, "id": 1902007}, {"user_id": 27863, "stars": [], "topic_id": 44018, "date_created": 1313706884.201534, "message": "same here.. needed diffirent user roles with diffirent profile fields and rights. (Radiostation DJs and Listeners/Users)", "group_id": 81, "id": 1905234}]