[{"user_id": 8139, "stars": [], "topic_id": 17135, "date_created": 1301894489.0567119, "message": "Don't know if it's just me or not but it certainly is enough to kill the user experience for me on this site, everything else is great, just this one thing.", "group_id": 88, "id": 520744}, {"user_id": 8139, "stars": [], "topic_id": 17135, "date_created": 1301894429.8870411, "message": "Hey guys I posted this is the ask developers anything thread but thought it may get some more attention here:", "group_id": 88, "id": 520739}, {"user_id": 8139, "stars": [], "topic_id": 17135, "date_created": 1301894433.52581, "message": "I have noticed that the scrolling in a thread has always been slow on convore, for from the smooth scroll you expect on web sites/apps. Went into chrome dev tools to investigate a bit, seems that the paint event is taking 100ms+ as opposed to 10ms or less on other things with complex structure. This is a full HD size though, if I make the browser window a lot smaller it becomes smooth.", "group_id": 88, "id": 520740}, {"user_id": 4, "stars": [], "topic_id": 17135, "date_created": 1301930986.022568, "message": "yeah we are aware of the paint times, and the sluggish scroll speed. It is a hard bug to track town we are seeing very weird things on what effects. CSS3 things like box-drop-shadow and background gradients seem to effect it the most which is a shame. cause we use a lot of css3. what pisses me off even more is that it seems to be a webkit thing as in ff seems to be fine. It also depends on your comp if you have a fast comp like an i5 mbp or higher ;) its not really noticeable but if you have anything slower it becomes more noticeable. With all that said we need to figure out a solution for it, with all these different variables you can understand why its kind of a pain. @_RobRyan Can you confirm for me if its better in ff for you?", "group_id": 88, "id": 524051}, {"user_id": 8139, "stars": [], "topic_id": 17135, "date_created": 1301981562.090832, "message": "I might be a windows thing, just trying it now in chrome on last gen MBP with the core 2 duo and it's pretty good speed wise, noticeably better, similar on FF on the Mac, not sure about FF on the PC, think it was better. Maybe there is a windows specific webkit bug because generally my PC would be faster than the MBP.", "group_id": 88, "id": 535612}]