[{"user_id": 11626, "stars": [], "topic_id": 6723, "date_created": 1297912752.916373, "message": "You can expect to see at least two people inside the secret bunkers in Virginia where the CIA pilots its lethal drones over Pakistan. One controls the distant drone, his hand on a joystick, ready to fire off a missile at a target below. Another is a CIA lawyer, watching to ensure that the operator is within his rights to attack his target. Call it a “punctilious” method to avoid civilian casualties and legal hot water, as one of those lawyers recently did — or call it the bureaucratization of a shadow war.\r\n\r\nTara Mckelvey gets a very rare peek inside the processes that go into the drone strikes, an undeclared air war that peaked last year at 118 missile firings, up from 33 in 2008. Her conclusion, published today in Newsweek, is that the operations ordering them are “multilayered and methodical, run by a corps of civil servants who carry out their duties in a professional manner.” But even the CIA’s former top lawyer, John Rizzo, is blunt about his involvement in what he calls “murder.”\r\n\r\nRizzo told Mckelvey that the process works roughly like this: the CIA’s Counterterrorist Center maintains a team of ten lawyers, who compile evidence that a prospective target constitutes a threat to the U.S. If Rizzo outlined the threshold that the lawyers have to meet, Mckelvey doesn’t report what it is, nor does she explain who asks the lawyers to compile a case on a particular target. But the CIA’s general counsel vets the case before issuing what Rizzo, who held the job during the Bush and early Obama administrations, calls a “death warrant.” The president doesn’t review the targeting list.\r\n\r\nAlthough at least some cases don’t make the cut — either by CIA lawyers or senior officials, it’s unclear — Mckelvey writes that “government officials have to go through a more extensive process in order to obtain permission to wiretap someone in this country than to make someone the target of a lethal operation overseas.” It’s also worth mentioning that the Democratic-controlled Senate in 2007 refused to confirm Rizzo for the permanent general counsel job because of his legal involvement in the CIA’s torture program.\r\n\r\nWhat the CIA lawyers are reviewing the drone program for is a mystery. Some law professors contend that the very involvement of CIA civilians or contractors in an inherently military program like the drone strikes make their pilots “unlawful combatants,” as Georgetown’s Gary Solis tells Mckelvey. All the administration has said about its legal rationale for the strikes is that they must be “proportionate” to the threat and are “limited to military objectives,” i.e., they don’t intentionally target civilians. But as Mckelvey documents, there’s an awful lot of lawyers to review what is a murky legal standard, at least in public, for a shadow war.\r\n\r\nhttp://www.wired.com/dangerroom/2011/02/behind-the-drones-lots-of-bureaucracy", "group_id": 3920, "id": 129127}]