[{"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302181376.8996339, "message": "Not sure I can manage fri first practice at 255am !", "group_id": 6831, "id": 574897}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302181480.8510289, "message": "At least it's 8am for the race", "group_id": 6831, "id": 574908}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302256648.4106109, "message": "Muz , so will you be watching the race Live  ?", "group_id": 6831, "id": 588220}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302311826.0870659, "message": "Here is the post from F1 BB Forum", "group_id": 6831, "id": 598657}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302312300.763145, "message": "rigging", "group_id": 6831, "id": 598731}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302311917.011476, "message": "From Group: Ô£´ F1 BB Forum\n\nMessages\n----------\n\n  ** Apr 8 Fri 22:20 **\n  Ladi Ismail Okay gentlemen, ( and ladies if we have any) thots for this weekend?\n  ** Apr 8 Fri 22:22 **\n  Ladi Ismail Sorry for got to add \"Good _______\" fill in the blanks depending on where you are. I know Jino is in the US :D\n  ** Apr 8 Fri 22:24 **\n  Ladi Ismail Will HRT qualify this weekend? If it rains will the wet tyres last more than 5 laps?\n  ** Apr 8 Fri 22:35 **\n  Femi Peters Perhaps we will see the resurgence of Michael Schumacher. I have not given up on him. Lol\n  ** Apr 8 Fri 22:56 **\n  Dauda Fika Some body has me there is Schumacher for life Femi Peters thks for that\n  ** Apr 8 Fri 22:56 **\n  Ladi Ismail He dominated in the past bcos he slept at maranello race car testing and fine tuning his car. Testing is now limited. I shall wait and see how many times he will out qualify Rosberg :$\n  ** Apr 8 Fri 22:57 **\n  Ladi Ismail And then I will rethink my outlook about him\n  ** Apr 8 Fri 22:58 **\n  Dauda Fika Ok keep it positive\n  ** Apr 8 Fri 22:59 **\n  Femi Peters I wish I had a crystal ball. I bet if he had a good car he might be able to do something, don't forget that Alain Prost won his last championship at 41 with the best car on the grid!\n  ** Apr 8 Fri 23:03 **\n  Dauda Fika Yes Femi I agree I subscribe to that but I ended in a hot excange with a German Doctor in Hardhime who hated his country\n  ** Apr 8 Fri 23:04 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº Michael is 42, and if Merc had the best car on the grid, Nico will be ahead of Michael..  He really needs an exit strategy..  And he needs it real quick!\n  ** Apr 8 Fri 23:04 **\n  Ladi Ismail Yep he should leave :D\n  ** Apr 8 Fri 23:13 **\n  Femi Peters The truth is I wish he did not come back. He has tarnished his image a bit\n  ** Apr 8 Fri 23:19 **\n  Ladi Ismail Not a bit ooooo. A LOT. 7 time World Champion not even mixing it with the big, ok small, boys. Yes he doesn't have a good car, he shuld have stayed away\n  ** Apr 8 Fri 23:21 **\n  Femi Peters True dat\n  ** Apr 8 Fri 23:49 **\n  Ôøº Maclee Ôøº Sometimes too painful to watch!\n  ** Apr 9 Sat 00:02 **\n  Femi Peters Big time\n  ** Apr 9 Sat 00:06 **\n  Femi Peters I became a shuey fan after Senna. Who was my hero died at Imola. The guy is great. I guess age catches up eventually. What more can I say? But Schumi has given me so much pleasure over the years that its hard not to see him up on the podium. So please bear with me!\n  ** Apr 9 Sat 00:07 **\n  Ladi Ismail Just a little late night read http://bit.ly/faPlpm\n  ** Apr 9 Sat 00:18 **\n  Femi Peters Please Guys what time is qualifying today? Is is live on TV?\n  ** Apr 9 Sat 00:19 **\n  Ladi Ismail Yep at 9am\n  ** Apr 9 Sat 00:19 **\n  Ladi Ismail Practice 3 is at 6am\n  ** Apr 9 Sat 00:20 **\n  Ladi Ismail BBC 1, not sure u r in US or UK\n  ** Apr 9 Sat 00:20 **\n  Femi Peters Many thanks! Its nice to watch in HD is' nt it?\n  ** Apr 9 Sat 00:21 **\n  Femi Peters I am in UK. Ta\n  ** Apr 9 Sat 00:34 **\n  Femi Peters El Bams, you used to be a Shumi man. Remember supporting a team is like marriage. The fact the Man U is not doing well this season does not mean you start supporting Man city. Catch m drift?\n  ** Apr 9 Sat 01:00 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº I used to support Ferrari, until when they  messed up at one of the  indianapolis races, when I had to watch only 6 bridgestone cars race( safety issues  with michellin/ Bridgestone).  Ferrari seems to have too much power over FIA and could not be bother  about giving the fans  a good show, . Let me be clear, I love Michael schmey, and that has not change, but I just think the decision he made to return was awful.  At the moment, all I am after is some serious wheel to wheel racing, and a gr8 show.  I miss JP Montoya, becos he brings excitement to the race.. We need some crazy driver, Kobayachi and Perez look promising. Going back to Michael, he does not excite me as he used to, if he did not return, I would at least have had some good memories of how he used to win (michael/Ross).\n  ** Apr 9 Sat 01:07 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº In a nutshell, if supporting a team is like a marriage, I an divorcing, but Ferrari and schmey..  Don't let me start on Alonso \"cry baby\" or Massa who's confidence has been mashed up..  Ferrari lol.. They even wanted to tap Adrian Newey.    See what Ferrari did to Mclaren.. Getting Alonso to set them up and they lost all the price money for the season(remember the Alonso/lewis saga)  Let's no go there..  Ferrari yab!!\n  ** Apr 9 Sat 01:08 **\n  Ladi Ismail Preach It, Bro\n  ** Apr 9 Sat 01:10 **\n  Femi Peters Why do you guys hate Alonso that bad?\n  ** Apr 9 Sat 01:10 **\n  Ladi Ismail Let me see............\n  ** Apr 9 Sat 01:11 **\n  Ladi Ismail 1. Whinging\n  ** Apr 9 Sat 01:11 **\n  Ladi Ismail 2.\n  ** Apr 9 Sat 01:11 **\n  Ladi Ismail 2. Asking his boss to tell his teammate to let him thru\n  ** Apr 9 Sat 01:12 **\n  Ladi Ismail 3. Crying over spilt milk. (   FIA- Ferrari International Assistance)\n  ** Apr 9 Sat 01:13 **\n  Ladi Ismail 4. Not a team player (mclaren period)\n  ** Apr 9 Sat 01:13 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº So, this 2011 season, - let's hope the flexible wings, KERs brings us some good action.. I did not feel the australian GP, which left me cold to be honest. Infact, I had to go watch MotoGP for some action ;) ( can you imagine ) lol . As for, Alonso, I only like him when he is driving, and there is just on comment I will make \" Attitude is everything\"\n  ** Apr 9 Sat 01:14 **\n  Ladi Ismail @elbams true\n  ** Apr 9 Sat 01:14 **\n  Ladi Ismail Can't remember the otHers as I am feeling woozy\n  ** Apr 9 Sat 01:14 **\n  Ladi Ismail Need sleep\n  ** Apr 9 Sat 01:15 **\n  Ladi Ismail Ahhhhhh\n  ** Apr 9 Sat 01:15 **\n  Ladi Ismail Alonso will be a great driver if he cuts out all the whinging and crying\n  ** Apr 9 Sat 01:16 **\n  Ladi Ismail (=|\n  ** Apr 9 Sat 01:16 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº he messed Mclaren up, so he could get a drive with Ferrari, (he had a deal with Ferrari).\n  ** Apr 9 Sat 01:17 **\n  Ladi Ismail Yep he did\n  ** Apr 9 Sat 01:22 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº Femi, I hope I have convinced you beyond any reasonable doubt that Ferrari, schmey. even Alonso are not to be supported until they display, good sportsmanship spirit, respect for fans, and relinquish control over FIA( Also, Dodt should not be the FIA president).\n  ** Apr 9 Sat 01:34 **\n  Femi Peters Lol\n  ** Apr 9 Sat 01:35 **\n  Femi Peters What if it was Ron Dennis that was president?\n  ** Apr 9 Sat 01:36 **\n  Femi Peters Get real man, obviously you are entitled to your opinion\n  ** Apr 9 Sat 01:38 **\n  Ô£´ Ôøº Bamiwo \"Elbams\"  Sanusi Ôøº I would not want Ron Dennis to be President either.\n  ** Apr 9 Sat 01:38 **\n  Femi Peters But its wrong. Jean Todt would never have been allowed to be president if it was assumed he would be partial, the FIA is not Nigeria\n  ** Apr 9 Sat 01:39 **\n  Bamiwo \"Elbams\"  Sanusi :Well, it's not far off.\n  ** Apr 9 Sat 01:45 **\n  Bamiwo \"Elbams\"  Sanusi: Why did Jean Todt decide not to seat in the team order case last season, ( becos he did not want people to think he was partial.) Meanwhile, he has been elected as the president and has a responsibility to FIA.(Is he paid to be FIA president? )  Anyway,  what the heck is he doing there.  These are the sort of thing that happen in 9ja.  So, it's really not far off.\n  ** Apr 9 Sat 01:47 **\n  Femi Peters Remember he contested an election an won\n  ** Apr 9 Sat 01:47 **\n  Bamiwo \"Elbams\"  Sanusi: Someone has been given a position but does not want to be held accountable..\n  ** Apr 9 Sat 01:47 **\n  Femi Peters Unfortunately u did not vote\n  ** Apr 9 Sat 01:51 **\n   Bamiwo \"Elbams\"  Sanusi: Yes you are absolutely correct , he won the election for Ferrari International Assistance(FIA). And like in 9ja, they did some serious rigging. Golf course votes, PR   etc etc ..\n  ** Apr 9 Sat 02:07 **\n   Bamiwo \"Elbams\"  Sanusi: Even those who had the credentials for the position were talked into not contesting :). Lol..   Even Bernie( the wanna be rain maker)  sucks up to Ferrari. Can you imagine if Bernie was allowed  to introduce  artificial rain to F1 ( you will see some serious results ringing). Lol ..\n", "group_id": 6831, "id": 598665}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302422488.7994139, "message": "Anyone watching ?", "group_id": 6831, "id": 608430}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302425450.014888, "message": "Come on rain!", "group_id": 6831, "id": 608528}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302423446.053623, "message": "Yes am watching", "group_id": 6831, "id": 608467}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302428259.152842, "message": "Flying lotus", "group_id": 6831, "id": 608589}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302435539.684448, "message": "If RedBull do not get KERS working, their ass is going to be grass and Mclaren  will smoke it", "group_id": 6831, "id": 609121}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302439609.2944429, "message": "They need to pick their game up if they wanna beat RB. Sure JB will be well happy with result ESP based on start", "group_id": 6831, "id": 609379}, {"user_id": 21704, "stars": [], "topic_id": 16226, "date_created": 1302525890.978075, "message": "Absolutely, He has to be happy about that .. but i suspect Lewis is not very happy about Jenson's race..  (from one of his interviews, but I might be wrong) . One thing is for sure, Adrian Newey has 5 more days to get KERS working before the Chinese grand prix, which had a lot of straights. If he doesn't get it working, then RebBulls ass will be grass and Mclaren will be happy to smoke it .. lol ..", "group_id": 6831, "id": 623605}, {"user_id": 21701, "stars": [], "topic_id": 16226, "date_created": 1302623862.3169279, "message": "Don't think they will have let's for this weekend. To short a time and away from base. Tires seems to be the big thing this year and at the moment red bull seem to be on top of it. The others will catch up thou. Have to see what happens in china", "group_id": 6831, "id": 644432}]