[{"user_id": 7998, "stars": [], "topic_id": 4745, "date_created": 1297590591.0859699, "message": "Why do you use Ruby, and when?", "group_id": 109, "id": 89381}, {"user_id": 4156, "stars": [], "topic_id": 4745, "date_created": 1297608290.946682, "message": "Not really, partly as they have very similar overall syntaxes, so I don't have the \"forgot my semicolons\" problem as one has with C-based langs.", "group_id": 109, "id": 91243}, {"user_id": 4156, "stars": [], "topic_id": 4745, "date_created": 1297608362.234267, "message": "I find that using Ruby makes me more likely to favor OO design in Python (where I used to be more of a \"start out with just functions\" guy)", "group_id": 109, "id": 91255}, {"user_id": 3368, "stars": [], "topic_id": 4745, "date_created": 1297608840.8813109, "message": "Thanks :)", "group_id": 109, "id": 91293}, {"user_id": 3368, "stars": [], "topic_id": 4745, "date_created": 1297607818.558605, "message": "@bitprophet, Do you find it hard to switch between them?", "group_id": 109, "id": 91181}, {"user_id": 4156, "stars": [], "topic_id": 4745, "date_created": 1297608310.230526, "message": "I do find myself often trying to do <iterable>.each in Python instead of for x in <iterable>, though :D", "group_id": 109, "id": 91249}, {"user_id": 4156, "stars": [{"date_created": 1299739232.3549299, "user_id": 1521}], "topic_id": 4745, "date_created": 1297608371.0966921, "message": "and using Python makes my Ruby probably a bit more readable than some folks' ;)", "group_id": 109, "id": 91257}, {"user_id": 4156, "stars": [], "topic_id": 4745, "date_created": 1297607639.566952, "message": "I use it when it's the right tool for the job (eg when I need to do X and Ruby has the better libraries for it) or when I have a toy project and want to just get better at thinking in Ruby", "group_id": 109, "id": 91136}, {"user_id": 4156, "stars": [], "topic_id": 4745, "date_created": 1297607577.366236, "message": "My other main language is Python, so I use Ruby because it has a looser and more \"fun\" syntax, and because I'm a sucker for all your wacky DSLs ;)", "group_id": 109, "id": 91127}, {"user_id": 4653, "stars": [], "topic_id": 4745, "date_created": 1297618610.3980041, "message": "I've been using Ruby on big projects lately and I think it all depends on what you're working on. For instance, what are you going to do with Ruby? a Web Application? a parser?", "group_id": 109, "id": 92295}, {"user_id": 4653, "stars": [], "topic_id": 4745, "date_created": 1297618803.7656169, "message": "Also there's a great amount of users in the community who have developed lot of tools that are going to make your life easier as a Developer. 90% of the things you're going to need will be available as Gems.", "group_id": 109, "id": 92327}, {"user_id": 4653, "stars": [], "topic_id": 4745, "date_created": 1297618748.7652061, "message": "There's not one single language that it's \"the best\" for all situations. So for instance, Ruby has Rails, and Rails has become very popular because of the paradigms it proposes. What are the benefits of using Rails vs a PHP like Zend Framework? Firstly Ruby is so flexible that allows you to do a lot of magic and it's very readable, which is excellent for working quickly with teams to make maintainable code.", "group_id": 109, "id": 92319}, {"user_id": 8891, "stars": [{"date_created": 1297631689.9430461, "user_id": 6612}], "topic_id": 4745, "date_created": 1297622625.1572969, "message": "Why Ruby? For me, and I think a lot of programmers, it's a breath of fresh air. So many people are in the trenches with C#, Java, and PHP where most of your work is in getting the language to do what you really *want* it to. Ruby has a sort of elegance that lets you do things in a way that is engaging, while producing code that is reusable and follows conventions. Hacks aren't; that's powerful.", "group_id": 109, "id": 92784}, {"user_id": 8891, "stars": [], "topic_id": 4745, "date_created": 1297622478.5644181, "message": "Re: Rails vs Zend, there's really not much of a comparison once you get past the MVC underpinnings. Despite coming off as an enterprise grade framework, Zend is buggy and ditches older releases too quickly for use in a production environment, and it's too heavy to be much of a \"get bootstrapped\" framework.", "group_id": 109, "id": 92768}, {"user_id": 6612, "stars": [], "topic_id": 4745, "date_created": 1297631771.1420021, "message": "@coreyward I agree, Ruby is very accessible and much less of a struggle than most other languages.", "group_id": 109, "id": 93768}, {"user_id": 6612, "stars": [], "topic_id": 4745, "date_created": 1297631842.129334, "message": "Also the 'everything is an object' works allot like my mind tends to think. Having said that, Ruby is definitely not suited for everything.", "group_id": 109, "id": 93783}]