[{"user_id": 11626, "stars": [], "topic_id": 42776, "date_created": 1311724864.4358361, "message": "Spontaneous social media revolution erupts, thousands say 'f*&% you' to Washington\r\nNatural News\r\nJuly 26, 2011\r\n\r\n(NaturalNews) Users of the popular social media site Twitter know that \"trending\" topics, or popular topics that are being \"tweeted\" about often on the site, are typically accompanied by \"hash tags\" that help better categorize and popularize them. Tweets about natural health, for instance, may contain \"#naturalhealth\" in their descriptors, in order to help popularize the topic. And over the weekend, an outpouring of tweets against politicians in Washington, DC, erupted, which caused the hash tag \"#f*&%youwashington\" (except without the special characters, of course) to become a popular trending topic.\r\n\r\nSparked by Jeff Jarvis, a professor of journalism from the City University of New York, a wildfire of online outrage against things like government bailouts, rigged elections, the spiraling economy, universal healthcare, the escalating police state, loss of freedom and liberty, and even the subsidization and open support of genetically-modified organisms (GMOs), began suddenly on July 23, and continues to this day.\r\n\r\nOne Twitter user tweeted \"[#f*&%youwashington] for giving multinational companies all of the benefits (legal, $) and leaving the citizenry all the costs (enviro, $),\" while another tweeted, \"[#f*&%youwashington] for allowing media bias and corporate lobbyist [sic] to decide the agenda. Where is transparency?\"\r\n\r\nConcerning GMOs, one person tweeted \"[F*&%youwashington] for unleashing the horrors of #Monsanto into our lives and continuing to do so. Let's go organic, go local, get real!\" Another tweeted \"[#f*&%youwashington] for allowing the illegal Federal Reserve to steal our wages!\", following by a shorthand version of the hash tag \"#FYW.\"\r\n\r\nSince the public outcry against Washington first began on Twitter, many users have added Twitter as a target of their retorts as well, citing allegations that the social media site is openly censoring their tweets from the trending topic list. And after reviewing the Twitter feed of posts for ourselves, it is clear that Twitter is actively removing the \"#f*&%youwashington\" hash tag from its archives, as a message stating \"Older Tweet results for [#f*&%youwashington] are unavailable.\"\r\n\r\nhttp://www.naturalnews.com/033134_social_revolution_Washington.html", "group_id": 3920, "id": 1727365}]