[{"user_id": 243, "stars": [], "topic_id": 7115, "date_created": 1297982055.5571921, "message": "Hi, my name is Jameson Hsu and I'm one of the founders of Mochi Media.  I live in San Francisco and will be attending FGS and GDC this year.  Please share a little about yourself.  ^__^", "group_id": 4419, "id": 137283}, {"user_id": 7012, "stars": [], "topic_id": 7115, "date_created": 1297982700.3466859, "message": "Hi Jameson, I'm Anatoly, CEO of innoWate, social games developer from Europe. We've met few times occasionally before on various conferences, including Casual Connect. Hope to visit FGS this year!", "group_id": 4419, "id": 137425}, {"user_id": 13360, "stars": [], "topic_id": 7115, "date_created": 1298006816.5738051, "message": "Hi, I'm Colin. I'm the Product Marketing Manager at Mochi Media and one of the things I do is help organize Flash Gaming Summit! I'm looking forward to meeting those of you who were lucky enough to get tickets before they sold out, and for those who didn't there WILL be a live stream again this year. :)", "group_id": 4419, "id": 139948}, {"user_id": 222, "stars": [], "topic_id": 7115, "date_created": 1298007191.181936, "message": "I'm Bob Ippolito and I'm the other founder of Mochi Media. I will be living in San Francisco again starting Monday. I'll of course be attending FGS but will likely skip most of GDC ;)", "group_id": 4419, "id": 139995}, {"user_id": 15697, "stars": [], "topic_id": 7115, "date_created": 1298575974.250062, "message": "Hi guys! My name is Ammar Mardawi and I'm the CEO of Kindisoft. We help Flash developers protect their source code from Flash decompilers. I'm coming all the way from Jordan and looking forward to network and connect at FGS. Come and see me at our sponsor table :)", "group_id": 4419, "id": 200960}, {"user_id": 15712, "stars": [], "topic_id": 7115, "date_created": 1298576243.7411571, "message": "does anyone know if investors will also be coming to the FGS? I'd certainly like to talk to them.  Hit me up as3isolib (at) gmail dot com if you are.  thanks", "group_id": 4419, "id": 201038}, {"user_id": 15713, "stars": [], "topic_id": 7115, "date_created": 1298576313.816484, "message": "Hi. My name is Baris Yaman and I am the lead flash engineer at A Bit Lucky, maker of 'Lucky Train' on FB. Looking forward to the summit.", "group_id": 4419, "id": 201055}, {"user_id": 15705, "stars": [], "topic_id": 7115, "date_created": 1298576153.0246351, "message": "Hi Anatoly! Been reading your posts for a while. Alas, going to be watching remotely, good traffic = in the office.", "group_id": 4419, "id": 201024}, {"user_id": 223, "stars": [], "topic_id": 7115, "date_created": 1298575285.5130939, "message": "Hi everyone! My name is Ada Chen Rekhi and I work on product at Mochi Media and also help run the Flash Gaming Summit conference. I'll be at FGS and am looking forward to meeting people, especially great game developers!", "group_id": 4419, "id": 200674}, {"user_id": 15691, "stars": [], "topic_id": 7115, "date_created": 1298576085.267319, "message": "Hey, My name is Christopher Gregorio and I am the Co-Founder of Agitated Ferret and have developed several big games such as Penguin Massacre and Medieval Rampage.  Excited to get to meet all of you at FGS.", "group_id": 4419, "id": 200993}, {"user_id": 15688, "stars": [], "topic_id": 7115, "date_created": 1298575556.594136, "message": "I'm Tim, and if I'm interested in meeting with folks at the event that are looking for new ways to monetize their apps/games and acquire new users on both the web and Mobile. Contact me directly to meet at the event! www.srpoints.com", "group_id": 4419, "id": 200759}, {"user_id": 15712, "stars": [], "topic_id": 7115, "date_created": 1298575998.2350011, "message": "I'm Justin, creator of the as3isolib.v1 and working on v2.  Hoping to get new ideas, talk about Molehill for 2D rendering performance increases and also maybe get to chat with PBE guys.  Looking forward to seeing you folks.", "group_id": 4419, "id": 200968}, {"user_id": 15726, "stars": [], "topic_id": 7115, "date_created": 1298577506.606848, "message": "Hi, everyone!  My name is Alan Miller.  I've just joined a new company GamesAnalytics that provides turnkey behavioral analytics for MMO's, social games, and virtual worlds. Extremely easy to integrate.  Please look me up if you'd like to learn more.  We're also exhibiting at GDC.  I've been in the games industry quite a while - co-founded Activision and Accolade.  I look forward to meeting you at FGS.", "group_id": 4419, "id": 201347}, {"user_id": 15705, "stars": [], "topic_id": 7115, "date_created": 1298576235.119262, "message": "Hi Ammar, a client here. Good product.", "group_id": 4419, "id": 201037}, {"user_id": 15705, "stars": [], "topic_id": 7115, "date_created": 1298576200.259346, "message": "Hi Ada, been parsing Andrew's posts for some time.", "group_id": 4419, "id": 201032}, {"user_id": 15709, "stars": [], "topic_id": 7115, "date_created": 1298576087.1840849, "message": "Hola.  Tass here...  If you have a game in late-stage development and want concise, specific feedback and advice from an end-user perspective, I'd love to chat.  :)  Or if you're a developer or sponsor who wants to get the most out of their sponsorship via an in-game walkthrough...  well...  I have 400+ games under my belt totaling over 75 million views.", "group_id": 4419, "id": 200994}, {"user_id": 3592, "stars": [], "topic_id": 7115, "date_created": 1298576057.4644561, "message": "@mardawi We're looking for something like that, we should connect at the conference", "group_id": 4419, "id": 200987}, {"user_id": 15727, "stars": [], "topic_id": 7115, "date_created": 1298576991.808876, "message": "hi.I am Mert Can.I am owner of gameskk.com and I am developing flash games.", "group_id": 4419, "id": 201248}, {"user_id": 249, "stars": [], "topic_id": 7115, "date_created": 1298577890.332973, "message": "Hi, My name is Ryan Nichols, VP of Product Management at Mochi. I'll be at FGS and GDC all week. Love to connect with devs and always looking to learn more about how Mochi can help your game development businesses grow!", "group_id": 4419, "id": 201425}, {"user_id": 15713, "stars": [], "topic_id": 7115, "date_created": 1298577255.972434, "message": "@gameskk Hey Mert, I'd love to meet. Send me an email at barisyaman -at- yahoo if interested.", "group_id": 4419, "id": 201288}, {"user_id": 15731, "stars": [], "topic_id": 7115, "date_created": 1298577626.8471301, "message": "Hey Guys! I'm Sash, founder of Bit Battalion. I've made a bunch of flash games and am looking forward to my first visit to FGS!", "group_id": 4419, "id": 201372}, {"user_id": 15705, "stars": [], "topic_id": 7115, "date_created": 1298581722.00317, "message": "About us:  a social gaming site with members in 165+ countries, 95% female, good growth. We control all media rights to Scholastic's 44 book Pony Pals series. As one member wrote, \" wow, you made a girls game that isn't sappy or dippy.\" Yup.  www.clubponypals.com", "group_id": 4419, "id": 202148}, {"user_id": 15697, "stars": [], "topic_id": 7115, "date_created": 1298580672.1635511, "message": "@clubponypals happy to hear that!", "group_id": 4419, "id": 201976}, {"user_id": 528, "stars": [], "topic_id": 7115, "date_created": 1298581461.6450281, "message": "Hi jameson!", "group_id": 4419, "id": 202091}, {"user_id": 528, "stars": [], "topic_id": 7115, "date_created": 1298581466.8048069, "message": "Hi ada!", "group_id": 4419, "id": 202094}, {"user_id": 15743, "stars": [], "topic_id": 7115, "date_created": 1298580439.0773511, "message": "Hi everyone!  I'm Ross Przybylski, founder of D20Studios and creator of multiplayer Flash game \"Hero Mages\". I'm attending Mochi Flash Gaming Summit next week to meet fellow developers and industry experts. I have lots to share about creating multi-user games as well as porting Flash games to mobile devices.  I'm seeking to learn how to effectively market and price games for sale as well as find partners to work with.", "group_id": 4419, "id": 201949}, {"user_id": 15697, "stars": [], "topic_id": 7115, "date_created": 1298580494.056452, "message": "hey @khangtoh I'd love to meet!", "group_id": 4419, "id": 201959}, {"user_id": 15762, "stars": [], "topic_id": 7115, "date_created": 1298581904.0882311, "message": "Hi, Andy here from www.BulletProofArcade.com - Unfortunately can't make it to FGS this year - but our programmer Aaron will be there.", "group_id": 4419, "id": 202173}, {"user_id": 15763, "stars": [], "topic_id": 7115, "date_created": 1298582302.280134, "message": "Hey, I'm Lavon Woods, and I am the founder of GameBuilder Studio (http://gamebuilderstudio.com/) I look forward to FGS as it is my first year. Hope to meet some interesting flash devs also.", "group_id": 4419, "id": 202226}, {"user_id": 15717, "stars": [], "topic_id": 7115, "date_created": 1298584246.087894, "message": "Is the conference going to be broadcast on the web like last year ? I'll be tuning in from Montreal if that's the case.", "group_id": 4419, "id": 202570}, {"user_id": 243, "stars": [], "topic_id": 7115, "date_created": 1298588912.9893539, "message": "Hi @2lik I remember you well.  =)  Please say hi if you see me at FGS.  I'd love to see your new games.", "group_id": 4419, "id": 203471}, {"user_id": 243, "stars": [], "topic_id": 7115, "date_created": 1298588947.583699, "message": "hi @liveink!  See you and Mary on Sunday.", "group_id": 4419, "id": 203476}, {"user_id": 13360, "stars": [], "topic_id": 7115, "date_created": 1298594144.3401811, "message": "@Chakawi yes we'll be streaming the event live again this year- check the website, info should be available by Saturday evening.", "group_id": 4419, "id": 204478}, {"user_id": 15836, "stars": [], "topic_id": 7115, "date_created": 1298597098.3659489, "message": "I'm Lance from ActiveDen.net. I'm really sad that I can't make it this year, but I'll be watching the live stream. Last year was awesome!", "group_id": 4419, "id": 204790}, {"user_id": 223, "stars": [], "topic_id": 7115, "date_created": 1298597743.9215519, "message": "@Lance_ActiveDen You'll be missed!", "group_id": 4419, "id": 204880}, {"user_id": 15788, "stars": [], "topic_id": 7115, "date_created": 1298611607.6169591, "message": "@Lance_ActiveDen :( Sorry you can't make it but THANKS for everything!", "group_id": 4419, "id": 206076}, {"user_id": 15889, "stars": [], "topic_id": 7115, "date_created": 1298614974.2038291, "message": "I am Anand Jha, C.E.O of Nilee Games. NILEE GAMES is an online gaming  company focused on cutting-edge technology and aimed at mass-market game development.  NILEE GAMES designs, hosts, and licenses gaming software for companies looking for an innovative and fun approach to brand building.  Our development studio is based in Mumbai, INDIA. Our Operations & Networking are being conduct from UK, DUBAI and INDIA.", "group_id": 4419, "id": 206347}, {"user_id": 15697, "stars": [], "topic_id": 7115, "date_created": 1298635542.7231181, "message": "@Lance_ActiveDen it's too bad you can't make it!", "group_id": 4419, "id": 207336}, {"user_id": 15707, "stars": [], "topic_id": 7115, "date_created": 1298654242.3672869, "message": "Myself Vishwas Gagrani, I am an actionscript developer, from India, New Delhi, having a total 4 yrs of experience into flash development. I have 3 yrs experience into game development, and have expertised in building multiplayer games with AS3.0, AS2.0, PHP and Smartfox server", "group_id": 4419, "id": 209739}]