[{"user_id": 41709, "stars": [{"date_created": 1319325334.6917861, "user_id": 41709}], "topic_id": 46601, "date_created": 1318803443.19168, "message": "Also, I wanna see that wahrk fall down the fissure!", "group_id": 11772, "id": 2363118}, {"user_id": 41709, "stars": [{"date_created": 1319325354.336329, "user_id": 41709}], "topic_id": 46601, "date_created": 1318726447.2606189, "message": "What are your ideas for what the Star Fissure, and for that matter, the whole end sequence will look like? Will we be able to see things collapse in the background? Will we be able to look around as we fall into the fissure? Will we be able to see those clouds of darkness gehn described moving in real time?", "group_id": 11772, "id": 2357696}, {"user_id": 41763, "stars": [], "topic_id": 46601, "date_created": 1318751003.1372161, "message": "Cool ideas. I don't see why we wouldn't be able to look around as we fall (that wouldn't take any extra effort). Having things collapse would be cool.", "group_id": 11772, "id": 2359470}, {"user_id": 41763, "stars": [], "topic_id": 46601, "date_created": 1318751071.319741, "message": "I always wanted to go and explore the other islands during the final part of the game, but you can't -- Catherine rips out the linking pages to all the other islands and disables all of the other ways you could get there (retracts the drawbridge to crater island, somehow locks the maglev to Jungle Island).", "group_id": 11772, "id": 2359475}, {"user_id": 41720, "stars": [], "topic_id": 46601, "date_created": 1318781499.452764, "message": "Maybe in the enhanced version you wouldn't be automatically forced into the fissure at the end and you could continue to look around until you jumped in.", "group_id": 11772, "id": 2361160}, {"user_id": 41851, "stars": [], "topic_id": 46601, "date_created": 1318781844.3465581, "message": "I personally don't think you should be able to explore after the ending, seems a little pointless and of course you would have to retcon Catherine disabling all of you ways out. I guess you should be able to look around durring the actual ending but have your position locked, as it would be weird to walk off as all this drama is happening between Atrus and Catherine (and I guess Ghen if you get that ending). As a 3d artist, I am curious about how this is going to be handled from a technical perspective. Looking forward to seeing it :) .", "group_id": 11772, "id": 2361191}, {"user_id": 41709, "stars": [{"date_created": 1319325336.043241, "user_id": 41709}], "topic_id": 46601, "date_created": 1318803414.257488, "message": "Of course, it would be kind of neat to be able to walk around after atrus and catherine link away, because all you have to do is back up so you don't \"fall\" in. But eventually, the age would collapse and you'd die so there would have to some way of \"forcing\" you into the fissure.", "group_id": 11772, "id": 2363115}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318867105.262579, "message": "Then of course we realized that that would mean animating the entire age collapsing :P", "group_id": 11772, "id": 2368816}, {"user_id": 41763, "stars": [], "topic_id": 46601, "date_created": 1318858788.3927629, "message": "Well it could be the case that if you stay on the ledge, you fall in, but if you walk off, you don't. Then you can just wander around for awhile before the whole Age collapses and you die :) Note that I'm not serious here; I realise that 59V has enough to do without adding new endings to the game. Just having fun.", "group_id": 11772, "id": 2368075}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318867144.994194, "message": "Still, it would be cool to have all of TISL collapse, we could have contests to see who could get the farthest from the fissure before they're killed in the collapse :D", "group_id": 11772, "id": 2368820}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318867212.100656, "message": "Then again, you do need to end up in the fissure in the end - perhaps instead of being killed in the collapse you're simply sucked back to the fissure and fall in. :-\\", "group_id": 11772, "id": 2368833}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318867088.725708, "message": "Personally, and don't take it for anything but the sick imaginings of an obsessed fan, I would absolutely love to be able to explore the islands as they collapse. It was one of the first things that tempted us to make the game in Uru, the idea of collapsing Riven while people were still on other islands. The Wahrk observation room window shattering, flooding that cave with water, etc...the village collapsing, earthquakes, boiling lakes, etc etc.", "group_id": 11772, "id": 2368814}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318867261.6222479, "message": "I also realize this is basically what Ahlisendar said above :P This is what happens when I ramble.", "group_id": 11772, "id": 2368842}, {"user_id": 41710, "stars": [], "topic_id": 46601, "date_created": 1318871674.295038, "message": "Changes to the ending will likely be minimal. Player view will likely be locked as it was in the original, starting with the jump into the fissure. The camera angles are important in the ending for the feeling of finality and catharsis towards the fissure, seeing it from the same angle as the beginning of Myst.", "group_id": 11772, "id": 2369189}, {"user_id": 41723, "stars": [{"date_created": 1318919530.6472869, "user_id": 41763}], "topic_id": 46601, "date_created": 1318872393.3263559, "message": "You could always have everything locked in Purist mode but more free in others.", "group_id": 11772, "id": 2369233}, {"user_id": 41709, "stars": [{"date_created": 1319325329.7727051, "user_id": 41709}], "topic_id": 46601, "date_created": 1318893975.306608, "message": "Yeah! It would be so boring if you couldn't see stuff collapse! But can you at least do something like show the maglev cords collapsing in the background while Atrus talks? I think it would really help the scene in showing the finality and the imminent destruction. What about trees falling down on village island?", "group_id": 11772, "id": 2371723}, {"user_id": 41710, "stars": [], "topic_id": 46601, "date_created": 1318901375.686506, "message": "Freeing up camera motion after the player jumps into the fissure seems a bad idea stylistically though. It would be a detriment to the experience.", "group_id": 11772, "id": 2372541}, {"user_id": 41710, "stars": [], "topic_id": 46601, "date_created": 1318901319.463639, "message": "Logical destruction visible from the fissure area makes sense, there's no reason not to include that.", "group_id": 11772, "id": 2372537}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318914346.5471909, "message": "I would tend to lean towards what Marein said though, if you have Purist on, you're locked, otherwise you can move around. Staying still for a few seconds would lead to you falling in. Just an idea.", "group_id": 11772, "id": 2374170}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318915662.8020561, "message": "Same as K'veer, pretty much, right?", "group_id": 11772, "id": 2374274}, {"user_id": 41710, "stars": [{"date_created": 1318982998.4393511, "user_id": 38225}, {"date_created": 1319000653.988451, "user_id": 41724}], "topic_id": 46601, "date_created": 1318945343.9759209, "message": "Well, additions to the game should be intended to make the game *better*. Allowing movement there would be freedom for freedom's sake. Remember we're making a game, not a Riven simulation. At times, the player *must* be forced to do something in a certain way. Let me reiterate, we're making a real game, not a simulation of Riven. As a real game, it will have new players who will easily get lost in our endless freedom and miss the actual story of the game. Besides that, the action of the player in the original was grounded in logic, as it should be in our game. The stranger would be insane to actually *not* jump in as the age is collapsing.", "group_id": 11772, "id": 2376000}, {"user_id": 7523, "stars": [], "topic_id": 46601, "date_created": 1318950820.739902, "message": "@Everett_G idk man, that jump/fall always seemed pretty terrifying to me. Still, I can see your point. We'll discuss more at the meeting.", "group_id": 11772, "id": 2376727}, {"user_id": 41709, "stars": [{"date_created": 1319325325.7835059, "user_id": 41709}], "topic_id": 46601, "date_created": 1318985817.5254431, "message": "@Everett_G Well, I still don't see what's wrong with freeing up the camera just before you fall into the fissure, locked spot all the same, just so you can take a look around at the destruction.", "group_id": 11772, "id": 2381449}, {"user_id": 41709, "stars": [{"date_created": 1319325322.6475229, "user_id": 41709}], "topic_id": 46601, "date_created": 1318985915.954618, "message": "Or, you could just build on the original camera movement, like in myst 3 when saavedro enters and the camera swings around naturally, so you could move the camera so you just see a quick little glimpse of some of the other damage before looking back at the fissure.", "group_id": 11772, "id": 2381459}, {"user_id": 41723, "stars": [], "topic_id": 46601, "date_created": 1318987391.0397511, "message": "If the camera is free during the fall, it might even be made so that Atrus only starts his final speech after/when the player has looked back 'up' at the fissure. That way the experience is still much the same but also in the hands of the player. (this would be only in non-Purist modes, of course)", "group_id": 11772, "id": 2381580}, {"user_id": 41710, "stars": [], "topic_id": 46601, "date_created": 1318994023.4754429, "message": "@Ahlisendar I'm not against free camera movement before the player, jumps in, but as he's jumping, and during Atrus' speech, I'd think camera freedom would damage the feeling of the ending.", "group_id": 11772, "id": 2382194}, {"user_id": 41763, "stars": [], "topic_id": 46601, "date_created": 1319008924.658886, "message": "Can I just point out when I asked for actors instead of CG models, I was told by @Shimmey \"This means that even though we've been creating expansive real-time environments, the player will be forced to look at the world through the same slide-show format as the original for most of the pivotal scenes in the game. It just seems like a waste.\" And now you want to lock the camera when there is no need?\n\nI think you aren't giving the player too much credit. Games often let the player point or even move wherever they want and it doesn't detract from the cinematic experience. Take Myst IV -- nearly all of the dialogue scenes allow you to pan the camera around wherever you want. Or Half-Life 2 -- the player is _never_ frozen in position, and able to freely walk around the room while other characters are talking to them. Surely it would be acceptable to have the player fall into the fissure and direct the camera upwards, yet allow the player to move it around after that.\n\nAlso: It wouldn't make sense to delay the voice-over until the player looks up. Then it would be completely out-of-time with the music.", "group_id": 11772, "id": 2383363}, {"user_id": 41723, "stars": [], "topic_id": 46601, "date_created": 1319016227.3974099, "message": "You might possibly do some trickery with the music as well. I'm not sure if it would work out though.", "group_id": 11772, "id": 2383716}, {"user_id": 38225, "stars": [], "topic_id": 46601, "date_created": 1319016662.1778829, "message": "I just want to point out that unless stated otherwise the opinions expressed on this forum by SE team members are the opinions of the individual, not the team as a whole. We're allowed to have different views on how things should play out.", "group_id": 11772, "id": 2383731}, {"user_id": 38225, "stars": [], "topic_id": 46601, "date_created": 1319017254.0189049, "message": "I think you'll find that in most examples of good cinematic moments in games that give you freedom to move around the designer actually has a huge degree of control over the player. It's all about the illusion of free choice - Half Life 2 is an excellent example. In all cinematic sections it may feel you have the freedom to go anywhere and look at anything - but the designers have locked you in to a certain small area, and the game will not progress unless you do what it wants you to do.\n\nWhen it comes to the Star Fissure - I think limiting the players ability to move (to an extent) during the ending cinematic is necessary to eventually force them into the fissure. After all, the idea to jump into a gaping black crack in the fabric of the world might not be the best idea to many new players who might become confused given the freedom to wander off. I see no problem with allowing the player to free look throughout the entire ending, including the fall into the star fissure. If the cameras natural direction as they fall is to look at the fissure, then players will naturally look there and it will be a conscious decision to look elsewhere.", "group_id": 11772, "id": 2383760}, {"user_id": 41723, "stars": [], "topic_id": 46601, "date_created": 1319027073.2760839, "message": "What do you mean by 'the camera's natural direction'?", "group_id": 11772, "id": 2384159}, {"user_id": 38225, "stars": [], "topic_id": 46601, "date_created": 1319027606.5382941, "message": "@Marein Imagine you jump into the fissure. If you do not move the mouse, the camera will automatically orient itself to match what you see in the original, falling down and then looking back. However, this time the player can choose to look elsewhere if they wish. Let go of the mouse and the view will slowly reorient back. They use similar techniques in Revelation to force you into looking where they want you to, but giving you the chance to override the automatic movement if you wish. It's a solution worth considering I think.", "group_id": 11772, "id": 2384189}, {"user_id": 41723, "stars": [], "topic_id": 46601, "date_created": 1319029305.493048, "message": "I'm not sure how exactly it would be implemented (for example, the game can't know that you let go of the mouse) but conceptually that sounds like it might be a good solution :)", "group_id": 11772, "id": 2384312}, {"user_id": 38225, "stars": [], "topic_id": 46601, "date_created": 1319029475.0531261, "message": "@Marein 'Letting go of the mouse' wasn't the best way of putting it, what I mean is that the view will always slowly reorient itself back to the fissure, unless player input overrides it.", "group_id": 11772, "id": 2384321}, {"user_id": 41710, "stars": [], "topic_id": 46601, "date_created": 1319041124.8230841, "message": "\"Half-Life 2 -- the player is _never_ frozen in position\" Remember in Episode 2's ending, after [someone] dies, the player is left frozen as the camera slowly zooms into the body, with Alyx crying? Imagine how much the feeling of that ending would be diminished if the game left you free to walk around and break boxes with the crowbar. I'm not suggesting we lock cameras for all the cutscenes, but the ending is a special case stylistically, as it was in Episode 2.", "group_id": 11772, "id": 2385398}, {"user_id": 41709, "stars": [{"date_created": 1319325314.034642, "user_id": 41709}], "topic_id": 46601, "date_created": 1319067975.912652, "message": "Actually, I think it would be best if there was an option called \"lock camera in cutscenes\" or something, so the default would be like the original, but you could still unlock it to look around or something.", "group_id": 11772, "id": 2388137}, {"user_id": 41724, "stars": [{"date_created": 1319090824.587904, "user_id": 38225}, {"date_created": 1319107916.2553401, "user_id": 41723}, {"date_created": 1319123532.942003, "user_id": 7523}], "topic_id": 46601, "date_created": 1319090701.083982, "message": "To summarise: there is 'Purist Mode', which we plan to implement to make sure Player gets the exact same experience as in the original (but higher res, and CG actors). There are some great examples for us out there that show how we can handle more freedom for Player, as will be implemented in the planned Non-Purist mode/modi. Half Life 2 has been discussed both here and internally, as well as Ico/SOTC. Both show their own ways to make hybrids between Player's freedom of movement and Director's influence on cinematics, effects, drama and story telling. We will surely tap into that experience and come with out own way, which will suit the type of game Riven is. Remember it's still the same game we're making. Adding super cool effects 'because it's cool, man' is not the way to go for anyone (re-)making Riven to ensure the best result possible.", "group_id": 11772, "id": 2390350}, {"user_id": 41709, "stars": [{"date_created": 1319325308.7245729, "user_id": 41709}], "topic_id": 46601, "date_created": 1319151766.622474, "message": "@RivenRevisitor you were quoting Robyn Miller just there, weren't you?", "group_id": 11772, "id": 2395843}, {"user_id": 41763, "stars": [], "topic_id": 46601, "date_created": 1319150800.7332499, "message": "I just meant being able to look around while falling, which is the same freedom as most of Myst IV and less freedom than Half-Life 2. I agree that being able to walk around during the ending wouldn't make much sense.", "group_id": 11772, "id": 2395633}, {"user_id": 41724, "stars": [{"date_created": 1319473511.585912, "user_id": 41709}], "topic_id": 46601, "date_created": 1319187196.3210211, "message": "@Ahlisendar I had to dust it off, but after doing so I found it quite useful there, yes ;-)", "group_id": 11772, "id": 2398961}]