[{"user_id": 13109, "stars": [], "topic_id": 47950, "date_created": 1321669814.1850891, "message": "BEWARE - SPOILERS BELOW:\n\nI watched Ides of March 2 weeks ago and thoroughly enjoyed it.  I thought it was a wonderful example of Overall Story being in Manipulation (I might be wrong but that is where it felt like it sat for me).\n\nIn trying to tease apart the storyform and I got thinking about the Impact Characters (I feel there are a few handoffs in this film).  I was trying to work out which had the most impact on the MC to change.\n\nI believe the MC was Change, and Judgement was Bad - but happy to discuss if anyone else has seen the film", "group_id": 2515, "id": 2598269}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1321672390.1214731, "message": "I think the movie has an incomplete storyform. But most of the problems did seem to come from Manipulation, so that's where I'd put the OS, too.", "group_id": 2515, "id": 2598453}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1321672422.152647, "message": "For starters, where would you put the SS?", "group_id": 2515, "id": 2598456}, {"user_id": 13109, "stars": [], "topic_id": 47950, "date_created": 1321787197.9102299, "message": "I think I agree with you regarding it being incomplete. Finding the SS is quite difficult as nailing down the relationship story means we need to define who is the IC. Not an easy task as I felt there were multiple handoffs.\n\nI would like to put up 4 contenders for IC\n\nGeorge Clooney\t ...\tGovernor Mike Morris\nPhilip Seymour Hoffman\t ...\tPaul Zara\nPaul Giamatti\t ...\tTom Duffy\nEvan Rachel Wood\t ...\tMolly Stearns\n\nWhich brings up another question.\n\nIn working out which is the main relationship story - or if it is a true handoff - do we look for the change in the main character (as the MC is Change in this case) and see if any of the contenders hold the opposing view?\n\nI see Stephen Meyers (Ryan Gosling) as holding to an idealistic worldview - (which I would put in the Fixed Attitude Quad).  It seems as if everyone listed above seems to be opposed to that stance in some way.  Probably the most evident in Paul Giamatti's character - someone who is near burn-out - and happy to do anything to get his candidate to win.\n\nGot to run to work...will have to continue tomorrow", "group_id": 2515, "id": 2606361}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1322075630.7748041, "message": "I was asking my question rhetorically, because I don't think there is an SS. \n\nBut, perhaps I give up too easily, and there are a bunch of hand-offs that make me miss it.", "group_id": 2515, "id": 2625946}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1322075858.2794731, "message": "You ask a good question about how to pin down an IC, though. \nI wonder if the place to look is first to the Domain. Mike Morris is in a Situation: he has impregnated a girl. And that puts Stephen Meyers on the horns of a dilemma: stick with his ideals or stick with his man.\n\nSo, the question I ask then is, who influences that decision the most?\n\nIt doesn't always yield the right answer, but it gets me thinking.\n\nIn this case, I think it's Duffy (I didn't expect to say that!) because he is ruthlessly cruel. And then Zara is equally ruthless.\n\nIronically, this takes Meyers out of his ruthless idealism into ruthlessness.", "group_id": 2515, "id": 2625963}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1322077768.5690291, "message": "The other way to start sussing out the IC is to look at where the SS Domain is (Activity) and ask, \"Who's doing stuff?\"", "group_id": 2515, "id": 2626089}, {"user_id": 13109, "stars": [], "topic_id": 47950, "date_created": 1322140863.4060249, "message": "@MikeDerk - interesting points.  If there is an IC (or group of IC) then I think that there are multiple handoffs.  I think that is one of the reasons that this movie feels so cold (other than the content) -- there is no core relationship that grows and develops.  No real relationship -- no heart.\n\nDuffy for me is the one that pushes Meyers over the edge.  It is only in that final meeting with Duffy that outlines how ruthless you must be to succeed in politics, and how Meyers is so screwed up because of his values that something must give.  Hence the character change.  But I don't think that Duffy is the only one that shows Meyers the other side of the coin.  As you mentioned, Zara is equally ruthless - and willing to play the system to get her ends.\n\nI was trying to work out the other quads - and I think I might have got as far as you did before I hit the brick wall.  If the OS is Manipulation, that would put the SS into Activity.  Quite difficult if there is no really well defined I.C.  The relationship story then needs to be based around all the handoffs (if I am correct in thinking there are multiple I.C.s)\n\nThe activity that Meyers and Duffy, Meyers and Zara, Meyers and Morris are working around is based around the U.S. Primaries... (I'm from Aus so the U.S. Electoral System is a mystery to me...).", "group_id": 2515, "id": 2630348}, {"user_id": 13109, "stars": [], "topic_id": 47950, "date_created": 1322141406.9386871, "message": "I guess you could also argue that the MC throughline is Activity as well; though I would be more inclined to put the MC throughline into Fixed Attitude (Holding onto his Ideals).\n\nAs you mentioned, Meyers is in Situation - I guess as is Zara (she is pregnant), as is Duffy (he is in a campaign which he, and everyone else knows he is losing).  Maybe I am stretching the last point a little too much.\n\nI guess what is clouding the issue is that while everyone is doing stuff regarding the election so it feels like O.S. is in Activity - but at the same time - everyone could be the I.C. as there are so many handoffs.  Which could make the S.S. Activity.", "group_id": 2515, "id": 2630362}, {"user_id": 7664, "stars": [], "topic_id": 47950, "date_created": 1322548746.032985, "message": "The only thing about the OS in Activity is that the problems don't come from the activities, they come from manipulations.\n\nI think I have that right: that the \"setting\" of the OS isn't as relevant as the root of the problems in the OS.", "group_id": 2515, "id": 2663917}, {"user_id": 13109, "stars": [], "topic_id": 47950, "date_created": 1323392313.7745061, "message": "@mikederk I think you have it right.  That is my understanding of it as well.  Sorry for the tardiness in replying- just moved house last week so my head has been in boxes for the last fortnight or so.", "group_id": 2515, "id": 2726104}]