[{"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310155358.736414, "message": "I am sure everyone here has experience interviewing for an iOS position. What typical questions do they ask to developers? Do they still ask the regular technical data structure & algorithm question and you can solve it in any language? or...", "group_id": 427, "id": 1595664}, {"user_id": 4253, "stars": [], "topic_id": 41488, "date_created": 1310155665.3831289, "message": "I usually ask: What's the importance of a delegate (shows their knowledge of the language), then I ask them to map out how they'd solve a problem (solutions architecture), then it's all about fit.", "group_id": 427, "id": 1595699}, {"user_id": 15978, "stars": [], "topic_id": 41488, "date_created": 1310157361.5167201, "message": "Depends on the type of position you're recruiting for. eg. for a junior, memory management knowledge is a must whilst for a senior, why and how to implement multiple core data managed object contexts.", "group_id": 427, "id": 1595850}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310161860.8174491, "message": "When I'm interviewing somebody, the questions I am looking to answer about a candidate are: Can I give a brief to this person and have them go off and implement it without help?  Will the code be maintainable and ready to put into production?  Do they understand what is going on or are they just doing it by rote?", "group_id": 427, "id": 1596304}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163616.9460881, "message": "I don't rate generic data structure / algorithm questions when interviewing. Seems like something larger companies without platform-specific knowledge rely on.", "group_id": 427, "id": 1596457}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310163478.6351149, "message": "my biggest concern with iOS interview, is whether I should be prepared to solve ridiculous programming puzzle in other language than objective-C... or will I only be tested around the topic of iOS and Cocoa only... I've never applied to a position of an iOS dev's so looking for insights here based on your experience", "group_id": 427, "id": 1596446}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163563.760221, "message": "The way I establish this is by asking questions such as: Have they internalised NARC? Can they manage a clean view controller hierarchy, or do they just throw views around a single view controller? Can they separate out functionality into separate components, or do they just stick everything into view controllers and the app delegate? Can they write code that can be re-used across several projects? Can they cope with asynchronous networking? Can they distribute builds to clients and the App Store? Can they debug things? Do they understand how nibs interact with an app? Do they understand delegates and blocks? Do they understand Core Data and plists?", "group_id": 427, "id": 1596450}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163572.6041739, "message": "Also, I need to see sample code. If they don't have any, I have a project brief for a small app I ask them to complete that covers as much of the above as possible without being unreasonable to ask them to do.", "group_id": 427, "id": 1596451}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163750.523124, "message": "But when I am interviewing somebody, I don't see the point in puzzles in other languages.  You can figure somebody out just as easily with practical, platform-specific questions.", "group_id": 427, "id": 1596466}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163547.293046, "message": "Okay, apparently Convore ate my previous comments, trying again...", "group_id": 427, "id": 1596449}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163585.214325, "message": "I don't expect intermediate iOS developers to know everything about the platform and its frameworks. It's okay to miss things from the above as long as you demonstrate that you are capable in general. For instance, several candidates with commercial iOS experience submitted sample projects that showed they didn't understand table views and didn't read the documentation to compensate. They didn't get offers. One candidate with no commercial iOS experience got this right first time, along with several other areas they had no prior knowledge of, simply because they were smart and thorough. That person got the job. The difference is that I couldn't trust the ones who got it wrong to produce quality work without me cleaning up after them, while the one that got it right - although my guidance will be useful occasionally - will quickly improve and won't produce substandard work.", "group_id": 427, "id": 1596453}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310163693.3830709, "message": "My experience on the other end of the interview is one where there has been very little in-house iOS knowledge, so Cocoa-specific questions weren't available.  It was solely based on what I'd achieved in terms of projects completed, etc.", "group_id": 427, "id": 1596464}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310163799.8977289, "message": "@Jim so possibly for a startup looking for iOS dev's they won't be (although they might) asking data structure/algo's question? I am preparing my self for acing interviews for iOS dev's... and is confused whether I should focus on studying cocoa and iOS only or study data structure/algo's... I know everyone would say do both, but I'd like to focus", "group_id": 427, "id": 1596468}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310163887.5289299, "message": "I've been trying to research on iOS dev interview experience all over Quora and HN, but came without no results so thought I would ask here", "group_id": 427, "id": 1596474}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310164119.522404, "message": "@Jim I do have a small project ready to show... and I am tweaking it everyday to learn new cocoa/iOS stuffs everyday, for example I am adding core data feature to it and adding a new framework on top.. I just thought this is not enough", "group_id": 427, "id": 1596493}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310164026.862354, "message": "@equinox I'd say it depends on how much in-house iOS knowledge they have.  Tricky one to answer because it depends so much on the personalities involved.  If possible, I'd have a small project ready to show them that corresponds to their business in some way.  Showing that you can produce results is important when you won't be interviewed by an iOS developer.", "group_id": 427, "id": 1596484}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310165061.8872011, "message": "@equinox If the project is of interest to other iOS developers, it might be worth putting it up on GitHub as an open-source project.  That quickly teaches you things about collaboration and quality that is difficult to otherwise pick up.", "group_id": 427, "id": 1596547}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310165169.486388, "message": "@Jim thanks for all of your suggestions... will consider all of that.. also some job posting that I've seen said that it's a plus to have experience with scripting language such as rails/python.. makes me want to study rails...but then I would lose focus on iOS.. difficult choice", "group_id": 427, "id": 1596558}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310166097.782953, "message": "@equinox Wider experience is always a plus - a *lot* of iOS projects involve talking to a website, so web development experience comes in handy.  However it's a huge field with competing development platforms, so learning for the sake of interviews is a big investment with little chance of return.  I'd express an interest in learning to interviewers and use the \"do you have any questions?\" part of the interview to ask if there's any opportunity for in-house training.  If you're going for your first iOS job, then concentrate on iOS, you can diversify later in your career.  Good luck with the job hunt!", "group_id": 427, "id": 1596614}, {"user_id": 1379, "stars": [], "topic_id": 41488, "date_created": 1310164979.5994411, "message": "@equinox That's a great attitude and would certainly make a difference to any sane interviewer.  If you've already got that in place, then I'd say fill in the biggest blanks in general compsci knowledge, but don't devote a disproportionate amount of time to it.  It's hard for me to judge though, general compsci knowledge doesn't seem to be a big deal in interviews I've had, it's always been hands-on.  I'm thinking it's a US/UK cultural difference.", "group_id": 427, "id": 1596536}, {"user_id": 2597, "stars": [], "topic_id": 41488, "date_created": 1310166476.208791, "message": "@Jim thanks for the tips, will focus on iOS for now", "group_id": 427, "id": 1596628}]