[{"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301824687.3084691, "message": "$40k just to stay 6 months in Chile, then you can leave. They don't ask anything in return. They're trying to push the Chilean entrepreneurship.", "group_id": 250, "id": 513648}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301824699.4816401, "message": "www.startupchile.org", "group_id": 250, "id": 513649}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301824852.2551999, "message": "We're Italian. So, in your opinion, it's best to stay there 'cause in any case is not our target market, or move there, and work to have the resources to move next to US?", "group_id": 250, "id": 513654}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301824784.308589, "message": "But our target is USA market, we want to move to the Bay area, but we don't have resources to do it. I'm asking my self. Can be good be in Startup Chile program, to take mentorship, money to bootstrap, networking and try to raise capital to move to the US after it?", "group_id": 250, "id": 513653}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301825828.8705859, "message": "Location is so important for a startup, and there are very few shades of gray (SV -> NYC,LA,Seattle,London -> Rest of the world). If you can't go to the SV now then better stay in Italy. Mentoring, with the exception of a few (y-combinator,..) is way overrated, and I doubt that you will be able to do any meaningful networking in Chile, unless you want to go into more traditional industries, so in the end it comes down to the money and terms offered and the time lost (both the moving and the distractions of a new country).", "group_id": 250, "id": 513697}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301837762.137805, "message": "I would argue against that logic, (if and only if) you are already a seasoned entrepreneur / think you know how it's done.", "group_id": 250, "id": 514819}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301838001.9652441, "message": "I guess all I'm saying is: it could make sense if you are laser focused and have already decided what is it that you are building, which sound like you have, if you are thinking in pitching the Chilean government.", "group_id": 250, "id": 514833}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301836611.7909601, "message": "@martin_sunset I understand your point of view. The \"waste\" of time can be really counter productive. We have to face if there are other ways to reach the bay area.", "group_id": 250, "id": 514683}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301837803.9559629, "message": "There is is a lot to be said about access to cheap human resources and the cash to bootstrap an MVP and do due diligence on your idea is not bad either, even from Chile.", "group_id": 250, "id": 514820}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301837825.2167571, "message": "That said, and having lived in South America for over three years, the experience of starting a business down there is not interchangeable with the US.", "group_id": 250, "id": 514824}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301839719.1202991, "message": "My point exactly...taking the $40K and testing out the idea with other people's money is never a bad idea. And no strings attached is even better.", "group_id": 250, "id": 514973}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301839636.606818, "message": "We really really want to move directly to US", "group_id": 250, "id": 514963}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301840082.843039, "message": "@nmelo I know, I'm following it really closer, 'cause this is another obstacle we have to face. But we're at a step before. Reach US :P", "group_id": 250, "id": 515014}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301839663.3727009, "message": "but we don't know how. We're two young startuppers with no money...", "group_id": 250, "id": 514970}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301839627.6921549, "message": "Yes, we're getting feedback with our MVP from some weeks and it seems working. But we need time to start monetize and enlarge the user base.", "group_id": 250, "id": 514962}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301840537.662122, "message": "= tourist visa", "group_id": 250, "id": 515054}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301839965.122541, "message": "Folks in the Valley are really rooting for something called Startup Visa: This post by @bfeld might be relevant to you: http://www.feld.com/wp/archives/2011/03/starting-up-in-america.html", "group_id": 250, "id": 515002}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301839755.82111, "message": "@nmelo Agree", "group_id": 250, "id": 514976}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301840413.354073, "message": "@ccarnino have you considered an e2  visa? That worked for me. Only downside is that you need to find investors in your own country of residence and that it needs to be substantial (e.g. 100k or more)", "group_id": 250, "id": 515043}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301840473.692318, "message": "also you might want to think about doing the AirBnb thing for 3 months.", "group_id": 250, "id": 515047}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301841675.882777, "message": "I've considerated take the tourist visa and try to there, but the problem is the same. We have no money to afford that. We can cover the travel, then we've run out of money...", "group_id": 250, "id": 515198}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301841747.1585259, "message": "We're 2 startuppers that has quitted the university to run their first startup (HiNii.com) but we've failed. Now we're trying with our second product, so the money we've earned by little works, cover just the server expenses and little investments... No more", "group_id": 250, "id": 515206}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301843223.1055269, "message": "Yes you're right. Focus on the right objective, leave out the noise. The traction is the first key in any kind of investment.", "group_id": 250, "id": 515352}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301843440.4230139, "message": "I will give it a try next week, btw, add a like and tweet button to the front page (dunno if that is possible with launchrock.com)", "group_id": 250, "id": 515385}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301841619.2376571, "message": "In Italy the angels/investors invest in company that are working yet. It's really difficult get funded with a early stage product.", "group_id": 250, "id": 515180}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301843507.046973, "message": "Mmm, cool idea ;)", "group_id": 250, "id": 515397}, {"user_id": 26065, "stars": [], "topic_id": 16995, "date_created": 1301843055.8844171, "message": "yeah, I know the problem. The angel scene in Europe, maybe with the exception of London and some parts of Germany is a real joke. The best course of action is probably to launch the product, get as much traction as you can and get into one of the incubators. Avoid any and all distractions at this point and focus on the product. Once you got traction funding follows and you can move to the US more easily. The hard part is to get traction, especially now.", "group_id": 250, "id": 515319}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301843271.419471, "message": "We're organizing the Challengein nights yet. The first official is Tuesday.", "group_id": 250, "id": 515356}, {"user_id": 5136, "stars": [{"date_created": 1301848198.8834231, "user_id": 25716}], "topic_id": 16995, "date_created": 1301843327.9462919, "message": "PS: have you tried my product? http://challengein.com Use VBNVBN as invitation code. We're still iterating and improving it with the feedback of real users and Convore users ;)", "group_id": 250, "id": 515360}, {"user_id": 26065, "stars": [{"date_created": 1301850665.2490139, "user_id": 6812}], "topic_id": 16995, "date_created": 1301850386.834018, "message": "Hmm, actually I reconsidered and I think @arikfr is right, you should definitely apply (even if you don't go there in the end). There is one thing that is very beneficial that has not been mentioned, and that is that the Chile and the US are in the same timezone. That is a huge benefit when dealing with the US market.", "group_id": 250, "id": 515595}, {"user_id": 6812, "stars": [{"date_created": 1301850786.2954381, "user_id": 26065}], "topic_id": 16995, "date_created": 1301848020.7285719, "message": "@ccarnino I suggest you read this: http://www.shaharnechmad.com/2011/02/19/building-your-dreams-in-chile/ it's a blog post by someone who was at the pilot program of Startup Chille. If you like, send me an email to arik@arikfr.com and I will introduce you to Shahar (the guy who wrote this post).", "group_id": 250, "id": 515536}, {"user_id": 6812, "stars": [], "topic_id": 16995, "date_created": 1301848280.9288459, "message": "@ccarnino also, I think that if you have nothing that holds you in Italy and you don't have a way to go directly to the US, you should try to pursue the Chilean opportunity. It will give you some cash, introduce you to interesting people and bring you closer to the US. Going to a week or two at the valley from Chille will be probably easier than from Italy (specially when you have some cache in your pockets...)", "group_id": 250, "id": 515540}, {"user_id": 17865, "stars": [], "topic_id": 16995, "date_created": 1301849072.3682809, "message": "@arikfr Great post. Every fact about the city and the community is true. Keep in mind Argentina is a much more developed market though. Useful to keep in mind if you take the plunge and are looking to hire.", "group_id": 250, "id": 515566}, {"user_id": 6812, "stars": [], "topic_id": 16995, "date_created": 1301850708.691247, "message": "@nmelo I will keep that in mind if I ever get to the area :-)", "group_id": 250, "id": 515608}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301912739.333133, "message": "@arikfr We've talked yet with him ;)", "group_id": 250, "id": 522297}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301913579.4836681, "message": "@arikfr Sorry, I've been wrong. We've talked to an other guy in Startup Chile. I'll mail you about the Shahar contact. Tnx!", "group_id": 250, "id": 522358}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1301913780.653933, "message": "@martin_sunset I think it too", "group_id": 250, "id": 522376}, {"user_id": 26010, "stars": [], "topic_id": 16995, "date_created": 1302945088.1234021, "message": "New app launching soon in NYC looking for early adopters with digital content: http://igobubble.com/content", "group_id": 250, "id": 709978}, {"user_id": 5136, "stars": [], "topic_id": 16995, "date_created": 1302962091.0566111, "message": "@osama19 Hi. What kind of content do you accept? I think you don't support apps, right?", "group_id": 250, "id": 710652}, {"user_id": 23304, "stars": [], "topic_id": 16995, "date_created": 1303056818.4536021, "message": "Yes. Our group is coming to Chili next month to make connections between South American Startups and bay area startups", "group_id": 250, "id": 717345}, {"user_id": 9018, "stars": [], "topic_id": 16995, "date_created": 1303736049.3305309, "message": "Be aware if you do come to the USA about things like the Heart Taxation Act if you intend to stay for more than 8 years.\nI think countries trying to be more accomodating of \"brain resources\" will have to look at tax in order to encourage participation. The Chile program is just the beginning of many of these.", "group_id": 250, "id": 802944}, {"user_id": 18780, "stars": [], "topic_id": 16995, "date_created": 1303909051.1508341, "message": "I'm from Chile and I've been following the Startup Chile program. It's really cool, they actually are investing more $ (like 5x more) in foreign startups than chilean... that doesn't make sense to me since I'd like both to have the same opportunities, but it's definitely good for startups coming from anywhere else. You should apply!", "group_id": 250, "id": 825450}]