[{"user_id": 26569, "stars": [], "topic_id": 16259, "date_created": 1301500805.0580671, "message": "you probably should of thought of marketing before making the product", "group_id": 95, "id": 482550}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301500430.2497461, "message": "We've created http://challengein.com . Now my objective is to let people try it. After email my followers, my network, few blogs, how can I let the first 200 people try it?", "group_id": 95, "id": 482500}, {"user_id": 14049, "stars": [], "topic_id": 16259, "date_created": 1301500721.576968, "message": "I suppose since this is iphone app, you should be looking for apple app communities. I did not stay on the site more than 10 seconds just because I am an android user. tweet it into common hashtags maybe?", "group_id": 95, "id": 482537}, {"user_id": 26569, "stars": [], "topic_id": 16259, "date_created": 1301500591.0149961, "message": "stumble it", "group_id": 95, "id": 482513}, {"user_id": 26569, "stars": [], "topic_id": 16259, "date_created": 1301500592.7657189, "message": "digg it and reddit", "group_id": 95, "id": 482515}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301501180.4968591, "message": "We've launchrock launching soon page, we tweet with our personal and @challengein accounts, insiders news about the project", "group_id": 95, "id": 482622}, {"user_id": 26569, "stars": [], "topic_id": 16259, "date_created": 1301501230.0988719, "message": "how many times have you digged it? its important to get some big accounts to dig it", "group_id": 95, "id": 482632}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301501130.251615, "message": "We've digged it, talked with ios communities, delicious, etc. We've build different viral keys directly into the product. We've studied Dropbox and Zynga. We bring a better user experience to the users if they bring (very easy) into their matches, via Facebook integration.", "group_id": 95, "id": 482615}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301501611.2745471, "message": "I've digged it just 1 time, about 10 days ago. It's right to digg it more and more?", "group_id": 95, "id": 482719}, {"user_id": 17546, "stars": [], "topic_id": 16259, "date_created": 1301549626.599046, "message": "The first thing that comes to mind is the \"Request and invitation\" form adds an extra step to using your app, that might put people off. They might see the form and not even bother clicking through to the app store.", "group_id": 95, "id": 488689}, {"user_id": 17546, "stars": [], "topic_id": 16259, "date_created": 1301549542.6321621, "message": "Your site is a bit confusing, you have a email form to request early access, but also have an available in the app store badge. I'm assuming after downloading the app you need to log into an account, and you're only handing out accounts to the first 200 people?", "group_id": 95, "id": 488666}, {"user_id": 11647, "stars": [], "topic_id": 16259, "date_created": 1301556896.770113, "message": "Adwords?", "group_id": 95, "id": 489760}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301560484.1363659, "message": "The objective was the create buzz around the product and gifting invitations codes to blogs. But if it makes people leave the website without filling their email it's bad.\n\nNow I have to decide if:\n-remove the appstore link from the website, sending the link to who get early access\n-remove the private beta and go in public beta, without invitation\n\nMy objective is reach as soon as possible 500 users and get feedback from them. The best solution is the second, right?", "group_id": 95, "id": 490206}, {"user_id": 5136, "stars": [], "topic_id": 16259, "date_created": 1301571706.954586, "message": "You are right. We are removing the invitation code by the next week (app store delay) and adding a tour throw the product.", "group_id": 95, "id": 490808}, {"user_id": 24954, "stars": [], "topic_id": 16259, "date_created": 1301555541.0810561, "message": "I tried to download it through the app store, but it didn't work - tried on both my iPhone and in iTunes.  I think you should re-visit some of the copy on your site - it doesn't really flow, sounds a bit stilted. I have no idea what this game is about after visiting the site.", "group_id": 95, "id": 489591}, {"user_id": 24954, "stars": [], "topic_id": 16259, "date_created": 1301555639.3791349, "message": "Agree with the comment about the the invitation process, too.", "group_id": 95, "id": 489598}, {"user_id": 24852, "stars": [], "topic_id": 16259, "date_created": 1301562520.58814, "message": "Make a list of your targeted bloggers and reach them. Email them in an authentic way. Tell them why you product benefits their life's. Offer them exclusive tests, rights or whatever you can offer other then ordinary users. Get out of your known network, reach for the top, best source providers. For your site, provide more info, screenshots. Tell them whats core fun in it. ", "group_id": 95, "id": 490412}, {"user_id": 779, "stars": [], "topic_id": 16259, "date_created": 1302030051.2237489, "message": "Make a list of likely Bars they go to. Hang out around these Bars, Twitter/GoWall/FourSquare search your GeoCords until you spot them in the Area. Is it stalking, yes, but at least you can quickly meet them and do a 30 second Pitch. But I think in all fairness you should respect their privacy and politely ask if you can quickly bother them. And do keep your Pitch to 30 seconds (Hollywood Pitch style is very handy)", "group_id": 95, "id": 544763}]