[{"user_id": 3315, "stars": [], "topic_id": 15142, "date_created": 1301024170.499372, "message": "Just curious if anyone else out there is into music games.  Been playing machine dance games (DDR, ITG, Pump) for... damn, going on 9 years?  Generally try to make it to Waterpark of America to play Pump when I can, which hasn't been too often lately :x  However I've been playing plenty of Taiko no Tatsujin as of late (Namco of Japan, basically involves hitting a drum.  We used to have a cabinet at Mall of America until they moved it back in October ><; Had to import the Wii version).  Also started playing osu! again (dH_, kinda scrubby still).  What do you all play?", "group_id": 857, "id": 434955}, {"user_id": 3315, "stars": [], "topic_id": 15142, "date_created": 1301024260.9576831, "message": "(For the uninitiated, Taiko no Tatsujin: http://taikotime.blogspot.com/\nOsu!: http://www.osu.ppy.sh\nPump: DDR but with diagonal arrows and a center panel, and you'll see a lot more 10-panel play than you will ever see people playing doubles in DDR/ITG)", "group_id": 857, "id": 434975}, {"user_id": 4568, "stars": [], "topic_id": 15142, "date_created": 1301063275.3358541, "message": "I'm a big fan of DDR, I'm sort of hesitant with that dance game that uses the kinnect on the XBox, but I've never been a fan of guitar hero or rockband. I think it's because I actually play an instrument though and I know what I'm missing", "group_id": 857, "id": 438786}, {"user_id": 3740, "stars": [], "topic_id": 15142, "date_created": 1301167767.6684711, "message": "I'm a superb Guitar Hero/Rockband Guitar player, good singer, and decent drummer.  I <3 music games, but can't play them in the dorm cuz they are too loud and I dont have enough space...", "group_id": 857, "id": 447113}, {"user_id": 2941, "stars": [], "topic_id": 15142, "date_created": 1301265302.2848201, "message": "I like music games. Haven't played them much lately tho. Been a couple years since I played DDR. Maybe a year since I played GH. Can't afford Rock Band, but I've played it a few times. There was a drum game at an arcade I used to go to years ago that was pretty fun, not sure if it's the one you were talking about or diff tho.", "group_id": 857, "id": 453212}, {"user_id": 3315, "stars": [], "topic_id": 15142, "date_created": 1301283191.4867361, "message": "Probably not.  When the MoA arcade was under a different vendor (not Namco) they had a Percussion Masters cabinet, but it was kinda run down.  Only other ones I can think of were the Percussion Freaks cabinet that used to be at Burnsville Center (back in the Time Out days) and the one at Maplewood Mall.", "group_id": 857, "id": 454546}, {"user_id": 3315, "stars": [], "topic_id": 15142, "date_created": 1301283720.9192469, "message": "Yeah, I also don't play a lot of Rock Band/GH.  They just don't hold much lasting appeal beyond being drunken party games for a variety of reasons, tying themselves too much to \"rock bands\" and the rock genre being one of those.  There is only so much music in the grand scheme of things that actually have a guitar, bass, drums, and vocalist.  Restricting a game to using *only* songs with those parts puts a serious limit on the variety of the song lists, which makes the game get old pretty quickly.\n\nI could go on for hours 8D", "group_id": 857, "id": 454608}, {"user_id": 3074, "stars": [], "topic_id": 15142, "date_created": 1301319543.502352, "message": "I thoroughly enjoy playing music games, but it's probably because I actually play music.", "group_id": 857, "id": 457829}, {"user_id": 10293, "stars": [], "topic_id": 15142, "date_created": 1301365614.812443, "message": "Guitar Hero/Rock Band and DDR are all excellent. Great party games. I would say I am especially good at DDR, but that is only because not as many people I have met play it as much as GH/RB. Unfortunate about Guitar Hero's demise, though.", "group_id": 857, "id": 464400}, {"user_id": 2941, "stars": [], "topic_id": 15142, "date_created": 1301368200.3718209, "message": "Yeah, I was talking Maplewood Mall. Oh, I guess Audiosurf sorta fits with this too. I really like that one and I could play it for a long times. Damn games and their pretty colors, lol", "group_id": 857, "id": 464890}, {"user_id": 3315, "stars": [], "topic_id": 15142, "date_created": 1301430711.5805759, "message": "@Nax How good is especially good?  Just curious xD  To be honest though, kinda happy Guitar Hero is gone.  They milked that cow dry and then some.\n\n@Kaelix Audiosurf totally counts.  So trippy 8D", "group_id": 857, "id": 472191}]