[{"user_id": 18485, "stars": [], "topic_id": 35363, "date_created": 1305471271.3507431, "message": "Originally published: Thursday, August 27, 2009\n\nNational Health Plan\n\n1) Give all doctors and nurses full immunity from law suits.\n2) Suspend all income taxes for doctors and nurses.\n3) Get rid of all health insurance.\n4) Doctors and nurses will be rated for quality on various websites.\n5) All health care will be cash and carry.\n6) Those who can not pay and have no assets will turn to a national fund that will only disperse money direct to doctors or hospitals.\n7) Doctors will not need to fill out forms or deal with insurance companies in any way.\n\nThis system will encourage more students to become doctors. With more doctors there will be more supply of services and therefore competition and lower prices. Also, if people are paying out of pocket there will be less unnecessary care.\n\nThis plan should be able to be implemented in a short time frame and costs for care would drop fast!\n\nThe cost to the tax payer would be low and limited to the national fund that is used only for those who can not pay. Those who use the national fund may be required to pay the fund back if able at a later date.\n\nThink about the results if this plan was put in place: 1) More Doctors and therefore more supply of health care; 2) With more supply costs come down; 3) Fewer costs of operation for the doctors and therefore lower costs overall.\n\nYes, the Lawyers and insurance companies are out of luck and can no longer feed on health care but this means 100% of our health care dollars can actually go to care and not unneeded overhead.\n\nAlso see: http://frederickgopcom.blogspot.com/2009/08/national-health-plan.html\n", "group_id": 9235, "id": 1060199}, {"user_id": 18485, "stars": [], "topic_id": 35363, "date_created": 1305471429.446979, "message": "This was a response I published on facebook regarding an argument that my plan is extra-constitutional: \n\nJoshua, I would argue that the lawyers, the insurance companies and the government are operating outside the law and under the current system can be considered co-conspirators. Furthermore, this conspiracy is making it imposible for the citizens to pursue happiness and be healthy. In addition, I would argue that the founding fathers would never have stood for such a conspiracy and the unbridled greed and corruption that it promotes and sustains. As far as the free market my program would increase competition dramatically and therefore lower costs to the citizens. Care givers could still earn a good living and those purchasing their services would be free to shop around and buy the best care they could afford. Waste, theft, greed and the evil that defines our current health industry would be doomed.", "group_id": 9235, "id": 1060221}]